[
    {
        "title": "Charlie Kirk: Trump condemns 'heinous assassination' of conservative influencer",
        "description": "Donald Trump has said he is \"filled with grief and anger\" after the \"heinous assassination\" of right-wing influencer Charlie Kirk.",
        "url": "https://news.sky.com/story/powerful-right-wing-influencer-charlie-kirk-hit-after-shots-fired-at-an-event-in-utah-13428272",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-charlie-kirk_7016510.jpg?20250910210942",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-10 15:40:00",
        "Headline": "Mr Kirk and his Turning Point USA organisation played a key role in driving youth support for Donald Trump in last November's presidential election.",
        "Content": " Donald Trump has said he is \"filled with grief and anger\" after the \"heinous assassination\" of right-wing influencer Charlie Kirk. Mr Kirk, a staunch ally of the US president, was shot dead at a university event in Utah on Wednesday afternoon. Mr Trump announced the death of the 31-year-old conservative on social media, hailing him as a \"great, and even legendary\" figure who was \"loved and admired by all, especially me\". In a later address from the Oval Office the president said: \"I am filled with grief and anger at the heinous assassination of Charlie Kirk. \"He inspired millions and tonight all who knew him and loved him are united in shock and horror.\" \"This is a dark moment for America,\" Mr Trump added, as he vowed a crackdown on \"political violence\". The video message from the White House came after FBI director Kash Patel said a person arrested over the shooting at Utah Valley University had been released after \"interrogation by law enforcement\". Utah Governor Spencer Cox had described them as a \"person of interest\", and labelled the killing a \"political assassination\". Read more: Charlie Kirk was a MAGA spokesman to young people across America Earlier, witnesses said they heard shots fired from a nearby building as Mr Kirk spoke, a university spokesperson told Sky's US partner NBC News. Authorities said the shooter wore dark clothing and fired from a roof on the campus. Videos on social media show Mr Kirk talking into a microphone while sitting under a white tent with the slogans \"The American Comeback\" and \"Prove Me Wrong\". A single shot is heard, and Mr Kirk can be seen reaching up with his right hand as blood comes out from the left side of his neck. He then falls off his chair. A university spokesperson confirmed he had been shot in the neck. He was then taken to hospital by private security and underwent surgery. Mr Trump earlier asked people to pray for the activist.  Who was Charlie Kirk? The father-of-two was the chief executive and co-founder of Turning Point USA, a prominent organisation that engages conservative youth on school campuses. The university had said a suspect was in custody but later clarified that was not the case. Mr Kirk and Turning Point USA played a key role in driving youth support for Mr Trump in last November's presidential election. His events at college campuses nationwide typically draw large crowds. Mr Trump often spoken favourably about Mr Kirk, including multiple times on the campaign trail last year. During a rally in Washington the day before he was sworn in for a second term in January, Mr Trump told attendees: \"Charlie Kirk is here. And I want to thank Charlie. Charlie is fantastic. I mean, this guy.\" Read more from Sky News:Donald Trump suffers legal setback in bid to fire Fed governorWhat we know about Trump's state visit to the UK  A few weeks before, during a rally in Las Vegas on 22 December 2024, Mr Trump called Mr Kirk \"incredible\", adding that he \"is a special talent, and he's out there fighting\". He also appeared last October at a Turning Point USA political rally in Phoenix, saying: \"I want to express my tremendous gratitude to Charlie Kirk. He's really an amazing guy. Amazing guy.\" Tributes from across the political divide Tributes have come in from across the political divide in America since news of his death emerged, notably from the former president Barack Obama. \"This kind of despicable violence has no place in our democracy,\" he said. \"Michelle and I will be praying for Charlie's family tonight, especially his wife Erika and their two young children.\"  Politicians overseas were also quick to react, with Reform UK leader Nigel Farage - a regular at US conservative campaign events - saying it was \"a very dark day for American democracy\". Tory leader Kemi Badenoch said it was \"a blow to everything Western civilisation stands for: open discourse, robust debate and peaceful dissent\". Prime Minister Sir Keir Starmer described his death as \"heartbreaking\", adding: \"We must all be free to debate openly and freely without fear - there can be no justification for political violence.\" And Israel's Benjamin Netanyahu hailed him as a \"lion-hearted friend of Israel\" dedicated to \"speaking truth and defending freedom\".  America's political violence Sky's US correspondent Mark Stone said the killing could be \"a moment of political jeopardy for the country\", given the deep political divisions. There has been a spate of violence against American politicians, both Democrat and Republican, in the last year or so alone - including two apparent assassination attempts against Mr Trump himself in 2024. One in which he was shot during a campaign rally, and another which saw a man arrested at his golf course. In June this year, Minnesota state representative Melissa Hortman and her husband were killed in an attack at their home. State senator John Hoffman and his wife were also shot at their property. Both politicians were of the Minnesota Democratic-Farmer-Labor Party. The husband of former Democrat House Speaker Nancy Pelosi was also attacked last year, while Elon Musk - no longer part of the Trump administration - said staff working for his Department of Government Efficiency (DOGE) received death threats during the first few months of its work."
    },
    {
        "title": "Who was Charlie Kirk? A MAGA spokesman to young people across America",
        "description": "For many young people on the right of American politics, Charlie Kirk was an icon.",
        "url": "https://news.sky.com/story/who-was-charlie-kirk-a-maga-spokesman-to-young-people-across-america-13428452",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-charlie-kirk-utah-valley-university_7016545.jpg?20250910214533",
        "type": "Home",
        "Author": "Mark Stone",
        "Date Published": "2025-09-10 20:41:00",
        "Headline": "Across social media, he had a huge following with more than 7.3 million followers on TikTok, 7 million on Instagram, 5 million on X and 3.5 million on YouTube.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n For many young people on the right of American politics, Charlie Kirk was an icon. He was 31-years-old, a media personality, podcaster, an author and the founder of Turning Point USA. The non-profit organisation champions conservative politics in schools, colleges and university campuses. It has been described as one of the fastest-growing organisations of its types in America. Read more: Powerful right-wing influencer and Trump ally shot dead He had a huge following with his podcast consistently charting in the top 20. According to NBC News, The Charlie Kirk Show is being downloaded between 500,000 and 750,000 times each day. It consistently charts highly on Spotify and Apple. Across social media, he had a huge following with more than 7.3 million followers on TikTok, 7 million on Instagram, 5 million on X and 3.5 million on YouTube. \n                  Charlie Kirk: Trump condemns 'heinous assassination' of conservative influencer\n                 \n                  Trump has 'heated phone call' with Netanyahu over strike targeting Hamas in Qatar\n                 \n                  Trump suffers legal setback in bid to fire Fed governor Lisa Cook\n                 A popular political activist, he spent much of his time travelling to college campuses across the country, encouraging debate and promoting conservative values. A big supporter of President Trump and somewhat of a MAGA spokesman to young people across America, he publicly promoted conservative, Trump-aligned causes and often debated with people opposed to his views. Born in Chicago in 1993, he was attracted to politics early, volunteering for the US Senate campaign of Illinois Republican Mark Kirk (no relation) during his high school years. He was accused by critics of promoting falsehoods and conspiracy theories on issues including COVID-19, climate change and the 2020 US election. Responding to the January 6th 2021 riots on Capitol Hill, he said it was not an insurrection but that the rioters did not represent the mainstream of Mr Trump's support. A day before the riots, in support of what he believed to be a stolen election, he wrote on X that he was organising for \"buses of patriots\" to Washington to \"fight for the president\". Read more from Sky News:Donald Trump suffers legal setback in bid to fire Fed governorWhat we know about Trump's state visit to the UK Given his following among young people across America, this could be a moment of political jeopardy for the country. Is this the spark which brings people together or drives the divide dangerously deeper?"
    },
    {
        "title": "How many illegal migrants are in Britain? The key numbers driving the immigration debate",
        "description": "Representatives from the four main political parties took part in Sky News' Immigration Debate on Wednesday evening.",
        "url": "https://news.sky.com/story/how-many-illegal-migrants-are-in-britain-the-key-numbers-driving-the-immigration-debate-13428405",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-migration-immigration-debate_7016516.png?20250910211458",
        "type": "Home",
        "Author": "Joely Santa Cruz, Daniel Dunford and Kate Schneider, Sky News Data x Forensics team",
        "Date Published": "2025-09-10 19:37:00",
        "Headline": "From small boats and asylum hotels to the number of immigrants in the UK and whether foreign workers help the economy, the Sky News Data x Forensics team explores the key talking points from The Immigration Debate.",
        "Content": "By Joely Santa Cruz, Daniel Dunford and Kate Schneider, Sky News Data x Forensics team   Representatives from the four main political parties took part in Sky News' Immigration Debate on Wednesday evening. Home Office minister Mike Tapp debated alongside shadow justice minister Dr Kieran Mullan, the Liberal Democrats' home affairs spokesperson Lisa Smart, and Reform UK's head of policy Zia Yusuf. Catch up on the programme in the Politics Hub Throughout, the Sky News Data x Forensics team was checking the politicians' claims against the numbers. Here's what we've found. How many illegal migrants are there in the UK? Reform's Zia Yusuf used his opening statement to repeat a statistic which his party has referenced often in recent weeks - that there are \"north of\" one million people \"in this country illegally\". However, this is not something we have reliable data on, or that Mr Yusuf can claim to confidently know. \"Illegal\", or \"unauthorised\", tends to refer to migrants without valid immigration status to be in the UK. For example those who enter the country without a visa, or who overstay a valid visa, or remain in the UK after an unsuccessful asylum claim. They are not legally allowed to work, and they are not eligible for housing benefits or most free public services. We do not know how many people fall into this category, and the government does not produce estimates - some people may disappear from the system. The most recent independent estimates are for 2017. But the University of Oxford's Migration Observatory advises treating these with extreme caution as they have a high margin for error. They were published by the Pew Research Centre, an American think tank, and put the figure at anywhere between 700,000 to 900,000 in 2017. This is revised down from a previous estimate of 1.2 million, which is likely too high. Small boat crossings Diane from Slough, in our audience, asked a question about the number of people crossing on small boats, to which Conservative Dr Kieran Mullan responded: \"The number of people crossing has gone up. It's at record levels compared to when Labour took office.\" Newly appointed Labour Home Office minister Mike Tapp later defended his party's record, saying: \"We inherited open borders. We inherited a system that had 150,000 people crossing in just three or four years.\" There are inaccuracies with both of those statements. Fewer than 130,000 people arrived on small boats in the six years before Labour came to power, with the majority of those since 2020 - not 150,000 as Mr Tapp claimed. And Dr Mullan is not right to say the number of people arriving is at record levels. More people have crossed the Channel on small boats so far this year than had by this point in any previous year, but the highest number of arrivals recorded during a 365-day period occurred between October 2021 and October 2022, spanning the premierships of three Tory prime ministers - Boris Johnson, Liz Truss and Rishi Sunak. Those numbers had started to fall, however, under Mr Sunak, before rising after Sir Keir Starmer became PM. Mr Tapp's claim that his party \"inherited open borders\" didn't address this fact. The Home Office has previously claimed that an extended period of calm weather in the Channel has made it easier for migrants to cross. But our analysis found that, while it's true the weather has been unusually calm this year, that factor alone cannot explain the high number of crossings over the last 12 months. Asylum hotels  Dr Mullan also claimed \"the number of people in hotels is higher than it was when Labour took office\". That's true - there are currently 32,059 asylum seekers being housed in 210 hotels in the UK, compared with 29,585 people in 213 hotels when Labour were elected. But the highest number on record was while the Conservatives were in power. In September 2023, there were 56,042 asylum seekers being housed in 400 hotels. That number had fallen substantially by the time they left office. Read more: A council-by-council breakdown of asylum hotels See how many asylum seekers are being housed in your area:  A record number of people claimed asylum in the UK in the year to June 2025, at over 111,000. Over the same period, 134,037 initial decisions were taken on asylum applications, with around 52,000 granted and 58,000 refused. Those with a rejected claim can go on to appeal, and the recent increased number of applications as well as a higher rate of initial rejections has led to a backlog in the courts, now at over 50,000 people. The government has said it wants to increase returns of failed asylum seekers and others without legal immigration status, but Reform's Mr Yusuf accused them of overinflating the numbers, as most returns are voluntary. The number of removals of people without legal immigration status was 35,833 people in the year to June 2025, an increase of 5,000 on the year preceding it, with returns now at their highest level since 2016/17, though lower than the 47,000 in 2012. Legal migration Asylum claims are a much smaller share of overall migration than legal work routes. Mr Tapp said immigration was too high under the Conservatives, and Labour had managed to \"cut that by 300,000\", and had \"halved working visas\". He said Labour are increasing requirements for qualifications and salaries. But much of this trend was already under way before Labour took office. Read more: How much does the UK rely on legal migration? Though the Tories oversaw a big increase in legal migration, they were also responsible for later rolling back and tightening the rules, for example on limiting care worker and student dependants in early 2024. This led to the number of work dependant visas halving to 103,518 by 2025, and student dependant visas decreasing by 88% to 18,000. Labour's immigration white paper sets out a further tightening of the rules. The Home Office says this will result in 98,000 fewer visas being issued next year. That is equivalent to 10% of all of those issued in 2024, but less than the drop since 2023 which Mr Tapp was talking about. That was largely a result of decreasing numbers of dependants. The ONS projects net migration to fall further, to an average long-term level of 340,000 a year by mid-2028, based on the trend from before the Conservatives left office. Do migrants contribute more than they take?  During the debate, audience member Tavinder from Bromsgrove asked: \"Does legal immigration benefit the UK? And their contribution: are they taking more or contributing more?\" From a purely economic perspective, the answer is much more complex than a simple \"yes\" or \"no.\" According to 2024 analysis from the Office for Budget Responsibility (OBR), the UK's independent assessor of public finances, whether a migrant is a net contributor or net \"taker\" from the economy depends on several factors, including their age and average earnings. The OBR found the average high-wage migrant worker arriving at the age of 25 is a net contributor to the economy across their entire lifetime. A high wage here is measured as one about 30% higher than the average salary. The average annual salary in the UK is currently £37,430, meaning a \"high wage\" is anything above £48,659. A typical British-born individual has a negative fiscal impact on the economy as a child. Over the course of their working years, this \"debt\" is gradually reduced until they become net positive contributors.   In contrast, migrant workers earning above-average wages and immigrating during their prime working years skip this period of negative fiscal impact on the UK as children. This means they start paying into the economy as soon as they arrive.  On the other hand, the OBR estimated the typical low-wage migrant workers has a net negative fiscal contribution to the UK that only grows as they age.  The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "I wanted to ask this union boss some very serious questions - and he tried to run away from me",
        "description": "For nearly two years, Sky News has been investigating allegations of bullying and harassment inside one of the UK's biggest trade unions.",
        "url": "https://news.sky.com/story/i-wanted-to-ask-this-union-boss-some-very-serious-questions-and-he-tried-to-run-away-from-me-13428193",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-gmb-gary-smith_7016344.jpg?20250910181102",
        "type": "Home",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-09-10 13:31:00",
        "Headline": "Gary Smith, head of the GMB Union, has claimed there is \"no problem at all\" when asked about allegations of bullying and misogyny within the organisation. ",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  For nearly two years, Sky News has been investigating allegations of bullying and harassment inside one of the UK's biggest trade unions. We've been listening to women with accounts of alleged bullying, misogyny, cronyism, and sexism which they claim is rife within the GMB Union. So I went to find the head of the group to ask him why some women at his union still feel like they are treated unfairly. How we tracked him down Through a dimly lit car park in the middle of a Tuesday afternoon I'm chasing the head of the GMB union through the car bays in an attempt to ask him some very serious questions. He seems annoyed by this scrutiny. He had left the TUC conference early through a side door in an apparent attempt to avoid me and had started running away from me as I approached him. But there are serious questions hanging over him over how he runs his unions and how that union treats the women who work for him - so I continue to follow him. GMB has always denied there is a culture of bullying, misogyny and sexism, in fact much more staunchly than any other organisation I've covered before accused of the same thing, and today was no different. Politics Hub: Follow the latest from Westminster Mr Smith told me there was \"no problem at all\" within the union, unwilling to admit there was any real work to do and essentially saying - there's nothing to see here. The problem is lots of women have expressed concerns and say they feel harassed at the union enough that the equalities watchdog is currently examining whether GMB is complying with the human rights act, and previously GMB members have threatened to strike against their own union over allegations of sexism - a highly unusual move used only when members want to raise a serious issue. I ask Mr Smith whether he takes this seriously, He says: \"We're a good organisation, we're a cleaned up organisation, and we think the culture is pretty positive.\" I ask whether he believes the women who are bravely speaking out about their experience., whether he thinks there's any harassment or bullying in his organisation at all or finally, if he wanted to apologise or wanted to say anything to the women who expressed concerns. He declined to speak to me any further and I thanked him for his time. An 'institutionally sexist' union The GMB union has had internal run-ins before and has recently had a terrible track record with misogyny and sexism within its ranks. An internal report in 2020 branded the union \"institutionally sexist\" - a stain on their reputation that was so bad, it forced a change in leadership which saw Mr Smith elected as president. He made a declaration when he was appointed to the £148,000-a-year top job that \"if our union doesn't stand for decency and equality then we stand for nothing.\" It was a defining moment for GMB as their new general secretary, Mr Smith, was now pledging to end sexism and bullying. He promised to implement the recommendations of that damning report, the Monaghan report, and said he would work relentlessly to make it happen - \"no ifs no buts\". But since then, GMB women who we have spoken to say, it's only got worse. The whistle-blowers who spoke to us said they were speaking out because they held senior positions within the organisation and said if this was how they were treated, they worried what their junior employees would have to endure. They say all their complaints have happened since that 2020 report and that they are submitting complaints from regions across the country. Then, in February 2024, members of its largest region supported a move towards industrial action over \"serious allegations of bullying and harassment\". Staff in the North East, Yorkshire and Humberside region overwhelmingly supported a consultative ballot on strike action - which is usually used as a shot across the bow when members want to raise a serious issue. Union 'categorically denies' bullying and sexism Things escalated this year when the equalities watchdog took an active interest in the inner workings of GMB. Flooded with complaints from women, they were guided to inquire into the senior leadership of GMB who claim there has been a pattern of victimisation and harassment against women who speak out. They formally wrote to the GMB union asking for information on how it's complying with the Equality Act following allegations of sexual harassment, victimisation, and sex discrimination. GMB has now written back to the Equality and Human Rights Commission (EHRC) who will examine their response. I spoke to Anne, one of the women who submitted the collective formal complaint to the equalities watchdog, who said she was bullied out of GMB by two senior men in the union. She lodged an internal complaint - that was then upheld. GMB has said it categorically denies claims of a culture of bullying or sexism within the union. In fact, they have never substantially responded to claims of a renewed culture of sexism and this was why after repeated requests for an interview I thought it became important to ask Mr Smith himself what he made about these repeated allegations. Had the union slipped back into its old ways? Major Labour donor - with ministerial members This also matters because the general secretary of GMB is politically significant because the union is a major Labour donor with numerous cabinet ministers, including the prime minister holding membership. Politically it is seen as closer to this Labour leadership than other big unions since Sharon Graham's Unite party has remained very critical of Sir Keir Starmer's government over welfare cuts and the winter fuel U-turn. Sir Keir even gave the keynote speech at the GMB conference a year before the last general election. GMB still categorically denies claims of a culture of bullying or sexism within the union and say they responded to a 2020 Report - that found institutional sexism within the union - by swiftly establishing new structures and policies to effectively deal with any allegation of bullying, sexism or harassment."
    },
    {
        "title": "Trump has 'heated phone call' with Netanyahu over strike targeting Hamas in Qatar",
        "description": "Donald Trump had a heated phone call with Israeli Prime Minister Benjamin Netanyahu after his military targeted Hamas inside Qatar, according to a report.",
        "url": "https://news.sky.com/story/trump-has-heated-phone-call-with-netanyahu-over-strike-targeting-hamas-in-qatar-13428486",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-donald_6879194.jpg?20250407183847",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-10 22:13:00",
        "Headline": "The US president said the Israeli decision to strike inside Qatar was not wise but Benjamin Netanyahu said he had a brief window to launch the airstrike and took the opportunity, the Wall Street Journal reported.",
        "Content": " Donald Trump had a heated phone call with Israeli Prime Minister Benjamin Netanyahu after his military targeted Hamas inside Qatar, according to a report. The American president told Mr Netanyahu on Tuesday that the decision to strike inside the US ally's territory was not wise, The Wall Street Journal reported, citing senior administration officials. The Israeli prime minister responded by saying he had a brief window to launch the airstrike and took the opportunity, according to the newspaper.  A second call between the two leaders later that day was cordial, with Mr Trump asking Mr Netanyahu if the attack had been successful, the publication added. Israel attempted to kill the political leaders of the Islamist group Hamas with the attack in the Qatari capital Doha on Tuesday. Hamas has said its top leaders survived the airstrike, but five members were killed, including the son of its exiled Gaza chief and top negotiator Khalil al Hayya. The Israeli military operation in Doha has been widely condemned internationally and was particularly sensitive as Qatar has been hosting and mediating in negotiations which are trying to bring about a ceasefire in the war in Gaza. On Wednesday, Mr Netanyahu warned Qatar to either expel Hamas officials or \"bring them to justice. Because if you don't, we will\". Qatar has hit back at him, saying his comments about the Gulf nation hosting a Hamas office were \"reckless\". Meanwhile, the Israeli ambassador to the US, Yechiel Leiter, has said that if Israel failed to kill Hamas leaders on Tuesday, it would succeed next time. \"We have put terrorists on notice, wherever they may be... we're going to pursue them, and we're going to destroy those who will destroy us,\" he said. The airstrike took place shortly after Hamas claimed responsibility for Monday's shooting at a bus stop on the outskirts of Jerusalem that killed six people. Read more:Analysis: Israel has crossed a huge diplomatic red line In another development, Sir Keir Starmer has had talks with Israeli President Isaac Herzog in Downing Street, with Mr Herzog saying they argued during a \"tough meeting\".  PM condemns Israeli action The prime minister has condemned the Israeli attack in Qatar, and raised the matter with the president, saying it was \"completely unacceptable\". \"He said the strikes were a flagrant violation of a key partner's sovereignty and do nothing to secure the peace we all desperately want to see,\" a Downing Street spokesperson said. Israel has been angered by Britain's plans to join several other Western countries, including France and Canada, in recognising a Palestinian state later this month - unless Israel meets conditions including a ceasefire in Gaza. \"Things were said that were tough and strong, and clearly we can argue, because when allies meet, they can argue. We are both democracies,\" Mr Herzog said at an event at Chatham House. He also proposed offering a \"fact-finding mission\" to Israel, \"sitting with us and studying the situation in Gaza on the humanitarian level\". \"Because we have full answers, and we are fully transparent,\" he said."
    },
    {
        "title": "Labour deputy leadership: Contest to replace Rayner set to become two-horse race",
        "description": "Labour's deputy leadership contest is on the brink of becoming a two-horse race between Bridget Phillipson and Lucy Powell, as the other three candidates scramble for nominations.",
        "url": "https://news.sky.com/story/housing-minister-alison-mcgovern-pulls-out-of-labour-deputy-leadership-race-13428270",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bridget-phillipson_7016638.jpg?20250911011911",
        "type": "Home",
        "Author": "Faye Brown",
        "Date Published": "2025-09-10 15:39:00",
        "Headline": "The latest tally comes after housing minister Alison McGovern dropped out, conceding she would not get the support required to make it to the next sage. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Labour's deputy leadership contest is on the brink of becoming a two-horse race between Bridget Phillipson and Lucy Powell, as the other three candidates scramble for nominations. The official tally from the Parliamentary Labour Party (PLP) on Wednesday night put Ms Phillipson, the education secretary, ahead with 116 nominations. Politics Hub: Catch up on The Immigration Debate Ms Powell, the former Commons leader who was ousted in Sir Keir Starmer's reshuffle last week, is behind with 77 - just three shy of the 80 needed to make it to the next round. Bell Ribeiro-Addy, Paula Barker and Dame Emily Thornberry all had support from 15 or fewer MPs as of Wednesday evening, fuelling speculation they could follow in the footsteps of housing minister Alison McGovern and pull out. Ms Barker, the MP for Liverpool Wavetree, told Sky News she was \"genuinely undecided\" and had a lot to consider. Ms Barker, a former trade union official, has challenged the government on Gaza and welfare cuts and is part of the newly formed soft-left \"Mainstream group\". Her allies are keen for her to stay in the race, with one telling Sky News she \"outshone the others by miles\" during an online hustings event for MPs, and would be a \"real alternative for the membership\". Her supporters are expected to throw their weight behind Ms Powell if she does drop out, with one saying of the Manchester Central MP: \"She is closer to Andy Burnham, and she was just sacked, so those who dislike Morgan McSweeney [the prime minister's chief of staff] I guess will get behind her.\" However, while describing her as \"slightly more left\" than Ms Phillipson, they said she is \"hardly a socialist\". Read more politics news:Who is Peter Mandelson?How many illegal migrants are in Britain? Some MPs want to avoid a race between Ms Powell and Ms Phillipson, believing there is not much difference in what they offer, but others had more praise for the former, calling her performance at the hustings impressive. One MP said: \"Her pitch is that she's been the shop steward of the parliamentary Labour Party (PLP) in government, but now she's not in government she can dedicate herself to the role of deputy leader full time without a department to run. She wants to focus on defining our voter coalition and making sure we're speaking to them.\" They added that Ms Phillipson might be too busy to fulfil the deputy leadership role, especially with SEND (special educational needs and disabilities) reform coming down the track \"which could be a horror show\". Ms Phillipson has been making the case to MPs about her experience fighting populism in her Houghton & Sunderland South seat in the North East, where Reform UK is on the rise. Dr Jeevun Sandher said he was won over by the education secretary following her pitch at the hustings in which she also spoke about the cost of living crisis. The MP for Loughborough told Sky News: \"Bridget was strong, articulate, and very impressive. She was able to communicate the deep thought we need to govern well and win the next election.\"  The deputy leadership race was triggered by the resignation of former deputy prime minister and housing secretary Angela Rayner after she admitted underpaying stamp duty on a flat. The candidates need 80 backers by 5pm Thursday. As of Wednesday evening's tally, 235 MPs had made their nominations out of Labour's 398 MPs. Ms McGovern pulled out on Wednesday afternoon, saying it was \"clear that the momentum of this contest had shifted, and I am not going to progress to the next stage\". The MP for Birkenhead was rumoured to be Number 10's preference before it was clear Ms Phillipson - who she has since nominated - would enter the race. Timeline for the race Many Labour MPs are keen to see someone who would work constructively with the prime minister to avoid the party becoming more divided. There are also calls for the deputy leader to be from the north to balance out the number of cabinet ministers who represent London seats - which both Dame Emily and Ms Riberio-Addy do. If more than one candidate secures 80 nominations by Thursday evening, they will then need to gain backing from either three of Labour's affiliate organisations, including two trade unions, or 5% of constituency parties. That process will continue until 27 September, meaning a contested election threatens to overshadow the party's annual conference that begins in Liverpool the next day. The successful candidates will then appear on the ballot for a vote of all party members and affiliated party supporters, which will open on 8 October and close on 23 October at 12pm. The winner will be announced on Saturday 25 October."
    },
    {
        "title": "MPs around the world urge leaders to follow Trump's call for Jimmy Lai's release",
        "description": "MPs from around the world are urging their heads of state to follow Donald Trump's call for jailed Hong Kong media tycoon Jimmy Lai's release as he awaits a verdict.",
        "url": "https://news.sky.com/story/mps-around-the-world-urge-leaders-to-follow-trumps-call-for-jimmy-lais-release-13428242",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-china-jimmy-lai_6989838.jpg?20250818052458",
        "type": "Home",
        "Author": "Alix Culbertson",
        "Date Published": "2025-09-10 15:12:00",
        "Headline": "Jimmy Lai is awaiting a verdict in his national security trial in Hong Kong, five years after he was arrested for taking part in pro-democracy protests.",
        "Content": "\n          Political reporter\n              @alixculbertson\n MPs from around the world are urging their heads of state to follow Donald Trump's call for jailed Hong Kong media tycoon Jimmy Lai's release as he awaits a verdict. Parliamentarians from 16 countries, ranging from the UK and Canada to Zambia and Paraguay, have written to their prime ministers and presidents in a coordinated global effort to get them to \"form a united coalition\" in support of Mr Lai. The 77-year-old Apple Daily newspaper founder, who is a British citizen with no other passport, has been in prison in Hong Kong since December 2020 and is awaiting the final verdict in his trial, with no date set. It could come any day now. He is accused of conspiring to collude with foreign forces and sedition under the national security law imposed on Hong Kong by Beijing following pro-democracy protests he was involved with in 2019. In August, the US president renewed his promise to \"save\" Mr Lai, saying he is \"going to do everything\" he can to get him freed, after initially pledging to \"100% get him out\" weeks before the US election last November. Now, parliamentarians, including British MPs and Lords, who are members of the Inter-Parliamentary Alliance on China (IPAC), are calling on their leaders to follow suit. In their letter, IPAC MPs, a group of politicians in different countries with an interest in China relations, have urged their state leaders to \"join with\" the US to \"prioritise advocacy on Mr Lai's behalf, and to stand in solidarity with other global leaders to form a united coalition in support of Mr Lai\". The MPs wrote: \"A clear and coordinated international response is essential to challenge the injustice he faces and to reaffirm the universal principles of democracy, human rights, and freedom of the press.\" They said without a globally coordinated intervention \"at the highest levels\" Mr Lai will be convicted and die in prison. \"We implore you to take up Mr Lai's case personally, in coordination with other leaders of democratic countries,\" they said. Mr Lai's son, Sebastien Lai, told Sky News last month that if the British government fails to act, \"my father is most likely going to die in jail\". The MPs have said Mr Lai is now an elderly man who has been separated from his family and held in solitary confinement for more than four years \"simply for democratic values and the basic freedoms promised to the people of Hong Kong\". Read more:Who is Jimmy Lai?Why Jimmy Lai's case is major sticking point for Starmer's relations with China  Signatory and UK Labour MP Sarah Champion, chair of the international development committee, told Sky News: \"Jimmy Lai has been left to languish in solitary confinement for over four years, his imprisonment is a blatant violation of human rights and press freedom. \"A strong and united global response is needed and Britain must join with our allies in calling for his immediate release.\" MPs who are sending letters to their leaders come from: Albania, UK, Canada, France, Kenya, Sweden, Australia, Romania, Zambia, The Phillippines, the European Parliament, Bosnia and Herzegovina, Paraguay, Netherlands, New Zealand and Norway. The Chinese embassy in London has previously denied claims the prosecution of Mr Lai is to silence criticism. A spokesman said the UK's previous remarks criticising Hong Kong over Mr Lai \"confuse right and wrong and interfere with the rule of law in Hong Kong. We are firmly opposed to that\". They have repeatedly said Hong Kong is governed by the rule of law and \"any illegal criminal behaviour should be punished by law\"."
    },
    {
        "title": "Prince Harry says King is 'great' after they have private tea in first meeting for 19 months",
        "description": "Prince Harry has said the King is \"great\" after he reunited with his father at Clarence House for a private tea.",
        "url": "https://news.sky.com/story/prince-harry-has-arrived-at-clarence-house-to-meet-the-king-13428262",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-clarence-hous-clarence-house_7016339.jpg?20250910180155",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-10 15:18:00",
        "Headline": "The last time the father and son saw each other was in February 2024 when the Duke of Sussex flew to London after the monarch announced his cancer diagnosis.",
        "Content": "Prince Harry has said the King is \"great\" after he reunited with his father at Clarence House for a private tea. It was their first meeting in 19 months and lasted just 54 minutes. The last time the father and son saw each other was in February 2024 when the Duke of Sussex flew to the UK after the monarch announced his cancer diagnosis. Harry, 40, was driven through the gates of the King's London home on Wednesday, arriving at 5.20pm, and he left at 6.14pm ahead of an engagement with the Invictus Games Foundation later in the evening where he said of his father \"Yes he's great, thank you\". Earlier, he had an engagement at the Centre for Blast Injury Studies at Imperial College London, an institution with which he has close connections. The duke has been carrying out a string of events since arriving back in Britain on Monday. He began his four-day working stay by leaving flowers at the final resting place of his grandmother, Queen Elizabeth II, to mark the third anniversary of her death. \n                  Meeting between Duke of Sussex and the King feels like a positive step - even if full reconciliation is likely to take time\n                 \n                  William and Harry show separate commitment to shared causes - it shows what a powerful team they could be\n                 \n                  Just miles between them, William and Harry still seem so far apart\n                 The King, who is still undergoing cancer treatment, travelled back to London on Wednesday from his Balmoral home, where he has been spending his summer break. The reunion came after Harry publicly expressed hopes in May of a family reconciliation, as he told the BBC the monarch would not speak to him because of his court battle over his security and that he did not know \"how much longer my father has\". Since moving to the US with his wife Meghan, Harry, who stepped back as a working royal in 2020, has levelled several accusations at the King, his stepmother the Queen, his brother Prince of Wales and his sister-in-law the Princess of Wales in his Oprah interview, Netflix documentary, interviews and his autobiography Spare. The duke remains estranged from Prince William, 43, who travelled to Cardiff on Wednesday to learn about a mental health hub on World Suicide Prevention Day, with no prospect of the pair meeting. In February 2024, Harry made the journey from his Californian home to Britain to see his father following his cancer diagnosis. Back then, Harry spent about 45 minutes with the King before the 76-year-old flew to his Sandringham country estate to recuperate from his treatment. The meeting showed both sides were willing to put their strained relationship on hold. Read more from Sky News:Riot police clash with 'Block Everything' protesters in ParisNew Banksy artwork being removed from wall This summer, senior aides to the King and Harry were pictured in the Mail On Sunday during a meeting in London that was reportedly a step towards restoring the relationship between the duke and the Royal Family."
    },
    {
        "title": "UK looking to reinforce Poland's air defences - as EU diplomat warns 'Ukraine war is escalating'",
        "description": "The UK is looking to bolster Poland's air defences after suspected Russian drones were shot down in its airspace.",
        "url": "https://news.sky.com/story/uk-looking-to-reinforce-polands-air-defences-as-eu-diplomat-warns-ukraine-war-is-escalating-13428233",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-russian-drone-poland_7015838.jpg?20250910094437",
        "type": "Home",
        "Author": "Michael Drummond",
        "Date Published": "2025-09-10 14:50:00",
        "Headline": "The alleged breach of Polish airspace by Russian drones - leading to an operation to shoot some down with NATO airplanes - has raised tensions in Europe.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n The UK is looking to bolster Poland's air defences after suspected Russian drones were shot down in its airspace. It is the first time a NATO country is known to have fired shots during Russia's war in Ukraine and raises concerns of a wider conflict. In a bleak message, Polish Prime Minister Donald Tusk said it was \"the closest we have been to open conflict since World War Two\", but added that there was \"no reason to believe we're on the brink of war\". Moscow denied responsibility for the incident, with the Russian defence ministry saying its drones had carried out a major attack on western Ukraine but it had not planned to hit any locations in Poland. What happened in Poland? NATO fighter planes were scrambled as part of the operation to shoot down suspected Russian drones that had allegedly breached Poland's airspace on Tuesday evening and kept coming until morning, officials say. Poland says 19 objects had entered its airspace during a Russian air attack on Ukraine, many from Belarus, and that those that posed a threat were shot down. Seven drones have been found, as well as parts of one missile, according to Poland's interior ministry. Warsaw's armed forces command called it \"an unprecedented violation of Polish airspace\", adding: \"This is an act of aggression that posed a real threat to the safety of our citizens.\" Belarus, a close ally of Russia, said it tracked some drones that \"lost their course\" because they were jammed. However, several European leaders say they think the incursion amounted to an intentional escalation by Russia. Read more:Drones and salami: How Putin is testing the WestAnalysis: The pivotal question for NATO  How is NATO involved? Poland is a key member of NATO and has one of the biggest militaries in Europe, one that has only increased in size since Vladimir Putin's full-scale invasion of Ukraine in 2022. Airplanes from other NATO nations - the Netherlands and Italy - were involved in the operation to shoot down the drones. NATO chief Mark Rutte said the incident showed that the alliance is able to defend \"every inch\" of NATO territory \"including, of course, its airspace\". Leaders and diplomats from various NATO countries have been involved in fervent discussions in the aftermath of the incident. Article 5 of the alliance treaty states that an attack on one member is considered an attack on all members, but Poland has not invoked that at this time. Instead, Prime Minister Tusk said his country has asked that Article 4 be invoked, which allows alliance members to consult with other members on issues. Foreign news reporter Prime Minister Donald Tusk has said Poland is invoking Article 4 of the NATO treaty in response to the alleged drones incident. Article 5 – the principle of collective self-defence – is well known, but Article 4 is different. Under the treaty, any member of the 32-strong alliance can formally invoke Article 4 to bring an issue to the attention of the North Atlantic Council – NATO’s decision-making body. The article states: “The Parties will consult together whenever, in the opinion of any of them, the territorial integrity, political independence or security of any of the Parties is threatened.” As soon as Article 4 is invoked, the issue is discussed and can potentially lead to some form of joint decision or action on behalf of NATO. It does not necessitate any form of armed intervention. Unlike Article 5, which has only been invoked once, Article 4 has been invoked seven times in NATO’s history. Most recently, Bulgaria, the Czech Republic, Estonia, Latvia, Lithuania, Poland, Romania and Slovakia requested to hold consultations under Article 4 on 24 February 2022 in response to Russia’s full-scale invasion of Ukraine. Starmer condemns 'reckless Russia' as allies look to bolster Poland Prime Minister Sir Keir Starmer was among the leaders of Poland's allies to criticise Moscow and offer support to Warsaw. He denounced the \"unprecedented violation of Polish and NATO airspace\" as well as the \"barbaric attack\" on Ukraine. \"This was an extremely reckless move by Russia and only serves to remind us of President Putin's blatant disregard for peace, and the constant bombardment innocent Ukrainians face every day,\" he said. The UK is also looking for ways to bolster Poland's air defences, British defence secretary John Healey said. Kaja Kallas, the EU's top diplomat, warned that \"Russia's war is escalating\" and called on the bloc to \"raise the cost on Moscow\" and invest in Europe's defence. Ukrainian President Volodymyr Zelenskyy, whose country endures nightly barrages of Russian drone attacks, said: \"Ukraine is ready to expand our cooperation with partners for reliable protection of the sky. So that we have not only information and intelligence data sharing, but also real joint actions that guarantee security of the neighbours. \"Russia must feel that Europeans know how to defend themselves.\" What does Russia say? The Kremlin has denied responsibility for what happened. Russia's defence ministry said its drones had carried out a major attack on military facilities in western Ukraine, but that it had not planned to hit any targets in Poland. Kremlin spokesperson Dmitry Peskov said the EU and NATO \"accuse Russia of provocations on a daily basis. Most of the time without even trying to present at least some kind of argument.\""
    },
    {
        "title": "Labour deputy leadership: Contest to replace Rayner set to become two-horse race",
        "description": "Labour's deputy leadership contest is on the brink of becoming a two-horse race between Bridget Phillipson and Lucy Powell, as the other three candidates scramble for nominations.",
        "url": "https://news.sky.com/story/housing-minister-alison-mcgovern-pulls-out-of-labour-deputy-leadership-race-13428270",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bridget-phillipson_7016638.jpg?20250911011911",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-09-10 15:39:00",
        "Headline": "The latest tally comes after housing minister Alison McGovern dropped out, conceding she would not get the support required to make it to the next sage. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Labour's deputy leadership contest is on the brink of becoming a two-horse race between Bridget Phillipson and Lucy Powell, as the other three candidates scramble for nominations. The official tally from the Parliamentary Labour Party (PLP) on Wednesday night put Ms Phillipson, the education secretary, ahead with 116 nominations. Politics Hub: Catch up on The Immigration Debate Ms Powell, the former Commons leader who was ousted in Sir Keir Starmer's reshuffle last week, is behind with 77 - just three shy of the 80 needed to make it to the next round. Bell Ribeiro-Addy, Paula Barker and Dame Emily Thornberry all had support from 15 or fewer MPs as of Wednesday evening, fuelling speculation they could follow in the footsteps of housing minister Alison McGovern and pull out. Ms Barker, the MP for Liverpool Wavetree, told Sky News she was \"genuinely undecided\" and had a lot to consider. Ms Barker, a former trade union official, has challenged the government on Gaza and welfare cuts and is part of the newly formed soft-left \"Mainstream group\". Her allies are keen for her to stay in the race, with one telling Sky News she \"outshone the others by miles\" during an online hustings event for MPs, and would be a \"real alternative for the membership\". Her supporters are expected to throw their weight behind Ms Powell if she does drop out, with one saying of the Manchester Central MP: \"She is closer to Andy Burnham, and she was just sacked, so those who dislike Morgan McSweeney [the prime minister's chief of staff] I guess will get behind her.\" However, while describing her as \"slightly more left\" than Ms Phillipson, they said she is \"hardly a socialist\". Read more politics news:Who is Peter Mandelson?How many illegal migrants are in Britain? Some MPs want to avoid a race between Ms Powell and Ms Phillipson, believing there is not much difference in what they offer, but others had more praise for the former, calling her performance at the hustings impressive. One MP said: \"Her pitch is that she's been the shop steward of the parliamentary Labour Party (PLP) in government, but now she's not in government she can dedicate herself to the role of deputy leader full time without a department to run. She wants to focus on defining our voter coalition and making sure we're speaking to them.\" They added that Ms Phillipson might be too busy to fulfil the deputy leadership role, especially with SEND (special educational needs and disabilities) reform coming down the track \"which could be a horror show\". Ms Phillipson has been making the case to MPs about her experience fighting populism in her Houghton & Sunderland South seat in the North East, where Reform UK is on the rise. Dr Jeevun Sandher said he was won over by the education secretary following her pitch at the hustings in which she also spoke about the cost of living crisis. The MP for Loughborough told Sky News: \"Bridget was strong, articulate, and very impressive. She was able to communicate the deep thought we need to govern well and win the next election.\"  The deputy leadership race was triggered by the resignation of former deputy prime minister and housing secretary Angela Rayner after she admitted underpaying stamp duty on a flat. The candidates need 80 backers by 5pm Thursday. As of Wednesday evening's tally, 235 MPs had made their nominations out of Labour's 398 MPs. Ms McGovern pulled out on Wednesday afternoon, saying it was \"clear that the momentum of this contest had shifted, and I am not going to progress to the next stage\". The MP for Birkenhead was rumoured to be Number 10's preference before it was clear Ms Phillipson - who she has since nominated - would enter the race. Timeline for the race Many Labour MPs are keen to see someone who would work constructively with the prime minister to avoid the party becoming more divided. There are also calls for the deputy leader to be from the north to balance out the number of cabinet ministers who represent London seats - which both Dame Emily and Ms Riberio-Addy do. If more than one candidate secures 80 nominations by Thursday evening, they will then need to gain backing from either three of Labour's affiliate organisations, including two trade unions, or 5% of constituency parties. That process will continue until 27 September, meaning a contested election threatens to overshadow the party's annual conference that begins in Liverpool the next day. The successful candidates will then appear on the ballot for a vote of all party members and affiliated party supporters, which will open on 8 October and close on 23 October at 12pm. The winner will be announced on Saturday 25 October."
    },
    {
        "title": "How many illegal migrants are in Britain? The key numbers driving the immigration debate",
        "description": "Representatives from the four main political parties took part in Sky News' Immigration Debate on Wednesday evening.",
        "url": "https://news.sky.com/story/how-many-illegal-migrants-are-in-britain-the-key-numbers-driving-the-immigration-debate-13428405",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-migration-immigration-debate_7016516.png?20250910211458",
        "type": "UK",
        "Author": "Joely Santa Cruz, Daniel Dunford and Kate Schneider, Sky News Data x Forensics team",
        "Date Published": "2025-09-10 19:37:00",
        "Headline": "From small boats and asylum hotels to the number of immigrants in the UK and whether foreign workers help the economy, the Sky News Data x Forensics team explores the key talking points from The Immigration Debate.",
        "Content": "By Joely Santa Cruz, Daniel Dunford and Kate Schneider, Sky News Data x Forensics team   Representatives from the four main political parties took part in Sky News' Immigration Debate on Wednesday evening. Home Office minister Mike Tapp debated alongside shadow justice minister Dr Kieran Mullan, the Liberal Democrats' home affairs spokesperson Lisa Smart, and Reform UK's head of policy Zia Yusuf. Catch up on the programme in the Politics Hub Throughout, the Sky News Data x Forensics team was checking the politicians' claims against the numbers. Here's what we've found. How many illegal migrants are there in the UK? Reform's Zia Yusuf used his opening statement to repeat a statistic which his party has referenced often in recent weeks - that there are \"north of\" one million people \"in this country illegally\". However, this is not something we have reliable data on, or that Mr Yusuf can claim to confidently know. \"Illegal\", or \"unauthorised\", tends to refer to migrants without valid immigration status to be in the UK. For example those who enter the country without a visa, or who overstay a valid visa, or remain in the UK after an unsuccessful asylum claim. They are not legally allowed to work, and they are not eligible for housing benefits or most free public services. We do not know how many people fall into this category, and the government does not produce estimates - some people may disappear from the system. The most recent independent estimates are for 2017. But the University of Oxford's Migration Observatory advises treating these with extreme caution as they have a high margin for error. They were published by the Pew Research Centre, an American think tank, and put the figure at anywhere between 700,000 to 900,000 in 2017. This is revised down from a previous estimate of 1.2 million, which is likely too high. Small boat crossings Diane from Slough, in our audience, asked a question about the number of people crossing on small boats, to which Conservative Dr Kieran Mullan responded: \"The number of people crossing has gone up. It's at record levels compared to when Labour took office.\" Newly appointed Labour Home Office minister Mike Tapp later defended his party's record, saying: \"We inherited open borders. We inherited a system that had 150,000 people crossing in just three or four years.\" There are inaccuracies with both of those statements. Fewer than 130,000 people arrived on small boats in the six years before Labour came to power, with the majority of those since 2020 - not 150,000 as Mr Tapp claimed. And Dr Mullan is not right to say the number of people arriving is at record levels. More people have crossed the Channel on small boats so far this year than had by this point in any previous year, but the highest number of arrivals recorded during a 365-day period occurred between October 2021 and October 2022, spanning the premierships of three Tory prime ministers - Boris Johnson, Liz Truss and Rishi Sunak. Those numbers had started to fall, however, under Mr Sunak, before rising after Sir Keir Starmer became PM. Mr Tapp's claim that his party \"inherited open borders\" didn't address this fact. The Home Office has previously claimed that an extended period of calm weather in the Channel has made it easier for migrants to cross. But our analysis found that, while it's true the weather has been unusually calm this year, that factor alone cannot explain the high number of crossings over the last 12 months. Asylum hotels  Dr Mullan also claimed \"the number of people in hotels is higher than it was when Labour took office\". That's true - there are currently 32,059 asylum seekers being housed in 210 hotels in the UK, compared with 29,585 people in 213 hotels when Labour were elected. But the highest number on record was while the Conservatives were in power. In September 2023, there were 56,042 asylum seekers being housed in 400 hotels. That number had fallen substantially by the time they left office. Read more: A council-by-council breakdown of asylum hotels See how many asylum seekers are being housed in your area:  A record number of people claimed asylum in the UK in the year to June 2025, at over 111,000. Over the same period, 134,037 initial decisions were taken on asylum applications, with around 52,000 granted and 58,000 refused. Those with a rejected claim can go on to appeal, and the recent increased number of applications as well as a higher rate of initial rejections has led to a backlog in the courts, now at over 50,000 people. The government has said it wants to increase returns of failed asylum seekers and others without legal immigration status, but Reform's Mr Yusuf accused them of overinflating the numbers, as most returns are voluntary. The number of removals of people without legal immigration status was 35,833 people in the year to June 2025, an increase of 5,000 on the year preceding it, with returns now at their highest level since 2016/17, though lower than the 47,000 in 2012. Legal migration Asylum claims are a much smaller share of overall migration than legal work routes. Mr Tapp said immigration was too high under the Conservatives, and Labour had managed to \"cut that by 300,000\", and had \"halved working visas\". He said Labour are increasing requirements for qualifications and salaries. But much of this trend was already under way before Labour took office. Read more: How much does the UK rely on legal migration? Though the Tories oversaw a big increase in legal migration, they were also responsible for later rolling back and tightening the rules, for example on limiting care worker and student dependants in early 2024. This led to the number of work dependant visas halving to 103,518 by 2025, and student dependant visas decreasing by 88% to 18,000. Labour's immigration white paper sets out a further tightening of the rules. The Home Office says this will result in 98,000 fewer visas being issued next year. That is equivalent to 10% of all of those issued in 2024, but less than the drop since 2023 which Mr Tapp was talking about. That was largely a result of decreasing numbers of dependants. The ONS projects net migration to fall further, to an average long-term level of 340,000 a year by mid-2028, based on the trend from before the Conservatives left office. Do migrants contribute more than they take?  During the debate, audience member Tavinder from Bromsgrove asked: \"Does legal immigration benefit the UK? And their contribution: are they taking more or contributing more?\" From a purely economic perspective, the answer is much more complex than a simple \"yes\" or \"no.\" According to 2024 analysis from the Office for Budget Responsibility (OBR), the UK's independent assessor of public finances, whether a migrant is a net contributor or net \"taker\" from the economy depends on several factors, including their age and average earnings. The OBR found the average high-wage migrant worker arriving at the age of 25 is a net contributor to the economy across their entire lifetime. A high wage here is measured as one about 30% higher than the average salary. The average annual salary in the UK is currently £37,430, meaning a \"high wage\" is anything above £48,659. A typical British-born individual has a negative fiscal impact on the economy as a child. Over the course of their working years, this \"debt\" is gradually reduced until they become net positive contributors.   In contrast, migrant workers earning above-average wages and immigrating during their prime working years skip this period of negative fiscal impact on the UK as children. This means they start paying into the economy as soon as they arrive.  On the other hand, the OBR estimated the typical low-wage migrant workers has a net negative fiscal contribution to the UK that only grows as they age.  The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "I wanted to ask this union boss some very serious questions - and he tried to run away from me",
        "description": "For nearly two years, Sky News has been investigating allegations of bullying and harassment inside one of the UK's biggest trade unions.",
        "url": "https://news.sky.com/story/i-wanted-to-ask-this-union-boss-some-very-serious-questions-and-he-tried-to-run-away-from-me-13428193",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-gmb-gary-smith_7016344.jpg?20250910181102",
        "type": "UK",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-09-10 13:31:00",
        "Headline": "Gary Smith, head of the GMB Union, has claimed there is \"no problem at all\" when asked about allegations of bullying and misogyny within the organisation. ",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  For nearly two years, Sky News has been investigating allegations of bullying and harassment inside one of the UK's biggest trade unions. We've been listening to women with accounts of alleged bullying, misogyny, cronyism, and sexism which they claim is rife within the GMB Union. So I went to find the head of the group to ask him why some women at his union still feel like they are treated unfairly. How we tracked him down Through a dimly lit car park in the middle of a Tuesday afternoon I'm chasing the head of the GMB union through the car bays in an attempt to ask him some very serious questions. He seems annoyed by this scrutiny. He had left the TUC conference early through a side door in an apparent attempt to avoid me and had started running away from me as I approached him. But there are serious questions hanging over him over how he runs his unions and how that union treats the women who work for him - so I continue to follow him. GMB has always denied there is a culture of bullying, misogyny and sexism, in fact much more staunchly than any other organisation I've covered before accused of the same thing, and today was no different. Politics Hub: Follow the latest from Westminster Mr Smith told me there was \"no problem at all\" within the union, unwilling to admit there was any real work to do and essentially saying - there's nothing to see here. The problem is lots of women have expressed concerns and say they feel harassed at the union enough that the equalities watchdog is currently examining whether GMB is complying with the human rights act, and previously GMB members have threatened to strike against their own union over allegations of sexism - a highly unusual move used only when members want to raise a serious issue. I ask Mr Smith whether he takes this seriously, He says: \"We're a good organisation, we're a cleaned up organisation, and we think the culture is pretty positive.\" I ask whether he believes the women who are bravely speaking out about their experience., whether he thinks there's any harassment or bullying in his organisation at all or finally, if he wanted to apologise or wanted to say anything to the women who expressed concerns. He declined to speak to me any further and I thanked him for his time. An 'institutionally sexist' union The GMB union has had internal run-ins before and has recently had a terrible track record with misogyny and sexism within its ranks. An internal report in 2020 branded the union \"institutionally sexist\" - a stain on their reputation that was so bad, it forced a change in leadership which saw Mr Smith elected as president. He made a declaration when he was appointed to the £148,000-a-year top job that \"if our union doesn't stand for decency and equality then we stand for nothing.\" It was a defining moment for GMB as their new general secretary, Mr Smith, was now pledging to end sexism and bullying. He promised to implement the recommendations of that damning report, the Monaghan report, and said he would work relentlessly to make it happen - \"no ifs no buts\". But since then, GMB women who we have spoken to say, it's only got worse. The whistle-blowers who spoke to us said they were speaking out because they held senior positions within the organisation and said if this was how they were treated, they worried what their junior employees would have to endure. They say all their complaints have happened since that 2020 report and that they are submitting complaints from regions across the country. Then, in February 2024, members of its largest region supported a move towards industrial action over \"serious allegations of bullying and harassment\". Staff in the North East, Yorkshire and Humberside region overwhelmingly supported a consultative ballot on strike action - which is usually used as a shot across the bow when members want to raise a serious issue. Union 'categorically denies' bullying and sexism Things escalated this year when the equalities watchdog took an active interest in the inner workings of GMB. Flooded with complaints from women, they were guided to inquire into the senior leadership of GMB who claim there has been a pattern of victimisation and harassment against women who speak out. They formally wrote to the GMB union asking for information on how it's complying with the Equality Act following allegations of sexual harassment, victimisation, and sex discrimination. GMB has now written back to the Equality and Human Rights Commission (EHRC) who will examine their response. I spoke to Anne, one of the women who submitted the collective formal complaint to the equalities watchdog, who said she was bullied out of GMB by two senior men in the union. She lodged an internal complaint - that was then upheld. GMB has said it categorically denies claims of a culture of bullying or sexism within the union. In fact, they have never substantially responded to claims of a renewed culture of sexism and this was why after repeated requests for an interview I thought it became important to ask Mr Smith himself what he made about these repeated allegations. Had the union slipped back into its old ways? Major Labour donor - with ministerial members This also matters because the general secretary of GMB is politically significant because the union is a major Labour donor with numerous cabinet ministers, including the prime minister holding membership. Politically it is seen as closer to this Labour leadership than other big unions since Sharon Graham's Unite party has remained very critical of Sir Keir Starmer's government over welfare cuts and the winter fuel U-turn. Sir Keir even gave the keynote speech at the GMB conference a year before the last general election. GMB still categorically denies claims of a culture of bullying or sexism within the union and say they responded to a 2020 Report - that found institutional sexism within the union - by swiftly establishing new structures and policies to effectively deal with any allegation of bullying, sexism or harassment."
    },
    {
        "title": "MPs around the world urge leaders to follow Trump's call for Jimmy Lai's release",
        "description": "MPs from around the world are urging their heads of state to follow Donald Trump's call for jailed Hong Kong media tycoon Jimmy Lai's release as he awaits a verdict.",
        "url": "https://news.sky.com/story/mps-around-the-world-urge-leaders-to-follow-trumps-call-for-jimmy-lais-release-13428242",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-china-jimmy-lai_6989838.jpg?20250818052458",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-09-10 15:12:00",
        "Headline": "Jimmy Lai is awaiting a verdict in his national security trial in Hong Kong, five years after he was arrested for taking part in pro-democracy protests.",
        "Content": "\n          Political reporter\n              @alixculbertson\n MPs from around the world are urging their heads of state to follow Donald Trump's call for jailed Hong Kong media tycoon Jimmy Lai's release as he awaits a verdict. Parliamentarians from 16 countries, ranging from the UK and Canada to Zambia and Paraguay, have written to their prime ministers and presidents in a coordinated global effort to get them to \"form a united coalition\" in support of Mr Lai. The 77-year-old Apple Daily newspaper founder, who is a British citizen with no other passport, has been in prison in Hong Kong since December 2020 and is awaiting the final verdict in his trial, with no date set. It could come any day now. He is accused of conspiring to collude with foreign forces and sedition under the national security law imposed on Hong Kong by Beijing following pro-democracy protests he was involved with in 2019. In August, the US president renewed his promise to \"save\" Mr Lai, saying he is \"going to do everything\" he can to get him freed, after initially pledging to \"100% get him out\" weeks before the US election last November. Now, parliamentarians, including British MPs and Lords, who are members of the Inter-Parliamentary Alliance on China (IPAC), are calling on their leaders to follow suit. In their letter, IPAC MPs, a group of politicians in different countries with an interest in China relations, have urged their state leaders to \"join with\" the US to \"prioritise advocacy on Mr Lai's behalf, and to stand in solidarity with other global leaders to form a united coalition in support of Mr Lai\". The MPs wrote: \"A clear and coordinated international response is essential to challenge the injustice he faces and to reaffirm the universal principles of democracy, human rights, and freedom of the press.\" They said without a globally coordinated intervention \"at the highest levels\" Mr Lai will be convicted and die in prison. \"We implore you to take up Mr Lai's case personally, in coordination with other leaders of democratic countries,\" they said. Mr Lai's son, Sebastien Lai, told Sky News last month that if the British government fails to act, \"my father is most likely going to die in jail\". The MPs have said Mr Lai is now an elderly man who has been separated from his family and held in solitary confinement for more than four years \"simply for democratic values and the basic freedoms promised to the people of Hong Kong\". Read more:Who is Jimmy Lai?Why Jimmy Lai's case is major sticking point for Starmer's relations with China  Signatory and UK Labour MP Sarah Champion, chair of the international development committee, told Sky News: \"Jimmy Lai has been left to languish in solitary confinement for over four years, his imprisonment is a blatant violation of human rights and press freedom. \"A strong and united global response is needed and Britain must join with our allies in calling for his immediate release.\" MPs who are sending letters to their leaders come from: Albania, UK, Canada, France, Kenya, Sweden, Australia, Romania, Zambia, The Phillippines, the European Parliament, Bosnia and Herzegovina, Paraguay, Netherlands, New Zealand and Norway. The Chinese embassy in London has previously denied claims the prosecution of Mr Lai is to silence criticism. A spokesman said the UK's previous remarks criticising Hong Kong over Mr Lai \"confuse right and wrong and interfere with the rule of law in Hong Kong. We are firmly opposed to that\". They have repeatedly said Hong Kong is governed by the rule of law and \"any illegal criminal behaviour should be punished by law\"."
    },
    {
        "title": "Prince Harry says King is 'great' after they have private tea in first meeting for 19 months",
        "description": "Prince Harry has said the King is \"great\" after he reunited with his father at Clarence House for a private tea.",
        "url": "https://news.sky.com/story/prince-harry-has-arrived-at-clarence-house-to-meet-the-king-13428262",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-clarence-hous-clarence-house_7016339.jpg?20250910180155",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-10 15:18:00",
        "Headline": "The last time the father and son saw each other was in February 2024 when the Duke of Sussex flew to London after the monarch announced his cancer diagnosis.",
        "Content": "Prince Harry has said the King is \"great\" after he reunited with his father at Clarence House for a private tea. It was their first meeting in 19 months and lasted just 54 minutes. The last time the father and son saw each other was in February 2024 when the Duke of Sussex flew to the UK after the monarch announced his cancer diagnosis. Harry, 40, was driven through the gates of the King's London home on Wednesday, arriving at 5.20pm, and he left at 6.14pm ahead of an engagement with the Invictus Games Foundation later in the evening where he said of his father \"Yes he's great, thank you\". Earlier, he had an engagement at the Centre for Blast Injury Studies at Imperial College London, an institution with which he has close connections. The duke has been carrying out a string of events since arriving back in Britain on Monday. He began his four-day working stay by leaving flowers at the final resting place of his grandmother, Queen Elizabeth II, to mark the third anniversary of her death. \n                  Meeting between Duke of Sussex and the King feels like a positive step - even if full reconciliation is likely to take time\n                 \n                  William and Harry show separate commitment to shared causes - it shows what a powerful team they could be\n                 \n                  Just miles between them, William and Harry still seem so far apart\n                 The King, who is still undergoing cancer treatment, travelled back to London on Wednesday from his Balmoral home, where he has been spending his summer break. The reunion came after Harry publicly expressed hopes in May of a family reconciliation, as he told the BBC the monarch would not speak to him because of his court battle over his security and that he did not know \"how much longer my father has\". Since moving to the US with his wife Meghan, Harry, who stepped back as a working royal in 2020, has levelled several accusations at the King, his stepmother the Queen, his brother Prince of Wales and his sister-in-law the Princess of Wales in his Oprah interview, Netflix documentary, interviews and his autobiography Spare. The duke remains estranged from Prince William, 43, who travelled to Cardiff on Wednesday to learn about a mental health hub on World Suicide Prevention Day, with no prospect of the pair meeting. In February 2024, Harry made the journey from his Californian home to Britain to see his father following his cancer diagnosis. Back then, Harry spent about 45 minutes with the King before the 76-year-old flew to his Sandringham country estate to recuperate from his treatment. The meeting showed both sides were willing to put their strained relationship on hold. Read more from Sky News:Riot police clash with 'Block Everything' protesters in ParisNew Banksy artwork being removed from wall This summer, senior aides to the King and Harry were pictured in the Mail On Sunday during a meeting in London that was reportedly a step towards restoring the relationship between the duke and the Royal Family."
    },
    {
        "title": "Meeting between Duke of Sussex and the King feels like a positive step - even if full reconciliation is likely to take time",
        "description": "\"Still 50/50\" was the response I got when I asked last week if Prince Harry was going to meet his father.",
        "url": "https://news.sky.com/story/meeting-between-duke-of-sussex-and-the-king-feels-like-a-positive-step-even-if-full-reconciliation-is-likely-to-take-time-13428463",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-duke-of-sussex-prince-harry_7016336.jpg?20250910174412",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-09-10 21:22:00",
        "Headline": "After five years of upset and pain for the royal family, and a year-and-a-half since the two men last met, this meeting was huge.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n \"Still 50/50\" was the response I got when I asked last week if Prince Harry was going to meet his father. As it got later and later on Wednesday it felt like the clock was ticking with Harry due to leave on Thursday. The first positive sign was the King arriving back from Scotland, and then we started doing the sums to work out if the timings could work, with Harry due at an Invictus event at around 6pm. Then it happened. Just before 5.30pm a car with Harry inside was driven into the grounds of Clarence House. He was in. After five years of upset and pain for the royal family, and a year-and-a-half since the two men last met, this was huge. Ever since Harry flew in from America on Monday there have been constant questions about whether they'd see each other. His team have been less secretive about what he's been doing, allowing more cameras into his charity engagements, but the one topic they were avoiding talking about was his family. And they stuck to that this evening. After Harry left Clarence House after around an hour inside, his team left the palace to confirm that father and son had had tea. The meeting between Harry's team and the King's communications secretary earlier in the summer had already given us something of a sign that things might be shifting. Read more:Powerful right-wing influencer and Trump ally shot deadHow Putin is testing the West, a little bit at a time It would have felt strange, and at worst a very deliberate snub, if they hadn't met on a trip that's felt more positive and upbeat compared with Harry's previous visits. No one is kidding themselves that everything that's happened can be erased or forgotten, but it does signal what feels like a gradual reset from a man who publicly admitted he wants reconciliation with his family. In May, after losing his court battle with the Home Office over security, Harry confirmed in an interview how bad the split with his family still was, saying they weren't talking to him. Of course, with documentaries, interviews and his book Spare, a lot has been said and done since the Sussexes decided to leave royal life and moved to the States five years ago. And still the divide with his brother Prince William seems very raw. Neither side is saying what was talked about over tea. But this meeting feels like a positive step forward, even if a full reconciliation is likely to take time."
    },
    {
        "title": "Details of Trump's second state visit to UK revealed",
        "description": "Details of Donald Trump's unprecedented second state visit have been revealed by Buckingham Palace.",
        "url": "https://news.sky.com/story/details-of-trumps-second-state-visit-to-uk-revealed-13428334",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-the-king_7016429.jpg?20250910195520",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-10 17:10:00",
        "Headline": "The US president's stay with the King and Queen for the first day of his two-day visit next Wednesday will have no public-facing element, and he will remain within the private Windsor estate.",
        "Content": "Details of Donald Trump's unprecedented second state visit have been revealed by Buckingham Palace. The US president's stay with the King and Queen for the first day of his two-day visit next Wednesday will have no public-facing element, and he will remain within the private Windsor estate. Mr Trump will be treated to a flypast by the Red Arrows as well as UK and US F-35 military jets on the east lawn at Windsor Castle, as well as a special Beating Retreat military ceremony. The special additions have never been deployed before for a state visit and will take place as well as the traditional grand state banquet and ceremonial welcome. Mr Trump's visit is set to be greeted by mass protests by the Stop Trump Coalition in both Windsor and London, with security heightened during his stay. Prince and Princess of Wales will play key role The Prince and Princess of Wales will play a key part in the high-profile visit, greeting the president and his wife, first lady Melania Trump, in the grounds of the Windsor estate on the morning of 17 September before accompanying them to meet the King and Queen for an open-air greeting. Mr and Ms Trump, the King, Camilla, William and Kate will then take part in a carriage procession through the estate to the castle, with the carriage ride joined by the Household Cavalry Mounted Regiment, which will provide a Sovereign's Escort, as well as members of the armed forces and three military bands. In contrast to French President Emmanuel Macron, they will not enjoy a carriage ride through the town, nor take a trip into London to see the grave of the Unknown Warrior at Westminster Abbey. Read more:US president denies knowledge of Israel's strike on QatarHandwriting expert examines 'Trump signature' in Epstein book President and first lady will lay wreath on Queen Elizabeth II's tomb A ceremonial welcome with a guard of honour will be staged in the quadrangle of the castle, as is custom, followed by lunch with the royal family and a visit to see a Royal Collection exhibition within the castle. The president and his wife will then visit St George's Chapel privately on Wednesday afternoon to lay a wreath on the tomb of Queen Elizabeth II. An opulent state banquet will be held for Mr Trump on Wednesday evening in the castle's St George's Hall, where the King and US president will give speeches.  Trump will hold press conference with Starmer The next day, the president and first lady will formally bid farewell to the King and Queen at Windsor Castle in the morning, before Mr Trump heads to Chequers, the prime minister's official country residence in Buckinghamshire. He will meet Sir Keir Starmer and his wife and be greeted with a guard of honour from RAF Halton and bagpipers. The president and prime minister will view the Sir Winston Churchill archives held at Chequers, before having a bilateral meeting and joining a business reception with the chancellor before a press conference. First lady will meet Scouts In the meantime, the first lady will carry out engagements with the Queen and Kate at Windsor. She will tour Queen Mary's Doll's House and the Royal Library with the Queen, before joining Kate in Frogmore Gardens to meet chief Scout Dwayne Fields, as well as members of the Scouts' Squirrels programme as they learn about nature to achieve their Go Wild badge. The US president will not visit Parliament - the House of Commons will be in recess for party conference season, though the House of Lords will still sit. The Trumps' visit has been shortened slightly to his busy schedule. It was originally planned to span from 17-19 September, but now Mr Trump, who is arriving on 16 September, will leave on 18 September."
    },
    {
        "title": "Sir Elton John 'so proud' of Watford FC as new kit marks 50 years since he became chairman",
        "description": "Sir Elton John has said he is \"so proud\" of Watford FC as the football club released a new kit marking 50 years since he became its chairman.",
        "url": "https://news.sky.com/story/sir-elton-john-so-proud-of-watford-fc-as-new-kit-marks-50-years-since-he-became-chairman-13428296",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sir-elton-john-watford_7016328.jpg?20250910173640",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-10 16:00:00",
        "Headline": "The blue kit will be worn by the Championship side for the first time on Saturday in their home game against Blackburn.",
        "Content": "Sir Elton John has said he is \"so proud\" of Watford FC as the football club released a new kit marking 50 years since he became its chairman. The blue shirts and silver shorts will be worn by the Championship team for the first time in their home game against Blackburn Rovers on Saturday. Watford, who are nicknamed the Hornets, have worn yellow home shirts since 1959. The choice of blue is inspired by the colour Watford wore during the singer's early days as a supporter. Speaking in a launch video for the kit, the 78-year-old musician said: \"My passion for this club has never died, and I'm so proud of this club, ever since I was five years old when we played in blue and there were two rickety old stands. \"What can I say? It's in my heart and my soul, you can't get rid of it. The supporters of this club have always been in my heart.\" The shirt is inspired by the artwork for his Diamonds hits compilation, and features his E logo, an embossed print of the lyrics of his hit track Your Song, and the Happy Hornet badge, which was the club logo when Sir Elton became chairman in 1976. \n                  Elton John unable to watch premiere of his new musical \n                 \n                  'I can't see anything': Elton John unable to finish new album\n                 \n                  Elton John, 77, reflects on his mortality: 'I don't know how much time I have left'\n                 Complementing the shirt are silver shorts with E taping running down both sides. The silver WFC crest features on the shorts. Sir Elton remains honorary life president at the club, having left his second stint as chairman in 2002, with Watford crediting the star with changing \"the trajectory and future of the club forever\". During his time as chairman, the club rose from the fourth division to second place in the top flight in the late 1970s and early 1980s, playing European football and reaching an FA Cup final. Watford are currently managed by Paulo Pezzolano. The team are 14th in the Championship table, having won just one of their first five league matches. Sir Elton has enjoyed 10 UK number one albums and 10 UK number one singles during his career. Read more arts and entertainment news:New Banksy artwork removed from wall in LondonSam Fender, Pulp, and Wolf Alice among Mercury Prize nominees He is best known for songs such as Saturday Night's Alright For Fighting, Goodbye Yellow Brick Road and Candle In The Wind. The shirts will be in a special edition gift box, and will be available in the club's shops and online from 9am on Friday. Fans can pre-order now."
    },
    {
        "title": "Would you invite Putin? MPs' outrage as Starmer defends Israeli president's visit",
        "description": "Sir Keir Starmer has defended welcoming the Israeli president to Downing Street as MPs raised concerns about allowing him into the UK.",
        "url": "https://news.sky.com/story/would-you-invite-putin-mps-outrage-as-starmer-defends-israeli-presidents-visit-13428203",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-pmqs_7016054.jpg?20250910122413",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-10 13:45:00",
        "Headline": "The prime minister welcomed Isaac Herzog to Downing Street on Wednesday, despite cross-party criticism of the meeting.",
        "Content": "Sir Keir Starmer has defended welcoming the Israeli president to Downing Street as MPs raised concerns about allowing him into the UK. Sir Keir and Isaac Herzog met in Number 10 on Wednesday afternoon. Earlier, at Prime Minister's Questions (PMQs), Sir Keir told the House of Commons that \"however difficult, the UK must not walk away from a diplomatic solution\" to the war in Gaza. Politics latest: Badenoch calls for Mandelson to be sacked \"We will negotiate and we will strain every sinew, because that is the only way to get the hostages out, to get aid in and to stop the killing,\" he told MPs. The PM said it was intention to make \"absolutely clear\" to Mr Herzog that Britain condemned Israel's bombing of Hamas leaders in Qatar 24 hours earlier. Shrugging off criticism, the PM added it would be the \"politics of students\" not to meet Mr Herzog after the SNP's Westminster leader Stephen Flynn gave an impassioned speech against the Israeli president's visit. \n                  Labour deputy leadership: Contest to replace Rayner set to become two-horse race\n                 \n                  MPs around the world urge leaders to follow Trump's call for Jimmy Lai's release\n                 \n                  How many illegal migrants are in Britain? The key numbers driving the immigration debate\n                 Mr Flynn said: \"Would he invite Vladimir Putin into No 10? Would he invite Benjamin Netanyahu into No 10? \"What does it say of this prime minister that he will harbour this man whilst children starve?\" Following Mr Herzog's visit to Number 10, the Israeli president said: \"Britain and Israel are friends, but among friends there are sometimes disagreements.\" He said he \"made clear\" the UK's intention to recognise a Palestinian state would \"in no way help bring the hostages home, help the Palestinians, or help bring an end to the conflict\" - but would instead \"embolden extremists\". The president also told Sir Keir it was \"dangerous\" to \"echo Hamas's propaganda campaign of starvation in Gaza\". MPs question Herzog visit Dozens of MPs from all parties, including Labour, questioned the legal standing of Sir Keir welcoming Mr Herzog. The Israeli president has previously said there are \"no innocent civilians in Gaza\" and \"it is an entire nation that is responsible\". He was also pictured signing an artillery shell before it was fired towards Gaza in December. The prime minister's spokesman said the attack in Qatar is a \"clearly unacceptable act\" and said it \"of course\" would be one of the subjects raised with Mr Herzog. He added Sir Keir will be \"clear\" with Mr Herzog about the risk of Israel escalating its actions. Handcuffs not handshakes New Green Party leader Zack Polanski called for \"handcuffs not handshakes\" as he said Scotland Yard's war crimes unit should be waiting inside Number 10 to handcuff Mr Herzog \"and take him away for questioning\". Mr Polanski, who won the Greens leadership election last week and is Jewish, accused Mr Herzog of being \"complicit while the Israeli government has engaged in committing genocide in Gaza\". Israel has continually denied it is carrying out a genocide in Gaza, but last week, the world's leading association of genocide scholars declared it is. Earlier this week, the UK government concluded Israel is not committing genocide in Gaza. Herzog is a conduit The Liberal Democrats tabled an urgent question following PMQs, calling on the foreign secretary to make a statement on the implications of Israel's strike in Qatar. Foreign Office minister Hamish Falconer took to the despatch box to defend Mr Herzog's visit, saying: \"President Herzog is on a private visit to the UK. \"He is not a functional part of the government; he is an important conduit to raise these concerns.\"  Mr Falconer said the UK is supporting a motion for an emergency meeting of the UN Security Council on Wednesday evening and revealed Foreign Secretary Yvette Cooper is speaking to the E3 (UK, France and Germany) and G7 allies, including the US about Israel's attack on Qatar. He added that Ms Cooper met Mr Herzog in the morning and \"amongst other things\" asked him to ensure greater support from the Israeli government to get children with injuries and students out of Gaza. As PMQs was taking place, union members at the Trades Union Congress (TUC) conference unanimously passed a motion to oppose Mr Herzog's visit. On Tuesday evening, 60 cross-party MPs and Lords gathered outside parliament to condemn Mr Herzog's visit after they sent a letter to Sir Keir asking what legal advice the government has received about Mr Herzog's visit and whether his entry to the UK \"is compatible with our obligations under the Genocide Convention\"."
    },
    {
        "title": "Trump has 'heated phone call' with Netanyahu over strike targeting Hamas in Qatar",
        "description": "Donald Trump had a heated phone call with Israeli Prime Minister Benjamin Netanyahu after his military targeted Hamas inside Qatar, according to a report.",
        "url": "https://news.sky.com/story/trump-has-heated-phone-call-with-netanyahu-over-strike-targeting-hamas-in-qatar-13428486",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-donald_6879194.jpg?20250407183847",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-10 22:13:00",
        "Headline": "The US president said the Israeli decision to strike inside Qatar was not wise but Benjamin Netanyahu said he had a brief window to launch the airstrike and took the opportunity, the Wall Street Journal reported.",
        "Content": " Donald Trump had a heated phone call with Israeli Prime Minister Benjamin Netanyahu after his military targeted Hamas inside Qatar, according to a report. The American president told Mr Netanyahu on Tuesday that the decision to strike inside the US ally's territory was not wise, The Wall Street Journal reported, citing senior administration officials. The Israeli prime minister responded by saying he had a brief window to launch the airstrike and took the opportunity, according to the newspaper.  A second call between the two leaders later that day was cordial, with Mr Trump asking Mr Netanyahu if the attack had been successful, the publication added. Israel attempted to kill the political leaders of the Islamist group Hamas with the attack in the Qatari capital Doha on Tuesday. Hamas has said its top leaders survived the airstrike, but five members were killed, including the son of its exiled Gaza chief and top negotiator Khalil al Hayya. The Israeli military operation in Doha has been widely condemned internationally and was particularly sensitive as Qatar has been hosting and mediating in negotiations which are trying to bring about a ceasefire in the war in Gaza. On Wednesday, Mr Netanyahu warned Qatar to either expel Hamas officials or \"bring them to justice. Because if you don't, we will\". Qatar has hit back at him, saying his comments about the Gulf nation hosting a Hamas office were \"reckless\". Meanwhile, the Israeli ambassador to the US, Yechiel Leiter, has said that if Israel failed to kill Hamas leaders on Tuesday, it would succeed next time. \"We have put terrorists on notice, wherever they may be... we're going to pursue them, and we're going to destroy those who will destroy us,\" he said. The airstrike took place shortly after Hamas claimed responsibility for Monday's shooting at a bus stop on the outskirts of Jerusalem that killed six people. Read more:Analysis: Israel has crossed a huge diplomatic red line In another development, Sir Keir Starmer has had talks with Israeli President Isaac Herzog in Downing Street, with Mr Herzog saying they argued during a \"tough meeting\".  PM condemns Israeli action The prime minister has condemned the Israeli attack in Qatar, and raised the matter with the president, saying it was \"completely unacceptable\". \"He said the strikes were a flagrant violation of a key partner's sovereignty and do nothing to secure the peace we all desperately want to see,\" a Downing Street spokesperson said. Israel has been angered by Britain's plans to join several other Western countries, including France and Canada, in recognising a Palestinian state later this month - unless Israel meets conditions including a ceasefire in Gaza. \"Things were said that were tough and strong, and clearly we can argue, because when allies meet, they can argue. We are both democracies,\" Mr Herzog said at an event at Chatham House. He also proposed offering a \"fact-finding mission\" to Israel, \"sitting with us and studying the situation in Gaza on the humanitarian level\". \"Because we have full answers, and we are fully transparent,\" he said."
    },
    {
        "title": "MPs around the world urge leaders to follow Trump's call for Jimmy Lai's release",
        "description": "MPs from around the world are urging their heads of state to follow Donald Trump's call for jailed Hong Kong media tycoon Jimmy Lai's release as he awaits a verdict.",
        "url": "https://news.sky.com/story/mps-around-the-world-urge-leaders-to-follow-trumps-call-for-jimmy-lais-release-13428242",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-china-jimmy-lai_6989838.jpg?20250818052458",
        "type": "World",
        "Author": "Alix Culbertson",
        "Date Published": "2025-09-10 15:12:00",
        "Headline": "Jimmy Lai is awaiting a verdict in his national security trial in Hong Kong, five years after he was arrested for taking part in pro-democracy protests.",
        "Content": "\n          Political reporter\n              @alixculbertson\n MPs from around the world are urging their heads of state to follow Donald Trump's call for jailed Hong Kong media tycoon Jimmy Lai's release as he awaits a verdict. Parliamentarians from 16 countries, ranging from the UK and Canada to Zambia and Paraguay, have written to their prime ministers and presidents in a coordinated global effort to get them to \"form a united coalition\" in support of Mr Lai. The 77-year-old Apple Daily newspaper founder, who is a British citizen with no other passport, has been in prison in Hong Kong since December 2020 and is awaiting the final verdict in his trial, with no date set. It could come any day now. He is accused of conspiring to collude with foreign forces and sedition under the national security law imposed on Hong Kong by Beijing following pro-democracy protests he was involved with in 2019. In August, the US president renewed his promise to \"save\" Mr Lai, saying he is \"going to do everything\" he can to get him freed, after initially pledging to \"100% get him out\" weeks before the US election last November. Now, parliamentarians, including British MPs and Lords, who are members of the Inter-Parliamentary Alliance on China (IPAC), are calling on their leaders to follow suit. In their letter, IPAC MPs, a group of politicians in different countries with an interest in China relations, have urged their state leaders to \"join with\" the US to \"prioritise advocacy on Mr Lai's behalf, and to stand in solidarity with other global leaders to form a united coalition in support of Mr Lai\". The MPs wrote: \"A clear and coordinated international response is essential to challenge the injustice he faces and to reaffirm the universal principles of democracy, human rights, and freedom of the press.\" They said without a globally coordinated intervention \"at the highest levels\" Mr Lai will be convicted and die in prison. \"We implore you to take up Mr Lai's case personally, in coordination with other leaders of democratic countries,\" they said. Mr Lai's son, Sebastien Lai, told Sky News last month that if the British government fails to act, \"my father is most likely going to die in jail\". The MPs have said Mr Lai is now an elderly man who has been separated from his family and held in solitary confinement for more than four years \"simply for democratic values and the basic freedoms promised to the people of Hong Kong\". Read more:Who is Jimmy Lai?Why Jimmy Lai's case is major sticking point for Starmer's relations with China  Signatory and UK Labour MP Sarah Champion, chair of the international development committee, told Sky News: \"Jimmy Lai has been left to languish in solitary confinement for over four years, his imprisonment is a blatant violation of human rights and press freedom. \"A strong and united global response is needed and Britain must join with our allies in calling for his immediate release.\" MPs who are sending letters to their leaders come from: Albania, UK, Canada, France, Kenya, Sweden, Australia, Romania, Zambia, The Phillippines, the European Parliament, Bosnia and Herzegovina, Paraguay, Netherlands, New Zealand and Norway. The Chinese embassy in London has previously denied claims the prosecution of Mr Lai is to silence criticism. A spokesman said the UK's previous remarks criticising Hong Kong over Mr Lai \"confuse right and wrong and interfere with the rule of law in Hong Kong. We are firmly opposed to that\". They have repeatedly said Hong Kong is governed by the rule of law and \"any illegal criminal behaviour should be punished by law\"."
    },
    {
        "title": "Drones and salami: How Putin is testing the West with Poland airspace violation",
        "description": "The unprecedented Russian drone attacks on Poland are both a test and a warning.&#160; How Europe and NATO respond could be crucial to security on this continent.",
        "url": "https://news.sky.com/story/drones-and-salami-how-putin-is-testing-the-west-with-poland-airspace-violation-13428128",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-vladimir-putin-russian_7016116.jpg?20250910134606",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-09-10 10:59:00",
        "Headline": "The Russian president is good at \"salami slicing\" - the tactic of using small actions to produce a much bigger outcome that otherwise would have been more provocative.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  The unprecedented Russian drone attacks on Poland are both a test and a warning.  How Europe and NATO respond could be crucial to security on this continent. The Russians are past masters at what's called \"salami slicing\". Tactics that use a series of smaller actions to produce a much bigger outcome that otherwise would have been far more provocative. The Kremlin is probing the West with gradual but steady escalation. A British Council building and an EU installation are bombed in Kyiv; a senior EU official's plane's GPS is jammed. On their own each provocation produces nothing more than rhetoric from the West - but new lines are crossed and Russia is emboldened. Ukraine war latest: NATO chief sends message to Putin Putin is good at this. He used salami slicing tactics masterfully in 2014 with his \"little green men\" invasion of Crimea, a range of ambiguous military and diplomatic tactics to take control. The West's confused delay in responding sealed Crimea's fate. He has just taken a larger slice of salami with his drone attacks on Poland. They are of course a test of NATO's readiness to deploy its Article 5 obligations. Russia has attacked a member state, allies believe deliberately. Will NATO trigger the all for one, one for all mechanism in Poland's defence and attack Russia? Not very likely. But failing to respond projects weakness. Putin will see the results of his test and plot the next one. Expect lots of talk of sanctions but remember they failed to avert this invasion and have failed to persuade Russia to reverse it. The only sanctions likely to bite are the ones the US president refuses to approve, on Russia's oil trade.  So how are the drones also a warning? Well, they pose a question. Vladimir Putin is asking the West if it really wants to become more involved in this conflict with its own forces. Europeans are considering putting boots on the ground inside Ukraine after any potential ceasefire. If this latest attack is awkward and complicated and hard to respond to now, what happens if Russia uses hybrid tactics then? Deniable, ambiguous methods that the Russians excel in could make life very difficult for the alliance if it is embroiled in Ukraine. Think twice before committing your troops there, Russia is warning the West. Read more:The pivotal question for NATOTrump ready to move to second stage of Russia sanctions There is more Europe could do. It could stop buying Russian energy, which it is still astonishingly importing - more than 20 billion euros a year at the last count. It could use its massive economic advantage (20 times that of Russia's, and that was before the war) to do more to fund Ukraine's defence. While it continues to do neither, expect more excruciating slices of the salami to come."
    },
    {
        "title": "UK looking to reinforce Poland's air defences - as EU diplomat warns 'Ukraine war is escalating'",
        "description": "The UK is looking to bolster Poland's air defences after suspected Russian drones were shot down in its airspace.",
        "url": "https://news.sky.com/story/uk-looking-to-reinforce-polands-air-defences-as-eu-diplomat-warns-ukraine-war-is-escalating-13428233",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-russian-drone-poland_7015838.jpg?20250910094437",
        "type": "World",
        "Author": "Michael Drummond",
        "Date Published": "2025-09-10 14:50:00",
        "Headline": "The alleged breach of Polish airspace by Russian drones - leading to an operation to shoot some down with NATO airplanes - has raised tensions in Europe.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n The UK is looking to bolster Poland's air defences after suspected Russian drones were shot down in its airspace. It is the first time a NATO country is known to have fired shots during Russia's war in Ukraine and raises concerns of a wider conflict. In a bleak message, Polish Prime Minister Donald Tusk said it was \"the closest we have been to open conflict since World War Two\", but added that there was \"no reason to believe we're on the brink of war\". Moscow denied responsibility for the incident, with the Russian defence ministry saying its drones had carried out a major attack on western Ukraine but it had not planned to hit any locations in Poland. What happened in Poland? NATO fighter planes were scrambled as part of the operation to shoot down suspected Russian drones that had allegedly breached Poland's airspace on Tuesday evening and kept coming until morning, officials say. Poland says 19 objects had entered its airspace during a Russian air attack on Ukraine, many from Belarus, and that those that posed a threat were shot down. Seven drones have been found, as well as parts of one missile, according to Poland's interior ministry. Warsaw's armed forces command called it \"an unprecedented violation of Polish airspace\", adding: \"This is an act of aggression that posed a real threat to the safety of our citizens.\" Belarus, a close ally of Russia, said it tracked some drones that \"lost their course\" because they were jammed. However, several European leaders say they think the incursion amounted to an intentional escalation by Russia. Read more:Drones and salami: How Putin is testing the WestAnalysis: The pivotal question for NATO  How is NATO involved? Poland is a key member of NATO and has one of the biggest militaries in Europe, one that has only increased in size since Vladimir Putin's full-scale invasion of Ukraine in 2022. Airplanes from other NATO nations - the Netherlands and Italy - were involved in the operation to shoot down the drones. NATO chief Mark Rutte said the incident showed that the alliance is able to defend \"every inch\" of NATO territory \"including, of course, its airspace\". Leaders and diplomats from various NATO countries have been involved in fervent discussions in the aftermath of the incident. Article 5 of the alliance treaty states that an attack on one member is considered an attack on all members, but Poland has not invoked that at this time. Instead, Prime Minister Tusk said his country has asked that Article 4 be invoked, which allows alliance members to consult with other members on issues. Foreign news reporter Prime Minister Donald Tusk has said Poland is invoking Article 4 of the NATO treaty in response to the alleged drones incident. Article 5 – the principle of collective self-defence – is well known, but Article 4 is different. Under the treaty, any member of the 32-strong alliance can formally invoke Article 4 to bring an issue to the attention of the North Atlantic Council – NATO’s decision-making body. The article states: “The Parties will consult together whenever, in the opinion of any of them, the territorial integrity, political independence or security of any of the Parties is threatened.” As soon as Article 4 is invoked, the issue is discussed and can potentially lead to some form of joint decision or action on behalf of NATO. It does not necessitate any form of armed intervention. Unlike Article 5, which has only been invoked once, Article 4 has been invoked seven times in NATO’s history. Most recently, Bulgaria, the Czech Republic, Estonia, Latvia, Lithuania, Poland, Romania and Slovakia requested to hold consultations under Article 4 on 24 February 2022 in response to Russia’s full-scale invasion of Ukraine. Starmer condemns 'reckless Russia' as allies look to bolster Poland Prime Minister Sir Keir Starmer was among the leaders of Poland's allies to criticise Moscow and offer support to Warsaw. He denounced the \"unprecedented violation of Polish and NATO airspace\" as well as the \"barbaric attack\" on Ukraine. \"This was an extremely reckless move by Russia and only serves to remind us of President Putin's blatant disregard for peace, and the constant bombardment innocent Ukrainians face every day,\" he said. The UK is also looking for ways to bolster Poland's air defences, British defence secretary John Healey said. Kaja Kallas, the EU's top diplomat, warned that \"Russia's war is escalating\" and called on the bloc to \"raise the cost on Moscow\" and invest in Europe's defence. Ukrainian President Volodymyr Zelenskyy, whose country endures nightly barrages of Russian drone attacks, said: \"Ukraine is ready to expand our cooperation with partners for reliable protection of the sky. So that we have not only information and intelligence data sharing, but also real joint actions that guarantee security of the neighbours. \"Russia must feel that Europeans know how to defend themselves.\" What does Russia say? The Kremlin has denied responsibility for what happened. Russia's defence ministry said its drones had carried out a major attack on military facilities in western Ukraine, but that it had not planned to hit any targets in Poland. Kremlin spokesperson Dmitry Peskov said the EU and NATO \"accuse Russia of provocations on a daily basis. Most of the time without even trying to present at least some kind of argument.\""
    },
    {
        "title": "The pivotal question for NATO as it decides how to respond after Russian drones violate Polish airspace",
        "description": "What was Russia's intent? That's the pivotal question as Poland and its NATO allies consider their response to drones violating&#160;its airspace.",
        "url": "https://news.sky.com/story/russian-drones-may-have-been-testing-nato-but-how-will-it-respond-13428012",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-poland-drone-russia_7015875.jpg?20250910100848",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-09-10 09:09:00",
        "Headline": "Poland said \"a huge number\" of Russian drones had entered its airspace and those that posed a direct threat were shot down - but now any response must be careful to avoid escalating the war in Ukraine.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n  What was Russia's intent? That's the pivotal question as Poland and its NATO allies consider their response to drones violating its airspace. The Polish prime minister, Donald Tusk, said \"a huge number\" of Russian drones entered its airspace, and those that posed a direct threat were shot down. He's now consulting both the NATO chief and his partners. They will be assessing whether this was a deliberate targeting of Poland and, if so, why? Tusk has said he thinks it was \"likely a large-scale provocation\". Ukraine war latest: Drone incursion was intentional, says NATO In essence, Russia was deliberately testing the West and NATO's response. The Ukrainians seem to agree with this assessment, as does the vice president of the EU Commission. If correct, that's a serious escalation. So, what now? One option is for Poland to trigger NATO's Article 4, which allows it to consult other members when it believes its security is threatened. Poland and some of its allies used this option following the outbreak of the war in Ukraine in 2022. It considered triggering it again later that year when a missile killed two people in a Polish border town until it became clear it was likely a Ukrainian air defence missile. Another response is to further reinforce border defences. The EU defence minister has said \"we must urgently develop a drone wall along the entire EU eastern flank\". The EU is already preparing a 19th sanctions package. It will be looking to the US to follow up on its threats of tougher sanctions as well. \"By entering Polish airspace with attack drones, Russia is testing not only Poland but also the United States as NATO's main deterrent force,\" tweeted Marko Mihkelson, chairman of Estonia's foreign affairs committee. Read more:Putin sends grave warning to Ukraine's alliesWhy fears of a Russian attack on Europe are not 'hysteria'  NATO will discuss the situation at a meeting on Wednesday and decide how it wants to respond. It must strike a careful balance between a firm reaction to this suspected test of its resolve and avoiding an escalation in the ongoing war."
    },
    {
        "title": "Flight tracking shows NATO response to Russian incursion in Poland",
        "description": "The advance of Russian drones crossed into Poland around 1.50am local time, with several drones reportedly entering the country from Belarus.",
        "url": "https://news.sky.com/story/flight-tracking-shows-nato-response-to-russian-incursion-in-poland-13428289",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-dxf-drone-poland-teaser_7016314.png?20250910172208",
        "type": "World",
        "Author": "Kaitlin Tosh and Freya Gibson, Data &amp; Forensics Unit",
        "Date Published": "2025-09-10 15:50:00",
        "Headline": "At least 19 Russian drones entered Polish airspace last night, resulting in widespread condemnation from Polish allies and a swift NATO response.   ",
        "Content": "By Kaitlin Tosh and Freya Gibson, Data & Forensics Unit  The advance of Russian drones crossed into Poland around 1.50am local time, with several drones reportedly entering the country from Belarus. As Polish and NATO forces struck them down from the skies, litter and debris rained down across the country. Sky News has verified multiple locations where Russian drones crashed. Wyryki-Wola, in the Lublin district in eastern Poland, was affected the most. But drones were found in northern, eastern, and southeastern areas of the country. All of these verified locations are residential areas. A total of seven drones and the remains of an unidentified object were found by Polish authorities across the country. Sky News has verified three images of the Russian drones that landed in Poland as Chinese-designed 'Gerbera' drones. One reached the northern town of Olesno, around 400km from the Ukrainian border. The Gerbera was first deployed by Russia in July 2024 and is primarily used as a decoy drone. It gives a very similar radar signature to other destructive drones being used in the war - like Shahed drones - but is built from low-cost materials like plywood or foam, making it about 10% of the price to produce. \n                  Sudan war: Torture, rape and forced starvation as paramilitaries suffocate besieged city\n                 \n                  Trump has 'heated phone call' with Netanyahu over strike targeting Hamas in Qatar\n                 \n                  MPs around the world urge leaders to follow Trump's call for Jimmy Lai's release\n                 \"The Gerbera drones have mostly been used as decoys to be shot down and waste a resource,\" says Rick Rickard, Operations Director at EODynamics. There have been reports of Gerbera drones being weaponised in Ukraine, but it is unclear if the drones in Poland were armed. \"It's clearly a provocation, but it's one where Russia can row back from it and say, \"no, we didn't send any armed drones over\", says Rickard. NATO response  NATO forces were quick to respond to the incursion, with Dutch and Polish fighter jets shooting down several Russian drones, with help from Ukraine. In a statement President Zelenskyy said, \"Ukrainian forces were informing the Polish side through the relevant channels about the movement of Russian drones\" through the night. Flight tracking shows a Dutch refueling plane leaving Eindhoven in the Netherlands at 9.45pm UTC (11.45 local time) - before the drones entered Polish airspace. It circled for three hours alongside a Polish Air Force plane above Lubin, the district impacted by the overnight drone debris, before returning to the Netherlands. The refueling planes would have been supporting fighter jets, allowing them to stay airborne for longer - the Dutch defense ministry said their F-35 jets shot down \"several Russian drones\". The Polish Air Force had earlier deployed their plane from Deblin, Poland, at around 7pm UTC (9pm local time), which circled the Lublin area until around 4.25am UTC (6.25am local time). Drone warfare  This incursion comes at a time when drones are being used heavily in the war in Ukraine. There have been over 17,500 drone and air strikes on Ukraine so far in 2025, more than double the amount that occurred in the same time period last year. Most strikes have been concentrated on the Ukrainian front lines, or in major cities like Kiev. Before today, conflict monitoring organisation ACLED had recoded at least 50 incidents of airspace violations in countries on Ukraine's western borders since the start of the war. Only four of those occurred in Poland. \"Regardless of whether this was indeed intentional, the downing of a Russian attack and/or decoy drones over NATO territory is bringing everyone involved into uncharted territory,\" said ACLED Europe and Central Asia Senior Analyst Nichita Gurcov in a statement. Military analyst Why did Moscow extend these tactics last night to encroaching on NATO's sovereign territory? Probably for two general reasons. One was to send a signal to West European governments that any notion of placing European forces inside Ukraine as part of some 'reassurance force' in the event of a ceasefire deal would be dangerous. The Russians constantly declare that any western responses that help Ukraine increase the risk of war in Europe - Moscow's playbook is very consistent on this issue. Everything the Europeans say or do that Moscow doesn't like is met with the idea that it might spark a war with them. The other reason is that Russia evidently intends in the longer term to challenge NATO in the air, at sea and on the ground, right up to the threshold of outright military hostility - up to the NATO 'Article 5' threshold in other words.  It aims to normalise these sort of activities so that the Article 5 boundaries become fuzzy and harder to define. Then NATO will be a great deal weaker - all the more so if the US has effectively disengaged itself from the European allies. Additional reporting by Sophia Massam, junior digital investigations journalist. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Bombs in Doha and drones in Poland ",
        "description": "<a href=' https://podfollow.com/the-world-with-richard-and-yalda'>👉Listen to The World With Richard Engel And Yalda Hakim on your podcast app👈</a>",
        "url": "https://news.sky.com/story/bombs-in-doha-and-drones-in-poland-13428417",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-sky-news-nbc-news-podcast_6696060.jpg?20241002120922",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-10 19:57:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to The World With Richard Engel And Yalda Hakim on your podcast app👈 How significant is Israel's airstrike on Hamas leaders in Doha, Qatar?  And, with Russian military drones being shot down in Polish airspace, what will NATO do? Richard and Yalda debrief on the international reaction to the latest from the Middle East and Europe. Also featuring interviews with the US ambassador to Israel Mike Huckabee and NATO general secretary Mark Rutte. If you'd like to get in touch or ask Richard and Yalda a question, you can email: theworld@sky.uk."
    },
    {
        "title": "Military curfew brings an uneasy calm to Nepal's capital after violent protests",
        "description": "Today, the streets of Kathmandu felt worlds apart from just 12 hours before.",
        "url": "https://news.sky.com/story/military-curfew-brings-an-uneasy-calm-to-nepals-capital-after-violent-protests-13428239",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nepal-cordelia-lynch_7016250.jpg?20250910163437",
        "type": "World",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-09-10 15:02:00",
        "Headline": "This week's protests have shown the power of Nepal's youth, but it's unclear where the country will go from here.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n Today, the streets of Kathmandu felt worlds apart from just 12 hours before. Gone were the thousands of protestors rejoicing as they saw the symbols of Nepal's political class in flames. Gone were the cries of \"revolution\".  The roads were quiet, a silence punctuated only by the sound of military vehicles passing. The army, who were strikingly absent yesterday as politicians and government buildings came under attack, were back out in force - guarding those institutions and enforcing a curfew. They vowed to bring things under control and there was at least a sense of calm. But inside parliament, we saw the stark aftermath of protests that almost wiped out the ruling elite. The building was full of mangled metal, charred filing cabinets and shattered glass. The air was still thick with smoke. Looking around at the destruction, I wondered if it would hurt or further Gen Z's cause. They made their leadership look exposed and unseated. It's too early to see if this is a moment for democratic renewal or the start of democracy unravelling. \n                  Sudan war: Torture, rape and forced starvation as paramilitaries suffocate besieged city\n                 \n                  Trump has 'heated phone call' with Netanyahu over strike targeting Hamas in Qatar\n                 \n                  MPs around the world urge leaders to follow Trump's call for Jimmy Lai's release\n                 Outside, some young campaigners have turned up to clear away the mess, lamenting what had so suddenly unfolded. Rubina Shrestha, 26, has come with her four relatives to help. She looks forlorn and frustrated. \"It's very sad to see our country like this, because this is not what we hoped for, not what we imagined, not what we wanted,\" she says. \"We just wanted a peaceful protest but everything turned into violence, everything turned into negativity.\" Umesh Shah, 30, is sweeping the floor, his hands full of ash, sweating in the sun and looking reflective. \"We felt so bad, we were crying all night - everywhere totally collapsed,\" he says, rattling off a long list of the institutions of power that the protesters had targeted. But the rage that sparked this moment still burns deep in Nepal. It is fuelled by a young generation that believes its leadership is corrupt, self-serving and nepotistic - lining their own families' pockets while leaving the rest of the country in the dust. They want to see real meaningful change, and they've created a political vacuum they believe they can fill. There are some signs of dialogue: the army's Chief of Staff has invited Gen Z leaders for talks. It's unclear what might emerge from them but there will have to be concessions, some shifts in the power players at the top and the way they lead, to placate the many young people who took to the streets and could well do so again.  It does feel quieter in Kathmandu, perhaps a sign that some stability has been restored. But many people are also taking the time to work out what to do next. The unrest has unsettled the country, and its consequences are still playing out. At Dillibazar prison we watched as hundreds of prisoners who tried to escape during the protests were piled onto vans and taken to another jail. They'd set alight to the building and tried to make a run for it. One man told us that other inmates had escaped from other prisons, so why shouldn't they? This was more than a fleeting episode in Nepal's political history. It has shown the power of the youth here. Quite what that power translates into, though, remains very unclear."
    },
    {
        "title": "Riot police clash with 'Block Everything' protesters in Paris",
        "description": "Riot police have clashed with protesters in Paris after they took to the streets in response to calls to 'Block Everything' over discontent with the French government.",
        "url": "https://news.sky.com/story/riot-police-clash-with-block-everything-protesters-in-paris-13428072",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-paris-france-protest_7015987.jpg?20250910112627",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-10 10:16:00",
        "Headline": "Tens of thousands of people have taken to the streets in Paris, Marseille, and Montpellier in response to the online 'Bloquons Tout' campaign, which is urging people to strike, block roads, and other public services.",
        "Content": " Riot police have clashed with protesters in Paris after they took to the streets in response to calls to 'Block Everything' over discontent with the French government. Tens of thousands of people have taken to the streets of the French capital and other cities, including Marseille and Montpellier, in response to the online 'Bloquons Tout' campaign, which is urging people to strike, block roads, and other public services. The government has deployed more than 80,000 officers to respond to the unrest, which has seen 200 arrested nationwide so far, according to police, and comes on the same day the new prime minister is being sworn in. Demonstrators were seen rolling bins into the middle of roads to stop cars, while police rushed to remove the makeshift blockades as quickly as possible. Tear gas was used by police outside Paris's Gare du Nord train station, where around 1,000 gathered, clutching signs declaring Wednesday a public holiday. Others in the city blocked the entrance to a high school where firefighters were forced to remove burnt objects from a barricade. Elsewhere in the country, traffic disruptions were reported on major roads in Marseille, Montpellier, Nantes, and Lyon. Interior Minister Bruno Retailleau told reporters a group of protesters had torched a bus in the Breton city of Rennes. Read moreFrance's economic crisis explained Fourth prime minister in a year The 'Block Everything' rallies come amid spiralling national debt and are similar to the Yellow Vest movement that broke out over tax increases during President Emmanuel Macron's first term. 'Bloquons tout' was first spearheaded online by right-wing groups in May but has since been embraced by the left and far left, experts say. On Monday, former Prime Minister Francois Bayrou lost a vote of no confidence, and was replaced by Sebastien Lecornu at the Hotel Matignon on Wednesday afternoon, becoming the fourth person in the job in just 12 months. A teacher, Christophe Lalande, taking part in the Paris protests, told reporters at the scene: \"Bayrou was ousted, [now] his policies must be eliminated.\" Elsewhere, union member Amar Lagha said: \"This day is a message to all the workers of this country: that there is no resignation, the fight continues, and a message to this government that we won't back down, and if we have to die, we'll die standing.\""
    },
    {
        "title": "Charlie Kirk: Trump condemns 'heinous assassination' of conservative influencer",
        "description": "Donald Trump has said he is \"filled with grief and anger\" after the \"heinous assassination\" of right-wing influencer Charlie Kirk.",
        "url": "https://news.sky.com/story/powerful-right-wing-influencer-charlie-kirk-hit-after-shots-fired-at-an-event-in-utah-13428272",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-charlie-kirk_7016510.jpg?20250910210942",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-10 15:40:00",
        "Headline": "Mr Kirk and his Turning Point USA organisation played a key role in driving youth support for Donald Trump in last November's presidential election.",
        "Content": " Donald Trump has said he is \"filled with grief and anger\" after the \"heinous assassination\" of right-wing influencer Charlie Kirk. Mr Kirk, a staunch ally of the US president, was shot dead at a university event in Utah on Wednesday afternoon. Mr Trump announced the death of the 31-year-old conservative on social media, hailing him as a \"great, and even legendary\" figure who was \"loved and admired by all, especially me\". In a later address from the Oval Office the president said: \"I am filled with grief and anger at the heinous assassination of Charlie Kirk. \"He inspired millions and tonight all who knew him and loved him are united in shock and horror.\" \"This is a dark moment for America,\" Mr Trump added, as he vowed a crackdown on \"political violence\". The video message from the White House came after FBI director Kash Patel said a person arrested over the shooting at Utah Valley University had been released after \"interrogation by law enforcement\". Utah Governor Spencer Cox had described them as a \"person of interest\", and labelled the killing a \"political assassination\". Read more: Charlie Kirk was a MAGA spokesman to young people across America Earlier, witnesses said they heard shots fired from a nearby building as Mr Kirk spoke, a university spokesperson told Sky's US partner NBC News. Authorities said the shooter wore dark clothing and fired from a roof on the campus. Videos on social media show Mr Kirk talking into a microphone while sitting under a white tent with the slogans \"The American Comeback\" and \"Prove Me Wrong\". A single shot is heard, and Mr Kirk can be seen reaching up with his right hand as blood comes out from the left side of his neck. He then falls off his chair. A university spokesperson confirmed he had been shot in the neck. He was then taken to hospital by private security and underwent surgery. Mr Trump earlier asked people to pray for the activist.  Who was Charlie Kirk? The father-of-two was the chief executive and co-founder of Turning Point USA, a prominent organisation that engages conservative youth on school campuses. The university had said a suspect was in custody but later clarified that was not the case. Mr Kirk and Turning Point USA played a key role in driving youth support for Mr Trump in last November's presidential election. His events at college campuses nationwide typically draw large crowds. Mr Trump often spoken favourably about Mr Kirk, including multiple times on the campaign trail last year. During a rally in Washington the day before he was sworn in for a second term in January, Mr Trump told attendees: \"Charlie Kirk is here. And I want to thank Charlie. Charlie is fantastic. I mean, this guy.\" Read more from Sky News:Donald Trump suffers legal setback in bid to fire Fed governorWhat we know about Trump's state visit to the UK  A few weeks before, during a rally in Las Vegas on 22 December 2024, Mr Trump called Mr Kirk \"incredible\", adding that he \"is a special talent, and he's out there fighting\". He also appeared last October at a Turning Point USA political rally in Phoenix, saying: \"I want to express my tremendous gratitude to Charlie Kirk. He's really an amazing guy. Amazing guy.\" Tributes from across the political divide Tributes have come in from across the political divide in America since news of his death emerged, notably from the former president Barack Obama. \"This kind of despicable violence has no place in our democracy,\" he said. \"Michelle and I will be praying for Charlie's family tonight, especially his wife Erika and their two young children.\"  Politicians overseas were also quick to react, with Reform UK leader Nigel Farage - a regular at US conservative campaign events - saying it was \"a very dark day for American democracy\". Tory leader Kemi Badenoch said it was \"a blow to everything Western civilisation stands for: open discourse, robust debate and peaceful dissent\". Prime Minister Sir Keir Starmer described his death as \"heartbreaking\", adding: \"We must all be free to debate openly and freely without fear - there can be no justification for political violence.\" And Israel's Benjamin Netanyahu hailed him as a \"lion-hearted friend of Israel\" dedicated to \"speaking truth and defending freedom\".  America's political violence Sky's US correspondent Mark Stone said the killing could be \"a moment of political jeopardy for the country\", given the deep political divisions. There has been a spate of violence against American politicians, both Democrat and Republican, in the last year or so alone - including two apparent assassination attempts against Mr Trump himself in 2024. One in which he was shot during a campaign rally, and another which saw a man arrested at his golf course. In June this year, Minnesota state representative Melissa Hortman and her husband were killed in an attack at their home. State senator John Hoffman and his wife were also shot at their property. Both politicians were of the Minnesota Democratic-Farmer-Labor Party. The husband of former Democrat House Speaker Nancy Pelosi was also attacked last year, while Elon Musk - no longer part of the Trump administration - said staff working for his Department of Government Efficiency (DOGE) received death threats during the first few months of its work."
    },
    {
        "title": "Who was Charlie Kirk? A MAGA spokesman to young people across America",
        "description": "For many young people on the right of American politics, Charlie Kirk was an icon.",
        "url": "https://news.sky.com/story/who-was-charlie-kirk-a-maga-spokesman-to-young-people-across-america-13428452",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-charlie-kirk-utah-valley-university_7016545.jpg?20250910214533",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-09-10 20:41:00",
        "Headline": "Across social media, he had a huge following with more than 7.3 million followers on TikTok, 7 million on Instagram, 5 million on X and 3.5 million on YouTube.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n For many young people on the right of American politics, Charlie Kirk was an icon. He was 31-years-old, a media personality, podcaster, an author and the founder of Turning Point USA. The non-profit organisation champions conservative politics in schools, colleges and university campuses. It has been described as one of the fastest-growing organisations of its types in America. Read more: Powerful right-wing influencer and Trump ally shot dead He had a huge following with his podcast consistently charting in the top 20. According to NBC News, The Charlie Kirk Show is being downloaded between 500,000 and 750,000 times each day. It consistently charts highly on Spotify and Apple. Across social media, he had a huge following with more than 7.3 million followers on TikTok, 7 million on Instagram, 5 million on X and 3.5 million on YouTube. \n                  Charlie Kirk: Trump condemns 'heinous assassination' of conservative influencer\n                 \n                  Trump has 'heated phone call' with Netanyahu over strike targeting Hamas in Qatar\n                 \n                  Trump suffers legal setback in bid to fire Fed governor Lisa Cook\n                 A popular political activist, he spent much of his time travelling to college campuses across the country, encouraging debate and promoting conservative values. A big supporter of President Trump and somewhat of a MAGA spokesman to young people across America, he publicly promoted conservative, Trump-aligned causes and often debated with people opposed to his views. Born in Chicago in 1993, he was attracted to politics early, volunteering for the US Senate campaign of Illinois Republican Mark Kirk (no relation) during his high school years. He was accused by critics of promoting falsehoods and conspiracy theories on issues including COVID-19, climate change and the 2020 US election. Responding to the January 6th 2021 riots on Capitol Hill, he said it was not an insurrection but that the rioters did not represent the mainstream of Mr Trump's support. A day before the riots, in support of what he believed to be a stolen election, he wrote on X that he was organising for \"buses of patriots\" to Washington to \"fight for the president\". Read more from Sky News:Donald Trump suffers legal setback in bid to fire Fed governorWhat we know about Trump's state visit to the UK Given his following among young people across America, this could be a moment of political jeopardy for the country. Is this the spark which brings people together or drives the divide dangerously deeper?"
    },
    {
        "title": "Trump has 'heated phone call' with Netanyahu over strike targeting Hamas in Qatar",
        "description": "Donald Trump had a heated phone call with Israeli Prime Minister Benjamin Netanyahu after his military targeted Hamas inside Qatar, according to a report.",
        "url": "https://news.sky.com/story/trump-has-heated-phone-call-with-netanyahu-over-strike-targeting-hamas-in-qatar-13428486",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-donald_6879194.jpg?20250407183847",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-10 22:13:00",
        "Headline": "The US president said the Israeli decision to strike inside Qatar was not wise but Benjamin Netanyahu said he had a brief window to launch the airstrike and took the opportunity, the Wall Street Journal reported.",
        "Content": " Donald Trump had a heated phone call with Israeli Prime Minister Benjamin Netanyahu after his military targeted Hamas inside Qatar, according to a report. The American president told Mr Netanyahu on Tuesday that the decision to strike inside the US ally's territory was not wise, The Wall Street Journal reported, citing senior administration officials. The Israeli prime minister responded by saying he had a brief window to launch the airstrike and took the opportunity, according to the newspaper.  A second call between the two leaders later that day was cordial, with Mr Trump asking Mr Netanyahu if the attack had been successful, the publication added. Israel attempted to kill the political leaders of the Islamist group Hamas with the attack in the Qatari capital Doha on Tuesday. Hamas has said its top leaders survived the airstrike, but five members were killed, including the son of its exiled Gaza chief and top negotiator Khalil al Hayya. The Israeli military operation in Doha has been widely condemned internationally and was particularly sensitive as Qatar has been hosting and mediating in negotiations which are trying to bring about a ceasefire in the war in Gaza. On Wednesday, Mr Netanyahu warned Qatar to either expel Hamas officials or \"bring them to justice. Because if you don't, we will\". Qatar has hit back at him, saying his comments about the Gulf nation hosting a Hamas office were \"reckless\". Meanwhile, the Israeli ambassador to the US, Yechiel Leiter, has said that if Israel failed to kill Hamas leaders on Tuesday, it would succeed next time. \"We have put terrorists on notice, wherever they may be... we're going to pursue them, and we're going to destroy those who will destroy us,\" he said. The airstrike took place shortly after Hamas claimed responsibility for Monday's shooting at a bus stop on the outskirts of Jerusalem that killed six people. Read more:Analysis: Israel has crossed a huge diplomatic red line In another development, Sir Keir Starmer has had talks with Israeli President Isaac Herzog in Downing Street, with Mr Herzog saying they argued during a \"tough meeting\".  PM condemns Israeli action The prime minister has condemned the Israeli attack in Qatar, and raised the matter with the president, saying it was \"completely unacceptable\". \"He said the strikes were a flagrant violation of a key partner's sovereignty and do nothing to secure the peace we all desperately want to see,\" a Downing Street spokesperson said. Israel has been angered by Britain's plans to join several other Western countries, including France and Canada, in recognising a Palestinian state later this month - unless Israel meets conditions including a ceasefire in Gaza. \"Things were said that were tough and strong, and clearly we can argue, because when allies meet, they can argue. We are both democracies,\" Mr Herzog said at an event at Chatham House. He also proposed offering a \"fact-finding mission\" to Israel, \"sitting with us and studying the situation in Gaza on the humanitarian level\". \"Because we have full answers, and we are fully transparent,\" he said."
    },
    {
        "title": "Trump suffers legal setback in bid to fire Fed governor Lisa Cook",
        "description": "Donald Trump's bid to fire a US central bank rate-setter has suffered a setback after a federal judge blocked the move.",
        "url": "https://news.sky.com/story/trump-suffers-legal-setback-in-bid-to-fire-fed-governor-lisa-cook-13427942",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jay-powell-lisa-cook_7001482.jpg?20250826061303",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2025-09-10 04:37:00",
        "Headline": "Lisa Cook's lawsuit could now proceed all the way to the Supreme Court following a preliminary ruling that means she can remain in her role.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump's bid to fire a US central bank rate-setter has suffered a setback after a federal judge blocked the move. The president revealed last month that he was removing Lisa Cook from her post at the Federal Reserve on alleged mortgage fraud grounds. The move was widely seen by commentators as a bid to destroy the Fed's independence through the appointment of a new governor who would support his bid for interest rate cuts to boost the trade war-hit US economy. Money latest: Newspaper group confirms job losses Ms Cook, who denies wrongdoing and any cause to dismiss her, was appointed to the Fed's board by former US president Joe Biden. The board forms part of the panel that votes on US interest rate decisions. She secured a preliminary court ruling late on Tuesday which found that the Trump administration's claims she committed mortgage fraud prior to taking office were likely not sufficient grounds for her removal. The White House has claimed she inaccurately described three separate properties on mortgage applications, which could have allowed her to obtain lower interest rates and tax credits. \n                  Jaguar Land Rover cyber attack: 'Some data affected', carmaker reveals\n                 \n                  The free £2,000 that 800,000 parents aren't claiming | Sign up to Money newsletter\n                 \n                  Money blog: Fast food giant launches £11 burger; £175 up for grabs as bank launches switch offer\n                 But US District Judge Jia Cobb said: \"President Trump has not identified anything related to Cook's conduct or job performance as a Board member that would indicate that she is harming the Board or the public interest by executing her duties unfaithfully or ineffectively.\" The ruling, which could yet be appealed, means she can continue in her role while her own lawsuit proceeds. It could end up in the Supreme Court. Mr Trump's demands this year that the Fed cuts rates have so far fallen on deaf ears as the central bank voting has shown too much concern over trade war-linked inflation. Prices have risen as higher import duties have been passed on. He has repeatedly called for Fed chair Jay Powell to resign but retracted threats to fire him. The president may actually get his wish for a cut this month amid a deterioration in the employment market - also widely blamed on his trade war - as hiring has slumped. The central bank, unlike the Bank of England, has a dual mandate to ensure maximum employment as well as keeping inflation in check. Any rate cut would be unlikely to extinguish the Trump administration's effort to influence monetary policy. Read more from Sky News:JLR getting 'daily' support as workers told to stay at homeDragon's Den judge swoops with rescue bid for Claire's  The Fed's ability to set interest rates without regard to politicians' demands is critical to market confidence, let alone the central bank's ability to keep inflation under control. Neither the Fed or the White House commented on the ruling. Ms Cook's lawyer, Abbe Lowell, said: \"This ruling recognises and reaffirms the importance of safeguarding the independence of the Federal Reserve from illegal political interference.\""
    },
    {
        "title": "Jaguar Land Rover cyber attack: 'Some data affected', carmaker reveals",
        "description": "Jaguar Land Rover (JLR) says it now believes that \"some data has been affected\" in the cyber attack on the company last week.",
        "url": "https://news.sky.com/story/jaguar-land-rover-cyber-attack-some-data-affected-carmaker-reveals-13428135",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jaguar-land-rover-jaguar-land-rover_6876730.jpg?20250405140117",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-10 11:01:00",
        "Headline": "Manufacturing operations are not now expected to restart until at least next Monday as JLR continues to work on restoring key systems.",
        "Content": "Jaguar Land Rover (JLR) says it now believes that \"some data has been affected\" in the cyber attack on the company last week. The British car maker shut down operations when it spotted the attack last Tuesday, and its staff have been told to stay at home since. Sky News understands it will now be at least Monday next week before production staff can return to their jobs. Money latest: Contactless spending limit may be scrapped In an update on Wednesday, a spokesperson said: \"Since we became aware of the cyber incident, we have been working around the clock, alongside third-party cybersecurity specialists, to restart our global applications in a controlled and safe manner. \"As a result of our ongoing investigation, we now believe that some data has been affected and we are informing the relevant regulators. Our forensic investigation continues at pace and we will contact anyone as appropriate if we find that their data has been impacted.\" It was not yet clear exactly what data had been accessed. \n                  The free £2,000 that 800,000 parents aren't claiming | Sign up to Money newsletter\n                 \n                  Money blog: Fast food giant launches £11 burger; £175 up for grabs as bank launches switch offer\n                 \n                  Curve investors embroiled in row over £120m Lloyds sale proceeds\n                 \"We are very sorry for the continued disruption this incident is causing and we will continue to update as the investigation progresses,\" the person concluded. The incident is hurting not only output at JLR but wider internal systems and harming its supply chain. JLR says partner retail operations, including service and sales, are not affected. It is aiming to brief MPs whose constituencies contain production sites at a meeting on Friday. Hacking group Scattered Spider claimed responsibility for the attack soon after it was made public. Read more:Government reacts to cyber attack on JLR It was the ransomware group blamed for disruption to British retailers earlier this year. M&S has put a £300m cost on the hit to its business but expects the final figure to fall substantially thanks to insurance policy payouts. Four people have been arrested and bailed in connection with the April attacks. "
    },
    {
        "title": "Curve investors embroiled in row over £120m Lloyds sale proceeds",
        "description": "Investors in the digital wallets provider Curve are embroiled in a furious row over the proceeds from the company's impending &#163;120m sale to Lloyds Banking Group.",
        "url": "https://news.sky.com/story/curve-investors-embroiled-in-row-over-163120m-lloyds-sale-proceeds-13428342",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-lloyds-bank-money_6963178.jpg?20250712092041",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-10 17:27:00",
        "Headline": "Some shareholders in the digital wallet provider are furious about its board's proposed distribution of the funds from a sale to Britain's biggest high street lender, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Investors in the digital wallets provider Curve are embroiled in a furious row over the proceeds from the company's impending £120m sale to Lloyds Banking Group. Sky News has learnt that a number of shareholders in Curve have told the company's board they object to the proposed distribution of the funds triggered by a deal which is expected to be announced as soon as this week. The £120m sale price represents only about half of the total funding raised by Curve since the company was created a decade ago. Money blog: £175 up for grabs as bank launches switch offer One fintech industry source said recriminations between investors and the company had become so heated in recent weeks that at least one investor had sought the removal of Lord Fink, the City grandee, as Curve's chairman. Earlier this week, Sky News revealed that Lloyds was closing in on a deal to buy Curve. The bank hopes the acquisition will give it an edge in the race to build smarter online payments systems amid growing regulatory pressure on Apple to open its payment services to rivals. \n                  Jaguar Land Rover cyber attack: 'Some data affected', carmaker reveals\n                 \n                  The free £2,000 that 800,000 parents aren't claiming | Sign up to Money newsletter\n                 \n                  Money blog: Fast food giant launches £11 burger; £175 up for grabs as bank launches switch offer\n                 Curve was founded by Shachar Bialick, a former Israeli special forces soldier, in 2016, and was hailed as one of Britain's most promising fintechs. Three years later, Mr Bialick told an interviewer: \"In 10 years time we are going to be IPOed [listed on the public equity markets]... and hopefully worth around $50bn to $60bn.\" Curve's publicly disclosed shareholders include Britannia, IDC Ventures, Cercano Management - the venture arm of Microsoft co-founder Paul Allen's estate - and Outward VC. It was unclear on Wednesday which shareholders had expressed disquiet over the planned distribution of the sale proceeds. One source said that Mr Bialick had recently written to shareholders to acknowledge that the price was disappointing and warned that the company would probably run out of money this year unless a sale to Lloyds was agreed. When he was appointed to the role in January, Lord Fink said: \"Working alongside Curve as an investor, I have had a ringside seat to the company's unassailable and well-earned rise. \"Beginning as a card which combines all your cards into one, to the all-encompassing digital wallet it has evolved into, Curve offers a transformative financial management experience to its users. \"I am proud to have been part of the journey so far, and welcome the chance to support the company through its next, very significant period of growth.\" IDC Ventures, one of the investors in Curve's Series C funding round, said at the time of its last major fundraising: \"Thanks to their unique technology...they have the capability to intercept the transaction and supercharge the customer experience, with its Double Dip Rewards, [and] eliminating nasty hidden fees.\"And they do it seamlessly, without any need for the customer to change the cards they pay with.\" Curve refused to respond to a series of requests seeking comment."
    },
    {
        "title": "Former Travis Perkins boss Cooper to chair Channel 4",
        "description": "A former boss of Travis Perkins is to be named as the next chair of Channel 4, the state-owned broadcaster.",
        "url": "https://news.sky.com/story/former-travis-perkins-boss-cooper-to-chair-channel-4-13428107",
        "image_url": "https://e3.365dm.com/22/04/1920x1080/skynews-channel-four_5729001.jpg?20250910114912",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-10 10:27:00",
        "Headline": "Geoff Cooper, who chairs online electricals retailer AO, will be named the next chairman of the state-owned broadcaster, confirming an earlier Sky News report.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A former boss of Travis Perkins is to be named as the next chair of Channel 4, the state-owned broadcaster. Sky News can reveal that Geoff Cooper, who chairs the online electrical goods retailer AO, will be appointed by Ofcom, the media regulator, later on Wednesday. Mr Cooper's appointment has been signed off by Lisa Nandy, the culture secretary, according to insiders. Money latest: Contactless spending limit may be scrapped He is understood to have seen off competition from rival candidates including Debbie Wosskow, the entrepreneur, and financier Wol Kolade. Sky News revealed Mr Cooper's involvement in the process during the summer. The process to recruit a chair for Channel 4 was launched earlier this year, with Dawn Airey, the media industry veteran, holding the role on an interim basis. Sir Ian Cheshire, the former Kingfisher chief executive, stepped down after just one term in the post. Sir Keir Starmer's decision to retain Lisa Nandy as culture secretary has removed a potential reason for the conclusion of the process to be delayed, with insiders suggesting a decision about a preferred candidate is imminent. Sir Ian stepped down earlier this year after just one three-year term in the role. The race to lead the state-owned broadcaster's board has acquired additional importance since the resignation of Alex Mahon, its long-serving chief executive. Ms Mahon, who was a vocal opponent of the last Conservative government's proposed privatisation of Channel 4, has left to join Superstruct, a private equity-owned live entertainment company. Read more from Sky News:Trump suffers setback in bid to fire Fed governorGoogle-backed Lawhive in legal first with Woodstock dealJLR getting 'daily' support as workers told to stay at homeDragon's Den judge swoops with rescue bid for Claire's Recruitment to the board of Channel 4 is technically led by Ofcom, the media regulator, in agreement with the culture secretary. Ms Nandy is also expected to launch a search shortly for a successor to Lord Grade, the Ofcom chair. Nobody involved in the appointment would comment on Wednesday."
    },
    {
        "title": "Trump suffers legal setback in bid to fire Fed governor Lisa Cook",
        "description": "Donald Trump's bid to fire a US central bank rate-setter has suffered a setback after a federal judge blocked the move.",
        "url": "https://news.sky.com/story/trump-suffers-legal-setback-in-bid-to-fire-fed-governor-lisa-cook-13427942",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jay-powell-lisa-cook_7001482.jpg?20250826061303",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-09-10 04:37:00",
        "Headline": "Lisa Cook's lawsuit could now proceed all the way to the Supreme Court following a preliminary ruling that means she can remain in her role.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump's bid to fire a US central bank rate-setter has suffered a setback after a federal judge blocked the move. The president revealed last month that he was removing Lisa Cook from her post at the Federal Reserve on alleged mortgage fraud grounds. The move was widely seen by commentators as a bid to destroy the Fed's independence through the appointment of a new governor who would support his bid for interest rate cuts to boost the trade war-hit US economy. Money latest: Newspaper group confirms job losses Ms Cook, who denies wrongdoing and any cause to dismiss her, was appointed to the Fed's board by former US president Joe Biden. The board forms part of the panel that votes on US interest rate decisions. She secured a preliminary court ruling late on Tuesday which found that the Trump administration's claims she committed mortgage fraud prior to taking office were likely not sufficient grounds for her removal. The White House has claimed she inaccurately described three separate properties on mortgage applications, which could have allowed her to obtain lower interest rates and tax credits. \n                  Jaguar Land Rover cyber attack: 'Some data affected', carmaker reveals\n                 \n                  The free £2,000 that 800,000 parents aren't claiming | Sign up to Money newsletter\n                 \n                  Money blog: Fast food giant launches £11 burger; £175 up for grabs as bank launches switch offer\n                 But US District Judge Jia Cobb said: \"President Trump has not identified anything related to Cook's conduct or job performance as a Board member that would indicate that she is harming the Board or the public interest by executing her duties unfaithfully or ineffectively.\" The ruling, which could yet be appealed, means she can continue in her role while her own lawsuit proceeds. It could end up in the Supreme Court. Mr Trump's demands this year that the Fed cuts rates have so far fallen on deaf ears as the central bank voting has shown too much concern over trade war-linked inflation. Prices have risen as higher import duties have been passed on. He has repeatedly called for Fed chair Jay Powell to resign but retracted threats to fire him. The president may actually get his wish for a cut this month amid a deterioration in the employment market - also widely blamed on his trade war - as hiring has slumped. The central bank, unlike the Bank of England, has a dual mandate to ensure maximum employment as well as keeping inflation in check. Any rate cut would be unlikely to extinguish the Trump administration's effort to influence monetary policy. Read more from Sky News:JLR getting 'daily' support as workers told to stay at homeDragon's Den judge swoops with rescue bid for Claire's  The Fed's ability to set interest rates without regard to politicians' demands is critical to market confidence, let alone the central bank's ability to keep inflation under control. Neither the Fed or the White House commented on the ruling. Ms Cook's lawyer, Abbe Lowell, said: \"This ruling recognises and reaffirms the importance of safeguarding the independence of the Federal Reserve from illegal political interference.\""
    },
    {
        "title": "Google-backed Lawhive in legal first with Woodstock deal",
        "description": "A legaltech firm backed by Google's venture capital arm will this week stake a claim to an industry first when it swoops on Woodstock Legal Services, a bricks-and-mortar law firm.",
        "url": "https://news.sky.com/story/google-backed-lawhive-in-legal-first-with-woodstock-deal-13427960",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-lawhive-proner_7015691.jpg?20250910070730",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-10 06:05:00",
        "Headline": "A legaltech start-up which counts Balderton and GV among its backers will stake a claim to an industry first this week with the acquisition of Woodstock Legal Services, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A legaltech firm backed by Google's venture capital arm will this week stake a claim to an industry first when it swoops on Woodstock Legal Services, a bricks-and-mortar law firm. Sky News has learnt that Lawhive, which is run by co-founder and chief executive Pierre Proner, will on Thursday announce that it has concluded a deal to buy Woodstock, which specialises in property law and conveyancing among a full range of legal services. The terms of the deal are not expected to be disclosed. Lawhive's acquisition of Woodstock will, it says, be a landmark moment for an industry which is proving to be especially susceptible to the disruption posed by advances in artificial intelligence (AI). Money latest: How agent delivered crushing blow to house purchase The GV-backed firm has created a cohort of AI 'colleagues' which can work alongside Lawhive's human lawyers. Lawhive, which was founded in 2019, offers legal services across 12 areas of consumer law, including family law, civil litigation and property. \n                  Jaguar Land Rover cyber attack: 'Some data affected', carmaker reveals\n                 \n                  The free £2,000 that 800,000 parents aren't claiming | Sign up to Money newsletter\n                 \n                  Money blog: Fast food giant launches £11 burger; £175 up for grabs as bank launches switch offer\n                 Lawrence is Lawhive's first such AI innovation, serving as a proprietary legal assistant capable of conducting work at the level of junior lawyers known as paralegals. Woodstock was viewed by Mr Proner as a particularly attractive target because of the volume of manual filing and administration involved in property-related legal work. Clients involved in housing and other real estate transactions, meanwhile, frequently bemoan delays caused by paperwork and poor communication from counterparties involved in the deal process. The conveyancing legal market is said to be worth roughly £2bn in the UK annually. \"We are demonstrating that technology can support and enhance the best aspects of legal practice while creating communities where lawyers shape how that technology evolves,\" Mr Proner said. \"We believe that Lawhive's vertically integrated model of a regulated law firm and tech platform for lawyers to work alongside AI colleagues, creates better outcomes for everyone.\" Lawhive raised about £38m in seed and Series A funding last year, with other backers including New York-based fund TQ Ventures and Balderton, the London-based investor which has reaped a stellar return from its investment in the banking and payments group Revolut. A number of Premier League footballers, including Manchester United defender Harry Maguire and Reece James, the Chelsea and England wing-back, are also understood to have invested in Lawhive. Sources close to the company said it would launch a further, larger fundraising in the next six months, with additional acquisitions also expected to be considered. Read more from Sky News:Trump suffers setback in bid to fire Fed governorJLR getting 'daily' support as workers told to stay at homeDragon's Den judge swoops with rescue bid for Claire's Mr Proner said Lawhive's revenues had grown sevenfold in the last year. Woodstock Legal Services was founded by Carly Jermyn in 2014, and operates through a consultancy model with more than 50 regulated lawyers on its books. She said: \"This partnership is about scaling that vision with the right kind of technology - AI that enhances our skills and values, rather than eroding them. \"What makes it unique is that our lawyers will have the opportunity to shape the tools they use every day, instead of having them imposed on them.\" Woodstock's lawyers will be able to utilise Lawhive's AI tools, while retaining the firm's existing brand. The deal between Lawhive and Woodstock underlines a growing trend for so-called AI-native companies to acquire traditional services firms to modernise their operations."
    },
    {
        "title": "Labour deputy leadership: Contest to replace Rayner set to become two-horse race",
        "description": "Labour's deputy leadership contest is on the brink of becoming a two-horse race between Bridget Phillipson and Lucy Powell, as the other three candidates scramble for nominations.",
        "url": "https://news.sky.com/story/housing-minister-alison-mcgovern-pulls-out-of-labour-deputy-leadership-race-13428270",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bridget-phillipson_7016638.jpg?20250911011911",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-09-10 15:39:00",
        "Headline": "The latest tally comes after housing minister Alison McGovern dropped out, conceding she would not get the support required to make it to the next sage. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Labour's deputy leadership contest is on the brink of becoming a two-horse race between Bridget Phillipson and Lucy Powell, as the other three candidates scramble for nominations. The official tally from the Parliamentary Labour Party (PLP) on Wednesday night put Ms Phillipson, the education secretary, ahead with 116 nominations. Politics Hub: Catch up on The Immigration Debate Ms Powell, the former Commons leader who was ousted in Sir Keir Starmer's reshuffle last week, is behind with 77 - just three shy of the 80 needed to make it to the next round. Bell Ribeiro-Addy, Paula Barker and Dame Emily Thornberry all had support from 15 or fewer MPs as of Wednesday evening, fuelling speculation they could follow in the footsteps of housing minister Alison McGovern and pull out. Ms Barker, the MP for Liverpool Wavetree, told Sky News she was \"genuinely undecided\" and had a lot to consider. Ms Barker, a former trade union official, has challenged the government on Gaza and welfare cuts and is part of the newly formed soft-left \"Mainstream group\". Her allies are keen for her to stay in the race, with one telling Sky News she \"outshone the others by miles\" during an online hustings event for MPs, and would be a \"real alternative for the membership\". Her supporters are expected to throw their weight behind Ms Powell if she does drop out, with one saying of the Manchester Central MP: \"She is closer to Andy Burnham, and she was just sacked, so those who dislike Morgan McSweeney [the prime minister's chief of staff] I guess will get behind her.\" However, while describing her as \"slightly more left\" than Ms Phillipson, they said she is \"hardly a socialist\". Read more politics news:Who is Peter Mandelson?How many illegal migrants are in Britain? Some MPs want to avoid a race between Ms Powell and Ms Phillipson, believing there is not much difference in what they offer, but others had more praise for the former, calling her performance at the hustings impressive. One MP said: \"Her pitch is that she's been the shop steward of the parliamentary Labour Party (PLP) in government, but now she's not in government she can dedicate herself to the role of deputy leader full time without a department to run. She wants to focus on defining our voter coalition and making sure we're speaking to them.\" They added that Ms Phillipson might be too busy to fulfil the deputy leadership role, especially with SEND (special educational needs and disabilities) reform coming down the track \"which could be a horror show\". Ms Phillipson has been making the case to MPs about her experience fighting populism in her Houghton & Sunderland South seat in the North East, where Reform UK is on the rise. Dr Jeevun Sandher said he was won over by the education secretary following her pitch at the hustings in which she also spoke about the cost of living crisis. The MP for Loughborough told Sky News: \"Bridget was strong, articulate, and very impressive. She was able to communicate the deep thought we need to govern well and win the next election.\"  The deputy leadership race was triggered by the resignation of former deputy prime minister and housing secretary Angela Rayner after she admitted underpaying stamp duty on a flat. The candidates need 80 backers by 5pm Thursday. As of Wednesday evening's tally, 235 MPs had made their nominations out of Labour's 398 MPs. Ms McGovern pulled out on Wednesday afternoon, saying it was \"clear that the momentum of this contest had shifted, and I am not going to progress to the next stage\". The MP for Birkenhead was rumoured to be Number 10's preference before it was clear Ms Phillipson - who she has since nominated - would enter the race. Timeline for the race Many Labour MPs are keen to see someone who would work constructively with the prime minister to avoid the party becoming more divided. There are also calls for the deputy leader to be from the north to balance out the number of cabinet ministers who represent London seats - which both Dame Emily and Ms Riberio-Addy do. If more than one candidate secures 80 nominations by Thursday evening, they will then need to gain backing from either three of Labour's affiliate organisations, including two trade unions, or 5% of constituency parties. That process will continue until 27 September, meaning a contested election threatens to overshadow the party's annual conference that begins in Liverpool the next day. The successful candidates will then appear on the ballot for a vote of all party members and affiliated party supporters, which will open on 8 October and close on 23 October at 12pm. The winner will be announced on Saturday 25 October."
    },
    {
        "title": "I wanted to ask this union boss some very serious questions - and he tried to run away from me",
        "description": "For nearly two years, Sky News has been investigating allegations of bullying and harassment inside one of the UK's biggest trade unions.",
        "url": "https://news.sky.com/story/i-wanted-to-ask-this-union-boss-some-very-serious-questions-and-he-tried-to-run-away-from-me-13428193",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-gmb-gary-smith_7016344.jpg?20250910181102",
        "type": "Politics",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-09-10 13:31:00",
        "Headline": "Gary Smith, head of the GMB Union, has claimed there is \"no problem at all\" when asked about allegations of bullying and misogyny within the organisation. ",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  For nearly two years, Sky News has been investigating allegations of bullying and harassment inside one of the UK's biggest trade unions. We've been listening to women with accounts of alleged bullying, misogyny, cronyism, and sexism which they claim is rife within the GMB Union. So I went to find the head of the group to ask him why some women at his union still feel like they are treated unfairly. How we tracked him down Through a dimly lit car park in the middle of a Tuesday afternoon I'm chasing the head of the GMB union through the car bays in an attempt to ask him some very serious questions. He seems annoyed by this scrutiny. He had left the TUC conference early through a side door in an apparent attempt to avoid me and had started running away from me as I approached him. But there are serious questions hanging over him over how he runs his unions and how that union treats the women who work for him - so I continue to follow him. GMB has always denied there is a culture of bullying, misogyny and sexism, in fact much more staunchly than any other organisation I've covered before accused of the same thing, and today was no different. Politics Hub: Follow the latest from Westminster Mr Smith told me there was \"no problem at all\" within the union, unwilling to admit there was any real work to do and essentially saying - there's nothing to see here. The problem is lots of women have expressed concerns and say they feel harassed at the union enough that the equalities watchdog is currently examining whether GMB is complying with the human rights act, and previously GMB members have threatened to strike against their own union over allegations of sexism - a highly unusual move used only when members want to raise a serious issue. I ask Mr Smith whether he takes this seriously, He says: \"We're a good organisation, we're a cleaned up organisation, and we think the culture is pretty positive.\" I ask whether he believes the women who are bravely speaking out about their experience., whether he thinks there's any harassment or bullying in his organisation at all or finally, if he wanted to apologise or wanted to say anything to the women who expressed concerns. He declined to speak to me any further and I thanked him for his time. An 'institutionally sexist' union The GMB union has had internal run-ins before and has recently had a terrible track record with misogyny and sexism within its ranks. An internal report in 2020 branded the union \"institutionally sexist\" - a stain on their reputation that was so bad, it forced a change in leadership which saw Mr Smith elected as president. He made a declaration when he was appointed to the £148,000-a-year top job that \"if our union doesn't stand for decency and equality then we stand for nothing.\" It was a defining moment for GMB as their new general secretary, Mr Smith, was now pledging to end sexism and bullying. He promised to implement the recommendations of that damning report, the Monaghan report, and said he would work relentlessly to make it happen - \"no ifs no buts\". But since then, GMB women who we have spoken to say, it's only got worse. The whistle-blowers who spoke to us said they were speaking out because they held senior positions within the organisation and said if this was how they were treated, they worried what their junior employees would have to endure. They say all their complaints have happened since that 2020 report and that they are submitting complaints from regions across the country. Then, in February 2024, members of its largest region supported a move towards industrial action over \"serious allegations of bullying and harassment\". Staff in the North East, Yorkshire and Humberside region overwhelmingly supported a consultative ballot on strike action - which is usually used as a shot across the bow when members want to raise a serious issue. Union 'categorically denies' bullying and sexism Things escalated this year when the equalities watchdog took an active interest in the inner workings of GMB. Flooded with complaints from women, they were guided to inquire into the senior leadership of GMB who claim there has been a pattern of victimisation and harassment against women who speak out. They formally wrote to the GMB union asking for information on how it's complying with the Equality Act following allegations of sexual harassment, victimisation, and sex discrimination. GMB has now written back to the Equality and Human Rights Commission (EHRC) who will examine their response. I spoke to Anne, one of the women who submitted the collective formal complaint to the equalities watchdog, who said she was bullied out of GMB by two senior men in the union. She lodged an internal complaint - that was then upheld. GMB has said it categorically denies claims of a culture of bullying or sexism within the union. In fact, they have never substantially responded to claims of a renewed culture of sexism and this was why after repeated requests for an interview I thought it became important to ask Mr Smith himself what he made about these repeated allegations. Had the union slipped back into its old ways? Major Labour donor - with ministerial members This also matters because the general secretary of GMB is politically significant because the union is a major Labour donor with numerous cabinet ministers, including the prime minister holding membership. Politically it is seen as closer to this Labour leadership than other big unions since Sharon Graham's Unite party has remained very critical of Sir Keir Starmer's government over welfare cuts and the winter fuel U-turn. Sir Keir even gave the keynote speech at the GMB conference a year before the last general election. GMB still categorically denies claims of a culture of bullying or sexism within the union and say they responded to a 2020 Report - that found institutional sexism within the union - by swiftly establishing new structures and policies to effectively deal with any allegation of bullying, sexism or harassment."
    },
    {
        "title": "MPs around the world urge leaders to follow Trump's call for Jimmy Lai's release",
        "description": "MPs from around the world are urging their heads of state to follow Donald Trump's call for jailed Hong Kong media tycoon Jimmy Lai's release as he awaits a verdict.",
        "url": "https://news.sky.com/story/mps-around-the-world-urge-leaders-to-follow-trumps-call-for-jimmy-lais-release-13428242",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-china-jimmy-lai_6989838.jpg?20250818052458",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-09-10 15:12:00",
        "Headline": "Jimmy Lai is awaiting a verdict in his national security trial in Hong Kong, five years after he was arrested for taking part in pro-democracy protests.",
        "Content": "\n          Political reporter\n              @alixculbertson\n MPs from around the world are urging their heads of state to follow Donald Trump's call for jailed Hong Kong media tycoon Jimmy Lai's release as he awaits a verdict. Parliamentarians from 16 countries, ranging from the UK and Canada to Zambia and Paraguay, have written to their prime ministers and presidents in a coordinated global effort to get them to \"form a united coalition\" in support of Mr Lai. The 77-year-old Apple Daily newspaper founder, who is a British citizen with no other passport, has been in prison in Hong Kong since December 2020 and is awaiting the final verdict in his trial, with no date set. It could come any day now. He is accused of conspiring to collude with foreign forces and sedition under the national security law imposed on Hong Kong by Beijing following pro-democracy protests he was involved with in 2019. In August, the US president renewed his promise to \"save\" Mr Lai, saying he is \"going to do everything\" he can to get him freed, after initially pledging to \"100% get him out\" weeks before the US election last November. Now, parliamentarians, including British MPs and Lords, who are members of the Inter-Parliamentary Alliance on China (IPAC), are calling on their leaders to follow suit. In their letter, IPAC MPs, a group of politicians in different countries with an interest in China relations, have urged their state leaders to \"join with\" the US to \"prioritise advocacy on Mr Lai's behalf, and to stand in solidarity with other global leaders to form a united coalition in support of Mr Lai\". The MPs wrote: \"A clear and coordinated international response is essential to challenge the injustice he faces and to reaffirm the universal principles of democracy, human rights, and freedom of the press.\" They said without a globally coordinated intervention \"at the highest levels\" Mr Lai will be convicted and die in prison. \"We implore you to take up Mr Lai's case personally, in coordination with other leaders of democratic countries,\" they said. Mr Lai's son, Sebastien Lai, told Sky News last month that if the British government fails to act, \"my father is most likely going to die in jail\". The MPs have said Mr Lai is now an elderly man who has been separated from his family and held in solitary confinement for more than four years \"simply for democratic values and the basic freedoms promised to the people of Hong Kong\". Read more:Who is Jimmy Lai?Why Jimmy Lai's case is major sticking point for Starmer's relations with China  Signatory and UK Labour MP Sarah Champion, chair of the international development committee, told Sky News: \"Jimmy Lai has been left to languish in solitary confinement for over four years, his imprisonment is a blatant violation of human rights and press freedom. \"A strong and united global response is needed and Britain must join with our allies in calling for his immediate release.\" MPs who are sending letters to their leaders come from: Albania, UK, Canada, France, Kenya, Sweden, Australia, Romania, Zambia, The Phillippines, the European Parliament, Bosnia and Herzegovina, Paraguay, Netherlands, New Zealand and Norway. The Chinese embassy in London has previously denied claims the prosecution of Mr Lai is to silence criticism. A spokesman said the UK's previous remarks criticising Hong Kong over Mr Lai \"confuse right and wrong and interfere with the rule of law in Hong Kong. We are firmly opposed to that\". They have repeatedly said Hong Kong is governed by the rule of law and \"any illegal criminal behaviour should be punished by law\"."
    },
    {
        "title": "How many illegal migrants are in Britain? The key numbers driving the immigration debate",
        "description": "Representatives from the four main political parties took part in Sky News' Immigration Debate on Wednesday evening.",
        "url": "https://news.sky.com/story/how-many-illegal-migrants-are-in-britain-the-key-numbers-driving-the-immigration-debate-13428405",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-migration-immigration-debate_7016516.png?20250910211458",
        "type": "Politics",
        "Author": "Joely Santa Cruz, Daniel Dunford and Kate Schneider, Sky News Data x Forensics team",
        "Date Published": "2025-09-10 19:37:00",
        "Headline": "From small boats and asylum hotels to the number of immigrants in the UK and whether foreign workers help the economy, the Sky News Data x Forensics team explores the key talking points from The Immigration Debate.",
        "Content": "By Joely Santa Cruz, Daniel Dunford and Kate Schneider, Sky News Data x Forensics team   Representatives from the four main political parties took part in Sky News' Immigration Debate on Wednesday evening. Home Office minister Mike Tapp debated alongside shadow justice minister Dr Kieran Mullan, the Liberal Democrats' home affairs spokesperson Lisa Smart, and Reform UK's head of policy Zia Yusuf. Catch up on the programme in the Politics Hub Throughout, the Sky News Data x Forensics team was checking the politicians' claims against the numbers. Here's what we've found. How many illegal migrants are there in the UK? Reform's Zia Yusuf used his opening statement to repeat a statistic which his party has referenced often in recent weeks - that there are \"north of\" one million people \"in this country illegally\". However, this is not something we have reliable data on, or that Mr Yusuf can claim to confidently know. \"Illegal\", or \"unauthorised\", tends to refer to migrants without valid immigration status to be in the UK. For example those who enter the country without a visa, or who overstay a valid visa, or remain in the UK after an unsuccessful asylum claim. They are not legally allowed to work, and they are not eligible for housing benefits or most free public services. We do not know how many people fall into this category, and the government does not produce estimates - some people may disappear from the system. The most recent independent estimates are for 2017. But the University of Oxford's Migration Observatory advises treating these with extreme caution as they have a high margin for error. They were published by the Pew Research Centre, an American think tank, and put the figure at anywhere between 700,000 to 900,000 in 2017. This is revised down from a previous estimate of 1.2 million, which is likely too high. Small boat crossings Diane from Slough, in our audience, asked a question about the number of people crossing on small boats, to which Conservative Dr Kieran Mullan responded: \"The number of people crossing has gone up. It's at record levels compared to when Labour took office.\" Newly appointed Labour Home Office minister Mike Tapp later defended his party's record, saying: \"We inherited open borders. We inherited a system that had 150,000 people crossing in just three or four years.\" There are inaccuracies with both of those statements. Fewer than 130,000 people arrived on small boats in the six years before Labour came to power, with the majority of those since 2020 - not 150,000 as Mr Tapp claimed. And Dr Mullan is not right to say the number of people arriving is at record levels. More people have crossed the Channel on small boats so far this year than had by this point in any previous year, but the highest number of arrivals recorded during a 365-day period occurred between October 2021 and October 2022, spanning the premierships of three Tory prime ministers - Boris Johnson, Liz Truss and Rishi Sunak. Those numbers had started to fall, however, under Mr Sunak, before rising after Sir Keir Starmer became PM. Mr Tapp's claim that his party \"inherited open borders\" didn't address this fact. The Home Office has previously claimed that an extended period of calm weather in the Channel has made it easier for migrants to cross. But our analysis found that, while it's true the weather has been unusually calm this year, that factor alone cannot explain the high number of crossings over the last 12 months. Asylum hotels  Dr Mullan also claimed \"the number of people in hotels is higher than it was when Labour took office\". That's true - there are currently 32,059 asylum seekers being housed in 210 hotels in the UK, compared with 29,585 people in 213 hotels when Labour were elected. But the highest number on record was while the Conservatives were in power. In September 2023, there were 56,042 asylum seekers being housed in 400 hotels. That number had fallen substantially by the time they left office. Read more: A council-by-council breakdown of asylum hotels See how many asylum seekers are being housed in your area:  A record number of people claimed asylum in the UK in the year to June 2025, at over 111,000. Over the same period, 134,037 initial decisions were taken on asylum applications, with around 52,000 granted and 58,000 refused. Those with a rejected claim can go on to appeal, and the recent increased number of applications as well as a higher rate of initial rejections has led to a backlog in the courts, now at over 50,000 people. The government has said it wants to increase returns of failed asylum seekers and others without legal immigration status, but Reform's Mr Yusuf accused them of overinflating the numbers, as most returns are voluntary. The number of removals of people without legal immigration status was 35,833 people in the year to June 2025, an increase of 5,000 on the year preceding it, with returns now at their highest level since 2016/17, though lower than the 47,000 in 2012. Legal migration Asylum claims are a much smaller share of overall migration than legal work routes. Mr Tapp said immigration was too high under the Conservatives, and Labour had managed to \"cut that by 300,000\", and had \"halved working visas\". He said Labour are increasing requirements for qualifications and salaries. But much of this trend was already under way before Labour took office. Read more: How much does the UK rely on legal migration? Though the Tories oversaw a big increase in legal migration, they were also responsible for later rolling back and tightening the rules, for example on limiting care worker and student dependants in early 2024. This led to the number of work dependant visas halving to 103,518 by 2025, and student dependant visas decreasing by 88% to 18,000. Labour's immigration white paper sets out a further tightening of the rules. The Home Office says this will result in 98,000 fewer visas being issued next year. That is equivalent to 10% of all of those issued in 2024, but less than the drop since 2023 which Mr Tapp was talking about. That was largely a result of decreasing numbers of dependants. The ONS projects net migration to fall further, to an average long-term level of 340,000 a year by mid-2028, based on the trend from before the Conservatives left office. Do migrants contribute more than they take?  During the debate, audience member Tavinder from Bromsgrove asked: \"Does legal immigration benefit the UK? And their contribution: are they taking more or contributing more?\" From a purely economic perspective, the answer is much more complex than a simple \"yes\" or \"no.\" According to 2024 analysis from the Office for Budget Responsibility (OBR), the UK's independent assessor of public finances, whether a migrant is a net contributor or net \"taker\" from the economy depends on several factors, including their age and average earnings. The OBR found the average high-wage migrant worker arriving at the age of 25 is a net contributor to the economy across their entire lifetime. A high wage here is measured as one about 30% higher than the average salary. The average annual salary in the UK is currently £37,430, meaning a \"high wage\" is anything above £48,659. A typical British-born individual has a negative fiscal impact on the economy as a child. Over the course of their working years, this \"debt\" is gradually reduced until they become net positive contributors.   In contrast, migrant workers earning above-average wages and immigrating during their prime working years skip this period of negative fiscal impact on the UK as children. This means they start paying into the economy as soon as they arrive.  On the other hand, the OBR estimated the typical low-wage migrant workers has a net negative fiscal contribution to the UK that only grows as they age.  The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Who is Peter Mandelson and what do we know about his relationship with Jeffrey Epstein? ",
        "description": "Labour veteran Lord Peter Mandelson is facing his biggest controversy to date over his relationship with paedophile sex trafficker Jeffrey Epstein.",
        "url": "https://news.sky.com/story/who-is-peter-mandelson-and-what-do-we-know-about-his-relationship-with-jeffrey-epstein-13428044",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-peter-mandelson-jeffrey-epstein_7016063.jpg?20250910123051",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-10 09:10:00",
        "Headline": "The UK ambassador to Washington referred to paedophile sex trafficker Jeffrey Epstein as \"my best pal\" in 2003 - three years before allegations against him became public.",
        "Content": "Labour veteran Lord Peter Mandelson is facing his biggest controversy to date over his relationship with paedophile sex trafficker Jeffrey Epstein. A message from the UK ambassador to Washington featured in a \"birthday book\" for Epstein for his 50th birthday in 2003 - three years before allegations against the disgraced financier became public. But who is Lord Mandelson, what did he put in his message to Epstein, and what has he said about their relationship? 'The Prince of Darkness' Lord Mandelson, 71, holds what is considered the most glittering diplomatic post in the UK government, the perks of which include the luxurious ambassador's residence, a mansion designed by top architect Sir Edwin Lutyens. Sir Keir Starmer said Lord Mandelson, who served in both Tony Blair and Gordon Brown's governments, brought \"unrivalled experience to the role\" and has since credited him with helping build UK-US relations in a tricky political climate with Donald Trump at the helm. Lord Mandelson was already notorious among the British public, having earned himself a reputation for being a spin doctor when he helped propel Mr Blair to leader of the Labour Party in 1994, in what was seen as a betrayal by his close ally Mr Brown. He was largely seen as the mastermind behind the birth of New Labour, and would berate newspaper editors when unfavourable stories were written by their political journalists, eventually earning him the nickname \"the Prince of Darkness\". He had to resign from Mr Blair's cabinet twice, first over an undeclared bank loan and then over intervening in a passport application by a top Indian businessman. Yet it was Mr Brown who gave him a spectacular political comeback, making him business secretary with a peerage in 2008 before making him first secretary of state a year later - a role he kept until Labour's election defeat in 2010. Lord Mandelson, who was also Brussels commissioner from 2004 to 2008, is credited by supporters with having top trade experience and networking abilities, and has even been endorsed by UK Reform leader Nigel Farage, who has called him a \"very clever man\". What was in Mandelson's birthday message to Epstein? Files from the 2003 birthday book compiled for Epstein by his co-conspirator Ghislaine Maxwell show a birthday note from Lord Mandelson, who refers to Epstein as \"my best pal\". It begins with him appearing to reminisce about the first time he met Epstein, before alluding to how the financier would often leave one alone with some \"interesting friends to entertain\".  It is not clear what was meant by these so-called \"interesting friends\", but the line is accompanied by an image of two people with their faces obscured or redacted. The note references Epstein \"taking you by surprise… in one of his glorious homes he likes to share with his friends (yum yum)\". \"Wherever he is in the world, he remains my best pal!\" Lord Mandelson wrote. Pictures of Lord Mandelson appear on the pages, which include an image of a tropical island. Lord Mandelson was one of many contributors to the book, which was made public for the first time on 9 September after being published by a congressional committee in Washington. How has Mandelson responded? Reacting after the book's release, Lord Mandelson told The Sun: \"I find them very embarrassing to see and to read, but they were written before he was indicted.\" He said he sympathised with Epstein's victims and that he \"very, very deeply\" regretted continuing to associate with the paedophile for \"far longer than I should have done\". Lord Mandelson said he \"fell for and accepted assurances\" from Epstein, who he described as a \"charismatic criminal liar\". He said he never saw any \"wrongdoing\" or criminal activity while he associated with Epstein.  Report claims Mandelson stayed at Epstein's flat while he was jailed Lord Mandelson's links to Epstein were first scrutinised in a report by JP Morgan bank, filed in a New York court in 2019. Epstein, who killed himself while awaiting trial on charges of sex trafficking minors in August 2019, had previously served an 18-month sentence after pleading guilty to procuring a person under the age of 18 for prostitution. Read more:Epstein questions at worst moment for Lord MandelsonAnalysis: The disconnect between Mandelson's claim and his letter The report suggested that Lord Mandelson stayed at Epstein's Manhattan flat while he was serving that sentence, noting that Epstein wrote to his private banker on 17 June 2009: \"Peter will be staying at 71st over weekend…\"  In May this year, Sky News asked Lord Mandelson if he did stay at Epstein's flat, to which he replied: \"I'm not answering any questions about him. My knowledge of him is something I regret, I wish I'd never met him in the first place.\" Asked why he had an association with Epstein whilst he was in jail, Lord Mandelson replied: \"Why did many people meet him? He was a prolific networker. And I wish I'd never met him in the first place.\""
    },
    {
        "title": "Sky's immigration debate shows politicians have too few solutions for differing views ",
        "description": "In an hour of complex and heated disagreement, there were two moments of unity in Sky News' immigration debate.",
        "url": "https://news.sky.com/story/skys-immigration-debate-shows-politicians-have-too-few-solutions-for-differing-views-13428447",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/b88c71c15dd5fd6a1973f8e0caf1c4a80769aecc9f9a3c59a81676fdbd7a822b_7016456.jpg?20250910202001",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-09-10 20:28:00",
        "Headline": "Much of the policy prescriptions looked like it left the audience non-plussed or even annoyed.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  In an hour of complex and heated disagreement, there were two moments of unity in Sky News' immigration debate. The first came in the answer to Tavinder, who probed: \"I just want to know, does legal immigration benefit the UK and their contribution? Are they taking more or contributing more?\" Politics Live: Minister brands Reform 'plastic patriots' for 'feeding racism' It was here, for a brief moment, that all four coalesced and agreed that immigration can be a benefit, and cite examples. Even Zia Yusuf from Reform UK said he understood the benefit of migrants coming to Britain, pointing to his own parents who arrived in the 1980s. Later, all four also agreed that the system devised by the Tories post-Brexit and inherited by Labour, currently unfixed, was still broken. The harmony was short-lived. The job of all four parties represented in the Sky News immigration debate was to present their solutions and connect with an audience. But much of the hour-long special was a testy, bitty argument and a sense of too few solutions that really met the passionate, differing views of our audience members. \n                  Labour deputy leadership: Contest to replace Rayner set to become two-horse race\n                 \n                  I wanted to ask this union boss some very serious questions - and he tried to run away from me\n                 \n                  MPs around the world urge leaders to follow Trump's call for Jimmy Lai's release\n                 If there was one member of the panel who kept trying to draw clear light blue water with the rest, it was Reform UK's head of policy Yusuf, with an intervention which he knew would divide - attacking those arriving on small boats across the channel personally. \"I'm using the word invasion because over the last eight-and-a-half years, more people have turned up on the beaches illegally, uninvited, the majority of them men, the majority of them fighting age men that hate this country, including countries like Afghanistan, Syria. And, by the way, that is more people than stormed the beaches of Normandy on D-Day,\" he told the audience. This drew fire from new immigration minister Mike Tapp. He called this \"Disgraceful behaviour, you wrap yourself in our flag but you will do nothing for this country. You're plastic patriots. Disgusting.\" Yet Labour is trying to chart a middle course - language which shows it understands the scale of public anger, while creating a dividing line over the rhetoric. Across the hour, the four-strong panel were never happier than when they were attacking each other's language. Much of the policy prescriptions looked like it left the audience non-plussed or even annoyed. Tapp promised further and faster.  Kieran Mullan, the Tory shadow justice secretary, stressed the Tories now had a fully thought through plan. Lisa Smart, home affairs spokeswoman for the Lib Dems, pushed changing the rules to allow asylum seekers to find work. Yusuf promised a net negative migration policy involving detention and immediate deportation. The truth is, there are no tested solutions that will, for certain, deliver the result the public wants. Each radical idea is as bold as it is untested. Nobody can for sure know what would amount to a deterrent, and whether this would work. The audience did not have a clear winner - no proposal appeared to gain favour outright judging by their reactions. The debate will continue. Tonight's debate showed a hint of danger for Labour, however. There was no doubting the passion in the audience but not every audience member wanted a clampdown. Two were passionate that the needs and rights of those fleeing war should be better looked after. Most of the audience wanted less, but a minority reject this approach and often such people lean left. As Labour's rhetoric gets tougher, will they be an electoral home for people like this in future?"
    },
    {
        "title": "Starmer insists he has confidence in Mandelson as relationship with Epstein faces scrutiny",
        "description": "Conservative leader Kemi Badenoch has called for Lord Peter Mandeslon to be sacked as ambassador to the United States over his friendship with paedophile financier Jeffrey Epstein.\n",
        "url": "https://news.sky.com/story/peter-mandelson-regrets-very-deeply-continuing-relationship-with-epstein-far-longer-than-i-should-have-13427992",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-peter-mandelson-cobra_6945280.jpg?20250618154324",
        "type": "Politics",
        "Author": "Faith Ridler",
        "Date Published": "2025-09-10 09:52:00",
        "Headline": "The UK ambassador to the US has faced heavy scrutiny over his relationship with disgraced financier Jeffrey Epstein.",
        "Content": "\n          Politics reporter\n              @FaithLRidler\n  Conservative leader Kemi Badenoch has called for Lord Peter Mandeslon to be sacked as ambassador to the United States over his friendship with paedophile financier Jeffrey Epstein.\n Lord Mandelson faced questions on Tuesday after it emerged he had referred to Epstein as his \"best pal\" in a birthday message he wrote for the convicted sex offender in 2003. Further allegations were made by The Telegraph overnight, claiming Epstein had brokered a deal with Lord Mandelson over the £1bn sale of a UK taxpayer-owned banking business in 2010. This was reportedly negotiated while Lord Mandelson was the business secretary, and only months after Epstein had been released from prison. Politics latest: Follow live updates There were also claims that Lord Mandelson stayed in Epstein's New York home while he was in prison for soliciting a minor in 2008/9. Lord Mandelson also wrote supportive messages to Epstein while he was facing charges in 2008, according to leaked emails seen by The Sun Newspaper. The US ambassador is said to have told Epstein: \"I think the world of you and I feel hopeless and furious about what has happened\". \n                  Labour deputy leadership: Contest to replace Rayner set to become two-horse race\n                 \n                  I wanted to ask this union boss some very serious questions - and he tried to run away from me\n                 \n                  MPs around the world urge leaders to follow Trump's call for Jimmy Lai's release\n                 He is also said to have encouraged Epstein to be \"big\" and \"strong\". During Prime Minister's Questions on Wednesday, Ms Badenoch asked Sir Keir whether he has confidence in the ambassador. The prime minister insisted that he does, saying Lord Mandelson is \"playing an important role in the UK-US relationship\".  Referring to Epstein, the prime minister said: \"He was a despicable criminal who committed the most heinous crimes and destroyed the lives of so many women and girls. \"The ambassador has repeatedly expressed his deep regret for his association with him. He's right to do so.\" Sir Keir also claimed that \"full due process\" was followed in the appointment of Lord Mandelson \"as would be expected\". In an interview with The Sun, Lord Mandelson said he regrets \"very much that I fell for his lies... and accepted assurances he had given me about his indictment\", which saw Epstein jailed in 2008. Lord Mandelson said: \"He's a charismatic, criminal liar we now see, and I regret very much indeed. \"I felt it like an albatross around my neck since his death in 2018 or 2019, whenever it was. I feel a tremendous sense of regret.\" This regret, the diplomat said, is not only that he met Epstein in the first place, but that he \"continued that association\" and took at \"face value the lies that he fed me\". He added: \"I can't rewrite history. What I can do is express my profound sympathy for those who treated by him.\" Lord Mandelson and No 10 have both been contacted for comment on the latest allegations."
    },
    {
        "title": "Would you invite Putin? MPs' outrage as Starmer defends Israeli president's visit",
        "description": "Sir Keir Starmer has defended welcoming the Israeli president to Downing Street as MPs raised concerns about allowing him into the UK.",
        "url": "https://news.sky.com/story/would-you-invite-putin-mps-outrage-as-starmer-defends-israeli-presidents-visit-13428203",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-pmqs_7016054.jpg?20250910122413",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-10 13:45:00",
        "Headline": "The prime minister welcomed Isaac Herzog to Downing Street on Wednesday, despite cross-party criticism of the meeting.",
        "Content": "Sir Keir Starmer has defended welcoming the Israeli president to Downing Street as MPs raised concerns about allowing him into the UK. Sir Keir and Isaac Herzog met in Number 10 on Wednesday afternoon. Earlier, at Prime Minister's Questions (PMQs), Sir Keir told the House of Commons that \"however difficult, the UK must not walk away from a diplomatic solution\" to the war in Gaza. Politics latest: Badenoch calls for Mandelson to be sacked \"We will negotiate and we will strain every sinew, because that is the only way to get the hostages out, to get aid in and to stop the killing,\" he told MPs. The PM said it was intention to make \"absolutely clear\" to Mr Herzog that Britain condemned Israel's bombing of Hamas leaders in Qatar 24 hours earlier. Shrugging off criticism, the PM added it would be the \"politics of students\" not to meet Mr Herzog after the SNP's Westminster leader Stephen Flynn gave an impassioned speech against the Israeli president's visit. \n                  Labour deputy leadership: Contest to replace Rayner set to become two-horse race\n                 \n                  MPs around the world urge leaders to follow Trump's call for Jimmy Lai's release\n                 \n                  How many illegal migrants are in Britain? The key numbers driving the immigration debate\n                 Mr Flynn said: \"Would he invite Vladimir Putin into No 10? Would he invite Benjamin Netanyahu into No 10? \"What does it say of this prime minister that he will harbour this man whilst children starve?\" Following Mr Herzog's visit to Number 10, the Israeli president said: \"Britain and Israel are friends, but among friends there are sometimes disagreements.\" He said he \"made clear\" the UK's intention to recognise a Palestinian state would \"in no way help bring the hostages home, help the Palestinians, or help bring an end to the conflict\" - but would instead \"embolden extremists\". The president also told Sir Keir it was \"dangerous\" to \"echo Hamas's propaganda campaign of starvation in Gaza\". MPs question Herzog visit Dozens of MPs from all parties, including Labour, questioned the legal standing of Sir Keir welcoming Mr Herzog. The Israeli president has previously said there are \"no innocent civilians in Gaza\" and \"it is an entire nation that is responsible\". He was also pictured signing an artillery shell before it was fired towards Gaza in December. The prime minister's spokesman said the attack in Qatar is a \"clearly unacceptable act\" and said it \"of course\" would be one of the subjects raised with Mr Herzog. He added Sir Keir will be \"clear\" with Mr Herzog about the risk of Israel escalating its actions. Handcuffs not handshakes New Green Party leader Zack Polanski called for \"handcuffs not handshakes\" as he said Scotland Yard's war crimes unit should be waiting inside Number 10 to handcuff Mr Herzog \"and take him away for questioning\". Mr Polanski, who won the Greens leadership election last week and is Jewish, accused Mr Herzog of being \"complicit while the Israeli government has engaged in committing genocide in Gaza\". Israel has continually denied it is carrying out a genocide in Gaza, but last week, the world's leading association of genocide scholars declared it is. Earlier this week, the UK government concluded Israel is not committing genocide in Gaza. Herzog is a conduit The Liberal Democrats tabled an urgent question following PMQs, calling on the foreign secretary to make a statement on the implications of Israel's strike in Qatar. Foreign Office minister Hamish Falconer took to the despatch box to defend Mr Herzog's visit, saying: \"President Herzog is on a private visit to the UK. \"He is not a functional part of the government; he is an important conduit to raise these concerns.\"  Mr Falconer said the UK is supporting a motion for an emergency meeting of the UN Security Council on Wednesday evening and revealed Foreign Secretary Yvette Cooper is speaking to the E3 (UK, France and Germany) and G7 allies, including the US about Israel's attack on Qatar. He added that Ms Cooper met Mr Herzog in the morning and \"amongst other things\" asked him to ensure greater support from the Israeli government to get children with injuries and students out of Gaza. As PMQs was taking place, union members at the Trades Union Congress (TUC) conference unanimously passed a motion to oppose Mr Herzog's visit. On Tuesday evening, 60 cross-party MPs and Lords gathered outside parliament to condemn Mr Herzog's visit after they sent a letter to Sir Keir asking what legal advice the government has received about Mr Herzog's visit and whether his entry to the UK \"is compatible with our obligations under the Genocide Convention\"."
    },
    {
        "title": "Britain 'out of whack' on free speech, warns Nick Clegg",
        "description": "Britain has \"fallen out of love with the future\" and is \"out of whack\" on free speech, former deputy prime minister Nick Clegg has warned.",
        "url": "https://news.sky.com/story/britain-out-of-whack-on-free-speech-warns-nick-clegg-13427927",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nick-clegg-world-economic-forum_7015672.jpg?20250910051332",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-10 03:06:00",
        "Headline": "Speaking to Sky's Wilfred Frost on his The Master Investor Podcast, Nick Clegg said the UK needed to \"think long and hard\" about \"whether we've overdone it\" with freedom of speech laws.",
        "Content": " Britain has \"fallen out of love with the future\" and is \"out of whack\" on free speech, former deputy prime minister Nick Clegg has warned. The ex-Liberal Democrat leader, who was David Cameron's second-in-command during the coalition of 2010-2015, said the country was suffering from a sense of \"underlying grumpiness\". Following last summer's riots, the implementation of the Online Safety Act, and this year's protests outside asylum hotels and in support of the now-banned group Palestine Action, the government has been accused of cracking down on freedom of speech. Speaking to Sky's Wilfred Frost on his The Master Investor Podcast, Mr Clegg said the UK needed to \"think long and hard\" about \"whether we've overdone it\". \"When I've looked at some of the examples, I thought to myself, 'yeah, that's really unpleasant speech or egregious speech',\" he said. \"But really, surely part of the definition of being in a free society is people say ghastly things, offensive things, awful things, ugly things, and we don't sweep them under the carpet.\" He added: \"I do think the balance [on free speech] is out of whack here.\" It comes as the police watchdog called for a more \"common sense\" approach to policing, telling Sky News there should be a clear difference between \"what is offensive and what is criminal\". Sir Andy Cooke hit out after the wide condemnation of comedy writer Graham Linehan's arrest, publicly, by five armed officers for tweeting messages about trans issues, which allegedly incited violence. Mr Clegg lost his seat at the 2015 general election and went on to join Mark Zuckerberg's Meta, where he became largely responsible for efforts to enhance moderation standards and improve the company's image. He quit as head of global affairs in January ahead of Donald Trump's return as US president. Defending the austerity policies pursued by the Tory-Lib Dem coalition, Mr Clegg claimed Britain's recovery from the 2008 financial crisis had been \"messed up\" by Brexit - and that, compared to the US, the economy had struggled to bounce back from the pandemic. But America won't have things all its own way in the years ahead, he suggested, as he makes China the favourites to win the artificial intelligence race. \"I don't believe that America is going to beat China in this AI race in the way that they appear to imagine they might. I think China is far, far too powerful and technologically gifted and adept to be sort of treated like that,\" he said. Read more from Wilfred Frost:What I learned reviewing broadcast legend's famous interviewsLiz Truss calls for Trump-style 'revolution' Mr Clegg's former employer is just one of several US tech giants investing massively in AI. Others include OpenAI, makers of ChatGPT, and Google, which is behind the Gemini chatbot. China's DeepSeek made headlines in the West earlier this year after releasing a ChatGPT-like AI model that performed faster - and more cheaply - than its rivals. Mr Clegg said while he was \"a little sceptical about some of the hype\" around so-called artificial general intelligence, which experts say could match or surpass humans, competition between the US and China would be intense. Nick Clegg was speaking on The Master Investor Podcast with Wilfred Frost, available to watch in full here and listen here."
    },
    {
        "title": "MPs want Mandelson in UK to answer their questions on Epstein - but can't force him",
        "description": "MPs are demanding Peter Mandelson appears on British soil to give evidence on his relationship with paedophile Jeffrey Epstein.",
        "url": "https://news.sky.com/story/mps-want-mandelson-in-uk-to-answer-their-questions-on-epstein-but-cant-force-him-13428458",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-lord-mandelson-house-of-lords_7016562.jpg?20250910221024",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-09-10 21:04:00",
        "Headline": "Lord Mandelson is a member of the House of Lords, and so MPs are unable to force him to appear before them. They want to know more about his links to paedophile Jeffrey Epstein.",
        "Content": "\n          Political reporter\n              @TimJ_B\n MPs are demanding Peter Mandelson appears on British soil to give evidence on his relationship with paedophile Jeffrey Epstein. But there is frustration within parliament at Lord Mandelson's ability to avoid scrutiny. Sky News has learned that the powerful Foreign Affairs Select Committee of MPs made a request to hear from Lord Mandelson after he was appointed, but this was blocked by the Foreign Office. Politics latest: 'Disgusting' - Minister brands Reform 'plastic patriots' Lord Mandelson's status as a member of the House of Lords means the committee cannot force him to appear before them. People overseas can also not be compelled to give evidence. Committees have the power to summon people to give evidence, and find them in contempt of Parliament if they do not comply. Lord Mandelson's failure to appear adds to the controversy around a lack of government transparency sparked by the decision to not let national security adviser Jonathan Powell give evidence to the Joint Committee on the National Security Strategy. Conservative MP and FAC member Aphra Brandreth is the only person on the committee to publicly call for Lord Mandelson to give them evidence on the ambassador's links to Epstein. Sky News understands that others on the committee are keen for Lord Mandelson to speak to them but have decided to not go public. As the committee make-up mirrors that of parliament, most members are Labour MPs.  Read more on Mandelson:Starmer backs his ambassadorWhat was his relationship with Epstein?The disconnect between his claims and letters to Epstein Ms Brandreth said in a statement: \"At a time of huge instability around the globe, it's vital that the UK's ambassador to the US is focused completely on his job \"As a member of the Foreign Affairs Committee I would welcome the opportunity to question Lord Mandelson on his ability to carry out his duties to the UK.\" She shared a letter written by fellow Conservative MP and former Foreign Affairs Select Committee chair Alicia Kearns. In the letter, Ms Kearns called on current chair Dame Emily Thornberry to summon Mandelson, question him and put the concerns of MPs to him. Ms Kearns also wants to know what questions Dame Emily has asked the Foreign Office since the appointment of Mandelson, and to find out \"how substantial\" Lord Mandelson's relationship with Epstein was. Ms Kearns told Sky News: \"Months and months have passed with no action from the chair of the Foreign Affairs Committee, instead there has been an unsettling silence from her on all things Mandelson. \"I would have summoned Mandelson long ago, it's the chair's duty to get the answers parliament deserves. It's all too evident Thornberry has long been focused on her next role, not the one she's been elected and paid to do.\" So far, there has been no response from Dame Emily, who, on Wednesday night, took part in a hustings for her campaign to be the next Labour deputy leader. Some MPs on the committee are concerned this race has distracted Dame Emily from her role on the committee, especially with the Epstein allegations - as well as the recent incidents in Poland and Qatar. Having failed to secure sufficient support in the race, it is now likely that Dame Emily will be withdrawing from the race. In January, Dame Emily raised Lord Mandelson's appointment with Foreign Office minister Stephen Doughty. She said the appointment was \"inspired\" - before asking the minister and government to \"allow Lord Mandelson the time to come before my Committee before he leaves for the United States?\" Dame Emily added: \"That will allow my colleagues to hear directly why the Prime Minister has appointed him, and to learn what his priorities are in this crucial diplomatic role.\" 👉 Follow Trump100 on your podcast app 👈 Mr Doughty said: \"I am sure that we will consider any request that my right honourable friend makes in due course in the normal way in which we consider requests from her Committee.\" The FCDO has been approached for comment."
    },
    {
        "title": "UK patients to trial blood test that could 'revolutionise' Alzheimer's diagnosis",
        "description": "A major new blood test which could revolutionise the diagnosis of Alzheimer's is being trialled on UK patients with early symptoms, researchers have said.",
        "url": "https://news.sky.com/story/uk-patients-to-trial-blood-test-that-could-revolutionise-alzheimers-diagnosis-13428001",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-blood-test-generic_6681990.jpg?20240911120455",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-10 07:29:00",
        "Headline": "A study will investigate if a blood test, which is accurate at detecting proteins linked to Alzheimer's, can help improve diagnosis and treatment plans for patients showing early signs of the deadly disease, the most common cause of dementia.",
        "Content": "A major new blood test which could revolutionise the diagnosis of Alzheimer's is being trialled on UK patients with early symptoms, researchers have said. People with suspected dementia are being recruited via memory clinics across the country to see how well the test, which measures the protein p-tau217, works in the NHS. Alzheimer's disease is the most common cause of dementia and is linked to the build-up of two key proteins in the brain called amyloid and tau. P-tau217 is considered a promising biomarker which shows both amyloid and tau are present in the brain. A team led by University College London (UCL) is running the trial as part of the Blood Biomarker Challenge. Their aim is to understand if the test, which analysts suggest can tell around 80% of people with cognitive decline whether they are likely to have Alzheimer's, can improve the early and accurate diagnosis of the deadly disease. The test has already been shown to be effective in looking for the protein but researchers want to know whether giving it to patients near the start of an assessment for memory and thinking problems helps guide diagnosis and treatment. The study will recruit 1,100 people from diverse geographic, ethnic and economic backgrounds, alongside those living with other health conditions, to ensure the findings are relevant in a wide population. Essex Partnership University NHS Foundation Trust began recruitment a few weeks ago and 19 more UK centres are expected to take part. If shown to work in the NHS, blood tests could be used as part of a wider assessment to confirm the diagnosis of Alzheimer's disease for people who already have memory or thinking problems. Professor Jonathan Schott, from UCL and chief medical officer at Alzheimer's Research UK, said the blood test is backed by strong scientific evidence and provides comparable information to other gold-standard diagnostic tests such as PET scans and lumbar punctures, yet is far more accessible and cheaper. PET scans and lumbar punctures are only currently available to around 2% of people diagnosed with Alzheimer's, he said. He said identifying Alzheimer's disease early and accurately \"will become even more critical as a new generation of treatments emerges that can slow down the decline of memory and thinking\". \"Timely diagnosis will be key to ensuring these advances reach the people who need them most,\" he said. He added he hoped the trial would be a step forward in \"revolutionising\" diagnosis. Read more from Sky News:Cats' dementia link to humans Blood test for dementia is highly accurateDementia: Sleep problems could 'double risk' Professor Fiona Carragher, chief policy and research officer at the Alzheimer's Society, said \"only a third of people with dementia felt their experience of the diagnosis process was positive, while many reported being afraid of receiving a diagnosis\", according to the charity's own research. \"As a result, too often, dementia is diagnosed late, limiting access to support, treatment and opportunities to plan ahead,\" she said. Experts hope to have answers within three years."
    },
    {
        "title": "Lizard gives birth without mating in 'one of rarest events in animal kingdom'",
        "description": "A lizard at a UK zoo has given birth without mating in what has been described as \"one of the rarest events in the animal kingdom\".",
        "url": "https://news.sky.com/story/lizard-gives-birth-without-mating-in-one-of-rarest-events-in-animal-kingdom-13428157",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-scott-adams-exotic-zoo_7016053.jpg?20250910122039",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-10 11:53:00",
        "Headline": "The director of Telford's Exotic Zoo, Scott Adams, told Sky News the surprise event showed nature's \"self-conservation\".",
        "Content": "A lizard at a UK zoo has given birth without mating in what has been described as \"one of the rarest events in the animal kingdom\". A female casque-headed iguana produced eight healthy hatchlings at Exotic Zoo in Telford, Shropshire, without ever being housed with a male. The babies are receiving \"round-the-clock care\" and are expected to go on public display in the coming weeks. The \"virgin births\" were due to parthenogenesis, when an embryo develops from an unfertilised egg - a process which the zoo said had been documented in \"only a handful of reptile species worldwide\". The offspring are identical genetic clones of their mother. The zoo's director, Scott Adams, told Sky News the event showed nature's \"self-conservation\" and it had all come as a \"shock and surprise\". He added: \"It's been a cool experience for us. This is like nature doing it for itself. \"This is one of the rarest events in the animal kingdom. \"When we confirmed the eggs were fertile without any contact with a male, our jaws hit the floor. \"These babies are essentially mini-mum clones, and seeing them thrive is incredible. \"For us, it's a powerful reminder that life finds a way in the most unexpected circumstances. \"They have produced babies without males, so it's self-conservation.\" Mr Adams said staff first \"noticed something happening\" when the lizard got bigger. \"The babies will receive round-the-clock care, but they will eventually go off to other zoos,\" he added. Read more from Sky News:Blood test could 'revolutionise' Alzheimer's diagnosisChlamydia vaccine approved for koalas Casque-headed iguanas are native to Central and South America and are facing a number of threats in the wild, the zoo said. These include habitat loss and illegal poaching for the pet trade. \"This story gives us an amazing opportunity to talk with our visitors about genetics, evolution, and the challenges that reptiles face in the wild,\" said Mr Adams."
    },
    {
        "title": "'Leopard spots' found on rock on Mars are clearest sign life once existed on red planet, NASA says",
        "description": "\"Leopard spots\" found on a rock on Mars contain the clearest signs yet that life once existed on the red planet, NASA has announced.",
        "url": "https://news.sky.com/story/leopard-spots-found-on-rock-on-mars-are-clearest-sign-life-once-existed-on-red-planet-nasa-says-13428421",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nasa-rock_7016506.jpg?20250910210741",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-09-10 19:55:00",
        "Headline": "The space agency said analysis of the unusual markings by the Perseverance rover has revealed they contain minerals that on Earth can be a byproduct of microbes. Scientists can't rule out that the spots were caused by natural geological processes.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n \"Leopard spots\" found on a rock on Mars contain the clearest signs yet that life once existed on the red planet, NASA has announced. The space agency said analysis of the unusual markings by the Perseverance rover has revealed they contain minerals that on Earth can be a byproduct of microbes. Scientists can't rule out that the spots were caused by natural geological processes. But Nicky Fox, associate director of NASA's science mission directorate, said after a year of \"pressure testing\" the evidence, it still points to a biological origin. \"This finding by our incredible Perseverance rover is the closest we've actually come to discovering ancient life on Mars,\" she said. \"We're really excited about that. \"But it's a signature, a leftover sign. It's not life itself.\" The tantalising evidence was laid down in the rocks more than 3 billion years ago. At the time Mars was covered in lakes, rivers and perhaps even oceans. The surface water vaporised into space when the planet lost its atmosphere long ago. The Perseverance rover has been exploring an ancient river delta in the Jezero Crater since it landed in February 2021. The 3m-long robot has been taking detailed images of the surface, collecting rock samples and analysing material with onboard instruments. In July last year it came across a rock NASA named Cheyava Falls that lay in a canyon once carved out by water. Comprehensive analysis of the leopard spot-like markings on the rock, and others that resemble tiny black poppy seeds, has revealed minerals containing iron, phosphorus and sulphur. Evidence points to these being caused by chemical processes associated with microbial life. The only way of being sure is to bring the samples back to Earth. Read more from Sky News:Powerful right-wing influencer and Trump ally shot in neckHarry says King is 'great' after first meeting for 19 months But Donald Trump's cuts to NASA's budget have forced a rethink of its plans to launch a joint retrieval mission with the European Space Agency. Sean Duffy, the acting NASA chief, said: \"I've been given an ask for spending a little less money. I think we can do that. I know we can do that. \"But I've told the team at NASA, if we don't have the resources for the right missions or the right people, I will go to the president, I'll go to Congress, I'll ask for more money. \"But I feel pretty confident that with the money that we've been given, in the president's budget, we can accomplish our mission.\" If further scientific analysis does confirm microbes once existed on Mars, then we'll know life on Earth isn't unique. According to NASA every star in the night sky has an average of one planet orbiting around it. And with the right conditions, some could also be home to life. Perhaps even intelligent alien life."
    },
    {
        "title": "Sir Elton John 'so proud' of Watford FC as new kit marks 50 years since he became chairman",
        "description": "Sir Elton John has said he is \"so proud\" of Watford FC as the football club released a new kit marking 50 years since he became its chairman.",
        "url": "https://news.sky.com/story/sir-elton-john-so-proud-of-watford-fc-as-new-kit-marks-50-years-since-he-became-chairman-13428296",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sir-elton-john-watford_7016328.jpg?20250910173640",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-10 16:00:00",
        "Headline": "The blue kit will be worn by the Championship side for the first time on Saturday in their home game against Blackburn.",
        "Content": "Sir Elton John has said he is \"so proud\" of Watford FC as the football club released a new kit marking 50 years since he became its chairman. The blue shirts and silver shorts will be worn by the Championship team for the first time in their home game against Blackburn Rovers on Saturday. Watford, who are nicknamed the Hornets, have worn yellow home shirts since 1959. The choice of blue is inspired by the colour Watford wore during the singer's early days as a supporter. Speaking in a launch video for the kit, the 78-year-old musician said: \"My passion for this club has never died, and I'm so proud of this club, ever since I was five years old when we played in blue and there were two rickety old stands. \"What can I say? It's in my heart and my soul, you can't get rid of it. The supporters of this club have always been in my heart.\" The shirt is inspired by the artwork for his Diamonds hits compilation, and features his E logo, an embossed print of the lyrics of his hit track Your Song, and the Happy Hornet badge, which was the club logo when Sir Elton became chairman in 1976. \n                  Elton John unable to watch premiere of his new musical \n                 \n                  'I can't see anything': Elton John unable to finish new album\n                 \n                  Elton John, 77, reflects on his mortality: 'I don't know how much time I have left'\n                 Complementing the shirt are silver shorts with E taping running down both sides. The silver WFC crest features on the shorts. Sir Elton remains honorary life president at the club, having left his second stint as chairman in 2002, with Watford crediting the star with changing \"the trajectory and future of the club forever\". During his time as chairman, the club rose from the fourth division to second place in the top flight in the late 1970s and early 1980s, playing European football and reaching an FA Cup final. Watford are currently managed by Paulo Pezzolano. The team are 14th in the Championship table, having won just one of their first five league matches. Sir Elton has enjoyed 10 UK number one albums and 10 UK number one singles during his career. Read more arts and entertainment news:New Banksy artwork removed from wall in LondonSam Fender, Pulp, and Wolf Alice among Mercury Prize nominees He is best known for songs such as Saturday Night's Alright For Fighting, Goodbye Yellow Brick Road and Candle In The Wind. The shirts will be in a special edition gift box, and will be available in the club's shops and online from 9am on Friday. Fans can pre-order now."
    },
    {
        "title": "New Banksy artwork being removed from Royal Courts of Justice wall in London",
        "description": "A new Banksy artwork that sprung up at the Royal Courts of Justice in London is being scrubbed off.",
        "url": "https://news.sky.com/story/new-banksy-artwork-being-removed-from-royal-courts-of-justice-wall-in-london-13428144",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-banksy-courts-of-justice_7015989.jpg?20250910130620",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-10 12:38:00",
        "Headline": "HM Courts and Tribunals Service (HMCTS) has taken the decision to remove it due to the building being listed and therefore legally protected.",
        "Content": "A new Banksy artwork that sprung up at the Royal Courts of Justice in London is being scrubbed off. The mural depicted a protester lying on the ground holding a blood-spattered placard, while a judge, dressed in a wig and gown, loomed over him while wielding a gavel. The work was first seen on Monday on an external wall of the Queen's Building, part of the Royal Courts of Justice complex. It was covered up and guarded by security staff, with HM Courts and Tribunals Service (HMCTS) taking the decision to remove it due to the building being listed and therefore legally protected. It is understood that work began to remove the image on Tuesday and resumed on Wednesday. Good Law Project posted on X about the artwork's removal, stating: \"The court is erasing Banksy's mural just like it's erasing our right to protest. \"It only took 48 hours for the Royal Courts of Justice to scrub out a Banksy showing a judge striking down a protester with his gavel. \n                  New Banksy artwork to be removed from Royal Courts of Justice after report of criminal damage\n                 \n                  New Banksy artwork appears on court building showing judge attacking protester\n                 \n                  Banksy shares image of latest street art - as location found after speculation\n                 \"Silencing a work of art about silencing protest? Maybe it was a little too close to home.\" Banksy confirmed he was responsible for the work with a post on Instagram, showing the graffiti before it was covered over. The artist, whose identity is the source of constant speculation, captioned the pictures: \"Royal Courts Of Justice. London.\" Read more from Sky News:Hollywood stars among 1,300 filmmakers to boycott Israeli film companiesIsrael has crossed a huge diplomatic red line with Qatar strike Banksy is known for his graffiti and performance art pranks. His Love Is In The Bin artwork - which famously shredded itself after being sold in 2018 - sold at auction in 2021 for £18.5m. Elsewhere, a Banksy mural removed from the wall of a former shop in Lowestoft, Suffolk, in 2021 was later sold for an undisclosed sum. At the time, experts said it could have fetched hundreds of thousands of pounds, with rumours swirling it may have gone for up to £2m. Banksy's stencilled graffiti is often a comment on political issues, and many of his pieces are critical of government policy, war and capitalism. The artwork comes after almost 900 demonstrators were arrested for protesting in central London on Saturday against the banning of Palestine Action as a terror group. It was proscribed by the UK government under anti-terror laws earlier this year. It makes membership of, or support for, the direct action group a criminal offence punishable by up to 14 years in prison, while even wearing a T-shirt or badge with the group's name on could attract a maximum six-month sentence. The ban came shortly after two Voyager aircraft suffered around £7m worth of damage at RAF Brize Norton in Oxfordshire on 20 June. Banksy's artwork also came weeks after the Lady Chief Justice, the most senior judge in England and Wales, repeated concerns for the safety of judges, who she said had been subjected to \"increasingly unacceptable sensationalist and inaccurate abuse\". The work was reported as criminal damage, with the Metropolitan Police stating that inquiries were ongoing. A HMCTS spokesperson said: \"The Royal Courts of Justice is a listed building and HMCTS are obliged to maintain its original character.\""
    },
    {
        "title": "Sam Fender, Pulp, CMAT and Wolf Alice among Mercury Prize nominees for 2025 - as full shortlist revealed",
        "description": "Sam Fender is among the artists in the running for this year's Mercury Prize as the ceremony heads to his home city - with Pulp also shortlisted for their big comeback, and Wolf Alice breaking a record.",
        "url": "https://news.sky.com/story/sam-fender-pulp-cmat-and-wolf-alice-among-mercury-prize-nominees-for-2025-as-full-shortlist-revealed-13427143",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-wolf-alice-pulp-cmat_7015127.jpg?20250909124617",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-09-10 09:35:00",
        "Headline": "After more than 30 years, the Mercury Prize will take place outside London for the first time this year - at Newcastle's Utilita Arena on 16 October.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Sam Fender is among the artists in the running for this year's Mercury Prize as the ceremony heads to his home city - with Pulp also shortlisted for their big comeback, and Wolf Alice breaking a record. Other acts announced by judges today include the genre-bending FKA Twigs, indie-pop star CMAT and post-punk band Fontaines DC, who are all up for the award for the second time. Folk musician Martin Carthy is now believed to be the oldest ever nominee at 84 - and joins his daughter, Eliza Carthy, and late wife Norma Waterson, on the list of Mercury Prize shortlist alumni. Other first-timers include Jacob Alon and Joe Webb, who are both nominated for debuts, as well as Emma-Jean Thackray, Pa Salieu and PinkPantheress. This is a huge year for the event, which will take place outside London for the first time after more than 30 years - at Newcastle's Utilita Arena on 16 October. Last year, it was noted by winners English Teacher that they were the first act from outside London to pick up the prize in 10 years. This year's nominees include artists from Leeds, Sheffield, Gloucestershire, Coventry and Kent, as well as the capital, and more acts from, Scotland, Wales and Ireland. 'Sam Fender shows what is possible' Ahead of the show, a week-long fringe festival will take place across Newcastle, Gateshead, Sunderland, North Tyneside, South Tyneside, Durham and Northumberland to spotlight the North East's music scene. One of the biggest stars to emerge from that scene in recent years is of course Sam Fender, from North Shields. The indie-rock singer-songwriter was first nominated for the Mercury Prize in 2022, for his second album, Seventeen Going Under, and returns to the shortlist this year with his third chart-topper, People Watching. \"The success of artists like Sam Fender shows what is possible for young musicians in our region,\" North East Mayor Kim McGuinness said earlier this year. \"Hosting the Mercury Prize in the North East gives us the opportunity to showcase our home-grown talent.\" Previous Mercury winners Pulp and Wolf Alice are both nominated for the fourth time. For Wolf Alice, who first made the cut with their debut My Love Is Cool in 2015 and won with their second album Visions Of A Life in 2018 before a third nod for Blue Weekend in 2021, this latest recognition for The Clearing means that every single one of the four albums they have ever released has been in the running. They previously held this accolade with Laura Mvula and Anna Calvi, who have been both nominated for all three of their studio albums. Pulp were first nominated for their fourth album His'n'Hers in 1994 and won with Different Class, one of the most famous albums of the Britpop era, in 1996. A nomination for This Is Hardcore followed in 1998 - and now More, their first album in more than 20 years, has earned them a nod once again. And CMAT returns for the second year in a row, after being nominated for her second album, Crazymad, For Me, in 2024, and now Euro-Country. Speaking at the nominations launch, Alon, from Fife, in Scotland, told Sky News it means a great deal to see his hugely personal album In Limerence recognised by the Mercurys. \"I have this habit of yearning after things that aren't real, shielding my heart from real love and and chasing after fictional love. And I think growing up as a queer person, like, we're no stranger to that feeling. \"I'm just really grateful that these songs mean a lot of things to me. But there's a whole world of people that it might mean something different to.\" They also said they were excited to see the event move to Newcastle. \"There's just so much vibrancy everywhere, and it's nice to get a bit of spotlight on those different places. Maybe one day we'll end up in Fife. Who knows?\" 'If I hadn't made Weirdo, I wouldn't be here' Thackray, who finished her album, Weirdo, following the sudden death of her partner, said she set out to male music that \"not just accepted, but celebrated, my neurodiversity and the things that make me a weirdo, things that made me feel othered and alone. \"Then I lost my partner. It was very sudden and horrible, and I just stopped doing anything for about six months. And then when I came back to music, it was because I remembered that if I was going to find myself anywhere, it would be in the music. \"Music is my purpose, it's always been my purpose. I've wanted to be an artist since I was a toddler. It's all I've ever wanted to be, all I've ever known, and I needed to sit and get back in touch with that. And I made a record that is really important to me, and if I hadn't have made it, I wouldn't be here.\" Carthy said he had the best job in the world. \"I say it again and again. There's nothing that comes near it.\" Former Ivor Novello nominee Pa Salieu receives his Mercury nod for Afrikan Alien, released in November 2024 - just a few months after he was released from prison. The rapper and singer was convicted in 2022 for his part in an attack which happened in 2018. \"I feel shocked, absolutely shocked,\" he said at the launch. \"And happy, grateful. And I'm free.\" The Mercury Prize launched in 1992, when Simply Red's Stars, U2's Achtung Baby, and The Jesus And Mary Chain's Honey's Dead were among the nominees - and Primal Scream's Screamadelica took the inaugural award. It celebrates music by British and Irish acts and spans a huge range of different musical genres and artists throughout all stages of their careers, from newcomers to veterans. As well as English Teacher, other recent winners include Michael Kiwanuka, Arlo Parks, Little Simz and Ezra Collective."
    },
    {
        "title": "The Repair Shop presenter Jay Blades pleads not guilty to two rape charges",
        "description": "TV presenter Jay Blades has pleaded not guilty to two counts of rape.",
        "url": "https://news.sky.com/story/the-repair-shop-presenter-jay-blades-pleads-not-guilty-to-two-rape-charges-13428048",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jay-blades-court_6983257.jpg?20250805114713",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-10 09:29:00",
        "Headline": "Blades, who lives in Shropshire, and is on conditional bail, found fame on the BBC furniture restoration programme The Repair Shop, which he began presenting in 2017.",
        "Content": "TV presenter Jay Blades has pleaded not guilty to two counts of rape. The 55-year-old did not attend Shrewsbury Crown Court on Wednesday morning, instead appearing via videolink. The case was adjourned for trial in September 2027. Blades's defence counsel Susan Meek told the court the defendant had been unable to work since the allegations were made, adding: \"It is an extraordinarily long time for him not to be able to work.\" Judge Anthony Lowe expressed regret at the \"backlog\" causing the delay. He said he was unable to \"bump\" other cases out of the list to accommodate an earlier trial. \"That, I am afraid, is just the state of where we are with outstanding trials,\" he said.  A case management hearing was also set for the same court on 15 May next year, which Blades will not be required to attend in person. Blades, who lives in Shropshire, and is on conditional bail, found fame on the furniture restoration programme The Repair Shop, which he started presenting in 2017. A furniture restorer, he was the face of the popular BBC show that featured people having their treasured objects repaired and rejuvenated until he stepped back from presenting the programme last year. Read more from Sky News:Two children among three dead in ChannelBlood test could 'revolutionise' Alzheimer's diagnosis  Blades was also the presenter of the BBC's Money For Nothing until 2020 and took part in Celebrity MasterChef, Celebrity Bake Off, and Comic Relief. The 14th series of The Repair Shop aired this year with no lead presenter and the 2024 Christmas special was hosted by Roman Kemp."
    }
]