[
    {
        "title": "Trump makes Iran pledge as more than 2,000 protesters reported killed",
        "description": "A 26-year-old Iranian protester is set to be executed today for participating in anti-regime protests that have swept the country in recent weeks, as the world awaits possible intervention by the US.",
        "url": "https://news.sky.com/story/iranian-protester-faces-imminent-execution-claims-human-rights-group-13493858",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-trump-iran_7134732.jpg?20260114004330",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-13 23:10:00",
        "Headline": "Donald Trump has said he'll take \"very strong action\" if Iran's regime hangs protesters, and the US has urged its own citizens in the country to leave immediately as speculation ramps up about American military action.",
        "Content": "A 26-year-old Iranian protester is set to be executed today for participating in anti-regime protests that have swept the country in recent weeks, as the world awaits possible intervention by the US. Donald Trump has called on demonstrators to \"keep protesting\" and pledged \"help is on its way\", without offering any detail about what that could entail. In a post on his Truth Social platform, the president warned the \"killers and abusers\" will \"pay a big price\". Latest updates on Iran protests US-based Human Rights Activists News Agency (HRANA), which has been accurate in multiple rounds of unrest in Iran in recent years, reports at least 2,571 people have been killed as of early Wednesday. According to Norway-based rights group Hengaw, Erfan Soltani, from the city of Fardis to the west of Tehran, will be executed later today - adding to the death toll. Hengaw said Mr Soltani had been arrested in connection with protests in the city of Karaj. The Kurdish group, which documents human rights abuse in Iran, said his family had been informed about the death sentence, although they had been \"deliberately kept uninformed\" about the judicial process. \"The rushed and non-transparent handling of this case has heightened concerns over the use of the death penalty as a tool to suppress public protests,\" a statement added. In an interview with CBS News, Mr Trump has said he'll take \"very strong action\" if Iran's regime hangs protesters. The US has urged its citizens to \"leave Iran now\", ideally by land through Turkey or Armenia, and JD Vance hosted a National Security Council meeting about the situation on Tuesday night. It comes after Mr Trump's Middle East negotiator Steve Witkoff reportedly held a secret meeting with exiled Iranian former crown prince Reza Pahlavi over the weekend. The son of Iran's last shah has sought to position himself as an opposition figure since the protests began. How did we get here? Demonstrations began in Tehran, the capital, on 28 December, when shopkeepers went on strike over the collapse of the Iranian currency to an all-time low. Authorities blocked internet and telephone connections on 9 January as the protests intensified. According to HRANA, 2,403 of those killed so far were protesters and 147 were government-affiliated. Twelve children have also been killed, it said. More than 18,100 people have been detained, the group added. Phone connection was briefly restored on Tuesday, allowing witnesses to the protests to share reports with news outlets of a heavy security presence in central Tehran, burned-out government buildings and smashed ATMs. Anti-riot police officers, wearing helmets and body armour, carried batons, shields, shotguns and tear-gas launchers, witnesses reported. Iran's ambassador to the UK was summoned to the Foreign Office in London on Tuesday afternoon amid concerns about the Iranian government's crackdown on protesters. Several European countries held similar meetings, including Finland's foreign minister, who warned Tehran had shut the internet off \"to kill and oppress in silence\". Read more:Iran protest deaths: A sculptor, a footballer and a hairdresserVerifying protests and deaths in IranFamily's shock over teen's death in Iran The demonstrations pose potentially the largest threat to Iran's regime since the 1979 Islamic Revolution - when former supreme leader Ayatollah Ruhollah Khomeini installed a Shia theocracy. Iran's Supreme Leader Ayatollah Ali Khamenei criticised the US and praised the Iranians who took part in pro-government demonstrations on state TV on Monday. \"This was a warning to American politicians to stop their deceit and not rely on traitorous mercenaries,\" he said. Iran's economy has struggled in recent years due to rising inflation and pressure from US sanctions imposed under the first Trump administration in 2018. The UN reimposed sanctions in September. Mr Trump announced on Monday that any countries doing business with Iran will face 25% tariffs from the US. The country suffered further blows during the 12-day war, which saw America and Israel strike the country's nuclear facilities in June."
    },
    {
        "title": "Government U-turns on mandatory digital ID cards for workers",
        "description": "The government has abandoned plans to make digital ID cards mandatory for workers just months after Sir Keir Starmer proudly announced them.",
        "url": "https://news.sky.com/story/government-u-turns-on-mandatory-digital-id-cards-for-workers-13493917",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-starmer-digital-id_7134736.jpg?20260114015357",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-13 18:25:00",
        "Headline": "Last year, the government said it would be compulsory to have digital ID for the right to work in the UK.",
        "Content": "The government has abandoned plans to make digital ID cards mandatory for workers just months after Sir Keir Starmer proudly announced them. Sky News understands digital IDs will no longer be required for the right to work by the end of this parliament, set for 2029. Last year, the government had said it would be compulsory as a way of reducing illegal working. A government spokesperson said on Tuesday: \"We are committed to mandatory digital right to work checks. \"Currently right to work checks include a hodge podge of paper-based systems with no record of checks ever taking place. This is open to fraud and abuse. \"We have always been clear that details on the digital ID scheme will be set out following a full public consultation which will launch shortly. \"Digital ID will make everyday life easier for people, ensuring public services are more personal, joined-up, and effective, while also remaining inclusive.\" Read more from Sky News:Trump makes Iran pledgeHow Russia's using 'disposable agents' According to The Times, while right to work checks will still be mandatory, other forms of documentation, such as an electronic visa or a passport, will be valid - not just digital ID. U-turns pile up Just four months ago, Sir Keir said: \"You will not be able to work in the UK if you don't have a digital ID, it's as simple as that.\" He said the scheme would \"make it tougher to work illegally in this country, making our borders more secure\". The government had previously said anyone starting a job or renting a home would need to show the digital ID on their phone, and it would then be checked against a database of those entitled to work and live here. The Conservatives accused Sir Keir of \"spinelessness\", while the Lib Dems said the plan was \"doomed to failure\". It is the 13th U-turn by this government. Tory shadow Cabinet Office minister Mike Wood said: \"What was sold as a tough measure to tackle illegal working is now set to become yet another costly, ill-thought-out experiment abandoned at the first sign of pressure from Labour's backbenches.\" Lib Dem Cabinet Office spokesperson Lisa Smart MP added: \"It was clear right from the start this was a proposal doomed to failure, that would have cost obscene amounts of taxpayers money to deliver absolutely nothing.\""
    },
    {
        "title": "New Birmingham to Manchester rail line to be built",
        "description": "A new rail line will be built between Birmingham and Manchester, the government has announced.",
        "url": "https://news.sky.com/story/new-birmingham-to-manchester-rail-line-to-be-built-but-govt-provides-no-timeline-13493926",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-gbr-great-british-railways_7104936.jpg?20251208163656",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-13 18:54:00",
        "Headline": "Sir Keir Starmer said it would not happen until after Northern Powerhouse Rail (NPR), aimed at boosting east-west rail links in northern England, is completed.",
        "Content": "A new rail line will be built between Birmingham and Manchester, the government has announced. However, no timescale for when it would be built was provided - or any other details, such as how it would be funded. The Treasury said it wants a new Birmingham-Manchester rail line, but it would not be \"a reinstatement of HS2\". Rishi Sunak's Conservative government scrapped a planned extension of HS2 between the two cities in 2023 to save money. Land obtained for HS2 between the West Midlands and northern cities will be kept while the project is developed. A new line would ease pressure on the West Coast Main Line, the government said. The Treasury did not provide a date for when it aims to have the new line finished, but said it would not open until after the completion of Northern Powerhouse Rail (NPR), a scheme to boost east-west rail connections across northern England. Sir Keir Starmer said the government was \"rolling up its sleeves\" to deliver NPR. The programme's first phase is set to improve connections on existing lines in the 2030s on these routes: between Sheffield and Leeds; between Leeds and York; and between Leeds and Bradford. They do not require major new land acquisitions. A second phase of NPR is set to involve a new route between Liverpool and Manchester via Manchester airport and Warrington, using a combination of new and existing lines. The third and final phase will involve better connections eastwards from Manchester to Leeds, Bradford, Sheffield and York. There is also money for a new station for Bradford. Regular services would run on to Newcastle via Darlington and Durham, and Chester for North Wales connections. Development work would also be taken forward on reopening the Leamside Line, a 21-mile route between Pelaw, Gateshead, and Tursdale, County Durham, which was closed in 1964. The Treasury said a \"funding cap\" of £45bn would be set for NPR, although this could be topped up by local contributions, such as through increased revenue from business rates. It added that an initial £1.1bn for development and design work would be available to enable the creation of a \"detailed delivery plan which will include timings\". Sir Keir said: \"Over and over again, people in northern communities, from Liverpool and Manchester to York and Newcastle have been let down by broken promises. \"This cycle has to end. No more paying lip service to the potential of the North, but backing it to the hilt. \"That's why this government is rolling up its sleeves to deliver real, lasting change for millions of people through Northern Powerhouse Rail: a major new rail network across the North that will deliver faster, more frequent services.\" However, the Tories accused the government of \"watering down\" NPR and said ministers had \"put back any plans to actually deliver it and rewritten timetables on the fly\". Shadow rail minister Jerome Mayhew said: \"Labour lurch from review to review, deadline to deadline, with no grip on costs, no clarity on scope and no courage to make decisions, exemplified nowhere clearer than the hatchet job of Great British Railways. \"Northern Powerhouse Rail could have been transformational, empowering regional growth and regeneration. Under Labour it risks becoming a permanent mirage that is endlessly redesigned, downgraded and never delivered.\""
    },
    {
        "title": "How Russia is using 'disposable agents' to sabotage Europe",
        "description": "Russian spies are increasingly recruiting Ukrainians to carry out acts of sabotage in Europe to undermine NATO and attempt to turn public opinion against Ukraine, according to new research.",
        "url": "https://news.sky.com/story/how-russia-is-using-disposable-agents-to-sabotage-europe-13494007",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-putin-russia_7134733.jpg?20260114005531",
        "type": "Home",
        "Author": "Deborah Haynes",
        "Date Published": "2026-01-13 22:43:00",
        "Headline": "A report from the Royal United Services Institute (RUSI) thinktank reveals how intelligence officers linked to the Kremlin are wooing unwitting individuals - including Ukrainians - online to destabilise Western powers.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n Russian spies are increasingly recruiting Ukrainians to carry out acts of sabotage in Europe to undermine NATO and attempt to turn public opinion against Ukraine, according to new research. Kremlin-linked intelligence officers are accused of seeking to woo potentially unwitting individuals via messaging apps such as Telegram or gaming sites to become \"disposable agents\", tasked with conducting arson, vandalism and other hostilities. Other nationalities are also recruited. The research report, published by the Royal United Services Institute (RUSI) thinktank, said money is a key motivator, with teenagers, migrants and older people with experience of serving in the Soviet military seen as ripe for recruitment. 'Gig-economy of sabotage' Payment - ranging from hundreds to thousands of euros - is often promised in cryptocurrency, making the source of funding hard for investigators to trace. \"The methods used to recruit and task saboteurs have shifted from Cold War-era reliance on trained intelligence operatives to a model characterised by remote, freelance and highly deniable assignments: the 'gig-economy era' of Russian sabotage,\" the report - entitled \"Responding to Russian Sabotage Financing\" - said. \"Hostile actors now outsource low-cost tasks to disposable individuals (or 'agents for a day') recruited online.\" The Kremlin has previously denied Western allegations of a growing campaign of sabotage and other hybrid hostilities. But the number of acts of Russia-linked arson and serious sabotage across Europe is reported to have risen to 34 in 2024, up from 12 the previous year and just two in 2022. The authors of the RUSI report said this tactic of deliberately deniable activity carried out under the threshold of conventional war has \"evolved into a systematic and geographically targeted threat\". They urged NATO and the EU urgently to improve their response to deter future acts of sabotage. This includes agreeing a definition of what constitutes sabotage and drawing on counterterrorism powers to track illicit funding channels. Putting NATO 'red lines' to the test The report also said governments must view individual incidents - regardless of how minor - as being part of a much graver pattern of activity against Western allies. \"While individual incidents may appear low-level or opportunistic, collectively they suggest the emergence of a broader campaign designed to raise the cost of supporting Ukraine, test the red lines of NATO states and erode public trust in Western national security systems,\" it said. Suspected Russian sabotage covers a range of actions from major operations such as damaging undersea cables to much more simple attacks against military and civilian targets, including starting fires and vandalism but also reconnaissance activities. 'Disposable agents' This low-level activity is the focus of the report, which drew on the insight of individuals from law enforcement, academia, and journalism as well as policy experts. With many Russian intelligence officers expelled from Europe in the wake of Russia's full-scale invasion of Ukraine, the RUSI report found that Russian spies \"increasingly rely on intermediaries and 'disposable agents', many from Ukraine, to execute sabotage tasks.\" \"If such incidents are treated purely as the actions of individual Ukrainians, this could fuel anti-Ukrainian sentiment and erode public support for Kyiv - a strategic aim of sabotage operations,\" it said. The report said recruited Ukrainians include those who were \"unaware of the true nature of their tasks\". Read more from Sky News:Chinese hackers blamed for sabotageWhy UK's undersea cables are vulnerableBritish men recruited by Russia and China It cited the experience of Poland - a frequent target of suspected Russia-linked hybrid attacks. \"Many of those detained on sabotage-related charges from 2023 to 2025 were Ukrainian nationals - a development interpreted not as evidence of Ukrainian coordination but as part of a deliberate Russian strategy to exploit the presence of Ukrainian migrants, with the aim of provoking public distrust and political tension,\" it said. One of the most recent examples of hostile action that the Polish authorities have attributed to Russian intelligence is an explosion in November 2025 on a railway line that provides a key route to transport aid to Ukraine. Officials reported that two Ukrainian nationals suspected of involvement fled to Belarus, while several others were detained. The Polish prime minister described the incident as an \"unprecedented act of sabotage\"."
    },
    {
        "title": "The government invited us on an immigration raid. There were two arrests, they both walked free",
        "description": "Three vans roll out of a car park in Croydon. Inside, South London&#8217;s immigration enforcement team have a list of targets. Their role is to arrest illegal workers. &#160;",
        "url": "https://news.sky.com/story/theres-still-a-long-way-to-go-inside-the-home-offices-crackdown-on-illegal-migration-13493970",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-immigration-raid_7134676.png?20260113221300",
        "type": "Home",
        "Author": "Jason Farrell",
        "Date Published": "2026-01-13 21:20:00",
        "Headline": "The Home Office has ramped up its enforcement operations to combat illegal migration and wanted to show its work off to us. But in one morning, with a large team, there were only two arrests, and they were both released.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n Three vans roll out of a car park in Croydon. Inside, South London’s immigration enforcement team have a list of targets. Their role is to arrest illegal workers.   We've been invited because the Home Office is keen to promote an increase in arrests in the 18 months since the Labour government came to power - up 83%. But will this have an impact on the government's aim to crack down on illegal migration? The first stop is a car wash in Lewisham. A business that has previously employed illegal workers. The team has intelligence they are doing so again. On arrival it's raining, there is no car washing and just two employees sit in the dry. Both are Romanian and their employment status is legitimate. The boss, Amir Neziraj, says they've learned their lesson after being fined £30,000 a few years ago. He explains that, at that time, the rogue employees used fake passports. He added: \"Obviously now you've got all the online stuff. You can check people's status. I don't want to be racking up fines. We are fully legit.\" He tells the immigration officers: \"You can always come and have a look guys.\" 'Both the workers are illegal' We move on to the next target, a nail bar in Catford. The team make visits based on intelligence, which could come from the Home Office, trading standards, police officers or members of the public. It is suspected that the beauty salon is employing illegal Chinese workers. The shop is on a pedestrianised high street and on our arrival two Chinese women are conducting treatments on clients. That soon comes to a stop as the officers interview them through interpreters on the other end of a phone. After checking Home Office records, the team establishes both workers are illegal. Operation Lead Sarah Allen tells me: \"Ultimately, what we're seeking to do is remove people from the UK, those not entitled to be here and not entitled to work in the UK. \"Sometimes we're able to do that very quickly. Other times we need to make sure that we put people on bail, keep them in contact with us so that we can help them and support them through any application process to remove them.\" Often these workers are being exploited, trafficked or sold an image of the UK that doesn't reflect the reality. Many are just trying to get back while being stuck in a backlogged system. Immigration officers will only detain people if they can determine the individual can be removed from the country relatively quickly. Often there are barriers. The two Chinese illegal workers are arrested but allowed to walk free on what is called immigration bail. 'We've got to keep going at this' Home Office Minister Mike Tapp, who joined the raid, says even if they can't be deported, the arrests are still worthwhile. He told me: \"They will have to report in - so we've got that closer control of these people. There's also the process that they've got to go through. \"When we came in, that whole processing in the system had ground to a halt, that backlog is down. We've reduced those cases by 39%. \"So, we've got to keep going at this. There's still a long way to go. But today is an important demonstration of how seriously we're taking this.\" Read more from Sky News:All the ex-Conservative MPs who defected to ReformGuantanamo Bay detainee to get 'substantial' sum from UK There have been 12,300 arrests for illegal working since this government came to power. So far 15% of those have been removed from the UK. Those on immigration bail could face fines for working illegally but the big financial penalties are often for the employers - which can now amount to £60,000 per illegal worker. Ultimately the aim is to send a message that there is no black market economy available to illegal migrants and thus reduce the pull-factor for those considering the journey. The Home Office has released videos of arrests made across the country, but from our experience in South London, intelligence isn't always accurate; one premises we attempted to raid was closed for the day. Ultimately in one morning, with a large team, there were only two arrests, and they were released."
    },
    {
        "title": "Clintons refuse to testify in Republican-led Epstein investigation, risking contempt proceedings",
        "description": "Bill and Hillary Clinton have said they will refuse to testify in a Republican-led investigation into convicted sex offender Jeffrey Epstein.",
        "url": "https://news.sky.com/story/clintons-refuse-to-testify-in-republican-led-epstein-investigation-risking-contempt-proceedings-13493888",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-bill-clinton-hillary-clinton_7134500.jpg?20260113183836",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-13 16:56:00",
        "Headline": "Republican representative James Comer said the committee leading the probe will meet next week to hold former US president Bill Clinton in contempt.",
        "Content": "Bill and Hillary Clinton have said they will refuse to testify in a Republican-led investigation into convicted sex offender Jeffrey Epstein. \"Every person has to decide when they have seen or had enough and are ready to fight for this country, its principles and its people, no matter the consequences,\" the Clintons wrote in a letter published on social media. \"For us, now is that time.\" The letter was addressed to Republican representative James Comer. He chairs the House of Representatives Oversight Committee, whose Epstein probe was slammed as \"legally invalid\" by the Clintons. He said the committee will meet next week to hold former US president Bill Clinton in contempt, which could potentially lead to criminal charges. The Clintons said this was \"literally designed to result in our imprisonment\". Former secretary of state Hillary Clinton, who ran against Donald Trump in the 2016 presidential election, is due to appear before the panel on Wednesday, with a committee spokesperson saying contempt proceedings would also be initiated against her if she fails to testify. The Clintons said in their letter that they had provided the \"little information\" they had to aid the investigation. They also accused Mr Comer of selectively enforcing subpoenas against them, as they said other former officials were allowed to provide written statements about Epstein to the committee. \"There is no plausible explanation for what you are doing other than partisan politics,\" they wrote. Read more:Trump defends Clinton over images in Epstein filesImages of Trump among reposted Epstein documents Mr Comer said after Bill Clinton did not show up to testify on Tuesday: \"No one's accusing the Clintons of any wrongdoing. We just have questions.\" \"Anyone would admit they spent a lot of time together,\" Mr Comer told reporters, adding that \"most Americans\" wanted Mr Clinton to answer questions about his ties to Epstein, who died in prison while awaiting trial for sex-trafficking charges in 2019. Mr Comer claims Epstein visited the White House 17 times during Mr Clinton's presidency, and that Mr Clinton was on board Epstein's private plane more than 20 times. Mr Clinton's friendship with the financier is well-documented throughout the 1990s and early 2000s, but Mr Clinton has never been accused of wrongdoing in connection with Epstein. The Trump administration, due to pressure from its Republican base, has ordered the US Justice Department to release files related to the criminal investigations into Epstein to comply with a transparency law passed by Congress. Mr Trump also used to be friends with Epstein, but he said he cut off that relationship before the financier was accused of sexual abuse. Mr Comer indicated that the committee would not try to get testimony from Mr Trump about Epstein, as he said it could not force a sitting president to testify."
    },
    {
        "title": "Man on trial in Virginia accused of plotting double murder with Brazilian au pair",
        "description": "A man from Virginia, who was having an affair with his family's Brazilian au pair, has gone on trial accused of the elaborate murder of his wife and an unsuspecting stranger.",
        "url": "https://news.sky.com/story/man-on-trial-in-virginia-accused-of-plotting-double-murder-with-brazilian-au-pair-13493962",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-brendan-banfield-peres-magalhaes_7134669.png?20260113220834",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-13 22:45:00",
        "Headline": "The prosecution alleges that Brendan Banfield lured a stranger to the family home to kill his wife as part of a murder plot, which he denies. The family's au pair, Juliana Peres Magalhaes, has agreed to testify against Banfield as part of a plea deal.",
        "Content": "A man from Virginia, who was having an affair with his family's Brazilian au pair, has gone on trial accused of the elaborate murder of his wife and an unsuspecting stranger. Brendan Banfield, 40, denies killing Christine Banfield as well as Joseph Ryan, whom he allegedly planned to frame for the murder of his wife, at the family home in February 2023. In opening statements, lead prosecutor Jenna Sands said that Banfield and Juliana Peres Magalhaes, the family's au pair, were in love. But Banfield did not want a divorce because he did not want to lose custody of his daughter or even to share custody with his wife. Ms Sands told the court in Fairfax County that \"Brendan revealed his desire to get rid of Christine\" and the pair impersonated her on a social media site for sexual fetishes. She added that Banfield arranged an elaborate scenario with Mr Ryan in which he would act out an arranged rape fantasy and that Mr Ryan was instructed not to stop \"even if she was calling for help\". Magalhaes, 25, has pleaded guilty to a lesser charge of manslaughter for her role in the double murder plot and agreed to testify against Banfield. The prosecution continued with alleged details about the murder: \"Brendan enters the bedroom, first shooting Joe in the head, picks up the knife that Joe had brought and stabs Christine repeatedly in the neck. \"He directs Juliana to shoot Joe a second time with her gun, this time the bullet enters Joe's chest with Christine dead or dying.\" Banfield's defence lawyer, John Carroll, disputes the prosecution's case, telling the court that digital forensics would show Christine Banfield directly engaged with Mr Ryan on the site. \"You're going to see a presentation of a horrible, tragic, awful event,\" he added. He said there is no dispute that Banfield and Magalhaes were having an affair, but \"there's an awful lot more to look for\". Read more from Sky News:Guantanamo detainee gets UK payoutTrump risks ending China trade war truceClintons won't testify over Epstein The defence said Magalhaes had maintained her innocence for a year but eventually changed her story in exchange for a prosecution deal. \"The whole reason she was arrested was to flip her against my client,\" Mr Carroll said. Banfield, whose daughter was at the house on the morning of the killings, denies aggravated murder, child abuse and child cruelty. He faces life in prison if convicted of murder. The trial continues."
    },
    {
        "title": "'They stole from Ollie': Sister calls for action on 'illegal' betting sites after gambler took his own life",
        "description": "The sister of a man who died by suicide after black market betting sites \"deliberately lured him in\" has called for the Gambling Commission to review existing laws.",
        "url": "https://news.sky.com/story/they-stole-from-ollie-sister-calls-for-action-on-illegal-betting-sites-after-gambler-took-his-own-life-13493918",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-oliver-long-ollie-long_7134084.jpg?20260113115000",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-13 18:26:00",
        "Headline": "Oliver Long, 36, tried to exclude himself from accessing gambling sites in the UK, but was \"actively targeted\" by illegal overseas providers.",
        "Content": "The sister of a man who died by suicide after black market betting sites \"deliberately lured him in\" has called for the Gambling Commission to review existing laws. Warning: This story contains descriptions some readers may find distressing, including references to self-harm and suicide. Oliver Long, 36, was found dead in East Sussex on 23 February last year after a battle with gambling addiction, an inquest heard on Tuesday. His sister, Chloe, said he had tried \"so desperately to help (himself)\" by self-excluding from online gambling sites, but later started using unlicensed sites from outside the UK. Chloe said her brother had been \"targeted by these illicit, illegal black market sites\", which were ultimately to blame for his death. \"Ollie's experience was horrendous because he was trying his absolute best to try and help himself, he recognised that he was experiencing significant harm from gambling,\" she said after the hearing. \"And he wanted to help himself by self-excluding, and unfortunately he was targeted by these illicit, illegal black market sites. And I'm just so concerned of the risk this poses to other people.\" She said her family was \"disappointed\" the coroner had not included gambling disorder in Mr Long's medical cause of death, but vowed to continue to advocate for change in his memory. Mr Long had been diagnosed with a \"severe gambling addiction\", but senior coroner for East Sussex Laura Bradford recorded a short form conclusion of \"suicide\". Chloe said the Gambling Commission was \"not doing enough\" to prevent problem online gambling, and must review \"outdated\" legislation which predated the smart phone. \"I think its important they acknowledge the scale of the issue and the fact there is so much being done by these illegal operators to actively target the most vulnerable groups, those how have self-excluded and underaged children,\" she said.\"So they need to do significantly more in terms of having a more impactful strategy for enforcement.\" The Gambling Commission said: \"We are deeply saddened by the loss of Oliver Long and our thoughts are with his family and loved ones. \"The targeting of vulnerable people by illegal gambling operators is a criminal act. \"Unlicensed operators deliberately seek to evade protections such as GamStop and can pose serious risks to consumers.\" Chloe said the gambling industry had exploited Mr Long's love of football and \"deliberately lured him in and taught him to hate himself\", leaving him convinced he was \"immoral and a failure\". \"They were highly addictive, predatory systems designed to exploit. And they did. They stole from Ollie - not only his money, but his peace, his future, and ultimately, his life,\" she said. She said her brother's death had left a \"hole\" in her family.\"(He was) such a kind, generous, loving person, and we have a really, really close family,\" Chloe said. \"He adored his nephews, his five young nephews, and he was just great fun to have around. He was always the life and soul of the party ... It's just such a hole in our family not having him anymore.\" Read more from Sky News: Two boys, 16, among three arrested after fatal stabbingRoofer who ran over and killed woman on golf course jailed Mr Long seemed to have opted to exclude himself from UK gambling sites in 2022 before he started to use overseas unlicensed gambling sites in 2023, the court heard. His bank statements showed that his savings depleted by £20,000 in April 2023 alone. At the height of his addiction, Mr Long lost his house, his job and separated from his long-term partner. Mr Long had spent a weekend with his family the week before he died and wrote farewell notes to them in the days before. The court heard he had struggled with depression and anxiety and used cannabis to \"numb\" the pain of his addiction. Tim Miller, the executive director of the Gambling Commission, told the coroner that these sites are \"deliberately seeking to target people who are already experiencing harm\", and marketing themselves to circumvent UK self-exclusion tools like \"GamStop\". He said that some of these sites are run by \"criminal networks\" who are involved with \"terrorists and organised crime\". :: Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Cowboy roofer who ran over and killed woman on golf course jailed - as video shows police chase",
        "description": "A rogue roofer who ran over a mother-of-three on a golf course during a police chase has been jailed for 13-and-a-half years for causing her death.",
        "url": "https://news.sky.com/story/cowboy-roofer-who-ran-over-and-killed-woman-on-golf-course-jailed-as-video-shows-police-chase-13493590",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-john-mcdonald-suzanne-cherry_7133727.jpg?20260112204111",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-13 12:34:00",
        "Headline": "John McDonald, 52, admitted to causing the death by dangerous driving after 62-year-old Suzanne Cherry was hit by a van that was being followed by police.",
        "Content": "A rogue roofer who ran over a mother-of-three on a golf course during a police chase has been jailed for 13-and-a-half years for causing her death. John McDonald, 52, admitted to causing the death by dangerous driving after 62-year-old Suzanne Cherry was hit by a van that was being followed by police. Ms Cherry had been playing golf with her husband, Clint Harrison, at Aston Wood Golf Club in Shenstone, Staffordshire, when the incident took place on 11 April last year. Handing sentence, judge James Burbidge said McDonald's actions were \"wicked in the extreme,\" and that \"it is clear that you did attempt to brake, but you had insufficient time to avoid her\". \"Clint Harrison saw you [and co-defendants Johnny McDonald, 23, and Brett Delaney, 35] run away from the vehicle,\" the judge added. \"He says the person who stepped out of the driving seat actually stepped over Sue. \"He says he saw, in a split second, the driver stutter and look back, but you didn't stop, John, you sought to save your own skin. \"Even if you did something to avoid the collision, it was too little, too late.\" \n                  Van driver in police pursuit 'fatally hit mother-of-three who was looking for golf ball'\n                 \n                  Radar 'technical issue' halts flights to Birmingham Airport\n                 \n                  Watchdog to examine West Midlands Police role in Maccabi Tel Aviv fans ban\n                 'Everybody loved her' Speaking after sentence was handed down, Mr Harrison paid tribute to her as an \"inspiration\". He said: \"You really don't want to know what I think about the sentence. I have got no thoughts about them at all. I won't give them any head space.\" He then added: \"Everybody loved her. She was an inspiration. All the young ladies wanted to be like Suzanne Cherry because of what she achieved in her life. \"A company owner, advanced motorcyclist, cyclist, scuba diver, and anything else she could jump off or dive off.\" Mr Harrison previously said, shortly after her death, that Ms Cherry would be \"painfully missed\" by her family and friends. \"While enjoying what should have been the safest of one of Suzanne's many activities, I watched in helpless horror as the life of my beautiful wife and our future together was snatched away in an instant,\" he said. Read more:Ex-soldier jailed for police station petrol bomb attackFamily's shock over teen's death in Iran Co-defendants jailed for conspiracy to commit fraud Brett Delaney, 35, and Johnny McDonald, John McDonald's son, 23, were not held responsible for the collision, but the pair - along with the senior McDonald - admitted to conspiracy to commit fraud on Monday. The court heard that the trio made false representations that roofing work was needed when it was not, between 17 February and 12 April last year. All three admitted to the charge in relation to poor roofing work carried out under the guise of a company called Approved Roofs Ltd in the West Midlands. Judge Burbidge said on Tuesday that all three had decided they would dishonestly take money from elderly victims by targeting them for roof repairs. He told the defendants: \"Those you sought out were easy targets because they were vulnerable and trusting individuals, as the elderly often are, and want to see the good in people - unlike you. \"John and Johnny, you worked together using the name of Approved Roofs, but it is not clear what, if any, skills you had for that line of work. The evidence suggests none.\" For conspiracy to commit fraud, the younger McDonald was sentenced to 32 months in prison imprisonment and Delaney to 28 months, with time served reduced from their sentence."
    },
    {
        "title": "Regulator 'concerned' as 23,000 homes still without water after 'major incident' declared",
        "description": "The water watchdog has aired \"concern\" as 23,000 properties remain affected by outages across Kent and Sussex - a day after a major incident was declared in the two counties.",
        "url": "https://news.sky.com/story/regulator-concerned-as-25000-homes-still-without-water-after-major-incident-declared-13493717",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-south-east-water-bottles_7134150.jpg?20260113124143",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-13 12:24:00",
        "Headline": "The latest supply failure is being blamed on Storm Goretti causing power cuts and burst pipes.",
        "Content": "The water watchdog has aired \"concern\" as 23,000 properties remain affected by outages across Kent and Sussex - a day after a major incident was declared in the two counties. Many people entered a fourth day without water, with the latest outages - which were blamed on Storm Goretti causing power cuts and burst pipes - coming overnight between Friday and Saturday last week. South East Water (SEW) has since said water supplies to Loose in Maidstone, Blean near Canterbury, Headcorn, West Kingsdown and parts of Tunbridge Wells had been restored on Tuesday. After issuing another apology, it added that drinking water to 2,000 properties in East Grinstead was restored on Tuesday, with 3,000 more to follow on Wednesday morning and teams working to restore water to the remaining 11,500 properties. Ofwat, the water services regulation authority, said it would \"review all the evidence\" before deciding whether SEW has met its legal obligations to customer care. Meanwhile, SEW bosses have been recalled to appear before MPs over a water outage in December, which left 24,000 properties in Tunbridge Wells, Kent, without any running water for days, and without drinkable water for almost two weeks. Alistair Carmichael, chairman of the Parliamentary Environment, Food and Rural Affairs (Efra) committee, said he and his colleagues remained \"deeply sceptical\" about the water company's version of events on the supply failure. The committee recalled SEW chief executive David Hinton and chair Chris Train, who wrote to the MPs to dispute the Drinking Water Inspectorate's evidence regarding the outage, according to Mr Carmichael. SEW announced a further independent review into the incident, but Mr Carmichael questioned the review's independence and accused the company of \"buying time\". A South East Water spokesperson said: \"We have fully complied with the Environment Food and Rural Affairs Committee's request for information to date and we will continue to provide any further information requested. \"This will include attending any further meetings that are required.\" The areas affected by the latest water supply issues are: Maidstone, Sevenoaks, West Sussex and surrounding areas, Tunbridge Wells, Canterbury, and Whitstable. Linden Kemkaran, leader of Kent County Council (KCC), declared a major incident across the county on Monday morning, saying more households had been impacted in the previous 24 hours. Several schools in Kent and Sussex were forced to close on the first day of the week. Read more from Sky News:'Major incident' declared in Kent as thousands without waterEx-soldier jailed for Livingston Police Station petrol bomb attack SEW apologises to customers SEW said Storm Goretti, which hit the UK last week, affected its ability to \"treat the raw water at the normal rate at our main Sussex water treatment works\". It said this, coupled with the outbreak of burst water mains due to freezing conditions across Sussex, means its drinking water storage levels are running low. SEW incident manager Matthew Dean told Sky News: \"We're very sorry to our customers across Kent and Sussex who are continuing to experience issues with their drinking water supply, including no water, intermittent supply interruptions or low pressure. \"Around 23,000 customers in Kent and Sussex are currently affected by no water or intermittent supplies following the recent cold weather and a subsequent breakout of leaks and bursts across Kent and Sussex, which has resulted in our drinking water storage tanks running very low.\" He added: \"We are using 26 tankers to pump water directly into our network to increase the amount of water available in the affected areas and our leak repair teams are working around the clock to fix the leaks and bursts across Kent and Sussex, with extra resources available to help carry out repairs.\" He said SEW's customer care team was \"delivering bottled water to the customers on our Priority Services Register who are most in need\". \"We are also supporting hospitals with tankers and providing bottled water for care homes, schools, medical care providers and to support livestock,\" Mr Dean added. Bottled water handed out to residents SEW said it has carried out 5,700 deliveries of bottled water over the weekend. Bottled water stations remain in place in Tunbridge Wells, East Grinstead and Maidstone, and location details can be found on SEW's website. An Ofwat spokesperson said on Tuesday: \"We are concerned that residents in Kent and Sussex are without water again, and are working closely with the Drinking Water Inspectorate, which is the lead regulator for this latest supply interruption, to ensure that regulation and enforcement is aligned. \"Ofwat already has an active investigation into South East Water related to its supply resilience, and we have met with the company to discuss these latest incidents as part of that investigation. \"We will review all of the evidence before taking a decision on what further action may be required into whether the company has met its legal obligations set out in its licence relating to customer care, including with further potential enforcement action.\""
    },
    {
        "title": "Cowboy roofer who ran over and killed woman on golf course jailed - as video shows police chase",
        "description": "A rogue roofer who ran over a mother-of-three on a golf course during a police chase has been jailed for 13-and-a-half years for causing her death.",
        "url": "https://news.sky.com/story/cowboy-roofer-who-ran-over-and-killed-woman-on-golf-course-jailed-as-video-shows-police-chase-13493590",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-john-mcdonald-suzanne-cherry_7133727.jpg?20260112204111",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-13 12:34:00",
        "Headline": "John McDonald, 52, admitted to causing the death by dangerous driving after 62-year-old Suzanne Cherry was hit by a van that was being followed by police.",
        "Content": "A rogue roofer who ran over a mother-of-three on a golf course during a police chase has been jailed for 13-and-a-half years for causing her death. John McDonald, 52, admitted to causing the death by dangerous driving after 62-year-old Suzanne Cherry was hit by a van that was being followed by police. Ms Cherry had been playing golf with her husband, Clint Harrison, at Aston Wood Golf Club in Shenstone, Staffordshire, when the incident took place on 11 April last year. Handing sentence, judge James Burbidge said McDonald's actions were \"wicked in the extreme,\" and that \"it is clear that you did attempt to brake, but you had insufficient time to avoid her\". \"Clint Harrison saw you [and co-defendants Johnny McDonald, 23, and Brett Delaney, 35] run away from the vehicle,\" the judge added. \"He says the person who stepped out of the driving seat actually stepped over Sue. \"He says he saw, in a split second, the driver stutter and look back, but you didn't stop, John, you sought to save your own skin. \"Even if you did something to avoid the collision, it was too little, too late.\" \n                  Van driver in police pursuit 'fatally hit mother-of-three who was looking for golf ball'\n                 \n                  Radar 'technical issue' halts flights to Birmingham Airport\n                 \n                  Watchdog to examine West Midlands Police role in Maccabi Tel Aviv fans ban\n                 'Everybody loved her' Speaking after sentence was handed down, Mr Harrison paid tribute to her as an \"inspiration\". He said: \"You really don't want to know what I think about the sentence. I have got no thoughts about them at all. I won't give them any head space.\" He then added: \"Everybody loved her. She was an inspiration. All the young ladies wanted to be like Suzanne Cherry because of what she achieved in her life. \"A company owner, advanced motorcyclist, cyclist, scuba diver, and anything else she could jump off or dive off.\" Mr Harrison previously said, shortly after her death, that Ms Cherry would be \"painfully missed\" by her family and friends. \"While enjoying what should have been the safest of one of Suzanne's many activities, I watched in helpless horror as the life of my beautiful wife and our future together was snatched away in an instant,\" he said. Read more:Ex-soldier jailed for police station petrol bomb attackFamily's shock over teen's death in Iran Co-defendants jailed for conspiracy to commit fraud Brett Delaney, 35, and Johnny McDonald, John McDonald's son, 23, were not held responsible for the collision, but the pair - along with the senior McDonald - admitted to conspiracy to commit fraud on Monday. The court heard that the trio made false representations that roofing work was needed when it was not, between 17 February and 12 April last year. All three admitted to the charge in relation to poor roofing work carried out under the guise of a company called Approved Roofs Ltd in the West Midlands. Judge Burbidge said on Tuesday that all three had decided they would dishonestly take money from elderly victims by targeting them for roof repairs. He told the defendants: \"Those you sought out were easy targets because they were vulnerable and trusting individuals, as the elderly often are, and want to see the good in people - unlike you. \"John and Johnny, you worked together using the name of Approved Roofs, but it is not clear what, if any, skills you had for that line of work. The evidence suggests none.\" For conspiracy to commit fraud, the younger McDonald was sentenced to 32 months in prison imprisonment and Delaney to 28 months, with time served reduced from their sentence."
    },
    {
        "title": "'They stole from Ollie': Sister calls for action on 'illegal' betting sites after gambler took his own life",
        "description": "The sister of a man who died by suicide after black market betting sites \"deliberately lured him in\" has called for the Gambling Commission to review existing laws.",
        "url": "https://news.sky.com/story/they-stole-from-ollie-sister-calls-for-action-on-illegal-betting-sites-after-gambler-took-his-own-life-13493918",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-oliver-long-ollie-long_7134084.jpg?20260113115000",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-13 18:26:00",
        "Headline": "Oliver Long, 36, tried to exclude himself from accessing gambling sites in the UK, but was \"actively targeted\" by illegal overseas providers.",
        "Content": "The sister of a man who died by suicide after black market betting sites \"deliberately lured him in\" has called for the Gambling Commission to review existing laws. Warning: This story contains descriptions some readers may find distressing, including references to self-harm and suicide. Oliver Long, 36, was found dead in East Sussex on 23 February last year after a battle with gambling addiction, an inquest heard on Tuesday. His sister, Chloe, said he had tried \"so desperately to help (himself)\" by self-excluding from online gambling sites, but later started using unlicensed sites from outside the UK. Chloe said her brother had been \"targeted by these illicit, illegal black market sites\", which were ultimately to blame for his death. \"Ollie's experience was horrendous because he was trying his absolute best to try and help himself, he recognised that he was experiencing significant harm from gambling,\" she said after the hearing. \"And he wanted to help himself by self-excluding, and unfortunately he was targeted by these illicit, illegal black market sites. And I'm just so concerned of the risk this poses to other people.\" She said her family was \"disappointed\" the coroner had not included gambling disorder in Mr Long's medical cause of death, but vowed to continue to advocate for change in his memory. Mr Long had been diagnosed with a \"severe gambling addiction\", but senior coroner for East Sussex Laura Bradford recorded a short form conclusion of \"suicide\". Chloe said the Gambling Commission was \"not doing enough\" to prevent problem online gambling, and must review \"outdated\" legislation which predated the smart phone. \"I think its important they acknowledge the scale of the issue and the fact there is so much being done by these illegal operators to actively target the most vulnerable groups, those how have self-excluded and underaged children,\" she said.\"So they need to do significantly more in terms of having a more impactful strategy for enforcement.\" The Gambling Commission said: \"We are deeply saddened by the loss of Oliver Long and our thoughts are with his family and loved ones. \"The targeting of vulnerable people by illegal gambling operators is a criminal act. \"Unlicensed operators deliberately seek to evade protections such as GamStop and can pose serious risks to consumers.\" Chloe said the gambling industry had exploited Mr Long's love of football and \"deliberately lured him in and taught him to hate himself\", leaving him convinced he was \"immoral and a failure\". \"They were highly addictive, predatory systems designed to exploit. And they did. They stole from Ollie - not only his money, but his peace, his future, and ultimately, his life,\" she said. She said her brother's death had left a \"hole\" in her family.\"(He was) such a kind, generous, loving person, and we have a really, really close family,\" Chloe said. \"He adored his nephews, his five young nephews, and he was just great fun to have around. He was always the life and soul of the party ... It's just such a hole in our family not having him anymore.\" Read more from Sky News: Two boys, 16, among three arrested after fatal stabbingRoofer who ran over and killed woman on golf course jailed Mr Long seemed to have opted to exclude himself from UK gambling sites in 2022 before he started to use overseas unlicensed gambling sites in 2023, the court heard. His bank statements showed that his savings depleted by £20,000 in April 2023 alone. At the height of his addiction, Mr Long lost his house, his job and separated from his long-term partner. Mr Long had spent a weekend with his family the week before he died and wrote farewell notes to them in the days before. The court heard he had struggled with depression and anxiety and used cannabis to \"numb\" the pain of his addiction. Tim Miller, the executive director of the Gambling Commission, told the coroner that these sites are \"deliberately seeking to target people who are already experiencing harm\", and marketing themselves to circumvent UK self-exclusion tools like \"GamStop\". He said that some of these sites are run by \"criminal networks\" who are involved with \"terrorists and organised crime\". :: Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Michael Carrick announced as Manchester United's head coach until end of season",
        "description": "Michael Carrick has been announced as Manchester United's head coach until the end of the season.",
        "url": "https://news.sky.com/story/michael-carrick-announced-as-manchester-uniteds-head-coach-13493925",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-michael-carrick-manchester-united_7128458.jpg?20260106213929",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-13 18:58:00",
        "Headline": "The former Man Utd midfielder's first game in charge is the Manchester derby on Saturday at Old Trafford. ",
        "Content": "Michael Carrick has been announced as Manchester United's head coach until the end of the season. Carrick became the main focus of discussions on Monday before the former United captain was pictured arriving at the club's training ground on Tuesday. Negotiations had gone on late into Monday night when all outstanding issues were ironed out. In a statement Carrick said: \"I know what it takes to succeed here [at Old Trafford].\" \"My focus is now on helping the players to reach the standards that we expect at this incredible club, which we know that this group is more than capable of producing. \"I have worked with a number of the players already and have obviously continued to watch the team closely in recent years, I have total belief in their talents, dedication and ability to be successful here. \"There is still a lot to fight for this season, we are ready to pull everyone together and give the fans the performances that their loyal support deserves.\" \n                  How much has sacking managers cost Manchester United?\n                 \n                  Ex-Man United star said heading ball 'hasn't helped' following dementia diagnosis before death\n                 \n                  Amorim sacked: Man Utd's fresh leadership may just have made things more tumultuous\n                 Carrick will bring in former England assistant manager Steve Holland, with Jonathan Woodgate, Jonny Evans and Travis Binnion as backroom staff. Former United midfielder Darren Fletcher, who has taken charge of the past two games, was offered a role in Carrick's set-up, but has chosen to return to his role as Under-18s boss. Official confirmation comes a week after the sacking of Ruben Amorim. The appointment will allow Carrick to take charge of training on Wednesday and begin preparations for the Manchester derby at Old Trafford on Saturday. Read more from Sky News:'Major incident' declared as thousands without waterReform UK insiders express concern over defection Over the past few days, both Carrick and Ole Gunnar Solskjaer, United's head coach from December 2018 to November 2021, have met with Jason Wilcox, the club's director of football, who was leading the process to appoint a new boss. Carrick and Solskjaer were both candidates for the position and both former United players met with the club's bosses and made pitches. Carrick, 44, previously took charge of United in a caretaker role for three games after Solskjaer, 52, was sacked as head coach, having previously worked under both the Norwegian and Jose Mourinho in United's first-team coaching staff. The former England midfielder, who made 464 appearances during a 12-year stint at United, in which he won five Premier League titles and the Champions League, won two and drew one of those matches before Ralf Rangnick took charge for the remainder of the season. He was named Middlesbrough's manager in October 2022 and reached the Sky Bet Championship play-offs in his first season, but was dismissed last summer. United legend Wayne Rooney, a teammate of Carrick's for most of his time at Old Trafford, has backed the appointment. Speaking on BBC Sport's The Wayne Rooney Show, the 40-year-old former England captain said: \"I was with him in Barbados last week! So obviously none of us saw this coming. Michael is a very clever person and he'll command respect from the dressing room.\" Asked if he would join Carrick's staff if asked, Rooney said: \"Of course I would! I think it's a no-brainer if that's the situation.\" United only have the Premier League to focus on now, where they are in seventh position, with Arsenal and Manchester City in first and second place. They have been knocked out of both cup competitions, so the interim head coach will now focus on qualifying for European football next season."
    },
    {
        "title": "Will Starmer go from 'Never Here Keir' to 'Kowtow Keir' if Chinese super embassy goes ahead?",
        "description": "A prime minister who has made U-turn after U-turn is about to make a controversial and unpopular decision on which there will be no going back.",
        "url": "https://news.sky.com/story/will-starmer-go-from-never-here-keir-to-kowtow-keir-if-chinese-super-embassy-goes-ahead-13493911",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer-xi-jinping_7060651.jpg?20251024144452",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2026-01-13 17:57:00",
        "Headline": "The Chinese super embassy plans have caused a backlash from Sir Keir Starmer's own MPs over security concerns.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n A prime minister who has made U-turn after U-turn is about to make a controversial and unpopular decision on which there will be no going back. Despite massive opposition from MPs of all parties and an alarming 11th-hour security risk, Sir Keir Starmer's go-ahead for a Chinese super embassy is imminent. Why now, after months of delays, missed deadlines and bureaucratic dithering? Simple. Because the PM is expected to visit China later this month. Politics latest: Iranian ambassador to UK summoned  Last week, a number of business leaders expressed doubt to Sky News city editor Mark Kleinman that the trip will take place unless the embassy is approved. But those tycoons Downing Street hopes will be on the plane with the PM needn't worry. The date of the visit has yet to be announced, but it's expected after the gathering of the political and business elite at the World Economic Forum in Davos concludes on 23 January. \n                  Politics latest: Starmer U-turns on plans for mandatory digital ID cards\n                 \n                  New Birmingham to Manchester rail line to be built\n                 \n                  Hillsborough Law delayed after backlash\n                 In recent weeks, the prime minister has given some pretty clear signals that the trip is on and, therefore, that approval for the embassy is coming soon. First, in his Guildhall speech last month, Sir Keir said: \"President Trump met President Xi in October… and will visit China in April. \"Since early 2018, President Macron has visited China twice, and he'll be there again later this week. \"German leaders have visited four times, and Chancellor Merz will be there in the New Year. \"Yet, during this same period, no British Prime Minister has visited China. \"And until I met President Xi last November, there had been no leader-level meeting at all for six years.\" The last PM to visit China was Theresa May in February 2018. On that trip, the business delegation signed new deals with the Chinese worth £9bn. Sir Keir will be hoping for more of the same. He did admit at the Guildhall that China \"poses real national security threats to the United Kingdom\", but he said: \"The absence of engagement is just staggering - a dereliction of duty. \"Because it means that, unlike our allies, we have not been standing up for our interests.\" And then he declared: \"Well, no more.\" No more, indeed. Read more:Everything you need to know about China's new super embassy Secondly, in his speech to the Parliamentary Labour Party this week, reacting to \"Never Here Keir\" criticism, the PM spoke of a \"volatile world\" and said: \"You have to be on the pitch. You have to be in the room.\" But the opposition to the embassy, on the former Royal Mail site next to the Tower of London and near the City of London's financial markets, is overwhelming. Hostility has now intensified after a new security row over secret plans for a hidden chamber in the embassy alongside Britain's most sensitive underground cabling. The secret chamber, with rooms MPs have claimed will be spy dungeons, is just metres from fibre optic cables transmitting financial data to the City, and millions of emails and other messages. \"We know now that they plan to demolish the wall between the cables and their embassy,\" shadow security minister Alicia Kearns protested in the Commons. \"Cables on which our economy is dependent. \"Cables carrying millions of British people's emails and financial data, and access that would give the Chinese Communist Party a launch pad for economic warfare against our nation.\" There's alarm from Labour MPs, too. Senior Labour backbenchers have written to Housing Secretary Steve Reed, urging the government to reject the Chinese planning application. Fat chance, though! One of the Labour MPs, Sarah Champion, a member of the national security strategy, said in the Commons: \"Multiple government agencies and government departments have raised concerns about this mega-embassy. \"Our international partners have raised concerns about it. Every security briefing I've had identifies China as a hostile state to the UK.\" Shadow justice secretary Robert Jenrick, as ever, reacted the most pithily to the latest security risk, revealed in leaked unredacted plans, claiming: \"No one committed to our national security could possibly sign this off.\" And then he added: \"But Kowtow Keir will.\" Oh dear! From \"Never Here Keir\" to \"Kowtow Keir\". Which is worse? On China, \"Kowtow-Keir\", almost certainly. And that's because, unlike previous retreats, climbdowns and screeching government about turns, once the embassy is approved, there can be no U-turn. It can't be disapproved. Even though political allies, as well as foes, disapprove of the embassy with near-unanimous hostility. So, as he tucks into a Chinese banquet with Xi in Beijing later this month, Sir Keir will have to be prepared for his embassy decision leaving a thoroughly bad taste back in the UK."
    },
    {
        "title": "New Birmingham to Manchester rail line to be built",
        "description": "A new rail line will be built between Birmingham and Manchester, the government has announced.",
        "url": "https://news.sky.com/story/new-birmingham-to-manchester-rail-line-to-be-built-but-govt-provides-no-timeline-13493926",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-gbr-great-british-railways_7104936.jpg?20251208163656",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-13 18:54:00",
        "Headline": "Sir Keir Starmer said it would not happen until after Northern Powerhouse Rail (NPR), aimed at boosting east-west rail links in northern England, is completed.",
        "Content": "A new rail line will be built between Birmingham and Manchester, the government has announced. However, no timescale for when it would be built was provided - or any other details, such as how it would be funded. The Treasury said it wants a new Birmingham-Manchester rail line, but it would not be \"a reinstatement of HS2\". Rishi Sunak's Conservative government scrapped a planned extension of HS2 between the two cities in 2023 to save money. Land obtained for HS2 between the West Midlands and northern cities will be kept while the project is developed. A new line would ease pressure on the West Coast Main Line, the government said. The Treasury did not provide a date for when it aims to have the new line finished, but said it would not open until after the completion of Northern Powerhouse Rail (NPR), a scheme to boost east-west rail connections across northern England. Sir Keir Starmer said the government was \"rolling up its sleeves\" to deliver NPR. The programme's first phase is set to improve connections on existing lines in the 2030s on these routes: between Sheffield and Leeds; between Leeds and York; and between Leeds and Bradford. They do not require major new land acquisitions. A second phase of NPR is set to involve a new route between Liverpool and Manchester via Manchester airport and Warrington, using a combination of new and existing lines. The third and final phase will involve better connections eastwards from Manchester to Leeds, Bradford, Sheffield and York. There is also money for a new station for Bradford. Regular services would run on to Newcastle via Darlington and Durham, and Chester for North Wales connections. Development work would also be taken forward on reopening the Leamside Line, a 21-mile route between Pelaw, Gateshead, and Tursdale, County Durham, which was closed in 1964. The Treasury said a \"funding cap\" of £45bn would be set for NPR, although this could be topped up by local contributions, such as through increased revenue from business rates. It added that an initial £1.1bn for development and design work would be available to enable the creation of a \"detailed delivery plan which will include timings\". Sir Keir said: \"Over and over again, people in northern communities, from Liverpool and Manchester to York and Newcastle have been let down by broken promises. \"This cycle has to end. No more paying lip service to the potential of the North, but backing it to the hilt. \"That's why this government is rolling up its sleeves to deliver real, lasting change for millions of people through Northern Powerhouse Rail: a major new rail network across the North that will deliver faster, more frequent services.\" However, the Tories accused the government of \"watering down\" NPR and said ministers had \"put back any plans to actually deliver it and rewritten timetables on the fly\". Shadow rail minister Jerome Mayhew said: \"Labour lurch from review to review, deadline to deadline, with no grip on costs, no clarity on scope and no courage to make decisions, exemplified nowhere clearer than the hatchet job of Great British Railways. \"Northern Powerhouse Rail could have been transformational, empowering regional growth and regeneration. Under Labour it risks becoming a permanent mirage that is endlessly redesigned, downgraded and never delivered.\""
    },
    {
        "title": "Two more NHS hospital trusts in Nottinghamshire declare critical incidents",
        "description": "Another two NHS hospital trusts, both in Nottinghamshire, have declared critical incidents due to \"severe and sustained pressure\" on their services.",
        "url": "https://news.sky.com/story/two-more-nhs-hospital-trusts-in-nottinghamshire-declare-critical-incidents-13493225",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-accident-emergency_7134241.jpg?20260113141418",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-13 00:01:00",
        "Headline": "Rising demand, winter infections and staff shortages are among the reasons why hospitals say they have been overwhelmed.",
        "Content": "Another two NHS hospital trusts, both in Nottinghamshire, have declared critical incidents due to \"severe and sustained pressure\" on their services. Nottingham University Hospitals NHS Trust (NUH) said rising demand, winter infections, and staff sickness since Christmas had led to \"significant and unacceptable delays\" in its emergency department and hospital wards. The trust has asked the public to only use its A&E \"in an emergency or serious accident\". Meanwhile, Sherwood Forest Hospitals NHS Foundation Trust said it was struggling with \"sustained pressure\" across its hospitals, combined with \"insufficient discharges to meet the demand of patients waiting to be admitted\". It comes after four hospital trusts in southeast England declared critical incidents on Monday after a \"surge\" in complex A&E admissions. The critical incidents in Surrey affect three trusts - Royal Surrey NHS Foundation Trust, Epsom and St Helier University Hospitals NHS Trust, and Surrey and Sussex Healthcare NHS Trust. East Kent Hospitals University NHS Foundation Trust has also declared a critical incident due to \"sustained pressures\" at the Queen Elizabeth The Queen Mother Hospital in Margate. Other critical incidents have also been declared in recent days in Birmingham, Staffordshire and two areas of Wales. 'Demand exceeds capacity' Andrew Hall, chief operating officer at NUH, said: \"The demand on our hospitals far exceeds our capacity. Declaring a critical incident is not a decision we have taken lightly, but it is necessary to protect patient safety. \"I am deeply sorry for the poor experience this is causing and ask everyone to treat our staff with kindness as they work through this difficult period.\" Treating 43% more patients At the Queen's Medical Centre (QMC), an emergency department in Nottingham designed to treat 350 patients a day, is seeing more than 500 patients daily, representing a rise of 43%. The busiest day so far was on 7 January 2026, when 550 patients were treated, the trust said. Read more from Sky News:Huge cost of delayed NHS dischargesAI used to slash A&E wait times Demand for hospital beds has exceeded all forecasted models, resulting in patients facing lengthy waits in corridors while staff continue to work under extreme pressure, NUH said. Dr Manjeet Shehmar, Medical Director at NUH, said the medical teams will continue to see the sickest patients first, so those patients who are not in an emergency \"will have an extremely long wait and may be redirected to use other services instead\". \"If you have a planned appointment, please continue to attend unless you hear from us,\" Dr Shehmar added. In response to the critical incident, the hospital said it would take several measures to ease pressure, including postponing some elective procedures, opening all available beds, redeploying staff, suspending non-essential activities, and working with NHS and local partners to accelerate discharges. In its statement, Sherwood Forest Hospitals apologised for the impact on patients: \"Despite the best efforts of our colleagues, we realise patient experience is not what we would want it to be. \"We continue to ask everyone to treat our staff with kindness and respect as they continue to work to provide patients with the care they deserve and need.\" NUH operates Nottingham City Hospital and Queen's Medical Centre, both in Nottingham, while Sherwood Forest Hospitals runs King's Mill Hospital in Sutton-In-Ashfield and Newark Hospital in Newark-on-Trent."
    },
    {
        "title": "Scottish Budget 2026: Finance Secretary Shona Robison unveils SNP government's spending and tax plans",
        "description": "The Scottish government has unveiled its draft budget for 2026-27 - with a boost to the Scottish Child Payment and homes worth more than &#163;1m to face higher council tax bills.",
        "url": "https://news.sky.com/story/scottish-budget-2026-finance-secretary-shona-robison-unveils-snp-governments-spending-and-tax-plans-13493670",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-shona-robison-snp-holyrood_7134357.jpg?20260113160039",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2026-01-13 10:32:00",
        "Headline": "The draft proposals come just four months before the Scottish parliament election.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n The Scottish government has unveiled its draft budget for 2026-27 - with a boost to the Scottish Child Payment and homes worth more than £1m to face higher council tax bills. Finance Secretary Shona Robison set out the SNP administration's spending and tax plans for the coming year in a speech at Holyrood on Tuesday. The draft proposals come just four months before the Scottish parliament election, with the SNP aiming to entice voters to keep them in power so that the party can fulfil its plans. It is Ms Robison's final budget before she stands down as an MSP at the May election. Highlights from the draft budget: • There will be an investment of almost £68bn in the budget for the wellbeing of those in Scotland. When combined with the Scottish Spending Review and Infrastructure Investment Pipeline, there will be a total investment of almost £200bn;• The Scottish Child Payment will be increased to £40 per week for families with a child under the age of one. The change will come into force at the beginning of the 2027-28 year. It is currently £27.15 per week;• There will be two new council tax bands by 2028 and will be paid on properties worth more than £1m;• Funding for local government will increase by 2% in real terms. Ms Robison branded the settlement \"fair\" and a \"reasonable deal\" as she urged local authorities to translate the funding into \"reasonable decisions on council tax\";• A tax cut has been provided to low earners. The basic (20%) rate, which currently starts at £15,398, and the intermediate rate (21%), which currently starts at £27,492, will increase by 7.4% to £16,537 and £29,526 respectively;• A total of £22.5bn has been set aside for health and social care, including a record £17.6bn for the NHS's frontline services, £2.4bn to support the vital work of GPs, primary care and community services, and more than £2.3bn to aid social care;• Basic, intermediate and higher property rates will be reduced for businesses as well as transitional relief of £184m over the next three years for those impacted by the recent revaluation. There will be 15% non-domestic rates relief in 2026-27, worth £138m over three years for retail, hospitality and leisure premises, capped at £110,000 annually, while similar firms on Scotland's islands will be given 100% relief;• The Scottish government will establish a tax for private jets at some point after April 2027. Ms Robison said: \"To those who choose to travel by private jet, in Scotland you will pay, and you will pay a fair share for that privilege\";• Colleges will see a 10% increase in funding, delivering an extra £70m this year;• Funding will be provided so that by August 2027 every primary and additional support needs (ASN) school will have a breakfast club;• Communities impacted by the closure of the Fife Ethylene Plant (FEP) at Mossmorran will receive targeted support of £9m over the next three years;• Orkney and Shetland islanders will benefit from plans to scrap peak fares on Northern Isles ferries;• Nearly £200m will be spent on dualling the A9. Ms Robison said the government was \"committed\" to dualling the road by 2035. Ms Robison said: \"This is a budget for a stronger NHS, a budget for a more prosperous Scotland, a budget that, once again, gives the people of Scotland the best cost of living deal anywhere in the UK. \n                  Scotland's Justice Secretary Angela Constance 'unintentionally' breached ministerial code, investigation finds\n                 \n                  Scotland's first minister John Swinney announces bank holiday to celebrate World Cup\n                 \n                  SNP leader John Swinney condemns alleged office bugging of female MSP\n                 \"It is a budget that offers new ways to access a GP with walk-in GP clinics, new help for hard-pressed families with more wraparound care, new hope for young Scots looking for their first home, more operations, more appointments in our NHS, more people paying less income tax because they live here in Scotland. \"New help and more help - it's a budget for families, a budget for Scotland and a budget well worth voting for.\" 'Super-rich no longer get free pass to pollute Scottish skies' Jamie Livingstone, head of Oxfam Scotland, welcomed the private jet tax and said it sends a clear message that \"the super-rich will no longer get a free pass to pollute Scottish skies\". Claire Telfer, head of Scotland at Save the Children, said the charity was delighted by the boost to the Scottish Child Payment. She said: \"Investing in the tiniest members of our society - alongside the other commitments made to tackle child poverty - is how we sow the seeds of a brighter tomorrow.\" The Joseph Rowntree Foundation also praised the child payment increase but warned \"a lot of work\" still needs to be done. Chris Birt, associate director for Scotland, said: \"This should go some way to addressing the shocking fact that over a third of babies in Scotland currently live in a household in poverty. \"However, given the extent of the struggles that families are facing right now, the rest of the poverty-related funding announced in the budget doesn't meet the scale of action required, with a disappointing lack of detail on how it will be spent and how that will impact on people's lives. \"This budget marks another missed opportunity to take the bold and radical action needed.\" Think tank IPPR Scotland branded the budget \"tepid\" as it called for a long-term tax strategy that will be able to meet the needs of the nation's people \"while addressing the looming fiscal gap\". The Scottish Conservatives described it as \"cynical and predictable\". MSP Craig Hoy, the party's shadow finance secretary, added: \"Shona Robison's tinkering with the lower rate tax bands produces paltry and insulting savings for some, while middle-earners will be clobbered harder than ever before. \"Hard-working Scots are paying the price for the SNP's skewed priorities - with the out-of-control benefits bill continuing to grow and a huge rise in overseas development spending.\" Holyrood ministers must balance the books The Scottish budget is largely funded through the block grant alongside taxes raised north of the border. It sets the annual funding for Scotland's health, education, justice, transport and welfare systems, as well as any tax changes. Holyrood ministers are legally obliged to balance the books and have limited borrowing powers with which to raise additional funds. Scotland's auditor general previously warned the country faces a near £5bn funding shortfall by the end of the decade. The draft budget will be scrutinised in the Scottish parliament over the coming weeks before a final vote, where the SNP will need to garner support from outside its minority administration for it to pass into law. It has been speculated that Scottish Labour could abstain after party leader Anas Sarwar said his MSPs would not stand in the way of the budget, effectively allowing it to pass. Mr Sarwar is instead focused on the Holyrood election, with expectations he will announce an emergency budget if his party gets into power. Recent polling puts the SNP in first place, although not enough for a majority, with Reform UK and Scottish Labour in second and third place respectively."
    },
    {
        "title": "Two boys, 16, among three arrested as murder investigation launched after fatal stabbing in London",
        "description": "Three teenagers, including two 16-year-old boys, have been arrested in connection with a murder investigation after a man was fatally stabbed in west London.",
        "url": "https://news.sky.com/story/two-boys-16-among-three-arrested-as-murder-investigation-launched-after-fatal-stabbing-in-london-13493886",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-police-met-police_7081191.jpg?20251113152135",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-13 18:00:00",
        "Headline": "Police have detained two boys on suspicion of murder and possession of an offensive weapon after an incident on Monday in Feltham. A 19-year-old man has also been detained in connection with an alleged serious assault.",
        "Content": "Three teenagers, including two 16-year-old boys, have been arrested in connection with a murder investigation after a man was fatally stabbed in west London. Officers were called to reports of a stabbing on Victoria Road in Feltham at around 5pm on Monday. A 18-year-old man was treated for stab wounds and was taken to hospital where he was pronounced dead, the Metropolitan Police said in a statement. The man's family have been informed. Both London's ambulance service and air ambulance service attended the scene, near Feltham High Street. Police said they had arrested two 16-year-old boys on suspicion of murder and possession of an offensive weapon. One was detained on Monday, and the second on Tuesday. They both remain in police custody. The Met added they had also arrested a 19-year-old man on Tuesday on suspicion of grievous bodily harm and possession of an offensive weapon. Officers said the arrest relates to an allegation of assault involving one of the boys who has been detained. Read more from Sky News:NHS trust declares critical incidentOutages concerning water regulatorFears students using AI to cheat The statement added that the boy had been treated for minor injuries before being arrested. Detective Chief Inspector Allam Bhangoo, who is leading the investigation, offered his \"deepest condolences\" to the victim's friends and family. He said: \"We understand that this incident has been distressing for the local community. I want to reassure the public that this investigation is a priority for us and I hope it offers some reassurance to know we have made three arrests. \"Residents may see an increased police presence in the area as we undertake further enquires, however at this time we are confident there is no risk to the local community.\""
    },
    {
        "title": "Regulator 'concerned' as 23,000 homes still without water after 'major incident' declared",
        "description": "The water watchdog has aired \"concern\" as 23,000 properties remain affected by outages across Kent and Sussex - a day after a major incident was declared in the two counties.",
        "url": "https://news.sky.com/story/regulator-concerned-as-25000-homes-still-without-water-after-major-incident-declared-13493717",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-south-east-water-bottles_7134150.jpg?20260113124143",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-13 12:24:00",
        "Headline": "The latest supply failure is being blamed on Storm Goretti causing power cuts and burst pipes.",
        "Content": "The water watchdog has aired \"concern\" as 23,000 properties remain affected by outages across Kent and Sussex - a day after a major incident was declared in the two counties. Many people entered a fourth day without water, with the latest outages - which were blamed on Storm Goretti causing power cuts and burst pipes - coming overnight between Friday and Saturday last week. South East Water (SEW) has since said water supplies to Loose in Maidstone, Blean near Canterbury, Headcorn, West Kingsdown and parts of Tunbridge Wells had been restored on Tuesday. After issuing another apology, it added that drinking water to 2,000 properties in East Grinstead was restored on Tuesday, with 3,000 more to follow on Wednesday morning and teams working to restore water to the remaining 11,500 properties. Ofwat, the water services regulation authority, said it would \"review all the evidence\" before deciding whether SEW has met its legal obligations to customer care. Meanwhile, SEW bosses have been recalled to appear before MPs over a water outage in December, which left 24,000 properties in Tunbridge Wells, Kent, without any running water for days, and without drinkable water for almost two weeks. Alistair Carmichael, chairman of the Parliamentary Environment, Food and Rural Affairs (Efra) committee, said he and his colleagues remained \"deeply sceptical\" about the water company's version of events on the supply failure. The committee recalled SEW chief executive David Hinton and chair Chris Train, who wrote to the MPs to dispute the Drinking Water Inspectorate's evidence regarding the outage, according to Mr Carmichael. SEW announced a further independent review into the incident, but Mr Carmichael questioned the review's independence and accused the company of \"buying time\". A South East Water spokesperson said: \"We have fully complied with the Environment Food and Rural Affairs Committee's request for information to date and we will continue to provide any further information requested. \"This will include attending any further meetings that are required.\" The areas affected by the latest water supply issues are: Maidstone, Sevenoaks, West Sussex and surrounding areas, Tunbridge Wells, Canterbury, and Whitstable. Linden Kemkaran, leader of Kent County Council (KCC), declared a major incident across the county on Monday morning, saying more households had been impacted in the previous 24 hours. Several schools in Kent and Sussex were forced to close on the first day of the week. Read more from Sky News:'Major incident' declared in Kent as thousands without waterEx-soldier jailed for Livingston Police Station petrol bomb attack SEW apologises to customers SEW said Storm Goretti, which hit the UK last week, affected its ability to \"treat the raw water at the normal rate at our main Sussex water treatment works\". It said this, coupled with the outbreak of burst water mains due to freezing conditions across Sussex, means its drinking water storage levels are running low. SEW incident manager Matthew Dean told Sky News: \"We're very sorry to our customers across Kent and Sussex who are continuing to experience issues with their drinking water supply, including no water, intermittent supply interruptions or low pressure. \"Around 23,000 customers in Kent and Sussex are currently affected by no water or intermittent supplies following the recent cold weather and a subsequent breakout of leaks and bursts across Kent and Sussex, which has resulted in our drinking water storage tanks running very low.\" He added: \"We are using 26 tankers to pump water directly into our network to increase the amount of water available in the affected areas and our leak repair teams are working around the clock to fix the leaks and bursts across Kent and Sussex, with extra resources available to help carry out repairs.\" He said SEW's customer care team was \"delivering bottled water to the customers on our Priority Services Register who are most in need\". \"We are also supporting hospitals with tankers and providing bottled water for care homes, schools, medical care providers and to support livestock,\" Mr Dean added. Bottled water handed out to residents SEW said it has carried out 5,700 deliveries of bottled water over the weekend. Bottled water stations remain in place in Tunbridge Wells, East Grinstead and Maidstone, and location details can be found on SEW's website. An Ofwat spokesperson said on Tuesday: \"We are concerned that residents in Kent and Sussex are without water again, and are working closely with the Drinking Water Inspectorate, which is the lead regulator for this latest supply interruption, to ensure that regulation and enforcement is aligned. \"Ofwat already has an active investigation into South East Water related to its supply resilience, and we have met with the company to discuss these latest incidents as part of that investigation. \"We will review all of the evidence before taking a decision on what further action may be required into whether the company has met its legal obligations set out in its licence relating to customer care, including with further potential enforcement action.\""
    },
    {
        "title": "The government invited us on an immigration raid. There were two arrests, they both walked free",
        "description": "Three vans roll out of a car park in Croydon. Inside, South London&#8217;s immigration enforcement team have a list of targets. Their role is to arrest illegal workers. &#160;",
        "url": "https://news.sky.com/story/theres-still-a-long-way-to-go-inside-the-home-offices-crackdown-on-illegal-migration-13493970",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-immigration-raid_7134676.png?20260113221300",
        "type": "UK",
        "Author": "Jason Farrell",
        "Date Published": "2026-01-13 21:20:00",
        "Headline": "The Home Office has ramped up its enforcement operations to combat illegal migration and wanted to show its work off to us. But in one morning, with a large team, there were only two arrests, and they were both released.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n Three vans roll out of a car park in Croydon. Inside, South London’s immigration enforcement team have a list of targets. Their role is to arrest illegal workers.   We've been invited because the Home Office is keen to promote an increase in arrests in the 18 months since the Labour government came to power - up 83%. But will this have an impact on the government's aim to crack down on illegal migration? The first stop is a car wash in Lewisham. A business that has previously employed illegal workers. The team has intelligence they are doing so again. On arrival it's raining, there is no car washing and just two employees sit in the dry. Both are Romanian and their employment status is legitimate. The boss, Amir Neziraj, says they've learned their lesson after being fined £30,000 a few years ago. He explains that, at that time, the rogue employees used fake passports. He added: \"Obviously now you've got all the online stuff. You can check people's status. I don't want to be racking up fines. We are fully legit.\" He tells the immigration officers: \"You can always come and have a look guys.\" 'Both the workers are illegal' We move on to the next target, a nail bar in Catford. The team make visits based on intelligence, which could come from the Home Office, trading standards, police officers or members of the public. It is suspected that the beauty salon is employing illegal Chinese workers. The shop is on a pedestrianised high street and on our arrival two Chinese women are conducting treatments on clients. That soon comes to a stop as the officers interview them through interpreters on the other end of a phone. After checking Home Office records, the team establishes both workers are illegal. Operation Lead Sarah Allen tells me: \"Ultimately, what we're seeking to do is remove people from the UK, those not entitled to be here and not entitled to work in the UK. \"Sometimes we're able to do that very quickly. Other times we need to make sure that we put people on bail, keep them in contact with us so that we can help them and support them through any application process to remove them.\" Often these workers are being exploited, trafficked or sold an image of the UK that doesn't reflect the reality. Many are just trying to get back while being stuck in a backlogged system. Immigration officers will only detain people if they can determine the individual can be removed from the country relatively quickly. Often there are barriers. The two Chinese illegal workers are arrested but allowed to walk free on what is called immigration bail. 'We've got to keep going at this' Home Office Minister Mike Tapp, who joined the raid, says even if they can't be deported, the arrests are still worthwhile. He told me: \"They will have to report in - so we've got that closer control of these people. There's also the process that they've got to go through. \"When we came in, that whole processing in the system had ground to a halt, that backlog is down. We've reduced those cases by 39%. \"So, we've got to keep going at this. There's still a long way to go. But today is an important demonstration of how seriously we're taking this.\" Read more from Sky News:All the ex-Conservative MPs who defected to ReformGuantanamo Bay detainee to get 'substantial' sum from UK There have been 12,300 arrests for illegal working since this government came to power. So far 15% of those have been removed from the UK. Those on immigration bail could face fines for working illegally but the big financial penalties are often for the employers - which can now amount to £60,000 per illegal worker. Ultimately the aim is to send a message that there is no black market economy available to illegal migrants and thus reduce the pull-factor for those considering the journey. The Home Office has released videos of arrests made across the country, but from our experience in South London, intelligence isn't always accurate; one premises we attempted to raid was closed for the day. Ultimately in one morning, with a large team, there were only two arrests, and they were released."
    },
    {
        "title": "Trump makes Iran pledge as more than 2,000 protesters reported killed",
        "description": "A 26-year-old Iranian protester is set to be executed today for participating in anti-regime protests that have swept the country in recent weeks, as the world awaits possible intervention by the US.",
        "url": "https://news.sky.com/story/iranian-protester-faces-imminent-execution-claims-human-rights-group-13493858",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-trump-iran_7134732.jpg?20260114004330",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-13 23:10:00",
        "Headline": "Donald Trump has said he'll take \"very strong action\" if Iran's regime hangs protesters, and the US has urged its own citizens in the country to leave immediately as speculation ramps up about American military action.",
        "Content": "A 26-year-old Iranian protester is set to be executed today for participating in anti-regime protests that have swept the country in recent weeks, as the world awaits possible intervention by the US. Donald Trump has called on demonstrators to \"keep protesting\" and pledged \"help is on its way\", without offering any detail about what that could entail. In a post on his Truth Social platform, the president warned the \"killers and abusers\" will \"pay a big price\". Latest updates on Iran protests US-based Human Rights Activists News Agency (HRANA), which has been accurate in multiple rounds of unrest in Iran in recent years, reports at least 2,571 people have been killed as of early Wednesday. According to Norway-based rights group Hengaw, Erfan Soltani, from the city of Fardis to the west of Tehran, will be executed later today - adding to the death toll. Hengaw said Mr Soltani had been arrested in connection with protests in the city of Karaj. The Kurdish group, which documents human rights abuse in Iran, said his family had been informed about the death sentence, although they had been \"deliberately kept uninformed\" about the judicial process. \"The rushed and non-transparent handling of this case has heightened concerns over the use of the death penalty as a tool to suppress public protests,\" a statement added. In an interview with CBS News, Mr Trump has said he'll take \"very strong action\" if Iran's regime hangs protesters. The US has urged its citizens to \"leave Iran now\", ideally by land through Turkey or Armenia, and JD Vance hosted a National Security Council meeting about the situation on Tuesday night. It comes after Mr Trump's Middle East negotiator Steve Witkoff reportedly held a secret meeting with exiled Iranian former crown prince Reza Pahlavi over the weekend. The son of Iran's last shah has sought to position himself as an opposition figure since the protests began. How did we get here? Demonstrations began in Tehran, the capital, on 28 December, when shopkeepers went on strike over the collapse of the Iranian currency to an all-time low. Authorities blocked internet and telephone connections on 9 January as the protests intensified. According to HRANA, 2,403 of those killed so far were protesters and 147 were government-affiliated. Twelve children have also been killed, it said. More than 18,100 people have been detained, the group added. Phone connection was briefly restored on Tuesday, allowing witnesses to the protests to share reports with news outlets of a heavy security presence in central Tehran, burned-out government buildings and smashed ATMs. Anti-riot police officers, wearing helmets and body armour, carried batons, shields, shotguns and tear-gas launchers, witnesses reported. Iran's ambassador to the UK was summoned to the Foreign Office in London on Tuesday afternoon amid concerns about the Iranian government's crackdown on protesters. Several European countries held similar meetings, including Finland's foreign minister, who warned Tehran had shut the internet off \"to kill and oppress in silence\". Read more:Iran protest deaths: A sculptor, a footballer and a hairdresserVerifying protests and deaths in IranFamily's shock over teen's death in Iran The demonstrations pose potentially the largest threat to Iran's regime since the 1979 Islamic Revolution - when former supreme leader Ayatollah Ruhollah Khomeini installed a Shia theocracy. Iran's Supreme Leader Ayatollah Ali Khamenei criticised the US and praised the Iranians who took part in pro-government demonstrations on state TV on Monday. \"This was a warning to American politicians to stop their deceit and not rely on traitorous mercenaries,\" he said. Iran's economy has struggled in recent years due to rising inflation and pressure from US sanctions imposed under the first Trump administration in 2018. The UN reimposed sanctions in September. Mr Trump announced on Monday that any countries doing business with Iran will face 25% tariffs from the US. The country suffered further blows during the 12-day war, which saw America and Israel strike the country's nuclear facilities in June."
    },
    {
        "title": "How Russia is using 'disposable agents' to sabotage Europe",
        "description": "Russian spies are increasingly recruiting Ukrainians to carry out acts of sabotage in Europe to undermine NATO and attempt to turn public opinion against Ukraine, according to new research.",
        "url": "https://news.sky.com/story/how-russia-is-using-disposable-agents-to-sabotage-europe-13494007",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-putin-russia_7134733.jpg?20260114005531",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2026-01-13 22:43:00",
        "Headline": "A report from the Royal United Services Institute (RUSI) thinktank reveals how intelligence officers linked to the Kremlin are wooing unwitting individuals - including Ukrainians - online to destabilise Western powers.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n Russian spies are increasingly recruiting Ukrainians to carry out acts of sabotage in Europe to undermine NATO and attempt to turn public opinion against Ukraine, according to new research. Kremlin-linked intelligence officers are accused of seeking to woo potentially unwitting individuals via messaging apps such as Telegram or gaming sites to become \"disposable agents\", tasked with conducting arson, vandalism and other hostilities. Other nationalities are also recruited. The research report, published by the Royal United Services Institute (RUSI) thinktank, said money is a key motivator, with teenagers, migrants and older people with experience of serving in the Soviet military seen as ripe for recruitment. 'Gig-economy of sabotage' Payment - ranging from hundreds to thousands of euros - is often promised in cryptocurrency, making the source of funding hard for investigators to trace. \"The methods used to recruit and task saboteurs have shifted from Cold War-era reliance on trained intelligence operatives to a model characterised by remote, freelance and highly deniable assignments: the 'gig-economy era' of Russian sabotage,\" the report - entitled \"Responding to Russian Sabotage Financing\" - said. \"Hostile actors now outsource low-cost tasks to disposable individuals (or 'agents for a day') recruited online.\" The Kremlin has previously denied Western allegations of a growing campaign of sabotage and other hybrid hostilities. But the number of acts of Russia-linked arson and serious sabotage across Europe is reported to have risen to 34 in 2024, up from 12 the previous year and just two in 2022. The authors of the RUSI report said this tactic of deliberately deniable activity carried out under the threshold of conventional war has \"evolved into a systematic and geographically targeted threat\". They urged NATO and the EU urgently to improve their response to deter future acts of sabotage. This includes agreeing a definition of what constitutes sabotage and drawing on counterterrorism powers to track illicit funding channels. Putting NATO 'red lines' to the test The report also said governments must view individual incidents - regardless of how minor - as being part of a much graver pattern of activity against Western allies. \"While individual incidents may appear low-level or opportunistic, collectively they suggest the emergence of a broader campaign designed to raise the cost of supporting Ukraine, test the red lines of NATO states and erode public trust in Western national security systems,\" it said. Suspected Russian sabotage covers a range of actions from major operations such as damaging undersea cables to much more simple attacks against military and civilian targets, including starting fires and vandalism but also reconnaissance activities. 'Disposable agents' This low-level activity is the focus of the report, which drew on the insight of individuals from law enforcement, academia, and journalism as well as policy experts. With many Russian intelligence officers expelled from Europe in the wake of Russia's full-scale invasion of Ukraine, the RUSI report found that Russian spies \"increasingly rely on intermediaries and 'disposable agents', many from Ukraine, to execute sabotage tasks.\" \"If such incidents are treated purely as the actions of individual Ukrainians, this could fuel anti-Ukrainian sentiment and erode public support for Kyiv - a strategic aim of sabotage operations,\" it said. The report said recruited Ukrainians include those who were \"unaware of the true nature of their tasks\". Read more from Sky News:Chinese hackers blamed for sabotageWhy UK's undersea cables are vulnerableBritish men recruited by Russia and China It cited the experience of Poland - a frequent target of suspected Russia-linked hybrid attacks. \"Many of those detained on sabotage-related charges from 2023 to 2025 were Ukrainian nationals - a development interpreted not as evidence of Ukrainian coordination but as part of a deliberate Russian strategy to exploit the presence of Ukrainian migrants, with the aim of provoking public distrust and political tension,\" it said. One of the most recent examples of hostile action that the Polish authorities have attributed to Russian intelligence is an explosion in November 2025 on a railway line that provides a key route to transport aid to Ukraine. Officials reported that two Ukrainian nationals suspected of involvement fled to Belarus, while several others were detained. The Polish prime minister described the incident as an \"unprecedented act of sabotage\"."
    },
    {
        "title": "Iranian ambassador summoned over country's response to protests",
        "description": "Yvette Cooper has confirmed the government has summoned the Iranian ambassador in a statement to the Commons.",
        "url": "https://news.sky.com/story/iranian-ambassador-summoned-over-countrys-response-to-protests-13493754",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iran-protests_7133560.jpg?20260112162720",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-13 15:05:00",
        "Headline": "The Reuters news agency says Iran acknowledged around 2,000 deaths during two weeks of protests sparked by a widening economic crisis. ",
        "Content": "Yvette Cooper has confirmed the government has summoned the Iranian ambassador in a statement to the Commons. The foreign secretary has said her colleague, the Middle East minister, Hamish Falconer, summoned the Iranian representative in the UK \"to underline the gravity of this moment and to call Iran to answer for the horrific reports that we are hearing\". The Reuters news agency says around 2,000 people have been killed during widespread protests, according to an Iranian official. Politics live - follow latest Protests sparked by a widening economic crisis have spread across the country since December. The Human Rights Activists News Agency says over 10,000 people have been arrested. Ms Cooper told MPs that \"horrific reports suggest that potentially thousands of people have been killed\" while \"protesting for change\", and that due to a \"total internet shutdown\" in Iran on 8 January, \"the full facts are not yet clear\". \n                  Trump makes Iran pledge as more than 2,000 protesters reported killed\n                 \n                  A sculptor, a teenage footballer and a hairdresser: Here are the stories of some of those killed in Iran protests\n                 \n                  Verifying protests and deaths in Iran - amid brutal crackdown and internet shutdown\n                 But she added: \"I am fearful that the reports we have seen may underestimate the full horror as further evidence and testimony reaches the outside world.\" 'UK condemns brutal killings in the strongest terms' In a strongly worded warning, Ms Cooper said: \"The United Kingdom condemns in the strongest terms the horrendous and brutal killing of Iranian protesters, and we demand that the Iranian authorities respect the fundamental rights and freedoms of their citizens.\" The cabinet minister told the Commons she spoke to her Iranian counterpart, Abbas Araghchi, on Monday to warn him to stop. But she also recognised that recent events in Iran are \"no outlier\" from the regime's past behaviour, which she said included \"backing... terrorist and extremist proxies\" such as Hamas, Hezbollah and the Houthis. The foreign secretary also accused Iran of carrying out activities that pose \"danger to dissidents, journalists and the Jewish community here in the UK\", and said Britain's security services had discovered more than 20 \"potentially lethal Iran-backed plots over the last year alone\". Case of Britons jailed in Iran raised 'just yesterday' The minister added that the UK \"will not tolerate any Iran-backed threats on UK soil\", and pointed to the country being placed on the enhanced tier of the Foreign Influence Registration Scheme. She also highlighted a review she commissioned into what more needs to be done to apply counterterrorism-style powers to state threats, and confirmed the government will take forward its recommendations. Iran latest - follow live Ms Cooper also said the government would \"ensure the safety and security of our citizens in Iran\", and added she had raised the case of imprisoned Britons Craig and Lindsay Foreman \"just yesterday\". She said the government would continue to put \"coordinated economic and diplomatic pressure on this regime\". Ms Cooper announced plans for \"full and further sanctions\" against Iran that target finance, energy, transport, software and other significant industries. Tories question why government response has taken so long Responding to the minister's statement, Dame Priti Patel asked why the government had not summoned the Iranian ambassador sooner. The shadow foreign secretary also asked where \"the government's resolve to stand up to Iran and back those protesting?\" She warned that the UK \"cannot let their dreams be buried as we mourn the victims of Tehran's atrocities\" and that \"if change comes [in Iran], we should be ready to support this change\". Dame Priti also asked if the government has spoken to and is \"aligned\" with the US administration, and questioned whether ministers have considered using UK or US military bases \"to stop the brutality of the Iranian regime\"."
    },
    {
        "title": "Verifying protests and deaths in Iran - amid brutal crackdown and internet shutdown",
        "description": "Footage posted today on social media shows protesters gathered on the streets of the city of Marvdasht in the southern Iranian Fars province, as a fire burns in the background.",
        "url": "https://news.sky.com/story/number-of-iranian-dead-passes-2000-as-protests-continue-13493859",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-protests-iran-deaths_7134387.png?20260113164016",
        "type": "World",
        "Author": "Alicja Hagopian and Joely Santa Cruz, data journalists",
        "Date Published": "2026-01-13 16:19:00",
        "Headline": "Sky News' Data and Forensics team has been working to verify protest footage emerging from Iranian defiance of the nationwide internet shutdown. Here's what we have established about the protests and deaths so far.",
        "Content": "By Alicja Hagopian and Joely Santa Cruz, data journalists  Footage posted today on social media shows protesters gathered on the streets of the city of Marvdasht in the southern Iranian Fars province, as a fire burns in the background. Sky News' Data and Forensics team has verified the video, which is among the latest to emerge from widespread protests in Iran which began in Tehran on 28 December. The Iranian Human Rights Activists News Agency (HRANA) reports eight arrests in Marvdasht on 12 January. We have identified nearly 900 protest events in total, through a combination of Sky News Data and Forensics research and monitoring by Institute for the Study of War (ISW). Observed protest activity peaked at 179 on 8 January, when the internet was shut down. Since then, significantly less activity has been observed, though this is likely at least partially due to restricted internet access. In total, 881 protest events have been verified, across all 31 Iranian provinces. In the latest 48 hours, half of the 12 protests we verified were in Tehran, with others observed in the cities of Marvdasht in the south and Urmia to the north. Security forces have fired tear gas and stun grenades at protesters in at least three different cities since 11 January. Researchers at ISW note that the higher volume of videos emerging from cities may be related to better access to Starlink internet, and while it is likely that there are more protests than we know of, it is possible that the rate of protests has decreased overall in response to the regime's brutal crackdown. What we know about the number of dead At least 2,003 people have died so far during the ongoing protests in Iran, according to deaths verified by HRANA, an Iranian human rights organisation and news agency. These numbers were echoed by an Iranian official via Reuters. Sky News has collected the names of approximately 100 people reported dead, with thousands more unidentified, and has been able to independently confirm further details for at least 75 people. Among the confirmed victims is at least one 15-year-old. Some 1,850 of these verified deaths are protestors, while 135 were identified as security personnel. HRANA is investigating a further 779 deaths, which could bring the total to over 2,700. HRANA verifies deaths using an aggregation of visual documentation and evidence around morgue facilities. A further 16,784 people are believed to have been arrested in little over two weeks, according to HRANA. Over 8,000 of these arrests were recorded on 11 January. Footage showing body bags inside a forensics institute in Kahrizak, South of Tehran has circulated online, with analysis suggesting that there are 250 bodies in one morgue alone. The People's Mojahedin Organisation of Iran (PMOI), a left-wing dissident organisation which is in opposition to the government, has said that the death toll has reached over 3,000 since the protests began. The figure of 3,000 deaths spans across 195 cities and PMOI says it has been collated from hospitals, local sources, forensic medicine centres, and families of the deceased. Sky News has not independently verified this figure. With an internet blackout since 8 January and ongoing protests, information is scarce. Higher figures on deaths and arrests are likely to follow when communication is restored. The Data x Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Four people killed in Gaza after walls collapse on tents during strong winds, hospital authorities say",
        "description": "Four people have been killed in Gaza after walls collapsed on to tents during strong winds and rainfall, hospital authorities have said.&#160;",
        "url": "https://news.sky.com/story/four-people-killed-in-gaza-after-walls-collapse-on-tents-during-strong-winds-hospital-authorities-say-13493740",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-gaza-weather-wind-dead_7134283.jpg?20260113143833",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-13 13:25:00",
        "Headline": "Aid groups say that most Gazans lack the shelter necessary to withstand frequent winter storms. ",
        "Content": "Four people have been killed in Gaza after walls collapsed on to tents during strong winds and rainfall, hospital authorities have said.  A teenage girl, two women and a man died overnight on Monday, according to the al Shifa hospital, Gaza City's largest hospital. The hospital, which received the casualties, said one of the two women was killed when a wall collapsed on her tent in the western part of the city. The other woman, man and 15-year-old girl, it said, were from the same family and died after a wall collapsed on to their tent in a coastal area along the Mediterranean shore of Gaza City, injuring at least five others. It is the third winter since the war between Israel and Hamas began on 7 October 2023, when Palestinian militants killed some 1,200 people across southern Israel and abducted 251 to Gaza. Israel's retaliation reduced much of Gaza to ruins, killing more than 71,000 people, according to Hamas-run Gaza health authorities, which don't discriminate between fighters and civilians. Aid groups say that Gazans, most of whom are living in makeshift tents, lack the shelter necessary to withstand frequent winter storms and say not enough shelter materials are entering the region during the ceasefire, which has been in effect since October last year. \n                  Palestinian embassy in London opens in 'historic moment' \n                 \n                  The Voice Of Hind Rajab: Brad Pitt-backed film about death of child in Gaza set for UK release\n                 \n                  Israel suspends 37 aid organisations from operating in Gaza\n                 Yasmin Shalha, a mother-of-five displaced from the northern town of Beit Lahiya whose tent fell on her as she slept, told The Associated Press: \"The winds were very, very strong. The tent collapsed over us. \"Our situation is dire.\" Mohamed al Sawalha, a 72-year-old man from the northern refugee camp of Jabaliya, also criticised the conditions most Gazans are experiencing. \"It [the tent] doesn't work neither in summer nor in winter,\" he said. \"We left behind houses and buildings [with] doors that could be opened and closed. \"Now we live in a tent. Even sheep don't live like we do.\" As of Monday, the Gaza health ministry said at least six children as young as seven days old had died of hypothermia since the start of winter. Three killed in Israeli drone strike, hospital officials say Hospital officials also said an Israeli drone strike had killed three Palestinians who crossed the ceasefire line near central Gaza's Morag Corridor on Monday. Israel's military said the three people approached troops and posed an immediate threat and said they later found weapons and intelligence-gathering equipment on them. An anti-Hamas armed group in southern Gaza yesterday claimed responsibility for the killing of senior Hamas police officer Lieutenant Colonel Mahmoud al Astal, who was gunned down in Khan Younis, the Hamas-run interior ministry said. More than 440 people have been killed since Israel and Hamas agreed to suspend their two-year war, according to the Gaza health ministry. Each side has accused the other of violating the ceasefire, which remains in its initial stage as efforts continue to recover the remains of the final Israeli hostage in Gaza. Read more:Israel suspends 37 aid organisations from operating in GazaPalestinian embassy in London opens in 'historic moment' The latest strike comes as Gaza awaits an expected announcement this week of a so-called Board of Peace to help oversee its governance. Officials say that US President Donald Trump will announce his appointments to the board in the coming days. Under Mr Trump's plan, the board would supervise the new Palestinian government, the disarmament of Hamas, the deployment of an international security force, additional pullbacks of Israeli troops and reconstruction. Hamas has said it will dissolve its existing government once the Palestinian technocratic committee has been formed, as mandated under the US-brokered peace plan. Hazem Kassem, a Hamas spokesperson, called for the speeding up of the establishment of the new committee in a Telegram post on Sunday. Hamas and the rival Palestinian Authority have not yet announced who will sit on the committee and it remains unclear if they will be cleared by Israel and the US. Israel's military currently controls a buffer zone covering more than half of Gaza, while the Hamas-run government retains authority over the rest."
    },
    {
        "title": "Australian author Craig Silvey charged with possessing and distributing child exploitation material",
        "description": "Australian author Craig Silvey has been charged with possessing and distributing child exploitation material.",
        "url": "https://news.sky.com/story/australian-author-craig-silvey-charged-with-possessing-and-distributing-child-exploitation-material-13493704",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-runt-craig-silvey_7134044.jpg?20260113170103",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-13 11:56:00",
        "Headline": "Detectives say they found the man actively engaging with other child exploitation offenders online when they arrived at his Fremantle home on Monday.",
        "Content": "Australian author Craig Silvey has been charged with possessing and distributing child exploitation material. Western Australia Police Force said detectives executed a search warrant at a property on Monday. It is alleged officers found a 43-year-old man actively engaging with other child exploitation offenders online when they arrived. He was arrested, the force said, and his electronic devices were seized. The man was charged with possessing and distributing child exploitation material. The force added in a statement that the man would appear at Fremantle Magistrates Court on Tuesday. Australia's Channel 9 reported that Silvey faced a Perth court on Tuesday afternoon in relation to the charges. He didn't enter a plea and was granted bail, due to be back in court next month. Silvey is best known for his book Jasper Jones, which sold more than half a million copies, is often assigned for reading in schools, and was made into a film starring Toni Collette in 2017. It also won the Australian Book Industry Awards Book of the Year and was also shortlisted for the International Dublin Literary Awards and the Miles Franklin Literary Award. A 2025 book by Silvey, called Runt And The Diabolical Dognapping, was Australia's number one \"best-selling children's book\" according to its publisher Allen & Unwin. That book was a sequel to his 2022 novel Runt, which was also adapted into a film starring Celeste Barber. In a statement, Allen & Unwin told Sky News: \"Allen & Unwin is aware of serious charges brought against author Craig Silvey in Fremantle this week. \"The nature of the allegations is deeply distressing. Our thoughts and sympathies are with all survivors of child exploitation and their families. \"We acknowledge this is an active police matter, and that Mr Silvey is entitled to procedural fairness and a presumption of innocence until the matter is dealt with by a court. \"Given the gravity of the charges, Allen & Unwin will pause promotional activity of Mr Silvey's work while the legal process takes its course. \"We are unable to provide further comment while this matter is before the courts.\""
    },
    {
        "title": "Trump to lead largest ever US delegation to Davos",
        "description": "President Donald Trump will attend the World Economic Forum in Davos next week as head of the largest ever US delegation to attend the annual meeting, including five cabinet members, and a host of congressional representatives and state governors.",
        "url": "https://news.sky.com/story/trump-to-lead-largest-ever-us-delegation-to-davos-13493791",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-world-economic-forum_6422882.jpg?20240115214330",
        "type": "World",
        "Author": "Paul Kelso",
        "Date Published": "2026-01-13 14:22:00",
        "Headline": "European and Chinese leaders will also be in attendance, with reports that a reconstruction deal for Ukraine may be agreed with the US during the week.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n President Donald Trump will attend the World Economic Forum in Davos next week as head of the largest ever US delegation to attend the annual meeting, including five cabinet members, and a host of congressional representatives and state governors. The US leader will be one of at least 64 heads of state travelling to the Swiss mountain resort, including six out of seven G7 leaders and Ukrainian President Volodymyr Zelensky, but is likely to monopolise attention and the agenda. Downing Street has not confirmed if Sir Keir Starmer will be attending. Money blog: Royal Mail launching 24-hour parcel service US Secretary of State Mark Rubio and Treasury Secretary Scott Bessent will accompany President Trump, along with his key international negotiators Steve Witkoff and son-in-law Jared Kushner. Some 20 members of Trump's administration are expected to attend. President Zelensky will join European Union President Ursula von der Leyen in Davos, with reports that a reconstruction deal for Ukraine may be agreed with the US during the week. A large Chinese delegation will be led by vice-premier He Lifeng, who leads the country's economic policy and heads the Central Financial Commission. \n                  Davos delegates leave World Economic Forum under no illusion of Trump disruption ahead\n                 \n                  Trump has everyone at the World Economic Forum in Davos guessing\n                 \n                  David Beckham warns girls are being 'held back' as he attends Davos summit 'to be the voice of children'\n                 Chancellor Rachel Reeves will attend and is scheduled to hold a roundtable with business leaders hosted by JP Morgan boss Jamie Dimon, and speak on a public panel. The Treasury has characterised the trip as part of a renewed push to promote Britain as an investment destination around the world. President Trump has not attended the WEF meeting in person for six years, but gave a virtual address last year on the day following his inauguration, in which he set out the 'America First' approach that has upended global trade and foreign relations in the 12 months since. The American intervention in Venezuela earlier this month, with its unapologetic focus on controlling the country's oil, has heightened economic and political uncertainty, making Davos a potential forum for negotiation and a guaranteed platform for Trump to underline his dominance of the international agenda. Several Latin American leaders will be present, along with a strong presence from India, and the Middle East, including the transitional President of Syria, Ahmed Al-Sharaa, the Prime Minister of Lebanon, and delegations from Saudi Arabia, Qatar and the UAE. In his speech last year, President Trump put European leaders and manufacturing businesses on notice that they would face trade barriers if they chose not to shift construction to the US, a promise he honoured with the announcement of swingeing \"Liberation Day\" tariffs last April. Many of those tariffs have been rolled back following bilateral negotiations, including by the UK, which secured lower barriers for the car industry than the EU."
    },
    {
        "title": "Russian ship captain accused in court of 'grossly negligent' behaviour leading to 'entirely avoidable' death of crew member",
        "description": "A Russian ship captain has been accused in court of \"grossly negligent conduct\" after a fatal collision with an oil tanker near the Humber Estuary last year.",
        "url": "https://news.sky.com/story/russian-ship-captain-accused-in-court-of-grossly-negligent-behaviour-leading-to-entirely-avoidable-death-of-crew-member-13493804",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-vladimir-motin-cps_7134299.jpg?20260113145140",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-13 14:54:00",
        "Headline": "Captain Vladimir Motin, 59, has been charged with manslaughter over the death of a crew member onboard his vessel, which collided with a US oil tanker last March. He denies the charge.",
        "Content": "A Russian ship captain has been accused in court of \"grossly negligent conduct\" after a fatal collision with an oil tanker near the Humber Estuary last year. Captain Vladimir Motin, 59, was on sole watch duty when his vessel, the container ship Solong, collided into the anchored US oil tanker, the Stena Immaculate, last March. The collision caused the death of Mark Angelo Pernia, 38, a crew member working at the front of the Portuguese-flagged Solong. His body has never been found. Opening the trial at the Old Bailey on Tuesday, prosecutor Tom Little KC said Mr Pernia's death was \"entirely avoidable,\" and that \"ultimately he would still be alive if it was not for the grossly negligent conduct of the man in the dock\". He added: \"The captain owed him a duty of care to keep him safe and the defendant, we say, manifestly breached that duty of care and caused his death. \"The risk of death was serious and obvious and negligence was so bad that it was gross.\" \n                  Russian captain of ship in North Sea crash pleads not guilty to manslaughter of crew member\n                 \n                  Ship owner files legal claim after North Sea crash\n                 \n                  New photos show moment of North Sea crash - as report says neither ship had 'dedicated lookout'\n                 The court heard that the Solong - 130 metres long and 7,852 gross tonnes - had departed Grangemouth in Scotland at 9.05pm on 9 March last year. The two vessels then crashed just over 12 hours after the Solong set off for the port of Rotterdam in Holland. Following the collision, both vessels caught fire and were subsequently abandoned. Mr Little noted that the engine of the Solong, with a 14-strong crew, was shut down on the same evening it departed. Restarting it would have taken about 30 to 45 minutes, and about 35 minutes to manoeuvre away from any ship. The prosecutor then told the court that the location of the anchored Stena Immaculate would have been visible on the Solong's radar display about 36 minutes before the vessels collided. Read more from Sky News:Cowboy roofer who killed woman on golf course jailedAustralian author charged over child exploitation material \"Despite an obvious collision course, the defendant did not deviate his vessel from its path and the impending catastrophe that lay ahead,\" Mr Little added. \"The defendant was responsible for navigating the ship, not only because he was the captain but because he was on sole watch duty at the time and ultimately, he did nothing, absolutely nothing, to avoid the collision.\" The court also heard that the Solong was carrying mainly alcoholic spirits and some hazardous substances, including empty but unclean sodium cyanide containers. Meanwhile, the Stena Immaculate had been carrying 220,000 barrels of jet fuel in 16 segregated tanks at the time. The maritime company Crowley, which operates the tanker, said at the time that only one was damaged thanks to the actions of the crew. Mr Motin, from Primorsky, St Petersburg, denies manslaughter. The trial continues."
    },
    {
        "title": "A sculptor, a teenage footballer and a hairdresser: Here are the stories of some of those killed in Iran protests",
        "description": "A sculptor, a promising teenage footballer and a hairdresser with tens of thousands of followers on Instagram are among at least 2,000 people killed in two weeks of protests in Iran.",
        "url": "https://news.sky.com/story/a-sculptor-a-teenage-footballer-and-a-hairdresser-here-are-the-stories-of-some-of-those-killed-in-iran-protests-13493798",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iran-protests_7134395.png?20260113165240",
        "type": "World",
        "Author": "the Sky News Data &amp; Forensics team and Samuel Osborne, news reporter",
        "Date Published": "2026-01-13 18:48:00",
        "Headline": "Sky News has collected the names of almost 100 people killed in the riots and has been able to verify the identities of at least 75 of those, using a mix of local media reports, social media and open-source information. Here's what we know so far.",
        "Content": "By the Sky News Data & Forensics team and Samuel Osborne, news reporter  A sculptor, a promising teenage footballer and a hairdresser with tens of thousands of followers on Instagram are among at least 2,000 people killed in two weeks of protests in Iran. The US-based Human Rights Activists News Agency (HRANA), which relies on supporters in Iran to cross-check information and has been accurate in previous bouts of unrest, said 1,847 of the dead over the last two weeks were protesters, while 135 were affiliated with the government. An Iranian official gave similar figures to the Reuters news agency. Read more: What we know about the number of dead The demonstrations started as an expression of grievance over the Islamic Republic's weakened economy and have evolved into a legitimate threat to the country's theocracy, reaching levels of violence not seen in Iran for decades. Authorities severed internet communications amid an intense crackdown on unrest, making it harder for information on the number of people who have been killed to trickle out. Iran latest: Follow live updates However, the Sky News Data & Forensics team has collected the names of almost 100 people killed in the riots and has been able to verify the identities of at least 75 of those, using a mix of local media reports, social media and open-source information. You can tap through the full list of those 75 people here, and read on for the stories of some of those killed in the protests. The first woman reported killed Akram Pirgazi, a 40-year-old mother of two, was the first woman reported to have been killed in the protests. She was hit by gunfire in Neyshabur in the country's northeast and taken to hospital on 7 January, but died later that day. The sculptor and father of two In the city of Mashhad, in the same province, 50-year-old sculptor Mehdi Salahshour was shot by government forces on 8 January, according to the Norway-based human rights organisation Hengaw. The father of two was active in Iran's arts and culture scene and served as an honorary member of the Visual Arts Development Institute. He had taken part in nearly 20 exhibitions showcasing his work and had held workshops at the University of Tehran, according to his social media profiles. The director and filmmaker A day later, Javad Ganji, a 39-year-old director and filmmaker, was shot dead during protests in Tehran, Hengaw reported. He had worked as an assistant director and production planner on several projects in cinema and TV for several years. The hairdresser with a large social media following Shayan Asadollahi, a 28-year-old hairdresser, was reportedly killed by government forces in the city of Azna in Lorestan province on 1 January. He had shared hairstyling videos with more than 50,000 followers on Instagram. Read more:Extent of crackdown on Iranian protesters beginning to emergeWho is Iran's exiled crown prince encouraging anti-government protests? The trainee lawyer On the same day, Ahmadreza Amani, a 28-year-old trainee lawyer, was reportedly rushed to hospital after being shot in the chest during street protests in Azna, but died shortly after arrival, according to the London-based Iran International news outlet. It said the head of the Yazd Bar Association, for which Mr Amani had been an intern, said he had written to the head of the judiciary calling for a thorough investigation into his death. The avid footballer Young people have made up a large proportion of the protesters, with the average age of those killed that we have verified being around 27. Rebin Moradi, a 17-year-old Kurdish student, was reportedly killed in Tehran on 8 January. He was a promising young footballer who was a member of the Tehran Youth Premier Football League and played with the Saipa Club. His social media features pictures and videos from several years ago, illustrating his passion for the sport. He was also a swimmer and a wrestler, according to the Hengaw human rights organisation. After his death, a post on his Instagram asked: \"Who had the heart to kill you?\" In addition to those killed, more than 10,700 people have been detained during the two weeks of protests, according to HRANA. As protests continue across Iran, the number of people killed is expected to rise. Sky News' Data & Forensics team will continue to verify details of those killed while risking their lives protesting against the Iranian regime. The Data x Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Airports close and flights disrupted as freezing rain and snow hits Europe",
        "description": "Airports were forced to close and flights were disrupted in parts of Europe due to icy weather.",
        "url": "https://news.sky.com/story/airports-close-and-flights-disrupted-across-europe-due-to-icy-weather-13493226",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-austria-snowplows-vienna_7134021.jpg?20260113103728",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-13 10:01:00",
        "Headline": "Icy conditions forced temporary closures and disrupted flights at airports in Budapest, Bratislava, Vienna and Prague, with delays expected while runways are being cleared.",
        "Content": "Airports were forced to close and flights were disrupted in parts of Europe due to icy weather. Airports in Budapest in Hungary, Bratislava in Slovakia and Vienna in Austria all had to temporarily shut on Tuesday morning because of the conditions but operations have now resumed. A thick layer of ice had formed on runways in Vienna and, despite efforts to clear it, continued to refreeze, a spokesperson for the airport said. Flights were diverted to other airports. Freezing rain had left Prague Airport in the Czech Republic operating in a \"very limited mode\", according to a message ‌on its X ⁠account.The airport said operations are currently running without restrictions but some delays are expected to continue throughout the day. Read more from Sky News:Mandelson apologises for Epstein friendshipStarmer threatens to 'control' Grok Icy conditions also forced Bratislava Airport to close temporarily but flights there have now resumed. Budapest Airport also temporarily halted flights due to weather-related safety concerns but has since reopened. The airport said that during the course of the morning, the nose gear of an Ethiopian Airlines cargo plane \"slipped off the paved surface of a taxiway onto the grass while taxiing, causing the aircraft to become stuck\". \"The investigation into the circumstances of the incident is currently ongoing, and the airport operator, in cooperation with the competent authorities, is doing everything possible to free the aircraft,\" it added. Widespread icy conditions A weather system spreading across central and eastern Europe has brought snow and freezing rain, leading to widespread icy conditions and disruption. \"Tuesday sees the wintry mix of weather affecting parts of Poland, Slovakia, Hungary and Romania, with icy conditions likely to bring further travel disruption to roads and airports,\" the Sky News weather team said. The Czech Republic and Austria should see some improvement, with drier conditions and temperatures climbing a little above freezing by day for Prague and Vienna, they said. \"That said, there'll be icy conditions again overnight.\" Further north, there will be some heavy snow for the south of Norway and Sweden on Tuesday, which may also lead to some disruption, the Sky weather team said. Meanwhile, to the southeast, parts of Turkey will see significant snow, which will extend into Armenia, Azerbaijan, Iran and Iraq. \"The milder air will try and take over more of Europe over the next few days, but eastern parts are likely to hold on to the freezing conditions, with further wintry hazards on Wednesday, especially across an area from Sweden and eastern Poland down to Romania.\" Thursday and Friday look mainly dry for eastern Europe, they added. In the UK, the Met Office has issued a yellow warning for ice covering much of western and northern Scotland from 8pm on Tuesday to 10am on Wednesday. Elsewhere in the UK, a number of flood alerts and flood warnings are in place in the aftermath of Storm Goretti. A yellow weather warning for rain has been issued for southwest England on Thursday, raising the risk of further flooding in the region. The Met Office said the risk of freezing rain - which can create severe ice hazards - is expected to decrease as the day progresses, with snowfall becoming more likely instead. Freezing rain is a rare form of liquid precipitation that freezes almost instantly on contact with cold surfaces, leading to dangerous icy conditions."
    },
    {
        "title": "Trump makes Iran pledge as more than 2,000 protesters reported killed",
        "description": "A 26-year-old Iranian protester is set to be executed today for participating in anti-regime protests that have swept the country in recent weeks, as the world awaits possible intervention by the US.",
        "url": "https://news.sky.com/story/iranian-protester-faces-imminent-execution-claims-human-rights-group-13493858",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-trump-iran_7134732.jpg?20260114004330",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-13 23:10:00",
        "Headline": "Donald Trump has said he'll take \"very strong action\" if Iran's regime hangs protesters, and the US has urged its own citizens in the country to leave immediately as speculation ramps up about American military action.",
        "Content": "A 26-year-old Iranian protester is set to be executed today for participating in anti-regime protests that have swept the country in recent weeks, as the world awaits possible intervention by the US. Donald Trump has called on demonstrators to \"keep protesting\" and pledged \"help is on its way\", without offering any detail about what that could entail. In a post on his Truth Social platform, the president warned the \"killers and abusers\" will \"pay a big price\". Latest updates on Iran protests US-based Human Rights Activists News Agency (HRANA), which has been accurate in multiple rounds of unrest in Iran in recent years, reports at least 2,571 people have been killed as of early Wednesday. According to Norway-based rights group Hengaw, Erfan Soltani, from the city of Fardis to the west of Tehran, will be executed later today - adding to the death toll. Hengaw said Mr Soltani had been arrested in connection with protests in the city of Karaj. The Kurdish group, which documents human rights abuse in Iran, said his family had been informed about the death sentence, although they had been \"deliberately kept uninformed\" about the judicial process. \"The rushed and non-transparent handling of this case has heightened concerns over the use of the death penalty as a tool to suppress public protests,\" a statement added. In an interview with CBS News, Mr Trump has said he'll take \"very strong action\" if Iran's regime hangs protesters. The US has urged its citizens to \"leave Iran now\", ideally by land through Turkey or Armenia, and JD Vance hosted a National Security Council meeting about the situation on Tuesday night. It comes after Mr Trump's Middle East negotiator Steve Witkoff reportedly held a secret meeting with exiled Iranian former crown prince Reza Pahlavi over the weekend. The son of Iran's last shah has sought to position himself as an opposition figure since the protests began. How did we get here? Demonstrations began in Tehran, the capital, on 28 December, when shopkeepers went on strike over the collapse of the Iranian currency to an all-time low. Authorities blocked internet and telephone connections on 9 January as the protests intensified. According to HRANA, 2,403 of those killed so far were protesters and 147 were government-affiliated. Twelve children have also been killed, it said. More than 18,100 people have been detained, the group added. Phone connection was briefly restored on Tuesday, allowing witnesses to the protests to share reports with news outlets of a heavy security presence in central Tehran, burned-out government buildings and smashed ATMs. Anti-riot police officers, wearing helmets and body armour, carried batons, shields, shotguns and tear-gas launchers, witnesses reported. Iran's ambassador to the UK was summoned to the Foreign Office in London on Tuesday afternoon amid concerns about the Iranian government's crackdown on protesters. Several European countries held similar meetings, including Finland's foreign minister, who warned Tehran had shut the internet off \"to kill and oppress in silence\". Read more:Iran protest deaths: A sculptor, a footballer and a hairdresserVerifying protests and deaths in IranFamily's shock over teen's death in Iran The demonstrations pose potentially the largest threat to Iran's regime since the 1979 Islamic Revolution - when former supreme leader Ayatollah Ruhollah Khomeini installed a Shia theocracy. Iran's Supreme Leader Ayatollah Ali Khamenei criticised the US and praised the Iranians who took part in pro-government demonstrations on state TV on Monday. \"This was a warning to American politicians to stop their deceit and not rely on traitorous mercenaries,\" he said. Iran's economy has struggled in recent years due to rising inflation and pressure from US sanctions imposed under the first Trump administration in 2018. The UN reimposed sanctions in September. Mr Trump announced on Monday that any countries doing business with Iran will face 25% tariffs from the US. The country suffered further blows during the 12-day war, which saw America and Israel strike the country's nuclear facilities in June."
    },
    {
        "title": "Clintons refuse to testify in Republican-led Epstein investigation, risking contempt proceedings",
        "description": "Bill and Hillary Clinton have said they will refuse to testify in a Republican-led investigation into convicted sex offender Jeffrey Epstein.",
        "url": "https://news.sky.com/story/clintons-refuse-to-testify-in-republican-led-epstein-investigation-risking-contempt-proceedings-13493888",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-bill-clinton-hillary-clinton_7134500.jpg?20260113183836",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-13 16:56:00",
        "Headline": "Republican representative James Comer said the committee leading the probe will meet next week to hold former US president Bill Clinton in contempt.",
        "Content": "Bill and Hillary Clinton have said they will refuse to testify in a Republican-led investigation into convicted sex offender Jeffrey Epstein. \"Every person has to decide when they have seen or had enough and are ready to fight for this country, its principles and its people, no matter the consequences,\" the Clintons wrote in a letter published on social media. \"For us, now is that time.\" The letter was addressed to Republican representative James Comer. He chairs the House of Representatives Oversight Committee, whose Epstein probe was slammed as \"legally invalid\" by the Clintons. He said the committee will meet next week to hold former US president Bill Clinton in contempt, which could potentially lead to criminal charges. The Clintons said this was \"literally designed to result in our imprisonment\". Former secretary of state Hillary Clinton, who ran against Donald Trump in the 2016 presidential election, is due to appear before the panel on Wednesday, with a committee spokesperson saying contempt proceedings would also be initiated against her if she fails to testify. The Clintons said in their letter that they had provided the \"little information\" they had to aid the investigation. They also accused Mr Comer of selectively enforcing subpoenas against them, as they said other former officials were allowed to provide written statements about Epstein to the committee. \"There is no plausible explanation for what you are doing other than partisan politics,\" they wrote. Read more:Trump defends Clinton over images in Epstein filesImages of Trump among reposted Epstein documents Mr Comer said after Bill Clinton did not show up to testify on Tuesday: \"No one's accusing the Clintons of any wrongdoing. We just have questions.\" \"Anyone would admit they spent a lot of time together,\" Mr Comer told reporters, adding that \"most Americans\" wanted Mr Clinton to answer questions about his ties to Epstein, who died in prison while awaiting trial for sex-trafficking charges in 2019. Mr Comer claims Epstein visited the White House 17 times during Mr Clinton's presidency, and that Mr Clinton was on board Epstein's private plane more than 20 times. Mr Clinton's friendship with the financier is well-documented throughout the 1990s and early 2000s, but Mr Clinton has never been accused of wrongdoing in connection with Epstein. The Trump administration, due to pressure from its Republican base, has ordered the US Justice Department to release files related to the criminal investigations into Epstein to comply with a transparency law passed by Congress. Mr Trump also used to be friends with Epstein, but he said he cut off that relationship before the financier was accused of sexual abuse. Mr Comer indicated that the committee would not try to get testimony from Mr Trump about Epstein, as he said it could not force a sitting president to testify."
    },
    {
        "title": "Trump risks end of China trade war truce through Iran tariffs",
        "description": "On the face of it, an announcement of 25% tariffs against any nation trading with Iran amounts to a major escalation of Donald Trump's global trade war.",
        "url": "https://news.sky.com/story/trump-risks-end-of-china-trade-war-truce-through-iran-tariffs-13493636",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-jinping-china_7066751.jpg?20251030101940",
        "type": "US",
        "Author": "Helen-Ann Smith",
        "Date Published": "2026-01-13 08:58:00",
        "Headline": "Sky's Asia correspondent says there are good reasons to expect retaliation from China, Iran's biggest trading partner, if Donald Trump targets that relationship.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n On the face of it, an announcement of 25% tariffs against any nation trading with Iran amounts to a major escalation of Donald Trump's global trade war. But China, Iran's biggest trading partner, has kept its reaction pretty brief and pretty bland. \"There is no winner in a tariff war,\" Foreign Ministry spokeswoman Mao Ning said, \"China will firmly safeguard its legitimate and lawful rights and interests.\" Money latest: 'My teenager's bank account was shut down for suspicious activity - but they won't tell me what it was' It is exactly the sort of thing China tends to say when it's still rushing to figure out the details. Indeed, it feels fair to assume that China is holding fire because, like the rest of the world, it is probably unsure how this new announcement will apply and to whom. Trump offered no explanation, for instance, on what \"doing business\" with Iran actually amounts to and, crucially, whether China's tariff truce with the US would leave it exempt. \n                  Frightening ordeal as Sky News team forced into cars and camera seized - with dissent in China rising dramatically\n                 \n                  Bosses courted to join PM's China trip as embassy verdict looms\n                 \n                  What the capture of Maduro means for China\n                 In theory, China should be first in line for this extra tax. While it is Iran's biggest trading partner, it is also one of a relatively limited list of countries still willing to circumvent US sanctions to buy from it, despite the international backlash over the regime's treatment of protesters seeking an end to clerical rule in the country. Analysts have estimated that China buys at least 80% of Iran's shipped oil, possibly as much as 90%. Exact figures are not published. In addition, China has significant investments in Iran, with Chinese companies financing construction and infrastructure projects. But the context of the US-China relationship is everything here. Months of damaging tit-for-tat trade warring was eventually paused in November, when a truce was agreed by presidents Xi Jinping and Trump. The bargain was hard won and negotiated over months, bringing China's average tariff rate down from 145% at the height of the standoff to around 47%. In exchange for this reduction, Trump achieved certain things that were important to him, such as an agreement to up the purchases of US soybeans, the de-blacklisting of certain US firms, and a loosening of access to crucial rare earth minerals. An increase of China's tariff rate now would almost certainly provoke it into retaliation, all these hard-won gains could, in an instant, be lost. Add to the mix the fact that Trump says he plans to visit Beijing in April and his intimation that stability in the relationship is desirable, and him carving out some sort of exemption for China feels increasingly likely. There is also precedent for this. Read more:How Iran enforced internet blackoutMore than 500 killed in Iran, rights group says In the summer, India was hit with an additional 25% tariff in retaliation for the country's purchase of oil from Russia. Despite the fact China buys more than India, it was not subject to the same treatment, almost certainly because a broader deal was in the process of being struck. An additional 25% tariff for China would be punishing right now, at a time when its economy is still struggling with slowed growth and high unemployment. It would bring the average rate to over 70% - an amount that makes almost all trade with the US inviable. But China has learnt over the past year that being strong and unrelenting with Trump has worked. It knows it has the power and leverage to push for an exemption, and be in no doubt, that is exactly what it will be doing behind the scenes. If it doesn't get it, expect a retaliation, and expect it to be severe."
    },
    {
        "title": "The man Donald Trump keeps trying (and failing) to fire",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈&#160;</a>",
        "url": "https://news.sky.com/story/the-man-donald-trump-keeps-trying-and-failing-to-fire-13493570",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-trump-trump100_7133849.jpg?20260113071244",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-13 02:51:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈  Knives are out for the chair of the central banking system in the United States. The Trump administration wants Jerome Powell out, and they want him indicted, but he's not going anywhere. Who will blink first? Plus, as anti-government protests accelerate in Iran, Donald Trump warns he's considering military intervention. Could the US and Iran be about to lock horns once again? And in Minneapolis, tensions are still high after the death of Renee Nicole Good. As more law enforcement agents flood the city, we have new footage of the moment the 37-year-old died. You can watch all episodes on our YouTube channel. Email us on trump100@sky.uk with your comments and questions."
    },
    {
        "title": "Bank of England governor joins protest over US central bank row",
        "description": "The governor of the Bank of England has joined a chorus of opposition to the treatment of his US counterpart following revelations he is facing a criminal inquiry.",
        "url": "https://news.sky.com/story/bank-of-england-governor-joins-protest-over-us-central-bank-row-13493674",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-jerome-powel-andrew-bailey_7134023.jpg?20260113104109",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2026-01-13 10:42:00",
        "Headline": "Andrew Bailey is among a group of international central bank governors who say they \"stand in full solidarity\" with Jerome Powell and the independence of the Federal Reserve.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The governor of the Bank of England has joined a chorus of opposition to the treatment of his US counterpart following revelations he is facing a criminal inquiry. Andrew Bailey is among a group of global central bank bosses to sign a statement backing Federal Reserve chair Jerome Powell. He revealed on Sunday that he and the Fed were being threatened with possible Department of Justice (DoJ) charges as part of initial inquiries into spiralling renovation costs. Money latest: The exact amount pensions and benefits will go up per week from April Mr Powell, who had remained largely tight-lipped over a long-running battle with the Trump administration for control of central bank voting until then, claimed the action was a \"pretext\" to gain more influence over US monetary policy. There has been cross-party condemnation of his treatment. He is due to step down in May after serving two terms but there is now doubt over whether Congress will approve any successor nominated by the White House given the latest legal row. Mr Powell attracted further support on Tuesday from a coalition of central bankers through a joint statement. \n                  Royal Mail launching 24-hour parcel service; exact amount pensions and benefits are going up per week | Money blog\n                 \n                  Trump announces new tariff on countries trading with Iran as number killed in protests rises\n                 \n                  Trump risks end of China trade war truce through Iran tariffs\n                 The bankers, who also include European Central Bank president Christine Lagarde, said they \"stand in full solidarity\" with the Federal Reserve and its chair. \"The independence of central banks is a cornerstone of price, financial and economic stability in the interest of the citizens that we serve,\" the statement read. \"It is therefore critical to preserve that independence, with full respect for the rule of law and democratic accountability. \"Chair Powell has served with integrity, focused on his mandate and an unwavering commitment to the public interest. \"To us, he is a respected colleague who is held in the highest regard by all who have worked with him.\" Mr Bailey has spoken out in defence of US central bank independence before following several financial market wobbles linked to efforts by the White House to force a greater speed of interest rate cuts on the US economy. A Supreme Court hearing is due by the end of the month amid the administration's bid to fire a member of its rate-setting committee, Lisa Cook, who was appointed during the Biden presidency. Mr Trump, who has previously called for Mr Powell's head before tempering his criticism of the central bank chief, has distanced himself from any role in the US Attorney for Washington's requests for information from Mr Powell. The subpoenas relate to building costs at the Fed buildings, which have exceeded original estimates by hundreds of millions of dollars."
    },
    {
        "title": "BBC to file motion to dismiss Trump defamation lawsuit over Panorama edit, court documents show",
        "description": "The BBC will take steps to have Donald Trump's lawsuit over a January 6 Panorama edit thrown out, court documents show.",
        "url": "https://news.sky.com/story/bbc-to-file-motion-to-dismiss-trump-defamation-lawsuit-over-panorama-edit-court-documents-show-13493569",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-republicans_7128190.jpg?20260106152713",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-13 03:30:00",
        "Headline": "The broadcaster has asked the court to effectively halt parties from most evidence-gathering, pending the decision on the motion.",
        "Content": "The BBC will take steps to have Donald Trump's lawsuit over a January 6 Panorama edit thrown out, court documents show. The US president filed a defamation lawsuit over the broadcaster's editing of a speech he made in 2021, on the day his supporters stormed the Capitol building. Clips were spliced together from sections of the US president's speech to show him saying: \"We're going to walk down to the Capitol... and I'll be there with you. And we fight. We fight like hell.\" It aired in the near-hour-long documentary Trump: A Second Chance?, which was broadcast by the BBC the week before the US election. The US president is seeking damages of $5bn (£3.7bn) under a defamation lawsuit. He has also sued for $5bn for alleged violation of a trade practices law. Both lawsuits were filed in Florida. A BBC spokesperson said in a statement: \"As we have made clear previously, we will be defending this case. We are not going to make further comment on ongoing legal proceedings.\" Court documents show the broadcaster will file a motion to dismiss the lawsuits, claiming the Florida court lacks \"personal jurisdiction\" over the organisation, that the court venue is \"improper\", and that Mr Trump has \"failed to state a claim\". Read more:Trump v the BBC: Everything you need to know Arts and entertainment correspondent The BBC is fighting back. If you read the legal filings and the grounds for which the corporation seeks to dismiss the case, they are convincing. At the heart of their argument is the location at which this case has been filed: Florida. For a lawsuit against a British broadcaster, this has never made much sense. They state that Trump's own legal team has provided a link to the Panorama episode that simply couldn't be watched by viewers in the US, unless they used a VPN. Will it be enough for it to be thrown out? This was always a curious case but don't forget for Trump whether he succeeds or fails doesn't really matter - this is designed to exert pressure, a high-profile warning shot to those who are critical about him personally and his administration. Even if Trump doesn't get his billions, the litigation is a form of leverage. But for a public service broadcaster, ultimately answerable to taxpayers, this is all the more embarrassing and painful to be caught up in.\n \n Given the prolonged uncertainty and significant legal costs, the BBC really needs to shut this down. The corporation will argue that it did not create, produce or broadcast the documentary in Florida and that Mr Trump's claim the documentary was available in the US on streaming service BritBox is not true. It will also claim the president has failed to \"plausibly allege\" the broadcaster published the documentary with \"actual malice\". The BBC has asked the court to effectively halt parties from most evidence-gathering, pending the decision on the motion. The broadcaster apologised to the US president in November for an \"error of judgement\", but said it disagreed there was \"a basis for a defamation claim\". The fallout from the saga led to the resignation of both the BBC director-general Tim Davie and the head of news Deborah Turness. If the case should continue, a 2027 trial date has been proposed."
    },
    {
        "title": "Man on trial in Virginia accused of plotting double murder with Brazilian au pair",
        "description": "A man from Virginia, who was having an affair with his family's Brazilian au pair, has gone on trial accused of the elaborate murder of his wife and an unsuspecting stranger.",
        "url": "https://news.sky.com/story/man-on-trial-in-virginia-accused-of-plotting-double-murder-with-brazilian-au-pair-13493962",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-brendan-banfield-peres-magalhaes_7134669.png?20260113220834",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-13 22:45:00",
        "Headline": "The prosecution alleges that Brendan Banfield lured a stranger to the family home to kill his wife as part of a murder plot, which he denies. The family's au pair, Juliana Peres Magalhaes, has agreed to testify against Banfield as part of a plea deal.",
        "Content": "A man from Virginia, who was having an affair with his family's Brazilian au pair, has gone on trial accused of the elaborate murder of his wife and an unsuspecting stranger. Brendan Banfield, 40, denies killing Christine Banfield as well as Joseph Ryan, whom he allegedly planned to frame for the murder of his wife, at the family home in February 2023. In opening statements, lead prosecutor Jenna Sands said that Banfield and Juliana Peres Magalhaes, the family's au pair, were in love. But Banfield did not want a divorce because he did not want to lose custody of his daughter or even to share custody with his wife. Ms Sands told the court in Fairfax County that \"Brendan revealed his desire to get rid of Christine\" and the pair impersonated her on a social media site for sexual fetishes. She added that Banfield arranged an elaborate scenario with Mr Ryan in which he would act out an arranged rape fantasy and that Mr Ryan was instructed not to stop \"even if she was calling for help\". Magalhaes, 25, has pleaded guilty to a lesser charge of manslaughter for her role in the double murder plot and agreed to testify against Banfield. The prosecution continued with alleged details about the murder: \"Brendan enters the bedroom, first shooting Joe in the head, picks up the knife that Joe had brought and stabs Christine repeatedly in the neck. \"He directs Juliana to shoot Joe a second time with her gun, this time the bullet enters Joe's chest with Christine dead or dying.\" Banfield's defence lawyer, John Carroll, disputes the prosecution's case, telling the court that digital forensics would show Christine Banfield directly engaged with Mr Ryan on the site. \"You're going to see a presentation of a horrible, tragic, awful event,\" he added. He said there is no dispute that Banfield and Magalhaes were having an affair, but \"there's an awful lot more to look for\". Read more from Sky News:Guantanamo detainee gets UK payoutTrump risks ending China trade war truceClintons won't testify over Epstein The defence said Magalhaes had maintained her innocence for a year but eventually changed her story in exchange for a prosecution deal. \"The whole reason she was arrested was to flip her against my client,\" Mr Carroll said. Banfield, whose daughter was at the house on the morning of the killings, denies aggravated murder, child abuse and child cruelty. He faces life in prison if convicted of murder. The trial continues."
    },
    {
        "title": "Doctor appears in court accused of killing ex-wife and her dentist husband",
        "description": "A man accused of killing his ex-wife and her husband in Ohio is now facing upgraded murder charges as authorities prepare to transfer him from Illinois to face prosecution.",
        "url": "https://news.sky.com/story/man-accused-of-killing-ex-wife-and-her-dentist-husband-in-ohio-13493612",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-spencer-tepe-monique-tepe_7133995.jpg?20260113101115",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-13 07:52:00",
        "Headline": "Vascular surgeon Michael David McKee, 39 and from Chicago, now faces upgraded charges of premeditated aggravated murder in the deaths of his ex-wife, Monique Tepe, and her husband, Spencer Tepe, in Columbus, Ohio.",
        "Content": "A man accused of killing his ex-wife and her husband in Ohio is now facing upgraded murder charges as authorities prepare to transfer him from Illinois to face prosecution. Michael David McKee, 39, has been charged with two counts of premeditated aggravated murder, according to Franklin County court records. McKee, a doctor from Chicago, was arrested on Saturday in Illinois in connection with the killings of his ex-wife, Monique Tepe, 39, and her husband, Spencer Tepe, 37, who were found dead in their home in Columbus, Ohio, on 30 December. His arrest comes after nearly two weeks of widespread speculation about the killings. Investigators have said there were no signs of forced entry at the Tepe home, no weapon was found, and nothing appeared to be missing. The couple's two young children and their dog were discovered unharmed inside the house, and police ruled out a murder-suicide. McKee appeared in court on Monday wearing a yellow Winnebago County jail uniform, glasses, and restraints on his hands and feet. Winnebago County Public Defender Carie Poirier, who is representing McKee, said McKee plans to plead not guilty and intends to waive extradition in hopes of a speedy transfer to Ohio. \n                  Trump makes Iran pledge as more than 2,000 protesters reported killed\n                 \n                  How Russia is using 'disposable agents' to sabotage Europe\n                 \n                  Iranian ambassador summoned over country's response to protests\n                 McKee faced the prospect of extradition because murder is usually a state crime in the US, and national laws require fugitives to be legally transferred to the state where the crime was committed. McKee remained silent during the hearing, speaking only to confirm his name for the judge. 'Important step toward justice' In a statement, the Tepe family called the arrest \"an important step toward justice\" and said they had faith in the legal process to hold the responsible party accountable. \"Monique and Spencer remain forever in our hearts, and we will carry their love forward as we protect and care for the two children they leave behind,\" the statement said. \"We remain committed to honoring their lives and the light they shared with the world.\" Spencer Tepe's brother-in-law, Rob Misleh, told Sky's US partner NBC News on Monday that while the deaths shocked the family, they quickly suspected McKee's involvement. \"He was an emotionally abusive person when they were together - that is all I know,\" Misleh said. Authorities were first alerted after Spencer Tepe did not show up to the Athens dental office where he worked, an absence his manager described as highly unusual. Columbus police later performed a welfare check at the couple's home and found both victims on the second floor with gunshot wounds. Read more from Sky News:Starmer threatens to 'control' GrokIllegal migrant crackdown hits record arrests Final autopsy results from the Franklin County Coroner's Office are expected in the coming weeks, though officials have previously said the deaths appeared to be homicides caused by gunshots. Earlier this week, investigators released surveillance video of a person of interest wearing a dark hooded sweatshirt and light-colored pants walking through an alley near the home between 2am and 5am, the window in which police believe the shootings occurred. The footage prompted multiple tips and the investigation led authorities to McKee's apartment in another state. Court records show McKee and Monique Tepe - then known as Monique Sabaturski - were married in 2015 and divorced in 2017. Monique later married Spencer Tepe in 2020. During the vows at her marriage ceremony to Spencer, Monique said she knew from the beginning that she had found someone special. \"I had quite a journey to get to you - countless bad Bumble dates, wrong relationships, and waterfalls of tears - but it was worth every cringing second because it led me to you,\" she said, in words recorded on her wedding video posted on YouTube Spencer Tepe was a prominent dentist and involved in mentoring. Monique Tepe was remembered as a \"loving, patient, and joyful mother\", an avid baker, and a \"thoughtful planner\". NBC reports that McKee is licensed as a medical doctor in California and Illinois, and specialises in vascular surgery, according to online licence records. He graduated in 2014, the records show. He was also previously licensed in Nevada, but that licence expired in June. He was listed as a vascular surgeon at OSF Saint Anthony Medical Center in Rockford, Illinois, a city about 90 miles northwest of Chicago. OSF Healthcare said it is \"cooperating with authorities\", NBC reported. His medical licence records show no disciplinary history or malpractice. His criminal record shows only traffic-related tickets."
    },
    {
        "title": "Trump to lead largest ever US delegation to Davos",
        "description": "President Donald Trump will attend the World Economic Forum in Davos next week as head of the largest ever US delegation to attend the annual meeting, including five cabinet members, and a host of congressional representatives and state governors.",
        "url": "https://news.sky.com/story/trump-to-lead-largest-ever-us-delegation-to-davos-13493791",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-world-economic-forum_6422882.jpg?20240115214330",
        "type": "US",
        "Author": "Paul Kelso",
        "Date Published": "2026-01-13 14:22:00",
        "Headline": "European and Chinese leaders will also be in attendance, with reports that a reconstruction deal for Ukraine may be agreed with the US during the week.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n President Donald Trump will attend the World Economic Forum in Davos next week as head of the largest ever US delegation to attend the annual meeting, including five cabinet members, and a host of congressional representatives and state governors. The US leader will be one of at least 64 heads of state travelling to the Swiss mountain resort, including six out of seven G7 leaders and Ukrainian President Volodymyr Zelensky, but is likely to monopolise attention and the agenda. Downing Street has not confirmed if Sir Keir Starmer will be attending. Money blog: Royal Mail launching 24-hour parcel service US Secretary of State Mark Rubio and Treasury Secretary Scott Bessent will accompany President Trump, along with his key international negotiators Steve Witkoff and son-in-law Jared Kushner. Some 20 members of Trump's administration are expected to attend. President Zelensky will join European Union President Ursula von der Leyen in Davos, with reports that a reconstruction deal for Ukraine may be agreed with the US during the week. A large Chinese delegation will be led by vice-premier He Lifeng, who leads the country's economic policy and heads the Central Financial Commission. \n                  Davos delegates leave World Economic Forum under no illusion of Trump disruption ahead\n                 \n                  Trump has everyone at the World Economic Forum in Davos guessing\n                 \n                  David Beckham warns girls are being 'held back' as he attends Davos summit 'to be the voice of children'\n                 Chancellor Rachel Reeves will attend and is scheduled to hold a roundtable with business leaders hosted by JP Morgan boss Jamie Dimon, and speak on a public panel. The Treasury has characterised the trip as part of a renewed push to promote Britain as an investment destination around the world. President Trump has not attended the WEF meeting in person for six years, but gave a virtual address last year on the day following his inauguration, in which he set out the 'America First' approach that has upended global trade and foreign relations in the 12 months since. The American intervention in Venezuela earlier this month, with its unapologetic focus on controlling the country's oil, has heightened economic and political uncertainty, making Davos a potential forum for negotiation and a guaranteed platform for Trump to underline his dominance of the international agenda. Several Latin American leaders will be present, along with a strong presence from India, and the Middle East, including the transitional President of Syria, Ahmed Al-Sharaa, the Prime Minister of Lebanon, and delegations from Saudi Arabia, Qatar and the UAE. In his speech last year, President Trump put European leaders and manufacturing businesses on notice that they would face trade barriers if they chose not to shift construction to the US, a promise he honoured with the announcement of swingeing \"Liberation Day\" tariffs last April. Many of those tariffs have been rolled back following bilateral negotiations, including by the UK, which secured lower barriers for the car industry than the EU."
    },
    {
        "title": "Bank of England governor joins protest over US central bank row",
        "description": "The governor of the Bank of England has joined a chorus of opposition to the treatment of his US counterpart following revelations he is facing a criminal inquiry.",
        "url": "https://news.sky.com/story/bank-of-england-governor-joins-protest-over-us-central-bank-row-13493674",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-jerome-powel-andrew-bailey_7134023.jpg?20260113104109",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2026-01-13 10:42:00",
        "Headline": "Andrew Bailey is among a group of international central bank governors who say they \"stand in full solidarity\" with Jerome Powell and the independence of the Federal Reserve.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The governor of the Bank of England has joined a chorus of opposition to the treatment of his US counterpart following revelations he is facing a criminal inquiry. Andrew Bailey is among a group of global central bank bosses to sign a statement backing Federal Reserve chair Jerome Powell. He revealed on Sunday that he and the Fed were being threatened with possible Department of Justice (DoJ) charges as part of initial inquiries into spiralling renovation costs. Money latest: The exact amount pensions and benefits will go up per week from April Mr Powell, who had remained largely tight-lipped over a long-running battle with the Trump administration for control of central bank voting until then, claimed the action was a \"pretext\" to gain more influence over US monetary policy. There has been cross-party condemnation of his treatment. He is due to step down in May after serving two terms but there is now doubt over whether Congress will approve any successor nominated by the White House given the latest legal row. Mr Powell attracted further support on Tuesday from a coalition of central bankers through a joint statement. \n                  Royal Mail launching 24-hour parcel service; exact amount pensions and benefits are going up per week | Money blog\n                 \n                  Trump announces new tariff on countries trading with Iran as number killed in protests rises\n                 \n                  Trump risks end of China trade war truce through Iran tariffs\n                 The bankers, who also include European Central Bank president Christine Lagarde, said they \"stand in full solidarity\" with the Federal Reserve and its chair. \"The independence of central banks is a cornerstone of price, financial and economic stability in the interest of the citizens that we serve,\" the statement read. \"It is therefore critical to preserve that independence, with full respect for the rule of law and democratic accountability. \"Chair Powell has served with integrity, focused on his mandate and an unwavering commitment to the public interest. \"To us, he is a respected colleague who is held in the highest regard by all who have worked with him.\" Mr Bailey has spoken out in defence of US central bank independence before following several financial market wobbles linked to efforts by the White House to force a greater speed of interest rate cuts on the US economy. A Supreme Court hearing is due by the end of the month amid the administration's bid to fire a member of its rate-setting committee, Lisa Cook, who was appointed during the Biden presidency. Mr Trump, who has previously called for Mr Powell's head before tempering his criticism of the central bank chief, has distanced himself from any role in the US Attorney for Washington's requests for information from Mr Powell. The subpoenas relate to building costs at the Fed buildings, which have exceeded original estimates by hundreds of millions of dollars."
    },
    {
        "title": "Trump risks end of China trade war truce through Iran tariffs",
        "description": "On the face of it, an announcement of 25% tariffs against any nation trading with Iran amounts to a major escalation of Donald Trump's global trade war.",
        "url": "https://news.sky.com/story/trump-risks-end-of-china-trade-war-truce-through-iran-tariffs-13493636",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-jinping-china_7066751.jpg?20251030101940",
        "type": "Business",
        "Author": "Helen-Ann Smith",
        "Date Published": "2026-01-13 08:58:00",
        "Headline": "Sky's Asia correspondent says there are good reasons to expect retaliation from China, Iran's biggest trading partner, if Donald Trump targets that relationship.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n On the face of it, an announcement of 25% tariffs against any nation trading with Iran amounts to a major escalation of Donald Trump's global trade war. But China, Iran's biggest trading partner, has kept its reaction pretty brief and pretty bland. \"There is no winner in a tariff war,\" Foreign Ministry spokeswoman Mao Ning said, \"China will firmly safeguard its legitimate and lawful rights and interests.\" Money latest: 'My teenager's bank account was shut down for suspicious activity - but they won't tell me what it was' It is exactly the sort of thing China tends to say when it's still rushing to figure out the details. Indeed, it feels fair to assume that China is holding fire because, like the rest of the world, it is probably unsure how this new announcement will apply and to whom. Trump offered no explanation, for instance, on what \"doing business\" with Iran actually amounts to and, crucially, whether China's tariff truce with the US would leave it exempt. \n                  Frightening ordeal as Sky News team forced into cars and camera seized - with dissent in China rising dramatically\n                 \n                  Bosses courted to join PM's China trip as embassy verdict looms\n                 \n                  What the capture of Maduro means for China\n                 In theory, China should be first in line for this extra tax. While it is Iran's biggest trading partner, it is also one of a relatively limited list of countries still willing to circumvent US sanctions to buy from it, despite the international backlash over the regime's treatment of protesters seeking an end to clerical rule in the country. Analysts have estimated that China buys at least 80% of Iran's shipped oil, possibly as much as 90%. Exact figures are not published. In addition, China has significant investments in Iran, with Chinese companies financing construction and infrastructure projects. But the context of the US-China relationship is everything here. Months of damaging tit-for-tat trade warring was eventually paused in November, when a truce was agreed by presidents Xi Jinping and Trump. The bargain was hard won and negotiated over months, bringing China's average tariff rate down from 145% at the height of the standoff to around 47%. In exchange for this reduction, Trump achieved certain things that were important to him, such as an agreement to up the purchases of US soybeans, the de-blacklisting of certain US firms, and a loosening of access to crucial rare earth minerals. An increase of China's tariff rate now would almost certainly provoke it into retaliation, all these hard-won gains could, in an instant, be lost. Add to the mix the fact that Trump says he plans to visit Beijing in April and his intimation that stability in the relationship is desirable, and him carving out some sort of exemption for China feels increasingly likely. There is also precedent for this. Read more:How Iran enforced internet blackoutMore than 500 killed in Iran, rights group says In the summer, India was hit with an additional 25% tariff in retaliation for the country's purchase of oil from Russia. Despite the fact China buys more than India, it was not subject to the same treatment, almost certainly because a broader deal was in the process of being struck. An additional 25% tariff for China would be punishing right now, at a time when its economy is still struggling with slowed growth and high unemployment. It would bring the average rate to over 70% - an amount that makes almost all trade with the US inviable. But China has learnt over the past year that being strong and unrelenting with Trump has worked. It knows it has the power and leverage to push for an exemption, and be in no doubt, that is exactly what it will be doing behind the scenes. If it doesn't get it, expect a retaliation, and expect it to be severe."
    },
    {
        "title": "Scottish Budget 2026: Finance Secretary Shona Robison unveils SNP government's spending and tax plans",
        "description": "The Scottish government has unveiled its draft budget for 2026-27 - with a boost to the Scottish Child Payment and homes worth more than &#163;1m to face higher council tax bills.",
        "url": "https://news.sky.com/story/scottish-budget-2026-finance-secretary-shona-robison-unveils-snp-governments-spending-and-tax-plans-13493670",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-shona-robison-snp-holyrood_7134357.jpg?20260113160039",
        "type": "Business",
        "Author": "Jenness Mitchell",
        "Date Published": "2026-01-13 10:32:00",
        "Headline": "The draft proposals come just four months before the Scottish parliament election.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n The Scottish government has unveiled its draft budget for 2026-27 - with a boost to the Scottish Child Payment and homes worth more than £1m to face higher council tax bills. Finance Secretary Shona Robison set out the SNP administration's spending and tax plans for the coming year in a speech at Holyrood on Tuesday. The draft proposals come just four months before the Scottish parliament election, with the SNP aiming to entice voters to keep them in power so that the party can fulfil its plans. It is Ms Robison's final budget before she stands down as an MSP at the May election. Highlights from the draft budget: • There will be an investment of almost £68bn in the budget for the wellbeing of those in Scotland. When combined with the Scottish Spending Review and Infrastructure Investment Pipeline, there will be a total investment of almost £200bn;• The Scottish Child Payment will be increased to £40 per week for families with a child under the age of one. The change will come into force at the beginning of the 2027-28 year. It is currently £27.15 per week;• There will be two new council tax bands by 2028 and will be paid on properties worth more than £1m;• Funding for local government will increase by 2% in real terms. Ms Robison branded the settlement \"fair\" and a \"reasonable deal\" as she urged local authorities to translate the funding into \"reasonable decisions on council tax\";• A tax cut has been provided to low earners. The basic (20%) rate, which currently starts at £15,398, and the intermediate rate (21%), which currently starts at £27,492, will increase by 7.4% to £16,537 and £29,526 respectively;• A total of £22.5bn has been set aside for health and social care, including a record £17.6bn for the NHS's frontline services, £2.4bn to support the vital work of GPs, primary care and community services, and more than £2.3bn to aid social care;• Basic, intermediate and higher property rates will be reduced for businesses as well as transitional relief of £184m over the next three years for those impacted by the recent revaluation. There will be 15% non-domestic rates relief in 2026-27, worth £138m over three years for retail, hospitality and leisure premises, capped at £110,000 annually, while similar firms on Scotland's islands will be given 100% relief;• The Scottish government will establish a tax for private jets at some point after April 2027. Ms Robison said: \"To those who choose to travel by private jet, in Scotland you will pay, and you will pay a fair share for that privilege\";• Colleges will see a 10% increase in funding, delivering an extra £70m this year;• Funding will be provided so that by August 2027 every primary and additional support needs (ASN) school will have a breakfast club;• Communities impacted by the closure of the Fife Ethylene Plant (FEP) at Mossmorran will receive targeted support of £9m over the next three years;• Orkney and Shetland islanders will benefit from plans to scrap peak fares on Northern Isles ferries;• Nearly £200m will be spent on dualling the A9. Ms Robison said the government was \"committed\" to dualling the road by 2035. Ms Robison said: \"This is a budget for a stronger NHS, a budget for a more prosperous Scotland, a budget that, once again, gives the people of Scotland the best cost of living deal anywhere in the UK. \n                  Scotland's Justice Secretary Angela Constance 'unintentionally' breached ministerial code, investigation finds\n                 \n                  Scotland's first minister John Swinney announces bank holiday to celebrate World Cup\n                 \n                  SNP leader John Swinney condemns alleged office bugging of female MSP\n                 \"It is a budget that offers new ways to access a GP with walk-in GP clinics, new help for hard-pressed families with more wraparound care, new hope for young Scots looking for their first home, more operations, more appointments in our NHS, more people paying less income tax because they live here in Scotland. \"New help and more help - it's a budget for families, a budget for Scotland and a budget well worth voting for.\" 'Super-rich no longer get free pass to pollute Scottish skies' Jamie Livingstone, head of Oxfam Scotland, welcomed the private jet tax and said it sends a clear message that \"the super-rich will no longer get a free pass to pollute Scottish skies\". Claire Telfer, head of Scotland at Save the Children, said the charity was delighted by the boost to the Scottish Child Payment. She said: \"Investing in the tiniest members of our society - alongside the other commitments made to tackle child poverty - is how we sow the seeds of a brighter tomorrow.\" The Joseph Rowntree Foundation also praised the child payment increase but warned \"a lot of work\" still needs to be done. Chris Birt, associate director for Scotland, said: \"This should go some way to addressing the shocking fact that over a third of babies in Scotland currently live in a household in poverty. \"However, given the extent of the struggles that families are facing right now, the rest of the poverty-related funding announced in the budget doesn't meet the scale of action required, with a disappointing lack of detail on how it will be spent and how that will impact on people's lives. \"This budget marks another missed opportunity to take the bold and radical action needed.\" Think tank IPPR Scotland branded the budget \"tepid\" as it called for a long-term tax strategy that will be able to meet the needs of the nation's people \"while addressing the looming fiscal gap\". The Scottish Conservatives described it as \"cynical and predictable\". MSP Craig Hoy, the party's shadow finance secretary, added: \"Shona Robison's tinkering with the lower rate tax bands produces paltry and insulting savings for some, while middle-earners will be clobbered harder than ever before. \"Hard-working Scots are paying the price for the SNP's skewed priorities - with the out-of-control benefits bill continuing to grow and a huge rise in overseas development spending.\" Holyrood ministers must balance the books The Scottish budget is largely funded through the block grant alongside taxes raised north of the border. It sets the annual funding for Scotland's health, education, justice, transport and welfare systems, as well as any tax changes. Holyrood ministers are legally obliged to balance the books and have limited borrowing powers with which to raise additional funds. Scotland's auditor general previously warned the country faces a near £5bn funding shortfall by the end of the decade. The draft budget will be scrutinised in the Scottish parliament over the coming weeks before a final vote, where the SNP will need to garner support from outside its minority administration for it to pass into law. It has been speculated that Scottish Labour could abstain after party leader Anas Sarwar said his MSPs would not stand in the way of the budget, effectively allowing it to pass. Mr Sarwar is instead focused on the Holyrood election, with expectations he will announce an emergency budget if his party gets into power. Recent polling puts the SNP in first place, although not enough for a majority, with Reform UK and Scottish Labour in second and third place respectively."
    },
    {
        "title": "Industry sounds new alarm bell over Reeves's ISA reforms",
        "description": "The investment industry has intensified warnings to the government over plans to limit cash ISAs, arguing that they risk undermining British investors' willingness to back listed companies.",
        "url": "https://news.sky.com/story/industry-sounds-new-alarm-bell-over-reevess-isa-reforms-13493793",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-money-cash_6984899.jpg?20250807143220",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-13 14:40:00",
        "Headline": "Leading ISA providers and investment platforms held heated talks with Treasury and HMRC officials on Tuesday amid warnings that the government is rushing through \"flawed\" changes, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The investment industry has intensified warnings to the government over plans to limit cash ISAs, arguing that they risk undermining British investors' willingness to back listed companies. Sky News has learnt that a meeting on Tuesday involving major industry players including Hargreaves Lansdown, HSBC and Lloyds Banking Group, along with officials from the Treasury and HM Revenue and Customs, descended into a heated exchange over the implications of the Treasury's reforms. Money blog: Royal Mail launching 24-hour parcel service Under plans confirmed by Rachel Reeves at November's budget, the cash ISA allowance will be slashed from £20,000 to £12,000 from April 2027, with the exception of savers aged under 65. The chancellor said the move was aimed at stimulating greater investment in the UK stock market, with the £8,000 balance available for investment in stocks and shares ISA products. The Treasury and HMRC are now drawing up detailed anti-circumvention rules including banning transfers from stocks and shares and Innovative Finance ISAs to cash ISAs; the use of tests to determine whether an investment is eligible to be held in a stocks and shares ISA or is 'cash-like'; and charges on any interest paid on cash held in a stocks and shares or Innovative Finance ISA. However, the investment industry has been vocal in warning that the rule changes will increase complexity and penalise savers who are focused on derisking their portfolios before they turn 65. \n                  Bank of England governor joins protest over US central bank row\n                 \n                  Royal Mail launching 24-hour parcel service; exact amount pensions and benefits are going up per week | Money blog\n                 \n                  Trump announces new tariff on countries trading with Iran as number killed in protests rises\n                 There are also growing concerns that a more robust approach to taxing cash balances held in stocks and shares ISAs would severely damage the image of ISAs as a tax-free investment option. Any evidence that the reforms are undermining stock market investing ahead of the next general election would be damaging to Ms Reeves, who has instructed the industry to work on a multimillion-pound campaign aimed at promoting retail investments to the public. A number of firms have already pulled out of participating in that campaign over its costs and coordination. One industry figure who attended Tuesday's talks said: \"It became abundantly clear at the meeting today that significant reforms to ISAs are being made on the hoof with little understanding of how retail investors behave or the extent of potential unintended consequences. \"HMRC has been put in an invidious position of trying to implement changes that are fundamentally flawed. \"Rather than rushing to do something which risks undermining retail investing, the chancellor should go back to the drawing board and build an evidence base for sensible, long-term reforms aimed at supporting retail investors.\" The reforms will be subject to a consultation period, with draft legislation - in the form of amendments to the ISA regulations - laid before parliament well in advance of April 2027. In the 2023-24 tax year, savers ploughed a record £103bn into ISAs, with almost exactly two-thirds of that - £70bn - invested in cash ISAs. Among the others in attendance at Tuesday's meeting were the Building Societies Association, AJ Bell, Fidelity, Vanguard and the Investment Association. A government spokesperson said: \"To encourage greater investment in stocks and shares, we're developing changes to ISA rules which will prevent circumvention of the new lower cash ISA limit. \"We're already working closely with industry and will publish clear guidance before the changes come into effect.\""
    },
    {
        "title": "Trump to lead largest ever US delegation to Davos",
        "description": "President Donald Trump will attend the World Economic Forum in Davos next week as head of the largest ever US delegation to attend the annual meeting, including five cabinet members, and a host of congressional representatives and state governors.",
        "url": "https://news.sky.com/story/trump-to-lead-largest-ever-us-delegation-to-davos-13493791",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-world-economic-forum_6422882.jpg?20240115214330",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2026-01-13 14:22:00",
        "Headline": "European and Chinese leaders will also be in attendance, with reports that a reconstruction deal for Ukraine may be agreed with the US during the week.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n President Donald Trump will attend the World Economic Forum in Davos next week as head of the largest ever US delegation to attend the annual meeting, including five cabinet members, and a host of congressional representatives and state governors. The US leader will be one of at least 64 heads of state travelling to the Swiss mountain resort, including six out of seven G7 leaders and Ukrainian President Volodymyr Zelensky, but is likely to monopolise attention and the agenda. Downing Street has not confirmed if Sir Keir Starmer will be attending. Money blog: Royal Mail launching 24-hour parcel service US Secretary of State Mark Rubio and Treasury Secretary Scott Bessent will accompany President Trump, along with his key international negotiators Steve Witkoff and son-in-law Jared Kushner. Some 20 members of Trump's administration are expected to attend. President Zelensky will join European Union President Ursula von der Leyen in Davos, with reports that a reconstruction deal for Ukraine may be agreed with the US during the week. A large Chinese delegation will be led by vice-premier He Lifeng, who leads the country's economic policy and heads the Central Financial Commission. \n                  Davos delegates leave World Economic Forum under no illusion of Trump disruption ahead\n                 \n                  Trump has everyone at the World Economic Forum in Davos guessing\n                 \n                  David Beckham warns girls are being 'held back' as he attends Davos summit 'to be the voice of children'\n                 Chancellor Rachel Reeves will attend and is scheduled to hold a roundtable with business leaders hosted by JP Morgan boss Jamie Dimon, and speak on a public panel. The Treasury has characterised the trip as part of a renewed push to promote Britain as an investment destination around the world. President Trump has not attended the WEF meeting in person for six years, but gave a virtual address last year on the day following his inauguration, in which he set out the 'America First' approach that has upended global trade and foreign relations in the 12 months since. The American intervention in Venezuela earlier this month, with its unapologetic focus on controlling the country's oil, has heightened economic and political uncertainty, making Davos a potential forum for negotiation and a guaranteed platform for Trump to underline his dominance of the international agenda. Several Latin American leaders will be present, along with a strong presence from India, and the Middle East, including the transitional President of Syria, Ahmed Al-Sharaa, the Prime Minister of Lebanon, and delegations from Saudi Arabia, Qatar and the UAE. In his speech last year, President Trump put European leaders and manufacturing businesses on notice that they would face trade barriers if they chose not to shift construction to the US, a promise he honoured with the announcement of swingeing \"Liberation Day\" tariffs last April. Many of those tariffs have been rolled back following bilateral negotiations, including by the UK, which secured lower barriers for the car industry than the EU."
    },
    {
        "title": "Kyle to pledge 'protection' for start-ups from foreign raids",
        "description": "The business secretary will this week pledge to \"protect\" fast-growing UK companies from overseas predators as he claims that the government's new industrial strategy is already delivering substantial gains for Britain's economy. ",
        "url": "https://news.sky.com/story/kyle-to-pledge-8220protection8221-for-start-ups-from-foreign-raids-13493671",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-peter-kyle_7134077.jpg?20260113113725",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-13 10:34:00",
        "Headline": "The business secretary will mark a gathering to promote the progress of the UK's industrial strategy by telling bosses that British start-ups need safeguards against overseas bids, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The business secretary will this week pledge to \"protect\" fast-growing UK companies from overseas predators as he claims that the government's new industrial strategy is already delivering substantial gains for Britain's economy.  Sky News has learnt that Peter Kyle will say at a gathering of bosses in Central London that the industrial strategy had generated billions of pounds in new investment commitments and created tens of thousands of jobs since its launch last summer. His remarks will come days before he travels to the World Economic Forum in Davos, Switzerland to promote a renewed wave of global investment in the UK. Money latest: The exact amount pensions and benefits will go up per week from April Britain's sluggish economic performance will, however, inevitably cloud discussions with foreign investors next week, with Rachel Reeves, the chancellor, also likely to face questions in Davos about the extent to which her budget has applied the brakes to new investment. Whitehall insiders said the event on Tuesday evening would be attended from executives from companies including Alphabet, Barclays, BP, National Grid, Octopus Energy and Revolut. A source close to Mr Kyle, who replaced Jonathan Reynolds as business secretary in the cabinet reshuffle last autumn, said: \"The modern Industrial Strategy has delivered billions in new investment commitments and created tens of thousands of jobs since it launched - but this government is relentless in its pursuit of growth and knows we need to do more. \n                  Bank of England governor joins protest over US central bank row\n                 \n                  Royal Mail launching 24-hour parcel service; exact amount pensions and benefits are going up per week | Money blog\n                 \n                  Trump announces new tariff on countries trading with Iran as number killed in protests rises\n                 \"The business secretary will use this event to set out his ambition on slashing red tape, removing burdensome legislation, and using the full financial power of our financial institutions to invest in frontier industries. \"We must protect promising start-ups from being swallowed up by foreign competitors, and we will do everything we can to ensure that the best British businesses invest here, scale here, and stay here.\" It was unclear what protection the government was considering to prevent foreign raids on Britain's most valuable start-ups, following a string of deals in recent times. The ten-year industrial strategy promised to prioritise eight key areas of the economy, including defence, life sciences and advanced manufacturing."
    },
    {
        "title": "Will Starmer go from 'Never Here Keir' to 'Kowtow Keir' if Chinese super embassy goes ahead?",
        "description": "A prime minister who has made U-turn after U-turn is about to make a controversial and unpopular decision on which there will be no going back.",
        "url": "https://news.sky.com/story/will-starmer-go-from-never-here-keir-to-kowtow-keir-if-chinese-super-embassy-goes-ahead-13493911",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer-xi-jinping_7060651.jpg?20251024144452",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2026-01-13 17:57:00",
        "Headline": "The Chinese super embassy plans have caused a backlash from Sir Keir Starmer's own MPs over security concerns.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n A prime minister who has made U-turn after U-turn is about to make a controversial and unpopular decision on which there will be no going back. Despite massive opposition from MPs of all parties and an alarming 11th-hour security risk, Sir Keir Starmer's go-ahead for a Chinese super embassy is imminent. Why now, after months of delays, missed deadlines and bureaucratic dithering? Simple. Because the PM is expected to visit China later this month. Politics latest: Iranian ambassador to UK summoned  Last week, a number of business leaders expressed doubt to Sky News city editor Mark Kleinman that the trip will take place unless the embassy is approved. But those tycoons Downing Street hopes will be on the plane with the PM needn't worry. The date of the visit has yet to be announced, but it's expected after the gathering of the political and business elite at the World Economic Forum in Davos concludes on 23 January. \n                  Politics latest: Starmer U-turns on plans for mandatory digital ID cards\n                 \n                  New Birmingham to Manchester rail line to be built\n                 \n                  Hillsborough Law delayed after backlash\n                 In recent weeks, the prime minister has given some pretty clear signals that the trip is on and, therefore, that approval for the embassy is coming soon. First, in his Guildhall speech last month, Sir Keir said: \"President Trump met President Xi in October… and will visit China in April. \"Since early 2018, President Macron has visited China twice, and he'll be there again later this week. \"German leaders have visited four times, and Chancellor Merz will be there in the New Year. \"Yet, during this same period, no British Prime Minister has visited China. \"And until I met President Xi last November, there had been no leader-level meeting at all for six years.\" The last PM to visit China was Theresa May in February 2018. On that trip, the business delegation signed new deals with the Chinese worth £9bn. Sir Keir will be hoping for more of the same. He did admit at the Guildhall that China \"poses real national security threats to the United Kingdom\", but he said: \"The absence of engagement is just staggering - a dereliction of duty. \"Because it means that, unlike our allies, we have not been standing up for our interests.\" And then he declared: \"Well, no more.\" No more, indeed. Read more:Everything you need to know about China's new super embassy Secondly, in his speech to the Parliamentary Labour Party this week, reacting to \"Never Here Keir\" criticism, the PM spoke of a \"volatile world\" and said: \"You have to be on the pitch. You have to be in the room.\" But the opposition to the embassy, on the former Royal Mail site next to the Tower of London and near the City of London's financial markets, is overwhelming. Hostility has now intensified after a new security row over secret plans for a hidden chamber in the embassy alongside Britain's most sensitive underground cabling. The secret chamber, with rooms MPs have claimed will be spy dungeons, is just metres from fibre optic cables transmitting financial data to the City, and millions of emails and other messages. \"We know now that they plan to demolish the wall between the cables and their embassy,\" shadow security minister Alicia Kearns protested in the Commons. \"Cables on which our economy is dependent. \"Cables carrying millions of British people's emails and financial data, and access that would give the Chinese Communist Party a launch pad for economic warfare against our nation.\" There's alarm from Labour MPs, too. Senior Labour backbenchers have written to Housing Secretary Steve Reed, urging the government to reject the Chinese planning application. Fat chance, though! One of the Labour MPs, Sarah Champion, a member of the national security strategy, said in the Commons: \"Multiple government agencies and government departments have raised concerns about this mega-embassy. \"Our international partners have raised concerns about it. Every security briefing I've had identifies China as a hostile state to the UK.\" Shadow justice secretary Robert Jenrick, as ever, reacted the most pithily to the latest security risk, revealed in leaked unredacted plans, claiming: \"No one committed to our national security could possibly sign this off.\" And then he added: \"But Kowtow Keir will.\" Oh dear! From \"Never Here Keir\" to \"Kowtow Keir\". Which is worse? On China, \"Kowtow-Keir\", almost certainly. And that's because, unlike previous retreats, climbdowns and screeching government about turns, once the embassy is approved, there can be no U-turn. It can't be disapproved. Even though political allies, as well as foes, disapprove of the embassy with near-unanimous hostility. So, as he tucks into a Chinese banquet with Xi in Beijing later this month, Sir Keir will have to be prepared for his embassy decision leaving a thoroughly bad taste back in the UK."
    },
    {
        "title": "New Birmingham to Manchester rail line to be built",
        "description": "A new rail line will be built between Birmingham and Manchester, the government has announced.",
        "url": "https://news.sky.com/story/new-birmingham-to-manchester-rail-line-to-be-built-but-govt-provides-no-timeline-13493926",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-gbr-great-british-railways_7104936.jpg?20251208163656",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-13 18:54:00",
        "Headline": "Sir Keir Starmer said it would not happen until after Northern Powerhouse Rail (NPR), aimed at boosting east-west rail links in northern England, is completed.",
        "Content": "A new rail line will be built between Birmingham and Manchester, the government has announced. However, no timescale for when it would be built was provided - or any other details, such as how it would be funded. The Treasury said it wants a new Birmingham-Manchester rail line, but it would not be \"a reinstatement of HS2\". Rishi Sunak's Conservative government scrapped a planned extension of HS2 between the two cities in 2023 to save money. Land obtained for HS2 between the West Midlands and northern cities will be kept while the project is developed. A new line would ease pressure on the West Coast Main Line, the government said. The Treasury did not provide a date for when it aims to have the new line finished, but said it would not open until after the completion of Northern Powerhouse Rail (NPR), a scheme to boost east-west rail connections across northern England. Sir Keir Starmer said the government was \"rolling up its sleeves\" to deliver NPR. The programme's first phase is set to improve connections on existing lines in the 2030s on these routes: between Sheffield and Leeds; between Leeds and York; and between Leeds and Bradford. They do not require major new land acquisitions. A second phase of NPR is set to involve a new route between Liverpool and Manchester via Manchester airport and Warrington, using a combination of new and existing lines. The third and final phase will involve better connections eastwards from Manchester to Leeds, Bradford, Sheffield and York. There is also money for a new station for Bradford. Regular services would run on to Newcastle via Darlington and Durham, and Chester for North Wales connections. Development work would also be taken forward on reopening the Leamside Line, a 21-mile route between Pelaw, Gateshead, and Tursdale, County Durham, which was closed in 1964. The Treasury said a \"funding cap\" of £45bn would be set for NPR, although this could be topped up by local contributions, such as through increased revenue from business rates. It added that an initial £1.1bn for development and design work would be available to enable the creation of a \"detailed delivery plan which will include timings\". Sir Keir said: \"Over and over again, people in northern communities, from Liverpool and Manchester to York and Newcastle have been let down by broken promises. \"This cycle has to end. No more paying lip service to the potential of the North, but backing it to the hilt. \"That's why this government is rolling up its sleeves to deliver real, lasting change for millions of people through Northern Powerhouse Rail: a major new rail network across the North that will deliver faster, more frequent services.\" However, the Tories accused the government of \"watering down\" NPR and said ministers had \"put back any plans to actually deliver it and rewritten timetables on the fly\". Shadow rail minister Jerome Mayhew said: \"Labour lurch from review to review, deadline to deadline, with no grip on costs, no clarity on scope and no courage to make decisions, exemplified nowhere clearer than the hatchet job of Great British Railways. \"Northern Powerhouse Rail could have been transformational, empowering regional growth and regeneration. Under Labour it risks becoming a permanent mirage that is endlessly redesigned, downgraded and never delivered.\""
    },
    {
        "title": "Hillsborough Law delayed after backlash",
        "description": "The government is delaying the Hillsborough Law next stage until next week because of a backlash by Labour MPs to attempts to water down \"duty of candour\" for the security services, Sky News understands.",
        "url": "https://news.sky.com/story/hillsborough-law-delayed-after-backlash-13493675",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-hillsborough-law-liverpool_7022734.jpg?20250917095229",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-13 10:42:00",
        "Headline": "No subtitle found",
        "Content": "The government is delaying the Hillsborough Law next stage until next week because of a backlash by Labour MPs to attempts to water down \"duty of candour\" for the security services, Sky News understands. The Public Office Accountability Bill is designed to establish a \"duty of candour\" in law, which would mean public servants must tell the truth in future public inquiries or other investigations, or else face legal consequences. It follows the 1989 Hillsborough disaster that led to 97 deaths, and subsequent efforts by some officials to mislead about events that led up to the tragedy. Politics latest - follow live The issue, as Sky's deputy political editor Sam Coates explained, is the matter of duty of candour covering MI5 and MI6. Speaking on the Politics with Sam and Anne podcast, he said: \"The security services are deeply uncomfortable with this. So what's been going on in the background is there's been a hell of a negotiation, a negotiation with the campaign groups, Labour MPs and the Cabinet Office and the security services to make sure that the duty of candour is proportionate when it comes to the intelligence services. \"And the campaigners accept caveats. They know that you can't have unfettered access to everything the intelligence services do, so they hammered out a compromise. \n                  Hillsborough families hit out at report into disaster - as it finds 12 police officers would have faced gross misconduct cases\n                 \n                  Hillsborough: Long-awaited report into Britain's worst-ever sporting disaster to be published today\n                 \n                  Key findings from the police watchdog's Hillsborough report\n                 \"Clause six of the Public Office Accountability Bill is the compromise. \"But then, when the bill was published, they discovered that the government had done the dirty on them, effectively.\" 👉Listen to Politics At Sam And Anne's on your podcast app👈 Coates explained the draft bill only set out a duty of candour corporately - meaning only organisations and not individuals in the security services could be asked to testify, except for where \"the bosses of those intelligence services have given very specific authorisation\". He added: \"So in other words, there was no individual responsibility for intelligence officers under this, which now has caused the mother of all rebellions against this in the background because it is not what they were promised.\" It is expected the delay will be until next Monday, instead of the next stage of the bill taking place this Wednesday as planned."
    },
    {
        "title": "Scottish Budget 2026: Finance Secretary Shona Robison unveils SNP government's spending and tax plans",
        "description": "The Scottish government has unveiled its draft budget for 2026-27 - with a boost to the Scottish Child Payment and homes worth more than &#163;1m to face higher council tax bills.",
        "url": "https://news.sky.com/story/scottish-budget-2026-finance-secretary-shona-robison-unveils-snp-governments-spending-and-tax-plans-13493670",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-shona-robison-snp-holyrood_7134357.jpg?20260113160039",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2026-01-13 10:32:00",
        "Headline": "The draft proposals come just four months before the Scottish parliament election.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n The Scottish government has unveiled its draft budget for 2026-27 - with a boost to the Scottish Child Payment and homes worth more than £1m to face higher council tax bills. Finance Secretary Shona Robison set out the SNP administration's spending and tax plans for the coming year in a speech at Holyrood on Tuesday. The draft proposals come just four months before the Scottish parliament election, with the SNP aiming to entice voters to keep them in power so that the party can fulfil its plans. It is Ms Robison's final budget before she stands down as an MSP at the May election. Highlights from the draft budget: • There will be an investment of almost £68bn in the budget for the wellbeing of those in Scotland. When combined with the Scottish Spending Review and Infrastructure Investment Pipeline, there will be a total investment of almost £200bn;• The Scottish Child Payment will be increased to £40 per week for families with a child under the age of one. The change will come into force at the beginning of the 2027-28 year. It is currently £27.15 per week;• There will be two new council tax bands by 2028 and will be paid on properties worth more than £1m;• Funding for local government will increase by 2% in real terms. Ms Robison branded the settlement \"fair\" and a \"reasonable deal\" as she urged local authorities to translate the funding into \"reasonable decisions on council tax\";• A tax cut has been provided to low earners. The basic (20%) rate, which currently starts at £15,398, and the intermediate rate (21%), which currently starts at £27,492, will increase by 7.4% to £16,537 and £29,526 respectively;• A total of £22.5bn has been set aside for health and social care, including a record £17.6bn for the NHS's frontline services, £2.4bn to support the vital work of GPs, primary care and community services, and more than £2.3bn to aid social care;• Basic, intermediate and higher property rates will be reduced for businesses as well as transitional relief of £184m over the next three years for those impacted by the recent revaluation. There will be 15% non-domestic rates relief in 2026-27, worth £138m over three years for retail, hospitality and leisure premises, capped at £110,000 annually, while similar firms on Scotland's islands will be given 100% relief;• The Scottish government will establish a tax for private jets at some point after April 2027. Ms Robison said: \"To those who choose to travel by private jet, in Scotland you will pay, and you will pay a fair share for that privilege\";• Colleges will see a 10% increase in funding, delivering an extra £70m this year;• Funding will be provided so that by August 2027 every primary and additional support needs (ASN) school will have a breakfast club;• Communities impacted by the closure of the Fife Ethylene Plant (FEP) at Mossmorran will receive targeted support of £9m over the next three years;• Orkney and Shetland islanders will benefit from plans to scrap peak fares on Northern Isles ferries;• Nearly £200m will be spent on dualling the A9. Ms Robison said the government was \"committed\" to dualling the road by 2035. Ms Robison said: \"This is a budget for a stronger NHS, a budget for a more prosperous Scotland, a budget that, once again, gives the people of Scotland the best cost of living deal anywhere in the UK. \n                  Scotland's Justice Secretary Angela Constance 'unintentionally' breached ministerial code, investigation finds\n                 \n                  Scotland's first minister John Swinney announces bank holiday to celebrate World Cup\n                 \n                  SNP leader John Swinney condemns alleged office bugging of female MSP\n                 \"It is a budget that offers new ways to access a GP with walk-in GP clinics, new help for hard-pressed families with more wraparound care, new hope for young Scots looking for their first home, more operations, more appointments in our NHS, more people paying less income tax because they live here in Scotland. \"New help and more help - it's a budget for families, a budget for Scotland and a budget well worth voting for.\" 'Super-rich no longer get free pass to pollute Scottish skies' Jamie Livingstone, head of Oxfam Scotland, welcomed the private jet tax and said it sends a clear message that \"the super-rich will no longer get a free pass to pollute Scottish skies\". Claire Telfer, head of Scotland at Save the Children, said the charity was delighted by the boost to the Scottish Child Payment. She said: \"Investing in the tiniest members of our society - alongside the other commitments made to tackle child poverty - is how we sow the seeds of a brighter tomorrow.\" The Joseph Rowntree Foundation also praised the child payment increase but warned \"a lot of work\" still needs to be done. Chris Birt, associate director for Scotland, said: \"This should go some way to addressing the shocking fact that over a third of babies in Scotland currently live in a household in poverty. \"However, given the extent of the struggles that families are facing right now, the rest of the poverty-related funding announced in the budget doesn't meet the scale of action required, with a disappointing lack of detail on how it will be spent and how that will impact on people's lives. \"This budget marks another missed opportunity to take the bold and radical action needed.\" Think tank IPPR Scotland branded the budget \"tepid\" as it called for a long-term tax strategy that will be able to meet the needs of the nation's people \"while addressing the looming fiscal gap\". The Scottish Conservatives described it as \"cynical and predictable\". MSP Craig Hoy, the party's shadow finance secretary, added: \"Shona Robison's tinkering with the lower rate tax bands produces paltry and insulting savings for some, while middle-earners will be clobbered harder than ever before. \"Hard-working Scots are paying the price for the SNP's skewed priorities - with the out-of-control benefits bill continuing to grow and a huge rise in overseas development spending.\" Holyrood ministers must balance the books The Scottish budget is largely funded through the block grant alongside taxes raised north of the border. It sets the annual funding for Scotland's health, education, justice, transport and welfare systems, as well as any tax changes. Holyrood ministers are legally obliged to balance the books and have limited borrowing powers with which to raise additional funds. Scotland's auditor general previously warned the country faces a near £5bn funding shortfall by the end of the decade. The draft budget will be scrutinised in the Scottish parliament over the coming weeks before a final vote, where the SNP will need to garner support from outside its minority administration for it to pass into law. It has been speculated that Scottish Labour could abstain after party leader Anas Sarwar said his MSPs would not stand in the way of the budget, effectively allowing it to pass. Mr Sarwar is instead focused on the Holyrood election, with expectations he will announce an emergency budget if his party gets into power. Recent polling puts the SNP in first place, although not enough for a majority, with Reform UK and Scottish Labour in second and third place respectively."
    },
    {
        "title": "Reform insiders express concern over Zahawi defection - as party hits lowest poll level in months",
        "description": "Reform UK insiders have told Sky News they fear the high profile defection of Nadhim Zahawi to their party may \"look like naked opportunism\".",
        "url": "https://news.sky.com/story/mixed-reaction-to-zahawi-defection-within-reform-as-poll-puts-party-at-lowest-level-in-months-13493618",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nadhim-zahawi-nigel-farage_7133385.jpg?20260112114153",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-13 08:16:00",
        "Headline": "Some inside Reform are worried Nadhim Zahawi's high-profile defection to the party looks like \"naked opportunism\" and could lead them to looking like a home for ex-Tories.",
        "Content": "Reform UK insiders have told Sky News they fear the high profile defection of Nadhim Zahawi to their party may \"look like naked opportunism\". Speaking to Sky News' deputy political editor Sam Coates, some inside the party have said there has been a \"decidedly mixed reaction\" to the former chancellor's defection. Party leader Nigel Farage unveiled Mr Zahawi as the latest - and biggest - defection to Reform UK in a news conference on Monday, with the ex-senior Tory saying he defected as \"our wonderful country is sick\" and that \"Britain needs Reform\". Politics latest - follow live But not everyone within the party is so delighted by their latest recruit. Speaking on the Politics at Sam and Anne's podcast, Coates explained: \"It's really interesting. I actually had one Reform person telling me overnight that there's a decidedly mixed reaction to the defection of Nadhim Zahawi. \"They were worrying that Zahawi has just said so much stuff as he was around for the entire 14 years in government and was a loyalist to every leader, every Tory leader from 2010. \"So, they worry that to some, this whole thing looks like naked opportunism.\" 👉Listen to Politics At Sam And Anne's on your podcast app👈 Mr Zahawi has held several roles in government, including serving as chancellor for 63 days, as vaccines minister under Boris Johnson and as education secretary. But he has been dogged by scandal, having been caught out in the expenses scandal in 2013 for charging the taxpayer to power his horses' stables, and being sacked as chairman of the Tory party by Rishi Sunak for breaching the ministerial code over his tax affairs. Read more:Who is Nadhim Zahawi?Analysis: How Reform could offer Zahawi a route to the top Coates added: \"The Tories are keen to point out privately that pretty much what the spectators have been saying yesterday, that Zahawi has joined Nadine Dorries, Jake Berry and others, making it look awfully like Boris Johnson's version of the Conservative Party from a few years back. One former Tory cabinet minister called it 'same team, new badge'.\" But he warned: \"The Tories comparing Reform to Boris Johnson's Conservatives maybe a double-edged sword and not the best attack line that they might hope it is.\" Reform fall to lowest poll rating in 10 months - but remain top Mr Zahawi's defection comes as a new voting intention poll published on Tuesday put Reform at their lowest level since April. The Sky x Times poll created by YouGov, ironically the company co-founded by Mr Zahawi, put Reform on 24% (down two points), the Tories on 20% (up one point), and Labour on 19% (up to two points). The Liberal Democrats are on 16%, while the Greens are down two on 14%. The poll was carried out before Mr Zahawi's defection was announced. But reacting to the poll, Coates said: \"It is part of a broad downwards trend in Reform support since what appears to have been their peak around October. \"That coincides with the Conservative ratings starting some sort of recovery from rock bottom, and the salience of immigration starting to gradually decline [as the] most important issue.\" Of course, it is just one poll, and analysts would suggest people should wait to see if the trend continues and is picked up elsewhere. 'Not everybody is welcome in Reform' Nadine Dorries, another ally of Mr Johnson and a fellow defector from the Tories to Reform, failed to explicitly endorse Mr Zahawi but told Sky News \"everyone has their own reasons\" for joining Mr Farage's outfit, and warned \"the writing is on the wall for the Conservative Party\". The former culture secretary added that \"not everybody is welcome in Reform\" and that \"there's a limit to the number of former ministers\" the party will accept. Tory MPs thinking of following Mr Zahawi may \"get a nasty shock\", she said. Reacting to the latest poll, she also insisted: \"I don't quite buy the Kemi bounce theory yet.\""
    },
    {
        "title": "Who are all the former Conservative MPs who have defected to Reform?",
        "description": "A steady procession of former - and current - Conservative MPs have defected to Reform UK since March 2024.",
        "url": "https://news.sky.com/story/who-are-all-the-former-conservative-mps-who-have-defected-to-reform-13493808",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nigel-farage-reform_7128772.jpg?20260107101103",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2026-01-13 15:02:00",
        "Headline": "Nigel Farage's party has been attracting Conservative MPs since early 2024.",
        "Content": "\n          Political reporter\n              @alixculbertson\n A steady procession of former - and current - Conservative MPs have defected to Reform UK since March 2024. Sky News looks at who has made the move to the party that has topped voting intention polls for nearly a year: 20. Nadhim Zahawi The former chancellor - albeit for two months - became the most senior former Tory MP to move over to Nigel Farage's camp on 12 January 2026. Also vaccines minister during the pandemic, Mr Zahawi called the Conservative Party a \"defunct brand\" and said the UK \"really does need Nigel Farage as prime minister\". 19. Ben Bradley The former Mansfield MP and vice chair of the Conservative Party under Theresa May joined Reform on 10 December 2025, 17 months after losing his seat. \n                  Politics latest: Starmer U-turns on plans for mandatory digital ID cards\n                 \n                  Will Starmer go from 'Never Here Keir' to 'Kowtow Keir' if Chinese super embassy goes ahead?\n                 \n                  New Birmingham to Manchester rail line to be built\n                 Also a former leader of Nottinghamshire County Council, he said he had lost trust in both Labour and the Conservatives, and was going to help Reform cut council spending. 18. Chris Green Ex-Bolton West MP Chris Green switched on 1 December 2025, saying the Tories had \"broken trust with Britain\" and Reform was the necessary vision for the country. He was one of three ex-Conservatives to defect that day. Read more:Reform insiders express concern over Zahawi defectionFarage sang antisemitic songs to Jewish classmates, former Dulwich pupil claims 17. Lia Nici Having lost her Great Grimsby seat in 2024, former assistant government whip Ms Nici defected on the same day as Mr Green. While a Tory MP, she told Sky News' Politics Hub: \"I'm probably more Reform than most Reform candidates, to be honest.\" She said the Tories had \"lost touch\" and now serves as a special adviser to Reform mayor of Hull and East Yorkshire, Luke Campbell. 16. Jonathan Gullis The third Conservative to defect on 1 December 2025, the former Conservative deputy chair represented Stoke-on-Trent North until 2024. An ex-teacher and school standards minister, Mr Gullis, who is now mayor of Kidsgrove in Staffordshire, said the Tory party had \"lost touch with the people it was meant to serve\". 15. Sarah Atherton A former defence minister, who lost her Wrexham seat in 2024, Ms Atherton defected to Reform on 2 October 2025 after announcing she was quitting the Conservative party two months before. She said the Tories no longer aligned with her values and said \"Britain's armed forces deserve better\" than what Labour and the Conservatives are offering. 14. Maria Caulfield The ex-nurse and health minister switched on 16 September 2025, as she said the future for those who are \"conservative right-minded\" is Reform. Having lost her East Sussex seat of Lewes in 2024, she said the \"same people who thought that Brexit would not happen think that Reform will not happen - they are in for a shock\". 13. Danny Kruger The first sitting Tory MP to defect, Mr Kruger said the Tory party \"is over\" and Nigel Farage was the \"political right's last hope\". A shadow cabinet member at the time of his defection on 15 September 2025, he said the flame of conservatism was passing to a new torch and he \"fervently\" hoped the next PM was Mr Farage. He is Reform's head of preparing for government, and distanced himself from remarks two months previously when he said Reform would \"spend money like drunken sailors\". 12. Nadine Dorries The former culture secretary, who stepped down as the Mid Bedfordshire MP in 2023, was the highest-profile Tory to join Reform at the time, on 4 September 2025. She said the Conservative Party is \"dead\" and \"cannot win the next election\" as she said it \"removes election-wining prime ministers and replaces them with duds\", in reference to Boris Johnson being replaced by Liz Truss, then Rishi Sunak. 11. Adam Holloway Gravesham in Kent's MP for 19 years until losing the seat in 2024, Mr Holloway defected on 30 July 2025, as he said Reform was the only party that has grasped \"the scale of our national peril\". The former army officer said the moment he decided was when Kemi Badenoch told Sky News' Trevor Phillips there were \"real differences\" between Reform and the Tories - \"and she was right\". 10. Sir Jake Berry The ex-Tory party chair defected on 9 July 2025, as he said the Conservatives had \"lost their way\", and the only way to get a country people can be proud of again \"is with Reform in government\". He lost his Rossendale and Darwen seat to Labour in 2024, after serving as a minister during Boris Johnson, Theresa May and Liz Truss's governments - a reason he said he knew who had \"broken\" Britain. 9. David Jones The Welsh secretary under David Cameron and a Brexit minister under Theresa May revealed on 7 July 2025 he had left the Conservative Party in October the year before - three months after standing down as Clwyd West's MP - and was joining Reform as it is \"the party that best represents my views\". He said he joined Reform as a \"private individual\" and had no intention of standing for election. He was the most senior ex-Tory MP to join Reform at the time. 8. Anne Marie Morris Having lost the Tory whip twice - once for using the n-word in a Brexit debate - then losing her Newton Abbott seat to the Liberal Democrats in 2024, she defected to Reform on 2 July 2025. She heads up Reform's social care policy and said the party \"offers the vision and leadership Britain so badly needs\". 7. Ross Thomson Less than a year after claiming the Conservatives were the only ones to see off the \"threat\" from Mr Farage, the former Aberdeen MP joined Reform on 24 June 2025. He had stayed out of the limelight after standing down as an MP in 2019, but said \"only Reform have the courage and answers to issues facing Scotland and the UK\". 6. Alan Amos The Tory MP for Hexham in the late 1980s and early 1990s - stepping down after accepting a police caution for indecency on Hampstead Heath - settled on Reform after becoming a Labour councillor, then an independent, then a Conservative mayor in Worcester. He was elected as a Reform councillor for Worcestershire County Council in May 2025 after being approached by the party, which he said he has \"much in common\" with. 5. Marco Longhi After a five-year stint as the Conservative MP for Dudley North, losing it to Labour in 2024, Boris Johnson's former trade envoy to Brazil defected to Reform on 3 January 2025. He said \"the party of Churchill and Thatcher has transformed into something unrecognisable\" and said he planned to stand for election again. 4. Aidan Burley A former ministerial aide and MP for Cannock Chase from 2010-2015, Mr Burley joined Reform on 10 December 2024, prompting Mr Farage to suggest it was \"death by a thousand defections\" for the Tory party. Mr Burley was sacked from his government job after attending a Nazi-themed stag do in France, where he bought a Nazi uniform for the groom to wear and the groom's brother gave a Nazi-themed toast. He said they were \"mocking\" the Nazis and there was \"no malicious intent\". 3. Dame Andrea Jenkyns The former assistant government whip and MP for Morley and Outwood in West Yorkshire for nearly a decade, until she lost her seat in 2024, defected on 28 November 2024. She was engaged in a bitter public row with Reform's deputy leader Richard Tice earlier that year before switching. Dame Andrea, the Reform mayor of Lincolnshire since May 2025, said she had \"always respected\" Mr Farage and said they were \"politically aligned\". 2. Lucy Allan The former Tory MP defected after announcing she was backing a Reform candidate to replace her in her Telford seat in 2024, saying he would offer an alternative to \"more of the same politics\". She was suspended from the Tories immediately, on 27 May 2024, but claimed she had already resigned to support Alan Adams. 1. Lee Anderson The former Conservative Party vice-chair became Reform's first ever MP after switching sides on 11 March 2024, a month after having the Tory whip suspended over comments about London Mayor Sadiq Khan, which were condemned as Islamophobic. He said he joined Reform as \"I want my country back\" and said his parents, who live in his Ashfield constituency, told him they would not be able to vote for him if he remained a Conservative. He was voted in as a Reform MP for Ashfield in the 2024 general election, being made Reform's chief whip shortly afterwards."
    },
    {
        "title": "Iranian ambassador summoned over country's response to protests",
        "description": "Yvette Cooper has confirmed the government has summoned the Iranian ambassador in a statement to the Commons.",
        "url": "https://news.sky.com/story/iranian-ambassador-summoned-over-countrys-response-to-protests-13493754",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iran-protests_7133560.jpg?20260112162720",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-13 15:05:00",
        "Headline": "The Reuters news agency says Iran acknowledged around 2,000 deaths during two weeks of protests sparked by a widening economic crisis. ",
        "Content": "Yvette Cooper has confirmed the government has summoned the Iranian ambassador in a statement to the Commons. The foreign secretary has said her colleague, the Middle East minister, Hamish Falconer, summoned the Iranian representative in the UK \"to underline the gravity of this moment and to call Iran to answer for the horrific reports that we are hearing\". The Reuters news agency says around 2,000 people have been killed during widespread protests, according to an Iranian official. Politics live - follow latest Protests sparked by a widening economic crisis have spread across the country since December. The Human Rights Activists News Agency says over 10,000 people have been arrested. Ms Cooper told MPs that \"horrific reports suggest that potentially thousands of people have been killed\" while \"protesting for change\", and that due to a \"total internet shutdown\" in Iran on 8 January, \"the full facts are not yet clear\". \n                  Trump makes Iran pledge as more than 2,000 protesters reported killed\n                 \n                  A sculptor, a teenage footballer and a hairdresser: Here are the stories of some of those killed in Iran protests\n                 \n                  Verifying protests and deaths in Iran - amid brutal crackdown and internet shutdown\n                 But she added: \"I am fearful that the reports we have seen may underestimate the full horror as further evidence and testimony reaches the outside world.\" 'UK condemns brutal killings in the strongest terms' In a strongly worded warning, Ms Cooper said: \"The United Kingdom condemns in the strongest terms the horrendous and brutal killing of Iranian protesters, and we demand that the Iranian authorities respect the fundamental rights and freedoms of their citizens.\" The cabinet minister told the Commons she spoke to her Iranian counterpart, Abbas Araghchi, on Monday to warn him to stop. But she also recognised that recent events in Iran are \"no outlier\" from the regime's past behaviour, which she said included \"backing... terrorist and extremist proxies\" such as Hamas, Hezbollah and the Houthis. The foreign secretary also accused Iran of carrying out activities that pose \"danger to dissidents, journalists and the Jewish community here in the UK\", and said Britain's security services had discovered more than 20 \"potentially lethal Iran-backed plots over the last year alone\". Case of Britons jailed in Iran raised 'just yesterday' The minister added that the UK \"will not tolerate any Iran-backed threats on UK soil\", and pointed to the country being placed on the enhanced tier of the Foreign Influence Registration Scheme. She also highlighted a review she commissioned into what more needs to be done to apply counterterrorism-style powers to state threats, and confirmed the government will take forward its recommendations. Iran latest - follow live Ms Cooper also said the government would \"ensure the safety and security of our citizens in Iran\", and added she had raised the case of imprisoned Britons Craig and Lindsay Foreman \"just yesterday\". She said the government would continue to put \"coordinated economic and diplomatic pressure on this regime\". Ms Cooper announced plans for \"full and further sanctions\" against Iran that target finance, energy, transport, software and other significant industries. Tories question why government response has taken so long Responding to the minister's statement, Dame Priti Patel asked why the government had not summoned the Iranian ambassador sooner. The shadow foreign secretary also asked where \"the government's resolve to stand up to Iran and back those protesting?\" She warned that the UK \"cannot let their dreams be buried as we mourn the victims of Tehran's atrocities\" and that \"if change comes [in Iran], we should be ready to support this change\". Dame Priti also asked if the government has spoken to and is \"aligned\" with the US administration, and questioned whether ministers have considered using UK or US military bases \"to stop the brutality of the Iranian regime\"."
    },
    {
        "title": "Guantanamo Bay detainee to get 'substantial' sum from UK government - as Badenoch criticises use of taxpayers' money ",
        "description": "A Guantanamo Bay detainee will be paid a \"substantial\" sum as he settles a legal claim against the UK government, his lawyers have said, as Kemi Badenoch said UK taxpayers' cash was being handed to a \"terror suspect\". ",
        "url": "https://news.sky.com/story/guantanamo-bay-detainee-to-get-substantial-sum-from-uk-government-as-badenoch-criticises-use-of-taxpayers-money-13493600",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-abu-zubaydah-cia-guantanamo_7134306.jpg?20260113145552",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-13 07:14:00",
        "Headline": "Abu Zubaydah has been detained by the US authorities since his capture in 2002, and in 2006 was sent to Guantanamo Bay in Cuba where he has remained ever since.",
        "Content": "A Guantanamo Bay detainee will be paid a \"substantial\" sum as he settles a legal claim against the UK government, his lawyers have said, as Kemi Badenoch said UK taxpayers' cash was being handed to a \"terror suspect\".  Abu Zubaydah, 54, has been detained by US authorities since his capture in Pakistan 2002 in the aftermath of the 9/11 terror attacks, and in 2006 was sent to Guantanamo Bay in Cuba where he has remained ever since. Mr Zubaydah, a Palestinian born in Saudi Arabia, who was accused at the time of being a high-ranking member of al Qaeda, is said to have been tortured by the CIA, including by being waterboarded 83 times in a month, and facing beatings and extreme sleep deprivation. He brought legal action against the Foreign, Commonwealth and Development Office and the Home Office, as agencies liable for MI6 and MI5, as well as the attorney general. The High Court previously heard Mr Zubaydah claimed he was \"arbitrarily detained\" at CIA-run \"black site\" prisons in Thailand, Poland, Morocco, Lithuania and Afghanistan, where he was \"subjected to extreme mistreatment and torture\". Mr Zubaydah claimed that the UK security and intelligence services sent questions to the CIA, despite being aware of how he was being treated. Read more from Sky News:PM threatens to 'control' Grok if X keeps creating sexual imagesFootballer who made history by coming out as gay accuses old club of homophobia Commenting on the agreed payout, Conservative leader Ms Badenoch said on X: \"We knew Labour's Attorney General Richard Hermer defended IRA terrorist Gerry Adams and ISIS bride Shamima Begum, now we see he helped win a 'substantial' sum of UK taxpayers' cash for a terror suspect. \"How can a man who aides Britain's enemies be a part of Britain's government?\" Hermer was actioned on behalf of the the advocacy group Liberty in the Begum case. A source close to the attorney general said: \"Without commenting on individual cases, the government's robust conflict process would clearly preclude Law Officers having any involvement in cases in which they were instructed for other parties prior to appointment.\" Shadow chancellor Robert Jenrick said on X, in a post accompanied by an open letter to Justice Secretary David Lammy: \"Abu Zubaydah is held in Guantanamo, accused of training terrorists and working for Bin Laden. \"The Attorney General was his lawyer. And now Starmer is using taxpayers' money to give him a massive payout. \"What's going on?\" In a letter, Mr Jenrick asked if there was a court judgment for the payout and whether it has been appealed. He added: \"How can it possibly be a priority to give him taxpayers' money?\" A government source accused Jenrick of \"rampant hypocrisy\" for highlighting the previous careers of ministers while \"choosing to ignore\" that Tory shadow attorney general Lord Wolfson is currently acting as a lawyer for Roman Abramovich. During the legal battle, the Foreign and Home offices neither admitted nor denied that they knew where Mr Zubaydah was being detained from time to time, nor that they were aware of how he was being treated. They had previously argued they couldn't publicly admit or deny details about Mr Zubaydah for national security reasons. On Sunday, Mr Zubaydah's lawyers announced a settlement had been reached between him and the UK government, with the exact amount to remain confidential. His international counsel Professor Helen Duffy said: \"The payment is significant, but clearly insufficient to meet the UK's obligations. More must be done to bring this chapter to an end. \"Critically, the UK should seek to facilitate the immediate release of Abu Zubaydah, and other prisoners held without charge or trial at Guantanamo.\" She added: \"This case is deeply relevant today, as some states ride roughshod over international law, and the world looks to others to respond. \"There are critical lessons about the cost of cooperating with the US or other allies flouting international norms.\" Prof Duffy continued: \"This settlement is a step in that direction and long overdue. But it is flimsy justice while his rights continue to be violated at Guantanamo and responsible states look the other way.\" Sky News has approached the Foreign Office and the Ministry of Justice for comment."
    },
    {
        "title": "Peter Mandelson apologises for continuing friendship with Jeffrey Epstein - days after refusing to do so",
        "description": "Lord Mandelson has apologised for continuing to be friends with Jeffrey Epstein even after the paedophile financier's first conviction - days after refusing to do so.",
        "url": "https://news.sky.com/story/peter-mandelson-apologises-for-continuing-friendship-with-jeffrey-epstein-days-after-refusing-to-do-so-13493610",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-peter-mandelson-jeffrey-epstein_7016023.jpg?20250910115707",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-13 07:41:00",
        "Headline": "The former UK ambassador to the US says he was \"wrong to believe\" Epstein - but insists he was \"ignorant\" of the paedophile financier's crimes.",
        "Content": "Lord Mandelson has apologised for continuing to be friends with Jeffrey Epstein even after the paedophile financier's first conviction - days after refusing to do so. In a statement to Sky News, the UK's former ambassador to the US said he would like to \"apologise unequivocally\" for remaining friends with Epstein, who in 2008 pleaded guilty to two charges including soliciting prostitution from a minor. It comes after Lord Mandelson was sacked as ambassador in September by Prime Minister Sir Keir Starmer as historic emails between him and Epstein were published, revealing the pair's relationship was \"materially different\" to what he had disclosed to the government. Politics latest - follow live  He had earlier refused to apologise to Epstein's victims in his first interview since his sacking on Sunday. He was asked by the BBC if he would like to apologise for continuing his relationship - and refused to do so, saying: \"If I had known, if I was in any way complicit or culpable, of course I would apologise. \n                  Clintons refuse to testify in Republican-led Epstein investigation, risking contempt proceedings\n                 \n                  Andrew's daughters join Royal Family in Sandringham without their father on Christmas Day\n                 \n                  Over a million more documents potentially related to Epstein case uncovered\n                 \"But I was not culpable, I was not knowledgeable for what he was doing, and I regret, and will regret to my dying day, the fact that powerless women were not given the protection they were entitled to expect.\" That response led to outrage, including from minsters. Read more: Who is Peter Mandelson and what do we know about his relationship with Jeffrey Epstein? Lord Mandelson has now changed course with an apology. In a fresh statement, he said: \"At the weekend, I gave an interview to the BBC. In answering questions about my association with Jeffrey Epstein I did not want to be held responsible for his crimes of which I was ignorant, not indifferent, because of the lies he told me and so many others. \"I want to say loudly and clearly that I was wrong to believe him following his conviction and to continue my association with him afterwards. I apologise unequivocally for doing so to the women and girls who suffered.\" The peer continued to deny he was aware of Epstein's crimes, having previously claimed that the disgraced financier did not share the details of his sex life with him because he is gay. Lord Mandelson continued: \"I was never culpable or complicit in his crimes. Like everyone else, I learned the full truth about him after his death. \"But his victims did know what he was doing, their voices were not heard, and I am truly sorry I was amongst those who believed him over them.\" There have been calls for Lord Mandelson to be stripped of his right to sit in the House of Lords as a Labour peer, with the SNP launching a fresh campaign to so this week."
    },
    {
        "title": "The government invited us on an immigration raid. There were two arrests, they both walked free",
        "description": "Three vans roll out of a car park in Croydon. Inside, South London&#8217;s immigration enforcement team have a list of targets. Their role is to arrest illegal workers. &#160;",
        "url": "https://news.sky.com/story/theres-still-a-long-way-to-go-inside-the-home-offices-crackdown-on-illegal-migration-13493970",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-immigration-raid_7134676.png?20260113221300",
        "type": "Politics",
        "Author": "Jason Farrell",
        "Date Published": "2026-01-13 21:20:00",
        "Headline": "The Home Office has ramped up its enforcement operations to combat illegal migration and wanted to show its work off to us. But in one morning, with a large team, there were only two arrests, and they were both released.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n Three vans roll out of a car park in Croydon. Inside, South London’s immigration enforcement team have a list of targets. Their role is to arrest illegal workers.   We've been invited because the Home Office is keen to promote an increase in arrests in the 18 months since the Labour government came to power - up 83%. But will this have an impact on the government's aim to crack down on illegal migration? The first stop is a car wash in Lewisham. A business that has previously employed illegal workers. The team has intelligence they are doing so again. On arrival it's raining, there is no car washing and just two employees sit in the dry. Both are Romanian and their employment status is legitimate. The boss, Amir Neziraj, says they've learned their lesson after being fined £30,000 a few years ago. He explains that, at that time, the rogue employees used fake passports. He added: \"Obviously now you've got all the online stuff. You can check people's status. I don't want to be racking up fines. We are fully legit.\" He tells the immigration officers: \"You can always come and have a look guys.\" 'Both the workers are illegal' We move on to the next target, a nail bar in Catford. The team make visits based on intelligence, which could come from the Home Office, trading standards, police officers or members of the public. It is suspected that the beauty salon is employing illegal Chinese workers. The shop is on a pedestrianised high street and on our arrival two Chinese women are conducting treatments on clients. That soon comes to a stop as the officers interview them through interpreters on the other end of a phone. After checking Home Office records, the team establishes both workers are illegal. Operation Lead Sarah Allen tells me: \"Ultimately, what we're seeking to do is remove people from the UK, those not entitled to be here and not entitled to work in the UK. \"Sometimes we're able to do that very quickly. Other times we need to make sure that we put people on bail, keep them in contact with us so that we can help them and support them through any application process to remove them.\" Often these workers are being exploited, trafficked or sold an image of the UK that doesn't reflect the reality. Many are just trying to get back while being stuck in a backlogged system. Immigration officers will only detain people if they can determine the individual can be removed from the country relatively quickly. Often there are barriers. The two Chinese illegal workers are arrested but allowed to walk free on what is called immigration bail. 'We've got to keep going at this' Home Office Minister Mike Tapp, who joined the raid, says even if they can't be deported, the arrests are still worthwhile. He told me: \"They will have to report in - so we've got that closer control of these people. There's also the process that they've got to go through. \"When we came in, that whole processing in the system had ground to a halt, that backlog is down. We've reduced those cases by 39%. \"So, we've got to keep going at this. There's still a long way to go. But today is an important demonstration of how seriously we're taking this.\" Read more from Sky News:All the ex-Conservative MPs who defected to ReformGuantanamo Bay detainee to get 'substantial' sum from UK There have been 12,300 arrests for illegal working since this government came to power. So far 15% of those have been removed from the UK. Those on immigration bail could face fines for working illegally but the big financial penalties are often for the employers - which can now amount to £60,000 per illegal worker. Ultimately the aim is to send a message that there is no black market economy available to illegal migrants and thus reduce the pull-factor for those considering the journey. The Home Office has released videos of arrests made across the country, but from our experience in South London, intelligence isn't always accurate; one premises we attempted to raid was closed for the day. Ultimately in one morning, with a large team, there were only two arrests, and they were released."
    },
    {
        "title": "Grok controversy: Everything you need to know about X's sexual AI image scandal",
        "description": "Social media platform X is under pressure after reports that its AI chatbot Grok has allowed users to create sexual images of women and children.",
        "url": "https://news.sky.com/story/grok-controversy-everything-you-need-to-know-about-xs-sexual-ai-image-scandal-13493882",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-grok-x-ai-artificial-intelligence_7131783.jpg?20260110083021",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-13 16:54:00",
        "Headline": "Elon Musk's X is under fire globally after users started exploiting its AI chatbot to make sexual images of real people.",
        "Content": "Social media platform X is under pressure after reports that its AI chatbot Grok has allowed users to create sexual images of women and children. Images are being generated by X's AI tool Grok, which manipulates photos of real people, often removing their clothes or making them pose in suggestive ways. Elon Musk's platform is under heavy scrutiny worldwide, including from the UK government. Here's what you need to know. How did the controversy begin? A significant number of X users started reporting examples of Grok altering images to sexualise real women and children towards the end of December and into the new year. On public X posts that include photos, users can comment asking Grok to edit the image however they want. Grok can also be used to create images privately. Last summer, a so-called \"spicy mode\" was introduced, specifically aimed at helping users generate sexually explicit images. \n                  Starmer threatens to 'control' Grok if Elon Musk's X keeps creating sexual images\n                 \n                  How Iran enforced internet blackout and how Elon Musk could be involved in attempts to overcome it\n                 \n                  Creating AI sexualised images to become criminal offence this week\n                 AI bots have safety features designed to reject inappropriate prompts, but reports suggest Grok has been failing to deny users who are in breach of its own rules. It is not known for how long Grok has allowed real photos of people to be sexualised, but the problem had become widespread by early January, with users able to generate images by using requests such as: \"Put her in a transparent bikini.\" An investigation by Reuters news agency found that over a single 10-minute period on 2 January, X users asked Grok to digitally edit photographs of people so that they would appear to be wearing bikinis at least 102 times. It said the majority of those targeted were young women, but in a few cases, they were men, sometimes celebrities and politicians. On the same day, X boss Elon Musk posted laugh-cry emojis in response to AI edits of famous people - including himself - in bikinis. He responded with the same emoji when one X user said their social media feed resembled a bar packed with bikini-clad women. How has the UK government reacted? Prime Minister Sir Keir Starmer has been critical of X over the images, calling the exploitation of Grok \"absolutely disgusting and shameful\". \"If X cannot control Grok, we will - and we'll do it fast because if you profit from harm and abuse, you lose the right to self-regulate,\" he told a meeting of the Parliamentary Labour Party on 12 January. \"Protecting their abusive users, rather than the women and children who are being abused, shows a total distortion of priorities. \"So let me be crystal clear, we won't stand for it, because no matter how unstable or complex the world becomes, this government will be guided by its values. We'll stand up for the vulnerable against the powerful.\" His technology secretary Liz Kendall has moved forward a bill to make the creation of non-consensual intimate images with AI a criminal offence. The Data (Use and Access) Act was passed last year, with sections of the act being implemented slowly. But Ms Kendall said the section making it a criminal offence to create or request the creation of non-consensual intimate images will be brought forward to this week. The Crime and Policing Bill, which is going through parliament, will make it a criminal offence for companies to supply tools designed to create non-consensual internet images. Ms Kendall said this would be \"targeting the problem at its source\". Additionally, media watchdog Ofcom has launched a formal investigation into Grok, including whether X has \"failed to comply with its legal obligations under the Online Safety Act\". X and Grok face global condemnation  Ministers in France reported X to prosecutors and regulators on 2 January, saying the \"sexual and sexist content\" was \"manifestly illegal\". Officials in other European countries, including Germany, Italy and Sweden, have also condemned X. On 5 January, European Commission spokesperson Thomas Regnier said it was \"well aware\" that Grok was being used for \"explicit sexual content with some output generated with child-like images\". \"This is not spicy. This is illegal. This is appalling. This is disgusting. This is how we see it, and this has no place in Europe. This is not the first time that Grok is generating such output,\" he said. India's government then accused Grok of \"gross misuse\" of AI and serious failures in its safeguarding, and handed it a 72-hour deadline to remove all inappropriate content, or risk bigger legal problems. An update has not been provided by the Indian government. The Malaysian government announced it was temporarily blocking X on 11 January, citing \"repeated misuse\" of the tool to generate \"obscene, sexually explicit, indecent, grossly offensive, and non-consensual manipulated images\". Grok's generated content could also face investigations in Australia and Brazil, according to officials. How has X responded? The developer of Grok and X's parent company, xAI, has said it has put restrictions in place that mean only paid subscribers are able to use image generation and editing features on the platform. X says it takes action against illegal content on the platform, including child sexual abuse material, by removing it, permanently suspending accounts, and working with local governments and law enforcement as necessary. Mr Musk also added that anyone using Grok to make illegal content would suffer the same consequences as if they uploaded illegal content. Read more:Manchester United star's X account hackedConservatives pledge to ban social media for under-16s However, in response to ministers' threats that X could be banned in the UK if it did not act on concerns about its AI chatbot, the billionaire tech mogul accused the UK government of being \"fascist\" and trying to curb free speech. Responding to a post on X claiming the UK arrests more people for social media posts than \"any other country on Earth,\" Mr Musk wrote: \"Real fascism is arresting thousands of people for social media posts.\" Why is X being singled out?  Mr Musk has hit back at critics of Grok, saying they \"want any excuse for censorship\" and sharing a post which suggested \"millions\" of other apps can make sexualised images of people. AI technology that can digitally undress people has been around for years, but until recently was less accessible. They also typically required a certain level of effort or payment. X is facing scrutiny in the UK over a number of existing and incoming regulations... The Data (Use and Access) Act: Having been passed last year, sections of the Data (Use and Access) Act are slowly being implemented in the UK. One of the most obvious is the criminalisation of creating non-consensual intimate images with AI, which Technology Secretary Liz Kendall announced was being brought forward on 12 January. Overall, the act aims to make changes to the UK’s protection and privacy legislation in order to make the rules simpler for organisations, encourage innovation, help law enforcement agencies to tackle crime and allow responsible data-sharing while maintaining high data protection standards.\n The Criminal and Policing Bill: This bill, which is currently going through parliament, will introduce a range of measures aimed at addressing anti-social behaviour, sexual offences and knife crime, among other things. Under the bill it will become illegal for companies to supply tools designed to create non-consensual internet images.\n The Online Safety Act: Hours after the government announced plans to criminalise the creation of AI sexualised images, media watchdog Ofcom said it has launched an investigation into whether X has \"failed to comply with its legal obligations under the Online Safety Act\". The act, which began being fully enforced in July last year, states that online platforms have to make sure they're not hosting illegal content. It aims to hold platforms responsible for illegal content such as self-harm material, child sexual abuse images and non-consensual explicit images. Announcing its investigation into Grok, the regulator said: “There have been deeply concerning reports of the Grok AI chatbot account on X being used to create and share undressed images of people - which may amount to intimate image abuse or pornography - and sexualised images of children that may amount to child sexual abuse material.\" If X is found to not comply with the Online Safety Act, Ofcom can issue a fine of up to 10% of its worldwide revenue or £18m, and if that is not enough, can go as far as getting a court approval to block the site. Experts say Grok's technology and easy interface have lowered the barrier to entry, and many of its generated images are instantly made public. Three experts who have followed the development of X's policies around AI-generated explicit content told Reuters that the company had ignored warnings from civil society and child safety groups, including a letter sent last year warning that xAI was only one small step away from unleashing \"a torrent of obviously nonconsensual deepfakes.\" Tyler Johnston, the executive director of The Midas Project, an AI watchdog group that was among the letter's signatories, said: \"In August, we warned that xAI's image generation was essentially a nudification tool waiting to be weaponised. \"That's basically what's played out.\" Dani Pinter, the chief legal officer at the US's National Centre on Sexual Exploitation, said X failed to pull abusive images from its AI training material and should have banned users requesting illegal content. \"This was an entirely predictable and avoidable atrocity,\" Ms Pinter said."
    },
    {
        "title": "New study finds astronauts' brains change after space travel",
        "description": "New research into the health effects of spaceflight has shown astronauts' brains change position and shape over time.",
        "url": "https://news.sky.com/story/new-study-finds-astronauts-brains-change-after-space-travel-13493682",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-astronaut-nasa_7134146.jpg?20260113124021",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-13 10:58:00",
        "Headline": "Following spaceflight, the brain shifts \"upward and backward within the skull\", with sensory and motor regions showing the largest shifts, the study found.",
        "Content": "New research into the health effects of spaceflight has shown astronauts' brains change position and shape over time. Following spaceflight, the brain shifts \"upward and backward within the skull\", with sensory and motor regions showing the largest shifts, the study found. \"There are also regional, nonlinear lateral deformations that differ between the superior and inferior portions of the brain,\" the research, published on Monday in the journal Proceedings of the National Academy of Sciences, reported. The researchers looked at MRI scans from 26 astronauts prior and after their time in space. It then compared the results with the scans of 24 civilian participants on Earth who were placed in a \"long-duration head-down tilt bed rest\". Scientists found similar changes to the brains' shape and positions in the civilian participants, but the astronauts' brains exhibited greater upward shift. \"The health and human performance implications of these spaceflight-associated brain displacements and deformations require further study to pave the way for safer human space exploration,\" the study said, adding: \"Although most of the brain deformation recovered over six months post-flight, some persisted.\" \n                  Grok controversy: Everything you need to know about X's sexual AI image scandal\n                 \n                  HPMC gel restores sight to people with untreatable condition, scientists say\n                 \n                  Could X be banned in UK following the row over Elon Musk's Grok?\n                 Rachael Seidler, a professor in the department of applied physiology and kinesiology at the University of Florida and a co-author of the study, told Sky News' US partner network NBC: \"We need to understand these changes and their impacts to keep astronauts safe and healthy and protect their longevity.\" Read more from Sky News: NASA mega-rocket for moon mission could launch in weeksThe 40 jobs 'most at risk' from AI - and 40 it can't touch  Speaking of how the amount of time spent in space also appeared to have an impact on the brain, Professor Seidler said: \"The people who went for a year showed the largest changes. \"There were still some changes evident in people who went for two weeks, but duration seems to be the driving factor.\""
    },
    {
        "title": "K-pop stars BTS reveal comeback tour after completing military service",
        "description": "K-pop superstars BTS have announced details of their much-anticipated comeback tour, after a break of almost four years to complete mandatory military service.",
        "url": "https://news.sky.com/story/k-pop-stars-bts-reveal-comeback-tour-after-completing-military-service-13493833",
        "image_url": "https://e3.365dm.com/22/10/1920x1080/skynews-bts-k-pop_5923285.jpg?20221007134644",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-13 15:33:00",
        "Headline": "In South Korea, men aged between 18 and  28 are required by law to complete military service.",
        "Content": "K-pop superstars BTS have announced details of their much-anticipated comeback tour, after a break of almost four years to complete mandatory military service. Details released say the band is set for \"world domination\", playing 79 shows across Asia, North America, Europe, Latin America and Australia between April this year and March 2027 - the highest ever number for a South Korean artist. The tour includes two dates in London in July. In South Korea, all able-bodied men aged 18 to 28 are required by law to complete 18-21 months of military service, a system designed to deter any threat of aggression from rival North Korea. After announcing a hiatus, the BTS bandmates - RM, Jin, Jimin, V, Suga, Jung Kook and J-hope - carried out theirs in separate stints between 2022 and 2025. Jin, the eldest member, was the first to finish his enlistment duties in 2024, while rapper and songwriter Suga became the final member to be discharged in June last year. Suga worked as a social service agent, while the other six members served in the army. BTS - an acronym of Bangtan Sonyeondan, or Beyond the Scene - are the biggest-selling music act in South Korean history, having sold more than 40 million albums, and the first non-English speaking group to sell out Wembley Stadium. They were also the first K-pop act to secure a Grammy nomination, and now have five in total. In the UK, they have had four top 10 singles and two number one albums, and are known for songs such as Butter, Dynamite and Life Goes On - as well as collaborations with artists such as Charli XCX, Coldplay and Halsey. Read more from Sky News:New study finds astronauts' brains change after space travelThe mega-deal shaking up Hollywood explained Rumours of a comeback began on New Year's Day, when the band reset their official Instagram account. Ahead of the tour, their fifth full-length album will be released on 20 March. The record, which was made in the second half of 2025, will reflect on the group's journey together and include 14 tracks. Before the announcement, BTS sent handwritten letters to members of their fanbase, named Army, across the world, notifying them of a return. Pictures of the bandmates back together are yet to be released."
    },
    {
        "title": "Australian author Craig Silvey charged with possessing and distributing child exploitation material",
        "description": "Australian author Craig Silvey has been charged with possessing and distributing child exploitation material.",
        "url": "https://news.sky.com/story/australian-author-craig-silvey-charged-with-possessing-and-distributing-child-exploitation-material-13493704",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-runt-craig-silvey_7134044.jpg?20260113170103",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-13 11:56:00",
        "Headline": "Detectives say they found the man actively engaging with other child exploitation offenders online when they arrived at his Fremantle home on Monday.",
        "Content": "Australian author Craig Silvey has been charged with possessing and distributing child exploitation material. Western Australia Police Force said detectives executed a search warrant at a property on Monday. It is alleged officers found a 43-year-old man actively engaging with other child exploitation offenders online when they arrived. He was arrested, the force said, and his electronic devices were seized. The man was charged with possessing and distributing child exploitation material. The force added in a statement that the man would appear at Fremantle Magistrates Court on Tuesday. Australia's Channel 9 reported that Silvey faced a Perth court on Tuesday afternoon in relation to the charges. He didn't enter a plea and was granted bail, due to be back in court next month. Silvey is best known for his book Jasper Jones, which sold more than half a million copies, is often assigned for reading in schools, and was made into a film starring Toni Collette in 2017. It also won the Australian Book Industry Awards Book of the Year and was also shortlisted for the International Dublin Literary Awards and the Miles Franklin Literary Award. A 2025 book by Silvey, called Runt And The Diabolical Dognapping, was Australia's number one \"best-selling children's book\" according to its publisher Allen & Unwin. That book was a sequel to his 2022 novel Runt, which was also adapted into a film starring Celeste Barber. In a statement, Allen & Unwin told Sky News: \"Allen & Unwin is aware of serious charges brought against author Craig Silvey in Fremantle this week. \"The nature of the allegations is deeply distressing. Our thoughts and sympathies are with all survivors of child exploitation and their families. \"We acknowledge this is an active police matter, and that Mr Silvey is entitled to procedural fairness and a presumption of innocence until the matter is dealt with by a court. \"Given the gravity of the charges, Allen & Unwin will pause promotional activity of Mr Silvey's work while the legal process takes its course. \"We are unable to provide further comment while this matter is before the courts.\""
    },
    {
        "title": "BBC to file motion to dismiss Trump defamation lawsuit over Panorama edit, court documents show",
        "description": "The BBC will take steps to have Donald Trump's lawsuit over a January 6 Panorama edit thrown out, court documents show.",
        "url": "https://news.sky.com/story/bbc-to-file-motion-to-dismiss-trump-defamation-lawsuit-over-panorama-edit-court-documents-show-13493569",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-republicans_7128190.jpg?20260106152713",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-13 03:30:00",
        "Headline": "The broadcaster has asked the court to effectively halt parties from most evidence-gathering, pending the decision on the motion.",
        "Content": "The BBC will take steps to have Donald Trump's lawsuit over a January 6 Panorama edit thrown out, court documents show. The US president filed a defamation lawsuit over the broadcaster's editing of a speech he made in 2021, on the day his supporters stormed the Capitol building. Clips were spliced together from sections of the US president's speech to show him saying: \"We're going to walk down to the Capitol... and I'll be there with you. And we fight. We fight like hell.\" It aired in the near-hour-long documentary Trump: A Second Chance?, which was broadcast by the BBC the week before the US election. The US president is seeking damages of $5bn (£3.7bn) under a defamation lawsuit. He has also sued for $5bn for alleged violation of a trade practices law. Both lawsuits were filed in Florida. A BBC spokesperson said in a statement: \"As we have made clear previously, we will be defending this case. We are not going to make further comment on ongoing legal proceedings.\" Court documents show the broadcaster will file a motion to dismiss the lawsuits, claiming the Florida court lacks \"personal jurisdiction\" over the organisation, that the court venue is \"improper\", and that Mr Trump has \"failed to state a claim\". Read more:Trump v the BBC: Everything you need to know Arts and entertainment correspondent The BBC is fighting back. If you read the legal filings and the grounds for which the corporation seeks to dismiss the case, they are convincing. At the heart of their argument is the location at which this case has been filed: Florida. For a lawsuit against a British broadcaster, this has never made much sense. They state that Trump's own legal team has provided a link to the Panorama episode that simply couldn't be watched by viewers in the US, unless they used a VPN. Will it be enough for it to be thrown out? This was always a curious case but don't forget for Trump whether he succeeds or fails doesn't really matter - this is designed to exert pressure, a high-profile warning shot to those who are critical about him personally and his administration. Even if Trump doesn't get his billions, the litigation is a form of leverage. But for a public service broadcaster, ultimately answerable to taxpayers, this is all the more embarrassing and painful to be caught up in.\n \n Given the prolonged uncertainty and significant legal costs, the BBC really needs to shut this down. The corporation will argue that it did not create, produce or broadcast the documentary in Florida and that Mr Trump's claim the documentary was available in the US on streaming service BritBox is not true. It will also claim the president has failed to \"plausibly allege\" the broadcaster published the documentary with \"actual malice\". The BBC has asked the court to effectively halt parties from most evidence-gathering, pending the decision on the motion. The broadcaster apologised to the US president in November for an \"error of judgement\", but said it disagreed there was \"a basis for a defamation claim\". The fallout from the saga led to the resignation of both the BBC director-general Tim Davie and the head of news Deborah Turness. If the case should continue, a 2027 trial date has been proposed."
    }
]