[
    {
        "title": "Trump criticises Putin after deadly strikes across Ukraine",
        "description": "Donald Trump has threatened Russia with more sanctions after a series of deadly strikes across Ukraine, as he said of Vladimir Putin: \"What the hell happened to him?\"",
        "url": "https://news.sky.com/story/trump-criticises-putin-after-deadly-strikes-across-ukraine-13374767",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-vladimir-putin_6886237.jpg?20250414105847",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-25 22:34:00",
        "Headline": "Despite the US president talking up the chances of a peace deal, Russia launched the biggest aerial bombardment of the war so far on Sunday night. Three children were among those killed, as Ukraine's Volodymyr Zelenskyy called on allies for more support.",
        "Content": " Donald Trump has threatened Russia with more sanctions after a series of deadly strikes across Ukraine, as he said of Vladimir Putin: \"What the hell happened to him?\" The US president appeared aghast at the conduct of his counterpart in the Kremlin after drone and missile attacks in Kyiv and other Ukrainian cities left 12 people dead and dozens more injured. Trump criticises Putin - latest updates Speaking to reporters at an airport in New Jersey ahead of a flight back to Washington, Mr Trump said: \"I'm not happy with Putin. I don't know what's wrong with him.\" \"He's killing a lot of people,\" he added. \"I'm not happy about that.\" Mr Trump - who said he's \"always gotten along with\" Mr Putin - told reporters he would consider more sanctions against Moscow. \"He's sending rockets into cities and killing people, and I don't like it at all,\" he said. Later, on his Truth Social platform, the US president wrote that he has \"always had a very good relationship with Vladimir Putin of Russia, but something has happened to him. He has gone absolutely CRAZY!\" \"He is needlessly killing a lot of people... I've always said that he wants ALL of Ukraine, not just a piece of it, and maybe that's proving to be right, but if he does, it will lead to the downfall of Russia!\" Mr Trump also criticised Volodymyr Zelenskyy, saying the Ukrainian president was \"doing his country no favours by talking the way he does. Everything out of his mouth causes problems, I don't like it, and it better stop\". Ukraine said the barrage of strikes overnight into Sunday was the biggest aerial attack of the war so far, with 367 drones and missiles fired by Russian forces. It came despite Mr Trump repeatedly talking up the chances of a peace agreement. He even spoke to Mr Putin on the phone for two hours last week. Read more from Sky News:Trump says will postpone 50% tariffs on EU until July  'Shameful' attacks Mr Zelenskyy has said Ukraine is ready to sign a ceasefire deal, and suggested Russia isn't serious about signing one. In a statement after the latest attacks on his country, he urged the US and other national leaders to increase the pressure on Mr Putin, saying silence \"only encourages\" him. Mr Trump's envoy for the country, Keith Kellogg, later demanded a ceasefire, describing the Russian attacks as \"shameful\". Three children were among those killed in the attacks, explosions shaking the cities of Kyiv, Odesa, and Mykolaiv. Before the onslaught, Russia said it had faced a Ukrainian drone attack on Sunday. It said around 100 were intercepted and destroyed near Moscow and in central and southern regions. The violence has escalated despite Russia and Ukraine completing the exchange of 1,000 prisoners each over the past three days."
    },
    {
        "title": "British surgeon in Gaza condemns 'complicit' politicians - as at least 20 reported dead in Israeli airstrike on school",
        "description": "At least 20 people have been killed and dozens more injured after an Israeli airstrike targeting a school in Gaza, health authorities have said.",
        "url": "https://news.sky.com/story/at-least-20-reported-dead-in-israeli-airstrike-on-gaza-school-housing-displaced-people-13374773",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-israel-airstrike_6927501.jpg?20250526010140",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-25 23:21:00",
        "Headline": "It comes Israeli's military campaign comes under mounting criticism from some of its Western allies - while the head of a US-backed organisation set up to deliver aid into Gaza has resigned.",
        "Content": "At least 20 people have been killed and dozens more injured after an Israeli airstrike targeting a school in Gaza, health authorities have said. Reuters news agency reported the number of dead, citing medics, with the school in the Daraj neighbourhood in Gaza City having been used to shelter displaced people who had fled previous bombardments. Warning: Some readers may find content distressing Medical and civil defence sources on the ground confirmed women and children were among the casualties, with several charred bodies arriving at al Shifa and al Ahli hospitals overnight into Monday. The scene inside the school has been described as horrific, with more victims feared trapped under the rubble. There was no immediate comment from the Israeli military. It comes as a British doctor working in Gaza has hit out at politicians who he accused of being \"complicit\" in the \"ongoing slaughter and starvation\" in the Palestinian territory.  'They have never smelt the rotting flesh' Tom Potokar, who is working at Nasser Hospital in Khan Younis, said the \"political class… appear on the news shows, give interviews and try to justify what is happening, sitting in their offices, safe and sound, well fed and surrounded by all the luxuries of modern life\". \"They have no idea how dangerous their words are,\" he continued. \"They have never been here, they've never seen with their own eyes what is going on, heard the screams, smelt the rotting flesh, shuddered from the constant bombardment.\" The medic added that if they spent \"just one day here they would have the courage and the humanity to speak the truth... and use their power to bring this to an end, rather than being complicit in sustaining what is happening here\". Earlier, a medical charity chief spoke out about the deaths of a doctor's nine children in an Israeli strike on Friday, and the \"almost impossibility\" of providing care in Gaza. Chris Lockyear - secretary general of Medecins Sans Frontieres (MSF), or Doctors Without Borders - told Sky News' Sunday Morning With Trevor Phillips the bodies of nine of paediatrician Alaa al Najjar's 10 children arrived at the Nasser Medical Complex, in the city of Khan Younis, while she was on shift. Read more:British doctor says Khan Younis looks like Stalingrad'Surgeon working in Gaza says it is now 'a slaughterhouse'  Chief of US-backed aid group quits There has been mounting international condemnation of Israel's military campaign in Gaza, which has seen Israeli Prime Minister Benjamin Netanyahu accuse Western leaders including Sir Keir Starmer of siding with Hamas. Last Tuesday, the UK paused free trade talks with Israel, summoned its ambassador, and announced further sanctions against West Bank settlers. In recent days, Israel has allowed some aid trucks to enter Gaza after blocking the entry of medical, food, and fuel supplies since the start of March, which had prompted international experts to warn of looming famine. The head of a US-backed humanitarian organisation set up to transport aid as part of an Israeli plan - rather than a United Nations (UN) distribution effort - has since resigned. Jake Wood said on Sunday the Gaza Humanitarian Foundation he led for the past two months cannot adhere to the \"humanitarian principles of humanity, neutrality, impartiality, and independence, which I will not abandon\". The foundation was meant to lead a joint US-Israeli operation to deliver aid in Gaza starting this week. Israel has claimed previous UN aid deliveries have been stolen by Hamas fighters. The UN believes the US-Israeli plans would only foment further violence and the forced relocation of Palestinians. Trump wants end to war Despite the warnings, Mr Netanyahu has vowed the whole of Gaza will be under Israel's control. Israel stepped up its military operations in early May, saying it was seeking to eliminate Hamas' military and governing capabilities and bring back the remaining hostages who were seized on 7 October 2023. The war began when Hamas-led militants attacked southern Israel on that day, killing 1,200 people, mostly civilians, and kidnapping about 250 others. Israel's response has flattened large areas of Gaza and killed more than 53,000 Palestinians, mostly women and children, according to the Hamas-run health ministry, which does not differentiate between civilians and combatants. Speaking on Sunday, Donald Trump repeated his desire to \"see if we can stop\" what is happening - but did not criticise Mr Netanyahu or the Israeli military campaign."
    },
    {
        "title": "Donald Trump says he will postpone 50% tariffs on EU until July",
        "description": "Donald Trump says he will delay the imposition of 50% tariffs on goods entering the US from the EU until July, as the two sides attempt to negotiate a trade deal.",
        "url": "https://news.sky.com/story/donald-trump-says-us-and-eu-have-agreed-to-postpone-tariffs-13374764",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-us-president_6927491.jpg?20250525234812",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-25 22:07:00",
        "Headline": "The US president had threatened to bring in 50% tariffs from 1 June on goods coming from the EU, but that date has now been put back until 9 July to allow more time for negotiations with the bloc.",
        "Content": " Donald Trump says he will delay the imposition of 50% tariffs on goods entering the US from the EU until July, as the two sides attempt to negotiate a trade deal. It comes after the president of the European Commission, Ursula von der Leyen, said in a post on social media site X that she had spoken to Mr Trump and expressed that they needed until 9 July to \"reach a good deal\". The US president had last Friday threatened to bring in the 50% tariffs from 1 June, as European leaders said they were ready to respond with their own measures. But Mr Trump has now said that date has been put back to 9 July to allow more time for negotiations with the 27-member bloc, with the phone call appearing to smooth over tensions for now at least. Speaking on Sunday before boarding Air Force One for Washington DC, Mr Trump told reporters that he had spoken to Ms Von der Leyen and she \"wants to get down to serious negotiations\" and she vowed to \"rapidly get together and see if we can work something out\". 'We had a very nice call' The US president, in comments on his Truth Social platform, had reignited fears last Friday of a trade war between the two powers when he said talks were \"going nowhere\" and the bloc was \"very difficult to deal with\". Mr Trump told the media in Morristown, New Jersey, on Sunday that Ms Von der Leyen \"just called me... and she asked for an extension in the June 1st date. And she said she wants to get down to serious negotiation\". \"We had a very nice call and I agreed to move it. I believe July 9th would be the date. That was the date she requested. She said we will rapidly get together and see if we can work something out,\" the US president added. Shortly after, he wrote on Truth Social: \"I agreed to the extension - July 9, 2025 - It was my privilege to do so.\" On his so-called \"liberation day\" last month, Mr Trump unleashed tariffs on many of America's trade partners. But since then he's backed down in a spiralling tit-for-tat tariff face-off with China, and struck a deal with the UK. Read more from Sky News:Trump 'not happy' with PutinAt least 20 dead in Israeli strike in Gaza  Much of his most incendiary rhetoric on trade has been directed at Brussels, though, even going as far as to claim the EU was created to rip the US off. Responding to his 50% tariff threat, EU trade chief Maros Sefcovic said: \"EU-US trade is unmatched and must be guided by mutual respect, not threats. \"We stand ready to defend our interests.\""
    },
    {
        "title": "Nigel Farage's big announcement will pile more pressure on PM",
        "description": "No U-turn comes without a political cost.",
        "url": "https://news.sky.com/story/two-child-benefit-cap-pressure-grows-on-starmer-as-reforms-policy-move-parks-tanks-on-labours-lawn-13374705",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-farage_6927488.jpg?20250525233805",
        "type": "Home",
        "Author": "Ali Fortescue",
        "Date Published": "2025-05-25 18:59:00",
        "Headline": "Nigel Farage is set to exploit Labour's winter fuel payments climbdown to make a grab for the party's traditional voter-base by calling for the two-child benefit cap to be scrapped, a move that could further aggravate government splits over the issue.",
        "Content": "\n          Political correspondent\n              @AliFortescue\n No U-turn comes without a political cost. This weekend, it has become clear there is a price to pay for Sir Keir Starmer's decision to row back on winter fuel payment cuts. One MP said in a text message: \"We all want to see more\", while former prime minister Gordon Brown told Sky News this week the two-child benefit cap was \"pretty discriminatory\" and could be scrapped. The cap, which prevents parents from claiming child tax credit or universal credit for more than two children, is a symbolic sore for Labour that saw seven MPs suspended from the party last year. Now it's back to cause more trouble. A Downing Street source suggests little has changed in the last week, and looking at the cap has always been part of the (now delayed) Child Poverty Strategy.  But, beyond the whispers behind the scenes, one thing has overtly changed this weekend - growing pressure from Nigel Farage. We expect Reform UK to announce this week that it will reinstate winter fuel payments and drop the cap. Farage is parking his tanks on Labour's lawn, trying to tap into working-class votes on uncomfortable territory for Starmer. How would they pay for it? A combination of closing asylum hotels, cutting aid, and scrapping net-zero targets, the party says. Headline-grabbing move The beauty of not being in power is not having to make all the sums add up right now, and it is a headline-grabbing announcement that will, at the very least, reignite the conversation about the two-child cap. It's also a reminder that Reform UK, who were beaten by Labour in 89 out of the 98 constituencies they came second in last year, have set their sights beyond the Conservatives. As for the Tories, who introduced the measure in 2017, leader Kemi Badenoch is clear, saying: \"If you can't afford to have lots of children, then you shouldn't do so\".  Blue water between Tories and Reform UK So, there is blue water between the Conservatives and Reform, but it's the prime minister and his party that Farage is targeting now, and Labour is unclear on where it stands. Deputy leader Angela Rayner told Sunday Morning With Trevor Phillips that \"lifting any measures that alleviate poverty is not a bad idea\". More from Sky News:PM's winter fuel claim 'not credible'Starmer-Reeves Downing St 'rift' With the spending review fast approaching, Starmer and Chancellor Rachel Reeves will be working out the actual cost, beyond the political one, of rowing back on winter fuel payment cuts. But will the anger that the policy ignited among some Labour MPs end there? Or will it move to another uncomfortable subject? As one MP puts it: \"If there's money for pensioners, why not children?\""
    },
    {
        "title": "Living beside the UK's first drug consumption room",
        "description": "It's 8.34am on a Tuesday and Vanessa Paton is taking me on a tour of Glasgow's east end, where she has lived for almost 50 years.",
        "url": "https://news.sky.com/story/living-beside-the-uks-first-drug-consumption-room-13373285",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-drugs-scotland_6924946.jpg?20250523121417",
        "type": "Home",
        "Author": "Connor Gillies",
        "Date Published": "2025-05-25 23:01:00",
        "Headline": "Sky News witnessed a makeshift drug den with hundreds of freshly used needles - it was like a minefield. One needle was stabbed into a large tree and there was even a wooden seat covered in drug-taking equipment.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n  It's 8.34am on a Tuesday and Vanessa Paton is taking me on a tour of Glasgow's east end, where she has lived for almost 50 years. Half a mile away sits the newly opened taxpayer-funded facility, named The Thistle, where drug addicts can bring their heroin and cocaine, are handed clean needles and invited to inject under NHS medical supervision. The concept, a UK first, is controversial and costs £2.3m a year. Authorities believe it provides a safer, cleaner area for users to do their business, away from the dirty, HIV-ridden back alleys of Glasgow city centre. It opened in January, and around 250 people have used it so far. But there is a growing feeling among some that a by-product of this bold project is the alleged \"war zone\" being created in the community around the new building. Former council worker Ms Paton is one of an ad-hoc group of furious locals who pick up needles as part of desperate efforts to clear their streets. She says: \"It is getting worse. The new room has appeared, and the problems have escalated with it. It's a no-go war zone every day and night. \"The area's becoming a toilet. That is the harsh reality of it.\" 'It is disgusting' Sky News spends the morning being shown areas where it is claimed the issues are getting out of control. Ms Paton pulls a bloodied, faeces-covered hospital gown out of a bush as we walk along a path behind a row of houses. We turn the corner to a street where children play and are greeted with syringes filled with blood at our feet, discarded needle packaging and dirty underwear. Local resident Angela Scott says: \"It's become a lot worse. It's heightened. I'm scared that if I am picking up my dog dirt am I going to prick a needle. \"Am I going to end up with an infection that a lot of drug addicts tend to have because they are sharing needles? I don't want to pick up something infectious.\" Adverts installed in known drug dens Officials have installed a new needle bin in one hotspot in recent days, with posters erected advertising the nearby consumption room. Ms Paton alleges safety steps are being taken at a nearby nursery. \"There is a nursery that actually uses a metal detector in the morning to scan the sandpits before the children go out because of the concern of the needles being in it,\" she claims. This area is known as Calton and has had its troubles with drug taking and crime for many years. Ms Paton takes us to a tucked-away, overgrown area opposite social housing and a few metres from where a new school is being built. It is a makeshift drug den. There are hundreds of freshly used needles. It is like a minefield. One needle is stabbed into a large tree, there is even a wooden seat which is covered in drug-taking equipment. Once again, there is a laminated A4 piece of paper pointing users in the direction of The Thistle. Read more from Sky News:Trump 'not happy' with PutinAt least 20 dead in Israeli strike in Gaza Ms Paton says: \"We picked up 50 needles in one minute last week. If we were to pick up every needle that is here today, we'd be talking hundreds. \"We are struggling to find somewhere safe to stand. There are needles between my legs, you've got needles behind your head. \"It's totally soul-destroying. Nobody living here expected it to be this bad.\" Officials deny it is a new problem Glasgow City Council told Sky News there had not been an increase in reports despite the community alleging the opposite. Councillor Allan Casey, who is responsible for drug policy in the city, said: \"This has been a long-standing issue and that is one of the main reasons why The Thistle has been placed where it is because there has been decades-long discarded needles in public places. Responding to claims of increasing problems around the new facility, Mr Casey said: \"Those reports don't back that up. \"The council has not seen a rise in reports of injecting equipment and there has not been an increase in crime reports.\" Scotland is ravaged by drugs. The country has the worst drug death rate in Europe. Scotland's first minister John Swinney told Sky News the new drug room required time to \"see the impact\". He said: \"The Thistle is a safe consumption facility which is designed to encourage people to come off the use of drugs - that's its purpose. We've got to give that venture time to see the impact. \"We need to engage with the local community… and address any concerns.\" It is understood police have logged no calls about the facility since it opened in January, despite some residents suggesting they have contacted officers with concerns. Inspector Max Shaw from Police Scotland said: \"We are aware of long-standing issues in the area and continue to work closely in partnership to address these concerns.\""
    },
    {
        "title": "Johann Strauss' The Blue Danube to be broadcast into deep space",
        "description": "A piece of classical music is to be played into space to celebrate the 200th anniversary of the birth of its composer and the 50th year of the European Space Agency (ESA).",
        "url": "https://news.sky.com/story/johann-strauss-the-blue-danube-to-be-broadcast-into-deep-space-13374740",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-european-space-agency_6927444.jpg?20250525213043",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-25 20:30:00",
        "Headline": "A pre-recorded version of the \"most famous of all waltzes\" will be played out later this month and beamed into space, as well as being livestreamed with free public screenings across Europe.",
        "Content": "A piece of classical music is to be played into space to celebrate the 200th anniversary of the birth of its composer and the 50th year of the European Space Agency (ESA). The Blue Danube, by Johann Strauss, will be beamed into the cosmos as it's performed by the Vienna Symphony Orchestra on 31 May, and livestreamed with free public screenings in Vienna, Madrid, and New York. To avoid any technical issues, a pre-recorded version from the orchestra's rehearsal on the day before will be played out, while a live performance provides the accompaniment. The music, which famously featured in Stanley Kubrick's 1968 movie, 2001: A Space Odyssey, will pass the moon in just 1.5 seconds. Starting from the ESA's big antenna dish in Spain, part of the agency's deep-space network, it will pass Mars in 4.5 minutes, Jupiter in 37 minutes and go past Neptune in four hours. If all goes to plan, NASA's Voyager 1, the world's most distant spacecraft, will be reached within 23 hours, when the signals will be more than 15 billion miles in interstellar space. Tourism officials in Vienna, where Strauss was born in October 1825, said broadcasting \"the most famous of all waltzes\" into space corrects the \"cosmic mistake\" of his music being left out of previous interstellar broadcasts. Strauss was overlooked almost 50 years ago, when the Voyager Golden Records were played out on gold-plated copper phonograph records installed in NASA's Voyagers 1 and 2. The records contain sounds and images of Earth as well as 90 minutes of music. The late astronomer Carl Sagan led the committee that chose works by Bach, Beethoven, Mozart and Stravinsky, along with modern and Indigenous selections. Strauss was among those omitted from the 1977 broadcasts. NASA celebrated its 50th anniversary in 2008 by transmitting The Beatles' Across The Universe directly into deep space, and last year the agency beamed up Missy Elliott's The Rain (Supa Dupa Fly) towards Venus."
    },
    {
        "title": "Officials at Premier League clubs at risk of legal action over unlicensed casino sponsors",
        "description": "Casinos sponsoring two Premier League clubs are accepting UK customers without a licence, putting club officers at risk of prosecution, Sky News has learned.",
        "url": "https://news.sky.com/story/premier-league-clubs-at-risk-of-legal-action-over-unlicensed-casino-sponsors-13373376",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-dandf-teaser-football_6925164.jpg?20250523155949",
        "type": "Home",
        "Author": "Ben van der Merwe, digital investigations journalist",
        "Date Published": "2025-05-25 17:00:00",
        "Headline": "The Gambling Commission has warned that club officers could face fines or imprisonment if found to be promoting sites that unlawfully accept UK customers.",
        "Content": "By Ben van der Merwe, digital investigations journalist  Casinos sponsoring two Premier League clubs are accepting UK customers without a licence, putting club officers at risk of prosecution, Sky News has learned. The gambling websites, BC.Game and DEBET, are the matchday shirt sponsors of Leicester City and Wolverhampton Wanderers, respectively. But an investigation by anti-gambling advert campaigners, shared with Sky News, suggests the casinos have continued to accept UK customers - despite this becoming unlawful after they lost their licences to operate in the UK. DEBET lost its licence on 15 May, while BC.Game lost its licence in December 2024. Neither club has indicated that they intend to end the sponsorships, despite criticism from campaigners and warnings from the Gambling Commission.  With the end of the 2024/25 season this weekend, both clubs are now half-way through two-year sponsorship deals with the casinos - putting them in a difficult position for next season. The campaign group Coalition to End Gambling Ads (CEGA) told Sky News it was able to make deposits on both gambling websites, despite the sites having no licence to accept UK customers. \n                  Labour say there's been a 'massive increase' in NHS appointments - this begs to differ\n                 \n                  What aid has entered Gaza - and where is it going?\n                 \n                  How Israel has escalated Gaza bombing campaign\n                 CEGA also successfully deposited cash on Burnley FC sponsor 96.com. Burnley are due to be promoted to the Premier League next season. The findings come one week after the Gambling Commission warned five football clubs, including Wolverhampton and Burnley, that their officers \"may be liable to prosecution and, if convicted, face a fine, imprisonment or both if they promote unlicensed gambling businesses that transact with consumers in Great Britain\". The Commission had issued a similar warning to Leicester City in February. It made clear then that the clubs must either cut ties with the casinos or ensure they are not accessible to UK customers \"by any means\" - including virtual private networks (VPNs) - software used to hide a user's real location. Other than the need to use a VPN, CEGA director Will Prochaska says it \"really wasn't very difficult\" to access the sites. The Gambling Commission declined to be interviewed by Sky News, but said that \"where we have evidence that meets the standard for criminal prosecution we will take appropriate action\". Head of enforcement at the Commission John Pierce previously said the body would \"conduct ongoing spot checks as necessary to ensure they are not accessible to consumers in Great Britain by any means\". Mr Prochaska, however, said the Commission was taking \"far too long\" to take action. \"Far too many children, far too many football fans, are seeing these adverts every day,\" he said. \"It's got to stop.\" Leicester City's sponsor has had no UK licence for almost six months The three sites that appear on the matchday shirts of Leicester, Wolves and Burnley were previously licensed by TGP Europe, a company based on the Isle of Man. On 15 May, TGP Europe surrendered its UK gambling licence to avoid a £3.3m fine, leaving DEBET and 96.com unable to legally accept UK customers. Leicester City sponsor BC.Game has been unlicensed in the UK since it parted ways with TGP Europe in December 2024 - almost six months ago. Mr Prochaska said he contacted Leicester City on 13 March to alert them that BC.Game was still accepting UK customers. \"In fact, it was one of the easiest for me to gamble on - there were very few checks whatsoever,\" he says. \"But Leicester don't seem to have done anything about it, and it's still on the front of their shirts.\" Leicester City FC did not respond to a request for comment. Sky News was able to sign up to every single site Bournemouth, Fulham and Newcastle United are also sponsored by casinos that were formerly licensed by TGP Europe, but have been unlicensed since 15 May. These casinos (bj88, SBOTOP and FUN88) are no longer able to legally accept UK customers. However, Sky News was able to use a VPN to sign up to all three casinos, as well as those sponsoring Leicester City, Wolverhampton and Burnley. On all six websites, Sky was able to access QR codes for making cryptocurrency deposits. Sky News did not attempt to make any deposits. All six casinos are forbidden by law from accepting UK customers. Yet Burnley sponsor 96.com allowed Sky News to sign up using a Telegram account registered to a UK phone number. The other websites all required phone numbers to be entered upon registration, which could be used as an additional layer of security to filter out UK customers. However, most of the websites did not check whether the phone number provided was genuine. Only one website, Leicester City sponsor BC.Game, did check. However, after confirming the phone number's authenticity, BC.Game allowed registration to proceed - even though Sky News had provided a UK phone number. Sky News presented these findings to the football clubs concerned, to TGP Europe and to the Gambling Commission, but did not receive any comment. Anyone concerned about their gambling, or that of a loved one, can visit BeGambleAware.org for free, confidential advice and support, or The National Gambling Helpline is available on 0808 8020 133 and operates 24 hours a day, seven days a week. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Mother and three children who died in house fire in London named by police",
        "description": "A mother and three of her children who died in a house fire in northwest London have been named by police.",
        "url": "https://news.sky.com/story/mother-and-three-children-who-died-in-house-fire-in-london-named-by-police-13374583",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-house-fire-brent-uk_6925839.jpg?20250524131308",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-25 17:14:00",
        "Headline": "A 41-year-old man was arrested at the scene and has since been bailed. He was subsequently detained under the Mental Health Act.",
        "Content": " A mother and three of her children who died in a house fire in northwest London have been named by police. Warning: This article contains pictures of a fire in which people died Detectives say Nusrat Usman, 43, Maryam Mikaiel, 15, Musa Usman, eight, and Raees Usman, four, died following the fire in Stonebridge, near Wembley, in the early hours of Saturday. A woman in her 70s was taken to hospital but has since been released. A 13-year-old girl remains in hospital in a critical condition. A 41-year-old man was arrested at the scene and has since been bailed. He was subsequently detained under the Mental Health Act. Flowers and a blue bears have been left near the scene, where crews wearing helmets and respiratory equipment were seen building scaffolding against the burnt-out buildings. Neighbour Cecilia Marquis, 60, said she was \"stunned by the devastation\". \"This will leave a devastating impact,\" Ms Marquis, who witnessed the fire, said. Witness Mohamed Labidi, 38, said he \"can't even look at the house right now\". \"We used to socialise together. \"They're very good people, no problems on their side at all. It's really shocking. It's a really strong community here, we look after each other.\" A neighbour, who asked not to be named, said: \"It's horrible, we saw people running outside. \"It's hard to process. I only just moved in, so it's hard to think about it.\" Read more from Sky News:Police officer fighting for life after on-duty traffic incident namedPremier League clubs at risk of legal actionRayner says she 'never' wants to be Labour leader Eight fire engines and around 60 firefighters responded to the blaze, London Fire Brigade (LFB) said. Two terrace houses, each with three floors, were severely damaged in the fire, which was under control by around 3.25am, the fire service added. Superintendent Steve Allen, from the Met's local policing team in northwest London, said: \"Our thoughts go out to all those impacted by what has happened. \"Specialist officers are continuing to support the wider family who have asked for privacy at this deeply upsetting time. \"Local officers are working closely with officers from the Specialist Crime Command on what continues to be a very complex investigation.\" Mayor of London Sadiq Khan said in a post on X: \"This is devastating news and my thoughts are with the family, friends and wider community of the four people who sadly have lost their lives. \"I remain in close contact with the London Fire Brigade and Metropolitan Police as they work to establish the cause of the fire and offer support to all those impacted.\" This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Living beside the UK's first drug consumption room",
        "description": "It's 8.34am on a Tuesday and Vanessa Paton is taking me on a tour of Glasgow's east end, where she has lived for almost 50 years.",
        "url": "https://news.sky.com/story/living-beside-the-uks-first-drug-consumption-room-13373285",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-drugs-scotland_6924946.jpg?20250523121417",
        "type": "UK",
        "Author": "Connor Gillies",
        "Date Published": "2025-05-25 23:01:00",
        "Headline": "Sky News witnessed a makeshift drug den with hundreds of freshly used needles - it was like a minefield. One needle was stabbed into a large tree and there was even a wooden seat covered in drug-taking equipment.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n  It's 8.34am on a Tuesday and Vanessa Paton is taking me on a tour of Glasgow's east end, where she has lived for almost 50 years. Half a mile away sits the newly opened taxpayer-funded facility, named The Thistle, where drug addicts can bring their heroin and cocaine, are handed clean needles and invited to inject under NHS medical supervision. The concept, a UK first, is controversial and costs £2.3m a year. Authorities believe it provides a safer, cleaner area for users to do their business, away from the dirty, HIV-ridden back alleys of Glasgow city centre. It opened in January, and around 250 people have used it so far. But there is a growing feeling among some that a by-product of this bold project is the alleged \"war zone\" being created in the community around the new building. Former council worker Ms Paton is one of an ad-hoc group of furious locals who pick up needles as part of desperate efforts to clear their streets. She says: \"It is getting worse. The new room has appeared, and the problems have escalated with it. It's a no-go war zone every day and night. \"The area's becoming a toilet. That is the harsh reality of it.\" 'It is disgusting' Sky News spends the morning being shown areas where it is claimed the issues are getting out of control. Ms Paton pulls a bloodied, faeces-covered hospital gown out of a bush as we walk along a path behind a row of houses. We turn the corner to a street where children play and are greeted with syringes filled with blood at our feet, discarded needle packaging and dirty underwear. Local resident Angela Scott says: \"It's become a lot worse. It's heightened. I'm scared that if I am picking up my dog dirt am I going to prick a needle. \"Am I going to end up with an infection that a lot of drug addicts tend to have because they are sharing needles? I don't want to pick up something infectious.\" Adverts installed in known drug dens Officials have installed a new needle bin in one hotspot in recent days, with posters erected advertising the nearby consumption room. Ms Paton alleges safety steps are being taken at a nearby nursery. \"There is a nursery that actually uses a metal detector in the morning to scan the sandpits before the children go out because of the concern of the needles being in it,\" she claims. This area is known as Calton and has had its troubles with drug taking and crime for many years. Ms Paton takes us to a tucked-away, overgrown area opposite social housing and a few metres from where a new school is being built. It is a makeshift drug den. There are hundreds of freshly used needles. It is like a minefield. One needle is stabbed into a large tree, there is even a wooden seat which is covered in drug-taking equipment. Once again, there is a laminated A4 piece of paper pointing users in the direction of The Thistle. Read more from Sky News:Trump 'not happy' with PutinAt least 20 dead in Israeli strike in Gaza Ms Paton says: \"We picked up 50 needles in one minute last week. If we were to pick up every needle that is here today, we'd be talking hundreds. \"We are struggling to find somewhere safe to stand. There are needles between my legs, you've got needles behind your head. \"It's totally soul-destroying. Nobody living here expected it to be this bad.\" Officials deny it is a new problem Glasgow City Council told Sky News there had not been an increase in reports despite the community alleging the opposite. Councillor Allan Casey, who is responsible for drug policy in the city, said: \"This has been a long-standing issue and that is one of the main reasons why The Thistle has been placed where it is because there has been decades-long discarded needles in public places. Responding to claims of increasing problems around the new facility, Mr Casey said: \"Those reports don't back that up. \"The council has not seen a rise in reports of injecting equipment and there has not been an increase in crime reports.\" Scotland is ravaged by drugs. The country has the worst drug death rate in Europe. Scotland's first minister John Swinney told Sky News the new drug room required time to \"see the impact\". He said: \"The Thistle is a safe consumption facility which is designed to encourage people to come off the use of drugs - that's its purpose. We've got to give that venture time to see the impact. \"We need to engage with the local community… and address any concerns.\" It is understood police have logged no calls about the facility since it opened in January, despite some residents suggesting they have contacted officers with concerns. Inspector Max Shaw from Police Scotland said: \"We are aware of long-standing issues in the area and continue to work closely in partnership to address these concerns.\""
    },
    {
        "title": "Nigel Farage's big announcement will pile more pressure on PM",
        "description": "No U-turn comes without a political cost.",
        "url": "https://news.sky.com/story/two-child-benefit-cap-pressure-grows-on-starmer-as-reforms-policy-move-parks-tanks-on-labours-lawn-13374705",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-farage_6927488.jpg?20250525233805",
        "type": "UK",
        "Author": "Ali Fortescue",
        "Date Published": "2025-05-25 18:59:00",
        "Headline": "Nigel Farage is set to exploit Labour's winter fuel payments climbdown to make a grab for the party's traditional voter-base by calling for the two-child benefit cap to be scrapped, a move that could further aggravate government splits over the issue.",
        "Content": "\n          Political correspondent\n              @AliFortescue\n No U-turn comes without a political cost. This weekend, it has become clear there is a price to pay for Sir Keir Starmer's decision to row back on winter fuel payment cuts. One MP said in a text message: \"We all want to see more\", while former prime minister Gordon Brown told Sky News this week the two-child benefit cap was \"pretty discriminatory\" and could be scrapped. The cap, which prevents parents from claiming child tax credit or universal credit for more than two children, is a symbolic sore for Labour that saw seven MPs suspended from the party last year. Now it's back to cause more trouble. A Downing Street source suggests little has changed in the last week, and looking at the cap has always been part of the (now delayed) Child Poverty Strategy.  But, beyond the whispers behind the scenes, one thing has overtly changed this weekend - growing pressure from Nigel Farage. We expect Reform UK to announce this week that it will reinstate winter fuel payments and drop the cap. Farage is parking his tanks on Labour's lawn, trying to tap into working-class votes on uncomfortable territory for Starmer. How would they pay for it? A combination of closing asylum hotels, cutting aid, and scrapping net-zero targets, the party says. Headline-grabbing move The beauty of not being in power is not having to make all the sums add up right now, and it is a headline-grabbing announcement that will, at the very least, reignite the conversation about the two-child cap. It's also a reminder that Reform UK, who were beaten by Labour in 89 out of the 98 constituencies they came second in last year, have set their sights beyond the Conservatives. As for the Tories, who introduced the measure in 2017, leader Kemi Badenoch is clear, saying: \"If you can't afford to have lots of children, then you shouldn't do so\".  Blue water between Tories and Reform UK So, there is blue water between the Conservatives and Reform, but it's the prime minister and his party that Farage is targeting now, and Labour is unclear on where it stands. Deputy leader Angela Rayner told Sunday Morning With Trevor Phillips that \"lifting any measures that alleviate poverty is not a bad idea\". More from Sky News:PM's winter fuel claim 'not credible'Starmer-Reeves Downing St 'rift' With the spending review fast approaching, Starmer and Chancellor Rachel Reeves will be working out the actual cost, beyond the political one, of rowing back on winter fuel payment cuts. But will the anger that the policy ignited among some Labour MPs end there? Or will it move to another uncomfortable subject? As one MP puts it: \"If there's money for pensioners, why not children?\""
    },
    {
        "title": "Officials at Premier League clubs at risk of legal action over unlicensed casino sponsors",
        "description": "Casinos sponsoring two Premier League clubs are accepting UK customers without a licence, putting club officers at risk of prosecution, Sky News has learned.",
        "url": "https://news.sky.com/story/premier-league-clubs-at-risk-of-legal-action-over-unlicensed-casino-sponsors-13373376",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-dandf-teaser-football_6925164.jpg?20250523155949",
        "type": "UK",
        "Author": "Ben van der Merwe, digital investigations journalist",
        "Date Published": "2025-05-25 17:00:00",
        "Headline": "The Gambling Commission has warned that club officers could face fines or imprisonment if found to be promoting sites that unlawfully accept UK customers.",
        "Content": "By Ben van der Merwe, digital investigations journalist  Casinos sponsoring two Premier League clubs are accepting UK customers without a licence, putting club officers at risk of prosecution, Sky News has learned. The gambling websites, BC.Game and DEBET, are the matchday shirt sponsors of Leicester City and Wolverhampton Wanderers, respectively. But an investigation by anti-gambling advert campaigners, shared with Sky News, suggests the casinos have continued to accept UK customers - despite this becoming unlawful after they lost their licences to operate in the UK. DEBET lost its licence on 15 May, while BC.Game lost its licence in December 2024. Neither club has indicated that they intend to end the sponsorships, despite criticism from campaigners and warnings from the Gambling Commission.  With the end of the 2024/25 season this weekend, both clubs are now half-way through two-year sponsorship deals with the casinos - putting them in a difficult position for next season. The campaign group Coalition to End Gambling Ads (CEGA) told Sky News it was able to make deposits on both gambling websites, despite the sites having no licence to accept UK customers. \n                  Labour say there's been a 'massive increase' in NHS appointments - this begs to differ\n                 \n                  What aid has entered Gaza - and where is it going?\n                 \n                  How Israel has escalated Gaza bombing campaign\n                 CEGA also successfully deposited cash on Burnley FC sponsor 96.com. Burnley are due to be promoted to the Premier League next season. The findings come one week after the Gambling Commission warned five football clubs, including Wolverhampton and Burnley, that their officers \"may be liable to prosecution and, if convicted, face a fine, imprisonment or both if they promote unlicensed gambling businesses that transact with consumers in Great Britain\". The Commission had issued a similar warning to Leicester City in February. It made clear then that the clubs must either cut ties with the casinos or ensure they are not accessible to UK customers \"by any means\" - including virtual private networks (VPNs) - software used to hide a user's real location. Other than the need to use a VPN, CEGA director Will Prochaska says it \"really wasn't very difficult\" to access the sites. The Gambling Commission declined to be interviewed by Sky News, but said that \"where we have evidence that meets the standard for criminal prosecution we will take appropriate action\". Head of enforcement at the Commission John Pierce previously said the body would \"conduct ongoing spot checks as necessary to ensure they are not accessible to consumers in Great Britain by any means\". Mr Prochaska, however, said the Commission was taking \"far too long\" to take action. \"Far too many children, far too many football fans, are seeing these adverts every day,\" he said. \"It's got to stop.\" Leicester City's sponsor has had no UK licence for almost six months The three sites that appear on the matchday shirts of Leicester, Wolves and Burnley were previously licensed by TGP Europe, a company based on the Isle of Man. On 15 May, TGP Europe surrendered its UK gambling licence to avoid a £3.3m fine, leaving DEBET and 96.com unable to legally accept UK customers. Leicester City sponsor BC.Game has been unlicensed in the UK since it parted ways with TGP Europe in December 2024 - almost six months ago. Mr Prochaska said he contacted Leicester City on 13 March to alert them that BC.Game was still accepting UK customers. \"In fact, it was one of the easiest for me to gamble on - there were very few checks whatsoever,\" he says. \"But Leicester don't seem to have done anything about it, and it's still on the front of their shirts.\" Leicester City FC did not respond to a request for comment. Sky News was able to sign up to every single site Bournemouth, Fulham and Newcastle United are also sponsored by casinos that were formerly licensed by TGP Europe, but have been unlicensed since 15 May. These casinos (bj88, SBOTOP and FUN88) are no longer able to legally accept UK customers. However, Sky News was able to use a VPN to sign up to all three casinos, as well as those sponsoring Leicester City, Wolverhampton and Burnley. On all six websites, Sky was able to access QR codes for making cryptocurrency deposits. Sky News did not attempt to make any deposits. All six casinos are forbidden by law from accepting UK customers. Yet Burnley sponsor 96.com allowed Sky News to sign up using a Telegram account registered to a UK phone number. The other websites all required phone numbers to be entered upon registration, which could be used as an additional layer of security to filter out UK customers. However, most of the websites did not check whether the phone number provided was genuine. Only one website, Leicester City sponsor BC.Game, did check. However, after confirming the phone number's authenticity, BC.Game allowed registration to proceed - even though Sky News had provided a UK phone number. Sky News presented these findings to the football clubs concerned, to TGP Europe and to the Gambling Commission, but did not receive any comment. Anyone concerned about their gambling, or that of a loved one, can visit BeGambleAware.org for free, confidential advice and support, or The National Gambling Helpline is available on 0808 8020 133 and operates 24 hours a day, seven days a week. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Mother and three children who died in house fire in London named by police",
        "description": "A mother and three of her children who died in a house fire in northwest London have been named by police.",
        "url": "https://news.sky.com/story/mother-and-three-children-who-died-in-house-fire-in-london-named-by-police-13374583",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-house-fire-brent-uk_6925839.jpg?20250524131308",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-25 17:14:00",
        "Headline": "A 41-year-old man was arrested at the scene and has since been bailed. He was subsequently detained under the Mental Health Act.",
        "Content": " A mother and three of her children who died in a house fire in northwest London have been named by police. Warning: This article contains pictures of a fire in which people died Detectives say Nusrat Usman, 43, Maryam Mikaiel, 15, Musa Usman, eight, and Raees Usman, four, died following the fire in Stonebridge, near Wembley, in the early hours of Saturday. A woman in her 70s was taken to hospital but has since been released. A 13-year-old girl remains in hospital in a critical condition. A 41-year-old man was arrested at the scene and has since been bailed. He was subsequently detained under the Mental Health Act. Flowers and a blue bears have been left near the scene, where crews wearing helmets and respiratory equipment were seen building scaffolding against the burnt-out buildings. Neighbour Cecilia Marquis, 60, said she was \"stunned by the devastation\". \"This will leave a devastating impact,\" Ms Marquis, who witnessed the fire, said. Witness Mohamed Labidi, 38, said he \"can't even look at the house right now\". \"We used to socialise together. \"They're very good people, no problems on their side at all. It's really shocking. It's a really strong community here, we look after each other.\" A neighbour, who asked not to be named, said: \"It's horrible, we saw people running outside. \"It's hard to process. I only just moved in, so it's hard to think about it.\" Read more from Sky News:Police officer fighting for life after on-duty traffic incident namedPremier League clubs at risk of legal actionRayner says she 'never' wants to be Labour leader Eight fire engines and around 60 firefighters responded to the blaze, London Fire Brigade (LFB) said. Two terrace houses, each with three floors, were severely damaged in the fire, which was under control by around 3.25am, the fire service added. Superintendent Steve Allen, from the Met's local policing team in northwest London, said: \"Our thoughts go out to all those impacted by what has happened. \"Specialist officers are continuing to support the wider family who have asked for privacy at this deeply upsetting time. \"Local officers are working closely with officers from the Specialist Crime Command on what continues to be a very complex investigation.\" Mayor of London Sadiq Khan said in a post on X: \"This is devastating news and my thoughts are with the family, friends and wider community of the four people who sadly have lost their lives. \"I remain in close contact with the London Fire Brigade and Metropolitan Police as they work to establish the cause of the fire and offer support to all those impacted.\" This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Former BBC executive and presenter Alan Yentob dies",
        "description": "Alan Yentob, the former BBC presenter and executive, has died aged 78.",
        "url": "https://news.sky.com/story/former-bbc-executive-and-presenter-alan-yentob-dies-13374355",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-alan-yentob-bbc_6926730.jpg?20250525135343",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-25 12:44:00",
        "Headline": "Yentob's wife Philippa Walker says he was \"creative in every cell of his body\", and that he was a \"profoundly moral man\".",
        "Content": "Alan Yentob, the former BBC presenter and executive, has died aged 78. A statement from his family, shared by the BBC, said Yentob died on Saturday. His wife Philippa Walker said: \"For Jacob, Bella and I, every day with Alan held the promise of something unexpected. Our life was exciting, he was exciting. \"He was curious, funny, annoying, late, and creative in every cell of his body. But more than that, he was the kindest of men and a profoundly moral man. He leaves in his wake a trail of love a mile wide.\"  Read more on Sky News:First renationalised train service startsMy week with Prince William, the quiet disruptor Yentob joined the BBC as a trainee in 1968 and held a number of positions - including controller of BBC One and BBC Two, director of television, and head of music and art. He was also the director of BBC drama, entertainment, and children's TV. Yentob launched CBBC and CBeebies, and his drama commissions included Pride And Prejudice and Middlemarch. The TV executive was made a Commander of the Order of the British Empire (CBE) by the King in 2024 for services to the arts and media. In a tribute, the BBC's director-general Tim Davie said: \"Alan Yentob was a towering figure in British broadcasting and the arts. A creative force and a cultural visionary, he shaped decades of programming at the BBC and beyond, with a passion for storytelling and public service that leave a lasting legacy. \"Above all, Alan was a true original. His passion wasn't performative - it was personal. He believed in the power of culture to enrich, challenge and connect us.\" BBC Radio 4 presenter Amol Rajan described him on Instagram as \"such a unique and kind man: an improbable impresario from unlikely origins who became a towering figure in the culture of post-war Britain. \"I commend his spirit to the living.\""
    },
    {
        "title": "Police officer fighting for life after on-duty traffic incident is named - as four people arrested",
        "description": "A police officer left fighting for his life after being seriously injured in a road traffic incident while on duty has been named.",
        "url": "https://news.sky.com/story/police-officer-in-life-threatening-condition-after-traffic-incident-while-on-duty-is-named-13374513",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-christopher-miller_6927056.jpg?20250525173909",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-25 16:21:00",
        "Headline": "Thames Valley Police said PC Christopher Miller remained in a critical life-threatening condition in hospital following the incident in Stoke Poges, Buckinghamshire, at about 10.20 pm on Thursday.",
        "Content": "A police officer left fighting for his life after being seriously injured in a road traffic incident while on duty has been named. Thames Valley Police said PC Christopher Miller, 38, remained in a critical, life-threatening condition in hospital following the incident on the B416 in Stoke Poges, Buckinghamshire, at about 10.20pm on Thursday. According to the force, PC Miller has spent five years with the roads policing unit and has been in the police for 13 years, and his family are being supported by specially trained family liaison officers. Thames Valley Police said a white BMW did not stop following the incident, and police are asking anyone who may have seen a vehicle with significant damage to the front to get in touch. Officers are also continuing to appeal for witnesses or anyone who may have footage. Two men from Slough, aged 28 and 38, have been arrested on suspicion of attempted murder and causing serious injury by dangerous driving. A 43-year-old man, also from Slough, has been arrested on suspicion of assisting an offender and perverting the course of justice. He has been released on bail. On Sunday, a 37-year-old woman from Slough was arrested on suspicion of assisting an offender and perverting the course of justice. Read more from Sky News:Mother and three children who died in house fire in London namedPremier League clubs at risk of legal actionRayner says she 'never' wants to be Labour leader Thames Valley Police Deputy Chief Constable Ben Snuggs said: \"Today, I am asking for the public's help to share this witness appeal. \"Police officers face danger every day. In this incident, PC Christopher Miller was simply doing his job, serving the public and keeping our communities safe. \"Sadly, Christopher has sustained extremely serious injuries, and we are doing all we can to investigate the exact circumstances. \"All officers should expect to return home safely after each tour of duty, and we wish Christopher a swift and full recovery. \"We have all been affected by this, right across Thames Valley Police. I want to thank our local communities for all their support and the wider public for the supportive messages we have received.\""
    },
    {
        "title": "Trump criticises Putin after deadly strikes across Ukraine",
        "description": "Donald Trump has threatened Russia with more sanctions after a series of deadly strikes across Ukraine, as he said of Vladimir Putin: \"What the hell happened to him?\"",
        "url": "https://news.sky.com/story/trump-criticises-putin-after-deadly-strikes-across-ukraine-13374767",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-vladimir-putin_6886237.jpg?20250414105847",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-25 22:34:00",
        "Headline": "Despite the US president talking up the chances of a peace deal, Russia launched the biggest aerial bombardment of the war so far on Sunday night. Three children were among those killed, as Ukraine's Volodymyr Zelenskyy called on allies for more support.",
        "Content": " Donald Trump has threatened Russia with more sanctions after a series of deadly strikes across Ukraine, as he said of Vladimir Putin: \"What the hell happened to him?\" The US president appeared aghast at the conduct of his counterpart in the Kremlin after drone and missile attacks in Kyiv and other Ukrainian cities left 12 people dead and dozens more injured. Trump criticises Putin - latest updates Speaking to reporters at an airport in New Jersey ahead of a flight back to Washington, Mr Trump said: \"I'm not happy with Putin. I don't know what's wrong with him.\" \"He's killing a lot of people,\" he added. \"I'm not happy about that.\" Mr Trump - who said he's \"always gotten along with\" Mr Putin - told reporters he would consider more sanctions against Moscow. \"He's sending rockets into cities and killing people, and I don't like it at all,\" he said. Later, on his Truth Social platform, the US president wrote that he has \"always had a very good relationship with Vladimir Putin of Russia, but something has happened to him. He has gone absolutely CRAZY!\" \"He is needlessly killing a lot of people... I've always said that he wants ALL of Ukraine, not just a piece of it, and maybe that's proving to be right, but if he does, it will lead to the downfall of Russia!\" Mr Trump also criticised Volodymyr Zelenskyy, saying the Ukrainian president was \"doing his country no favours by talking the way he does. Everything out of his mouth causes problems, I don't like it, and it better stop\". Ukraine said the barrage of strikes overnight into Sunday was the biggest aerial attack of the war so far, with 367 drones and missiles fired by Russian forces. It came despite Mr Trump repeatedly talking up the chances of a peace agreement. He even spoke to Mr Putin on the phone for two hours last week. Read more from Sky News:Trump says will postpone 50% tariffs on EU until July  'Shameful' attacks Mr Zelenskyy has said Ukraine is ready to sign a ceasefire deal, and suggested Russia isn't serious about signing one. In a statement after the latest attacks on his country, he urged the US and other national leaders to increase the pressure on Mr Putin, saying silence \"only encourages\" him. Mr Trump's envoy for the country, Keith Kellogg, later demanded a ceasefire, describing the Russian attacks as \"shameful\". Three children were among those killed in the attacks, explosions shaking the cities of Kyiv, Odesa, and Mykolaiv. Before the onslaught, Russia said it had faced a Ukrainian drone attack on Sunday. It said around 100 were intercepted and destroyed near Moscow and in central and southern regions. The violence has escalated despite Russia and Ukraine completing the exchange of 1,000 prisoners each over the past three days."
    },
    {
        "title": "British surgeon in Gaza condemns 'complicit' politicians - as at least 20 reported dead in Israeli airstrike on school",
        "description": "At least 20 people have been killed and dozens more injured after an Israeli airstrike targeting a school in Gaza, health authorities have said.",
        "url": "https://news.sky.com/story/at-least-20-reported-dead-in-israeli-airstrike-on-gaza-school-housing-displaced-people-13374773",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-israel-airstrike_6927501.jpg?20250526010140",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-25 23:21:00",
        "Headline": "It comes Israeli's military campaign comes under mounting criticism from some of its Western allies - while the head of a US-backed organisation set up to deliver aid into Gaza has resigned.",
        "Content": "At least 20 people have been killed and dozens more injured after an Israeli airstrike targeting a school in Gaza, health authorities have said. Reuters news agency reported the number of dead, citing medics, with the school in the Daraj neighbourhood in Gaza City having been used to shelter displaced people who had fled previous bombardments. Warning: Some readers may find content distressing Medical and civil defence sources on the ground confirmed women and children were among the casualties, with several charred bodies arriving at al Shifa and al Ahli hospitals overnight into Monday. The scene inside the school has been described as horrific, with more victims feared trapped under the rubble. There was no immediate comment from the Israeli military. It comes as a British doctor working in Gaza has hit out at politicians who he accused of being \"complicit\" in the \"ongoing slaughter and starvation\" in the Palestinian territory.  'They have never smelt the rotting flesh' Tom Potokar, who is working at Nasser Hospital in Khan Younis, said the \"political class… appear on the news shows, give interviews and try to justify what is happening, sitting in their offices, safe and sound, well fed and surrounded by all the luxuries of modern life\". \"They have no idea how dangerous their words are,\" he continued. \"They have never been here, they've never seen with their own eyes what is going on, heard the screams, smelt the rotting flesh, shuddered from the constant bombardment.\" The medic added that if they spent \"just one day here they would have the courage and the humanity to speak the truth... and use their power to bring this to an end, rather than being complicit in sustaining what is happening here\". Earlier, a medical charity chief spoke out about the deaths of a doctor's nine children in an Israeli strike on Friday, and the \"almost impossibility\" of providing care in Gaza. Chris Lockyear - secretary general of Medecins Sans Frontieres (MSF), or Doctors Without Borders - told Sky News' Sunday Morning With Trevor Phillips the bodies of nine of paediatrician Alaa al Najjar's 10 children arrived at the Nasser Medical Complex, in the city of Khan Younis, while she was on shift. Read more:British doctor says Khan Younis looks like Stalingrad'Surgeon working in Gaza says it is now 'a slaughterhouse'  Chief of US-backed aid group quits There has been mounting international condemnation of Israel's military campaign in Gaza, which has seen Israeli Prime Minister Benjamin Netanyahu accuse Western leaders including Sir Keir Starmer of siding with Hamas. Last Tuesday, the UK paused free trade talks with Israel, summoned its ambassador, and announced further sanctions against West Bank settlers. In recent days, Israel has allowed some aid trucks to enter Gaza after blocking the entry of medical, food, and fuel supplies since the start of March, which had prompted international experts to warn of looming famine. The head of a US-backed humanitarian organisation set up to transport aid as part of an Israeli plan - rather than a United Nations (UN) distribution effort - has since resigned. Jake Wood said on Sunday the Gaza Humanitarian Foundation he led for the past two months cannot adhere to the \"humanitarian principles of humanity, neutrality, impartiality, and independence, which I will not abandon\". The foundation was meant to lead a joint US-Israeli operation to deliver aid in Gaza starting this week. Israel has claimed previous UN aid deliveries have been stolen by Hamas fighters. The UN believes the US-Israeli plans would only foment further violence and the forced relocation of Palestinians. Trump wants end to war Despite the warnings, Mr Netanyahu has vowed the whole of Gaza will be under Israel's control. Israel stepped up its military operations in early May, saying it was seeking to eliminate Hamas' military and governing capabilities and bring back the remaining hostages who were seized on 7 October 2023. The war began when Hamas-led militants attacked southern Israel on that day, killing 1,200 people, mostly civilians, and kidnapping about 250 others. Israel's response has flattened large areas of Gaza and killed more than 53,000 Palestinians, mostly women and children, according to the Hamas-run health ministry, which does not differentiate between civilians and combatants. Speaking on Sunday, Donald Trump repeated his desire to \"see if we can stop\" what is happening - but did not criticise Mr Netanyahu or the Israeli military campaign."
    },
    {
        "title": "Donald Trump says he will postpone 50% tariffs on EU until July",
        "description": "Donald Trump says he will delay the imposition of 50% tariffs on goods entering the US from the EU until July, as the two sides attempt to negotiate a trade deal.",
        "url": "https://news.sky.com/story/donald-trump-says-us-and-eu-have-agreed-to-postpone-tariffs-13374764",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-us-president_6927491.jpg?20250525234812",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-25 22:07:00",
        "Headline": "The US president had threatened to bring in 50% tariffs from 1 June on goods coming from the EU, but that date has now been put back until 9 July to allow more time for negotiations with the bloc.",
        "Content": " Donald Trump says he will delay the imposition of 50% tariffs on goods entering the US from the EU until July, as the two sides attempt to negotiate a trade deal. It comes after the president of the European Commission, Ursula von der Leyen, said in a post on social media site X that she had spoken to Mr Trump and expressed that they needed until 9 July to \"reach a good deal\". The US president had last Friday threatened to bring in the 50% tariffs from 1 June, as European leaders said they were ready to respond with their own measures. But Mr Trump has now said that date has been put back to 9 July to allow more time for negotiations with the 27-member bloc, with the phone call appearing to smooth over tensions for now at least. Speaking on Sunday before boarding Air Force One for Washington DC, Mr Trump told reporters that he had spoken to Ms Von der Leyen and she \"wants to get down to serious negotiations\" and she vowed to \"rapidly get together and see if we can work something out\". 'We had a very nice call' The US president, in comments on his Truth Social platform, had reignited fears last Friday of a trade war between the two powers when he said talks were \"going nowhere\" and the bloc was \"very difficult to deal with\". Mr Trump told the media in Morristown, New Jersey, on Sunday that Ms Von der Leyen \"just called me... and she asked for an extension in the June 1st date. And she said she wants to get down to serious negotiation\". \"We had a very nice call and I agreed to move it. I believe July 9th would be the date. That was the date she requested. She said we will rapidly get together and see if we can work something out,\" the US president added. Shortly after, he wrote on Truth Social: \"I agreed to the extension - July 9, 2025 - It was my privilege to do so.\" On his so-called \"liberation day\" last month, Mr Trump unleashed tariffs on many of America's trade partners. But since then he's backed down in a spiralling tit-for-tat tariff face-off with China, and struck a deal with the UK. Read more from Sky News:Trump 'not happy' with PutinAt least 20 dead in Israeli strike in Gaza  Much of his most incendiary rhetoric on trade has been directed at Brussels, though, even going as far as to claim the EU was created to rip the US off. Responding to his 50% tariff threat, EU trade chief Maros Sefcovic said: \"EU-US trade is unmatched and must be guided by mutual respect, not threats. \"We stand ready to defend our interests.\""
    },
    {
        "title": "'The capital is under attack': At least 12 dead and dozens injured as Russian drones launched over Ukraine",
        "description": "A \"massive\" Russian drone and missile attack hit several regions in Ukraine overnight - leaving at least 12 dead, including children, and dozens injured, authorities have said.",
        "url": "https://news.sky.com/story/the-capital-is-under-attack-russian-drones-launched-over-kyiv-after-moscow-targeted-13374204",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kyiv-ukraine-russia_6926513.jpg?20250525043901",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-25 03:35:00",
        "Headline": "Nightly Russian attacks on Ukraine have become a common feature of the war, continuing even during recent peace talks which have so far failed to produce a ceasefire.",
        "Content": "A \"massive\" Russian drone and missile attack hit several regions in Ukraine overnight - leaving at least 12 dead, including children, and dozens injured, authorities have said. The widespread strikes took place for a second consecutive night just hours before Russia and Ukraine swapped hundreds more prisoners on Sunday, the third and last part of a major exchange that marks the only tangible outcome from peace talks that have so far failed to produce a ceasefire. Yulia Svyrydenko, Ukraine's first deputy prime minister, said three children were among at least 12 killed in the attacks. Writing in a post on X, she described it as \"another night of terror\" and said: \"Russia's targets are clear: homes, families, children.\" Ukraine's air force said Russia bombarded the country with 298 drones and 69 missiles, making it one of the largest aerial attacks of the war since the invasion started in February 2022. The air force said it downed 266 drones and 45 missiles. Ukraine war - follow the latest updates President Volodymyr Zelenskyy released a statement urging the US and other national leaders to increase pressure on Vladimir Putin: \"America's silence, and the silence of others in the world, only encourages Putin.\" Sounds of explosions could be heard throughout the night in Kyiv and the surrounding area, in the north of the country. At least four people in the capital were among the dead, according to Ukraine's security service. There were other attacks across the country, including drone strikes in Mykolaiv, southern Ukraine, where a residential building was hit. Footage from Odesa, about 80 miles away, showed emergency responders trying to extinguish fires as smoke billowed from cars and houses. Meanwhile, Russia said it too faced a Ukrainian drone attack on Sunday, and that it intercepted and destroyed around 100 near Moscow and across the country's central and southern regions. Its defence ministry did not report any casualties. 'Massive' attack In Kyiv, the city's administration urged people to remain in shelters. Mayor Vitaliy Klitschko described it as a \"massive\" attack. He said: \"Explosions in the city. Air defence forces are working. The capital is under attack by enemy UAVs. Do not neglect your safety! Stay in shelters!\" Mr Klitschko said a student dormitory in the city's Holosiivskyi district was hit by a drone and one of the building's walls was on fire, while in Dniprovskyi district, a private house was destroyed. In her post on X, Ms Svyrydenko said: \"In Zhytomyr, three children were killed - 8, 12, and 17 years old. \"In Kyiv region, four more people were killed. Sixteen injured. \"In Khmelnytskyi, four dead, five wounded. \"In Mykolaiv, a Russian drone targeted a five-story apartment building, killing one and injuring five.\" She continued: \"Ukraine is standing. But we are asking-not for sympathy, but for action. Air defense. Sanctions. Pressure. Now.\" It came after at least 15 people were injured in attacks the previous night. In his statement on Sunday, Mr Zelenskyy thanked rescuers working across 30 of the country's towns and villages after the strikes, saying the targets were Kyiv and 11 other regions. \"Each such terrorist attack by Russia is a sufficient reason for new sanctions against Russia,\" he said, echoing comments he made after the previous overnight attack. \"Determination matters now - the determination of the United States, the determination of European countries, and all those in the world who want peace,\" he wrote. Read more:Why Russian troops are massing near 'fortress' city Final prisoners exchanged Despite the attacks, Russia and Ukraine completed their exchange of 1,000 prisoners each, marking a rare moment of co-operation in the war. The three-day exchange started on Friday and involved mostly prisoners of war, along with 120 civilians. On Sunday, both sides swapped 303 prisoners. Hundreds of thousands of soldiers on both sides are believed to have been wounded or killed in the war, although neither side has accurate casualty figures. Tens of thousands of Ukrainian civilians have also died."
    },
    {
        "title": "Humanitarian chief talks of Gaza 'catastrophe' after doctor's nine children killed",
        "description": "A medical charity chief has spoken out about the deaths of a doctor's nine children in an Israeli airstrike in Gaza, and the \"almost impossibility\" of providing care in the region.",
        "url": "https://news.sky.com/story/humanitarian-chief-talks-of-gaza-catastrophe-after-doctors-nine-children-killed-13374364",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-al-najjar_6925835.jpg?20250524212113",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-25 13:06:00",
        "Headline": "The bodies of nine of paediatrician Alaa al Najjar's 10 children, aged from seven months to 12 years old, arrived at the Nasser Medical Complex, in the city of Khan Younis, while she was on shift. Her only surviving son, Adam, 11, was left in a critical condition following the attack.",
        "Content": " A medical charity chief has spoken out about the deaths of a doctor's nine children in an Israeli airstrike in Gaza, and the \"almost impossibility\" of providing care in the region. Warning: This article contains graphic details of child deaths Chris Lockyear - the secretary general of Medecins Sans Frontieres (MSF), or Doctors Without Borders - told Sky News' Sunday Morning With Trevor Phillips the bodies of nine of paediatrician Alaa al Najjar's 10 children arrived at the Nasser Medical Complex, in the city of Khan Younis, while she was on shift. The attack in southern Gaza on Friday also left her husband, Hamdi al Najjar, severely wounded, and her only surviving son, Adam, aged 11, in a critical condition.  The dead brothers and sisters ranged in age from seven months to 12 years old. Mr Lockyear, who has been in contact with some of the MSF team working in the hospital, said: \"Our team on the ground were saying that not only were the bodies of her children delivered to her while she was on shift, not only were they burnt, but they were describing them as charcoaled.\" He continued: \"And this hospital, which is one of the very few partially remaining in Gaza to this day, has been subject to three airstrikes in the last two months - at one point killing two people in the surgical ward, which is just an illustration of the complexity, almost impossibility, of providing humanitarian services in Gaza at the moment.\" Hospitals in Gaza have repeatedly come under attack during the war. The Israel Defense Forces (IDF) claims Hamas has been hiding in them or in tunnels underneath. Four major hospitals have had to suspend medical services in the past week or so due to their proximity to hostilities and attacks, the World Health Organization (WHO) has said. There were 28 attacks on healthcare in Gaza during this period and 697 attacks in total since October 2023. Almost all of the 36 hospitals in the Gaza Strip are damaged or destroyed, according to the WHO, and only 19 remain operational. In total, the bodies of 79 people killed by Israeli strikes were taken to hospitals in a 24-hour period, Gaza's Hamas-run health ministry said on Saturday - a toll that does not include hospitals in the battered north, which it said were now inaccessible.  Mr Lockyear told Sky News there are \"no public hospitals open in the north anymore\", and added: \"We're seeing the weaponisation of humanitarian assistance. \"We're seeing the restriction of the basic essentials of life, such as water and electricity, preventing and further increasing the intolerable situation of this deliberate humanitarian catastrophe which is ongoing in Gaza.\" Israel says around 300 aid trucks have been allowed through since it lifted an 11-week blockade on Monday, but UN secretary general Antonio Guterres called it a \"teaspoon\" of what is needed with only about a third of the trucks having been transported to warehouses within Gaza due to insecurity. Uncle tells of fight to save children Ali al Najjar, the uncle of the nine children killed, was involved in trying to save them. \"We started to get them out, one by one,\" he told Sky News. \"We got out the third child. Of course, we couldn't identify the children. \"They were charred. They had no clothes, no face. They were remains.\" Read more from Sky News:Head of UN condemns 'teaspoon of aid' allowed into Gaza'Khan Younis looks like Stalingrad': British doctor describes horror Two British doctors working at Nasser Hospital described the attack as \"horrific\" and \"unimaginable\" for Dr Najjar. The IDF told Sky News: \"An IDF aircraft struck a number of suspects who were identified operating from a structure adjacent to IDF troops in the area of Khan Younis. \"The Khan Younis area is a dangerous war zone. Before beginning operations there, the IDF evacuated civilians from this area for their own safety. \"The claim regarding harm to uninvolved civilians is under review.\" 👉Listen to The World With Richard Engel And Yalda Hakim on your podcast app👈 The war in Gaza began when Hamas-led militants attacked southern Israel on 7 October 2023, killing some 1,200 people, mostly civilians, and kidnapping 251 others. Israel's military response has flattened large areas of Gaza and killed more than 53,000 Palestinians, mostly women and children, according to Gaza's Hamas-run health ministry, which does not differentiate between civilians and combatants in its count."
    },
    {
        "title": "More than 200,000 homes and Cannes Film Festival hit with power cut as arson 'suspected' in double outage",
        "description": "More than 200,000 households were temporarily left without electricity in southern France after power cuts, which threatened to disrupt the Cannes Film Festival.",
        "url": "https://news.sky.com/story/more-than-200000-homes-and-cannes-film-festival-hit-with-power-cut-as-arson-suspected-in-double-outage-13374478",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-france-cannes_6926817.jpg?20250525151226",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-25 15:31:00",
        "Headline": "Around 160,000 households lost power for around five hours on Saturday, while a further 45,000 suffered an overnight outage, which was rectified by early Sunday morning, with officials pointing to \"malicious acts\" as the cause.",
        "Content": "More than 200,000 households were temporarily left without electricity in southern France after power cuts, which threatened to disrupt the Cannes Film Festival. Around 160,000 households in the Alpes-Maritimes area lost power from around 10am on Saturday, officials said. Supplies were restored to all homes at around 3pm local time, on Saturday, hours before the festival's closing ceremony - which was unaffected. Arson is suspected after the outage, which followed an overnight fire at an electrical substation near the city, leading to a high-voltage power line falling. Laurent Hottiaux, the prefect for the area, pointed to \"serious acts of damage to electrical infrastructures\". He promised to use all means available to \"identify, track down, arrest and bring to justice the perpetrators\". A prefect is a high-ranking government official who represents the state in a French region. Authorities' suspicions were apparently confirmed on Sunday, when anarchists claimed responsibility for the outage in an anonymous statement reported by local outlet BFM, quoting public prosecutors in Grasse and Draguignan. In the statement posted by two anarchist groups, they said: \"On the eve of the Cannes Film Festival awards ceremony and gala evening, we sabotaged the main electrical substation supplying the Cannes metropolitan area and cut down the 225 kV line coming from Nice.\" Events early on Saturday were affected, Cannes Film Festival organisers said, but the Palais des Festivals - the Croisette's main venue - coped by switching to an independent power supply. Organisers said in a statement: \"All scheduled events and screenings, including the closing ceremony, will proceed as planned and under normal conditions.\" Train services were disrupted, along with some traffic lights, leading to jams and confusion, while screenings at the Cineum, one of the festival's satellite venues, were briefly suspended, organisers said. Some 45,000 homes were temporarily without electricity in nearby Nice and the neighbouring towns of Saint-Laurent-du-Var and Cagnes-sur-Mer, energy supplier Enedis said, after the weekend's second power outage overnight on Saturday. Read more on Sky News:Dissident director wins top Cannes prize'Catastrophe' in Gaza as children killed Power was restored on Sunday morning, but the city's mayor, Christian Estrosi, put it down to \"malicious acts\". Mr Estrosi said power was \"restored very quickly\", at 6am, Franceinfo said on its website. He ordered all sensitive electrical infrastructure in the city to be placed under police protection. Nice's deputy mayor, Gaël Nofri, said \"according to information provided by the firefighters, an access door to the transformer was forced\". The city's airport and tram network were affected."
    },
    {
        "title": "Johann Strauss' The Blue Danube to be broadcast into deep space",
        "description": "A piece of classical music is to be played into space to celebrate the 200th anniversary of the birth of its composer and the 50th year of the European Space Agency (ESA).",
        "url": "https://news.sky.com/story/johann-strauss-the-blue-danube-to-be-broadcast-into-deep-space-13374740",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-european-space-agency_6927444.jpg?20250525213043",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-25 20:30:00",
        "Headline": "A pre-recorded version of the \"most famous of all waltzes\" will be played out later this month and beamed into space, as well as being livestreamed with free public screenings across Europe.",
        "Content": "A piece of classical music is to be played into space to celebrate the 200th anniversary of the birth of its composer and the 50th year of the European Space Agency (ESA). The Blue Danube, by Johann Strauss, will be beamed into the cosmos as it's performed by the Vienna Symphony Orchestra on 31 May, and livestreamed with free public screenings in Vienna, Madrid, and New York. To avoid any technical issues, a pre-recorded version from the orchestra's rehearsal on the day before will be played out, while a live performance provides the accompaniment. The music, which famously featured in Stanley Kubrick's 1968 movie, 2001: A Space Odyssey, will pass the moon in just 1.5 seconds. Starting from the ESA's big antenna dish in Spain, part of the agency's deep-space network, it will pass Mars in 4.5 minutes, Jupiter in 37 minutes and go past Neptune in four hours. If all goes to plan, NASA's Voyager 1, the world's most distant spacecraft, will be reached within 23 hours, when the signals will be more than 15 billion miles in interstellar space. Tourism officials in Vienna, where Strauss was born in October 1825, said broadcasting \"the most famous of all waltzes\" into space corrects the \"cosmic mistake\" of his music being left out of previous interstellar broadcasts. Strauss was overlooked almost 50 years ago, when the Voyager Golden Records were played out on gold-plated copper phonograph records installed in NASA's Voyagers 1 and 2. The records contain sounds and images of Earth as well as 90 minutes of music. The late astronomer Carl Sagan led the committee that chose works by Bach, Beethoven, Mozart and Stravinsky, along with modern and Indigenous selections. Strauss was among those omitted from the 1977 broadcasts. NASA celebrated its 50th anniversary in 2008 by transmitting The Beatles' Across The Universe directly into deep space, and last year the agency beamed up Missy Elliott's The Rain (Supa Dupa Fly) towards Venus."
    },
    {
        "title": "Five skiers found dead on Swiss glacier",
        "description": "Five skiers have been found dead on a glacier above the Swiss mountain resort town of Zermatt.",
        "url": "https://news.sky.com/story/five-skiers-found-dead-on-swiss-glacier-13374695",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-zermatt-switzerland_6927393.jpg?20250525200032",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-25 18:28:00",
        "Headline": "The bodies were found after two hikers reported seeing abandoned skis near the 4,000m Rimpfischhorn mountain in the Valais Alps.",
        "Content": "Five skiers have been found dead on a glacier above the Swiss mountain resort town of Zermatt. The bodies were found after two hikers reported seeing abandoned skis near the 4,000m Rimpfischhorn mountain in the Valais Alps. Valais cantonal police said the victims were located on the Adler Glacier after aerial and ground searches. Authorities have opened an investigation, with weather conditions and avalanche activity in the region being examined. Three of the bodies were found on the debris of an avalanche a few hundred metres below where the skis were spotted, local airline Air Zermatt said. The other two were located higher up the mountain, it added. The airline's planes are deployed for search missions and other emergencies. Read more from Sky News:Mother and three children who died in house fire in London namedPremier League clubs at risk of legal actionRayner says she 'never' wants to be Labour leader Formal identification of the victims is underway, and their nationalities have not yet been released. Zermatt is one of Switzerland's premier ski resorts and is visited by British and European skiers."
    },
    {
        "title": "North Korean officials arrested after warship blunder 'brought dignity of country to collapse'",
        "description": "North Korea has arrested three officials said to be responsible for a major blunder during the launch of a new warship, state media has said.",
        "url": "https://news.sky.com/story/north-korean-officials-arrested-after-warship-blunder-brought-dignity-of-country-to-collapse-13374197",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-satellite-airbus-blue-tarp_6924766.jpg?20250523073605",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-25 01:31:00",
        "Headline": "Kim Jong Un did not look at all impressed by what happened during what was supposed to be a proud display of the country's naval power.",
        "Content": "North Korea has arrested three officials said to be responsible for a major blunder during the launch of a new warship, state media has said. The failed launch crippled the 5,000-tonne warship and was witnessed by Kim Jong Un. It ended up with the brand-new ship on its side, taking on water, as the leader looked on in dismay. After an investigation was launched, authorities arrested the chief engineer of the shipyard, the head of the hull construction workshop and the deputy manager for administrative affairs. A loss of balance was said to have led to the accident, state media said at the time. The North Korean dictator called it a \"criminal act\" and said it \"brought the dignity and self-respect of our state to a collapse\", as he vowed to punish those found responsible. Satellite images show the ship on its side, covered in huge wraps of blue tarpaulin. The mishap also likely occurred in front of a large crowd at the northeastern port of Chongjin, increasing the public humiliation for Mr Kim. He has ordered the ship be restored before a ruling party meeting in June. Read more from Sky News:UN chief condemns 'teaspoon' of aid allowed into GazaWhy Russian troops are massing near Ukraine's 'fortress city'Man charged over cargo ship that crashed into front garden State media previously reported that an inspection found no holes on the bottom of the ship, but the starboard hull was scratched and seawater flowed into the stern section through the rescue channel. The extent of damage was claimed to be \"not serious\"."
    },
    {
        "title": "Trump criticises Putin after deadly strikes across Ukraine",
        "description": "Donald Trump has threatened Russia with more sanctions after a series of deadly strikes across Ukraine, as he said of Vladimir Putin: \"What the hell happened to him?\"",
        "url": "https://news.sky.com/story/trump-criticises-putin-after-deadly-strikes-across-ukraine-13374767",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-vladimir-putin_6886237.jpg?20250414105847",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-25 22:34:00",
        "Headline": "Despite the US president talking up the chances of a peace deal, Russia launched the biggest aerial bombardment of the war so far on Sunday night. Three children were among those killed, as Ukraine's Volodymyr Zelenskyy called on allies for more support.",
        "Content": " Donald Trump has threatened Russia with more sanctions after a series of deadly strikes across Ukraine, as he said of Vladimir Putin: \"What the hell happened to him?\" The US president appeared aghast at the conduct of his counterpart in the Kremlin after drone and missile attacks in Kyiv and other Ukrainian cities left 12 people dead and dozens more injured. Trump criticises Putin - latest updates Speaking to reporters at an airport in New Jersey ahead of a flight back to Washington, Mr Trump said: \"I'm not happy with Putin. I don't know what's wrong with him.\" \"He's killing a lot of people,\" he added. \"I'm not happy about that.\" Mr Trump - who said he's \"always gotten along with\" Mr Putin - told reporters he would consider more sanctions against Moscow. \"He's sending rockets into cities and killing people, and I don't like it at all,\" he said. Later, on his Truth Social platform, the US president wrote that he has \"always had a very good relationship with Vladimir Putin of Russia, but something has happened to him. He has gone absolutely CRAZY!\" \"He is needlessly killing a lot of people... I've always said that he wants ALL of Ukraine, not just a piece of it, and maybe that's proving to be right, but if he does, it will lead to the downfall of Russia!\" Mr Trump also criticised Volodymyr Zelenskyy, saying the Ukrainian president was \"doing his country no favours by talking the way he does. Everything out of his mouth causes problems, I don't like it, and it better stop\". Ukraine said the barrage of strikes overnight into Sunday was the biggest aerial attack of the war so far, with 367 drones and missiles fired by Russian forces. It came despite Mr Trump repeatedly talking up the chances of a peace agreement. He even spoke to Mr Putin on the phone for two hours last week. Read more from Sky News:Trump says will postpone 50% tariffs on EU until July  'Shameful' attacks Mr Zelenskyy has said Ukraine is ready to sign a ceasefire deal, and suggested Russia isn't serious about signing one. In a statement after the latest attacks on his country, he urged the US and other national leaders to increase the pressure on Mr Putin, saying silence \"only encourages\" him. Mr Trump's envoy for the country, Keith Kellogg, later demanded a ceasefire, describing the Russian attacks as \"shameful\". Three children were among those killed in the attacks, explosions shaking the cities of Kyiv, Odesa, and Mykolaiv. Before the onslaught, Russia said it had faced a Ukrainian drone attack on Sunday. It said around 100 were intercepted and destroyed near Moscow and in central and southern regions. The violence has escalated despite Russia and Ukraine completing the exchange of 1,000 prisoners each over the past three days."
    },
    {
        "title": "The anniversary of George Floyd's murder is a reminder of America's racial divides",
        "description": "In Minneapolis, the spot where George Floyd was murdered has been turned into a mural.",
        "url": "https://news.sky.com/story/the-anniversary-of-george-floyds-murder-is-a-reminder-of-americas-racial-divides-13374198",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-racism-united-states_6926510.jpg?20250525033729",
        "type": "US",
        "Author": "Shingi Mararike, Sky News correspondent in Minneapolis",
        "Date Published": "2025-05-25 02:02:00",
        "Headline": "Sky News correspondent Shingi Mararike travelled to Minneapolis, where George Floyd was murdered, to see how, and if, things have changed five years on.",
        "Content": "By Shingi Mararike, Sky News correspondent in Minneapolis   In Minneapolis, the spot where George Floyd was murdered has been turned into a mural. His face is depicted in street art on a pavement covered in flowers, rosaries, and other trinkets left by people who have come to pay their respects in the last five years. His final moments, struggling for breath with white police officer Derek Chauvin's knee on his neck, were captured in a viral video that provoked anger, upset, and outrage. In Minneapolis and other parts of America, there were protests that at points boiled over into unrest. The events to mark the fifth anniversary of his death took on a very different tone - one of celebration and joy. Behind a wooden statue of a clenched fist on one end of a junction now renamed George Perry Floyd Square, people gathered in the morning. There was a moment of prayer before a brass band began to play and the group marched, while singing and chanting. 'It made us want to fight harder' Among those gathered in front of a makeshift stage built in the square were two of Floyd's family members - his cousin Paris and aunt Mahalia. To them, the man whose death sparked a racial reckoning in America and further afield, was simply \"Perry,\" a larger-than-life figure whose presence is missed at family gatherings. Speaking to me while the speakers behind them thumped and people danced, they didn't just reflect with sadness though. There was also pride at a legacy they felt has led to change. \"It made us want to fight harder,\" said Mahalia, \"and it's a feeling you cannot explain. When the whole world just stood up.\" Referring to Chauvin's eventual murder charge, Paris added: \"I think that from here on out, at least officers know that you're not going to slide through the cracks. Our voices are heard more.\" The tapestry of items outside the Cup Foods convenience store, now renamed Unity Foods, is not the only makeshift memorial in the area. A short walk away is the \"Say Their Names\" cemetery, an art installation honouring black people killed by the police. Meeting me there later in the day, activist Nikema Levy says the installation and George Floyd Square are called \"sacred spaces\" in the community. As someone who took to the streets at the time of Floyd's death and a community organiser for years before that, she's constantly stopped by people who want to speak to her. 'White supremacy on steroids' Once we do manage to speak, Levy reminds me of a wider political picture. One that goes beyond Minneapolis and is a fraught one. In the week of the anniversary, the US Department of Justice rolled back investigations into some of the largest police forces in the country, including in Minneapolis - a move she calls \"diabolical.\" \"That type of cruelty is what we have seen since Donald Trump took office on January 20th of this year,\" she continued. \"From my perspective, that is white supremacy on steroids. And it should come as no surprise that he would take these types of steps, because these are the things that he talked about on the campaign trail.\" Read more from Sky News:US-EU trade war fears reigniteArsenal secure historic Champions League crownScientists are on the hunt for dolphin poo  'True healing has never taken place' Trump has argued his policing reforms will help make America's communities safer. Even on a day of optimism, with a community coming together, Levy's words in front of headstones bearing the names of black people who have died at the hands of the police are a reminder of how deep the racial divides in America still are - a sentiment she leaves me with. \"From the days of slavery and Jim Crow in this country, we've just had the perception of healing, but true healing has never taken place,\" she says. \"So the aftermath of George Floyd is yet another example of what we already know.\""
    },
    {
        "title": "Donald Trump says he will postpone 50% tariffs on EU until July",
        "description": "Donald Trump says he will delay the imposition of 50% tariffs on goods entering the US from the EU until July, as the two sides attempt to negotiate a trade deal.",
        "url": "https://news.sky.com/story/donald-trump-says-us-and-eu-have-agreed-to-postpone-tariffs-13374764",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-us-president_6927491.jpg?20250525234812",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-25 22:07:00",
        "Headline": "The US president had threatened to bring in 50% tariffs from 1 June on goods coming from the EU, but that date has now been put back until 9 July to allow more time for negotiations with the bloc.",
        "Content": " Donald Trump says he will delay the imposition of 50% tariffs on goods entering the US from the EU until July, as the two sides attempt to negotiate a trade deal. It comes after the president of the European Commission, Ursula von der Leyen, said in a post on social media site X that she had spoken to Mr Trump and expressed that they needed until 9 July to \"reach a good deal\". The US president had last Friday threatened to bring in the 50% tariffs from 1 June, as European leaders said they were ready to respond with their own measures. But Mr Trump has now said that date has been put back to 9 July to allow more time for negotiations with the 27-member bloc, with the phone call appearing to smooth over tensions for now at least. Speaking on Sunday before boarding Air Force One for Washington DC, Mr Trump told reporters that he had spoken to Ms Von der Leyen and she \"wants to get down to serious negotiations\" and she vowed to \"rapidly get together and see if we can work something out\". 'We had a very nice call' The US president, in comments on his Truth Social platform, had reignited fears last Friday of a trade war between the two powers when he said talks were \"going nowhere\" and the bloc was \"very difficult to deal with\". Mr Trump told the media in Morristown, New Jersey, on Sunday that Ms Von der Leyen \"just called me... and she asked for an extension in the June 1st date. And she said she wants to get down to serious negotiation\". \"We had a very nice call and I agreed to move it. I believe July 9th would be the date. That was the date she requested. She said we will rapidly get together and see if we can work something out,\" the US president added. Shortly after, he wrote on Truth Social: \"I agreed to the extension - July 9, 2025 - It was my privilege to do so.\" On his so-called \"liberation day\" last month, Mr Trump unleashed tariffs on many of America's trade partners. But since then he's backed down in a spiralling tit-for-tat tariff face-off with China, and struck a deal with the UK. Read more from Sky News:Trump 'not happy' with PutinAt least 20 dead in Israeli strike in Gaza  Much of his most incendiary rhetoric on trade has been directed at Brussels, though, even going as far as to claim the EU was created to rip the US off. Responding to his 50% tariff threat, EU trade chief Maros Sefcovic said: \"EU-US trade is unmatched and must be guided by mutual respect, not threats. \"We stand ready to defend our interests.\""
    },
    {
        "title": "Donald Trump says he will postpone 50% tariffs on EU until July",
        "description": "Donald Trump says he will delay the imposition of 50% tariffs on goods entering the US from the EU until July, as the two sides attempt to negotiate a trade deal.",
        "url": "https://news.sky.com/story/donald-trump-says-us-and-eu-have-agreed-to-postpone-tariffs-13374764",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-us-president_6927491.jpg?20250525234812",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-25 22:07:00",
        "Headline": "The US president had threatened to bring in 50% tariffs from 1 June on goods coming from the EU, but that date has now been put back until 9 July to allow more time for negotiations with the bloc.",
        "Content": " Donald Trump says he will delay the imposition of 50% tariffs on goods entering the US from the EU until July, as the two sides attempt to negotiate a trade deal. It comes after the president of the European Commission, Ursula von der Leyen, said in a post on social media site X that she had spoken to Mr Trump and expressed that they needed until 9 July to \"reach a good deal\". The US president had last Friday threatened to bring in the 50% tariffs from 1 June, as European leaders said they were ready to respond with their own measures. But Mr Trump has now said that date has been put back to 9 July to allow more time for negotiations with the 27-member bloc, with the phone call appearing to smooth over tensions for now at least. Speaking on Sunday before boarding Air Force One for Washington DC, Mr Trump told reporters that he had spoken to Ms Von der Leyen and she \"wants to get down to serious negotiations\" and she vowed to \"rapidly get together and see if we can work something out\". 'We had a very nice call' The US president, in comments on his Truth Social platform, had reignited fears last Friday of a trade war between the two powers when he said talks were \"going nowhere\" and the bloc was \"very difficult to deal with\". Mr Trump told the media in Morristown, New Jersey, on Sunday that Ms Von der Leyen \"just called me... and she asked for an extension in the June 1st date. And she said she wants to get down to serious negotiation\". \"We had a very nice call and I agreed to move it. I believe July 9th would be the date. That was the date she requested. She said we will rapidly get together and see if we can work something out,\" the US president added. Shortly after, he wrote on Truth Social: \"I agreed to the extension - July 9, 2025 - It was my privilege to do so.\" On his so-called \"liberation day\" last month, Mr Trump unleashed tariffs on many of America's trade partners. But since then he's backed down in a spiralling tit-for-tat tariff face-off with China, and struck a deal with the UK. Read more from Sky News:Trump 'not happy' with PutinAt least 20 dead in Israeli strike in Gaza  Much of his most incendiary rhetoric on trade has been directed at Brussels, though, even going as far as to claim the EU was created to rip the US off. Responding to his 50% tariff threat, EU trade chief Maros Sefcovic said: \"EU-US trade is unmatched and must be guided by mutual respect, not threats. \"We stand ready to defend our interests.\""
    },
    {
        "title": "Gail's backer plots rare move with bid for steak chain Flat Iron",
        "description": "A backer of Gail's bakeries is in advanced talks to acquire Flat Iron, one of Britain's fastest-growing steak restaurant chains.",
        "url": "https://news.sky.com/story/gails-backer-plots-rare-move-with-bid-for-steak-chain-flat-iron-13374219",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-steak-meat-flat-iron_6926532.jpg?20250525074436",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-25 06:21:00",
        "Headline": "McWin Capital Partners and TriSpan are in exclusive talks to acquire Flat Iron, a fast-growing and profitable chain of steakhouses, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A backer of Gail's bakeries is in advanced talks to acquire Flat Iron, one of Britain's fastest-growing steak restaurant chains. Sky News has learnt that McWin Capital Partners, which specialises in investments across the \"food ecosystem\", has teamed up with TriSpan, another private equity investor, to buy a large stake in Flat Iron. Restaurant industry sources said McWin would probably take the largest economic interest in Flat Iron if the deal completes. They added that the two buyers were in exclusive discussions, with a deal possible in approximately a month's time. The valuation attached to Flat Iron was unclear on Sunday. Flat Iron launched in 2012 in London's Shoreditch and now has roughly 20 sites open. The chain is solidly profitable, with its latest accounts showing underlying profits of £5.7m in the year to the end of August. It already has private equity backing in the form of Piper, a leading investor in consumer brands, which injected £10m into the business in 2017. Flat Iron was founded by Charlie Carroll, who retains an interest in it, but the company is now run by former Byron restaurant boss Tom Byng. Houlihan Lokey, the investment bank, has been advising Flat Iron on the process. McWin has reportedly been in talks to take full control of Gail's while TriSpan's portfolio has included restaurant operators such as the Vietnamese chain Pho and Rosa's, a Thai food chain. A spokesman for McWin declined to comment."
    },
    {
        "title": "Rayner 'hoping' for winter fuel update within weeks - and says she 'never' wants to be Labour leader",
        "description": "Deputy Prime Minister Angela Rayner has told Sky News she \"hopes\" there will be an update on the winter fuel U-turn within weeks.",
        "url": "https://news.sky.com/story/rayner-hoping-for-winter-fuel-update-within-weeks-and-says-she-never-wants-to-be-labour-leader-13374253",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-angela-rayner_6926599.jpg?20250525095847",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-25 08:16:00",
        "Headline": "Last week, Sir Keir Starmer said an update on the U-turn would come at the next \"fiscal event\" - thought to be the autumn budget. Angela Rayner has now suggested it could be as soon as early June.",
        "Content": " Deputy Prime Minister Angela Rayner has told Sky News she \"hopes\" there will be an update on the winter fuel U-turn within weeks. Ms Rayner also used her interview on Sunday Morning With Trevor Phillips to say she \"never\" wants to lead her party. Some had suggested recent leaks of her plans for when taxes should change were her testing the waters to run a challenge against Sir Keir Starmer. Politics latest: Badenoch on two-child cap  Earlier this week, the prime minister confirmed his party was looking to make changes to its controversial slashing of winter fuel payments to pensioners at an upcoming \"fiscal event\". Little clarity was provided on when this would be - the budget in the autumn thought the most likely. Ms Rayner has now suggested the 11 June spending review in just over a fortnight is her preferred date. She told Sky News: \"I think that we've got the upcoming spending review, and I'm sure that the chancellor will set it out when we've got the opportunity - at the first opportunity Trevor she will set out what we'll be able to do.\" Asked if changes might be announced at the review, Ms Rayner said: \"I hope so, but I don't know. But I hope so. \"I mean, the prime minister's announced it, so logically to me that indicates that the prime minister wants to do something in this area. \"And if the prime minister wants to do that, I'm sure the chancellor is going to look at how we can achieve that.\" Read more:Starmer confirms U-turn on winter fuelDecision needs 'strong enough' economyAnalysis: It could have profound consequences Never wants to be leader Some might suggest Ms Rayner's stance was a bid to push Downing Street into an announcement faster than it previously wanted. It would add to rumours the deputy prime minister is unhappy with the way Sir Keir and Rachel Reeves are running the government. However, when asked by Trevor Phillips if she wanted to lead her party, Ms Rayner was unequivocal. \"No. I'm very happy and honoured to be deputy prime minister of this country,\" she said. \"And I've got a lot in my in-tray to prove that I can do the job that I'm doing and deliver on the milestones for the people in this country.\" She continued: \"I have no desire to go for the leadership of the Labour Party.\" 👉 Listen to Electoral Dysfunction on your podcast app 👈 Asked to say the word \"never\", Ms Rayner repeated \"never\". Ms Rayner also confirmed a leak inquiry was under way after her proposals on tax and spend sent to the chancellor ended up published in The Daily Telegraph."
    },
    {
        "title": "Nigel Farage's big announcement will pile more pressure on PM",
        "description": "No U-turn comes without a political cost.",
        "url": "https://news.sky.com/story/two-child-benefit-cap-pressure-grows-on-starmer-as-reforms-policy-move-parks-tanks-on-labours-lawn-13374705",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-farage_6927488.jpg?20250525233805",
        "type": "Politics",
        "Author": "Ali Fortescue",
        "Date Published": "2025-05-25 18:59:00",
        "Headline": "Nigel Farage is set to exploit Labour's winter fuel payments climbdown to make a grab for the party's traditional voter-base by calling for the two-child benefit cap to be scrapped, a move that could further aggravate government splits over the issue.",
        "Content": "\n          Political correspondent\n              @AliFortescue\n No U-turn comes without a political cost. This weekend, it has become clear there is a price to pay for Sir Keir Starmer's decision to row back on winter fuel payment cuts. One MP said in a text message: \"We all want to see more\", while former prime minister Gordon Brown told Sky News this week the two-child benefit cap was \"pretty discriminatory\" and could be scrapped. The cap, which prevents parents from claiming child tax credit or universal credit for more than two children, is a symbolic sore for Labour that saw seven MPs suspended from the party last year. Now it's back to cause more trouble. A Downing Street source suggests little has changed in the last week, and looking at the cap has always been part of the (now delayed) Child Poverty Strategy.  But, beyond the whispers behind the scenes, one thing has overtly changed this weekend - growing pressure from Nigel Farage. We expect Reform UK to announce this week that it will reinstate winter fuel payments and drop the cap. Farage is parking his tanks on Labour's lawn, trying to tap into working-class votes on uncomfortable territory for Starmer. How would they pay for it? A combination of closing asylum hotels, cutting aid, and scrapping net-zero targets, the party says. Headline-grabbing move The beauty of not being in power is not having to make all the sums add up right now, and it is a headline-grabbing announcement that will, at the very least, reignite the conversation about the two-child cap. It's also a reminder that Reform UK, who were beaten by Labour in 89 out of the 98 constituencies they came second in last year, have set their sights beyond the Conservatives. As for the Tories, who introduced the measure in 2017, leader Kemi Badenoch is clear, saying: \"If you can't afford to have lots of children, then you shouldn't do so\".  Blue water between Tories and Reform UK So, there is blue water between the Conservatives and Reform, but it's the prime minister and his party that Farage is targeting now, and Labour is unclear on where it stands. Deputy leader Angela Rayner told Sunday Morning With Trevor Phillips that \"lifting any measures that alleviate poverty is not a bad idea\". More from Sky News:PM's winter fuel claim 'not credible'Starmer-Reeves Downing St 'rift' With the spending review fast approaching, Starmer and Chancellor Rachel Reeves will be working out the actual cost, beyond the political one, of rowing back on winter fuel payment cuts. But will the anger that the policy ignited among some Labour MPs end there? Or will it move to another uncomfortable subject? As one MP puts it: \"If there's money for pensioners, why not children?\""
    },
    {
        "title": "Get building or lose your land: Labour propose strict new demands for developers",
        "description": "House builders will be forced to commit to delivery time frames to get planning permission under new government rules - and those who leave sites unfinished could lose their land to local authorities.",
        "url": "https://news.sky.com/story/get-building-or-lose-your-land-labour-propose-strict-new-demands-for-developers-13374199",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-cambridgeshire-angela-rayner_6773952.jpg?20241212100932",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-25 02:13:00",
        "Headline": "Angela Rayner, the housing secretary, has said \"years of inaction\" has left Britain without the homes it needs. The government has made house building one of its biggest priorities for this parliament.",
        "Content": "House builders will be forced to commit to delivery time frames to get planning permission under new government rules - and those who leave sites unfinished could lose their land to local authorities. Developers will also have to submit annual progress reports to councils to show they're on track, and any who get the all-clear to build and then don't deliver may face fines too. Large housing sites can take more than 10 years to build, but the government wants those with more affordable housing built twice as fast. The tough new rules are designed to help the government with its target of building 1.5 million new homes by the general election of 2029, with Angela Rayner saying \"it's time for developers to roll up their sleeves\". The deputy prime minister and housing secretary said the proposals would put an end to \"sites with planning permission gathering dust for decades, while a generation struggle to get on the housing ladder\". Sir Keir Starmer has regularly spoken of wanting to back the \"builders\" rather than the \"blockers\", and has repeatedly railed against NIMBY culture that he believes has held the country back. Labour have already unveiled sweeping reforms to the planning system, including allowing more applications to be signed off by dedicated officers rather than elected councillors. Major developers will also only have to deal with one regulator when proposing new projects.  Read more politics news:PM could scrap divisive policyPost Office hero attacks governmentFirst renationalised rail service begins The latest plans - which have been welcomed by the housing charity Shelter - will be detailed in a government document published on Sunday. Shelter's Alicia Walker said too many developers \"drag their heels when building new homes to keep prices high and make bigger profits\". But she also urged the government to ensure plenty more social housing is built. The Tories said they supported measures to speed up house building, but claimed Labour were placing too many conditions upon developers."
    },
    {
        "title": "Johann Strauss' The Blue Danube to be broadcast into deep space",
        "description": "A piece of classical music is to be played into space to celebrate the 200th anniversary of the birth of its composer and the 50th year of the European Space Agency (ESA).",
        "url": "https://news.sky.com/story/johann-strauss-the-blue-danube-to-be-broadcast-into-deep-space-13374740",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-european-space-agency_6927444.jpg?20250525213043",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-25 20:30:00",
        "Headline": "A pre-recorded version of the \"most famous of all waltzes\" will be played out later this month and beamed into space, as well as being livestreamed with free public screenings across Europe.",
        "Content": "A piece of classical music is to be played into space to celebrate the 200th anniversary of the birth of its composer and the 50th year of the European Space Agency (ESA). The Blue Danube, by Johann Strauss, will be beamed into the cosmos as it's performed by the Vienna Symphony Orchestra on 31 May, and livestreamed with free public screenings in Vienna, Madrid, and New York. To avoid any technical issues, a pre-recorded version from the orchestra's rehearsal on the day before will be played out, while a live performance provides the accompaniment. The music, which famously featured in Stanley Kubrick's 1968 movie, 2001: A Space Odyssey, will pass the moon in just 1.5 seconds. Starting from the ESA's big antenna dish in Spain, part of the agency's deep-space network, it will pass Mars in 4.5 minutes, Jupiter in 37 minutes and go past Neptune in four hours. If all goes to plan, NASA's Voyager 1, the world's most distant spacecraft, will be reached within 23 hours, when the signals will be more than 15 billion miles in interstellar space. Tourism officials in Vienna, where Strauss was born in October 1825, said broadcasting \"the most famous of all waltzes\" into space corrects the \"cosmic mistake\" of his music being left out of previous interstellar broadcasts. Strauss was overlooked almost 50 years ago, when the Voyager Golden Records were played out on gold-plated copper phonograph records installed in NASA's Voyagers 1 and 2. The records contain sounds and images of Earth as well as 90 minutes of music. The late astronomer Carl Sagan led the committee that chose works by Bach, Beethoven, Mozart and Stravinsky, along with modern and Indigenous selections. Strauss was among those omitted from the 1977 broadcasts. NASA celebrated its 50th anniversary in 2008 by transmitting The Beatles' Across The Universe directly into deep space, and last year the agency beamed up Missy Elliott's The Rain (Supa Dupa Fly) towards Venus."
    },
    {
        "title": "Former BBC executive and presenter Alan Yentob dies",
        "description": "Alan Yentob, the former BBC presenter and executive, has died aged 78.",
        "url": "https://news.sky.com/story/former-bbc-executive-and-presenter-alan-yentob-dies-13374355",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-alan-yentob-bbc_6926730.jpg?20250525135343",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-25 12:44:00",
        "Headline": "Yentob's wife Philippa Walker says he was \"creative in every cell of his body\", and that he was a \"profoundly moral man\".",
        "Content": "Alan Yentob, the former BBC presenter and executive, has died aged 78. A statement from his family, shared by the BBC, said Yentob died on Saturday. His wife Philippa Walker said: \"For Jacob, Bella and I, every day with Alan held the promise of something unexpected. Our life was exciting, he was exciting. \"He was curious, funny, annoying, late, and creative in every cell of his body. But more than that, he was the kindest of men and a profoundly moral man. He leaves in his wake a trail of love a mile wide.\"  Read more on Sky News:First renationalised train service startsMy week with Prince William, the quiet disruptor Yentob joined the BBC as a trainee in 1968 and held a number of positions - including controller of BBC One and BBC Two, director of television, and head of music and art. He was also the director of BBC drama, entertainment, and children's TV. Yentob launched CBBC and CBeebies, and his drama commissions included Pride And Prejudice and Middlemarch. The TV executive was made a Commander of the Order of the British Empire (CBE) by the King in 2024 for services to the arts and media. In a tribute, the BBC's director-general Tim Davie said: \"Alan Yentob was a towering figure in British broadcasting and the arts. A creative force and a cultural visionary, he shaped decades of programming at the BBC and beyond, with a passion for storytelling and public service that leave a lasting legacy. \"Above all, Alan was a true original. His passion wasn't performative - it was personal. He believed in the power of culture to enrich, challenge and connect us.\" BBC Radio 4 presenter Amol Rajan described him on Instagram as \"such a unique and kind man: an improbable impresario from unlikely origins who became a towering figure in the culture of post-war Britain. \"I commend his spirit to the living.\""
    },
    {
        "title": "Cannes: Dissident Iranian director wins Palme d'Or at film festival",
        "description": "Dissident Iranian director Jafar Pahani - who has been arrested several times in Iran for his filmmaking - has won the prestigious Palme d'Or accolade at the 78th Cannes Film Festival.",
        "url": "https://news.sky.com/story/cannes-dissident-iranian-director-wins-palme-dor-at-film-festival-13374327",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-jafar-pahani-cannes_6926694.jpg?20250525131733",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-25 11:46:00",
        "Headline": "Jafar Panahi - who is a vocal critic of his home country's regime - was previously imprisoned and banned from filmmaking by the Tehran government.",
        "Content": "Dissident Iranian director Jafar Pahani - who has been arrested several times in Iran for his filmmaking - has won the prestigious Palme d'Or accolade at the 78th Cannes Film Festival. The 64-year-old, who was banned from filmmaking in Iran, premiered his political thriller It Was Just an Accident on 20 May. The film was one of 22 competing for the top prize - and was up against well-known directors including Wes Anderson, Richard Linklater, and Ari Aster. Inspired by his own experiences in prison, the film tells the story of a released dissident who kidnaps a man who resembles someone who tortured him in prison. Soon, the protagonist questions whether more violence is the right approach to ensure justice. Read more on Sky News:Zelenskyy criticises US after latest assault on UkraineFirst renationalised train service startsDeputy PM says she 'never' wants to be Labour leader The filmmaker, whose appearance at the festival was his first in 15 years due to a travel ban, used his acceptance speech to speak out against the regime. He said: \"Hoping that we will reach a day when no one will tell us what to wear or not wear, what to do or not do\", in seeming reference to Iran's strict modesty rules for women. The 2022 death of Mahsa Amini, a young woman who was in the custody of Iran's morality police for allegedly violating modesty laws, led to the country's largest civil unrest since the 1979 revolution. The film, like the rest of his published works since 2010, was shot in secret. The director told Reuters he vows to return to his home country after the festival - despite the risk of being prosecuted. He said: \"Win or not, I was going to go back either way. Don't be afraid of challenges.\" Pahani has now won the top prizes at all three major European festivals - after winning the Golden Lion at Venice for The Circle in 2000, and Berlin's Golden Bear for Taxi in 2015."
    },
    {
        "title": "More than 200,000 homes and Cannes Film Festival hit with power cut as arson 'suspected' in double outage",
        "description": "More than 200,000 households were temporarily left without electricity in southern France after power cuts, which threatened to disrupt the Cannes Film Festival.",
        "url": "https://news.sky.com/story/more-than-200000-homes-and-cannes-film-festival-hit-with-power-cut-as-arson-suspected-in-double-outage-13374478",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-france-cannes_6926817.jpg?20250525151226",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-25 15:31:00",
        "Headline": "Around 160,000 households lost power for around five hours on Saturday, while a further 45,000 suffered an overnight outage, which was rectified by early Sunday morning, with officials pointing to \"malicious acts\" as the cause.",
        "Content": "More than 200,000 households were temporarily left without electricity in southern France after power cuts, which threatened to disrupt the Cannes Film Festival. Around 160,000 households in the Alpes-Maritimes area lost power from around 10am on Saturday, officials said. Supplies were restored to all homes at around 3pm local time, on Saturday, hours before the festival's closing ceremony - which was unaffected. Arson is suspected after the outage, which followed an overnight fire at an electrical substation near the city, leading to a high-voltage power line falling. Laurent Hottiaux, the prefect for the area, pointed to \"serious acts of damage to electrical infrastructures\". He promised to use all means available to \"identify, track down, arrest and bring to justice the perpetrators\". A prefect is a high-ranking government official who represents the state in a French region. Authorities' suspicions were apparently confirmed on Sunday, when anarchists claimed responsibility for the outage in an anonymous statement reported by local outlet BFM, quoting public prosecutors in Grasse and Draguignan. In the statement posted by two anarchist groups, they said: \"On the eve of the Cannes Film Festival awards ceremony and gala evening, we sabotaged the main electrical substation supplying the Cannes metropolitan area and cut down the 225 kV line coming from Nice.\" Events early on Saturday were affected, Cannes Film Festival organisers said, but the Palais des Festivals - the Croisette's main venue - coped by switching to an independent power supply. Organisers said in a statement: \"All scheduled events and screenings, including the closing ceremony, will proceed as planned and under normal conditions.\" Train services were disrupted, along with some traffic lights, leading to jams and confusion, while screenings at the Cineum, one of the festival's satellite venues, were briefly suspended, organisers said. Some 45,000 homes were temporarily without electricity in nearby Nice and the neighbouring towns of Saint-Laurent-du-Var and Cagnes-sur-Mer, energy supplier Enedis said, after the weekend's second power outage overnight on Saturday. Read more on Sky News:Dissident director wins top Cannes prize'Catastrophe' in Gaza as children killed Power was restored on Sunday morning, but the city's mayor, Christian Estrosi, put it down to \"malicious acts\". Mr Estrosi said power was \"restored very quickly\", at 6am, Franceinfo said on its website. He ordered all sensitive electrical infrastructure in the city to be placed under police protection. Nice's deputy mayor, Gaël Nofri, said \"according to information provided by the firefighters, an access door to the transformer was forced\". The city's airport and tram network were affected."
    }
]