[
    {
        "title": "Palace confirms dates of Trump's state visit - as King and Queen to host him at Windsor Castle",
        "description": "The dates for Donald Trump's state visit to the UK have been announced, with the US president due to be welcomed by the King from 17 to 19 September.",
        "url": "https://news.sky.com/story/palace-confirms-dates-of-trumps-state-visit-as-king-and-queen-to-host-him-at-windsor-castle-13396282",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-trump-king_6962874.jpg?20250711173821",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-07-13 20:16:00",
        "Headline": "In April, the US president let slip details about what he called his second \"fest\", referring to his second state visit to the UK, after being hosted by the late Queen in 2019.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n The dates for Donald Trump's state visit to the UK have been announced, with the US president due to be welcomed by the King from 17 to 19 September. Buckingham Palace also confirmed that President Trump and first lady Melania will be hosted by the King and Queen at Windsor Castle. It was expected that the three-day state visit would take place in September after Mr Trump let slip earlier in April that he believed that was when his second \"fest\" was being planned for. Windsor was also anticipated to be the location after the US president told reporters in the Oval Office that the letter from the King said Windsor would be the setting. Refurbishment works at Buckingham Palace also meant that Windsor was used last week for French President Emmanuel Macron's visit. This will be Mr Trump's second state visit to the UK, an unprecedented gesture towards an American leader, having previously been invited to Buckingham Palace in 2019. He has also been to Windsor Castle before, in 2018, but despite the considerable military pageantry of the day, and some confusion around inspecting the guard, it was simply for tea with Queen Elizabeth II. Further details of what will happen during the three-day visit in September will be announced in due course. \n                  Chelsea win FIFA Club World Cup with victory over PSG - as Donald Trump presents trophy\n                 \n                  Donald Trump threatens to revoke Rosie O'Donnell's US citizenship\n                 \n                  Donald Trump announces 30% tariff on imports from EU\n                 On Friday, Sky News revealed it is now unlikely that the US president will address parliament, usually an honour given to visiting heads of state as part of their visit. Some MPs had raised significant concerns about him being given the privilege. But the House of Commons will not be sitting at the time of Mr Trump's visit as it will rise for party conference season on the 16 September, meaning the president will not be able to speak in parliament as President Macron did during his state visit this week. However, the House of Lords will be sitting.  In February this year, Prime Minister Sir Keir Starmer presented the US president with the letter from the King inviting him to visit during a meeting at the White House. After reading it, Mr Trump said it was a \"great, great honour\", adding \"and that says at Windsor - that's really something\". In the letter, the King suggested they might meet at Balmoral or Dumfries House in Scotland first before the much grander state visit. However, it is understood that, although all options were explored, complexities in both the King and Mr Trump's diaries meant it wasn't possible. Read more from Sky News:Is the UK ready for a 'Trump-fest'?Elton and Jagger at royal banquetKing and Trump won't hold private meeting This week, it emerged that Police Scotland are planning for a summer visit from the US president, which is likely to see him visit one or both of his golf clubs in Aberdeenshire and Ayrshire, and require substantial policing resources and probably units to be called in from elsewhere in the UK. Precedent for second-term US presidents, who have already made a state visit, is usually tea or lunch with the monarch at Windsor Castle, as was the case for George W Bush and Barack Obama."
    },
    {
        "title": "Fireball at Southend Airport after small plane crashes",
        "description": "Southend Airport has been closed until further notice after a small plane crashed - as video footage emerged showing the aftermath of a huge fireball.",
        "url": "https://news.sky.com/story/fireball-at-southend-airport-after-small-plane-crashes-13396214",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-southend-airport_6964128.png?20250713180944",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-13 15:42:00",
        "Headline": "Images posted online show a large cloud of black smoke near the Essex airport. Emergency services have said multiple fire and ambulance crews are at the scene. ",
        "Content": " Southend Airport has been closed until further notice after a small plane crashed - as video footage emerged showing the aftermath of a huge fireball. Images posted online showed large flames and a cloud of black smoke following the incident on Sunday afternoon. Essex Police said it responded to \"reports of a collision involving one 12-metre plane\" shortly before 4pm. \"We are working with all emergency services at the scene now and that work will be ongoing for several hours,\" the statement said. \"We would please ask the public to avoid this area where possible while this work continues.\" Southend Airport said it would be \"closed until further notice\" due to the \"serious incident\". \"We ask that any passengers due to travel (on Monday) via London Southend Airport contact their airline for information and advice,\" it added. It has been reported that the plane involved in the incident is a Beech B200 Super King Air. According to flight-tracking service Flightradar, it took off at 3.48pm and was bound for Lelystad, a city in the Netherlands. Pilots 'waved' to families watching planes  One man, who was at the airport with his wife and children, told Sky News the plane crashed within seconds of taking off. John Johnson said the pilots \"waved\" at his family as they taxied the aircraft. \"We all waved [back] at them,\" he continued. \"They carried on taxiing to their take-off point and turned around. \"Then they throttled up the engines and passed by us. The aircraft took off and within a few seconds it had a steep bank angle to its left.\" The aircraft then \"almost seemed to invert and unfortunately crashed,\" he said. \"There was a large fireball.\"  'Airport was in lockdown' Wren Stranix, 16, from Woodbridge in Suffolk, was in another aircraft waiting to take off for Newquay, Cornwall, with her family and boyfriend when the plane came down. They watched from their aircraft as the emergency services arrived and were not able to leave their seats. \"The flight attendant didn't know what was going on,\" she told Sky News. \"They said the plane had exploded and they didn't know if it was safe or not. The airport was in lockdown.\" They were eventually allowed back in the terminal to wait before all flights were cancelled. Southend Airport said the incident involved \"a general aviation aircraft\". Read more from Sky News:Liverpool honours Jota at first game since his deathTrump threatens to revoke comedian's US citizenship After the incident, EasyJet - one of just a few airlines that uses the airport - said all of its remaining flights to and from Southend had been \"diverted to alternative airports or are no longer able to operate\". The airline said it has contacted customers who were due to travel on Sunday. Anyone due to fly on Monday should check online for up-to-date information, it added. Essex County Fire and Rescue Service said four crews, along with off-road vehicles, have attended the scene. The East of England Ambulance Service said four ambulances, four hazardous area response team vehicles and an air ambulance had been sent to the incident. David Burton-Sampson, the MP for Southend West and Leigh, asked people to keep away from the area and \"allow the emergency services to do their work\" in a post on social media. Transport Secretary Heidi Alexander said she was \"monitoring the situation closely and receiving regular updates\". Essex Police have set up a dedicated public portal and phone line where people can contact them about the crash at https://esxpol.uk/LIbaz and on 0800 0961011. Chief Superintendent Morgan Cronin said: \"In these very early stages it is vital we gather the information we need, and continue supporting the people of Essex.\" He added: \"We are working closely with all at the scene, as well as the Air Accident Investigation Branch, to establish what has happened today and why.\""
    },
    {
        "title": "IDF blames 'technical error' after Gaza officials say children collecting water killed in strike",
        "description": "The Israeli military says it missed its intended target after Gaza officials said 10 Palestinians - including six children - were killed in a strike at a water collection point.",
        "url": "https://news.sky.com/story/idf-blames-technical-error-after-gaza-officials-say-children-collecting-water-killed-in-strike-13396138",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-gaza-nuseirat_6964047.jpg?20250713153240",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-13 12:17:00",
        "Headline": "The Israel Defence Forces (IDF) said it had intended to hit an Islamic Jihad militant but a \"technical error\" had caused the missile to fall \"dozens of metres from the target\".",
        "Content": " The Israeli military says it missed its intended target after Gaza officials said 10 Palestinians - including six children - were killed in a strike at a water collection point. Another 17 people were wounded in the strike on a water distribution point in Nuseirat refugee camp, said Ahmed Abu Saifan, an emergency physician at Al Awda Hospital. The Israel Defence Forces (IDF) said it had intended to hit an Islamic Jihad militant but a \"technical error with the munition\" had caused the missile to fall \"dozens of metres from the target\". The IDF said the incident is under review, adding that it \"works to mitigate harm to uninvolved civilians as much as possible\" and \"regrets any harm to uninvolved civilians\". Officials at Al Awda Hospital said it received 10 bodies after the Israeli strike on the water collection point and six children were among the dead. Ramadan Nassar, who lives in the area, said around 20 children and 14 adults were lined up Sunday morning to fill up water. When the strike occurred, everyone ran and some, including those who were severely injured, fell to the ground, he said. At least 32 people were killed in Israeli strikes in the Gaza Strip on Sunday, local health officials said. Two women and three children were among nine killed after an Israeli strike on a home in the central town of Zawaida, officials at Al Aqsa Martyrs Hospital said. Israel has claimed it hit more than 150 targets in the besieged enclave in the past day. The latest strikes come after the Israel military opened fire near an aid centre in Rafah on Saturday. The Red Cross said 31 people were killed. The IDF has said it fired \"warning shots\" near the aid distribution site but it was \"not aware of injured individuals\" as a result.  International correspondent A father carried the body of his young son through the streets of the Nuseirat refugee camp in central Gaza, his surviving child beside him.  The boy was one of at least 10 people killed when an Israeli airstrike hit civilians gathering water. At Al Awda Hospital, emergency rooms are overwhelmed, and the dead lie in corridors. \n The Israeli military says the strike was a technical error, claiming it had been targeting a militant from Islamic Jihad. Hours later, another strike hit the busy Samar Junction market in Gaza City, killing several, including Dr Ahmed Qandil, a surgeon en route to work at the Baptist Hospital. As civilian casualties rise, ceasefire negotiations in Doha are faltering.  Palestinian and Israeli sources say the talks are stalled over withdrawal terms.  Hamas has rejected Israeli maps that would leave 40% of Gaza under Israeli control. The group demands a return to lines held during the last truce. Disagreements also persist over humanitarian aid and a permanent end to the war.  The US-backed plan envisions a 60-day truce and phased hostage releases - but with divisions deepening, a deal remains elusive. The war in Gaza started in response to Hamas's attack on Israel on 7 October 2023, which killed 1,200 people and saw about 250 taken hostage. More than 58,000 Palestinians have since been killed, with more than half being women and children, according to Gaza's health ministry, which does not distinguish between civilians and combatants in its count. Read more:Palestinians shot while seeking aid, says paramedicDozens of MPs call for UK to recognise Palestine as state US President Donald Trump has said he is closing in on another ceasefire agreement that would see more hostages released and potentially wind down the war. But after two days of talks this week with Israeli Prime Minister Benjamin Netanyahu, there were no signs of a breakthrough, as a new sticking point emerged over the deployment of Israeli troops during the truce. Hamas still holds 50 hostages, with fewer than half of them believed to be alive, after most of the rest were released in ceasefire agreements or other deals."
    },
    {
        "title": "Extreme weather becoming the norm in the UK, Met Office warns",
        "description": "Britain's climate is changing rapidly, with records regularly being smashed and extremes of heat and rainfall becoming the norm, the Met Office has warned.",
        "url": "https://news.sky.com/story/extreme-weather-becoming-the-norm-in-the-uk-met-office-warns-13396206",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-london-weather_6964076.jpg?20250713164123",
        "type": "Home",
        "Author": "Thomas Moore",
        "Date Published": "2025-07-13 23:01:00",
        "Headline": "A new report from the Met Office \"reinforces the clear and urgent signals of our changing climate\", an expert has said.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n Britain's climate is changing rapidly, with records regularly being smashed and extremes of heat and rainfall becoming the norm, the Met Office has warned. In an updated assessment of the UK's climate it says heatwaves and periods of flood or drought are becoming more frequent and more intense. The report shows the period between October 2023 and March 2024 was the wettest winter period in England and Wales in over 250 years. Spring 2024 was also the warmest on record. It says the increasing extremes are \"typical of recent years\". Mike Kendon, a Met Office climate scientist and lead author of the State of the UK Climate report, said: \"Every year that goes by is another upward step on the warming trajectory our climate is on. \"Observations show that our climate in the UK is now notably different to what it was just a few decades ago. \n                  Typhoon Danas: Two people killed and hundreds injured as 135mph winds hit Taiwan\n                 \n                  Why did deadly Texas floods catch people by surprise?\n                 \n                  UK records hottest day of year so far - as 40C highs close schools in Europe\n                 \"We are now seeing records being broken very frequently as we see temperature and rainfall extremes being the most affected by our changing climate.\"  The report compares the decade up to 2024 with long-term averages between 1961 and 1990. While the average temperature is increasing, the hottest summer days and coldest winter nights have warmed twice as fast. The climate is also becoming wetter - with the extra rain falling between October and March. Over the last decade, rainfall over the six-month winter period was 16% higher than the average between 1961 and 1990. Effects of UK climate change 'deeply concerning'  Chief executive of the Royal Meteorological Society, Professor Liz Bentley, said the report \"reinforces the clear and urgent signals of our changing climate\". \"While long-term averages are shifting, it is the extreme heat, intense rainfall and droughts that are having the most immediate and dramatic effects on people and nature,\" she said. \"This report is not just a record of change, but a call to action.\" Read more:Nine deaths linked to 'silent killer' heatwaveWhat the weather has in store for July  Kathryn Brown, director of climate change at The Wildlife Trusts, said the effects of climate change on UK wildlife were already \"deeply concerning\". \"From swifts dropping out of the sky during heatwaves to trees flowering much earlier than they have in the past,\" she said. \"We are particularly worried about the effects of droughts on our nature reserves.\""
    },
    {
        "title": "Economists say the cost of living crisis is over - here's why many households disagree",
        "description": "Talk to economists and they will tell you that the cost of living crisis is over.",
        "url": "https://news.sky.com/story/economists-say-the-cost-of-living-crisis-is-over-heres-why-many-households-disagree-13396244",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-cost-living_6964213.jpg?20250713211047",
        "type": "Home",
        "Author": "Ed Conway",
        "Date Published": "2025-07-13 23:01:00",
        "Headline": "The best measure of economic \"feelgood factor\" is to subtract inflation and taxes from people's nominal pay - with the outcomes showing how some households are more fortunate than others.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Talk to economists and they will tell you that the cost of living crisis is over. They will point towards charts showing that while inflation is still above the Bank of England's 2% target, it has come down considerably in recent years, and is now \"only\" hovering between 3% and 4%. So why does the cost of living still feel like such a pressing issue for so many households? The short answer is because, depending on how you define it, it never ended. Economists like to focus on the change in prices over the past year, and certainly on that measure inflation is down sharply, from double-digit levels in recent years. But if you look over the past four years then the rate of change is at its highest since the early 1990s. But even that understates the complexity of economic circumstances facing households around the country. For if you want a sense of how current financial conditions really feel in people's pockets, you really ought to offset inflation against wages, and then also take account of the impact of taxes. \n                  Is the cost of living crisis over? Here's what the data reveals\n                 \n                  Bosses of Octopus Energy and SSE clash over 'postcode pricing' proposals\n                 \n                  Tens of thousands to get compensation over forced prepayment meters\n                 That is a complex exercise - in part because no two households' experience is alike. But recent research from the Resolution Foundation illustrates some of the dynamics going on beneath the surface, and underlines that for many households the cost of living crisis is still very real indeed.  The place to begin here is to recall that perhaps the best measure of economic \"feelgood factor\" is to subtract inflation and taxes from people's nominal pay. You end up with a statistic showing your real household disposable income. Consider the projected pattern over the coming years. For a household earning £50,000, earnings are expected to increase by 10% between 2024/25 and 2027/28. Subtract inflation projected over that period and all of a sudden that 10% drops to 2.5%. Now subtract the real increase in payments of National Insurance and taxes and it's down to 0.2%. Now subtract projected council tax increases and all of a sudden what began as a 10% increase is actually a 0.1% decrease. Read more:UK economy figures 'not as bad as they look', analysts sayMore options than ever for savers to beat inflation  Of course, the degree of change in your circumstances can differ depending on all sorts of factors. Some earners (especially those close to tax thresholds, which in this case includes those on £50,000) feel the impact of tax changes more than others. Pensioners and those who own their homes outright benefit from a comparatively lower increase in housing costs in the coming years than those paying mortgages and (especially) rent. Nor is everyone's experience of inflation the same. In general, lower-income households pay considerably more of their earnings on essentials, like housing costs, food and energy. Some of those costs are going up rapidly - indeed, the UK faces higher power costs than any other developed economy. But the ultimate verdict provides some clear patterns. Pensioners can expect further increases in their take-home pay in the coming years. Those who own their homes outright and with mortgages can likely expect earnings to outpace extra costs. But others are less fortunate. Those who rent their homes privately are projected to see sharp falls in their household income - and children are likely to see further falls in their economic welfare too."
    },
    {
        "title": "Chelsea win FIFA Club World Cup with victory over PSG - as Donald Trump presents trophy",
        "description": "Chelsea have thrashed European champions Paris Saint-Germain to win FIFA's Club World Cup - with Donald Trump joining the players at the trophy presentation.",
        "url": "https://news.sky.com/story/chelsea-win-fifa-club-world-cup-with-victory-over-psg-as-donald-trump-watches-from-stands-13396284",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-trump-palmer_6964269.jpg?20250713230122",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-13 20:18:00",
        "Headline": "The French side, who had a player sent off, were heavy favourites to win the final in New Jersey but were 3-0 down before half-time.",
        "Content": "Chelsea have thrashed European champions Paris Saint-Germain to win FIFA's Club World Cup - with Donald Trump joining the players at the trophy presentation. The US president gave the Chelsea players their winners' medals and the Club World Cup trophy following the final at the MetLife Stadium in New Jersey. Mr Trump also gave PSG their runners-up medals. The French side were the heavy favourites to win the final but were 3-0 down within 43 minutes. They eventually finished the game with 10 men after midfielder Joao Neves pulled Chelsea defender Marc Cucurella's hair in the 85th minute. Chelsea talisman Cole Palmer had scored almost identical finishes in the 22nd and 30th minute to give the West London side a two-goal advantage a third of the way through the tie. The England international later played a neat pass to Brazilian forward Joao Pedro - who lifted the ball over PSG keeper Gianluigi Donnarumma to give the Blues a three-goal advantage just before half-time. PSG came out strong at the start of the second half and nearly narrowed the deficit in the 53rd minute when Ousmane Dembele struck at goal from six yards. However, it was well-saved by Chelsea keeper Robert Sanchez who put in a strong performance all night for the west London side. Goalscorer Pedro received a standing ovation from the Chelsea fans as he was replaced by Liam Delap on the 67th minute. Following the final whistle, players from both sides appeared to be involved in a large altercation on the pitch. PSG coach Luis Enrique appeared to grab at Pedro's neck while he and Donnarumma confronted Chelsea players. The pre-match programme, which included a performance from Robbie Williams and a US Air Force flyover, overran and led to a kick-off delay. A musical medley which featured J Balvin, Doja Cat, Tems and Chris Martin from Coldplay took place at half-time at the 82,500-seater stadium as the pitch was watered in the high heat. Read more:Trump threatens to revoke US comedian's citizenshipFarmer becomes first person to die during ICE raids After the game, Mr Trump also presented Sanchez with the best goalkeeper award, Palmer with the golden ball trophy for the best player of the tournament, and PSG player Desire Doue with the silver ball trophy for the second-best player of the tournament. The Club World Cup attracted controversy as critics said it would further congest the football calendar and risk the health of players, especially because the featured teams are some of the most successful in the world, meaning they often remain in other knockout competitions until the latter stages. Real Madrid star Kylian Mbappe said: \"We play like already, 60 games in the year... you have so many competitions. And we are happy to play, but when it's too much, it's too much.\" \"I think we have to respect the health of the players,\" the Frenchman continued."
    },
    {
        "title": "Jannik Sinner wins first Wimbledon title after beating defending champion Carlos Alcaraz",
        "description": "World number one Jannik Sinner has defeated defending champion Carlos Alcaraz to win his first Wimbledon title.",
        "url": "https://news.sky.com/story/jannik-sinner-wins-first-wimbledon-title-after-beating-defending-champion-carlos-alcaraz-13396215",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jannik-sinner_6964183.jpg?20250713194018",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-13 15:33:00",
        "Headline": "The Italian won in four sets to put his Paris heartbreak behind after him after he lost to Alcaraz in an epic French Open final 35 days ago.",
        "Content": "World number one Jannik Sinner has defeated defending champion Carlos Alcaraz to win his first Wimbledon title. The Italian won the match in four sets to prevent the Spanish world number two from winning his third Wimbledon final in a row. They played in front of a crowd which included the Prince and Princess of Wales and their children George and Charlotte. Sinner, 23, has won his first Wimbledon final in what was his latest high stakes encounter with 22-year-old Alcaraz. Many tennis fans feel the pair are developing an exciting rivalry that could endure for many years to come. Sinner's Wimbledon success comes only 35 days after he lost to Alcaraz in what many judge to be the greatest ever French Open final.  Alcaraz showed incredible reserves of energy to win a five-hour 29-minute match at Roland Garros to deny Sinner a third consecutive Grand Slam title. However, Sinner was able to overcome his Paris heartbreak with victory in the SW19 postcode of London. At one stage he was forced to delay his serve at a crucial moment in the match when a champagne cork nearly hit him - prompting boos from the crowd and a rebuke from British umpire Alison Hughes. Sinner said after he was presented with the Wimbledon trophy: \"I had a very tough loss in Paris. But it doesn't really matter how you win or lose the important tournaments, you just have to understand what you did wrong, try to work on that. \"This is for sure one of the reasons why I'm holding this trophy. I'm very happy that I held my nerves. It's an amazing feeling.\" Read more:Tearful tennis star reveals words of comfort from KateSwiatek wins Wimbledon women's singles final 6-0, 6-0 Following his Wimbledon final defeat, Alcaraz said: \"It's difficult to lose. First of all I have to congratulate Jannik once again. It's a really well-deserved trophy. Unbelievable two weeks here in London playing great tennis. \"Really proud of everything I'm doing. At the beginning of the season I struggled a little bit, on the court, off the court, but then suddenly I started to bring joy on the court again. I just want to keep going, to keep bringing joy on the court.\" The royals in attendance were joined by A-list stars Keira Knightley, Matthew McConaughey and Nicole Kidman. What happened during the Wimbledon final? Alcaraz was certainly not holding back, slamming down a 136mph ace to start the match and hitting 139mph in his second service game - a new record for the Spaniard, until he twice clocked 140mph later in the contest. Alcaraz went on to win the first set 6-4 before Sinner took the second set by the same score. The Italian then won the third set 6-4 to increase the pressure on Alcaraz. Many observers speculated whether Sinner would start to have memories of his French Open final loss to Alcaraz - when the Spaniard recovered from two sets down to win the epic contest on the Roland Garros clay. However, Sinner is renowned for his composure and it was fully on show when he went on to win the fourth set 6-4 to put his Paris heartbreak behind him and lift the Wimbledon trophy. He secured the victory in three hours and four minutes. The victory, which Sinner celebrated by thrusting both arms aloft, puts his rivalry with Alcaraz back on a knife edge. He has now won four Grand Slam titles compared to Alcaraz's five and has ended a five-match losing streak against the Spaniard. It is also Sinner's first Grand Slam title away from his favoured hard courts, while Alcaraz suffered a first major final defeat, unable to find the same magic that had brought him back from the brink on the clay."
    },
    {
        "title": "England through to Women's Euros quarter-finals - and send Wales crashing out",
        "description": "England have made it through to the Women's Euros knockout stages after hammering Wales 6-1. ",
        "url": "https://news.sky.com/story/england-through-to-womens-euros-quarter-finals-and-send-wales-crashing-out-13396171",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-england-euro_6964228.jpg?20250713215935",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-13 13:23:00",
        "Headline": "The Lionesses have finished second in Group D and will play Sweden in the first knockout stage.",
        "Content": "England have made it through to the Women's Euros knockout stages after hammering Wales 6-1.  The tournament's defending champions went 4-0 up in the first half and their first goal came thanks to a penalty from Georgia Stanway just 13 minutes in. England were initially awarded a free-kick when the midfielder was tripped by Carrie Jones, but a lengthy VAR review eventually concluded the foul had been committed inside the area. Ella Toone then made it two in the 21st minute, before Lauren Hemp and Alessia Russo scored in the 30th and 44th minutes respectively. The fifth goal came from substitute Beth Mead in the 72nd minute, before Hannah Cain scored a consolation goal for Wales four minutes later. Substitute Aggie Beever-Jones cemented England's win with the sixth goal - which was her first in the competition - in the closing stages of the game. The result means the Lionesses will play in the Euro 2025 quarter-finals - while Wales are out of the competition, having finished bottom of Group D with zero points. Read more:Why this Women's Euros is so appealingChelsea win FIFA's Club World Cup The Lionesses - who have finished second in the group with six points - will face Sweden in Zurich on Thursday. Sports correspondent Was it only a week ago – after losing to France – England were meant to be in crisis? It doesn't look like that anymore.\n\n The European champions' smiles and swagger are very definitely back and they're into the quarter-finals.\n Against Wales, England won as expected – emphatically. The only surprise, maybe conceding when the game was already far beyond Wales's reach. Hannah Cain provided a memorable second goal at these Euros as the tournament debutants conceded the most goals in the group stage. But then was it a surprise to hear England fans celebrating not winning the group? At one point, when the Netherlands were beating France, that looked possible before they lost 4-2. And that means England play Sweden in the quarter-finals – avoiding Germany who face France. So no reunion with the tough team the Lionesses had to beat in the Euro 2022 final. But beware. Unlike England, Sweden won all three group stage matches. England lost 2-1 to France in the first of the Group D games, before salvaging their Euros campaign with a 4-0 win over Netherlands. England and Wales faced each other in the Swiss city of St Gallen, as Netherlands and France played in Basel. France's 5-2 win put them at the top of the group with nine points and means their next game will be against Germany on Saturday."
    },
    {
        "title": "Liverpool strikers copy Jota's 'crocodile celebration' after scoring in first game since his death",
        "description": "Liverpool players and fans have paid tribute to Dioga Jota at the Reds' first game since the Portuguese forward died in a car crash with his brother.",
        "url": "https://news.sky.com/story/liverpool-players-and-fans-pay-tribute-to-diogo-jota-at-first-game-since-his-death-13396178",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-cody-gakpo_6964095.jpg?20250713170834",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-13 13:35:00",
        "Headline": "The Merseyside club's supporters held Jota banners in the stands at the Deepdale Stadium for their side's pre-season friendly away match against Preston.",
        "Content": " Liverpool players and fans have paid tribute to Dioga Jota at the Reds' first game since the Portuguese forward died in a car crash with his brother. The Merseyside club's supporters held Jota banners in the stands at the Deepdale Stadium during their side's pre-season friendly away match against Preston. There was a rendition of the club's anthem \"You'll Never Walk Alone\" which was performed by Claudia Rose Maguire - wife of former Preston player Sean Maguire - shortly before the match kicked off at 3pm. Preston captain Ben Whiteman laid a wreath in front of the visiting supporters before the game. In a reference to the late Liverpool player's shirt number, an image of Jota and Silva was displayed on the Deepdale's big screen in the 20th minute. Fans of both clubs broke into applause and a rendition of a song about Jota. Around 13 minutes later, Liverpool player Conor Bradley put his side 1-0 up before celebrating in a subdued manner with his teammates. Liverpool striker Darwin Nunez scored in the 53rd minute to make it 2-0 and marked the goal by doing Jota's trademark \"crocodile celebration\", where he would do a snapping motion with his arms. Nunez also sat on the grass and pretended to play a computer game - another of Jota's celebrations. Preston pulled one back in the 83rd minute before Liverpool forward Cody Gakpo made it 3-1 five minutes later. Gakpo also did Jota's famous crocodile celebration after scoring the goal. Newly-married Jota, 28, died alongside his 25-year-old brother Andre Silva, a footballer who played in Portugal's second division with Penafiel, when the Lamborghini they were travelling in crashed in Zamora in northern Spain on 3 July. At Sunday's match, Liverpool players and supporters were seen in deep reflection during a one-minute silence in memory of the brothers moments before kick off. Both teams' players wore black armbands during the match. Children were among those who paid tribute in the stands with one boy holding a banner reading: \"Forever missed, forever loved, forever remembered, forever our number 20.\" It was one of many banners paying tribute to Jota, while some fans have been seen wearing T-shirts and scarves featuring the footballer's image. Liverpool supporters also sung the first of many renditions of a song about Jota 20 minutes before kick-off. The tributes come after Liverpool retired the number 20 shirt Jota wore at all levels of the club, including the men's and women's first teams and academy squads, in his memory.  The match programme for Sunday's game featured a black and white image on the front showing Jota holding the Premier League trophy he won with the Reds in April. Liverpool teammates joined members of Jota's family, including his wife Rute, at a huge memorial site outside Anfield on Friday. There had been questions over whether Sunday's game would go ahead as Liverpool players - several of whom attended the funeral of the two brothers in Portugal last Saturday - were given extra time before reporting for pre-season training. Mohamed Salah captained a young Liverpool side for the game, with Giorgi Mamardashvili getting the nod in goal and fellow new signings Jeremie Frimpong and Milos Kerkez among the substitutes. New £100m midfielder Florian Wirtz was not in the match day squad. Liverpool manager Arne Slot, who also visited Anfield to pay his respects last week, said in an interview on Liverpool FC's website before today's match: \"We will always carry him with us in our hearts, in our thoughts, wherever we go.\" He added: \"In any moment we are here, we will carry him with us in our thoughts and in our hearts. To retire his shirt is the one thing we could, should and have done... \"I think what I take comfort in [is that] in the last month of his life, he was a champion in everything. A champion for his family, which is the main and most important thing, because he got married.\" He added: \"A champion for his country because he won the Nations League, [with] a country that he cared about so much, because he also wore the flag when we had celebrations. \"And of course, a champion for us by winning the Premier League.\" Police said this week that all the evidence so far suggests Jota was the driver in the vehicle at the time of the crash."
    },
    {
        "title": "Palace confirms dates of Trump's state visit - as King and Queen to host him at Windsor Castle",
        "description": "The dates for Donald Trump's state visit to the UK have been announced, with the US president due to be welcomed by the King from 17 to 19 September.",
        "url": "https://news.sky.com/story/palace-confirms-dates-of-trumps-state-visit-as-king-and-queen-to-host-him-at-windsor-castle-13396282",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-trump-king_6962874.jpg?20250711173821",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-07-13 20:16:00",
        "Headline": "In April, the US president let slip details about what he called his second \"fest\", referring to his second state visit to the UK, after being hosted by the late Queen in 2019.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n The dates for Donald Trump's state visit to the UK have been announced, with the US president due to be welcomed by the King from 17 to 19 September. Buckingham Palace also confirmed that President Trump and first lady Melania will be hosted by the King and Queen at Windsor Castle. It was expected that the three-day state visit would take place in September after Mr Trump let slip earlier in April that he believed that was when his second \"fest\" was being planned for. Windsor was also anticipated to be the location after the US president told reporters in the Oval Office that the letter from the King said Windsor would be the setting. Refurbishment works at Buckingham Palace also meant that Windsor was used last week for French President Emmanuel Macron's visit. This will be Mr Trump's second state visit to the UK, an unprecedented gesture towards an American leader, having previously been invited to Buckingham Palace in 2019. He has also been to Windsor Castle before, in 2018, but despite the considerable military pageantry of the day, and some confusion around inspecting the guard, it was simply for tea with Queen Elizabeth II. Further details of what will happen during the three-day visit in September will be announced in due course. \n                  Chelsea win FIFA Club World Cup with victory over PSG - as Donald Trump presents trophy\n                 \n                  Donald Trump threatens to revoke Rosie O'Donnell's US citizenship\n                 \n                  Donald Trump announces 30% tariff on imports from EU\n                 On Friday, Sky News revealed it is now unlikely that the US president will address parliament, usually an honour given to visiting heads of state as part of their visit. Some MPs had raised significant concerns about him being given the privilege. But the House of Commons will not be sitting at the time of Mr Trump's visit as it will rise for party conference season on the 16 September, meaning the president will not be able to speak in parliament as President Macron did during his state visit this week. However, the House of Lords will be sitting.  In February this year, Prime Minister Sir Keir Starmer presented the US president with the letter from the King inviting him to visit during a meeting at the White House. After reading it, Mr Trump said it was a \"great, great honour\", adding \"and that says at Windsor - that's really something\". In the letter, the King suggested they might meet at Balmoral or Dumfries House in Scotland first before the much grander state visit. However, it is understood that, although all options were explored, complexities in both the King and Mr Trump's diaries meant it wasn't possible. Read more from Sky News:Is the UK ready for a 'Trump-fest'?Elton and Jagger at royal banquetKing and Trump won't hold private meeting This week, it emerged that Police Scotland are planning for a summer visit from the US president, which is likely to see him visit one or both of his golf clubs in Aberdeenshire and Ayrshire, and require substantial policing resources and probably units to be called in from elsewhere in the UK. Precedent for second-term US presidents, who have already made a state visit, is usually tea or lunch with the monarch at Windsor Castle, as was the case for George W Bush and Barack Obama."
    },
    {
        "title": "Fireball at Southend Airport after small plane crashes",
        "description": "Southend Airport has been closed until further notice after a small plane crashed - as video footage emerged showing the aftermath of a huge fireball.",
        "url": "https://news.sky.com/story/fireball-at-southend-airport-after-small-plane-crashes-13396214",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-southend-airport_6964128.png?20250713180944",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-13 15:42:00",
        "Headline": "Images posted online show a large cloud of black smoke near the Essex airport. Emergency services have said multiple fire and ambulance crews are at the scene. ",
        "Content": " Southend Airport has been closed until further notice after a small plane crashed - as video footage emerged showing the aftermath of a huge fireball. Images posted online showed large flames and a cloud of black smoke following the incident on Sunday afternoon. Essex Police said it responded to \"reports of a collision involving one 12-metre plane\" shortly before 4pm. \"We are working with all emergency services at the scene now and that work will be ongoing for several hours,\" the statement said. \"We would please ask the public to avoid this area where possible while this work continues.\" Southend Airport said it would be \"closed until further notice\" due to the \"serious incident\". \"We ask that any passengers due to travel (on Monday) via London Southend Airport contact their airline for information and advice,\" it added. It has been reported that the plane involved in the incident is a Beech B200 Super King Air. According to flight-tracking service Flightradar, it took off at 3.48pm and was bound for Lelystad, a city in the Netherlands. Pilots 'waved' to families watching planes  One man, who was at the airport with his wife and children, told Sky News the plane crashed within seconds of taking off. John Johnson said the pilots \"waved\" at his family as they taxied the aircraft. \"We all waved [back] at them,\" he continued. \"They carried on taxiing to their take-off point and turned around. \"Then they throttled up the engines and passed by us. The aircraft took off and within a few seconds it had a steep bank angle to its left.\" The aircraft then \"almost seemed to invert and unfortunately crashed,\" he said. \"There was a large fireball.\"  'Airport was in lockdown' Wren Stranix, 16, from Woodbridge in Suffolk, was in another aircraft waiting to take off for Newquay, Cornwall, with her family and boyfriend when the plane came down. They watched from their aircraft as the emergency services arrived and were not able to leave their seats. \"The flight attendant didn't know what was going on,\" she told Sky News. \"They said the plane had exploded and they didn't know if it was safe or not. The airport was in lockdown.\" They were eventually allowed back in the terminal to wait before all flights were cancelled. Southend Airport said the incident involved \"a general aviation aircraft\". Read more from Sky News:Liverpool honours Jota at first game since his deathTrump threatens to revoke comedian's US citizenship After the incident, EasyJet - one of just a few airlines that uses the airport - said all of its remaining flights to and from Southend had been \"diverted to alternative airports or are no longer able to operate\". The airline said it has contacted customers who were due to travel on Sunday. Anyone due to fly on Monday should check online for up-to-date information, it added. Essex County Fire and Rescue Service said four crews, along with off-road vehicles, have attended the scene. The East of England Ambulance Service said four ambulances, four hazardous area response team vehicles and an air ambulance had been sent to the incident. David Burton-Sampson, the MP for Southend West and Leigh, asked people to keep away from the area and \"allow the emergency services to do their work\" in a post on social media. Transport Secretary Heidi Alexander said she was \"monitoring the situation closely and receiving regular updates\". Essex Police have set up a dedicated public portal and phone line where people can contact them about the crash at https://esxpol.uk/LIbaz and on 0800 0961011. Chief Superintendent Morgan Cronin said: \"In these very early stages it is vital we gather the information we need, and continue supporting the people of Essex.\" He added: \"We are working closely with all at the scene, as well as the Air Accident Investigation Branch, to establish what has happened today and why.\""
    },
    {
        "title": "Heidi Alexander says 'fairness' will be government's 'guiding principle' when it comes to taxes at next budget",
        "description": "Another hint that tax rises are coming in this autumn's budget has been given by a senior minister.",
        "url": "https://news.sky.com/story/heidi-alexander-says-fairness-will-be-governments-guiding-principle-when-it-comes-to-taxes-at-next-budget-13396075",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-rachel-reeves-budget_6732970.jpg?20241030112346",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-13 09:21:00",
        "Headline": "The transport secretary told Sky News tax rises were not discussed \"directly\" between ministers last week at a cabinet away day. But the Tories accused her of \"barely disguised\" hints that they're on the way.",
        "Content": " Another hint that tax rises are coming in this autumn's budget has been given by a senior minister. Speaking to Sunday Morning with Trevor Phillips, Transport Secretary Heidi Alexander was asked if Sir Keir Starmer and the rest of the cabinet had discussed hiking taxes in the wake of the government's failed welfare reforms, which were shot down by their own MPs. Trevor Phillips asked specifically if tax rises were discussed among the cabinet last week - including on an away day on Friday. Politics Hub: Catch up on the latest Tax increases were not discussed \"directly\", Ms Alexander said, but ministers were \"cognisant\" of the challenges facing them. Asked what this means, Ms Alexander added: \"I think your viewers would be surprised if we didn't recognise that at the budget, the chancellor will need to look at the OBR forecast that is given to her and will make decisions in line with the fiscal rules that she has set out. \"We made a commitment in our manifesto not to be putting up taxes on people on modest incomes, working people. We have stuck to that.\" Ms Alexander said she wouldn't comment directly on taxes and the budget at this point, adding: \"So, the chancellor will set her budget. I'm not going to sit in a TV studio today and speculate on what the contents of that budget might be. \"When it comes to taxation, fairness is going to be our guiding principle.\" Read more:Reeves won't rule out tax risesWhat is a wealth tax and how would it work? 👉Listen to Politics at Sam and Anne's on your podcast app👈       Afterwards, shadow home secretary Chris Philp told Phillips: \"That sounds to me like a barely disguised reference to tax rises coming in the autumn.\" He then went on to repeat the Conservative attack lines that Labour are \"crashing the economy\".  Mr Philp then attacked the prime minister as \"weak\" for being unable to get his welfare reforms through the Commons. Discussions about potential tax rises have come to the fore after the government had to gut its welfare reforms. Sir Keir had wanted to change Personal Independence Payments (PIP), but a large Labour rebellion forced him to axe the changes. With the savings from these proposed changes - around £5bn - already worked into the government's sums, they will now need to find the money somewhere else. The general belief is that this will take the form of tax rises, rather than spending cuts, with more money needed for military spending commitments, as well as other areas of priority for the government, such as the NHS."
    },
    {
        "title": "Extreme weather becoming the norm in the UK, Met Office warns",
        "description": "Britain's climate is changing rapidly, with records regularly being smashed and extremes of heat and rainfall becoming the norm, the Met Office has warned.",
        "url": "https://news.sky.com/story/extreme-weather-becoming-the-norm-in-the-uk-met-office-warns-13396206",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-london-weather_6964076.jpg?20250713164123",
        "type": "UK",
        "Author": "Thomas Moore",
        "Date Published": "2025-07-13 23:01:00",
        "Headline": "A new report from the Met Office \"reinforces the clear and urgent signals of our changing climate\", an expert has said.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n Britain's climate is changing rapidly, with records regularly being smashed and extremes of heat and rainfall becoming the norm, the Met Office has warned. In an updated assessment of the UK's climate it says heatwaves and periods of flood or drought are becoming more frequent and more intense. The report shows the period between October 2023 and March 2024 was the wettest winter period in England and Wales in over 250 years. Spring 2024 was also the warmest on record. It says the increasing extremes are \"typical of recent years\". Mike Kendon, a Met Office climate scientist and lead author of the State of the UK Climate report, said: \"Every year that goes by is another upward step on the warming trajectory our climate is on. \"Observations show that our climate in the UK is now notably different to what it was just a few decades ago. \n                  Typhoon Danas: Two people killed and hundreds injured as 135mph winds hit Taiwan\n                 \n                  Why did deadly Texas floods catch people by surprise?\n                 \n                  UK records hottest day of year so far - as 40C highs close schools in Europe\n                 \"We are now seeing records being broken very frequently as we see temperature and rainfall extremes being the most affected by our changing climate.\"  The report compares the decade up to 2024 with long-term averages between 1961 and 1990. While the average temperature is increasing, the hottest summer days and coldest winter nights have warmed twice as fast. The climate is also becoming wetter - with the extra rain falling between October and March. Over the last decade, rainfall over the six-month winter period was 16% higher than the average between 1961 and 1990. Effects of UK climate change 'deeply concerning'  Chief executive of the Royal Meteorological Society, Professor Liz Bentley, said the report \"reinforces the clear and urgent signals of our changing climate\". \"While long-term averages are shifting, it is the extreme heat, intense rainfall and droughts that are having the most immediate and dramatic effects on people and nature,\" she said. \"This report is not just a record of change, but a call to action.\" Read more:Nine deaths linked to 'silent killer' heatwaveWhat the weather has in store for July  Kathryn Brown, director of climate change at The Wildlife Trusts, said the effects of climate change on UK wildlife were already \"deeply concerning\". \"From swifts dropping out of the sky during heatwaves to trees flowering much earlier than they have in the past,\" she said. \"We are particularly worried about the effects of droughts on our nature reserves.\""
    },
    {
        "title": "England through to Women's Euros quarter-finals - and send Wales crashing out",
        "description": "England have made it through to the Women's Euros knockout stages after hammering Wales 6-1. ",
        "url": "https://news.sky.com/story/england-through-to-womens-euros-quarter-finals-and-send-wales-crashing-out-13396171",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-england-euro_6964228.jpg?20250713215935",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-13 13:23:00",
        "Headline": "The Lionesses have finished second in Group D and will play Sweden in the first knockout stage.",
        "Content": "England have made it through to the Women's Euros knockout stages after hammering Wales 6-1.  The tournament's defending champions went 4-0 up in the first half and their first goal came thanks to a penalty from Georgia Stanway just 13 minutes in. England were initially awarded a free-kick when the midfielder was tripped by Carrie Jones, but a lengthy VAR review eventually concluded the foul had been committed inside the area. Ella Toone then made it two in the 21st minute, before Lauren Hemp and Alessia Russo scored in the 30th and 44th minutes respectively. The fifth goal came from substitute Beth Mead in the 72nd minute, before Hannah Cain scored a consolation goal for Wales four minutes later. Substitute Aggie Beever-Jones cemented England's win with the sixth goal - which was her first in the competition - in the closing stages of the game. The result means the Lionesses will play in the Euro 2025 quarter-finals - while Wales are out of the competition, having finished bottom of Group D with zero points. Read more:Why this Women's Euros is so appealingChelsea win FIFA's Club World Cup The Lionesses - who have finished second in the group with six points - will face Sweden in Zurich on Thursday. Sports correspondent Was it only a week ago – after losing to France – England were meant to be in crisis? It doesn't look like that anymore.\n\n The European champions' smiles and swagger are very definitely back and they're into the quarter-finals.\n Against Wales, England won as expected – emphatically. The only surprise, maybe conceding when the game was already far beyond Wales's reach. Hannah Cain provided a memorable second goal at these Euros as the tournament debutants conceded the most goals in the group stage. But then was it a surprise to hear England fans celebrating not winning the group? At one point, when the Netherlands were beating France, that looked possible before they lost 4-2. And that means England play Sweden in the quarter-finals – avoiding Germany who face France. So no reunion with the tough team the Lionesses had to beat in the Euro 2022 final. But beware. Unlike England, Sweden won all three group stage matches. England lost 2-1 to France in the first of the Group D games, before salvaging their Euros campaign with a 4-0 win over Netherlands. England and Wales faced each other in the Swiss city of St Gallen, as Netherlands and France played in Basel. France's 5-2 win put them at the top of the group with nine points and means their next game will be against Germany on Saturday."
    },
    {
        "title": "Amazon driver dies after van hit by train at level crossing in Kent",
        "description": "An Amazon delivery driver has died after a van was hit by a train at a level crossing in Kent.",
        "url": "https://news.sky.com/story/amazon-driver-dies-after-van-hit-by-train-at-level-crossing-in-kent-13396278",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-police-crash-stock_6964256.jpg?20250713230600",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-13 19:50:00",
        "Headline": "It is understood the victim was delivering Amazon parcels when the incident happened in Teynham.",
        "Content": "An Amazon delivery driver has died after a van was hit by a train at a level crossing in Kent. Police were called to the railway line in Teynham, near Sittingbourne, shortly after 12.45pm on Sunday following reports of a train striking a van. Emergency crews attended but the person died at the scene. Southeastern Railway, which runs services on the line, said no services were running between Gillingham and Faversham as major disruption was expected until the end of the day. No one else was injured in the incident. An Amazon spokesperson said: \"This is a terrible incident and our thoughts and deepest sympathies are with the delivery driver's family and loved ones during this difficult time. \"We will work with police and the delivery service provider as they investigate.\" Read more from Sky News:Fireball at Southend Airport after small plane crashesDoctor's admission revealed in note that changed man's life forever It is understood the person who died was delivering Amazon parcels when the incident happened. The cause of the collision is under investigation."
    },
    {
        "title": "Economists say the cost of living crisis is over - here's why many households disagree",
        "description": "Talk to economists and they will tell you that the cost of living crisis is over.",
        "url": "https://news.sky.com/story/economists-say-the-cost-of-living-crisis-is-over-heres-why-many-households-disagree-13396244",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-cost-living_6964213.jpg?20250713211047",
        "type": "UK",
        "Author": "Ed Conway",
        "Date Published": "2025-07-13 23:01:00",
        "Headline": "The best measure of economic \"feelgood factor\" is to subtract inflation and taxes from people's nominal pay - with the outcomes showing how some households are more fortunate than others.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Talk to economists and they will tell you that the cost of living crisis is over. They will point towards charts showing that while inflation is still above the Bank of England's 2% target, it has come down considerably in recent years, and is now \"only\" hovering between 3% and 4%. So why does the cost of living still feel like such a pressing issue for so many households? The short answer is because, depending on how you define it, it never ended. Economists like to focus on the change in prices over the past year, and certainly on that measure inflation is down sharply, from double-digit levels in recent years. But if you look over the past four years then the rate of change is at its highest since the early 1990s. But even that understates the complexity of economic circumstances facing households around the country. For if you want a sense of how current financial conditions really feel in people's pockets, you really ought to offset inflation against wages, and then also take account of the impact of taxes. \n                  Is the cost of living crisis over? Here's what the data reveals\n                 \n                  Bosses of Octopus Energy and SSE clash over 'postcode pricing' proposals\n                 \n                  Tens of thousands to get compensation over forced prepayment meters\n                 That is a complex exercise - in part because no two households' experience is alike. But recent research from the Resolution Foundation illustrates some of the dynamics going on beneath the surface, and underlines that for many households the cost of living crisis is still very real indeed.  The place to begin here is to recall that perhaps the best measure of economic \"feelgood factor\" is to subtract inflation and taxes from people's nominal pay. You end up with a statistic showing your real household disposable income. Consider the projected pattern over the coming years. For a household earning £50,000, earnings are expected to increase by 10% between 2024/25 and 2027/28. Subtract inflation projected over that period and all of a sudden that 10% drops to 2.5%. Now subtract the real increase in payments of National Insurance and taxes and it's down to 0.2%. Now subtract projected council tax increases and all of a sudden what began as a 10% increase is actually a 0.1% decrease. Read more:UK economy figures 'not as bad as they look', analysts sayMore options than ever for savers to beat inflation  Of course, the degree of change in your circumstances can differ depending on all sorts of factors. Some earners (especially those close to tax thresholds, which in this case includes those on £50,000) feel the impact of tax changes more than others. Pensioners and those who own their homes outright benefit from a comparatively lower increase in housing costs in the coming years than those paying mortgages and (especially) rent. Nor is everyone's experience of inflation the same. In general, lower-income households pay considerably more of their earnings on essentials, like housing costs, food and energy. Some of those costs are going up rapidly - indeed, the UK faces higher power costs than any other developed economy. But the ultimate verdict provides some clear patterns. Pensioners can expect further increases in their take-home pay in the coming years. Those who own their homes outright and with mortgages can likely expect earnings to outpace extra costs. But others are less fortunate. Those who rent their homes privately are projected to see sharp falls in their household income - and children are likely to see further falls in their economic welfare too."
    },
    {
        "title": "Chelsea win FIFA Club World Cup with victory over PSG - as Donald Trump presents trophy",
        "description": "Chelsea have thrashed European champions Paris Saint-Germain to win FIFA's Club World Cup - with Donald Trump joining the players at the trophy presentation.",
        "url": "https://news.sky.com/story/chelsea-win-fifa-club-world-cup-with-victory-over-psg-as-donald-trump-watches-from-stands-13396284",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-trump-palmer_6964269.jpg?20250713230122",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-13 20:18:00",
        "Headline": "The French side, who had a player sent off, were heavy favourites to win the final in New Jersey but were 3-0 down before half-time.",
        "Content": "Chelsea have thrashed European champions Paris Saint-Germain to win FIFA's Club World Cup - with Donald Trump joining the players at the trophy presentation. The US president gave the Chelsea players their winners' medals and the Club World Cup trophy following the final at the MetLife Stadium in New Jersey. Mr Trump also gave PSG their runners-up medals. The French side were the heavy favourites to win the final but were 3-0 down within 43 minutes. They eventually finished the game with 10 men after midfielder Joao Neves pulled Chelsea defender Marc Cucurella's hair in the 85th minute. Chelsea talisman Cole Palmer had scored almost identical finishes in the 22nd and 30th minute to give the West London side a two-goal advantage a third of the way through the tie. The England international later played a neat pass to Brazilian forward Joao Pedro - who lifted the ball over PSG keeper Gianluigi Donnarumma to give the Blues a three-goal advantage just before half-time. PSG came out strong at the start of the second half and nearly narrowed the deficit in the 53rd minute when Ousmane Dembele struck at goal from six yards. However, it was well-saved by Chelsea keeper Robert Sanchez who put in a strong performance all night for the west London side. Goalscorer Pedro received a standing ovation from the Chelsea fans as he was replaced by Liam Delap on the 67th minute. Following the final whistle, players from both sides appeared to be involved in a large altercation on the pitch. PSG coach Luis Enrique appeared to grab at Pedro's neck while he and Donnarumma confronted Chelsea players. The pre-match programme, which included a performance from Robbie Williams and a US Air Force flyover, overran and led to a kick-off delay. A musical medley which featured J Balvin, Doja Cat, Tems and Chris Martin from Coldplay took place at half-time at the 82,500-seater stadium as the pitch was watered in the high heat. Read more:Trump threatens to revoke US comedian's citizenshipFarmer becomes first person to die during ICE raids After the game, Mr Trump also presented Sanchez with the best goalkeeper award, Palmer with the golden ball trophy for the best player of the tournament, and PSG player Desire Doue with the silver ball trophy for the second-best player of the tournament. The Club World Cup attracted controversy as critics said it would further congest the football calendar and risk the health of players, especially because the featured teams are some of the most successful in the world, meaning they often remain in other knockout competitions until the latter stages. Real Madrid star Kylian Mbappe said: \"We play like already, 60 games in the year... you have so many competitions. And we are happy to play, but when it's too much, it's too much.\" \"I think we have to respect the health of the players,\" the Frenchman continued."
    },
    {
        "title": "Jannik Sinner wins first Wimbledon title after beating defending champion Carlos Alcaraz",
        "description": "World number one Jannik Sinner has defeated defending champion Carlos Alcaraz to win his first Wimbledon title.",
        "url": "https://news.sky.com/story/jannik-sinner-wins-first-wimbledon-title-after-beating-defending-champion-carlos-alcaraz-13396215",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jannik-sinner_6964183.jpg?20250713194018",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-13 15:33:00",
        "Headline": "The Italian won in four sets to put his Paris heartbreak behind after him after he lost to Alcaraz in an epic French Open final 35 days ago.",
        "Content": "World number one Jannik Sinner has defeated defending champion Carlos Alcaraz to win his first Wimbledon title. The Italian won the match in four sets to prevent the Spanish world number two from winning his third Wimbledon final in a row. They played in front of a crowd which included the Prince and Princess of Wales and their children George and Charlotte. Sinner, 23, has won his first Wimbledon final in what was his latest high stakes encounter with 22-year-old Alcaraz. Many tennis fans feel the pair are developing an exciting rivalry that could endure for many years to come. Sinner's Wimbledon success comes only 35 days after he lost to Alcaraz in what many judge to be the greatest ever French Open final.  Alcaraz showed incredible reserves of energy to win a five-hour 29-minute match at Roland Garros to deny Sinner a third consecutive Grand Slam title. However, Sinner was able to overcome his Paris heartbreak with victory in the SW19 postcode of London. At one stage he was forced to delay his serve at a crucial moment in the match when a champagne cork nearly hit him - prompting boos from the crowd and a rebuke from British umpire Alison Hughes. Sinner said after he was presented with the Wimbledon trophy: \"I had a very tough loss in Paris. But it doesn't really matter how you win or lose the important tournaments, you just have to understand what you did wrong, try to work on that. \"This is for sure one of the reasons why I'm holding this trophy. I'm very happy that I held my nerves. It's an amazing feeling.\" Read more:Tearful tennis star reveals words of comfort from KateSwiatek wins Wimbledon women's singles final 6-0, 6-0 Following his Wimbledon final defeat, Alcaraz said: \"It's difficult to lose. First of all I have to congratulate Jannik once again. It's a really well-deserved trophy. Unbelievable two weeks here in London playing great tennis. \"Really proud of everything I'm doing. At the beginning of the season I struggled a little bit, on the court, off the court, but then suddenly I started to bring joy on the court again. I just want to keep going, to keep bringing joy on the court.\" The royals in attendance were joined by A-list stars Keira Knightley, Matthew McConaughey and Nicole Kidman. What happened during the Wimbledon final? Alcaraz was certainly not holding back, slamming down a 136mph ace to start the match and hitting 139mph in his second service game - a new record for the Spaniard, until he twice clocked 140mph later in the contest. Alcaraz went on to win the first set 6-4 before Sinner took the second set by the same score. The Italian then won the third set 6-4 to increase the pressure on Alcaraz. Many observers speculated whether Sinner would start to have memories of his French Open final loss to Alcaraz - when the Spaniard recovered from two sets down to win the epic contest on the Roland Garros clay. However, Sinner is renowned for his composure and it was fully on show when he went on to win the fourth set 6-4 to put his Paris heartbreak behind him and lift the Wimbledon trophy. He secured the victory in three hours and four minutes. The victory, which Sinner celebrated by thrusting both arms aloft, puts his rivalry with Alcaraz back on a knife edge. He has now won four Grand Slam titles compared to Alcaraz's five and has ended a five-match losing streak against the Spaniard. It is also Sinner's first Grand Slam title away from his favoured hard courts, while Alcaraz suffered a first major final defeat, unable to find the same magic that had brought him back from the brink on the clay."
    },
    {
        "title": "Senior aides to King and Prince Harry pictured meeting in London",
        "description": "Senior aides to the King and Prince Harry have been pictured together in London, possibly opening a channel of communication between the two sides for the first time in years.",
        "url": "https://news.sky.com/story/senior-aides-to-king-and-prince-harry-pictured-meeting-in-london-13396110",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-king-charles-harry_6903895.jpg?20250502183349",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-13 10:49:00",
        "Headline": "Relations between the King and his second son declined significantly in the aftermath of Harry and Meghan stepping back as senior royals in 2020.",
        "Content": "Senior aides to the King and Prince Harry have been pictured together in London, possibly opening a channel of communication between the two sides for the first time in years. Meredith Maines, the duke's chief communications officer, and Liam Maguire, who runs Harry and Meghan's UK public relations team, were pictured meeting with Tobyn Andreae, the King's communications secretary, at the Royal Over-Seas League near Clarence House. Sky News understands it's the first time they've all met like this. The images were obtained by The Mail On Sunday, with the paper quoting a source saying there was no \"formal agenda\" to the meeting, but there were \"things both sides wanted to talk about\". Both sides have been contacted for comment. Relations between the King and his second son declined significantly after the 2021 interview with Oprah Winfrey, during which Harry and Meghan alleged a member of the Royal Family was concerned about the colour of their son Archie's skin before he was born. In his controversial memoir Spare, the duke then claimed his brother, the Prince of Wales, had physically attacked him and that the King put his own interests above Harry's, and was jealous of Meghan. The rift deepened further in 2020 when the Sussexes announced that they would step back as senior members of the Royal Family and split their time between the UK and US. It was at this time that Harry's taxpayer-funded security was also taken away. In a Good Morning America interview in 2023, Harry said he was \"stunned\" by the decision. He also took the Home Office to court over the move. Read more:Harry's relationship with Royal Family - how did we get here?Kate offers words of comfort to Wimbledon player after defeat In May this year, the duke lost that legal challenge, with the Home Office saying security decisions were now taken on a \"case-by-case\" basis. Speaking in an interview with BBC News after losing the case, Harry said he wants a \"reconciliation\" with the Royal Family - but claimed the King \"won't speak to me\". The duke was criticised for saying \"I don't know how much longer my father has\", appearing to refer to the King's cancer diagnosis."
    },
    {
        "title": "IDF blames 'technical error' after Gaza officials say children collecting water killed in strike",
        "description": "The Israeli military says it missed its intended target after Gaza officials said 10 Palestinians - including six children - were killed in a strike at a water collection point.",
        "url": "https://news.sky.com/story/idf-blames-technical-error-after-gaza-officials-say-children-collecting-water-killed-in-strike-13396138",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-gaza-nuseirat_6964047.jpg?20250713153240",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-13 12:17:00",
        "Headline": "The Israel Defence Forces (IDF) said it had intended to hit an Islamic Jihad militant but a \"technical error\" had caused the missile to fall \"dozens of metres from the target\".",
        "Content": " The Israeli military says it missed its intended target after Gaza officials said 10 Palestinians - including six children - were killed in a strike at a water collection point. Another 17 people were wounded in the strike on a water distribution point in Nuseirat refugee camp, said Ahmed Abu Saifan, an emergency physician at Al Awda Hospital. The Israel Defence Forces (IDF) said it had intended to hit an Islamic Jihad militant but a \"technical error with the munition\" had caused the missile to fall \"dozens of metres from the target\". The IDF said the incident is under review, adding that it \"works to mitigate harm to uninvolved civilians as much as possible\" and \"regrets any harm to uninvolved civilians\". Officials at Al Awda Hospital said it received 10 bodies after the Israeli strike on the water collection point and six children were among the dead. Ramadan Nassar, who lives in the area, said around 20 children and 14 adults were lined up Sunday morning to fill up water. When the strike occurred, everyone ran and some, including those who were severely injured, fell to the ground, he said. At least 32 people were killed in Israeli strikes in the Gaza Strip on Sunday, local health officials said. Two women and three children were among nine killed after an Israeli strike on a home in the central town of Zawaida, officials at Al Aqsa Martyrs Hospital said. Israel has claimed it hit more than 150 targets in the besieged enclave in the past day. The latest strikes come after the Israel military opened fire near an aid centre in Rafah on Saturday. The Red Cross said 31 people were killed. The IDF has said it fired \"warning shots\" near the aid distribution site but it was \"not aware of injured individuals\" as a result.  International correspondent A father carried the body of his young son through the streets of the Nuseirat refugee camp in central Gaza, his surviving child beside him.  The boy was one of at least 10 people killed when an Israeli airstrike hit civilians gathering water. At Al Awda Hospital, emergency rooms are overwhelmed, and the dead lie in corridors. \n The Israeli military says the strike was a technical error, claiming it had been targeting a militant from Islamic Jihad. Hours later, another strike hit the busy Samar Junction market in Gaza City, killing several, including Dr Ahmed Qandil, a surgeon en route to work at the Baptist Hospital. As civilian casualties rise, ceasefire negotiations in Doha are faltering.  Palestinian and Israeli sources say the talks are stalled over withdrawal terms.  Hamas has rejected Israeli maps that would leave 40% of Gaza under Israeli control. The group demands a return to lines held during the last truce. Disagreements also persist over humanitarian aid and a permanent end to the war.  The US-backed plan envisions a 60-day truce and phased hostage releases - but with divisions deepening, a deal remains elusive. The war in Gaza started in response to Hamas's attack on Israel on 7 October 2023, which killed 1,200 people and saw about 250 taken hostage. More than 58,000 Palestinians have since been killed, with more than half being women and children, according to Gaza's health ministry, which does not distinguish between civilians and combatants in its count. Read more:Palestinians shot while seeking aid, says paramedicDozens of MPs call for UK to recognise Palestine as state US President Donald Trump has said he is closing in on another ceasefire agreement that would see more hostages released and potentially wind down the war. But after two days of talks this week with Israeli Prime Minister Benjamin Netanyahu, there were no signs of a breakthrough, as a new sticking point emerged over the deployment of Israeli troops during the truce. Hamas still holds 50 hostages, with fewer than half of them believed to be alive, after most of the rest were released in ceasefire agreements or other deals."
    },
    {
        "title": "Meredith Kercher's killer faces new trial over sexual assault allegations",
        "description": "The man convicted of the murder of British student Meredith Kercher has been charged with sexual assault against an ex-girlfriend.",
        "url": "https://news.sky.com/story/meredith-kerchers-killer-faces-new-trial-over-sexual-assault-allegations-13396073",
        "image_url": "https://e3.365dm.com/21/11/1920x1080/skynews-rudy-guede-court_5593120.jpg?20211123182513",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-13 09:19:00",
        "Headline": "Rudy Guede, 38, will be standing trial again in November in Italy after an ex-girlfriend filed a police report in the summer of 2023 accusing Guede of mistreatment, personal injury and sexual violence.",
        "Content": "The man convicted of the murder of British student Meredith Kercher has been charged with sexual assault against an ex-girlfriend. Rudy Guede, 38, was the only person who was definitively convicted of the murder of 21-year-old Ms Kercher in Perugia, Italy, back in 2007. He will be standing trial again in November after an ex-girlfriend filed a police report in the summer of 2023 accusing Guede of mistreatment, personal injury and sexual violence. Guede, from the Ivory Coast, was released from prison for the murder of Leeds University student Ms Kercher in 2021, after having served about 13 years of a 16-year sentence. Since last year - when this investigation was still ongoing - Guede has been under a \"special surveillance\" regime, Sky News understands, meaning he was banned from having any contact with the woman behind the sexual assault allegations, including via social media, and had to inform police any time he left his city of residence, Viterbo, as ruled by a Rome court. Guede has been serving a restraining order and fitted with an electronic ankle tag. The Kercher murder case, in the university city of Perugia, was the subject of international attention. Ms Kercher, a 21-year-old British exchange student, was found murdered in the flat she shared with her American roommate, Amanda Knox. The Briton's throat had been cut and she had been stabbed 47 times. Ms Knox and her then-boyfriend, Raffaele Sollecito, were placed under suspicion. Both were initially convicted of murder, but Italy's highest court overturned their convictions, acquitting them in 2015."
    },
    {
        "title": "Farmer becomes first person to die during Trump's ICE raids",
        "description": "A farmer who fell from a greenhouse roof during an anti-immigrant raid at a licensed cannabis facility in California this week has died of his injuries.",
        "url": "https://news.sky.com/story/farmer-dies-after-falling-from-greenhouse-roof-during-ice-raid-in-california-13396001",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ice-raid-jaime-alanis_6963754.jpg?20250713040050",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-13 02:14:00",
        "Headline": "Jaime Alanis, 57, is the first person to die as a result of Donald Trump's anti-immigrant raids.",
        "Content": "A farmer who fell from a greenhouse roof during an anti-immigrant raid at a licensed cannabis facility in California this week has died of his injuries. Jaime Alanis, 57, is the first person to die as a result of Donald Trump's Immigration Compliance and Enforcement (ICE) raids. His niece, Yesenia Duran, posted on the fundraising site GoFundMe to say her uncle was his family's only provider and he had been sending his earnings back to his wife and daughter in Mexico. The United Food Workers said Mr Alanis had worked on the farm for 10 years. \"These violent and cruel federal actions terrorise American communities, disrupt the American food supply chain, threaten lives and separate families,\" the union said in a recent statement on X.  The Department of Homeland Security (DHS) said it executed criminal search warrants at Glass House Farms facilities on Thursday. Mr Alanis called family to say he was hiding and possibly fleeing agents before he fell around 30ft (9m) from the roof and broke his neck, according to information from family, hospital and government sources. Agents arrested 200 people suspected of being in the country illegally and identified at least 10 immigrant children on the sites, the DHS said in a statement.  Mr Alanis was not among them, the agency said. \"This man was not in and has not been in CBP (Customs and Border Protection) or ICE custody,\" DHS assistant secretary for public affairs Tricia McLaughlin said. \"Although he was not being pursued by law enforcement, this individual climbed up to the roof of a greenhouse and fell 30ft. CBP immediately called a medivac to the scene to get him care as quickly as possible.\" Read more:Trump announces 30% tariff on imports from EUPresident threatens to revoke US comedian's citizenship Four US citizens were arrested during the incident for allegedly \"assaulting or resisting officers\", the DHS said, and authorities were offering a $50,000 reward for information leading to the arrest of a person suspected of firing a gun at federal agents. In a statement, Glass House, a licensed Cannabis grower, said immigration agents had valid warrants. It said workers were detained and it is helping provide them with legal representation. \"Glass House has never knowingly violated applicable hiring practices and does not and has never employed minors,\" it added."
    },
    {
        "title": "Chelsea win FIFA Club World Cup with victory over PSG - as Donald Trump presents trophy",
        "description": "Chelsea have thrashed European champions Paris Saint-Germain to win FIFA's Club World Cup - with Donald Trump joining the players at the trophy presentation.",
        "url": "https://news.sky.com/story/chelsea-win-fifa-club-world-cup-with-victory-over-psg-as-donald-trump-watches-from-stands-13396284",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-trump-palmer_6964269.jpg?20250713230122",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-13 20:18:00",
        "Headline": "The French side, who had a player sent off, were heavy favourites to win the final in New Jersey but were 3-0 down before half-time.",
        "Content": "Chelsea have thrashed European champions Paris Saint-Germain to win FIFA's Club World Cup - with Donald Trump joining the players at the trophy presentation. The US president gave the Chelsea players their winners' medals and the Club World Cup trophy following the final at the MetLife Stadium in New Jersey. Mr Trump also gave PSG their runners-up medals. The French side were the heavy favourites to win the final but were 3-0 down within 43 minutes. They eventually finished the game with 10 men after midfielder Joao Neves pulled Chelsea defender Marc Cucurella's hair in the 85th minute. Chelsea talisman Cole Palmer had scored almost identical finishes in the 22nd and 30th minute to give the West London side a two-goal advantage a third of the way through the tie. The England international later played a neat pass to Brazilian forward Joao Pedro - who lifted the ball over PSG keeper Gianluigi Donnarumma to give the Blues a three-goal advantage just before half-time. PSG came out strong at the start of the second half and nearly narrowed the deficit in the 53rd minute when Ousmane Dembele struck at goal from six yards. However, it was well-saved by Chelsea keeper Robert Sanchez who put in a strong performance all night for the west London side. Goalscorer Pedro received a standing ovation from the Chelsea fans as he was replaced by Liam Delap on the 67th minute. Following the final whistle, players from both sides appeared to be involved in a large altercation on the pitch. PSG coach Luis Enrique appeared to grab at Pedro's neck while he and Donnarumma confronted Chelsea players. The pre-match programme, which included a performance from Robbie Williams and a US Air Force flyover, overran and led to a kick-off delay. A musical medley which featured J Balvin, Doja Cat, Tems and Chris Martin from Coldplay took place at half-time at the 82,500-seater stadium as the pitch was watered in the high heat. Read more:Trump threatens to revoke US comedian's citizenshipFarmer becomes first person to die during ICE raids After the game, Mr Trump also presented Sanchez with the best goalkeeper award, Palmer with the golden ball trophy for the best player of the tournament, and PSG player Desire Doue with the silver ball trophy for the second-best player of the tournament. The Club World Cup attracted controversy as critics said it would further congest the football calendar and risk the health of players, especially because the featured teams are some of the most successful in the world, meaning they often remain in other knockout competitions until the latter stages. Real Madrid star Kylian Mbappe said: \"We play like already, 60 games in the year... you have so many competitions. And we are happy to play, but when it's too much, it's too much.\" \"I think we have to respect the health of the players,\" the Frenchman continued."
    },
    {
        "title": "Farmer becomes first person to die during Trump's ICE raids",
        "description": "A farmer who fell from a greenhouse roof during an anti-immigrant raid at a licensed cannabis facility in California this week has died of his injuries.",
        "url": "https://news.sky.com/story/farmer-dies-after-falling-from-greenhouse-roof-during-ice-raid-in-california-13396001",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ice-raid-jaime-alanis_6963754.jpg?20250713040050",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-13 02:14:00",
        "Headline": "Jaime Alanis, 57, is the first person to die as a result of Donald Trump's anti-immigrant raids.",
        "Content": "A farmer who fell from a greenhouse roof during an anti-immigrant raid at a licensed cannabis facility in California this week has died of his injuries. Jaime Alanis, 57, is the first person to die as a result of Donald Trump's Immigration Compliance and Enforcement (ICE) raids. His niece, Yesenia Duran, posted on the fundraising site GoFundMe to say her uncle was his family's only provider and he had been sending his earnings back to his wife and daughter in Mexico. The United Food Workers said Mr Alanis had worked on the farm for 10 years. \"These violent and cruel federal actions terrorise American communities, disrupt the American food supply chain, threaten lives and separate families,\" the union said in a recent statement on X.  The Department of Homeland Security (DHS) said it executed criminal search warrants at Glass House Farms facilities on Thursday. Mr Alanis called family to say he was hiding and possibly fleeing agents before he fell around 30ft (9m) from the roof and broke his neck, according to information from family, hospital and government sources. Agents arrested 200 people suspected of being in the country illegally and identified at least 10 immigrant children on the sites, the DHS said in a statement.  Mr Alanis was not among them, the agency said. \"This man was not in and has not been in CBP (Customs and Border Protection) or ICE custody,\" DHS assistant secretary for public affairs Tricia McLaughlin said. \"Although he was not being pursued by law enforcement, this individual climbed up to the roof of a greenhouse and fell 30ft. CBP immediately called a medivac to the scene to get him care as quickly as possible.\" Read more:Trump announces 30% tariff on imports from EUPresident threatens to revoke US comedian's citizenship Four US citizens were arrested during the incident for allegedly \"assaulting or resisting officers\", the DHS said, and authorities were offering a $50,000 reward for information leading to the arrest of a person suspected of firing a gun at federal agents. In a statement, Glass House, a licensed Cannabis grower, said immigration agents had valid warrants. It said workers were detained and it is helping provide them with legal representation. \"Glass House has never knowingly violated applicable hiring practices and does not and has never employed minors,\" it added."
    },
    {
        "title": "Economists say the cost of living crisis is over - here's why many households disagree",
        "description": "Talk to economists and they will tell you that the cost of living crisis is over.",
        "url": "https://news.sky.com/story/economists-say-the-cost-of-living-crisis-is-over-heres-why-many-households-disagree-13396244",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-cost-living_6964213.jpg?20250713211047",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-07-13 23:01:00",
        "Headline": "The best measure of economic \"feelgood factor\" is to subtract inflation and taxes from people's nominal pay - with the outcomes showing how some households are more fortunate than others.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Talk to economists and they will tell you that the cost of living crisis is over. They will point towards charts showing that while inflation is still above the Bank of England's 2% target, it has come down considerably in recent years, and is now \"only\" hovering between 3% and 4%. So why does the cost of living still feel like such a pressing issue for so many households? The short answer is because, depending on how you define it, it never ended. Economists like to focus on the change in prices over the past year, and certainly on that measure inflation is down sharply, from double-digit levels in recent years. But if you look over the past four years then the rate of change is at its highest since the early 1990s. But even that understates the complexity of economic circumstances facing households around the country. For if you want a sense of how current financial conditions really feel in people's pockets, you really ought to offset inflation against wages, and then also take account of the impact of taxes. \n                  Is the cost of living crisis over? Here's what the data reveals\n                 \n                  Bosses of Octopus Energy and SSE clash over 'postcode pricing' proposals\n                 \n                  Tens of thousands to get compensation over forced prepayment meters\n                 That is a complex exercise - in part because no two households' experience is alike. But recent research from the Resolution Foundation illustrates some of the dynamics going on beneath the surface, and underlines that for many households the cost of living crisis is still very real indeed.  The place to begin here is to recall that perhaps the best measure of economic \"feelgood factor\" is to subtract inflation and taxes from people's nominal pay. You end up with a statistic showing your real household disposable income. Consider the projected pattern over the coming years. For a household earning £50,000, earnings are expected to increase by 10% between 2024/25 and 2027/28. Subtract inflation projected over that period and all of a sudden that 10% drops to 2.5%. Now subtract the real increase in payments of National Insurance and taxes and it's down to 0.2%. Now subtract projected council tax increases and all of a sudden what began as a 10% increase is actually a 0.1% decrease. Read more:UK economy figures 'not as bad as they look', analysts sayMore options than ever for savers to beat inflation  Of course, the degree of change in your circumstances can differ depending on all sorts of factors. Some earners (especially those close to tax thresholds, which in this case includes those on £50,000) feel the impact of tax changes more than others. Pensioners and those who own their homes outright benefit from a comparatively lower increase in housing costs in the coming years than those paying mortgages and (especially) rent. Nor is everyone's experience of inflation the same. In general, lower-income households pay considerably more of their earnings on essentials, like housing costs, food and energy. Some of those costs are going up rapidly - indeed, the UK faces higher power costs than any other developed economy. But the ultimate verdict provides some clear patterns. Pensioners can expect further increases in their take-home pay in the coming years. Those who own their homes outright and with mortgages can likely expect earnings to outpace extra costs. But others are less fortunate. Those who rent their homes privately are projected to see sharp falls in their household income - and children are likely to see further falls in their economic welfare too."
    },
    {
        "title": "Heidi Alexander says 'fairness' will be government's 'guiding principle' when it comes to taxes at next budget",
        "description": "Another hint that tax rises are coming in this autumn's budget has been given by a senior minister.",
        "url": "https://news.sky.com/story/heidi-alexander-says-fairness-will-be-governments-guiding-principle-when-it-comes-to-taxes-at-next-budget-13396075",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-rachel-reeves-budget_6732970.jpg?20241030112346",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-13 09:21:00",
        "Headline": "The transport secretary told Sky News tax rises were not discussed \"directly\" between ministers last week at a cabinet away day. But the Tories accused her of \"barely disguised\" hints that they're on the way.",
        "Content": " Another hint that tax rises are coming in this autumn's budget has been given by a senior minister. Speaking to Sunday Morning with Trevor Phillips, Transport Secretary Heidi Alexander was asked if Sir Keir Starmer and the rest of the cabinet had discussed hiking taxes in the wake of the government's failed welfare reforms, which were shot down by their own MPs. Trevor Phillips asked specifically if tax rises were discussed among the cabinet last week - including on an away day on Friday. Politics Hub: Catch up on the latest Tax increases were not discussed \"directly\", Ms Alexander said, but ministers were \"cognisant\" of the challenges facing them. Asked what this means, Ms Alexander added: \"I think your viewers would be surprised if we didn't recognise that at the budget, the chancellor will need to look at the OBR forecast that is given to her and will make decisions in line with the fiscal rules that she has set out. \"We made a commitment in our manifesto not to be putting up taxes on people on modest incomes, working people. We have stuck to that.\" Ms Alexander said she wouldn't comment directly on taxes and the budget at this point, adding: \"So, the chancellor will set her budget. I'm not going to sit in a TV studio today and speculate on what the contents of that budget might be. \"When it comes to taxation, fairness is going to be our guiding principle.\" Read more:Reeves won't rule out tax risesWhat is a wealth tax and how would it work? 👉Listen to Politics at Sam and Anne's on your podcast app👈       Afterwards, shadow home secretary Chris Philp told Phillips: \"That sounds to me like a barely disguised reference to tax rises coming in the autumn.\" He then went on to repeat the Conservative attack lines that Labour are \"crashing the economy\".  Mr Philp then attacked the prime minister as \"weak\" for being unable to get his welfare reforms through the Commons. Discussions about potential tax rises have come to the fore after the government had to gut its welfare reforms. Sir Keir had wanted to change Personal Independence Payments (PIP), but a large Labour rebellion forced him to axe the changes. With the savings from these proposed changes - around £5bn - already worked into the government's sums, they will now need to find the money somewhere else. The general belief is that this will take the form of tax rises, rather than spending cuts, with more money needed for military spending commitments, as well as other areas of priority for the government, such as the NHS."
    },
    {
        "title": "Extreme weather becoming the norm in the UK, Met Office warns",
        "description": "Britain's climate is changing rapidly, with records regularly being smashed and extremes of heat and rainfall becoming the norm, the Met Office has warned.",
        "url": "https://news.sky.com/story/extreme-weather-becoming-the-norm-in-the-uk-met-office-warns-13396206",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-london-weather_6964076.jpg?20250713164123",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-07-13 23:01:00",
        "Headline": "A new report from the Met Office \"reinforces the clear and urgent signals of our changing climate\", an expert has said.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n Britain's climate is changing rapidly, with records regularly being smashed and extremes of heat and rainfall becoming the norm, the Met Office has warned. In an updated assessment of the UK's climate it says heatwaves and periods of flood or drought are becoming more frequent and more intense. The report shows the period between October 2023 and March 2024 was the wettest winter period in England and Wales in over 250 years. Spring 2024 was also the warmest on record. It says the increasing extremes are \"typical of recent years\". Mike Kendon, a Met Office climate scientist and lead author of the State of the UK Climate report, said: \"Every year that goes by is another upward step on the warming trajectory our climate is on. \"Observations show that our climate in the UK is now notably different to what it was just a few decades ago. \n                  Typhoon Danas: Two people killed and hundreds injured as 135mph winds hit Taiwan\n                 \n                  Why did deadly Texas floods catch people by surprise?\n                 \n                  UK records hottest day of year so far - as 40C highs close schools in Europe\n                 \"We are now seeing records being broken very frequently as we see temperature and rainfall extremes being the most affected by our changing climate.\"  The report compares the decade up to 2024 with long-term averages between 1961 and 1990. While the average temperature is increasing, the hottest summer days and coldest winter nights have warmed twice as fast. The climate is also becoming wetter - with the extra rain falling between October and March. Over the last decade, rainfall over the six-month winter period was 16% higher than the average between 1961 and 1990. Effects of UK climate change 'deeply concerning'  Chief executive of the Royal Meteorological Society, Professor Liz Bentley, said the report \"reinforces the clear and urgent signals of our changing climate\". \"While long-term averages are shifting, it is the extreme heat, intense rainfall and droughts that are having the most immediate and dramatic effects on people and nature,\" she said. \"This report is not just a record of change, but a call to action.\" Read more:Nine deaths linked to 'silent killer' heatwaveWhat the weather has in store for July  Kathryn Brown, director of climate change at The Wildlife Trusts, said the effects of climate change on UK wildlife were already \"deeply concerning\". \"From swifts dropping out of the sky during heatwaves to trees flowering much earlier than they have in the past,\" she said. \"We are particularly worried about the effects of droughts on our nature reserves.\""
    },
    {
        "title": "Man arrested for alleged sexual assault 'on set of EastEnders'",
        "description": "A man has been arrested on suspicion of assault and sexual assault - which reportedly took place on the set of EastEnders. ",
        "url": "https://news.sky.com/story/man-arrested-for-alleged-sexual-assault-on-set-of-eastenders-13396186",
        "image_url": "https://e3.365dm.com/20/08/1920x1080/skynews-eastenders-bbc_5067474.jpg?20200814145648",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-13 14:02:00",
        "Headline": "A man in his 50s has been arrested on suspicion of common assault and sexual assault in relation to two victims, Hertfordshire Police said.",
        "Content": "A man has been arrested on suspicion of assault and sexual assault - which reportedly took place on the set of EastEnders.  The alleged incident happened on the set of the BBC soap at Elstree Studios in Hertfordshire, according to The Sun newspaper. Hertfordshire Police confirmed a man in his 50s was arrested after the report in Eldon Avenue, Borehamwood, on 7 May. The man is accused of sexual assault and common assault in relation to two victims, the force said. The suspect is on bail while inquiries continue, police added. EastEnders said in a statement: \"While we would never comment on individuals, EastEnders has on-site security and well-established procedures in place to safeguard the safety and welfare of everyone who works on the show.\""
    }
]