[
    {
        "title": "Labour dealt historic loss in Caerphilly by-election - as Plaid Cymru win seat",
        "description": "Plaid Cymru have won the by-election in the Senedd seat of Caerphilly for the first time.",
        "url": "https://news.sky.com/story/plaid-cymru-win-caerphilly-by-election-in-humiliation-for-labour-13455893",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-lindsay-whittle-plaid_7060043.jpg?20251024023409",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-23 23:22:00",
        "Headline": "Labour had held Caerphilly at every election since it was created in 1999 - as well as the parliamentary seat for over a century. Its candidate received 3,713 votes, and finished in third place.",
        "Content": " Plaid Cymru have won the by-election in the Senedd seat of Caerphilly for the first time. The Welsh nationalist party secured 15,960 votes - and candidate Lindsay Whittle cried as the result was announced. Mr Whittle is 72 years old and had stood as a Plaid candidate 13 times since 1983. He will now hold the seat until the Welsh Assembly's national elections next year. This by-election was widely regarded as a two-horse race between Plaid Cymru and Reform UK, and the result marks a considerable blow for Nigel Farage. His party received 12,113 votes - denying a victory that would have strengthened claims that Reform can convert a large lead in opinion polls into election wins. But more than anything, it is a humiliating defeat for Labour, who had held Caerphilly at every Senedd election since it was created in 1999 - as well as the Westminster seat for over a century. Its candidate received 3,713 votes - and finished in third place. \n                  Labour's dominance in Caerphilly has crumbled like cheese - but a Reform win isn't guaranteed\n                 \n                  MSP Colin Smyth appears in court charged with voyeurism and possessing indecent images of children\n                 \n                  Govt to allow early release of thousands of rapists and violent criminals, Tories claim in sentencing row\n                 Turnout overall stood at 50.43% - considerably higher than during the last ballot back in 2021. Giving his acceptance speech after the result was confirmed, Mr Whittle began by paying tribute to Hefin David - who was Welsh Labour's Member of the Senedd for Caerphilly until his death in August. \"He will be a hard act to follow,\" Mr Whittle said. \"I will never fill his shoes - but I promise you, I will walk the same path that he did.\" The Plaid politician described how he had been \"absolutely heartened\" by how many young people were involved in the by-election - and said the result sends a clear message. He said: \"Listen now Cardiff, and listen Westminster - this is Caerphilly and Wales telling you we want a better deal for every corner of Wales. The big parties need to sit up and take notice. \"Wales, we are at the dawn of new leadership, we are at the dawn of a new beginning - and I look forward to playing my part for a new Wales, and in particular, for the people of the Caerphilly constituency, I thank you with all my heart.\" Mr Whittle quipped that \"it was better than scoring the winning try for Wales in the Rugby World Cup\". And looking ahead to the next year's elections, he added: \"Tonight's result shows what's possible when people come together to back practical solutions and protect what matters most. \"We've beaten billionaire-backed Reform and, with the same determination, we can do it again in May 2026. Caerphilly has shown the way - now Wales must follow.\" Read more from Sky News:Mafia members and NBA stars arrestedPutin criticises Trump's new sanctions Speaking to Sky's chief political correspondent Jon Craig just before the declaration, Plaid Cymru leader Rhun ap Iorwerth said: \"There's clearly a real significance to the result - we are seeing the disillusionment with Labour writ large. I've heard it on hundreds of doorsteps, we've seen it in opinion polls.\" He also conceded that there was tactical voting in this by-election - with Labour and Conservative supporters alike backing Lindsay Whittle to keep out Reform. However, Mr ap Iorwerth added: \"I've spoken to literally hundreds and hundreds of people who told me - time and time again - 'I've been a Labour supporter all my life, and we're backing you this time.' \"Not begrudgingly, but because they see that's the direction we're going in - not just in this by-election, but as a nation. I'm calling on people to get behind that positive change - not just today, but ahead of next May.\" The Conservatives and the Liberal Democrats were among the parties who lost their deposits."
    },
    {
        "title": "Putin criticises Trump's sanctions on oil firms - as Russian jets 'briefly enter NATO airspace'",
        "description": "Vladimir Putin has described Donald Trump's sanctions against two major oil firms as an \"unfriendly act\".",
        "url": "https://news.sky.com/story/defiant-putin-insists-trumps-sanctions-on-oil-companies-wont-affect-russias-economy-13456221",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-putin-russia_7060030.jpg?20251024003159",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-23 21:57:00",
        "Headline": "European leaders are going to arrive in London later today for a \"critical\" meeting of the \"Coalition of the Willing\" - with the goal of discussing \"how they can pile pressure on Putin as he continues to kill innocent civilians with indiscriminate attacks across Ukraine\".",
        "Content": " Vladimir Putin has described Donald Trump's sanctions against two major oil firms as an \"unfriendly act\". However, the Russian president has insisted the tightened restrictions won't affect the nation's economy, a claim widely contradicted by most analysts. In a major policy shift, Mr Trump imposed sanctions against Rosneft and Lukoil - Russia's biggest oil companies - on Wednesday.  The White House said this was because of \"Russia's lack of serious commitment to a peace process to end the war in Ukraine\". Putin has now warned the move could disrupt the global oil markets, and lead to higher prices for consumers worldwide. A meeting between the two leaders had been proposed in Budapest, but Mr Trump said he had decided to cancel the talks because \"it didn't feel right to me\". Speaking from the Oval Office, he had told reporters: \"I have good conversations. And then, they don't go anywhere. They just don't go anywhere.\" \n                  Power of Russia sanctions lies in US financial system that greases the wheels\n                 \n                  Trump's oil sanctions have put 'US on warpath with Russia', says Putin ally\n                 \n                  Trump's sanctions are no slap on the wrist - they're a punch to the gut of Moscow's war economy \n                 Giving a speech in Moscow yesterday, Putin said \"dialogue is always better than war\" - but warned that Russia will never bow to pressure from abroad. Earlier, his long-term ally Dmitry Medvedev had described Mr Trump as a \"talkative peacemaker\" who had now \"fully embarked on the warpath against Russia\".  Oil prices have witnessed a sizeable jump since the sanctions were announced, with Brent crude rising by 5% - the biggest daily percentage gains since the middle of June. In other developments, Lithuania has claimed that two Russian military aircraft briefly entered its airspace yesterday. A Su-30 fighter and Il-78 refuelling tanker were in the NATO member's territory for 18 seconds, and Spanish jets were scrambled in response to the incident. Russia's defence ministry denied this - and said its planes did not violate the borders of any other country during a \"training flight\" in the Kaliningrad region. Read more:Sanctions could have chilling effect on marketHow could new sanctions impact the UK?  Volodymyr Zelenskyy attended a European Council summit in Brussels to discuss the war in Ukraine - and said the meeting had delivered \"good results\". He said Ukraine had secured political support for frozen Russian assets and \"their maximum use\" to defend against Russian aggression, adding the EU would \"work out all the necessary details\". Mr Zelenskyy thanked the bloc for approving its 19th sanctions package against Russia earlier today, and work was already beginning on a 20th. European leaders are going to arrive in London later today for a \"critical\" meeting of the \"Coalition of the Willing\" - with the goal of discussing \"how they can pile pressure on Putin as he continues to kill innocent civilians with indiscriminate attacks across Ukraine\".  Prime Minister Sir Keir Starmer said: \"The only person involved in this conflict who does not want to stop the war is President Putin, and his depraved strikes on young children in a nursery this week make that crystal clear. \"Time and again we offer Putin the chance to end his needless invasion, to stop the killing and recall his troops, but he repeatedly rejects those proposals and any chance of peace. \"From the battlefield to the global markets, as Putin continues to commit atrocities in Ukraine we must ratchet up the pressure on Russia and build on President Trump's decisive action.\""
    },
    {
        "title": "Power of Russia sanctions lies in US financial system that greases the wheels",
        "description": "US sanctions against Russia's two largest energy companies, the state-owned Rosneft and privately held Lukoil, are perhaps the most significant economic measures imposed by the West since the invasion of Ukraine.",
        "url": "https://news.sky.com/story/power-of-russia-sanctions-lies-in-us-financial-system-that-greases-the-wheels-13455878",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-jerusalem_7049965.jpg?20251013143215",
        "type": "Home",
        "Author": "Paul Kelso",
        "Date Published": "2025-10-23 16:50:00",
        "Headline": "These sanctions will directly impact the ability of the Russian companies, and anyone doing business with them, to operate within America's financial orbit. ",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  US sanctions against Russia's two largest energy companies, the state-owned Rosneft and privately held Lukoil, are perhaps the most significant economic measures imposed by the West since the invasion of Ukraine. If fully implemented, they have the potential to significantly choke off the flow of fossil fuel revenue that funds Russia's war machine, but their power lies not in directly denying Russia access to the tankers, ports and refineries that make the oil trade turn, but the US financial system that greases the wheels. Ever since the invasion, the Russian government has proved masterful at evading sanctions, aided and abetted by allies of economic convenience and an oil industry with decades of experience. Ukraine war latest: Zelenskyy expresses relief at Trump move  While the West, principally the EU, has largely turned off the taps and stopped buying Russian oil, China, India and Turkey became the largest consumers, with a shadow fleet of tankers ensuring exports continued to flow. Data from the Centre for Research into Energy and Clean Air (CREA) shows that while fossil fuel revenues have fallen from more than €1bn a day before the war, they have remained above €600m since the start of 2023, only dipping towards €500m in the last month. None of that oil has been heading for the US, but these sanctions will directly impact the ability of the Russian companies, and anyone doing business with them, to operate within America's financial orbit. According to the order from the US Office for Foreign Asset Control, the sanctions block all assets of the two companies, their subsidiaries and a number of named individuals, as well as preventing US citizens or financial institutions from doing business with them. It also threatens foreign financial institutions that \"facilitate transactions… involving Russia's military-industrial base\" with direct or secondary sanctions. In practice, the measures should prevent the two companies from accessing not just dollars, but trading markets, insurance and other services with any financial connection to the US. Taken in harness with similar steps announced by the UK earlier this month, analysts believe they can have a genuinely chilling effect on the market for Russian oil and gas. Russia's customers for oil in China, India and Turkey will also be affected, with the largest companies, state-owned and private, expected to be unwilling to take the risk of engaging directly with sanctioned entities. Indian companies are already reported to be \"recalibrating\" their imports following the announcement, which came just a week after Donald Trump announced an additional 25% import tariff on Indian goods as punishment for the country's reliance on Russian oil. Read more: Russia has responded with bravado to US sanctionsTrump imposes sanctions on Russia's two biggest oil firms That does not mean that Russian oil and gas exports will cease. There are other unsanctioned Russian energy companies that can still trade, and ever since the first barrel of oil was tapped, the industry has proved adept at evading sanctions intended to interrupt its flow from one country or another. Any significant increase in the oil price beyond the 5% seen in the aftermath of the announcement could also put pressure on the White House, which is at least as sensitive to fuel prices at home as it is to foreign wars. But analysts Kpler expect the sanctions to cause \"an immediate, short-term hiatus in Russian crude exports, as it will take time for sellers to reorganise and rebuild their trading systems to circumvent restrictions and ease buyers' concerns\". And Russian gas will, for now, continue to flow into Europe, where distaste for Vladimir Putin's imperial ambitions has not killed the appetite for his fuel. While the EU has this week imposed sanctions on liquified natural gas (LNG), they will not be fully enforced until 2027."
    },
    {
        "title": "Woman has new multiple sclerosis treatment that doctors say could be 'game-changer'",
        "description": "A mum with multiple sclerosis has become the first patient in the UK to receive an experimental treatment that could slow or even stop progression of the disease.",
        "url": "https://news.sky.com/story/woman-has-new-multiple-sclerosis-treatment-that-doctors-say-could-be-game-changer-13455765",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ms-moore-multiple-sclerosis_7059455.jpg?20251023125748",
        "type": "Home",
        "Author": "Thomas Moore",
        "Date Published": "2025-10-23 23:01:00",
        "Headline": "Doctors are looking to recruit more people for the trial, which they say could one day be given as a single one-off treatment.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  A mum with multiple sclerosis has become the first patient in the UK to receive an experimental treatment that could slow or even stop progression of the disease. Emily Henders, 37, was given an infusion of her own cells that had been weaponised in the lab to hunt down rogue elements in her immune system that drive the disease's disabling relapses. Sky News was given special permission to be present as the cells arrived deep frozen in liquid nitrogen before being carefully thawed and infused into her bloodstream. \"Someone's got to do it. Someone's got to be the first,\" she told me. Emily has had MS for four years, but existing drug treatment hasn't worked. Three times she's woken to find she's unable to move her legs. Her dad also has the disease and is now in a wheelchair. \"I want to avoid getting to that point as much as possible,\" she said. \n                  Apple users could get 'significant' compensation say lawyers, after tech firm loses competition ruling over 'unfair' £1.5bn app store fees\n                 \n                  English water firms get lowest environmental rating since records began\n                 \n                  European space firms combine to compete with SpaceX\n                 \"The thought of not being able to chase after my children or even walk up and down the stairs is something that I want to avoid at all costs. \"I want to stop it (the disease) before it has a chance to stop me.\" Multiple sclerosis is caused by rogue cells in the immune system turning against the body and attacking the protective covering of nerves in the brain and spinal cord. It can cause blurred vision or problems with movement, memory or thinking, depending on which nerves have been damaged. There is currently no cure. But doctors at University College London Hospitals (UCLH) are leading a new global trial of so-called CAR T therapy. They took blood from Emily and isolated T cells that normally defend the body against infections. These were genetically modified in the lab to target the rogue B cells in the immune system instead, and then infused back into Emily's bloodstream. The hope is that the treatment will stop further damage to the nerves and halt progress of the disease. Dr Claire Roddie, who has been instrumental in designing the treatment, said it was one of the most significant developments in her clinical lifetime. \"If we can intervene with something that essentially reaches deep into all the areas of the body where the disease-causing cells are, and eradicate them, it is almost like flicking a switch,\" she said. \"You get this immune (system) reset where the bad B cells don't recover, and you get just normal B cells.\" CAR T therapy has already been successfully used to treat - and sometimes cure - aggressive blood cancers by harnessing the immune system to hunt down abnormal cells. There is now growing interest in also testing it against autoimmune diseases, where the immune system starts to attack the body. Early-stage clinical trials on patients with the chronic disease lupus are promising. The MS trial at UCLH will recruit 18 patients at hospitals around the world. It is primarily designed to confirm the treatment is safe enough to progress to larger studies, but scientists will also monitor the impact on the rogue cells. Dr Wallace Brownlee, who is the principal investigator of the trial, said: \"None of the medications we have available are fully effective at preventing relapses. \"This can be given as a single one-off treatment. It could be a real game-changer in terms of how we manage MS in the future.\" The form of CAR T cell therapy being tested in the trial was invented by scientists at University College London's Cancer Institute, and licensed by the UCL spinout Autolus. It is called Obe-cel and is less likely to have serious side effects on the immune system than the first generation of CAR T therapies. Read more from Sky News:Parkinson's patient plays clarinet during brain surgeryBlood test for more than 50 cancers 'could transform outcomes' Emily is a secondary school biology teacher and understands the scientific rationale for the treatment - but also for the potential of side effects. \"What are my options here?\" she said. \"I could just let this disease take over and we could wait and see and I might be lucky and nothing happens to me. \"Or I might have a massive relapse next week and never be able to walk again. \"Are we willing to take that chance? And I think we've come to the conclusion that no, we're not. We have to trust science and trust medicine to do its job.\" There are more than 150,000 people with MS in the UK. Nearly 7,100 are newly diagnosed each year. The trial, called AUTO1-MS1O, is open to UK patients who have been diagnosed with relapsing or progressive forms of MS and whose disability is worsening despite existing treatment. Dr Frederick Vonberg, neurology research fellow at UCL and UCLH, said: \"We encourage patients aged between 18 and 60 years to speak to their neurologist and explore whether they might be eligible for a referral to this trial.\""
    },
    {
        "title": "King and Pope pray together in historic first since Reformation 500 years ago",
        "description": "The King and Pope Leo prayed together in a historic moment marking the first time an English monarch and a pontiff met for such an occasion since the Church of England split from Rome.",
        "url": "https://news.sky.com/story/king-and-pope-pray-together-in-historic-first-since-reformation-500-years-ago-13455808",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-pope-leo-pope-king-charles_7059275.jpg?20251023110942",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-23 12:18:00",
        "Headline": "The service at the Sistine Chapel was ecumenical, meaning it was a joint Anglican and Catholic service. Therefore, the prayer was led not just by Pope Leo but also by Stephen Cottrell, the Archbishop of York, the second most senior bishop in the Church of England.",
        "Content": " The King and Pope Leo prayed together in a historic moment marking the first time an English monarch and a pontiff met for such an occasion since the Church of England split from Rome. Charles was seen praying with the Pope in the iconic Michelangelo-affrescoed Sistine Chapel, sitting next to his wife, the Queen, who accompanied him on the quick state visit to the Vatican. It was the first time an English monarch and the pontiff joined together for prayer in the 500 years since the Reformation when, in 1534, King Henry VIII declared himself head of the Church of England and broke from the papal authority of the Roman Catholic Church. The service at the Sistine Chapel - where the Pope was elected - was ecumenical, meaning it was a joint Anglican and Catholic service. Therefore, the prayer was led not just by Pope Leo but also by Stephen Cottrell, the Archbishop of York, the second most senior bishop in the Church of England. Before the prayer, the King and Queen had a private audience with the American pope, who was elected in May following the death of Pope Francis, who died aged 88 in April. Upon their arrival at the Vatican, the royal couple were pictured standing on a red carpet as the national anthem was played out for them while they stood in front of the world's smallest army - the Swiss Guards. The Queen wore a black outfit with a matching mantilla, a lace veil that women have traditionally worn during Catholic services. Few do so now, but wearing the mantilla - or a scarf over the head - remains protocol for female dignitaries when meeting the Pope. Read more from Sky News:Will Prince Andrew scandal overshadow King's Vatican trip?How is a King's senior aide involved in the controversy? Following the prayer, the King and the Pope held a private meeting on environmental protection, while the Queen was shown around the Pauline Chapel in Vatican City. The King's historic trip to the Vatican comes during a week that began with huge controversy swirling around the Royal Family. Days after Prince Andrew announced he would be giving up his royal titles, Virginia Giuffre's posthumous memoir was published detailing alleged sexual encounters with Prince Andrew, the King's brother. Prince Andrew vehemently denies the allegations."
    },
    {
        "title": "Post Office compensation 'worse than original injustice', victims' commissioner says",
        "description": "A leaked letter, seen by Sky News, warns government that victims of the Post Office scandal find compensation schemes \"worse than the original injustice\".",
        "url": "https://news.sky.com/story/post-office-victims-say-in-leaked-letter-compensation-worse-than-original-injustice-13455885",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-post-office-branch_6986135.jpg?20250809021535",
        "type": "Home",
        "Author": "Adele Robinson",
        "Date Published": "2025-10-23 14:33:00",
        "Headline": "The letter was written by victims commissioner Baroness Newlove and sent to the Post Office minister Blair McDougall earlier this month.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n A leaked letter, seen by Sky News, warns government that victims of the Post Office scandal find compensation schemes \"worse than the original injustice\". The letter was written by victims' commissioner Baroness Newlove and sent to the Post Office minister Blair McDougall earlier this month. \"Far from offering catharsis,\" she writes, \"the compensation process was seen to be as bad as or even worse an experience than the initial investigation, prosecution and injustice itself.\" She adds that \"hearing this from victims, time and again, shocked me\". Victims told her that initial offers were \"insultingly low\" and that constant delays and requests for decades-old paperwork had left them offended and \"distressed\". Some described the process as \"adversarial\", with Baroness Newlove comparing it to fighting an insurance company rather than receiving justice from the state.  The letter urges the government to abandon \"commercial tactics\" such as making low initial offers - approaches the Commissioner says are \"not appropriate when dealing with traumatised victims\". \n                  27 years after conviction, he hopes he'll still be alive by the time he's cleared his name\n                 \n                  Major milestone in Post Office scandal as first Capture conviction referred to Court of Appeal\n                 \n                  Post Office scandal compensation shake-up and new redress body revealed\n                 \"It might be better to come back with a request for more information, rather than make an offer that is guaranteed to offend the victim,\" she said. The letter was sent on 3 October, shortly before the government outlined its official response to part one of the Horizon inquiry report. It announced that it would accept most of the recommendations, including on redress, put forward by the chair of the inquiry Sir Wyn Williams. In her four-page letter, Baroness Newlove also welcomes access to \"free legal advice\" to help victims with claims but calls for earlier cases to be reviewed.  She explains that where advice had not been available, some victims \"might have been disadvantaged as a result\". \"Is it possible these early cases can be reviewed to ensure everyone has been treated fairly and equally?\" she asks. The letter also raises concerns that some current serving sub postmasters feel \"under pressure\" from managers not to pursue claims, urging the department to ensure this \"is not the case\". Baroness Newlove also relays victims' frustration that Fujitsu, the company behind the faulty Horizon system, continues to work with the government and asks whether this is \"an issue the government is looking to address\". Post Office Minister Blair McDougall said in response to the letter: \"We pay tribute to all the postmasters who have suffered from the Horizon scandal, which is why we have increased the total amount paid to postmasters fivefold to over £1 billion as part of our ongoing commitment to deliver justice to victims as swiftly as possible. \"Since this letter was sent we set out our response to Sir Wyn Williams' inquiry proposals, which will help us further speed up claims, and which offers legal advice to sub postmasters. \"I look forward to working with postmasters in making further improvements to the redress schemes so that they get the compensation they deserve.\" Read more from Sky News:Doctors in England to go on strikeTwo dead and five injured after fire A Post Office spokesperson said: \"We have and continue to actively support all Post Office colleagues, but particularly those with direct contact with Postmasters, to encourage them to submit a claim to the Horizon Shortfall Scheme if they believe they suffered losses in the past. \"Our Area Managers are playing a pivotal role in guiding Postmasters on how to submit a claim and signposting where there's additional support to do so. We have a dedicated claimant support team available on the phone to discuss options, provide support, and answer any questions a Postmaster may have so that we can begin to process their claim right away. \"We would welcome contact with the Victim Commissioner directly so that we can understand more about what they have been told and to ensure all of us work together so that current and former postmasters get their claims in as soon as possible. \"To assist this, we will shortly be launching a national advertising campaign urging any current or former Postmaster who has not submitted a claim to do so as soon as possible and by 31 January 2026.\" A Fujitsu spokesperson said in a statement: \"We continue to work with government to ensure we adhere to the voluntary restrictions we put in place regarding bidding for new contracts while the Post Office Inquiry is ongoing, and we are engaged with government regarding Fujitsu's contribution to compensation.\""
    },
    {
        "title": "Govt forced to water down affordable housing targets as London property market 'in crisis', minister says",
        "description": "The London property market is in crisis with \"nothing like enough new homes being built\", forcing the government to water down targets for affordable housing, the cabinet minister in charge has told Sky News.",
        "url": "https://news.sky.com/story/govt-forced-to-water-down-affordable-housing-targets-as-london-property-market-in-crisis-minister-says-13456091",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-steve-reed-sadiq-khan_7059937.jpg?20251023212654",
        "type": "Home",
        "Author": "Sam Coates",
        "Date Published": "2025-10-23 19:34:00",
        "Headline": "Sky News spoke to Housing Secretary Steve Reed and Mayor of London Sir Sadiq Khan, who blamed the Conservatives for having to lower their targets.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  The London property market is in crisis with \"nothing like enough new homes being built\", forcing the government to water down targets for affordable housing, the cabinet minister in charge has told Sky News. Steve Reed, the housing secretary, and Sir Sadiq Khan, the Mayor of London, made a major intervention in the housing market today with a package to reduce red tape introduced post-Grenfell for developers and slash the target for affordable homes from 35% to 20%. Both men sat down with Sky News for a rare joint interview to justify the decisions, which represent a significant U-turn from the Mayor of London, who has previously made the affordable housing target a central part of his re-election campaigns. Mr Reed justified the decision to slash the affordable housing target - which will be opposed by Labour MPs and charities - on the grounds of \"35% of nothing is nothing\". New figures show the scale of the housebuilding collapse in London. The government set a target in the first nine months of this year for 66,000 new homes to be started in London, but to date, there have been just 3,200 private starts, according to the analyst Molior London. The housing secretary was frank that the government needs to get greater incentives for housebuilding. \"We need to make schemes viable for developers so they'll get spades in the ground and start to build them,\" he said. \n                  'Don't tell anyone': Manager at UK's largest housing association told staff how to fake fire safety notice\n                 \n                  Two arrested as police suspect 'corrupt' council staff allocated 'hundreds of homes for cash'\n                 \n                  Waiting for the bailiffs but nowhere to go: Sharp rise in disabled people facing homelessness\n                 Affordable housing target not to blame However, Sir Sadiq did not appear to accept that the affordable housing target itself was the cause of the collapse in housebuilding - something regularly claimed by property developers. He said that the cause of the worst collapse in housebuilding since the 2008 financial crisis was elsewhere. \"The price of concrete has gone up by more than 50%. The price of steel has gone up more than 40%,\" he said. \"In London, 96% of new builds are flats. We know that when it comes to the flats, you need to borrow. Interest rates have been at record levels. \"What about the impact of Brexit? What about the impact of the two staircases that are required on 96% of these homes? That's why construction has begun, but not been completed.\" Homes that are sold or rented at below market rates for people who cannot afford to buy or rent. Eligibility is determined by local incomes and house prices, and there is often specific criteria such as maximum earnings, not owning a property and having local connections to an area.\n Social rented: Local authorities or housing associations rent homes at about 50% of local market rents. Affordable rented: Homes let by housing associations at a rate of up to 80% of the local market rate. Intermediate rent: Homes let at a rate between social rent and market rent. Affordable ownership: Schemes allowing eligible households to buy a share of a property, reducing the initial mortgage and deposit required. Record numbers of council homes built Sir Sadiq presented a rosier picture of building in London. \"Let me be quite clear, record numbers of council homes have been built in London since the 1970s, records broken,\" he said. \"Record numbers of homes completed in London, never seen since the 1930s. More completions of council homes in 2023-2024 than in any year since records began.\" Before his re-election, Sir Sadiq pointed to a record 25,000 new house building starts. However, many of the projects which he boasted had been started still remain undeveloped. Read more:Manager at UK's largest housing association told staff how to fake fire safety notice A perfect storm Sky News visited Ealing, where in 2023 Sir Sadiq claimed that house building had been under way. According to data from Molior London, 1,000 homes in that borough that were cited as having been started remain undeveloped. Sir Sadiq denied he had been dishonest. \"We face a perfect storm though, in terms of interest rates, in terms of construction inflation, in terms of the pandemic, in terms of legacy of the previous government,\" he said. \"And that's why the government and I, a Labour government and a Labour mayor, are working together, are addressing this perfect storm. \"A good example of kick-starting house building, a shot in the arm to address the crisis we're talking about.\" There is likely to be a backlash at the decision to water down the affordable homes target, given a record 13,000 people were sleeping rough in London in the last year, which was a 10% increase on the year before. Nearly 90,000 children are living in temporary accommodation. Charities are set to sound the alarm about the change. MPs told not to make a fuss Labour MPs told me that Mr Reed and his team have been so concerned about the backlash, he has been warning MPs not to make a fuss in public. Mr Reed said that the overall benefit would be felt even by the vulnerable. \"The effect of the package we're announcing today is that we will see more social and affordable homes built, that means we can get people off the streets. \"And remember the numbers doubled under the Conservative government - off the streets, out of the shop doorways, and get a secure roof over their head. \"We can start to tackle the national scandal of temporary accommodation. It's not temporary at all, it's actually families stuck in a single room very often, kids sharing a bed, the parents on a sofa for years. \"That's because this country has not been building, not because of the Mayor of London, but because of inaction of the previous Conservative government.\""
    },
    {
        "title": "Mafia family members and NBA stars arrested by FBI over illegal gambling and sports rigging",
        "description": "The FBI has led a \"co-ordinated takedown\" on illegal gambling and sports rigging, the agency's director has said, with more than 30 arrested on Thursday. ",
        "url": "https://news.sky.com/story/fbi-leads-gambling-takedown-with-nba-coach-and-player-among-those-arrested-13455927",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kash-patel-fbi-nba_7059868.jpg?20251023195402",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-23 15:44:00",
        "Headline": "Miami Heat guard Terry Rozier, Portland Trail Blazers coach Chauncey Billups and former NBA player Damon Jones were among those arrested.",
        "Content": "The FBI has led a \"co-ordinated takedown\" on illegal gambling and sports rigging, the agency's director has said, with more than 30 arrested on Thursday.  Miami Heat guard Terry Rozier, Portland Trail Blazers coach Chauncey Billups and former NBA player Damon Jones were among those arrested. At a news conference on Thursday, FBI chief Kash Patel said the illegal gambling and sports rigging operation spanned the course of years and the takedown covered 11 states, adding that the case remains ongoing. The Bonanno, Gambino, Genovese and Lucchese mafia families were also hit by the operation, he said. Rozier is accused of participating in an illegal sports betting scheme using private insider NBA information, officials said. Billups is charged in a separate indictment alleging a wide-ranging scheme to rig underground poker games backed by Mafia families. Both men face wire fraud conspiracy and money laundering charges and were expected to make initial court appearances later on Thursday. \n                  Third arrest over sex toy throwing at women's basketball games\n                 \n                  Los Angeles Lakers star LeBron James says he's taking time off social media\n                 \n                  Bronny James: LeBron James's son declares for NBA Draft months after cardiac arrest\n                 In the first case, six defendants are accused of taking part in an insider sports betting conspiracy that exploited confidential information about NBA athletes and teams, Joseph Nocella, the US attorney for the Eastern District of New York said. He said it was \"one of the most brazen sports corruption schemes since online sports betting became widely legalised in the United States\". The second case involves 31 defendants in a nationwide scheme to rig illegal poker games, Mr Nocella said. The defendants include former professional athletes accused of using technology to rake in millions of dollars by rigging mafia-backed underground poker games in the New York area, he said. \"My message to the defendants who've been rounded up today is this: Your winning streak has ended. Your luck has run out,\" Mr Nocella said. In the sports betting scheme, players sometimes altered their performance or removed themselves from games early, New York Police Commissioner Jessica Tisch said. Read more from Sky News: King and Pope pray together in historic first since ReformationDoctors in England to go on five-day strike over pay and jobs In one instance, Rozier, while playing for the Hornets, told people he was planning to leave the game early with a \"supposed injury\", allowing them to place wagers that brought in thousands of dollars, Ms Tisch said. The indictment of Rozier and others says there are nine unnamed co-conspirators, including a Florida resident who was an NBA player, an Oregon resident who was an NBA player from about 1997 to 2014 and an NBA coach since at least 2021, as well as a relative of Rozier. Rozier and other defendants \"had access to private information known by NBA players or NBA coaches\" that was likely to affect the outcome of games or players' performances and provided that information to other co-conspirators in exchange for either a flat fee or a share of betting profits, the indictment says."
    },
    {
        "title": "Entire East Wing of White House will be demolished for ballroom - as Trump urged to pause project",
        "description": "The entire East Wing of the White House will be demolished \"within days\" - much more bulldozing than initially expected for Donald Trump's new ballroom construction project.",
        "url": "https://news.sky.com/story/entire-east-wing-of-white-house-will-be-demolished-for-ballroom-as-trump-urged-to-pause-project-13455570",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rubble-east-wing-white_7059010.jpg?20251023031403",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-23 01:52:00",
        "Headline": "The American National Trust for Historic Preservation has called for all works to be halted until plans go through \"the legally required public review processes\". ",
        "Content": " The entire East Wing of the White House will be demolished \"within days\" - much more bulldozing than initially expected for Donald Trump's new ballroom construction project. Two Trump administration officials told Sky News' US partner NBC that the demolition is a significant expansion of the initial plans announced this summer. \"It won't interfere with the current building,\" Mr Trump had said on 31 July. \"It'll be near it, but not touching it, and pays total respect to the existing building, which I'm the biggest fan of.\" But a White House official told NBC News the \"entirety\" of the East Wing would eventually be \"modernised and rebuilt\". \"The scope and the size of the ballroom project have always been subject to vary as the process develops,\" the official added. The East Wing was built at the beginning of the last century and was last modified in 1942. Explainer: How Trump has changed the White House while in power \n                  Putin criticises Trump's sanctions on oil firms - as Russian jets 'briefly enter NATO airspace'\n                 \n                  Trump's sanctions are no slap on the wrist - they're a punch to the gut of Moscow's war economy \n                 \n                  Changpeng Zhao: Donald Trump pardons billionaire crypto exchange founder\n                 Construction on the ballroom - which is expected to hold up to 900 people when finished - began this week. The National Trust for Historic Preservation, a non-profit agency created by Congress to help preserve historic buildings, warned administration officials in a letter on Tuesday that the planned ballroom \"will overwhelm the White House itself\". \"We respectfully urge the administration and the National Park Service (stewards of the White House) to pause demolition until plans for the proposed ballroom go through the legally required public review processes,\" Carol Quillen, the trust's chief executive, said in a statement. 'Fake news' The White House called the uproar \"manufactured outrage\" by \"unhinged leftists and their fake news allies\" in a statement. Last week, Mr Trump said the total price would be about $250m (£187m), which would be paid for by himself and private donors will pay for. However, on Wednesday, he said the ballroom's price is \"about $300m (£225m)\". The 90,000 sq ft ballroom will dwarf the White House itself - and would be able to accommodate almost five times more guests than the East Room, the largest current space in the mansion. Mr Trump says the ballroom won't cost US taxpayers at all. Instead, \"donors\" would pay for it. Comcast, the parent company of Sky News, was included on a list of top donors released last week - but it is unclear how much it or others have contributed."
    },
    {
        "title": "Labour dealt historic loss in Caerphilly by-election - as Plaid Cymru win seat",
        "description": "Plaid Cymru have won the by-election in the Senedd seat of Caerphilly for the first time.",
        "url": "https://news.sky.com/story/plaid-cymru-win-caerphilly-by-election-in-humiliation-for-labour-13455893",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-lindsay-whittle-plaid_7060043.jpg?20251024023409",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-23 23:22:00",
        "Headline": "Labour had held Caerphilly at every election since it was created in 1999 - as well as the parliamentary seat for over a century. Its candidate received 3,713 votes, and finished in third place.",
        "Content": " Plaid Cymru have won the by-election in the Senedd seat of Caerphilly for the first time. The Welsh nationalist party secured 15,960 votes - and candidate Lindsay Whittle cried as the result was announced. Mr Whittle is 72 years old and had stood as a Plaid candidate 13 times since 1983. He will now hold the seat until the Welsh Assembly's national elections next year. This by-election was widely regarded as a two-horse race between Plaid Cymru and Reform UK, and the result marks a considerable blow for Nigel Farage. His party received 12,113 votes - denying a victory that would have strengthened claims that Reform can convert a large lead in opinion polls into election wins. But more than anything, it is a humiliating defeat for Labour, who had held Caerphilly at every Senedd election since it was created in 1999 - as well as the Westminster seat for over a century. Its candidate received 3,713 votes - and finished in third place. \n                  Labour's dominance in Caerphilly has crumbled like cheese - but a Reform win isn't guaranteed\n                 \n                  MSP Colin Smyth appears in court charged with voyeurism and possessing indecent images of children\n                 \n                  Govt to allow early release of thousands of rapists and violent criminals, Tories claim in sentencing row\n                 Turnout overall stood at 50.43% - considerably higher than during the last ballot back in 2021. Giving his acceptance speech after the result was confirmed, Mr Whittle began by paying tribute to Hefin David - who was Welsh Labour's Member of the Senedd for Caerphilly until his death in August. \"He will be a hard act to follow,\" Mr Whittle said. \"I will never fill his shoes - but I promise you, I will walk the same path that he did.\" The Plaid politician described how he had been \"absolutely heartened\" by how many young people were involved in the by-election - and said the result sends a clear message. He said: \"Listen now Cardiff, and listen Westminster - this is Caerphilly and Wales telling you we want a better deal for every corner of Wales. The big parties need to sit up and take notice. \"Wales, we are at the dawn of new leadership, we are at the dawn of a new beginning - and I look forward to playing my part for a new Wales, and in particular, for the people of the Caerphilly constituency, I thank you with all my heart.\" Mr Whittle quipped that \"it was better than scoring the winning try for Wales in the Rugby World Cup\". And looking ahead to the next year's elections, he added: \"Tonight's result shows what's possible when people come together to back practical solutions and protect what matters most. \"We've beaten billionaire-backed Reform and, with the same determination, we can do it again in May 2026. Caerphilly has shown the way - now Wales must follow.\" Read more from Sky News:Mafia members and NBA stars arrestedPutin criticises Trump's new sanctions Speaking to Sky's chief political correspondent Jon Craig just before the declaration, Plaid Cymru leader Rhun ap Iorwerth said: \"There's clearly a real significance to the result - we are seeing the disillusionment with Labour writ large. I've heard it on hundreds of doorsteps, we've seen it in opinion polls.\" He also conceded that there was tactical voting in this by-election - with Labour and Conservative supporters alike backing Lindsay Whittle to keep out Reform. However, Mr ap Iorwerth added: \"I've spoken to literally hundreds and hundreds of people who told me - time and time again - 'I've been a Labour supporter all my life, and we're backing you this time.' \"Not begrudgingly, but because they see that's the direction we're going in - not just in this by-election, but as a nation. I'm calling on people to get behind that positive change - not just today, but ahead of next May.\" The Conservatives and the Liberal Democrats were among the parties who lost their deposits."
    },
    {
        "title": "Royals visit to meet Pope Leo at Vatican is welcome relief for King Charles engulfed in Prince Andrew revelations",
        "description": "It was a welcome designed to catch our attention, for a visit that meant everything to the King.",
        "url": "https://news.sky.com/story/royals-visit-to-meet-pope-leo-at-vatican-is-welcome-relief-for-king-charles-engulfed-in-prince-andrew-revelations-13456003",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-king-charles-basilica_7059590.jpg?20251023151727",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-10-23 19:38:00",
        "Headline": "Interactions between the King and Pope showed a shared interest in a range of global issues. But, following the recent controversy surrounding Prince Andrew, it is also an opportunity for Charles to draw our attention back to important moments like this.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n It was a welcome designed to catch our attention, for a visit that meant everything to the King. The Swiss guard, standing to attention as the UK's national anthem played out in the courtyard outside the Apostolic Palace. Queen Camilla, wearing a distinctive black mantilla as a mark of respect to the Pope, as they made their way inside to meet Pope Leo XIV for the first time. We know King Charles had built a relationship with Pope Francis before his death, now it appeared he was building a friendly rapport with his predecessor, as Pope Leo and the King happily talked away, both in English, meaning their conversation flowed more naturally.  But while friendships between heads of state do matter diplomatically, this was also about making history. Inside the Sistine Chapel, they prayed alongside each other. The first time a monarch and a pontiff have done that for 500 years, since Henry VIII broke away from the Catholic Church. With King Charles also the supreme governor of the Church of England, the optics could not have been more significant for relations between the two faiths. If you wanted to see how much King Charles's interfaith work is appreciated, it came at the basilica of St Paul's outside the walls. An abbey with long-held links with English monarchs, where he was given the ceremonial title of royal confrater, and a special seat was made just for him and his heirs. Read more from Sky News:Charles meets synagogue attack survivorsShould MPs have a say on Andrew?Police examine fresh Andrew allegations Alongside religious matters, the two men talked publicly about their shared passion for the environment ahead of the UN's climate conference COP, taking place in just over a week's time. With the King sent here on behalf of the government, and the foreign office emphasising how the Holy See is a vital global partner, we really saw brought into focus the soft power of the royals and the church, and how influential both can be. The interactions between the King and Pope showed a shared interest in a range of global issues. But as the head of the Catholic Church for England and Wales, Cardinal Vincent Nichols pointed out to me, here are also two heads of state who sadly have issues around allegations of historical sexual abuse hanging over their institutions, and the decision on how to address that publicly. There will be relief that there were no updates on the Prince Andrew problem today. But despite Andrew vehemently denying that he has done anything wrong, revelations have kept coming. And that is where the jeopardy lies for the royal family as they try to draw our attention back to important moments like this."
    },
    {
        "title": "Head of Southport attacker's former school tells inquiry he was 'building up to something'",
        "description": "The head teacher of the Southport attacker's former school has told a public inquiry she felt like he was \"building up to something\".",
        "url": "https://news.sky.com/story/head-of-southport-attackers-former-school-tells-inquiry-he-was-building-up-to-something-13455944",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/b9e710f5d6ea5747566d5455c6283cc3d534a305cc90144334acd2f959b25e4a_6966447.jpg?20251006182601",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-23 16:16:00",
        "Headline": "Joanne Hodson, head of The Acorns School in Ormskirk, said she had a \"visceral sense of dread\" that Axel Rudakubana would do something.",
        "Content": "The head teacher of the Southport attacker's former school has told a public inquiry she felt like he was \"building up to something\". Joanne Hodson, head of The Acorns School in Ormskirk, said she had a \"visceral sense of dread\" that he would do something. \"I felt like something was going to happen and there was a level of agitation with direct challenges to staff, the way he was with other pupils. I felt like every day it was building and building and building,\" she told the inquiry at Liverpool Town Hall. Axel Rudakubana, then aged 17, killed six-year-old Bebe King, seven-year-old Elsie Dot Stancombe, and nine-year-old Alice da Silva Aguiar and attempted to murder 10 others at a Taylor Swift-themed dance class in Southport on 29 July last year. He was later jailed for a minimum of 52 years. Rudakubana, referred to during the public inquiry as AR, came to Ms Hodson's school after he was permanently excluded from the Range High School, in Formby, due to taking knives to school in October 2019. 'Devoid of any remorse' Ms Hodson said she first met Rudakubana at his admissions meeting for the Acorns, when she asked him why he had taken a knife to his former school. \"He looked me in the eyes and said 'to use it'. This is the only time in my career that a pupil has said this to me or behaved in a manner so devoid of any remorse,\" she said. \"What also surprised me was that AR's parents did not flinch at this comment.\" She said the parents saw Rudakubana \"as the victim\" and believed he had taken the knife to school as a response to being bullied. His parents thought he was a \"good boy\" who never did anything wrong and that \"any issues were someone else's fault\", according to Ms Hodson. Ms Hodson said she had feared Rudakubana was going to \"bring something\" to the Acorns. Instead, he returned to the Range in December 2019 to assault another student with a hockey stick while carrying a knife in his bag. 'Sinister undertone' Ms Hodson described Rudakubana as the \"most unusual\" pupil she had experienced during her career, adding in a statement: \"There was a sinister undertone and it was difficult to build rapport. \"He had no respect for authority and generally a lack of respect of other pupils and staff. He was insistent that his views alone were correct and everyone else was wrong. There was never any sense of remorse or accountability for his actions.\" In his education, health and care plan, it was noted there were concerns that Rudakubana said or did things which had been described as \"sinister\", the inquiry heard. More from the inquiry:Rudakubana judged as posing no risk to othersHis parents struggled to deal with outburstsTaxi driver waited 50 minutes to call 999The missed chances to stop Rudakubana Ms Hodson said she was asking other agencies for help, but the word \"sinister\" was crossed out in the report and changed to \"inappropriate\" after professional views were submitted by the child and adolescent mental health service (CAMHS). \"I was challenged quite heavily and told no child should ever be described as sinister and as a professional I should not be using those words,\" she said. 'Let down' by Prevent Ms Hodson said school staff were concerned about Rudakubana attacking his peers and made three referrals about him to the government's anti-terror programme Prevent. The head teacher said staff felt \"let down\" after their third referral caused in the school's relationship with Rudakubana and his father, but was not acted on by Prevent. When Rudakubana made comments thought to be antisemitic in school in January 2022, teachers did not make another referral to Prevent, with Ms Hodson telling the inquiry: \"On reflection, whilst I regret not submitting further Prevent referrals in 2022, I think by this point Acorns had lost faith that anything would be done.\" She said staff were concerned about Rudakubana being radicalised, but \"he was so socially isolated that I could not conceive of the idea that he might attack a group of strangers, let alone young children\". \"The tragic events are so far removed from what I would have associated AR with in terms of risk,\" Ms Hodson said. The inquiry was adjourned until Monday."
    },
    {
        "title": "Woman has new multiple sclerosis treatment that doctors say could be 'game-changer'",
        "description": "A mum with multiple sclerosis has become the first patient in the UK to receive an experimental treatment that could slow or even stop progression of the disease.",
        "url": "https://news.sky.com/story/woman-has-new-multiple-sclerosis-treatment-that-doctors-say-could-be-game-changer-13455765",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ms-moore-multiple-sclerosis_7059455.jpg?20251023125748",
        "type": "UK",
        "Author": "Thomas Moore",
        "Date Published": "2025-10-23 23:01:00",
        "Headline": "Doctors are looking to recruit more people for the trial, which they say could one day be given as a single one-off treatment.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  A mum with multiple sclerosis has become the first patient in the UK to receive an experimental treatment that could slow or even stop progression of the disease. Emily Henders, 37, was given an infusion of her own cells that had been weaponised in the lab to hunt down rogue elements in her immune system that drive the disease's disabling relapses. Sky News was given special permission to be present as the cells arrived deep frozen in liquid nitrogen before being carefully thawed and infused into her bloodstream. \"Someone's got to do it. Someone's got to be the first,\" she told me. Emily has had MS for four years, but existing drug treatment hasn't worked. Three times she's woken to find she's unable to move her legs. Her dad also has the disease and is now in a wheelchair. \"I want to avoid getting to that point as much as possible,\" she said. \n                  Apple users could get 'significant' compensation say lawyers, after tech firm loses competition ruling over 'unfair' £1.5bn app store fees\n                 \n                  English water firms get lowest environmental rating since records began\n                 \n                  European space firms combine to compete with SpaceX\n                 \"The thought of not being able to chase after my children or even walk up and down the stairs is something that I want to avoid at all costs. \"I want to stop it (the disease) before it has a chance to stop me.\" Multiple sclerosis is caused by rogue cells in the immune system turning against the body and attacking the protective covering of nerves in the brain and spinal cord. It can cause blurred vision or problems with movement, memory or thinking, depending on which nerves have been damaged. There is currently no cure. But doctors at University College London Hospitals (UCLH) are leading a new global trial of so-called CAR T therapy. They took blood from Emily and isolated T cells that normally defend the body against infections. These were genetically modified in the lab to target the rogue B cells in the immune system instead, and then infused back into Emily's bloodstream. The hope is that the treatment will stop further damage to the nerves and halt progress of the disease. Dr Claire Roddie, who has been instrumental in designing the treatment, said it was one of the most significant developments in her clinical lifetime. \"If we can intervene with something that essentially reaches deep into all the areas of the body where the disease-causing cells are, and eradicate them, it is almost like flicking a switch,\" she said. \"You get this immune (system) reset where the bad B cells don't recover, and you get just normal B cells.\" CAR T therapy has already been successfully used to treat - and sometimes cure - aggressive blood cancers by harnessing the immune system to hunt down abnormal cells. There is now growing interest in also testing it against autoimmune diseases, where the immune system starts to attack the body. Early-stage clinical trials on patients with the chronic disease lupus are promising. The MS trial at UCLH will recruit 18 patients at hospitals around the world. It is primarily designed to confirm the treatment is safe enough to progress to larger studies, but scientists will also monitor the impact on the rogue cells. Dr Wallace Brownlee, who is the principal investigator of the trial, said: \"None of the medications we have available are fully effective at preventing relapses. \"This can be given as a single one-off treatment. It could be a real game-changer in terms of how we manage MS in the future.\" The form of CAR T cell therapy being tested in the trial was invented by scientists at University College London's Cancer Institute, and licensed by the UCL spinout Autolus. It is called Obe-cel and is less likely to have serious side effects on the immune system than the first generation of CAR T therapies. Read more from Sky News:Parkinson's patient plays clarinet during brain surgeryBlood test for more than 50 cancers 'could transform outcomes' Emily is a secondary school biology teacher and understands the scientific rationale for the treatment - but also for the potential of side effects. \"What are my options here?\" she said. \"I could just let this disease take over and we could wait and see and I might be lucky and nothing happens to me. \"Or I might have a massive relapse next week and never be able to walk again. \"Are we willing to take that chance? And I think we've come to the conclusion that no, we're not. We have to trust science and trust medicine to do its job.\" There are more than 150,000 people with MS in the UK. Nearly 7,100 are newly diagnosed each year. The trial, called AUTO1-MS1O, is open to UK patients who have been diagnosed with relapsing or progressive forms of MS and whose disability is worsening despite existing treatment. Dr Frederick Vonberg, neurology research fellow at UCL and UCLH, said: \"We encourage patients aged between 18 and 60 years to speak to their neurologist and explore whether they might be eligible for a referral to this trial.\""
    },
    {
        "title": "Restaurateur charged with murder of 100-year-old mother",
        "description": "A restaurateur has been charged with murder after the death of his 100-year-old mother. ",
        "url": "https://news.sky.com/story/restaurateur-charged-with-murder-of-100-year-old-mother-13456079",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-oxford-crown-court_7059896.jpg?20251023205259",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-23 20:13:00",
        "Headline": "Pamela Mogford died in February 2022 in Bledlow Ridge, Buckinghamshire. Her 78-year-old son Jeremy Mogford, founder of the Browns chain, has been charged with one count of murder and one count of attempted murder.",
        "Content": "A restaurateur has been charged with murder after the death of his 100-year-old mother.  Pamela Mogford died in February 2022 in Bledlow Ridge, Buckinghamshire. Her 78-year-old son Jeremy Mogford, founder of the Browns chain, and Sarah Pickering, 71, have each been charged with one count of murder and one count of attempted murder. Mogford, from St Giles, Oxford, and Pickering, from Guildford in Surrey, appeared in court in Oxford via videolink on Thursday. They were released on bail and are due to appear at Oxford Crown Court in March. Read more here:Paratrooper not guilty of Bloody Sunday murdersWater firms get lowest environmental rating Mogford said the accusation was \"nonsense\" and said in a statement: \"Our mother was nearly 101 years old and died, as her doctor stated, of old age.\" Mogford reportedly sold the Browns chain in 1998 for £35m."
    },
    {
        "title": "Apple users could get 'significant' compensation say lawyers, after tech firm loses competition ruling over 'unfair' £1.5bn app store fees",
        "description": "Apple has lost a landmark lawsuit over fees in the App Store, which could benefit around 36 million iPhone and iPad users in the UK.",
        "url": "https://news.sky.com/story/apple-users-could-get-significant-compensation-say-lawyers-after-tech-firm-loses-competition-ruling-over-unfair-16315bn-app-store-fees-13456089",
        "image_url": "https://e3.365dm.com/22/12/1920x1080/skynews-iphone-apple-app-store_5996092.jpg?20221214101321",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-23 21:44:00",
        "Headline": "Tinder, Minecraft, Clash of Clans and Strava are among popular apps with subscriptions or in-app purchases, which secure hefty commissions for Apple. iPhone and iPad users in the UK now face the prospect of compensation after a landmark lawsuit.",
        "Content": "Apple has lost a landmark lawsuit over fees in the App Store, which could benefit around 36 million iPhone and iPad users in the UK. The Competition Appeal Tribunal (CAT) has ruled that the US tech company abused its dominant position by \"charging excessive and unfair prices in the form of the commission which it charges developers\". Lawyers for Dr Rachael Kent, the academic who brought the case, claim Apple had made \"exorbitant profits\" by excluding all competition for the distribution of apps and in-app purchases. It is argued Apple should pay around £1.5bn in damages for purchases made over the last 10 years. Apple - which has faced mounting pressure from regulators in the US and Europe over the fees it charges developers - says it will appeal. Developers are typically charged 30% commission and are blocked from routing payments through any platform other than Apple's App Store. The tribunal said calculations about compensation will be argued at a hearing next month. \n                  Jessica Chastain criticises decision to delay release of The Savant after Charlie Kirk killing\n                 \n                  UK drops Apple encryption demands, says US spy chief\n                 \n                  Trump announces yet more tariffs and praises 'significant step' from Apple\n                 According to legal firm Hausfeld & Co LLP, the ruling will mean potential compensation for many Apple users in the UK. It says people must have: • made a purchase on an iPhone or iPad since 1 October 2015 • used the UK storefront of the App Store • spent money for paid-for apps, subscriptions or in-app purchases of digital content Apple users can check their eligibility for compensation by logging into their App Store account and checking their \"Purchase History\". Hausfeld says the \"sums will be significant\" for users who have app subscriptions or make regular in-app purchases. Example 1: Strava subscription at £8.99 a month/£107.88 a year - users would be entitled to £21.58 for each year.\n Regular gamers are also likely to receive large sums in compensation. Example 2: Clash of Clans, a sack of gems is £19.99 - users would get £4.00 back Example 3: Minecraft, 960 Minecoins are £5.99 – compensation would be £1.20 Any compensation is also likely to be delayed while Apple attempts to appeal the ruling, which could still be overturned by a higher court. \"This ruling overlooks how the App Store helps developers succeed and gives consumers a safe, trusted place todiscover apps and securely make payments,\" an Apple spokesperson said. In a statement, Dr Kent, an academic and senior lecturer at King's College, London, said: \"Those unfair fees have added up to billions for the world's richest company, and less choice and innovation for everyone else.\" She added that the ruling shows the UK's collective action regime is working and \"sends a clear message: no company, however wealthy or powerful, is above the law\". Read more from Sky News:Apple and Meta fined by EUApple sued by Which? over iCloudPhone users could get compensation Lesley Hannah, partner at Hausfeld & Co LLP, who represents Dr Kent, said: \"The whole purpose of competition law is to ensure fairness and to prevent companies exploiting their market power.\" \"Apple illegally kept rivals out of the market in order to prevent their customers being able to use rival app stores and save money,\" she added. Ms Hannah told Sky News that Apple will need to convince the court that there is \"an error of law\" in the judgment and any appeal could take a year to 18 months, potentially delaying any compensation. Fellow tech giants, including Amazon and Microsoft, are also facing sizeable claims at the CAT, while Google is being challenged over the commission it charges app developers for access to its Play Store. Meanwhile, on Wednesday, the Competition and Markets Authority (CMA) targeted Google and Apple for their \"strategic\" roles in mobile ecosystems, opening the door for regulators to impose changes to their business practices to improve competition. The CMA escalated scrutiny of the two US tech companies by labelling them with \"strategic market status\". Google called that decision \"disappointing, disproportionate and unwarranted\" while Apple said the move could pose increased risks for users and jeopardise the UK's \"developer economy\"."
    },
    {
        "title": "Govt forced to water down affordable housing targets as London property market 'in crisis', minister says",
        "description": "The London property market is in crisis with \"nothing like enough new homes being built\", forcing the government to water down targets for affordable housing, the cabinet minister in charge has told Sky News.",
        "url": "https://news.sky.com/story/govt-forced-to-water-down-affordable-housing-targets-as-london-property-market-in-crisis-minister-says-13456091",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-steve-reed-sadiq-khan_7059937.jpg?20251023212654",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-10-23 19:34:00",
        "Headline": "Sky News spoke to Housing Secretary Steve Reed and Mayor of London Sir Sadiq Khan, who blamed the Conservatives for having to lower their targets.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  The London property market is in crisis with \"nothing like enough new homes being built\", forcing the government to water down targets for affordable housing, the cabinet minister in charge has told Sky News. Steve Reed, the housing secretary, and Sir Sadiq Khan, the Mayor of London, made a major intervention in the housing market today with a package to reduce red tape introduced post-Grenfell for developers and slash the target for affordable homes from 35% to 20%. Both men sat down with Sky News for a rare joint interview to justify the decisions, which represent a significant U-turn from the Mayor of London, who has previously made the affordable housing target a central part of his re-election campaigns. Mr Reed justified the decision to slash the affordable housing target - which will be opposed by Labour MPs and charities - on the grounds of \"35% of nothing is nothing\". New figures show the scale of the housebuilding collapse in London. The government set a target in the first nine months of this year for 66,000 new homes to be started in London, but to date, there have been just 3,200 private starts, according to the analyst Molior London. The housing secretary was frank that the government needs to get greater incentives for housebuilding. \"We need to make schemes viable for developers so they'll get spades in the ground and start to build them,\" he said. \n                  'Don't tell anyone': Manager at UK's largest housing association told staff how to fake fire safety notice\n                 \n                  Two arrested as police suspect 'corrupt' council staff allocated 'hundreds of homes for cash'\n                 \n                  Waiting for the bailiffs but nowhere to go: Sharp rise in disabled people facing homelessness\n                 Affordable housing target not to blame However, Sir Sadiq did not appear to accept that the affordable housing target itself was the cause of the collapse in housebuilding - something regularly claimed by property developers. He said that the cause of the worst collapse in housebuilding since the 2008 financial crisis was elsewhere. \"The price of concrete has gone up by more than 50%. The price of steel has gone up more than 40%,\" he said. \"In London, 96% of new builds are flats. We know that when it comes to the flats, you need to borrow. Interest rates have been at record levels. \"What about the impact of Brexit? What about the impact of the two staircases that are required on 96% of these homes? That's why construction has begun, but not been completed.\" Homes that are sold or rented at below market rates for people who cannot afford to buy or rent. Eligibility is determined by local incomes and house prices, and there is often specific criteria such as maximum earnings, not owning a property and having local connections to an area.\n Social rented: Local authorities or housing associations rent homes at about 50% of local market rents. Affordable rented: Homes let by housing associations at a rate of up to 80% of the local market rate. Intermediate rent: Homes let at a rate between social rent and market rent. Affordable ownership: Schemes allowing eligible households to buy a share of a property, reducing the initial mortgage and deposit required. Record numbers of council homes built Sir Sadiq presented a rosier picture of building in London. \"Let me be quite clear, record numbers of council homes have been built in London since the 1970s, records broken,\" he said. \"Record numbers of homes completed in London, never seen since the 1930s. More completions of council homes in 2023-2024 than in any year since records began.\" Before his re-election, Sir Sadiq pointed to a record 25,000 new house building starts. However, many of the projects which he boasted had been started still remain undeveloped. Read more:Manager at UK's largest housing association told staff how to fake fire safety notice A perfect storm Sky News visited Ealing, where in 2023 Sir Sadiq claimed that house building had been under way. According to data from Molior London, 1,000 homes in that borough that were cited as having been started remain undeveloped. Sir Sadiq denied he had been dishonest. \"We face a perfect storm though, in terms of interest rates, in terms of construction inflation, in terms of the pandemic, in terms of legacy of the previous government,\" he said. \"And that's why the government and I, a Labour government and a Labour mayor, are working together, are addressing this perfect storm. \"A good example of kick-starting house building, a shot in the arm to address the crisis we're talking about.\" There is likely to be a backlash at the decision to water down the affordable homes target, given a record 13,000 people were sleeping rough in London in the last year, which was a 10% increase on the year before. Nearly 90,000 children are living in temporary accommodation. Charities are set to sound the alarm about the change. MPs told not to make a fuss Labour MPs told me that Mr Reed and his team have been so concerned about the backlash, he has been warning MPs not to make a fuss in public. Mr Reed said that the overall benefit would be felt even by the vulnerable. \"The effect of the package we're announcing today is that we will see more social and affordable homes built, that means we can get people off the streets. \"And remember the numbers doubled under the Conservative government - off the streets, out of the shop doorways, and get a secure roof over their head. \"We can start to tackle the national scandal of temporary accommodation. It's not temporary at all, it's actually families stuck in a single room very often, kids sharing a bed, the parents on a sofa for years. \"That's because this country has not been building, not because of the Mayor of London, but because of inaction of the previous Conservative government.\""
    },
    {
        "title": "Ringleader behind arson attack and kidnap plot was 'groomed' by Russian chatbot, court told",
        "description": "The ringleader behind an arson attack and plot to kidnap a billionaire Russian dissident had been \"groomed\" by a chatbot, operated by Wagner mercenaries, a court was told.",
        "url": "https://news.sky.com/story/ringleader-behind-arson-attack-and-kidnap-plot-was-groomed-by-russian-chatbot-court-told-13455886",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-dylan-earl-wagner-arson_6727701.png?20241025181109",
        "type": "UK",
        "Author": "Duncan Gardham, security journalist",
        "Date Published": "2025-10-23 17:09:00",
        "Headline": "Dylan Earl, 21, a builder and part-time drug dealer, has been cast by his defence as a cannabis-smoking gamer who was involved in \"desperate, pathetic and delusional\" message exchanges with a Russian chatbot controlled by the Wagner Group.",
        "Content": "By Duncan Gardham, security journalist  The ringleader behind an arson attack and plot to kidnap a billionaire Russian dissident had been \"groomed\" by a chatbot, operated by Wagner mercenaries, a court was told. The Old Bailey heard the fire at an industrial estate in Leyton, East London, on 20 March 2024, caused an estimated £1m of damage, including to vital Starlink satellite equipment destined for Ukraine. Dylan Earl, 21, a builder and part-time drug dealer who lived with his parents in Elmesthorpe, Leicestershire, has admitted his role in orchestrating the attack by recruiting others to carry it out. During his trial, the court heard he also tasked two people to burn down an exclusive restaurant and wine dealership in Mayfair and to kidnap Evgeny Chichvarkin, the billionaire owner. However, Paul Hynes KC, defending, told a sentencing hearing on Thursday that the Russians were \"trash fishing\" using a Russian language chatbot called PrivetBot on the encrypted Telegram platform and Earl was \"easy meat\". \"Our prime submission is that he is, or was at the time, a sad individual who sat for lengthy periods alone in his bedroom at his parents' house. \"His minimalist existence was taking drugs, particularly cannabis and involving himself in online gaming. \"We do not seek to characterise Dylan Earl as a victim in this case but there are vulnerable elements in him that were used by PrivetBot, acting on behalf of the Wagner Group, as a proxy for the Russian Federation.\" In April 2024, PrivetBot messaged Earl. His replies had been deleted, but the Wagner contact said: \"I see that you know what you want. It's a great happiness that you have realised so early that you are a WARRIOR. We need your connections and your capabilities.\" Mr Hynes told the judge, Mrs Justice Cheema-Grubb, Earl was \"very much a sad individual\" who \"had a certain detachment from reality\" and \"sought praise, importance and significance\". \"The potent effect of the messaging is shown in his desperate, pathetic and delusional responses,\" he added. Read more from Sky News:Arsonist told to watch spy dramaExplainer: US sanctions on RussiaFake celebrity chatbots targeting children Earl messaged the contact, offering to recruit thousands more to join their operation and boasting of his underworld contacts. \"If you need connections with IRA, I can sort it. You want criminal connections with murderers, kidnappers, soldiers, drug dealers, fraudsters, car thieves, I can sort it all,\" Earl wrote. But the court heard Earl never left his bedroom and never met the people he recruited. Earl and five other men are being sentenced for their part in the Russian-ordered arson attack on behalf of the Wagner Group, a Russian mercenary company, which is proscribed as a terrorist organisation in the UK. The Kremlin denies accusations that it is involved in any such acts of sabotage. The men will be sentenced on Friday."
    },
    {
        "title": "Post Office compensation 'worse than original injustice', victims' commissioner says",
        "description": "A leaked letter, seen by Sky News, warns government that victims of the Post Office scandal find compensation schemes \"worse than the original injustice\".",
        "url": "https://news.sky.com/story/post-office-victims-say-in-leaked-letter-compensation-worse-than-original-injustice-13455885",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-post-office-branch_6986135.jpg?20250809021535",
        "type": "UK",
        "Author": "Adele Robinson",
        "Date Published": "2025-10-23 14:33:00",
        "Headline": "The letter was written by victims commissioner Baroness Newlove and sent to the Post Office minister Blair McDougall earlier this month.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n A leaked letter, seen by Sky News, warns government that victims of the Post Office scandal find compensation schemes \"worse than the original injustice\". The letter was written by victims' commissioner Baroness Newlove and sent to the Post Office minister Blair McDougall earlier this month. \"Far from offering catharsis,\" she writes, \"the compensation process was seen to be as bad as or even worse an experience than the initial investigation, prosecution and injustice itself.\" She adds that \"hearing this from victims, time and again, shocked me\". Victims told her that initial offers were \"insultingly low\" and that constant delays and requests for decades-old paperwork had left them offended and \"distressed\". Some described the process as \"adversarial\", with Baroness Newlove comparing it to fighting an insurance company rather than receiving justice from the state.  The letter urges the government to abandon \"commercial tactics\" such as making low initial offers - approaches the Commissioner says are \"not appropriate when dealing with traumatised victims\". \n                  27 years after conviction, he hopes he'll still be alive by the time he's cleared his name\n                 \n                  Major milestone in Post Office scandal as first Capture conviction referred to Court of Appeal\n                 \n                  Post Office scandal compensation shake-up and new redress body revealed\n                 \"It might be better to come back with a request for more information, rather than make an offer that is guaranteed to offend the victim,\" she said. The letter was sent on 3 October, shortly before the government outlined its official response to part one of the Horizon inquiry report. It announced that it would accept most of the recommendations, including on redress, put forward by the chair of the inquiry Sir Wyn Williams. In her four-page letter, Baroness Newlove also welcomes access to \"free legal advice\" to help victims with claims but calls for earlier cases to be reviewed.  She explains that where advice had not been available, some victims \"might have been disadvantaged as a result\". \"Is it possible these early cases can be reviewed to ensure everyone has been treated fairly and equally?\" she asks. The letter also raises concerns that some current serving sub postmasters feel \"under pressure\" from managers not to pursue claims, urging the department to ensure this \"is not the case\". Baroness Newlove also relays victims' frustration that Fujitsu, the company behind the faulty Horizon system, continues to work with the government and asks whether this is \"an issue the government is looking to address\". Post Office Minister Blair McDougall said in response to the letter: \"We pay tribute to all the postmasters who have suffered from the Horizon scandal, which is why we have increased the total amount paid to postmasters fivefold to over £1 billion as part of our ongoing commitment to deliver justice to victims as swiftly as possible. \"Since this letter was sent we set out our response to Sir Wyn Williams' inquiry proposals, which will help us further speed up claims, and which offers legal advice to sub postmasters. \"I look forward to working with postmasters in making further improvements to the redress schemes so that they get the compensation they deserve.\" Read more from Sky News:Doctors in England to go on strikeTwo dead and five injured after fire A Post Office spokesperson said: \"We have and continue to actively support all Post Office colleagues, but particularly those with direct contact with Postmasters, to encourage them to submit a claim to the Horizon Shortfall Scheme if they believe they suffered losses in the past. \"Our Area Managers are playing a pivotal role in guiding Postmasters on how to submit a claim and signposting where there's additional support to do so. We have a dedicated claimant support team available on the phone to discuss options, provide support, and answer any questions a Postmaster may have so that we can begin to process their claim right away. \"We would welcome contact with the Victim Commissioner directly so that we can understand more about what they have been told and to ensure all of us work together so that current and former postmasters get their claims in as soon as possible. \"To assist this, we will shortly be launching a national advertising campaign urging any current or former Postmaster who has not submitted a claim to do so as soon as possible and by 31 January 2026.\" A Fujitsu spokesperson said in a statement: \"We continue to work with government to ensure we adhere to the voluntary restrictions we put in place regarding bidding for new contracts while the Post Office Inquiry is ongoing, and we are engaged with government regarding Fujitsu's contribution to compensation.\""
    },
    {
        "title": "Alleged Madeleine McCann family stalker said she never intended to harm them, court hears",
        "description": "The young woman accused of stalking Madeleine McCann's family said in police interviews she never intended to harm them, a jury has been told.",
        "url": "https://news.sky.com/story/alleged-madeleine-mccann-family-stalker-said-she-never-intended-to-harm-them-court-hears-13455839",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-julia-wandelt-madeleine-mccann_7044386.jpg?20251006193949",
        "type": "UK",
        "Author": "Martin Brunt",
        "Date Published": "2025-10-23 13:07:00",
        "Headline": "Julia Wandelt, 24, denies stalking Kate and Gerry McCann, causing serious alarm or distress and is on trial at Leicester Crown Court. She allegedly told police: \"I never wanted to cause them any distress, or make them stressed or sad, never. I just wanted them to take a DNA test.\"",
        "Content": "\n          Crime correspondent\n              @skymartinbrunt\n The young woman accused of stalking Madeleine McCann's family said in police interviews she never intended to harm them, a jury has been told. Julia Wandelt, 24, who the prosecution says believed she could be the missing toddler, allegedly said: \"I never wanted to cause them any distress, or make them stressed or sad, never. I just wanted them to take a DNA test.\" She was interviewed by detectives three times after her arrest in February this year and answered \"no comment\" to many questions. But jurors heard that she was asked how she felt when Madeleine's younger sister Amelie became alarmed after Wandelt contacted her and was worried about what she would do next. Wandelt allegedly told police: \"What could I do next? I was only asking for a DNA test. I'm the victim here. \"They don't care. They don't care about Madeleine, they don't care about me. They only care about themselves. \"I would never do anything bad to them. I would never hurt them.\" \n                  Protesters in Germany demand removal of Madeleine McCann suspect\n                 \n                  Alleged Madeleine McCann family stalker left voicemails saying 'I believe I'm really her'\n                 \n                  Madeleine McCann's great-aunt says 'stalker' approached her at vigil, court told\n                 Wandelt listened to her interview transcripts being read out as she sat in a room at the jail where she is being held in custody. Occasionally, she walked away and then returned. Madeleine McCann was nearly four when she vanished from the family's rented holiday apartment in Portugal in 2007. Wandelt and Karen Spragg, 61, who the prosecution says was Wandelt's supporter, deny stalking the McCanns. In her police interviews, jurors were told that Spragg said she had met Wandelt on social media and treated her as a daughter, trying to help her persuade the McCanns to take a DNA test. \"Julia's a grown adult, I couldn't stop her,\" she told police. She believed Wandelt had good evidence that she was Madeleine. Spragg allegedly told police she had texted Madeleine's parents on Wandelt's behalf and accompanied her on a trip to confront the couple outside their home in Leicestershire. Police asked her in the interview why she thought Gerry McCann hadn't wanted to speak to Wandelt. Read more from Sky News:Doctors in England to go on strike in NovemberParatrooper not guilty of Bloody Sunday murders She allegedly replied: \"They know what they did to her. They arranged the kidnapping and abduction.\" The trial at Leicester Crown Court continues."
    },
    {
        "title": "Putin criticises Trump's sanctions on oil firms - as Russian jets 'briefly enter NATO airspace'",
        "description": "Vladimir Putin has described Donald Trump's sanctions against two major oil firms as an \"unfriendly act\".",
        "url": "https://news.sky.com/story/defiant-putin-insists-trumps-sanctions-on-oil-companies-wont-affect-russias-economy-13456221",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-putin-russia_7060030.jpg?20251024003159",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-23 21:57:00",
        "Headline": "European leaders are going to arrive in London later today for a \"critical\" meeting of the \"Coalition of the Willing\" - with the goal of discussing \"how they can pile pressure on Putin as he continues to kill innocent civilians with indiscriminate attacks across Ukraine\".",
        "Content": " Vladimir Putin has described Donald Trump's sanctions against two major oil firms as an \"unfriendly act\". However, the Russian president has insisted the tightened restrictions won't affect the nation's economy, a claim widely contradicted by most analysts. In a major policy shift, Mr Trump imposed sanctions against Rosneft and Lukoil - Russia's biggest oil companies - on Wednesday.  The White House said this was because of \"Russia's lack of serious commitment to a peace process to end the war in Ukraine\". Putin has now warned the move could disrupt the global oil markets, and lead to higher prices for consumers worldwide. A meeting between the two leaders had been proposed in Budapest, but Mr Trump said he had decided to cancel the talks because \"it didn't feel right to me\". Speaking from the Oval Office, he had told reporters: \"I have good conversations. And then, they don't go anywhere. They just don't go anywhere.\" \n                  Power of Russia sanctions lies in US financial system that greases the wheels\n                 \n                  Trump's oil sanctions have put 'US on warpath with Russia', says Putin ally\n                 \n                  Trump's sanctions are no slap on the wrist - they're a punch to the gut of Moscow's war economy \n                 Giving a speech in Moscow yesterday, Putin said \"dialogue is always better than war\" - but warned that Russia will never bow to pressure from abroad. Earlier, his long-term ally Dmitry Medvedev had described Mr Trump as a \"talkative peacemaker\" who had now \"fully embarked on the warpath against Russia\".  Oil prices have witnessed a sizeable jump since the sanctions were announced, with Brent crude rising by 5% - the biggest daily percentage gains since the middle of June. In other developments, Lithuania has claimed that two Russian military aircraft briefly entered its airspace yesterday. A Su-30 fighter and Il-78 refuelling tanker were in the NATO member's territory for 18 seconds, and Spanish jets were scrambled in response to the incident. Russia's defence ministry denied this - and said its planes did not violate the borders of any other country during a \"training flight\" in the Kaliningrad region. Read more:Sanctions could have chilling effect on marketHow could new sanctions impact the UK?  Volodymyr Zelenskyy attended a European Council summit in Brussels to discuss the war in Ukraine - and said the meeting had delivered \"good results\". He said Ukraine had secured political support for frozen Russian assets and \"their maximum use\" to defend against Russian aggression, adding the EU would \"work out all the necessary details\". Mr Zelenskyy thanked the bloc for approving its 19th sanctions package against Russia earlier today, and work was already beginning on a 20th. European leaders are going to arrive in London later today for a \"critical\" meeting of the \"Coalition of the Willing\" - with the goal of discussing \"how they can pile pressure on Putin as he continues to kill innocent civilians with indiscriminate attacks across Ukraine\".  Prime Minister Sir Keir Starmer said: \"The only person involved in this conflict who does not want to stop the war is President Putin, and his depraved strikes on young children in a nursery this week make that crystal clear. \"Time and again we offer Putin the chance to end his needless invasion, to stop the killing and recall his troops, but he repeatedly rejects those proposals and any chance of peace. \"From the battlefield to the global markets, as Putin continues to commit atrocities in Ukraine we must ratchet up the pressure on Russia and build on President Trump's decisive action.\""
    },
    {
        "title": "Power of Russia sanctions lies in US financial system that greases the wheels",
        "description": "US sanctions against Russia's two largest energy companies, the state-owned Rosneft and privately held Lukoil, are perhaps the most significant economic measures imposed by the West since the invasion of Ukraine.",
        "url": "https://news.sky.com/story/power-of-russia-sanctions-lies-in-us-financial-system-that-greases-the-wheels-13455878",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-jerusalem_7049965.jpg?20251013143215",
        "type": "World",
        "Author": "Paul Kelso",
        "Date Published": "2025-10-23 16:50:00",
        "Headline": "These sanctions will directly impact the ability of the Russian companies, and anyone doing business with them, to operate within America's financial orbit. ",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  US sanctions against Russia's two largest energy companies, the state-owned Rosneft and privately held Lukoil, are perhaps the most significant economic measures imposed by the West since the invasion of Ukraine. If fully implemented, they have the potential to significantly choke off the flow of fossil fuel revenue that funds Russia's war machine, but their power lies not in directly denying Russia access to the tankers, ports and refineries that make the oil trade turn, but the US financial system that greases the wheels. Ever since the invasion, the Russian government has proved masterful at evading sanctions, aided and abetted by allies of economic convenience and an oil industry with decades of experience. Ukraine war latest: Zelenskyy expresses relief at Trump move  While the West, principally the EU, has largely turned off the taps and stopped buying Russian oil, China, India and Turkey became the largest consumers, with a shadow fleet of tankers ensuring exports continued to flow. Data from the Centre for Research into Energy and Clean Air (CREA) shows that while fossil fuel revenues have fallen from more than €1bn a day before the war, they have remained above €600m since the start of 2023, only dipping towards €500m in the last month. None of that oil has been heading for the US, but these sanctions will directly impact the ability of the Russian companies, and anyone doing business with them, to operate within America's financial orbit. According to the order from the US Office for Foreign Asset Control, the sanctions block all assets of the two companies, their subsidiaries and a number of named individuals, as well as preventing US citizens or financial institutions from doing business with them. It also threatens foreign financial institutions that \"facilitate transactions… involving Russia's military-industrial base\" with direct or secondary sanctions. In practice, the measures should prevent the two companies from accessing not just dollars, but trading markets, insurance and other services with any financial connection to the US. Taken in harness with similar steps announced by the UK earlier this month, analysts believe they can have a genuinely chilling effect on the market for Russian oil and gas. Russia's customers for oil in China, India and Turkey will also be affected, with the largest companies, state-owned and private, expected to be unwilling to take the risk of engaging directly with sanctioned entities. Indian companies are already reported to be \"recalibrating\" their imports following the announcement, which came just a week after Donald Trump announced an additional 25% import tariff on Indian goods as punishment for the country's reliance on Russian oil. Read more: Russia has responded with bravado to US sanctionsTrump imposes sanctions on Russia's two biggest oil firms That does not mean that Russian oil and gas exports will cease. There are other unsanctioned Russian energy companies that can still trade, and ever since the first barrel of oil was tapped, the industry has proved adept at evading sanctions intended to interrupt its flow from one country or another. Any significant increase in the oil price beyond the 5% seen in the aftermath of the announcement could also put pressure on the White House, which is at least as sensitive to fuel prices at home as it is to foreign wars. But analysts Kpler expect the sanctions to cause \"an immediate, short-term hiatus in Russian crude exports, as it will take time for sellers to reorganise and rebuild their trading systems to circumvent restrictions and ease buyers' concerns\". And Russian gas will, for now, continue to flow into Europe, where distaste for Vladimir Putin's imperial ambitions has not killed the appetite for his fuel. While the EU has this week imposed sanctions on liquified natural gas (LNG), they will not be fully enforced until 2027."
    },
    {
        "title": "How Ukraine refinery strikes and US sanctions are squeezing Russia at home ",
        "description": "Ukraine has been repeatedly targeting Russian oil refineries, intensifying the strain on both the country&#8217;s military operation and its wider economy. ",
        "url": "https://news.sky.com/story/how-ukraine-refinery-strikes-and-us-sanctions-are-squeezing-russia-at-home-13455958",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-dxf-teaser_7059736.png?20251023172730",
        "type": "World",
        "Author": "Sophia Massam, Freya Gibson, and Annoa Abekah-Mensah, Data and Forensics team",
        "Date Published": "2025-10-23 16:04:00",
        "Headline": "Ten refineries stand out for having been struck twice or more since the beginning of August 2025.",
        "Content": "By Sophia Massam, Freya Gibson, and Annoa Abekah-Mensah, Data and Forensics team   Ukraine has been repeatedly targeting Russian oil refineries, intensifying the strain on both the country’s military operation and its wider economy.  This comes as the US imposes heavy sanctions on Russia's two largest oil companies. Russia is facing growing disruption at the pumps as Ukrainian drone strikes also target fuel stations. Analysis by Sky News over the past three months shows that Ukraine is repeatedly striking several of the same refineries. Refineries hit again, and again  Ten refineries stand out for having been struck twice or more since the beginning of August 2025. The attacks are predominantly in the west of the country, within drone range from Ukraine. Clay Seigle, senior fellow at the Centre for Strategic and International Studies, told Sky News that Ukraine's restriking tactic is partially due to the limited damage that can be caused by single drone attacks. To put pressure on Russia, Seigle said: \"The Ukrainian strikes have to come at a faster pace with greater effect than the Russians are able to repair.\" Pressure on Russian oil is not just coming from Ukraine. The latest refinery to be struck, the Ryazan refinery, is owned by the Rosneft oil company, which was sanctioned by US President Donald Trump on Wednesday. Mr Trump imposed new sanctions on Russia's two largest oil companies - Rosneft and Lukoil. Between the two companies, 13 of their refineries have been targeted, and five of these have been targeted multiple times. Seigle said while the sanctions are the strongest card in terms of ones that the United States has played, \"it's all about the implementation\". \"The first thing that we have with these new sanctions is a 30-day period for companies doing business with Rosneft and Lukoil to wind down their operations,\" Seigle explained. Sanctioned refinery hit again last night  Ukraine struck the Ryazan refinery overnight in a suspected drone strike, the third time the refinery has been hit in three months. Sky News geolocated footage posted to social media that show part of the refinery on fire. The Armed Forces of Ukraine confirmed the attack and said the refinery had been targeted for its involvement in supplying the Russian army. The refinery was also hit on 2 August and 5 September. The strikes appeared to hit key areas of the refinery, according to videos and stills geolocated by Sky News. Video from August showed smoke billowing from Ryazan. Later reports stated that two crude distillation units - the first crude oil processing unit, and thus one of the refinery's most critical functions - had been hit. Stills from September appeared to show a large fire at the primary oil processing unit, where crude oil is desalted and then separated into kerosene, gasoline, diesel and oil for fuel. The most recent strike appeared to target an installation next to the areas previously struck. Speaking to Sky News, Russian economist at the CASE Centre, Vladislav Inozemtsev, said: \"Ryazan is quite badly affected, the repairs will take between two to six months if there are no further attacks.\" Panic as pumps hit by strikes and shortages  In its October oil market report, the International Energy Agency estimated that persistent attacks on Russian energy infrastructure have cut Russian crude processing by an estimated 500 thousand barrels per day. Other parts of oil infrastructure, including petrol stations, have also been targeted. The average price of 95-octane petrol (the standard petrol in Russia) at Russian pumps has risen by more than 30% since the start of the Ukraine war in 2022, according to the Russian state data provider Rosstat. In the last two months, the average price has risen by around 5% and now stands at more than 67 rubles per litre. Emily Ferris, Senior Research Fellow in Russian and Eurasian Security at RUSI, explained that Ukraine's strategy has intensified in recent months. \"Ukraine has been doing this for at least a year, but these latest strikes on Russia's critical national infrastructure are more serious,\" Ferris told Sky News. \"The Ukrainian drones are capable of attacking more frequently and deeper into Russian territory, as well as hitting some refineries numerous times.\" The strategy behind the strikes, Ferris says, is to damage the Russian economy. She said: \"Attacking refineries in Russia does temporarily have an impact on production, and Ukraine is hoping that this will be sufficiently debilitating to Russia's economy - which depends on hydrocarbon production - to slow the progress of the war.\" The reduction of crude processing has resulted in domestic fuel shortages. There are signs that this is having real effects on Russian people, who have taken to social media with videos of queues at petrol stations. This month, queues were filmed at petrol stations in Khabarovsk, in the far east of Russia. Seigle believes part of the Ukrainian strategy is \"bringing the consequences home to these remote regions [of Russia] that are far from the front, it kind of brings more people into the risk factor of perpetuating this war against Ukraine\". Analysis from the independent Russian monitoring group thinktank Re:Russia showed searches for explanations of oil shortages on the Russian search engine Yandex have increased in 2025. Russian economic data is hard to verify, but the Sky News Data and Forensics team has mapped reports of fuel shortages from Russian social media and news reports. Ferris explains that while fires at oil refineries and fuel shortages are impacting people's daily lives, \"local complaints do not often translate into coordinated mass protests capable of challenging the status quo or forcing Putin's hand\". The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done. "
    },
    {
        "title": "Ringleader behind arson attack and kidnap plot was 'groomed' by Russian chatbot, court told",
        "description": "The ringleader behind an arson attack and plot to kidnap a billionaire Russian dissident had been \"groomed\" by a chatbot, operated by Wagner mercenaries, a court was told.",
        "url": "https://news.sky.com/story/ringleader-behind-arson-attack-and-kidnap-plot-was-groomed-by-russian-chatbot-court-told-13455886",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-dylan-earl-wagner-arson_6727701.png?20241025181109",
        "type": "World",
        "Author": "Duncan Gardham, security journalist",
        "Date Published": "2025-10-23 17:09:00",
        "Headline": "Dylan Earl, 21, a builder and part-time drug dealer, has been cast by his defence as a cannabis-smoking gamer who was involved in \"desperate, pathetic and delusional\" message exchanges with a Russian chatbot controlled by the Wagner Group.",
        "Content": "By Duncan Gardham, security journalist  The ringleader behind an arson attack and plot to kidnap a billionaire Russian dissident had been \"groomed\" by a chatbot, operated by Wagner mercenaries, a court was told. The Old Bailey heard the fire at an industrial estate in Leyton, East London, on 20 March 2024, caused an estimated £1m of damage, including to vital Starlink satellite equipment destined for Ukraine. Dylan Earl, 21, a builder and part-time drug dealer who lived with his parents in Elmesthorpe, Leicestershire, has admitted his role in orchestrating the attack by recruiting others to carry it out. During his trial, the court heard he also tasked two people to burn down an exclusive restaurant and wine dealership in Mayfair and to kidnap Evgeny Chichvarkin, the billionaire owner. However, Paul Hynes KC, defending, told a sentencing hearing on Thursday that the Russians were \"trash fishing\" using a Russian language chatbot called PrivetBot on the encrypted Telegram platform and Earl was \"easy meat\". \"Our prime submission is that he is, or was at the time, a sad individual who sat for lengthy periods alone in his bedroom at his parents' house. \"His minimalist existence was taking drugs, particularly cannabis and involving himself in online gaming. \"We do not seek to characterise Dylan Earl as a victim in this case but there are vulnerable elements in him that were used by PrivetBot, acting on behalf of the Wagner Group, as a proxy for the Russian Federation.\" In April 2024, PrivetBot messaged Earl. His replies had been deleted, but the Wagner contact said: \"I see that you know what you want. It's a great happiness that you have realised so early that you are a WARRIOR. We need your connections and your capabilities.\" Mr Hynes told the judge, Mrs Justice Cheema-Grubb, Earl was \"very much a sad individual\" who \"had a certain detachment from reality\" and \"sought praise, importance and significance\". \"The potent effect of the messaging is shown in his desperate, pathetic and delusional responses,\" he added. Read more from Sky News:Arsonist told to watch spy dramaExplainer: US sanctions on RussiaFake celebrity chatbots targeting children Earl messaged the contact, offering to recruit thousands more to join their operation and boasting of his underworld contacts. \"If you need connections with IRA, I can sort it. You want criminal connections with murderers, kidnappers, soldiers, drug dealers, fraudsters, car thieves, I can sort it all,\" Earl wrote. But the court heard Earl never left his bedroom and never met the people he recruited. Earl and five other men are being sentenced for their part in the Russian-ordered arson attack on behalf of the Wagner Group, a Russian mercenary company, which is proscribed as a terrorist organisation in the UK. The Kremlin denies accusations that it is involved in any such acts of sabotage. The men will be sentenced on Friday."
    },
    {
        "title": "'Urban warfare' on streets of Dublin during migrant hotel disorder, says community leader",
        "description": "A community leader has described migrant children barricading themselves in hotels due to \"urban warfare\" on the streets of&#160;Dublin during the riots.",
        "url": "https://news.sky.com/story/urban-warfare-on-streets-of-dublin-during-migrant-hotel-disorder-says-community-leader-13455761",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-dubin-citywest-hotel_7059685.jpg?20251023165305",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-23 16:12:00",
        "Headline": "The third night of demonstrations at Citywest Hotel took place on Wednesday, after an alleged sexual assault on a 10-year-old girl near an asylum hotel in the early hours of Monday morning.",
        "Content": " A community leader has described migrant children barricading themselves in hotels due to \"urban warfare\" on the streets of Dublin during the riots. A teacher at a school in Tallaght, which neighbours Citywest Hotel, told a Sky News correspondent that there are children living in fear of going outside after another night of disorder. The third night of demonstrations at the hotel took place on Wednesday, after an alleged sexual assault on a 10-year-old girl in the vicinity of the hotel in the early hours of Monday morning. Between 7pm and 8pm on Wednesday, protesters again faced off with about 40 uniformed gardai, who were then replaced with the Public Order Unit. Public order gardai pushed the crowd further from the hotel by advancing with shields, with several gardai deploying pepper spray during the disorder. Sky News correspondent Connor Gillies said he witnessed children as young as seven throwing bricks at riot officers, who were standing in rows 5ft deep. Teenagers dragged a baby pram filled with fireworks and lit their missiles as they threw them at officers who were charging forward in a bid to get the hundreds of locals under control. Kevin Shortall, principal of St Aidan's Community School in Tallaght, told Sky News that there are feelings of \"fear\" and \"shock\" from people living in Citywest, which he described as a community made up predominantly of families. He said: \"My central thoughts here are very much around the students who live in City West who are scared to come to school, who are frightened about the riots and the urban warfare that's coming on inside their doors.\" Mr Shortall said most of the pupils from schools around Citywest went home early on Wednesday, and some did not come in at all. He added that the previous day, they went home early and \"got the word and the warning that there was going to be trouble, so they locked themselves in their hotel rooms and they experienced extreme trauma\" while the events outside unfolded. Mr Shortall noted there are mixed feelings in the community surrounding events over the last few days. Asked whether the incident, which allegedly involved a 10-year-old girl, has been hijacked by people intent on causing chaos, Mr Shortall said: \"Such a case as these would naturally make people really scared and really worried and I can understand people's fear and worries. \"What I don't understand is why you would decide to destroy a building in order to say something about that. \"I think what's really important in all these situations is to figure out the causes and to deal with them - and it's not just a criminal justice problem, it's a very broad problem.\" Read more: Dublin protests: Prams filled with fireworksPolice helicopter targeted with lasers in Dublin Gardai said on Thursday that 31 people had been arrested in relation to the disorder, 23 of which - 21 males and two females - have appeared before the District Court. It said five male juveniles who were arrested have been released and will be dealt with under the Youth Diversion Programme. Four garda members were injured and were treated in hospital, but have been discharged. A man in his 30s, who was arrested by investigating Gardai on Wednesday afternoon for an alleged offence of violent disorder has since been charged. He appeared in court on Thursday."
    },
    {
        "title": "King and Pope pray together in historic first since Reformation 500 years ago",
        "description": "The King and Pope Leo prayed together in a historic moment marking the first time an English monarch and a pontiff met for such an occasion since the Church of England split from Rome.",
        "url": "https://news.sky.com/story/king-and-pope-pray-together-in-historic-first-since-reformation-500-years-ago-13455808",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-pope-leo-pope-king-charles_7059275.jpg?20251023110942",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-23 12:18:00",
        "Headline": "The service at the Sistine Chapel was ecumenical, meaning it was a joint Anglican and Catholic service. Therefore, the prayer was led not just by Pope Leo but also by Stephen Cottrell, the Archbishop of York, the second most senior bishop in the Church of England.",
        "Content": " The King and Pope Leo prayed together in a historic moment marking the first time an English monarch and a pontiff met for such an occasion since the Church of England split from Rome. Charles was seen praying with the Pope in the iconic Michelangelo-affrescoed Sistine Chapel, sitting next to his wife, the Queen, who accompanied him on the quick state visit to the Vatican. It was the first time an English monarch and the pontiff joined together for prayer in the 500 years since the Reformation when, in 1534, King Henry VIII declared himself head of the Church of England and broke from the papal authority of the Roman Catholic Church. The service at the Sistine Chapel - where the Pope was elected - was ecumenical, meaning it was a joint Anglican and Catholic service. Therefore, the prayer was led not just by Pope Leo but also by Stephen Cottrell, the Archbishop of York, the second most senior bishop in the Church of England. Before the prayer, the King and Queen had a private audience with the American pope, who was elected in May following the death of Pope Francis, who died aged 88 in April. Upon their arrival at the Vatican, the royal couple were pictured standing on a red carpet as the national anthem was played out for them while they stood in front of the world's smallest army - the Swiss Guards. The Queen wore a black outfit with a matching mantilla, a lace veil that women have traditionally worn during Catholic services. Few do so now, but wearing the mantilla - or a scarf over the head - remains protocol for female dignitaries when meeting the Pope. Read more from Sky News:Will Prince Andrew scandal overshadow King's Vatican trip?How is a King's senior aide involved in the controversy? Following the prayer, the King and the Pope held a private meeting on environmental protection, while the Queen was shown around the Pauline Chapel in Vatican City. The King's historic trip to the Vatican comes during a week that began with huge controversy swirling around the Royal Family. Days after Prince Andrew announced he would be giving up his royal titles, Virginia Giuffre's posthumous memoir was published detailing alleged sexual encounters with Prince Andrew, the King's brother. Prince Andrew vehemently denies the allegations."
    },
    {
        "title": "Russia has responded with bravado to US sanctions - underneath it though, there will be concern",
        "description": "Moscow has been quick to shrug off the coordinated sanctions against its two biggest oil companies, Rosneft and Lukoil.",
        "url": "https://news.sky.com/story/how-russia-has-reacted-to-us-sanction-against-its-two-biggest-oil-companies-13455738",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-lukoil-petrol-russia_7059678.jpg?20251023164430",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-10-23 10:30:00",
        "Headline": "There is also a degree of surprise at the US sanctions, which mark the first time this Trump administration has taken punitive action against Russia.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  Moscow has been quick to shrug off the coordinated sanctions against its two biggest oil companies, Rosneft and Lukoil. \"Counterproductive\" is how the Russian Foreign Ministry described the measures. It warned the Trump administration that it would fail and accused the EU of being unable to accept that its sanctions don't work. Ukraine war latest: Putin ally's warning over sanctions It's a similar response in the papers. \"Couldn't you have come up with something better?\" asks the Russian tabloid, Komsomolskaya Pravda. The broadsheet Izvestia newspaper quotes two American \"political scientists\" who predict the sanctions will backfire and hurt Europe instead.  Such bravado was predictable. Russia never likes to show weakness. Underneath it, though, I think there will be concern. That's because these aren't just any sanctions. They are coordinated measures which target the economic equivalent of Russia's crown jewels. I think there is also a degree of surprise at the US sanctions, which mark the first time this Trump administration has taken punitive action against Russia. After months of threats that failed to amount to anything, there seemed to be a belief here that the American president would never actually do it. That he was all mouth and no trousers. So there'll be surprise at that, and also at how quickly this U-turn has come about. Less than a week ago, Donald Trump appeared to be buddying up with Vladimir Putin, with talk of a get-together in Budapest. Now all of a sudden, there's no summit, only sanctions. Will the sanctions work? Will they hurt the \"Kremlin's war machine\", as the US Treasury put it. Short answer - probably not immediately. Moscow has been able to maintain military spending via tax hikes and spending cuts elsewhere, and economists believe there's still some fat Russia can trim, for example, infrastructure investment, before scaling back defence. Read more from Sky News:Trump's oil sanctions have put 'US on warpath with Russia'British Storm Shadow missiles used in 'massive' Ukrainian strike Longer term, though, in six months, say, the consensus among experts is that it will be felt, assuming it forces countries like China and India to reduce their imports of Russian oil. But even if that's the case, will it force Mr Putin to change course? There's certainly no sign of that yet. In spite of the sanctions, Russia's Foreign Ministry said that Moscow's goals \"remain unchanged\". While former-president-turned-Kremlin-hawk Dmitiry Medvedev went further, suggesting the move merely allows Moscow to step up its military campaign against Ukraine \"without regard to unnecessary negotiations\"."
    },
    {
        "title": "European space firms combine to compete with SpaceX",
        "description": "Europe's top space firms have forged a deal to combine their satellite manufacturing and servicing businesses, creating a new European space group that will compete with global giants like Elon Musk's Starlink.",
        "url": "https://news.sky.com/story/european-space-firms-combine-to-compete-with-spacex-13455931",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-spacex-rocket_7059816.jpg?20251023185141",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-23 15:42:00",
        "Headline": "European satellite makers have long competed to build spacecraft in geostationary orbit, but have been hit by the arrival of satellites in low Earth orbit.",
        "Content": "Europe's top space firms have forged a deal to combine their satellite manufacturing and servicing businesses, creating a new European space group that will compete with global giants like Elon Musk's Starlink. It marks the most ambitious tie-up of European space assets since the creation of missile maker MBDA in 2001. French firms Airbus and Thales, and Italian firm Leonardo, will create a Toulouse-based venture and begin operations in 2027. French Finance Minister Roland Lescure said the preliminary deal would \"strengthen European sovereignty in a context of intense global competition\". \"We expect, and will be vigilant, that the synergies created from efficiencies benefit us as a key customer of the new company,\" said French satellite operator Eutelsat, the owner of OneWeb, a Starlink rival. Why does it matter?  Europe's top satellite makers have long competed to build complex spacecraft in geostationary orbit. Geostationary satellites are farther away from Earth, and travel at the same speed and in the same direction as the Earth's orbit. But those manufacturers have been hit by the arrival of cheap, tiny satellites in low Earth orbit, notably the Starlink network built by Musk's SpaceX. This month, SpaceX launched its 10,000th Starlink internet satellite into orbit, the company said in a post on X. Of those satellites in orbit, only about 8,608 are currently operational, according to Jonathan McDowell's satellite tracking database. SpaceX has extensive financial ties with NASA, the American space agency, and has only been increasing its dominance in recent months, as space plays a growing role in defence, security and communications. Starlink provides crucial internet connectivity to Ukraine and its military, and has done since 2022, when Mr Musk pledged his support for the war. But a clash between US President Donald Trump and Ukraine's Volodymyr Zelenskyy in February led to the US temporarily withdrawing military aid and intelligence sharing from the country. During the meeting, Ukraine was told it faced imminent shutoff of the service if it did not reach a deal on critical minerals, according to a Reuters report at the time. Musk said the story was not true in a post on X. But the news had already sent shivers across European governments, which feared that Mr Musk would bend to Washington's pressure, and have since ramped up talks with European governments to combine satellite constellations and strengthen satellite connectivity in Ukraine. The SpaceX leader had previously ordered a blackout of Starlink coverage during Ukraine's counteroffensive in Kherson in 2022, the first known instance of the billionaire actively shutting off coverage over a battlefield during the conflict. Project Bromo The new combination, code-named \"Project Bromo\", will employ 25,000 people with revenue of €6.5bn ($7.58bn), based on 2024 figures. The companies gave few details regarding governance, but executives pledged to avoid a system of rotating leadership or making appointments based on nationalities, approaches which have roiled the European aerospace industry, especially Airbus, in the past."
    },
    {
        "title": "Everything to know about US sanctions on Russia - why now, and how could it impact the UK?",
        "description": "Donald Trump has imposed sanctions on Russia's two biggest oil companies in a major policy shift.",
        "url": "https://news.sky.com/story/everything-to-know-about-us-sanctions-on-russia-why-now-and-how-could-it-impact-the-uk-13455704",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rosneft-oil-russia_7059341.jpg?20251023115501",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-23 09:28:00",
        "Headline": "The sanctions mark a significant change for the Trump administration, which has veered between pressuring Moscow and taking a more conciliatory approach aimed at securing peace in Ukraine.",
        "Content": " Donald Trump has imposed sanctions on Russia's two biggest oil companies in a major policy shift. The restrictions have been unveiled due to what US treasury secretary Scott Bessent called \"Russia's lack of serious commitment to a peace process to end the war in Ukraine\". The move marks a significant change for the Trump administration, which has veered between pressuring Moscow and taking a more conciliatory approach aimed at securing peace in Ukraine. Here's everything you need to know about the sanctions. Which companies have been targeted? The new restrictions have been slapped on Rosneft and Lukoil - Russia's two biggest oil companies - as well as dozens of subsidiaries. The two companies export 3.1 million barrels of oil a day, with Rosneft alone responsible for almost half of Russia's oil production. The US Treasury's Office of Foreign Assets Control described Rosneft as being \"a vertically integrated energy company specialising in the exploration, extraction, production, refining, transport and sale of petroleum, natural gas and petroleum products\". It added: \"Lukoil engages in the exploration, production, refining, marketing and distribution of oil and gas in Russia and internationally.\" After the US announced the sanctions, Europe added its own restrictions on imports and tightened loopholes in shipping to pile pressure on the Kremlin. What impact are the sanctions having - and could this affect the UK? The price of oil jumped as the US sanctions hit Russian production and the Danish EU presidency announced a separate programme of penalties on Russia by the bloc. After hitting a five-month low on Monday, business and economics reporter Sarah Taaffe-Maguire reported the benchmark oil price rose 5%. The US benchmark crude oil gained $2.70 to $61.21 per barrel shortly after the sanctions were announced. Brent crude, the international standard, rose $2.85 to $65.44 per barrel. Ukraine war latest: Trump's sanctions are 'act of war' against Russia, Putin ally warns Associated expectations of lower oil flows can bring up the price. Oil is consistently Russia's number one export, and the cash it generates for the country's economy has allowed it to continue its grinding conflict in Ukraine even as it finds itself largely internationally isolated.  The knock-on effect could mean oil prices rise in the UK, as the fossil fuel is still involved in the production of most goods. Sustained higher prices for a barrel of oil can typically be seen at the forecourt pumps in about 10 days. The UK and EU had also put sanctions of their own on Rosneft and Lukoil, and Mr Trump's move brings the US in line with them for the first time since he came back into office, according to Moscow correspondent Ivor Bennett. Why has Trump done this now? Trump had resisted pressure from Ukrainian President Volodymyr Zelenskyy to impose stronger sanctions on Russia, hoping Mr Putin would agree to end the fighting. Speaking in the Oval Office after the announcement, Mr Trump told reporters: \"I just felt it was time.\" He also said that while he had a \"very good relationship\" with his Russian counterpart, he had cancelled a planned meeting with him as \"it didn't feel right to me\".  In a sign of growing frustration, he told reporters: \"It didn't feel like we were going to get to the place we have to get. So I cancelled it. But we'll do it in the future. \"I have good conversations. And then, they don't go anywhere. They just don't go anywhere.\" He also hinted that the sanctions could be lifted if the Russian president was prepared to cooperate in peace talks. \"We hope that they [the sanctions] won't be on for long,\" he said in the Oval Office. \"We hope that the war will be settled. \"Hopefully he'll [Mr Putin] become reasonable,\" he added. \"And hopefully Zelenskyy will be reasonable, too. You know, it takes two to tango, as they say.\" Ukraine's president has praised the decision, saying the sanctions are \"a clear signal that prolonging the war and spreading terror come at a cost\". Could the sanctions bring Putin to the negotiating table? US correspondent David Blevins described the move as a \"punch to the gut\" of Moscow's war economy. He said that oil is the bloodstream of Russia, adding that the Trump Treasury had cut off the blood flow. Read analysis:Trump's sanctions far more than slap on the wrist He said Mr Trump's sanctions are \"more than punishment - they're a strategic gamble to corner Putin - but the margin of error is razor thin\". \"If energy prices surge or allied unity splinters, Mr Trump could find himself on the ropes,\" he suggested. \"The White House is gambling that the geopolitical payoff will ultimately outweigh the domestic sting.\" Bennett agreed that the sanctions were a risk, saying there were \"concerns it would just hike global energy prices with customers back home [in the US] paying the price as well\". \"It has had that effect already, it has boosted oil prices globally,\" he added. \"I think there's now a belief that this is kind of worth the short term pain, worth paying the price for, and there's a hope that it will have the desired effect and push Russia towards peace and towards a ceasefire.\""
    },
    {
        "title": "Putin criticises Trump's sanctions on oil firms - as Russian jets 'briefly enter NATO airspace'",
        "description": "Vladimir Putin has described Donald Trump's sanctions against two major oil firms as an \"unfriendly act\".",
        "url": "https://news.sky.com/story/defiant-putin-insists-trumps-sanctions-on-oil-companies-wont-affect-russias-economy-13456221",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-putin-russia_7060030.jpg?20251024003159",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-23 21:57:00",
        "Headline": "European leaders are going to arrive in London later today for a \"critical\" meeting of the \"Coalition of the Willing\" - with the goal of discussing \"how they can pile pressure on Putin as he continues to kill innocent civilians with indiscriminate attacks across Ukraine\".",
        "Content": " Vladimir Putin has described Donald Trump's sanctions against two major oil firms as an \"unfriendly act\". However, the Russian president has insisted the tightened restrictions won't affect the nation's economy, a claim widely contradicted by most analysts. In a major policy shift, Mr Trump imposed sanctions against Rosneft and Lukoil - Russia's biggest oil companies - on Wednesday.  The White House said this was because of \"Russia's lack of serious commitment to a peace process to end the war in Ukraine\". Putin has now warned the move could disrupt the global oil markets, and lead to higher prices for consumers worldwide. A meeting between the two leaders had been proposed in Budapest, but Mr Trump said he had decided to cancel the talks because \"it didn't feel right to me\". Speaking from the Oval Office, he had told reporters: \"I have good conversations. And then, they don't go anywhere. They just don't go anywhere.\" \n                  Power of Russia sanctions lies in US financial system that greases the wheels\n                 \n                  Trump's oil sanctions have put 'US on warpath with Russia', says Putin ally\n                 \n                  Trump's sanctions are no slap on the wrist - they're a punch to the gut of Moscow's war economy \n                 Giving a speech in Moscow yesterday, Putin said \"dialogue is always better than war\" - but warned that Russia will never bow to pressure from abroad. Earlier, his long-term ally Dmitry Medvedev had described Mr Trump as a \"talkative peacemaker\" who had now \"fully embarked on the warpath against Russia\".  Oil prices have witnessed a sizeable jump since the sanctions were announced, with Brent crude rising by 5% - the biggest daily percentage gains since the middle of June. In other developments, Lithuania has claimed that two Russian military aircraft briefly entered its airspace yesterday. A Su-30 fighter and Il-78 refuelling tanker were in the NATO member's territory for 18 seconds, and Spanish jets were scrambled in response to the incident. Russia's defence ministry denied this - and said its planes did not violate the borders of any other country during a \"training flight\" in the Kaliningrad region. Read more:Sanctions could have chilling effect on marketHow could new sanctions impact the UK?  Volodymyr Zelenskyy attended a European Council summit in Brussels to discuss the war in Ukraine - and said the meeting had delivered \"good results\". He said Ukraine had secured political support for frozen Russian assets and \"their maximum use\" to defend against Russian aggression, adding the EU would \"work out all the necessary details\". Mr Zelenskyy thanked the bloc for approving its 19th sanctions package against Russia earlier today, and work was already beginning on a 20th. European leaders are going to arrive in London later today for a \"critical\" meeting of the \"Coalition of the Willing\" - with the goal of discussing \"how they can pile pressure on Putin as he continues to kill innocent civilians with indiscriminate attacks across Ukraine\".  Prime Minister Sir Keir Starmer said: \"The only person involved in this conflict who does not want to stop the war is President Putin, and his depraved strikes on young children in a nursery this week make that crystal clear. \"Time and again we offer Putin the chance to end his needless invasion, to stop the killing and recall his troops, but he repeatedly rejects those proposals and any chance of peace. \"From the battlefield to the global markets, as Putin continues to commit atrocities in Ukraine we must ratchet up the pressure on Russia and build on President Trump's decisive action.\""
    },
    {
        "title": "Entire East Wing of White House will be demolished for ballroom - as Trump urged to pause project",
        "description": "The entire East Wing of the White House will be demolished \"within days\" - much more bulldozing than initially expected for Donald Trump's new ballroom construction project.",
        "url": "https://news.sky.com/story/entire-east-wing-of-white-house-will-be-demolished-for-ballroom-as-trump-urged-to-pause-project-13455570",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rubble-east-wing-white_7059010.jpg?20251023031403",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-23 01:52:00",
        "Headline": "The American National Trust for Historic Preservation has called for all works to be halted until plans go through \"the legally required public review processes\". ",
        "Content": " The entire East Wing of the White House will be demolished \"within days\" - much more bulldozing than initially expected for Donald Trump's new ballroom construction project. Two Trump administration officials told Sky News' US partner NBC that the demolition is a significant expansion of the initial plans announced this summer. \"It won't interfere with the current building,\" Mr Trump had said on 31 July. \"It'll be near it, but not touching it, and pays total respect to the existing building, which I'm the biggest fan of.\" But a White House official told NBC News the \"entirety\" of the East Wing would eventually be \"modernised and rebuilt\". \"The scope and the size of the ballroom project have always been subject to vary as the process develops,\" the official added. The East Wing was built at the beginning of the last century and was last modified in 1942. Explainer: How Trump has changed the White House while in power \n                  Putin criticises Trump's sanctions on oil firms - as Russian jets 'briefly enter NATO airspace'\n                 \n                  Trump's sanctions are no slap on the wrist - they're a punch to the gut of Moscow's war economy \n                 \n                  Changpeng Zhao: Donald Trump pardons billionaire crypto exchange founder\n                 Construction on the ballroom - which is expected to hold up to 900 people when finished - began this week. The National Trust for Historic Preservation, a non-profit agency created by Congress to help preserve historic buildings, warned administration officials in a letter on Tuesday that the planned ballroom \"will overwhelm the White House itself\". \"We respectfully urge the administration and the National Park Service (stewards of the White House) to pause demolition until plans for the proposed ballroom go through the legally required public review processes,\" Carol Quillen, the trust's chief executive, said in a statement. 'Fake news' The White House called the uproar \"manufactured outrage\" by \"unhinged leftists and their fake news allies\" in a statement. Last week, Mr Trump said the total price would be about $250m (£187m), which would be paid for by himself and private donors will pay for. However, on Wednesday, he said the ballroom's price is \"about $300m (£225m)\". The 90,000 sq ft ballroom will dwarf the White House itself - and would be able to accommodate almost five times more guests than the East Room, the largest current space in the mansion. Mr Trump says the ballroom won't cost US taxpayers at all. Instead, \"donors\" would pay for it. Comcast, the parent company of Sky News, was included on a list of top donors released last week - but it is unclear how much it or others have contributed."
    },
    {
        "title": "Apple users could get 'significant' compensation say lawyers, after tech firm loses competition ruling over 'unfair' £1.5bn app store fees",
        "description": "Apple has lost a landmark lawsuit over fees in the App Store, which could benefit around 36 million iPhone and iPad users in the UK.",
        "url": "https://news.sky.com/story/apple-users-could-get-significant-compensation-say-lawyers-after-tech-firm-loses-competition-ruling-over-unfair-16315bn-app-store-fees-13456089",
        "image_url": "https://e3.365dm.com/22/12/1920x1080/skynews-iphone-apple-app-store_5996092.jpg?20221214101321",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-23 21:44:00",
        "Headline": "Tinder, Minecraft, Clash of Clans and Strava are among popular apps with subscriptions or in-app purchases, which secure hefty commissions for Apple. iPhone and iPad users in the UK now face the prospect of compensation after a landmark lawsuit.",
        "Content": "Apple has lost a landmark lawsuit over fees in the App Store, which could benefit around 36 million iPhone and iPad users in the UK. The Competition Appeal Tribunal (CAT) has ruled that the US tech company abused its dominant position by \"charging excessive and unfair prices in the form of the commission which it charges developers\". Lawyers for Dr Rachael Kent, the academic who brought the case, claim Apple had made \"exorbitant profits\" by excluding all competition for the distribution of apps and in-app purchases. It is argued Apple should pay around £1.5bn in damages for purchases made over the last 10 years. Apple - which has faced mounting pressure from regulators in the US and Europe over the fees it charges developers - says it will appeal. Developers are typically charged 30% commission and are blocked from routing payments through any platform other than Apple's App Store. The tribunal said calculations about compensation will be argued at a hearing next month. \n                  Jessica Chastain criticises decision to delay release of The Savant after Charlie Kirk killing\n                 \n                  UK drops Apple encryption demands, says US spy chief\n                 \n                  Trump announces yet more tariffs and praises 'significant step' from Apple\n                 According to legal firm Hausfeld & Co LLP, the ruling will mean potential compensation for many Apple users in the UK. It says people must have: • made a purchase on an iPhone or iPad since 1 October 2015 • used the UK storefront of the App Store • spent money for paid-for apps, subscriptions or in-app purchases of digital content Apple users can check their eligibility for compensation by logging into their App Store account and checking their \"Purchase History\". Hausfeld says the \"sums will be significant\" for users who have app subscriptions or make regular in-app purchases. Example 1: Strava subscription at £8.99 a month/£107.88 a year - users would be entitled to £21.58 for each year.\n Regular gamers are also likely to receive large sums in compensation. Example 2: Clash of Clans, a sack of gems is £19.99 - users would get £4.00 back Example 3: Minecraft, 960 Minecoins are £5.99 – compensation would be £1.20 Any compensation is also likely to be delayed while Apple attempts to appeal the ruling, which could still be overturned by a higher court. \"This ruling overlooks how the App Store helps developers succeed and gives consumers a safe, trusted place todiscover apps and securely make payments,\" an Apple spokesperson said. In a statement, Dr Kent, an academic and senior lecturer at King's College, London, said: \"Those unfair fees have added up to billions for the world's richest company, and less choice and innovation for everyone else.\" She added that the ruling shows the UK's collective action regime is working and \"sends a clear message: no company, however wealthy or powerful, is above the law\". Read more from Sky News:Apple and Meta fined by EUApple sued by Which? over iCloudPhone users could get compensation Lesley Hannah, partner at Hausfeld & Co LLP, who represents Dr Kent, said: \"The whole purpose of competition law is to ensure fairness and to prevent companies exploiting their market power.\" \"Apple illegally kept rivals out of the market in order to prevent their customers being able to use rival app stores and save money,\" she added. Ms Hannah told Sky News that Apple will need to convince the court that there is \"an error of law\" in the judgment and any appeal could take a year to 18 months, potentially delaying any compensation. Fellow tech giants, including Amazon and Microsoft, are also facing sizeable claims at the CAT, while Google is being challenged over the commission it charges app developers for access to its Play Store. Meanwhile, on Wednesday, the Competition and Markets Authority (CMA) targeted Google and Apple for their \"strategic\" roles in mobile ecosystems, opening the door for regulators to impose changes to their business practices to improve competition. The CMA escalated scrutiny of the two US tech companies by labelling them with \"strategic market status\". Google called that decision \"disappointing, disproportionate and unwarranted\" while Apple said the move could pose increased risks for users and jeopardise the UK's \"developer economy\"."
    },
    {
        "title": "Mafia family members and NBA stars arrested by FBI over illegal gambling and sports rigging",
        "description": "The FBI has led a \"co-ordinated takedown\" on illegal gambling and sports rigging, the agency's director has said, with more than 30 arrested on Thursday. ",
        "url": "https://news.sky.com/story/fbi-leads-gambling-takedown-with-nba-coach-and-player-among-those-arrested-13455927",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kash-patel-fbi-nba_7059868.jpg?20251023195402",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-23 15:44:00",
        "Headline": "Miami Heat guard Terry Rozier, Portland Trail Blazers coach Chauncey Billups and former NBA player Damon Jones were among those arrested.",
        "Content": "The FBI has led a \"co-ordinated takedown\" on illegal gambling and sports rigging, the agency's director has said, with more than 30 arrested on Thursday.  Miami Heat guard Terry Rozier, Portland Trail Blazers coach Chauncey Billups and former NBA player Damon Jones were among those arrested. At a news conference on Thursday, FBI chief Kash Patel said the illegal gambling and sports rigging operation spanned the course of years and the takedown covered 11 states, adding that the case remains ongoing. The Bonanno, Gambino, Genovese and Lucchese mafia families were also hit by the operation, he said. Rozier is accused of participating in an illegal sports betting scheme using private insider NBA information, officials said. Billups is charged in a separate indictment alleging a wide-ranging scheme to rig underground poker games backed by Mafia families. Both men face wire fraud conspiracy and money laundering charges and were expected to make initial court appearances later on Thursday. \n                  Third arrest over sex toy throwing at women's basketball games\n                 \n                  Los Angeles Lakers star LeBron James says he's taking time off social media\n                 \n                  Bronny James: LeBron James's son declares for NBA Draft months after cardiac arrest\n                 In the first case, six defendants are accused of taking part in an insider sports betting conspiracy that exploited confidential information about NBA athletes and teams, Joseph Nocella, the US attorney for the Eastern District of New York said. He said it was \"one of the most brazen sports corruption schemes since online sports betting became widely legalised in the United States\". The second case involves 31 defendants in a nationwide scheme to rig illegal poker games, Mr Nocella said. The defendants include former professional athletes accused of using technology to rake in millions of dollars by rigging mafia-backed underground poker games in the New York area, he said. \"My message to the defendants who've been rounded up today is this: Your winning streak has ended. Your luck has run out,\" Mr Nocella said. In the sports betting scheme, players sometimes altered their performance or removed themselves from games early, New York Police Commissioner Jessica Tisch said. Read more from Sky News: King and Pope pray together in historic first since ReformationDoctors in England to go on five-day strike over pay and jobs In one instance, Rozier, while playing for the Hornets, told people he was planning to leave the game early with a \"supposed injury\", allowing them to place wagers that brought in thousands of dollars, Ms Tisch said. The indictment of Rozier and others says there are nine unnamed co-conspirators, including a Florida resident who was an NBA player, an Oregon resident who was an NBA player from about 1997 to 2014 and an NBA coach since at least 2021, as well as a relative of Rozier. Rozier and other defendants \"had access to private information known by NBA players or NBA coaches\" that was likely to affect the outcome of games or players' performances and provided that information to other co-conspirators in exchange for either a flat fee or a share of betting profits, the indictment says."
    },
    {
        "title": "Everything to know about US sanctions on Russia - why now, and how could it impact the UK?",
        "description": "Donald Trump has imposed sanctions on Russia's two biggest oil companies in a major policy shift.",
        "url": "https://news.sky.com/story/everything-to-know-about-us-sanctions-on-russia-why-now-and-how-could-it-impact-the-uk-13455704",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rosneft-oil-russia_7059341.jpg?20251023115501",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-23 09:28:00",
        "Headline": "The sanctions mark a significant change for the Trump administration, which has veered between pressuring Moscow and taking a more conciliatory approach aimed at securing peace in Ukraine.",
        "Content": " Donald Trump has imposed sanctions on Russia's two biggest oil companies in a major policy shift. The restrictions have been unveiled due to what US treasury secretary Scott Bessent called \"Russia's lack of serious commitment to a peace process to end the war in Ukraine\". The move marks a significant change for the Trump administration, which has veered between pressuring Moscow and taking a more conciliatory approach aimed at securing peace in Ukraine. Here's everything you need to know about the sanctions. Which companies have been targeted? The new restrictions have been slapped on Rosneft and Lukoil - Russia's two biggest oil companies - as well as dozens of subsidiaries. The two companies export 3.1 million barrels of oil a day, with Rosneft alone responsible for almost half of Russia's oil production. The US Treasury's Office of Foreign Assets Control described Rosneft as being \"a vertically integrated energy company specialising in the exploration, extraction, production, refining, transport and sale of petroleum, natural gas and petroleum products\". It added: \"Lukoil engages in the exploration, production, refining, marketing and distribution of oil and gas in Russia and internationally.\" After the US announced the sanctions, Europe added its own restrictions on imports and tightened loopholes in shipping to pile pressure on the Kremlin. What impact are the sanctions having - and could this affect the UK? The price of oil jumped as the US sanctions hit Russian production and the Danish EU presidency announced a separate programme of penalties on Russia by the bloc. After hitting a five-month low on Monday, business and economics reporter Sarah Taaffe-Maguire reported the benchmark oil price rose 5%. The US benchmark crude oil gained $2.70 to $61.21 per barrel shortly after the sanctions were announced. Brent crude, the international standard, rose $2.85 to $65.44 per barrel. Ukraine war latest: Trump's sanctions are 'act of war' against Russia, Putin ally warns Associated expectations of lower oil flows can bring up the price. Oil is consistently Russia's number one export, and the cash it generates for the country's economy has allowed it to continue its grinding conflict in Ukraine even as it finds itself largely internationally isolated.  The knock-on effect could mean oil prices rise in the UK, as the fossil fuel is still involved in the production of most goods. Sustained higher prices for a barrel of oil can typically be seen at the forecourt pumps in about 10 days. The UK and EU had also put sanctions of their own on Rosneft and Lukoil, and Mr Trump's move brings the US in line with them for the first time since he came back into office, according to Moscow correspondent Ivor Bennett. Why has Trump done this now? Trump had resisted pressure from Ukrainian President Volodymyr Zelenskyy to impose stronger sanctions on Russia, hoping Mr Putin would agree to end the fighting. Speaking in the Oval Office after the announcement, Mr Trump told reporters: \"I just felt it was time.\" He also said that while he had a \"very good relationship\" with his Russian counterpart, he had cancelled a planned meeting with him as \"it didn't feel right to me\".  In a sign of growing frustration, he told reporters: \"It didn't feel like we were going to get to the place we have to get. So I cancelled it. But we'll do it in the future. \"I have good conversations. And then, they don't go anywhere. They just don't go anywhere.\" He also hinted that the sanctions could be lifted if the Russian president was prepared to cooperate in peace talks. \"We hope that they [the sanctions] won't be on for long,\" he said in the Oval Office. \"We hope that the war will be settled. \"Hopefully he'll [Mr Putin] become reasonable,\" he added. \"And hopefully Zelenskyy will be reasonable, too. You know, it takes two to tango, as they say.\" Ukraine's president has praised the decision, saying the sanctions are \"a clear signal that prolonging the war and spreading terror come at a cost\". Could the sanctions bring Putin to the negotiating table? US correspondent David Blevins described the move as a \"punch to the gut\" of Moscow's war economy. He said that oil is the bloodstream of Russia, adding that the Trump Treasury had cut off the blood flow. Read analysis:Trump's sanctions far more than slap on the wrist He said Mr Trump's sanctions are \"more than punishment - they're a strategic gamble to corner Putin - but the margin of error is razor thin\". \"If energy prices surge or allied unity splinters, Mr Trump could find himself on the ropes,\" he suggested. \"The White House is gambling that the geopolitical payoff will ultimately outweigh the domestic sting.\" Bennett agreed that the sanctions were a risk, saying there were \"concerns it would just hike global energy prices with customers back home [in the US] paying the price as well\". \"It has had that effect already, it has boosted oil prices globally,\" he added. \"I think there's now a belief that this is kind of worth the short term pain, worth paying the price for, and there's a hope that it will have the desired effect and push Russia towards peace and towards a ceasefire.\""
    },
    {
        "title": "Russia has responded with bravado to US sanctions - underneath it though, there will be concern",
        "description": "Moscow has been quick to shrug off the coordinated sanctions against its two biggest oil companies, Rosneft and Lukoil.",
        "url": "https://news.sky.com/story/how-russia-has-reacted-to-us-sanction-against-its-two-biggest-oil-companies-13455738",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-lukoil-petrol-russia_7059678.jpg?20251023164430",
        "type": "US",
        "Author": "Ivor Bennett",
        "Date Published": "2025-10-23 10:30:00",
        "Headline": "There is also a degree of surprise at the US sanctions, which mark the first time this Trump administration has taken punitive action against Russia.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  Moscow has been quick to shrug off the coordinated sanctions against its two biggest oil companies, Rosneft and Lukoil. \"Counterproductive\" is how the Russian Foreign Ministry described the measures. It warned the Trump administration that it would fail and accused the EU of being unable to accept that its sanctions don't work. Ukraine war latest: Putin ally's warning over sanctions It's a similar response in the papers. \"Couldn't you have come up with something better?\" asks the Russian tabloid, Komsomolskaya Pravda. The broadsheet Izvestia newspaper quotes two American \"political scientists\" who predict the sanctions will backfire and hurt Europe instead.  Such bravado was predictable. Russia never likes to show weakness. Underneath it, though, I think there will be concern. That's because these aren't just any sanctions. They are coordinated measures which target the economic equivalent of Russia's crown jewels. I think there is also a degree of surprise at the US sanctions, which mark the first time this Trump administration has taken punitive action against Russia. After months of threats that failed to amount to anything, there seemed to be a belief here that the American president would never actually do it. That he was all mouth and no trousers. So there'll be surprise at that, and also at how quickly this U-turn has come about. Less than a week ago, Donald Trump appeared to be buddying up with Vladimir Putin, with talk of a get-together in Budapest. Now all of a sudden, there's no summit, only sanctions. Will the sanctions work? Will they hurt the \"Kremlin's war machine\", as the US Treasury put it. Short answer - probably not immediately. Moscow has been able to maintain military spending via tax hikes and spending cuts elsewhere, and economists believe there's still some fat Russia can trim, for example, infrastructure investment, before scaling back defence. Read more from Sky News:Trump's oil sanctions have put 'US on warpath with Russia'British Storm Shadow missiles used in 'massive' Ukrainian strike Longer term, though, in six months, say, the consensus among experts is that it will be felt, assuming it forces countries like China and India to reduce their imports of Russian oil. But even if that's the case, will it force Mr Putin to change course? There's certainly no sign of that yet. In spite of the sanctions, Russia's Foreign Ministry said that Moscow's goals \"remain unchanged\". While former-president-turned-Kremlin-hawk Dmitiry Medvedev went further, suggesting the move merely allows Moscow to step up its military campaign against Ukraine \"without regard to unnecessary negotiations\"."
    },
    {
        "title": "Elon Musk calls firms opposing his $1trn pay package 'corporate terrorists'",
        "description": "Elon Musk has called major investor advice firms opposing his $1trn pay package \"corporate terrorists\".",
        "url": "https://news.sky.com/story/elon-musk-calls-firms-opposing-his-1trn-pay-package-corporate-terrorists-13455637",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-elon-musk-tesla_6982741.jpg?20251023110145",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-23 07:34:00",
        "Headline": "The vote on whether to award Elon Musk - the world's richest man - a $1trn pay award will take place next month.",
        "Content": "Elon Musk has called major investor advice firms opposing his $1trn pay package \"corporate terrorists\". Mr Musk, the world's richest man, is continuing to lobby for the pay award from his electric vehicle company, Tesla. He defended the sum during a Tesla earnings call on Wednesday, and criticised opponents - in particular two firms that help large investors decide how to vote at shareholder meetings. The billionaire took aim at Institutional Shareholder Services (ISS) and Glass Lewis after the firms recommended shareholders vote against approving his new pay plan. Mr Musk said ISS and Glass Lewis \"have no freaking clue\" and described them as \"corporate terrorists\".  Explaining his desire for more control of the company, of which he is chief executive, he said: \"I just think that there needs to be enough voting control to give a strong influence, but not so much that I can't be fired if I go insane.\" Money latest: 'Heating on low all day' v 'Use when need it' debate settled Next month, Tesla investors will vote on a proposal that would give Mr Musk a greater say in the company, which he co-founded. Shareholders will vote on whether to increase Mr Musk's ownership of the business from 13% to nearly 29% if the company sells 12 million vehicles, produces one million humanoid robots, and launches one million robotaxis under his tenure. Under the proposal, he would receive no salary or bonus but instalments of company shares for hitting the ambitious targets also around increasing Tesla's market share, revenue and company value. It is part of an effort by Tesla to ensure Mr Musk's attention is kept on his work for the business after his heavy involvement with the Trump administration's Department of Government Efficiency (DOGE). It comes as Tesla reported record car sales as people rushed to buy an electric vehicle (EV) before a US subsidy came to an end. Despite the highest-ever quarterly sales, Tesla's share price sank 4% as it missed profit targets for the fourth three-month period in a row. Tariff and research costs and a loss of US government financial support weighed on the firm. Also potentially of concern for investors is the fact the company issued no production forecasts. Read more from Sky News:Trump imposes sanctions on Russia's two biggest oil firmsGoogle clicks on stake in $1bn e-commerce business THG Ingenuity  Tesla shares have fallen drastically in the first four months of the year, dropping as much as 39% in March, as Wall Street reassessed the company's value. But the focus on artificial intelligence (AI), robotics, and self-driving tech has helped fuel investor enthusiasm. Tesla's up 9% so far this year."
    },
    {
        "title": "English water firms get lowest environmental rating since records began",
        "description": "English water companies have collectively been given the lowest environmental rating by the Environment Agency (EA) since records began.",
        "url": "https://news.sky.com/story/english-water-firms-get-lowest-environmental-rating-since-records-began-13455716",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sewage-water_6967622.jpg?20250718101400",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-10-23 09:51:00",
        "Headline": "Companies were ranked on a scale of one to four stars by the Environment Agency. Out of a maximum score of 36 stars, the nine water firms in England scored a total of 19.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n English water companies have collectively been given the lowest environmental rating by the Environment Agency (EA) since records began. Companies were ranked on a scale of one to four stars. Out of a maximum score of 36 stars for all nine companies, the firms together scored 19, the lowest since the EA began monitoring. The only utility to receive the highest four-star rank was Severn Trent, the agency said in its annual performance assessment. The number of serious incidents, in which \"significant\" environmental harm was caused, increased by 60% last year compared to 2023. Just three companies were responsible for the vast majority of incidents. Money latest: 'Heating on low all day' v 'Use when need it' debate settled Thames Water - the country's biggest supplier - Southern Water and Yorkshire Water were responsible for 81% of all incidents. \n                  Thames Water defers decision on fight for higher bills\n                 \n                  Thames Water creditors to pledge no sale before 2030\n                 \n                  Thames Water rescue plan promises £20.5bn investment\n                 Only two firms out of nine - Northumbrian Water and Wessex Water - recorded no serious incidents. More monitoring, inspections and data have meant that knowledge of pollution in English waterways is now greater than ever. In turn, the amount of reporting has been greater. Other factors driving the figures are underinvestment and poor maintenance of infrastructure, as well as wet and stormy weather. Firms have again been called on by the Environment Agency to \"urgently\" improve their performance. There had previously been a trend of improvement since records began in 2011, but the latest figures indicated a \"dip\". In addition to pollution incidents, companies were assessed on self-reporting and compliance with permits.  A separate report by water regulator Ofwat published on Thursday showed \"mixed\" performance with improvements in sewer flooding and pipe leakage, but only two companies reported a reduction in pollution incidents over five years. Regulation of the sector has been criticised in a once-in-a-generation review of the water industry by career civil servant Sir Jon Cunliffe. In the wake of it, the government says Ofwat is to be retired. Pressure has mounted on utilities across the UK as the public has sought action on poor water quality and rising bills. Thames Water, in particular, is struggling under a £20bn debt pile with the government lining up insolvency practitioners."
    },
    {
        "title": "Power of Russia sanctions lies in US financial system that greases the wheels",
        "description": "US sanctions against Russia's two largest energy companies, the state-owned Rosneft and privately held Lukoil, are perhaps the most significant economic measures imposed by the West since the invasion of Ukraine.",
        "url": "https://news.sky.com/story/power-of-russia-sanctions-lies-in-us-financial-system-that-greases-the-wheels-13455878",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-jerusalem_7049965.jpg?20251013143215",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-10-23 16:50:00",
        "Headline": "These sanctions will directly impact the ability of the Russian companies, and anyone doing business with them, to operate within America's financial orbit. ",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  US sanctions against Russia's two largest energy companies, the state-owned Rosneft and privately held Lukoil, are perhaps the most significant economic measures imposed by the West since the invasion of Ukraine. If fully implemented, they have the potential to significantly choke off the flow of fossil fuel revenue that funds Russia's war machine, but their power lies not in directly denying Russia access to the tankers, ports and refineries that make the oil trade turn, but the US financial system that greases the wheels. Ever since the invasion, the Russian government has proved masterful at evading sanctions, aided and abetted by allies of economic convenience and an oil industry with decades of experience. Ukraine war latest: Zelenskyy expresses relief at Trump move  While the West, principally the EU, has largely turned off the taps and stopped buying Russian oil, China, India and Turkey became the largest consumers, with a shadow fleet of tankers ensuring exports continued to flow. Data from the Centre for Research into Energy and Clean Air (CREA) shows that while fossil fuel revenues have fallen from more than €1bn a day before the war, they have remained above €600m since the start of 2023, only dipping towards €500m in the last month. None of that oil has been heading for the US, but these sanctions will directly impact the ability of the Russian companies, and anyone doing business with them, to operate within America's financial orbit. According to the order from the US Office for Foreign Asset Control, the sanctions block all assets of the two companies, their subsidiaries and a number of named individuals, as well as preventing US citizens or financial institutions from doing business with them. It also threatens foreign financial institutions that \"facilitate transactions… involving Russia's military-industrial base\" with direct or secondary sanctions. In practice, the measures should prevent the two companies from accessing not just dollars, but trading markets, insurance and other services with any financial connection to the US. Taken in harness with similar steps announced by the UK earlier this month, analysts believe they can have a genuinely chilling effect on the market for Russian oil and gas. Russia's customers for oil in China, India and Turkey will also be affected, with the largest companies, state-owned and private, expected to be unwilling to take the risk of engaging directly with sanctioned entities. Indian companies are already reported to be \"recalibrating\" their imports following the announcement, which came just a week after Donald Trump announced an additional 25% import tariff on Indian goods as punishment for the country's reliance on Russian oil. Read more: Russia has responded with bravado to US sanctionsTrump imposes sanctions on Russia's two biggest oil firms That does not mean that Russian oil and gas exports will cease. There are other unsanctioned Russian energy companies that can still trade, and ever since the first barrel of oil was tapped, the industry has proved adept at evading sanctions intended to interrupt its flow from one country or another. Any significant increase in the oil price beyond the 5% seen in the aftermath of the announcement could also put pressure on the White House, which is at least as sensitive to fuel prices at home as it is to foreign wars. But analysts Kpler expect the sanctions to cause \"an immediate, short-term hiatus in Russian crude exports, as it will take time for sellers to reorganise and rebuild their trading systems to circumvent restrictions and ease buyers' concerns\". And Russian gas will, for now, continue to flow into Europe, where distaste for Vladimir Putin's imperial ambitions has not killed the appetite for his fuel. While the EU has this week imposed sanctions on liquified natural gas (LNG), they will not be fully enforced until 2027."
    },
    {
        "title": "Autistic volunteer told he could no longer work for Waitrose hired by Asda",
        "description": "An autistic man who was told he could no longer stack shelves at Waitrose when he asked to be paid has been offered a job by Asda. ",
        "url": "https://news.sky.com/story/autistic-volunteer-told-he-could-no-longer-work-for-waitrose-hired-by-asda-13455851",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-asda-supermarket-uk_7059670.jpg?20251023164107",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-23 13:18:00",
        "Headline": "Tom Boyd, 28, developed a sense of \"purpose and belonging\" while volunteering at a local supermarket before being blocked from returning when he asked for a wage, his mother says. He has now been taken on as a paid employee by the company's rival.",
        "Content": "An autistic man who was told he could no longer stack shelves at Waitrose when he asked to be paid has been offered a job by Asda.  Tom Boyd, 28, began volunteering unpaid at the branch of Waitrose in Cheadle Hulme, Greater Manchester, in 2021, supported by a care worker, to develop skills for the workplace on a further education course he was taking. The work gave him a sense of \"purpose and belonging\", his mother, Frances Boyd, told the BBC. When she asked in July if he could be paid for a few hours every week, however, the supermarket's head office told him he had to stop and could not return to the shop. Ms Boyd said they felt \"deeply let down\" by the decision as he had taken great pride in his work, which included putting out stock and tidying the shelves. \"If I went in and saw him, he was smiling, and it gave him independence, a sense of purpose and belonging,\" she said. \"He gave over 600 hours of his time purely because he wanted to belong, contribute, and make a difference... \n                  Supermarket price war could bring consumers some relief but only because the government is pushing up costs\n                 \n                  Supermarket giants face £200m hit from Reeves' NI hike\n                 \n                  Asda co-owner steps down as hunt for CEO continues\n                 \"He deserved better. He deserved kindness, respect and the chance for all his hard work to mean something.\" Mr Boyd has now been offered two paid five-hour shifts each week by Asda. \"It's overwhelming and they are flexible to say if at any time he is struggling they are fine,\" his mother said. \"How amazing that a company could do this.\" Read more:Supermarket price war could help consumersNational Insurance hit for British supermarkets Welcoming the news on X, Greater Manchester mayor Andy Burnham said he hoped it would lead to more employers accepting a neurodivergent code of best practice he has launched. An Asda spokesperson said that when the store heard about Mr Boyd's desire to find meaningful work they knew he would be a \"fantastic fit\" and were delighted to offer him a role. \"We know that finding meaningful work can be especially challenging for individuals with learning disabilities or difficulties,\" they said. \"Asda has a Supported Internship Programme and partnership with DFN Project SEARCH, through which we have welcomed over 30 talented new colleagues into roles across our stores. We have seen the positive impact this has for the individuals who join and for our colleagues and customers too.\" A Waitrose spokesperson said they \"care deeply\" about helping people into the workplace who might not otherwise be given a chance and that the chain is currently investigating what happened to Mr Boyd. \"We'd like to welcome Tom back, in paid employment, and are seeking support from his family and the charity to do so. We hope to see him back with us very soon,\" they added."
    },
    {
        "title": "Elon Musk calls firms opposing his $1trn pay package 'corporate terrorists'",
        "description": "Elon Musk has called major investor advice firms opposing his $1trn pay package \"corporate terrorists\".",
        "url": "https://news.sky.com/story/elon-musk-calls-firms-opposing-his-1trn-pay-package-corporate-terrorists-13455637",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-elon-musk-tesla_6982741.jpg?20251023110145",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-23 07:34:00",
        "Headline": "The vote on whether to award Elon Musk - the world's richest man - a $1trn pay award will take place next month.",
        "Content": "Elon Musk has called major investor advice firms opposing his $1trn pay package \"corporate terrorists\". Mr Musk, the world's richest man, is continuing to lobby for the pay award from his electric vehicle company, Tesla. He defended the sum during a Tesla earnings call on Wednesday, and criticised opponents - in particular two firms that help large investors decide how to vote at shareholder meetings. The billionaire took aim at Institutional Shareholder Services (ISS) and Glass Lewis after the firms recommended shareholders vote against approving his new pay plan. Mr Musk said ISS and Glass Lewis \"have no freaking clue\" and described them as \"corporate terrorists\".  Explaining his desire for more control of the company, of which he is chief executive, he said: \"I just think that there needs to be enough voting control to give a strong influence, but not so much that I can't be fired if I go insane.\" Money latest: 'Heating on low all day' v 'Use when need it' debate settled Next month, Tesla investors will vote on a proposal that would give Mr Musk a greater say in the company, which he co-founded. Shareholders will vote on whether to increase Mr Musk's ownership of the business from 13% to nearly 29% if the company sells 12 million vehicles, produces one million humanoid robots, and launches one million robotaxis under his tenure. Under the proposal, he would receive no salary or bonus but instalments of company shares for hitting the ambitious targets also around increasing Tesla's market share, revenue and company value. It is part of an effort by Tesla to ensure Mr Musk's attention is kept on his work for the business after his heavy involvement with the Trump administration's Department of Government Efficiency (DOGE). It comes as Tesla reported record car sales as people rushed to buy an electric vehicle (EV) before a US subsidy came to an end. Despite the highest-ever quarterly sales, Tesla's share price sank 4% as it missed profit targets for the fourth three-month period in a row. Tariff and research costs and a loss of US government financial support weighed on the firm. Also potentially of concern for investors is the fact the company issued no production forecasts. Read more from Sky News:Trump imposes sanctions on Russia's two biggest oil firmsGoogle clicks on stake in $1bn e-commerce business THG Ingenuity  Tesla shares have fallen drastically in the first four months of the year, dropping as much as 39% in March, as Wall Street reassessed the company's value. But the focus on artificial intelligence (AI), robotics, and self-driving tech has helped fuel investor enthusiasm. Tesla's up 9% so far this year."
    },
    {
        "title": "Google clicks on stake in $1bn e-commerce business THG Ingenuity",
        "description": "Google has struck a multimillion pound investment deal with the e-commerce fulfilment and logistics business which demerged from the online beauty and nutrition brand-owner THG earlier this year.",
        "url": "https://news.sky.com/story/google-clicks-on-stake-in-1bn-e-commerce-business-thg-ingenuity-13455649",
        "image_url": "https://e3.365dm.com/21/10/1920x1080/skynews-matt-moulding-thg_5547979.jpg?20211016090845",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-23 08:13:00",
        "Headline": "Alphabet-owned Google has agreed to invest a multimillion-pound sum in an instrument which could convert into an equity stake in THG Ingenuity at a valuation of £750m or more, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Google has struck a multimillion pound investment deal with the e-commerce fulfilment and logistics business which demerged from the online beauty and nutrition brand-owner THG earlier this year. Sky News has learnt that dozens of shareholders in THG Ingenuity were notified this week that the Alphabet-owned internet behemoth had agreed to invest in it through a structured equity deal. Sources said the investment was in the form of a convertible instrument which could eventually lead to Google holding a small direct equity stake in THG Ingenuity at a valuation of $1bn (£749m) or more. Money latest: 'Heating on low all day' v 'Use when need it' debate settled The investment forms part of a broader partnership between Google Cloud and THG Ingenuity - announced on Wednesday - aimed at combining the US company's generative AI and data analytics products with the logistics capabilities of the Manchester-based business. According to a statement issued earlier this week, the collaboration will include listing THG Ingenuity's services on the Google Cloud marketplace, developing new products through the use of Google Cloud's Vertex AI and Gemini platforms, and migrating THG Ingenuity's digital infrastructure onto Google Cloud. \"By combining Google Cloud's AI and data expertise with THG Ingenuity's global commerce and fulfilment capabilities, we are enabling brands to modernise, innovate and create exceptional customer experiences at scale,\" said Maureen Costello, vice-president, UK, Ireland and Sub-Saharan Africa at Google Cloud. \n                  English water firms get lowest environmental rating since records began\n                 \n                  Power of Russia sanctions lies in US financial system that greases the wheels\n                 \n                  Autistic volunteer told he could no longer work for Waitrose hired by Asda\n                 The announcement about the two companies' collaboration did not disclose the agreement about the structured equity deal. The $1bn valuation attributed to THG Ingenuity by Google's investment is understood to represent a one times revenue multiple and 15 times earnings multiple for the current financial year. Co-founded by Matthew Moulding, THG's chief executive, the company owns beauty and nutrition brands such as LookFantastic, Cult Beauty and MyProtein. The group has had a turbulent run on the London stock market following its flotation in 2020, although its shares have stabilised more recently, and are up by more than 5% over the last 12 months and roughly 70% since June. Google and THG Ingenuity both declined to comment on the former's investment in the latter. Note: Mark Kleinman is a columnist for City AM, which is owned by THG"
    },
    {
        "title": "How to get started with a stocks and shares ISA - and six tips if you already have one",
        "description": "Setting up a stocks and shares ISA can feel intimidating and complicated - but if it's something you are considering, this edition of our Savings Guide should help. ",
        "url": "https://news.sky.com/story/how-to-get-started-with-a-stocks-and-shares-isa-and-six-tips-if-you-already-have-one-13455669",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-money-istock_7059161.jpg?20251023095001",
        "type": "Business",
        "Author": "Jess Sharp",
        "Date Published": "2025-10-23 08:38:00",
        "Headline": "Each week in the Money blog, our Savings Guide offers pointers on where you could put your money. This week, we have a special edition focusing on how to get started with a stocks and shares ISA. ",
        "Content": "\n          Money live reporter\n              @JournoJess97\n Setting up a stocks and shares ISA can feel intimidating and complicated - but if it's something you are considering, this edition of our Savings Guide should help.  We've teamed up with Grace Whalley, a chartered financial planner at The Private Office, about how to get started, what to consider and what you should be doing if you already have one... A quick introduction  Everyone in the UK aged 18 or older is allowed to save £20,000 a year in an ISA, tax-free. You can use all or part of this allowance to invest your money in funds, bonds and shares in companies by using a stocks and shares ISA. The idea is that any returns you make are protected from income tax and capital gains tax. \"This is particularly important now, as allowances like the dividend and capital gains tax thresholds have been reduced,\" said Whalley. \n                  The best places to buy used tech - but go armed with these do's and don'ts\n                 \n                  How to set your baby up to be a millionaire\n                 \n                  Savings guide: The accounts that will help you beat inflation\n                 Unlike a cash ISA, which is simply a tax-free savings account, a stocks and shares ISA involves investing in financial markets, meaning the value of your money can go up and down. But Whalley points out that unless you sell when it's down, it is possible to wait for a recovery. Who are stocks and shares ISAs suited to? People who are comfortable taking on some risk, and have medium to long-term goals for their savings, can benefit from a stocks and shares ISA, Whalley said. They are particularly appropriate for people who can commit to investing for at least five years. This is because it allows time for markets to recover from any short-term dips. If you are looking for short-term gains, a stocks and shares ISA might not be the best option. You do not need to be an experienced investor to open an account - many providers offer simple, diversified, pre-made portfolios that can match the level of risk you would like to take. Thinking about opening one? Consider these things first  Before opening a stocks and shares ISA, Whalley said you should: \"Unlike cash savings, investments can fluctuate in value, and if you are forced to sell at the wrong time, you may get back less than you originally invested,\" she said. \"For those new to investing, this volatility can be unsettling, especially if you're used to the stability of savings accounts. \"That's why building a diversified portfolio (having a mix of different assets) that aligns with your risk tolerance and investment time horizon is essential.\" Read more from Money:How to set your baby up to be a millionaireThe accounts that will help you beat inflationShould you put money in savings or pension? For example, long-term investors with a higher risk appetite might have more of their money in equities (shares), while more cautious or short-term investors may prefer a mix that includes bonds, absolute return funds or commodities to help protect against downside risk. It's also important to check if the provider you're considering charges any fees. Most providers will apply a platform or service fee for managing your account. Some may also add a management charge or dealing fees each time you buy or sell assets. There could also be withdrawal or exit fees taken when you take your money out. \"These fees can vary significantly between providers and can have a meaningful impact on your returns over time, so it's important to compare costs before choosing where to invest,\" Whalley added. Already got one? Here are 6 top tips  1. Maintain a cash buffer You can do this either in a cash ISA or an easy access savings account. \"This helps ensure you're not forced to sell investments during market downturns, which could lock in losses,\" Whalley said. 2. Review your portfolio twice a month While it's important to monitor your investments, checking them daily can lead to emotional decision-making. Instead, aim to review your portfolio once or twice a month to ensure it still aligns with your goals and risk profile. \"If your circumstances or objectives change, you may want to adjust your portfolio to increase or decrease the risk rather than withdraw your money entirely, effectively starting all over again,\" she added. 3. Remember your flexible option  You also have the flexibility to transfer your ISA to another provider if you find one offering better service or lower fees and lots of providers now offer a flexible ISA facility. A flexible ISA allows you to re-contribute the amount you have withdrawn within the same tax year without affecting your ISA allowance, which helps with planning and budgeting. So, if you need some cash in the short term but are in a position to replace it back into the ISA within the same tax year, this flexible ISA rule is valuable. 4. Don't withdraw and reinvest  When looking to transfer between providers, it's crucial to use the official ISA transfer process rather than withdrawing the money yourself. This ensures you retain the tax advantages of your ISA. \"If you withdraw the funds and reinvest them manually, it will count as a new subscription and could exceed your annual allowance, resulting in the loss of the tax-free wrapper on any excess amount,\" she warned. The transfer process is straightforward: you simply open a new ISA with your chosen provider, complete their transfer form, and they'll handle the rest. You can transfer both cash and stocks and shares ISAs, and you're free to move between types. 5. Multi-asset managed portfolios are a great option \"These portfolios are designed to match different risk levels and offer diversification across asset classes and geographic regions, whilst offering an actively managed service,\" she explained. 6. Time in the market - not timing the market  While it's tempting to react to short-term fluctuations, staying invested and focused on your long-term goals is usually the best strategy."
    },
    {
        "title": "Labour dealt historic loss in Caerphilly by-election - as Plaid Cymru win seat",
        "description": "Plaid Cymru have won the by-election in the Senedd seat of Caerphilly for the first time.",
        "url": "https://news.sky.com/story/plaid-cymru-win-caerphilly-by-election-in-humiliation-for-labour-13455893",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-lindsay-whittle-plaid_7060043.jpg?20251024023409",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-23 23:22:00",
        "Headline": "Labour had held Caerphilly at every election since it was created in 1999 - as well as the parliamentary seat for over a century. Its candidate received 3,713 votes, and finished in third place.",
        "Content": " Plaid Cymru have won the by-election in the Senedd seat of Caerphilly for the first time. The Welsh nationalist party secured 15,960 votes - and candidate Lindsay Whittle cried as the result was announced. Mr Whittle is 72 years old and had stood as a Plaid candidate 13 times since 1983. He will now hold the seat until the Welsh Assembly's national elections next year. This by-election was widely regarded as a two-horse race between Plaid Cymru and Reform UK, and the result marks a considerable blow for Nigel Farage. His party received 12,113 votes - denying a victory that would have strengthened claims that Reform can convert a large lead in opinion polls into election wins. But more than anything, it is a humiliating defeat for Labour, who had held Caerphilly at every Senedd election since it was created in 1999 - as well as the Westminster seat for over a century. Its candidate received 3,713 votes - and finished in third place. \n                  Labour's dominance in Caerphilly has crumbled like cheese - but a Reform win isn't guaranteed\n                 \n                  MSP Colin Smyth appears in court charged with voyeurism and possessing indecent images of children\n                 \n                  Govt to allow early release of thousands of rapists and violent criminals, Tories claim in sentencing row\n                 Turnout overall stood at 50.43% - considerably higher than during the last ballot back in 2021. Giving his acceptance speech after the result was confirmed, Mr Whittle began by paying tribute to Hefin David - who was Welsh Labour's Member of the Senedd for Caerphilly until his death in August. \"He will be a hard act to follow,\" Mr Whittle said. \"I will never fill his shoes - but I promise you, I will walk the same path that he did.\" The Plaid politician described how he had been \"absolutely heartened\" by how many young people were involved in the by-election - and said the result sends a clear message. He said: \"Listen now Cardiff, and listen Westminster - this is Caerphilly and Wales telling you we want a better deal for every corner of Wales. The big parties need to sit up and take notice. \"Wales, we are at the dawn of new leadership, we are at the dawn of a new beginning - and I look forward to playing my part for a new Wales, and in particular, for the people of the Caerphilly constituency, I thank you with all my heart.\" Mr Whittle quipped that \"it was better than scoring the winning try for Wales in the Rugby World Cup\". And looking ahead to the next year's elections, he added: \"Tonight's result shows what's possible when people come together to back practical solutions and protect what matters most. \"We've beaten billionaire-backed Reform and, with the same determination, we can do it again in May 2026. Caerphilly has shown the way - now Wales must follow.\" Read more from Sky News:Mafia members and NBA stars arrestedPutin criticises Trump's new sanctions Speaking to Sky's chief political correspondent Jon Craig just before the declaration, Plaid Cymru leader Rhun ap Iorwerth said: \"There's clearly a real significance to the result - we are seeing the disillusionment with Labour writ large. I've heard it on hundreds of doorsteps, we've seen it in opinion polls.\" He also conceded that there was tactical voting in this by-election - with Labour and Conservative supporters alike backing Lindsay Whittle to keep out Reform. However, Mr ap Iorwerth added: \"I've spoken to literally hundreds and hundreds of people who told me - time and time again - 'I've been a Labour supporter all my life, and we're backing you this time.' \"Not begrudgingly, but because they see that's the direction we're going in - not just in this by-election, but as a nation. I'm calling on people to get behind that positive change - not just today, but ahead of next May.\" The Conservatives and the Liberal Democrats were among the parties who lost their deposits."
    },
    {
        "title": "Govt forced to water down affordable housing targets as London property market 'in crisis', minister says",
        "description": "The London property market is in crisis with \"nothing like enough new homes being built\", forcing the government to water down targets for affordable housing, the cabinet minister in charge has told Sky News.",
        "url": "https://news.sky.com/story/govt-forced-to-water-down-affordable-housing-targets-as-london-property-market-in-crisis-minister-says-13456091",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-steve-reed-sadiq-khan_7059937.jpg?20251023212654",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-10-23 19:34:00",
        "Headline": "Sky News spoke to Housing Secretary Steve Reed and Mayor of London Sir Sadiq Khan, who blamed the Conservatives for having to lower their targets.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  The London property market is in crisis with \"nothing like enough new homes being built\", forcing the government to water down targets for affordable housing, the cabinet minister in charge has told Sky News. Steve Reed, the housing secretary, and Sir Sadiq Khan, the Mayor of London, made a major intervention in the housing market today with a package to reduce red tape introduced post-Grenfell for developers and slash the target for affordable homes from 35% to 20%. Both men sat down with Sky News for a rare joint interview to justify the decisions, which represent a significant U-turn from the Mayor of London, who has previously made the affordable housing target a central part of his re-election campaigns. Mr Reed justified the decision to slash the affordable housing target - which will be opposed by Labour MPs and charities - on the grounds of \"35% of nothing is nothing\". New figures show the scale of the housebuilding collapse in London. The government set a target in the first nine months of this year for 66,000 new homes to be started in London, but to date, there have been just 3,200 private starts, according to the analyst Molior London. The housing secretary was frank that the government needs to get greater incentives for housebuilding. \"We need to make schemes viable for developers so they'll get spades in the ground and start to build them,\" he said. \n                  'Don't tell anyone': Manager at UK's largest housing association told staff how to fake fire safety notice\n                 \n                  Two arrested as police suspect 'corrupt' council staff allocated 'hundreds of homes for cash'\n                 \n                  Waiting for the bailiffs but nowhere to go: Sharp rise in disabled people facing homelessness\n                 Affordable housing target not to blame However, Sir Sadiq did not appear to accept that the affordable housing target itself was the cause of the collapse in housebuilding - something regularly claimed by property developers. He said that the cause of the worst collapse in housebuilding since the 2008 financial crisis was elsewhere. \"The price of concrete has gone up by more than 50%. The price of steel has gone up more than 40%,\" he said. \"In London, 96% of new builds are flats. We know that when it comes to the flats, you need to borrow. Interest rates have been at record levels. \"What about the impact of Brexit? What about the impact of the two staircases that are required on 96% of these homes? That's why construction has begun, but not been completed.\" Homes that are sold or rented at below market rates for people who cannot afford to buy or rent. Eligibility is determined by local incomes and house prices, and there is often specific criteria such as maximum earnings, not owning a property and having local connections to an area.\n Social rented: Local authorities or housing associations rent homes at about 50% of local market rents. Affordable rented: Homes let by housing associations at a rate of up to 80% of the local market rate. Intermediate rent: Homes let at a rate between social rent and market rent. Affordable ownership: Schemes allowing eligible households to buy a share of a property, reducing the initial mortgage and deposit required. Record numbers of council homes built Sir Sadiq presented a rosier picture of building in London. \"Let me be quite clear, record numbers of council homes have been built in London since the 1970s, records broken,\" he said. \"Record numbers of homes completed in London, never seen since the 1930s. More completions of council homes in 2023-2024 than in any year since records began.\" Before his re-election, Sir Sadiq pointed to a record 25,000 new house building starts. However, many of the projects which he boasted had been started still remain undeveloped. Read more:Manager at UK's largest housing association told staff how to fake fire safety notice A perfect storm Sky News visited Ealing, where in 2023 Sir Sadiq claimed that house building had been under way. According to data from Molior London, 1,000 homes in that borough that were cited as having been started remain undeveloped. Sir Sadiq denied he had been dishonest. \"We face a perfect storm though, in terms of interest rates, in terms of construction inflation, in terms of the pandemic, in terms of legacy of the previous government,\" he said. \"And that's why the government and I, a Labour government and a Labour mayor, are working together, are addressing this perfect storm. \"A good example of kick-starting house building, a shot in the arm to address the crisis we're talking about.\" There is likely to be a backlash at the decision to water down the affordable homes target, given a record 13,000 people were sleeping rough in London in the last year, which was a 10% increase on the year before. Nearly 90,000 children are living in temporary accommodation. Charities are set to sound the alarm about the change. MPs told not to make a fuss Labour MPs told me that Mr Reed and his team have been so concerned about the backlash, he has been warning MPs not to make a fuss in public. Mr Reed said that the overall benefit would be felt even by the vulnerable. \"The effect of the package we're announcing today is that we will see more social and affordable homes built, that means we can get people off the streets. \"And remember the numbers doubled under the Conservative government - off the streets, out of the shop doorways, and get a secure roof over their head. \"We can start to tackle the national scandal of temporary accommodation. It's not temporary at all, it's actually families stuck in a single room very often, kids sharing a bed, the parents on a sofa for years. \"That's because this country has not been building, not because of the Mayor of London, but because of inaction of the previous Conservative government.\""
    },
    {
        "title": "PM has 'confidence' in Jess Phillips after grooming survivors demanded her resignation",
        "description": "Sir Keir Starmer has backed his under-fire safeguarding minister to continue leading the government's efforts to set up a national inquiry into grooming gangs after four survivors demanded her resignation.",
        "url": "https://news.sky.com/story/pm-has-confidence-in-jess-phillips-after-grooming-survivors-demanded-her-resignation-13455771",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jess-phillips-politics_6966695.jpg?20250717073242",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-23 11:21:00",
        "Headline": "All four survivors who quit the government's grooming gangs inquiry panel said they will consider returning to the process if Jess Phillips resigns.",
        "Content": "Sir Keir Starmer has backed his under-fire safeguarding minister to continue leading the government's efforts to set up a national inquiry into grooming gangs after four survivors demanded her resignation. The prime minister said on Thursday that Jess Phillips has \"devoted vast parts of her life and career\" to tackling violence against women and girls, and has \"confidence in her\", despite the turmoil that has beset the process. All four survivors who quit the government's grooming gangs inquiry panel said they will consider returning to the process if Ms Phillips resigns. Politics latest: 'Progress' that returning small boat migrant was identified However, five other survivors on the panel have written to Sir Keir to say they will only stay if Ms Phillips remains. They said she had remained impartial, had listened to feedback and her previous experience to reduce violence against women and girls and her \"clear passion and commitment is important to us\". In contrast to the four who have quit, who accused Ms Phillips of trying to expand the inquiry's scope beyond grooming gangs, the five said it needs to be widened to focus on child sexual exploitation as a whole to ensure survivors who do not fit \"the generalised stereotype\" are not excluded. \n                  Candidates to lead grooming gangs inquiry may now think twice about role\n                 \n                  Men able to abuse children in Rotherham for years after police had their names, watchdog finds\n                 \n                  Police investigating grooming gangs given AI tools to speed up cold case work\n                 In response to the demand for Ms Phillips to quit, Sir Keir said: \"The safeguarding minister has huge experience in issues relating to violence against women and girls. She's devoted vast parts of her life and career to that, and so I do have confidence in her and Louise Casey in leading this project.\" Speaking to ITV Meridian, the prime minister also sought to reassure the victims of grooming, saying: \"It's really important that the national inquiry gets to the truth. All survivors deserve answers to their questions.\" \"It is very important that I say to all survivors that I give my personal assurance that this inquiry will go wherever it needs to go, the scope will not be changed.\" It is understood Downing Street has reached out to the four survivors who quit the government's process this week.  Samantha, one of the survivors who wrote the letter saying they would only stay if Ms Phillips remains, told Sky News: \"We shouldn't be falling apart right now, we should be working together. \"Jess has only ever been fair and honest with us, she's told us as much as she possibly can within her capacity. \"She's provided a lot of support over the phone and in-person to a lot of us survivors behind the scenes, which people don't see about Jess. \"So I do still want her to be part of this inquiry up until the end.\" A government source told Sky News the government will be talking to all survivors on the panel about their concerns and opinions on the type of person they want to chair the inquiry, after the leading candidate dropped out following concerns from survivors over his background as a police officer. The government will move as fast as possible, they said, but it will likely take months to appoint the right chair. Why four survivors quit the inquiry The four women who resigned this week expressed concerns about how the process of selecting a chair and setting the terms of reference of the national inquiry into grooming gangs is being run. They wrote on Wednesday to Home Secretary Shabana Mahmood, calling for Ms Phillips to step down and all survivors to be consulted on appointing a senior judge as chair with no major conflicts of interest. Ms Phillips told parliament on Tuesday that suggestions that the scope of the inquiry was to be expanded from just grooming gangs were \"categorically untrue\". But leaked consultation documents and texts between the safeguarding minister and survivor Fiona Goddard show the survivors' concerns that the scope would be expanded were valid.  The survivors' letter says: \"Being publicly contradicted and dismissed by a government minister when you are a survivor telling the truth takes you right back to that feeling of not being believed all over again. \"It is a betrayal that has destroyed what little trust remained.\" They have demanded that the scope of the inquiry remain \"laser-focused\" on grooming gangs and called for victims to be free to speak to support networks without fear of reprisal. The letter to Ms Mahmood says: \"Her [Ms Phillips'] conduct over the last week has shown she is unfit to oversee a process that requires survivors to trust the government. Her departure would signal you are serious about accountability and changing direction.\" The survivors describe their demands as \"the absolute bare minimum for survivors to trust that this inquiry will be different from every other process that has let us down\".  Frontrunner quits over 'toxicity' The letter was sent hours after one of the frontrunners to become chair of the inquiry withdrew, blaming \"vested interests\" and \"political opportunism and point-scoring\". Ex-police chief and child protection specialist Jim Gamble told the home secretary in a letter there was a \"highly charged and toxic environment\" around the appointment process and victims \"deserve better\". The other, Annie Hudson, a former social worker, said earlier this week she no longer wanted to be considered after intense media coverage.  The prime minister launched the inquiry into grooming gangs after an audit by Baroness Louise Casey showed the scale of the problem. It is understood that the government is exploring a range of other candidates and will provide an update in due course. A Home Office spokesperson said: \"The grooming gang scandal was one of the darkest moments in this country's history. \"That is why this government is committed to a full, statutory, national inquiry to uncover the truth. It is the very least that the victims of these hideous crimes deserve. \"We are disappointed that candidates to chair that inquiry have withdrawn. This is an extremely sensitive topic, and we have to take the time to appoint the best person suitable for the role. \"The home secretary has been clear - there will be no hiding place for those who abused the most vulnerable in our society.\""
    },
    {
        "title": "Downing Street refuses to make time for MPs to debate Prince Andrew's conduct amid growing calls by MPs",
        "description": "The government is refusing to make time in parliament for MPs to debate the conduct of Prince Andrew amid a flood of new allegations against him.",
        "url": "https://news.sky.com/story/downing-street-refuses-to-make-time-for-mps-to-debate-prince-andrews-conduct-amid-growing-calls-by-mps-13455829",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-andrew-windsor-castle_7058588.jpg?20251022165932",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-23 12:58:00",
        "Headline": "Sir Keir Starmer's spokesperson said the Royal Family \"would not want to take time from other important issues\".",
        "Content": " The government is refusing to make time in parliament for MPs to debate the conduct of Prince Andrew amid a flood of new allegations against him. The prime minister's spokesperson told reporters: \"Prince Andrew has already confirmed he will not use his titles. \"We support the decision made by the Royal Family, and we know the Royal Family would not want to take time from other important issues.\" The only way for MPs to discuss the disgraced royal's friendship with paedophile Jeffrey Epstein and his peppercorn rent for a mansion would be for the government to make time in the parliamentary timetable. Politics latest: Starmer says he has 'confidence' in Jess Phillips  Commons Speaker Sir Lindsay Hoyle has said there is no ban on MPs discussing the conduct of a member of the Royal Family, but it would have to be on a \"substantive motion\" rather than during regular question time sessions. Substantive motions can be tabled by the government, opposition parties in opposition day debates, and by backbenchers through an application to the Backbench Business Committee. In response to repeated questions from journalists about why Number 10 was blocking a debate in the main chamber, the spokesman said: \"I don't accept that. Any decision by committees to scrutinise developments are a matter for them.\" Asked whether No 10 viewed it as a waste of parliamentary time to discuss Andrew's lease of the Royal Lodge on a peppercorn rent, the spokesperson said: \"That's not what I've said.\" The chair of parliament's Public Accounts Committee, Sir Geoffrey Clifton-Brown, said in a statement on Thursday that they will be \"writing in the coming days to the Crown Estate Commissioners and HM Treasury, seeking further information on the lease arrangements for Royal Lodge\". \"We will review the response we receive to our forthcoming correspondence, and will consider at that time whether to seek further information,\" he added. The prime minister's spokesperson said earlier that Sir Keir Starmer \"supports proper scrutiny of the crown estates and all uses of taxpayers' money\", and appeared to back a committee investigation during Prime Minister's Questions on Wednesday. Calls for dukedom to be revoked Pressure has been rapidly increasing on the King's brother - who announced last week he would stop using his Duke of York title and his knighthood - after revelations in the posthumous memoir of his sex accuser, Virginia Giuffre. Reports also emerged over the weekend that claimed Prince Andrew asked a royal close protection officer to \"dig up dirt\" on the late Ms Giuffre. As a result of these new allegations, the Metropolitan Police said it is \"actively looking into the claims\". There are growing calls for his dukedom to be formally revoked, which can only be done by an act of parliament, and for him to give up his 30-room Royal Lodge home in Windsor Great Park after it emerged he paid a peppercorn rent for more than 20 years. 'We are guided by the palace' Commons leader Sir Alan Campbell was asked on Thursday whether MPs would have time to debate a motion put forward by the Scottish National Party to create a new law to formally strip Andrew of his dukedom. The leader of the SNP in Westminster, Stephen Flynn, said: \"I have laid a motion before this House which calls on the government to listen to parliamentarians and to listen to the public and to listen to victims and take legislative action to remove the dukedom from Prince Andrew. \"When is the government going to come forward with that legislation?\"  👉Listen to Politics at Sam and Anne's on your podcast app👈 Sir Alan said: \"I know that there's been speculation about legislation. But the palace have been clear that they recognise that there are other matters that this House needs to be getting on with, and we are guided in this by the palace. \"That doesn't mean that the House can't find ways of debating these matters, whether it be the matter of titles, or whether it be a matter of the finances, which I know are under question here.\" Prince Andrew has repeatedly and vehemently denied the claims against him made by the late Ms Giuffre. But a Buckingham Palace source has told Sky News that the \"new allegations that have been brought up\" are of \"very serious and grave concern\" and \"should be examined in the proper and fullest ways\"."
    },
    {
        "title": "Former faith minister urges government to adopt Islamophobia definition in full",
        "description": "A long-awaited definition of Islamophobia is expected within weeks - and a former faith minister is urging the government to adopt it in full.",
        "url": "https://news.sky.com/story/as-hate-crimes-against-muslims-rise-govt-urged-to-adopt-new-definition-of-islamophobia-in-full-13455329",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-mosque-haringey-north-london_7059199.jpg?20251023101259",
        "type": "Politics",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-10-23 02:45:00",
        "Headline": "It is expected that the government will move away from the word \"Islamophobia\", instead replacing it with \"anti-Muslim hostility\" when it publishes its long-awaited definition.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  A long-awaited definition of Islamophobia is expected within weeks - and a former faith minister is urging the government to adopt it in full. It is expected that the government will move away from the word \"Islamophobia\", instead replacing it with \"anti-Muslim hostility\". But Lord Khan, who oversaw the start of the review into the definition, told Sky News the government must adopt the full new definition to tackle hate against Muslims. The Labour peer, who was faith minister until the September reshuffle, told Sky News: \"I hope it's a clear definition which reflects the terms of reference which protects people, and it's clear. \"There's so many definitions out there, this is an opportunity to address the big problem in our communities. \"I would request and urge the government to adopt the definition which fits within the terms of reference on what we wanted to do when we embarked on the process. \"It's a strong message to our communities that the work that should be done isn't being done - these are lived experiences and I am one of those people who has suffered.\" \n                  Labour dealt historic loss in Caerphilly by-election - as Plaid Cymru win seat\n                 \n                  Govt forced to water down affordable housing targets as London property market 'in crisis', minister says\n                 \n                  PM has 'confidence' in Jess Phillips after grooming survivors demanded her resignation\n                 Chaired by former Conservative minister Dominic Grieve, an independent working group has been looking at whether to produce a new definition of Islamophobia since February as part of a government bid to tackle the rise in hate crimes towards British Muslims. Its aim was to \"define unacceptable treatment, prejudice, discrimination and hate targeting Muslims or anyone who is perceived to be Muslim\". From the beginning, ministers have insisted that any new definition would not infringe on freedom of speech, that it would protect the right to criticise, express dislike of, or insult religions and it would not pave the way for blasphemy laws to pass \"through the back door\". In 2021, Labour adopted a working definition of Islamophobia from a cross-party group supported by Wes Streeting, which said: \"Islamophobia is rooted in racism and is a type of racism that targets expressions of Muslimness or perceived Muslimness.\" This old definition has formed the basis of the Conservatives' concern with the government's policy on this new one. Read more: 'Most dangerous' time to be Muslim in UK, monitor says Tory shadow equalities minister Claire Coutinho told Sky News: \"I think we all need to be equal in the law and there is already protection in the law - if you are a victim of violence or harassment based on your religion - those protections are already in place. \"What I deeply worry about is putting one group on a pedestal and giving them special protections because that will only breed resentment.\" When pressed on why other protected groups should have a definition, she said: \"With the antisemitism definition, there was an international consensus and it was combating a specific thing, which was Holocaust denial. \"If you look at this definition, it's based on an earlier version and one of the things it said in 2018 was that even talking about the grooming gangs was a form of anti-Muslim hatred.\" British Muslims say they still face discrimination - and without a specific definition of Islamophobia, crimes can often go underreported. According to multiple monitoring groups, hate crimes have gone up significantly, with Home Office data showing a surge of 20% last year, making Muslims the target in nearly half of religion-based offences. However, policy groups say the result of adopting a definition could be a \"fundamental social and structural change\" by the back door, without democratic consent. The Policy Exchange thinktank claimed that if the government adopts a fixed definition, activists will use it to challenge counter-terrorism laws and undermine the Prevent programme, which aims to steer people away from extremism. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Ministers are set to decide in the coming weeks on what they will adopt in the report and whether it will be published, with Communities Secretary Steve Reed formally making the announcement when that decision is made. A Ministry of Housing, Communities and Local Government spokesperson said: \"We do not comment on leaks. The department is carefully considering the independent Working Group's advice on a definition of anti-Muslim hatred/Islamophobia, and no government decisions have been made. \"We will always defend freedom of speech, including fiercely protecting the right to criticise, express dislike of, or insult religions and the beliefs and practices of those who follow them. This will remain at the front of our minds as we review the definition.\""
    },
    {
        "title": "Woman has new multiple sclerosis treatment that doctors say could be 'game-changer'",
        "description": "A mum with multiple sclerosis has become the first patient in the UK to receive an experimental treatment that could slow or even stop progression of the disease.",
        "url": "https://news.sky.com/story/woman-has-new-multiple-sclerosis-treatment-that-doctors-say-could-be-game-changer-13455765",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ms-moore-multiple-sclerosis_7059455.jpg?20251023125748",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-10-23 23:01:00",
        "Headline": "Doctors are looking to recruit more people for the trial, which they say could one day be given as a single one-off treatment.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  A mum with multiple sclerosis has become the first patient in the UK to receive an experimental treatment that could slow or even stop progression of the disease. Emily Henders, 37, was given an infusion of her own cells that had been weaponised in the lab to hunt down rogue elements in her immune system that drive the disease's disabling relapses. Sky News was given special permission to be present as the cells arrived deep frozen in liquid nitrogen before being carefully thawed and infused into her bloodstream. \"Someone's got to do it. Someone's got to be the first,\" she told me. Emily has had MS for four years, but existing drug treatment hasn't worked. Three times she's woken to find she's unable to move her legs. Her dad also has the disease and is now in a wheelchair. \"I want to avoid getting to that point as much as possible,\" she said. \n                  Apple users could get 'significant' compensation say lawyers, after tech firm loses competition ruling over 'unfair' £1.5bn app store fees\n                 \n                  English water firms get lowest environmental rating since records began\n                 \n                  European space firms combine to compete with SpaceX\n                 \"The thought of not being able to chase after my children or even walk up and down the stairs is something that I want to avoid at all costs. \"I want to stop it (the disease) before it has a chance to stop me.\" Multiple sclerosis is caused by rogue cells in the immune system turning against the body and attacking the protective covering of nerves in the brain and spinal cord. It can cause blurred vision or problems with movement, memory or thinking, depending on which nerves have been damaged. There is currently no cure. But doctors at University College London Hospitals (UCLH) are leading a new global trial of so-called CAR T therapy. They took blood from Emily and isolated T cells that normally defend the body against infections. These were genetically modified in the lab to target the rogue B cells in the immune system instead, and then infused back into Emily's bloodstream. The hope is that the treatment will stop further damage to the nerves and halt progress of the disease. Dr Claire Roddie, who has been instrumental in designing the treatment, said it was one of the most significant developments in her clinical lifetime. \"If we can intervene with something that essentially reaches deep into all the areas of the body where the disease-causing cells are, and eradicate them, it is almost like flicking a switch,\" she said. \"You get this immune (system) reset where the bad B cells don't recover, and you get just normal B cells.\" CAR T therapy has already been successfully used to treat - and sometimes cure - aggressive blood cancers by harnessing the immune system to hunt down abnormal cells. There is now growing interest in also testing it against autoimmune diseases, where the immune system starts to attack the body. Early-stage clinical trials on patients with the chronic disease lupus are promising. The MS trial at UCLH will recruit 18 patients at hospitals around the world. It is primarily designed to confirm the treatment is safe enough to progress to larger studies, but scientists will also monitor the impact on the rogue cells. Dr Wallace Brownlee, who is the principal investigator of the trial, said: \"None of the medications we have available are fully effective at preventing relapses. \"This can be given as a single one-off treatment. It could be a real game-changer in terms of how we manage MS in the future.\" The form of CAR T cell therapy being tested in the trial was invented by scientists at University College London's Cancer Institute, and licensed by the UCL spinout Autolus. It is called Obe-cel and is less likely to have serious side effects on the immune system than the first generation of CAR T therapies. Read more from Sky News:Parkinson's patient plays clarinet during brain surgeryBlood test for more than 50 cancers 'could transform outcomes' Emily is a secondary school biology teacher and understands the scientific rationale for the treatment - but also for the potential of side effects. \"What are my options here?\" she said. \"I could just let this disease take over and we could wait and see and I might be lucky and nothing happens to me. \"Or I might have a massive relapse next week and never be able to walk again. \"Are we willing to take that chance? And I think we've come to the conclusion that no, we're not. We have to trust science and trust medicine to do its job.\" There are more than 150,000 people with MS in the UK. Nearly 7,100 are newly diagnosed each year. The trial, called AUTO1-MS1O, is open to UK patients who have been diagnosed with relapsing or progressive forms of MS and whose disability is worsening despite existing treatment. Dr Frederick Vonberg, neurology research fellow at UCL and UCLH, said: \"We encourage patients aged between 18 and 60 years to speak to their neurologist and explore whether they might be eligible for a referral to this trial.\""
    },
    {
        "title": "Apple users could get 'significant' compensation say lawyers, after tech firm loses competition ruling over 'unfair' £1.5bn app store fees",
        "description": "Apple has lost a landmark lawsuit over fees in the App Store, which could benefit around 36 million iPhone and iPad users in the UK.",
        "url": "https://news.sky.com/story/apple-users-could-get-significant-compensation-say-lawyers-after-tech-firm-loses-competition-ruling-over-unfair-16315bn-app-store-fees-13456089",
        "image_url": "https://e3.365dm.com/22/12/1920x1080/skynews-iphone-apple-app-store_5996092.jpg?20221214101321",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-10-23 21:44:00",
        "Headline": "Tinder, Minecraft, Clash of Clans and Strava are among popular apps with subscriptions or in-app purchases, which secure hefty commissions for Apple. iPhone and iPad users in the UK now face the prospect of compensation after a landmark lawsuit.",
        "Content": "Apple has lost a landmark lawsuit over fees in the App Store, which could benefit around 36 million iPhone and iPad users in the UK. The Competition Appeal Tribunal (CAT) has ruled that the US tech company abused its dominant position by \"charging excessive and unfair prices in the form of the commission which it charges developers\". Lawyers for Dr Rachael Kent, the academic who brought the case, claim Apple had made \"exorbitant profits\" by excluding all competition for the distribution of apps and in-app purchases. It is argued Apple should pay around £1.5bn in damages for purchases made over the last 10 years. Apple - which has faced mounting pressure from regulators in the US and Europe over the fees it charges developers - says it will appeal. Developers are typically charged 30% commission and are blocked from routing payments through any platform other than Apple's App Store. The tribunal said calculations about compensation will be argued at a hearing next month. \n                  Jessica Chastain criticises decision to delay release of The Savant after Charlie Kirk killing\n                 \n                  UK drops Apple encryption demands, says US spy chief\n                 \n                  Trump announces yet more tariffs and praises 'significant step' from Apple\n                 According to legal firm Hausfeld & Co LLP, the ruling will mean potential compensation for many Apple users in the UK. It says people must have: • made a purchase on an iPhone or iPad since 1 October 2015 • used the UK storefront of the App Store • spent money for paid-for apps, subscriptions or in-app purchases of digital content Apple users can check their eligibility for compensation by logging into their App Store account and checking their \"Purchase History\". Hausfeld says the \"sums will be significant\" for users who have app subscriptions or make regular in-app purchases. Example 1: Strava subscription at £8.99 a month/£107.88 a year - users would be entitled to £21.58 for each year.\n Regular gamers are also likely to receive large sums in compensation. Example 2: Clash of Clans, a sack of gems is £19.99 - users would get £4.00 back Example 3: Minecraft, 960 Minecoins are £5.99 – compensation would be £1.20 Any compensation is also likely to be delayed while Apple attempts to appeal the ruling, which could still be overturned by a higher court. \"This ruling overlooks how the App Store helps developers succeed and gives consumers a safe, trusted place todiscover apps and securely make payments,\" an Apple spokesperson said. In a statement, Dr Kent, an academic and senior lecturer at King's College, London, said: \"Those unfair fees have added up to billions for the world's richest company, and less choice and innovation for everyone else.\" She added that the ruling shows the UK's collective action regime is working and \"sends a clear message: no company, however wealthy or powerful, is above the law\". Read more from Sky News:Apple and Meta fined by EUApple sued by Which? over iCloudPhone users could get compensation Lesley Hannah, partner at Hausfeld & Co LLP, who represents Dr Kent, said: \"The whole purpose of competition law is to ensure fairness and to prevent companies exploiting their market power.\" \"Apple illegally kept rivals out of the market in order to prevent their customers being able to use rival app stores and save money,\" she added. Ms Hannah told Sky News that Apple will need to convince the court that there is \"an error of law\" in the judgment and any appeal could take a year to 18 months, potentially delaying any compensation. Fellow tech giants, including Amazon and Microsoft, are also facing sizeable claims at the CAT, while Google is being challenged over the commission it charges app developers for access to its Play Store. Meanwhile, on Wednesday, the Competition and Markets Authority (CMA) targeted Google and Apple for their \"strategic\" roles in mobile ecosystems, opening the door for regulators to impose changes to their business practices to improve competition. The CMA escalated scrutiny of the two US tech companies by labelling them with \"strategic market status\". Google called that decision \"disappointing, disproportionate and unwarranted\" while Apple said the move could pose increased risks for users and jeopardise the UK's \"developer economy\"."
    },
    {
        "title": "English water firms get lowest environmental rating since records began",
        "description": "English water companies have collectively been given the lowest environmental rating by the Environment Agency (EA) since records began.",
        "url": "https://news.sky.com/story/english-water-firms-get-lowest-environmental-rating-since-records-began-13455716",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sewage-water_6967622.jpg?20250718101400",
        "type": "Technology",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-10-23 09:51:00",
        "Headline": "Companies were ranked on a scale of one to four stars by the Environment Agency. Out of a maximum score of 36 stars, the nine water firms in England scored a total of 19.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n English water companies have collectively been given the lowest environmental rating by the Environment Agency (EA) since records began. Companies were ranked on a scale of one to four stars. Out of a maximum score of 36 stars for all nine companies, the firms together scored 19, the lowest since the EA began monitoring. The only utility to receive the highest four-star rank was Severn Trent, the agency said in its annual performance assessment. The number of serious incidents, in which \"significant\" environmental harm was caused, increased by 60% last year compared to 2023. Just three companies were responsible for the vast majority of incidents. Money latest: 'Heating on low all day' v 'Use when need it' debate settled Thames Water - the country's biggest supplier - Southern Water and Yorkshire Water were responsible for 81% of all incidents. \n                  Thames Water defers decision on fight for higher bills\n                 \n                  Thames Water creditors to pledge no sale before 2030\n                 \n                  Thames Water rescue plan promises £20.5bn investment\n                 Only two firms out of nine - Northumbrian Water and Wessex Water - recorded no serious incidents. More monitoring, inspections and data have meant that knowledge of pollution in English waterways is now greater than ever. In turn, the amount of reporting has been greater. Other factors driving the figures are underinvestment and poor maintenance of infrastructure, as well as wet and stormy weather. Firms have again been called on by the Environment Agency to \"urgently\" improve their performance. There had previously been a trend of improvement since records began in 2011, but the latest figures indicated a \"dip\". In addition to pollution incidents, companies were assessed on self-reporting and compliance with permits.  A separate report by water regulator Ofwat published on Thursday showed \"mixed\" performance with improvements in sewer flooding and pipe leakage, but only two companies reported a reduction in pollution incidents over five years. Regulation of the sector has been criticised in a once-in-a-generation review of the water industry by career civil servant Sir Jon Cunliffe. In the wake of it, the government says Ofwat is to be retired. Pressure has mounted on utilities across the UK as the public has sought action on poor water quality and rising bills. Thames Water, in particular, is struggling under a £20bn debt pile with the government lining up insolvency practitioners."
    },
    {
        "title": "European space firms combine to compete with SpaceX",
        "description": "Europe's top space firms have forged a deal to combine their satellite manufacturing and servicing businesses, creating a new European space group that will compete with global giants like Elon Musk's Starlink.",
        "url": "https://news.sky.com/story/european-space-firms-combine-to-compete-with-spacex-13455931",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-spacex-rocket_7059816.jpg?20251023185141",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-10-23 15:42:00",
        "Headline": "European satellite makers have long competed to build spacecraft in geostationary orbit, but have been hit by the arrival of satellites in low Earth orbit.",
        "Content": "Europe's top space firms have forged a deal to combine their satellite manufacturing and servicing businesses, creating a new European space group that will compete with global giants like Elon Musk's Starlink. It marks the most ambitious tie-up of European space assets since the creation of missile maker MBDA in 2001. French firms Airbus and Thales, and Italian firm Leonardo, will create a Toulouse-based venture and begin operations in 2027. French Finance Minister Roland Lescure said the preliminary deal would \"strengthen European sovereignty in a context of intense global competition\". \"We expect, and will be vigilant, that the synergies created from efficiencies benefit us as a key customer of the new company,\" said French satellite operator Eutelsat, the owner of OneWeb, a Starlink rival. Why does it matter?  Europe's top satellite makers have long competed to build complex spacecraft in geostationary orbit. Geostationary satellites are farther away from Earth, and travel at the same speed and in the same direction as the Earth's orbit. But those manufacturers have been hit by the arrival of cheap, tiny satellites in low Earth orbit, notably the Starlink network built by Musk's SpaceX. This month, SpaceX launched its 10,000th Starlink internet satellite into orbit, the company said in a post on X. Of those satellites in orbit, only about 8,608 are currently operational, according to Jonathan McDowell's satellite tracking database. SpaceX has extensive financial ties with NASA, the American space agency, and has only been increasing its dominance in recent months, as space plays a growing role in defence, security and communications. Starlink provides crucial internet connectivity to Ukraine and its military, and has done since 2022, when Mr Musk pledged his support for the war. But a clash between US President Donald Trump and Ukraine's Volodymyr Zelenskyy in February led to the US temporarily withdrawing military aid and intelligence sharing from the country. During the meeting, Ukraine was told it faced imminent shutoff of the service if it did not reach a deal on critical minerals, according to a Reuters report at the time. Musk said the story was not true in a post on X. But the news had already sent shivers across European governments, which feared that Mr Musk would bend to Washington's pressure, and have since ramped up talks with European governments to combine satellite constellations and strengthen satellite connectivity in Ukraine. The SpaceX leader had previously ordered a blackout of Starlink coverage during Ukraine's counteroffensive in Kherson in 2022, the first known instance of the billionaire actively shutting off coverage over a battlefield during the conflict. Project Bromo The new combination, code-named \"Project Bromo\", will employ 25,000 people with revenue of €6.5bn ($7.58bn), based on 2024 figures. The companies gave few details regarding governance, but executives pledged to avoid a system of rotating leadership or making appointments based on nationalities, approaches which have roiled the European aerospace industry, especially Airbus, in the past."
    },
    {
        "title": "Cow burps have a big impact on global warming - but scientists think they've found a solution",
        "description": "Cows bred to produce less methane in their burps could prove to be an important ally in the fight against climate change, scientists have told Sky News.",
        "url": "https://news.sky.com/story/the-groundbreaking-breeding-programme-thats-reducing-methane-in-cow-burps-13455091",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-cows-moore-methane_7058367.jpg?20251022135937",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-10-23 01:10:00",
        "Headline": "Agriculture accounts for 10% of the UK's greenhouse gas emissions, with the country's nine million cows and calves a significant contributor.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  Cows bred to produce less methane in their burps could prove to be an important ally in the fight against climate change, scientists have told Sky News. A groundbreaking breeding programme in Scotland is proving so successful that the amount of the greenhouse gas produced by cattle when they belch or break wind could fall by 40% in just 20 years. Cows and other farm animals produce at least 12% of global methane emissions, according to the Food and Agriculture Organisation of the United Nations. But reducing levels could have a significant impact on global warming. The gas traps 80 times more heat in the atmosphere than carbon dioxide in the first two decades after it's released. But it breaks down after only 12 years - so reducing emissions would have rapid results. Professor Mike Coffey, from Scotland's Rural College, said calves born in the Cool Cows breeding programme produce 2% less methane than their parents. \"It's permanent and cumulative. So once you've got an animal that produces less methane, she produces less for life,\" he explained. \"When you mate her to a lower methane-producing bull her offspring produce even less than she did. \"And you just keep going on and on. Over 20 years, you can reduce it by 40%.\" Methane is produced from cows, sheep and other ruminant animals when microbes in their guts digest grass and other feed. The amount of the gas released by animals varies, partly because of the number and type of bugs in their stomach. And that's influenced by inherited genetic factors in the cattle. A new DNA test made by the company Semex can predict which animals will produce less methane, allowing scientists to match up bulls and cows for the breeding programme. IVF techniques are then used to produce five or six calves in surrogate mothers each year, rather than the one that would normally be possible. It means scientists can pick the best animal to breed from, leading to more rapid methane reductions without any genetic modification. 'Entirely vegan world not feasible' Agriculture currently accounts for 10% of the UK's greenhouse gas emissions, with the country's nine million cows and calves a significant contributor. The National Farmers' Union has set a target of reducing greenhouse gas emissions to net zero by 2040. Food sustainability experts say breeding cattle that produce less methane is a significant advance, but not enough. Emma Garnett, from the University of Oxford, said livestock still produce large amounts of manure that also releases greenhouse gases. \"Yes, let's make things more efficient if we can, because I don't think an entirely vegan world is a feasible,\" she said. \"But it must not be used as a smoke screen for not shifting to more plant-based diets. The most effective way to reduce methane from cows is to farm fewer cows.\" Read more from Sky News:The beef market is in turmoil - and inflation is spirallingParkinson's patient plays clarinet during brain surgery Beef consumption has already fallen by 62% since 1980, according to recent government figures. Much of that has been because of concerns over health and animal welfare, but in recent years the climate impacts of cattle farming have become more widely known. However, cheese consumption is increasing. Professor Coffey said: \"If you choose to eat meat or dairy, we are trying to produce it with lower impact. \"Just like if you chose to drive a car, you can choose to drive a car that has less emissions or you can choose to go on the bus. \"What we are doing here is providing consumers a choice and farmers the tools to enable that choice to be made.\""
    },
    {
        "title": "Elon Musk calls firms opposing his $1trn pay package 'corporate terrorists'",
        "description": "Elon Musk has called major investor advice firms opposing his $1trn pay package \"corporate terrorists\".",
        "url": "https://news.sky.com/story/elon-musk-calls-firms-opposing-his-1trn-pay-package-corporate-terrorists-13455637",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-elon-musk-tesla_6982741.jpg?20251023110145",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-10-23 07:34:00",
        "Headline": "The vote on whether to award Elon Musk - the world's richest man - a $1trn pay award will take place next month.",
        "Content": "Elon Musk has called major investor advice firms opposing his $1trn pay package \"corporate terrorists\". Mr Musk, the world's richest man, is continuing to lobby for the pay award from his electric vehicle company, Tesla. He defended the sum during a Tesla earnings call on Wednesday, and criticised opponents - in particular two firms that help large investors decide how to vote at shareholder meetings. The billionaire took aim at Institutional Shareholder Services (ISS) and Glass Lewis after the firms recommended shareholders vote against approving his new pay plan. Mr Musk said ISS and Glass Lewis \"have no freaking clue\" and described them as \"corporate terrorists\".  Explaining his desire for more control of the company, of which he is chief executive, he said: \"I just think that there needs to be enough voting control to give a strong influence, but not so much that I can't be fired if I go insane.\" Money latest: 'Heating on low all day' v 'Use when need it' debate settled Next month, Tesla investors will vote on a proposal that would give Mr Musk a greater say in the company, which he co-founded. Shareholders will vote on whether to increase Mr Musk's ownership of the business from 13% to nearly 29% if the company sells 12 million vehicles, produces one million humanoid robots, and launches one million robotaxis under his tenure. Under the proposal, he would receive no salary or bonus but instalments of company shares for hitting the ambitious targets also around increasing Tesla's market share, revenue and company value. It is part of an effort by Tesla to ensure Mr Musk's attention is kept on his work for the business after his heavy involvement with the Trump administration's Department of Government Efficiency (DOGE). It comes as Tesla reported record car sales as people rushed to buy an electric vehicle (EV) before a US subsidy came to an end. Despite the highest-ever quarterly sales, Tesla's share price sank 4% as it missed profit targets for the fourth three-month period in a row. Tariff and research costs and a loss of US government financial support weighed on the firm. Also potentially of concern for investors is the fact the company issued no production forecasts. Read more from Sky News:Trump imposes sanctions on Russia's two biggest oil firmsGoogle clicks on stake in $1bn e-commerce business THG Ingenuity  Tesla shares have fallen drastically in the first four months of the year, dropping as much as 39% in March, as Wall Street reassessed the company's value. But the focus on artificial intelligence (AI), robotics, and self-driving tech has helped fuel investor enthusiasm. Tesla's up 9% so far this year."
    },
    {
        "title": "Drones to help police's 999 emergency response in London",
        "description": "Drones will be used to help police officers responding to emergencies in a trial in London.",
        "url": "https://news.sky.com/story/drones-to-help-polices-999-emergency-response-in-london-13455718",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-drone-met-police_7059241.jpg?20251023104203",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-10-23 14:40:00",
        "Headline": "Remotely-launched drones, piloted by trained operators, will stream back footage  from the scene and should be particularly useful in searching for missing people, tracing suspects and arriving quickly to capture evidence at a scene.",
        "Content": "Drones will be used to help police officers responding to emergencies in a trial in London. Remotely-launched drones will send back information from the scene to assist officers both on the ground and in a control room, the Metropolitan Police has said. Piloted by a trained operator and kept in special boxes on the roofs of selected police buildings, the drones will be launched from the force's control room, as part of a response to a 999 call, arriving on the scene within two minutes and start streaming back footage. They are expected to help in many types of incidents, including searching for missing people, tracing suspects and arriving quickly to capture evidence at a scene, providing similar operational benefits as helicopters while being quicker, quieter, cheaper and better for the environment, the Met said. The pilot programme, known as Drone as First Responder (DFR), run by the National Police Chiefs' Council (NPCC)'s drones programme, will start in Islington in north London, and expand to cover the West End and Hyde Park areas of the city by the end of the year. Assistant Commissioner Laurence Taylor, the national lead for drones, called the technology a \"vital new tool to tackle crime\". He said: \"Aerial support to policing has always added huge value, because it gives us the ability to make informed decisions about deployment and look for people - that is a lot harder to do on the ground. \n                  As food delivery drones take off in Ireland, here are the most popular items\n                 \n                  Sir Keir Starmer hails new British 'StormShroud' drones coming into operation\n                 \n                  Coronavirus: Drones to deliver COVID-19 tests and PPE to Isle of Mull\n                 \"By getting that immediate response with a drone, we're going to have more precise information, we're capturing best evidence at the very earliest opportunity, but most importantly, where scenes are chaotic or witnesses are confused, it allows us to inform our own decisions about how many officers, which assets we should deploy, and critically, if suspects or offenders are making away from the scene, we can quickly identify them and bring them into custody without the need for large, expansive area searches.\" Unlike most drones, which are piloted by an individual who always has to be able to see that drone and watch it flying, these ones \"will fly autonomously by itself to a scene\". Read more on Sky News:Controversial rappers postpone gigUK weather warnings in placeStrictly hosts quit show A remote pilot can then take control of that drone and use it for its policing purpose, then the drone will autonomously fly back to its base, he added. He said: \"So it provides more flexibility, more agility in our response, and ensures that it's far more rapid than you would ordinarily get from a line of sight drone.\" Superintendent Taryn Evans, who leads the NPCC Drones Programme and the pilot for the Met, said during trials at other forces, \"the technology has proven a gamechanger in many incidents\". Norfolk Constabulary, Cleveland Police, West Midlands Police, Hampshire & Isle of Wight Constabulary and Thames Valley Police Joint Operations Unit are also in the trial, the Met said."
    },
    {
        "title": "Tess Daly and Claudia Winkleman to leave Strictly Come Dancing",
        "description": "Strictly Come Dancing presenters Tess Daly and Claudia Winkleman have announced they will be leaving the show.",
        "url": "https://news.sky.com/story/tess-daly-and-claudia-winkleman-to-leave-strictly-come-dancing-13455684",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-tess-daly-claudia-winkleman_7059213.jpg?20251023102451",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-23 09:05:00",
        "Headline": "The pair made the announcement in a joint video, saying they will enjoy the rest of the \"amazing\" current series before bowing out together.",
        "Content": " Strictly Come Dancing presenters Tess Daly and Claudia Winkleman have announced they will be leaving the show. The pair made the announcement in a joint video shared on social media, saying they would enjoy the rest of the \"amazing\" current series before passing on \"the very sparkly baton\" to new hosts. \"After 21 unforgettable years, the time has come to say goodbye to Strictly Come Dancing,\" Daly wrote in a separate post on Instagram. \"Strictly has always been about joy, celebration and bringing people together - and I'm so proud to have played a small part in something that continues to mean so much to so many.\" Winkleman also shared her own statement, saying: \"I've always believed it's best to leave a party before you're fully ready to go, and I know the new hosts will be magnificent. \"I look forward to watching them take Strictly to new heights.\" A BBC spokesperson confirmed the pair will leave at the end of the current series, with their last appearance together on screen due to be the Christmas Special on Christmas Day. Plans for next year's series \"will be confirmed in due course\", the spokesperson said. Daly, 56, has presented Strictly since it first launched in 2004, starting alongside the late Sir Bruce Forsyth. Winkleman, 53, initially fronted its weekday companion show, It Takes Two, before moving on to host the Sunday night results show and then joining the main programme after Sir Bruce stepped down in 2014. Winkleman and Daly picked up the entertainment programme prize at the BAFTA TV Awards last year, and were made Members of the Order of the British Empire (MBE) in the King's Birthday Honours, for their services to broadcasting. What have Daly and Winkleman said? In their statements, the presenters praised the \"most brilliant\" team behind Strictly, as well as the millions of viewers who have watched the show over the years. \"We will cry when we say the last 'keep dancing',\" they said, referencing their famous sign-off, \"but we will continue to say it to each other. Just possibly in tracksuit bottoms at home while holding some pizza.\" They also paid tribute to each other, with Daly telling her \"beloved Claud\" that it had been \"an absolute joy and pleasure... sharing this adventure with you\". \"I'm so so lucky I got to stand next to you,\" Winkleman said of Daly. \"You're funny, kind, whip smart and a true friend and I love you.\" What has the Strictly team said? Kate Phillips, chief content officer for the BBC, described the presenting duo's departure as the \"end of an era\". She said in a statement: \"They've both been such incredible hosts at the very heart of the show, their passion and dedication has gone above and beyond. \"They've been integral to Strictly's success over the last 20 years, but I understand why they've decided it's time to hang up the glitter ball and get their weekends back.\" Strictly's executive producer Sarah James added: \"The Strictly Family is often referred to and these women are the matriarchs of that family. We have been together and supported each other for a long time - through pregnancies, births and deaths and to say we will all miss them terribly is an understatement.\" The 23rd series of Strictly began in September, with celebrities including football star Jimmy Floyd Hasselbaink, presenter and TV personality Vicky Pattison, RuPaul's Drag Race UK star La Voix, and model and actress Ellie Goldstein taking part. Dancers say goodbye Several dancers and former contestants have sent best wishes to Winkleman and Daly following the announcement. \"We will miss you,\" wrote professional dancer Gorka Marquez, while Motsi Mabuse added underneath Winkleman's post: \"Going to miss you so much! You're an icon and inspiration. Still in shock, but wishing you love and best wishes.\" Former Strictly dancer AJ Pritchard said: \"The claud-auditorium is always the highlight of every single performance. This is so sad. You are amazing.\" Winkleman began her career as a TV and radio presenter and went on to front a range of shows, including Comic Relief and The Great British Sewing Bee. She is currently on screens hosting The Celebrity Traitors. Daly first appeared on TV in 1999 as the host of The Big Breakfast's Find Me A Model competition and has also hosted Children In Need on several occasions. Strictly is one of the BBC's highest-rated shows, but has been hit by controversy over the last few years. Ahead of the launch of last year's series, the broadcaster said it would introduce new welfare measures, including the addition of production staff chaperones in rehearsals, following complaints about two of its former professional dancers. In September, BBC director general Tim Davie was questioned by MPs on subjects including the corporation's Gaza documentary, its Glastonbury coverage, and the recent Gregg Wallace investigation, as well as this year's Strictly line-up."
    },
    {
        "title": "Dave Ball, one half of Tainted Love hitmakers Soft Cell, dies aged 66",
        "description": "Electronic musician Dave Ball, who was one half of the popular 1980s band Soft Cell, has died at the age of 66.",
        "url": "https://news.sky.com/story/dave-ball-one-half-of-tainted-love-hitmakers-soft-cell-dies-aged-66-13455838",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-david-ball-marc-almond_7059558.jpg?20251023144246",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-23 13:06:00",
        "Headline": "Bandmate Marc Almond paid tribute, saying: \"He will always be loved by the Soft Cell fans who love his music and his music and memory will live on.\"",
        "Content": "Electronic musician Dave Ball, who was one half of the popular 1980s band Soft Cell, has died at the age of 66. The musician, who formed the duo with Marc Almond, died on Wednesday, just days after completing a new Soft Cell album. Formed in the late 1970s, Soft Cell were pioneers of the synth-pop sound which would become popular in the 1980s, and became best known for songs such as their chart-topping cover of Gloria Jones's Tainted Love, Say Hello, Wave Goodbye, and Torch. Paying tribute, Almond, 68, described Ball as a \"wonderfully brilliant musical genius\" and said they were \"always a bit chalk-and-cheese\", but the chemistry they had together worked and was always there, even after long periods apart. \"It is hard to write this, let alone process it, as Dave was in such a great place emotionally,\" Almond said. \"He was focused and so happy with the new album that we literally completed only a few days ago... \"He will always be loved by the Soft Cell fans who love his music and his music and memory will live on. At any given moment, someone somewhere in the world will be getting pleasure from a Soft Cell song. \"Thank you Dave for being an immense part of my life and for the music you gave me. I wouldn't be where I am without you.\" Soft Cell's debut album, Non-Stop Erotic Cabaret, released in 1981, is one of the most acclaimed albums of the decade, and the first of three they released in less than three years before the duo split in 1984. A reunion in 2000 brought a fourth album, Cruelty Without Beauty, while their fifth album, Happiness Not Included, again came after a long break, in 2022. The band completed their sixth studio album, Danceteria, just days before Ball's death. Named after the 1980s New York nightclub, it is due to be released in the spring of next year \"in full tribute to Dave and his recent purple patch of songwriting and production\". His death also comes just weeks after what has turned out to be his final live appearance with the band, headlining the Rewind Festival in Henley-on-Thames. 'The bond is very tight' in a duo Away from Soft Cell, Ball was also one half of acid house act The Grid, alongside musician and producer Richard Norris. They enjoyed chart success in the 1990s, most notably with the top three single and international hit Swamp Thing. Paying tribute, Norris said: \"Dave has been a huge part of my musical life for many years. Being in a duo with someone is different from being in a band, the bond is very tight. That's how it was with us. \"We went through so many remarkable, extraordinary, life-affirming experiences together. Thank you, Dave. Thanks for the good times, the endless laughter, your unwavering friendship. Most of all, thank you for the music.\" Chris Smith, manager of Ball and Soft Cell, also paid tribute, saying he had never seen the musician as \"prolific, animated or energised about the future\" as he had been in recent months. Soft Cell were planning a major tour for 2026, he said, \"and since they reunited seven years ago to sell out The O2, they have been on such a consistent, upward trajectory\". He continued: \"Dave's 'other band', The Grid, had also just signed a new record deal with BMG, and his diary was filled for years ahead with new releases and other activities. \"Dave was a genial, larger-than-life character and a quiet, understated genius of electronic music with a wicked and unique sense of humour. He was respected by his peers, and I will miss him immensely, but I'm also really happy he got to see how loved he was in the most recent stages of his long career.\" Ball also worked as a songwriter, producer and remixer for other artists, co-writing and co-producing Kylie Minogue's Impossible Princess album, which produced the hits Breathe and Some Kind of Bliss in the 1990s. He also worked with other stars including David Bowie, the Pet Shop Boys and Erasure, and alternative acts such as Psychic TV and Gavin Friday. He is survived by his close family, including his four children."
    },
    {
        "title": "Manchester gig by punk rap duo Bob Vylan postponed to next year",
        "description": "A Manchester concert by controversial punk rap duo Bob Vylan has been postponed, following calls by Jewish leaders and MPs for it to be cancelled.&#160;",
        "url": "https://news.sky.com/story/manchester-gig-by-punk-rap-duo-bob-vylan-postponed-to-next-year-13455707",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-bob-vylan-glastonbury_7056913.jpg?20251021024333",
        "type": "Entertainment",
        "Author": "Katerina Vittozzi",
        "Date Published": "2025-10-23 09:36:00",
        "Headline": "The band, which led a crowd in chants of \"death to the IDF\" (Israel Defence Forces) during an appearance at Glastonbury music festival this summer, had been due to play at the Manchester Academy next month. ",
        "Content": "\n          North of England correspondent\n              @kvittozzi\n A Manchester concert by controversial punk rap duo Bob Vylan has been postponed, following calls by Jewish leaders and MPs for it to be cancelled.  The band, which led a crowd in chants of \"death to the IDF\" (Israel Defence Forces) during an appearance at Glastonbury music festival this summer, had been due to play at the Manchester Academy early next month. According to correspondence, seen by Sky News, the venue has rescheduled the gig for next year. It comes after the Jewish Representative Council (JRC) of Greater Manchester - backed by 10 MPs - wrote to the Manchester Academy asking them to cancel the duo's performance.  The call came in the wake of the Manchester synagogue attack by 35-year-old Jihad al Shamie, in which two people were killed and three others were injured. Calling for the band's performance to be cancelled, Marc Levy, JRC Chief Executive, speaking to Sky News, claimed the band had \"openly engaged in egregious anti-semitism.\" \"How can any responsible venue even consider hosting such an act?\" Mr Levy said, \"especially after what happened in Manchester so recently?\" The Manchester Academy and Bob Vylan have been contacted for comment. Following backlash over the Glastonbury gig, Bob Vylan said in a post on Instagram that \"we are not for the death of Jews, Arabs or any other race or group of people\". The band's US visas were revoked in the wake of the set, and they were dropped by their talent agents, United Talent Agency. However, Bob Vylan's frontman, who goes by the pseudonym Bobby Vylan, earlier this week said he did not regret chanting \"death, death to the IDF\" at Glastonbury - and would do it again. Read more: Who are Bob Vylan?BBC partly upholds complaints over Glastonbury set Speaking on The Louis Theroux podcast, he also went on to reject claims that their set had contributed to a spike in antisemitic incidents that were reported a couple of days later. \"I don't think I have created an unsafe atmosphere for the Jewish community. If there were large numbers of people going out and going like 'Bob Vylan made me do this'. I might go, 'oof, I've had a negative impact here'.\""
    }
]