[
    {
        "title": "Newly-released emails show Andrew suggested 'catch-up' with Jeffrey Epstein after his prison release",
        "description": "Newly revealed emails show Andrew Mountbatten Windsor told Jeffrey Epstein it would be \"good to catch up in person\" months after the paedophile financier was released from prison.",
        "url": "https://news.sky.com/story/newly-released-emails-show-andrew-suggested-catch-up-with-jeffrey-epstein-after-his-prison-release-13461511",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-andrew-andrew_7055201.jpg?20251019120606",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-31 21:15:00",
        "Headline": "The release of the correspondence comes as Virginia Giuffre's family is calling for an \"investigation\" into Andrew. ",
        "Content": "Newly revealed emails show Andrew Mountbatten Windsor told Jeffrey Epstein it would be \"good to catch up in person\" months after the paedophile financier was released from prison. Epstein, who had been jailed for prostituting minors, was released in July 2009. He emailed the then-prince on 15 April 2010 to suggest he should meet American banker Jes Staley in London later that month. Andrew replied that he would be out of the UK on the suggested date, but said he would try to \"drop by\" New York later in the year. \"I'll look and see if I can make a couple of days before the summer,\" he wrote. \"It would be good to catch up in person.\" Andrew and Epstein were pictured together in New York's Central Park in December 2010, in a meeting Andrew later claimed was to end their friendship. The correspondence was released on Friday in unsealed court documents from a 2023 legal battle between the US Virgin Islands, where Epstein owned a private island, and JP Morgan, over its alleged dealings with the billionaire. The bank settled the lawsuit. The documents show Epstein forwarded the email to Mr Staley, who was banned from holding senior finance roles by the Financial Conduct Authority (FCA) in 2023 after he was found to have misled the regulator over the nature of his relationship with the disgraced billionaire. Virginia Giuffre's family calls for 'investigation'  It comes as Virginia Giuffre's family called for Andrew to be \"investigated\" over her claims against him. Ms Giuffre, who took her own life earlier this year, claimed that - as a teenager - she had sex with Andrew on three occasions after being trafficked by Epstein and Maxwell. Andrew has always denied the claims. Ms Giuffre sued in 2021 and the case was settled outside of court for a sum believed to have been around £12m.  In an interview with Gareth Barlow on Sky News, Ms Giuffre's brother Sky Roberts praised the King for stripping his brother of his remaining titles and ousting him from Windsor Lodge. \"But it's not enough,\" he continued. \"He's [Andrew] is still walking around a free man. He's not going to be living on the side of the road. He should be investigated.\" 👉 Listen to Sky News Daily on your podcast app 👈 Mr Roberts also accused the US government of \"safeguarding documents of people that are implicated\" with Epstein and his ex-girlfriend Ghislaine Maxwell. \"We need to fully investigate them,\" he said, calling for the King to \"tell President Trump 'put your big boy pants on', and let's get these Epstein files released so that we can go after these monsters properly\". Public supports Charles, poll shows  A poll has revealed the public supports the King's decision to strip Andrew of his titles and remove him from the Royal Lodge. Of the 4,739 people surveyed by YouGov, 79% answered \"the right decision\" to the question: \"Do you think the King has made the right or wrong decision to strip Andrew Mountbatten Windsor (formerly Prince Andrew) of his prince title?\" But when asked about the speed of King's response to the Andrew-Epstein revelations, 58% of those asked indicate they feel the monarch moved \"too slowly\". Timeline for Andrew's move out of Windsor While it is understood Andrew will leave Royal Lodge as soon as is practicable, it has now been reported that he will not relocate until after Christmas. This is due to the lengthy process of him giving up the 30-room home, which he currently shares with ex-wife Sarah Ferguson. Read more:Why Andrew is still in line to the throneThe Sandringham homes he could move to Andrew will move on to the King's Sandringham estate, which is the traditional location for the royals' Christmas gathering. The delay means any potential encounters over the festive period will be avoided. Sarah Ferguson will need to make her own accommodation arrangements."
    },
    {
        "title": "Should Prince Andrew Drive be renamed? Here's what residents think",
        "description": "\"I hate it,\" Shirley told us.",
        "url": "https://news.sky.com/story/should-prince-andrew-drive-be-renamed-divided-residents-suggest-other-royals-to-honour-13461378",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-andrew-telford_7068091.png?20251031185529",
        "type": "Home",
        "Author": "Tom Parmenter",
        "Date Published": "2025-10-31 17:32:00",
        "Headline": "Sky News did not find anyone on Prince Andrew Drive who disagreed with the King's decision to strip his brother of his titles - but there was no consensus on whether the road needs a new name.",
        "Content": "\n          National correspondent\n              @TomSkyNews\n  \"I hate it,\" Shirley told us. Every time she has to give her address, it leads to a snide remark or joke at her expense. She's lived on Prince Andrew Drive in Telford, Shropshire, for 35 years. As the national scandal around Andrew Mountbatten Windsor - as he is now called - has deepened, it has become increasingly embarrassing for her. Andrew latest: Virginia Giuffre's brother calls for investigation  A few years ago, another resident started a petition to change the name of the road, and somebody covered up part of the street sign. \"I think we should change it,\" Shirley told us, \"but don't ask me what to.\" \n                  Newly-released emails show Andrew suggested 'catch-up' with Jeffrey Epstein after his prison release\n                 \n                  Public supports King's move to strip Andrew's titles, YouGov poll shows\n                 \n                  What's next for Andrew Mountbatten Windsor?  \n                 After a few minutes weighing up the options, she settled on Prince George Drive. \"At least that looks to the future,\" she added. Linda Boden has lived on the road even longer - she and husband Phil moved here after getting married 45 years ago. \"We have actually had the conversation this morning, that the name of this road will get changed,\" Linda said. Phil told us he wasn't bothered about the name. \"It's just a name, it's not the man… I can't tell you what I think [about him] without swearing you know.\" Cheryl, who lives nearby, told us what really mattered to her were the victims of the Jeffrey Epstein scandal - particularly the late Virginia Giuffre. \"That poor girl needs justice,\" she said. \"It is ridiculous it has gone on this long to be perfectly honest. That poor family are still living with it.\" Read More:Andrew loses his titles - everything we knowThe Sandringham homes he could move into Julie Harper lives on the adjacent road, called Queen Elizabeth Way, and is more than happy with her road name. She told Sky News that the King had made the \"best decision ever\" by removing his brother's titles. I asked where her sympathies lay within this long-running royal scandal and Julie was unequivocal. \"With anybody who has been sexually exploited,\" she said bluntly. Julie believes Princess Anne Drive would be a better name for her neighbours' road. \"She's one of the better ones,\" she added. Changing the road name would be a logistical headache for local authorities and residents, with some telling us it did not bother them and they would not fancy the extra paperwork to amend things such as household bills and driving licences. But Postman Gary told us every time he's making deliveries on Prince Andrew Drive, he feels for the residents. \"We have a little giggle because we know they don't want it named that anymore and I wouldn't either if I lived here. It's probably time it changed.\"  We did not find anyone on Prince Andrew Drive who disagreed with the King's decision to remove his titles and oust him from his home in Windsor. The monarchy needs to retain the support of the public across the UK - that's one of the reasons the King has taken such decisive action at this point in the scandal."
    },
    {
        "title": "Donald Trump calls Nigeria 'country of particular concern' due to 'slaughter' of Christians",
        "description": "Donald Trump has said he is designating Nigeria a \"country of particular concern\" as \"thousands of Christians\" are being killed there.",
        "url": "https://news.sky.com/story/donald-trump-calls-nigeria-country-of-particular-concern-due-to-slaughter-of-christians-13461480",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-donald-trump_7068213.jpg?20251031202710",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-31 20:08:00",
        "Headline": "Nigeria joins North Korea, Saudi Arabia, Iran and China on a list of countries \"of particular concern\" due to violations of religious freedom.",
        "Content": "Donald Trump has said he is designating Nigeria a \"country of particular concern\" as \"thousands of Christians\" are being killed there. Posting on Truth Social, he said radical Islamists are committing \"mass slaughter\" and Christianity is \"facing an existential threat\" in the West African nation. The US president said he was asking officials to \"immediately look into this matter, and report back to me\". Mr Trump quoted figures suggesting 3,100 Christians had been killed in Nigeria, but did not state any source for the numbers or timeframe. He stated: \"We stand ready, willing, and able to save our Great Christian population around the World!\" Nigeria now joins North Korea, Russia, Saudi Arabia, Iran, Pakistan and China on a list of countries \"of particular concern\" due to violations of religious freedom. The move is one step before possible sanctions - which could mean a ban on all non-humanitarian aid. \n                  Donald Trump announces dramatic drop in US refugee intake, with most of them white South Africans\n                 \n                  Trump orders nuclear weapons tests as he meets Xi\n                 \n                  Trump's upbeat opinion of his meeting with Xi brushes over thornier issues\n                 The Nigerian government has vehemently rejected the claims. Analysts have said that, while Christians are among those targeted, the majority of victims of armed groups are Muslims in the country's Muslim-majority north, where the most attacks take place. Mr Trump's move follows efforts by Republican senator Ted Cruz to get fellow evangelical Christians to lobby Congress over claims of \"Christian mass murder\" in Nigeria. Boko Haram - which kidnapped more than 270 schoolgirls in 2014 - is the main group cited in previous warnings by US and international governments. The group has committed \"egregious violations of religious freedom\", according to a 2021 report by the bipartisan US Commission on International Religious Freedom. It said more than 37,000 people had been killed by Islamist groups in Nigeria since 2011. Read more from Sky News:Trump accused of 'new low point' with refugee orderTrump says China tariffs will be cut after 'amazing' meeting Churches and Christian neighbourhoods have been targeted in the past, but experts say Muslims are the most common victims of Boko Haram attacks, which routinely target the police, military and government. Other groups operating said to be operating in the country include Boko Haram offshoot Islamic State in West Africa Province (ISWAP). About half of Nigeria's population is estimated to be Muslim, who mostly live in the north, with roughly the other half following Christianity. US travellers are currently urged to \"reconsider\" travel to Nigeria due to a threat of terrorism, crime, kidnapping and armed gangs. The UK advises its citizens along similar lines."
    },
    {
        "title": "Prosecutors get new information about 2007 murder of Meredith Kercher in Perugia",
        "description": "New information has been received about the 2007 murder of British student Meredith Kercher, sources have confirmed to Sky News.",
        "url": "https://news.sky.com/story/prosecutors-get-new-information-about-2007-murder-of-meredith-kercher-in-perugia-13461508",
        "image_url": "https://e3.365dm.com/19/02/1920x1080/skynews-meredith-kercher-student_4590723.jpg?20190226172709",
        "type": "Home",
        "Author": "Simone Baglivo, Europe producer",
        "Date Published": "2025-10-31 22:52:00",
        "Headline": "The infamous case made headlines for years and eventually saw Amanda Knox and her  former boyfriend fully exonerated.",
        "Content": "By Simone Baglivo, Europe producer  New information has been received about the 2007 murder of British student Meredith Kercher, sources have confirmed to Sky News. The sources - from Perugia prosecutor's office - said a decision had not yet been made on whether to formally open a new investigation. The tip came from former Perugia prosecutor Giuliano Mignini, who led the original investigation into the 21-year-old's murder in the Italian university town. According to newspaper La Stampa, Mr Mignini has reported the name of a new potential suspect who allegedly fled Italy \"a few days\" after the murder. \"There are indications that this person may be implicated. It's someone I've never considered before,\" Mr Mignini told the publication. The former prosecutor said he was given the name from a source he considers \"reliable\". Mr Mignini first told Sky News about the possibility of a culprit still at large last year. \"There may still be a culprit who took part in the murder and who has not been discovered yet,\" he said. Rudy Guede, from the Ivory Coast, was convicted in 2008 of the sexual assault and murder of Ms Kercher. His DNA was found at the scene. He was released from prison in 2021 after serving 13 years of a 16-year term. Amanda Knox - along with her ex-boyfriend Raffaele Sollecito - was also convicted of the murder of her British roommate, before being acquitted and then fully exonerated by Italy's Supreme Court. Read more from Sky News:Dramatic moment train crashes into lorry at level crossingHurricane Melissa: Before and after images of Jamaica In an exclusive interview with Sky's Italian news channel in 2024, Ms Knox said she had been \"unjustly accused for 17 years\" and had not killed anyone. Mr Mignini did not immediately respond to requests for comment."
    },
    {
        "title": "Serbia protests: Thousands gather as student-led movement marks anniversary of Novi Sad tragedy",
        "description": "Tens of thousands of people are expected to gather to mark the anniversary of a major disaster in Serbia, a year after a canopy collapsed outside a train station and killed 16 people.",
        "url": "https://news.sky.com/story/serbia-protests-thousands-gather-as-student-led-movement-marks-anniversary-of-novi-sad-tragedy-13461564",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-seriba-serbia-protest_7068305.jpg?20251031223904",
        "type": "Home",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-10-31 22:19:00",
        "Headline": "Students have spent 16 days walking across the country, one day for each of the people who died when a train station canopy collapsed last year.",
        "Content": "\n          Europe correspondent\n              @AliBunkallSKY\n  Tens of thousands of people are expected to gather to mark the anniversary of a major disaster in Serbia, a year after a canopy collapsed outside a train station and killed 16 people. The incident in the northern town of Novi Sad sparked nationwide protests, led by students angry that the tragedy was the consequence of government corruption and cost-cutting. The protest movement, which has grown in size, initially wanted accountability for the tragedy but is now calling for new elections and democratic reform. It has rocked a country which has a long history of anti-government protests. Serbia's prime minister resigned in January along with other government ministers, but so far nobody has been charged or tried in connection with the roof collapse. The protests have been mostly peaceful, although there have been sporadic moments of violence with each side blaming the other for causing it. Hundreds of protesters have been arrested at major gatherings including at a huge demonstration held in Belgrade last March. A series of marches will converge in Novi Sad on Saturday, following 16 days of walking across the country - a day for each of the people who died. Huge crowds were also seen in the town on Friday night. The march has brought more visibility to the student movement, which has been locked in disagreement with the Serbian government for the past year. \n                  Shots fired outside Serbian parliament as fire breaks out\n                 \n                  Tear gas deployed as protesters clash with Serbian police in latest violent demonstration\n                 \n                  Riot police clash with protesters calling for end to Serbian president's rule\n                 \"We have made a huge difference,\" Luka, a student, told us. \"We can see a lot more people are politically active. I can see a lot more people are willing to change, and that's a huge step forward.\" \"We are going to continue to fight against our corrupt government,\" said another protester, Andjela. The demonstrators have been cheered and supported as they've passed through villages and towns, in a sign that the demonstrators are gathering widespread support. People have also given them free food and medical treatment. \"These kids are fighting for values that are normal throughout the world,\" a war veteran on the walk said to us. \"We have laws, but they are not respected, they exist only as dead letters on paper. Crime has prevailed here, especially within state institutions and we must fight against that.\" Train lines between Belgrade and Novi Sad were shut on Friday after a reported bomb scare. Some believe it was an attempt to prevent people from travelling to Novi Sad for the anniversary. Speaking on the eve of the commemorative event, Serbia's President Aleksandar Vucic played down the protests and vowed there would be no change of government. But he did announce a national day of mourning starting at midnight on Friday. The mass protests have also put a spotlight on media freedom in Serbia. News organisations writing or broadcasting criticism of the government, or even just reporting on the student protests, say they have been singled out and targeted. Igor Bozic, news director at the N1 news channel, said: \"The president repeated so many times we are terroristic media, we are enemy of the state and he is targeting us, not only N1 but by also pointing out reporters and anchors, and claiming they're people who don't like this country. \"Immediately that produces a huge number of threats to us because that kind of narrative comes directly from the first man of the country.\" The European Union, which Serbia is hoping to join, has also been critical of the country's approach to independent media, saying only last week that further reforms are needed.  But Serbia's minister for European integration defended his government's handling of the media and the protests, and suggested some news organisations are deliberately destabilising the country. \"I wouldn't say they [anti-government media outlets] are a threat to national security,\" Nemanja Starovic said, \"but on the other hand you have illegal activities and 25,000 illegal political gatherings that are not suppressed but nevertheless they are illegal, and then you have media outlets that are not just covering but participating in gathering and organising such events. \"That is something we cannot support. That is the fact of life we are witnessing here.\""
    },
    {
        "title": "Premier League's Boxing Day fixture decision branded 'thoughtless'",
        "description": "The Premier League has confirmed only one game will take place on Boxing Day this year.",
        "url": "https://news.sky.com/story/premier-league-breaks-boxing-day-fixture-tradition-13461390",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-newcastle-manchester_7068101.jpg?20251031181905",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-31 18:11:00",
        "Headline": "Manchester United's clash with Newcastle United at Old Trafford is the only game scheduled for December 26.",
        "Content": "The Premier League has confirmed only one game will take place on Boxing Day this year. It said the expansion of European competition was behind the move to reduce what is traditionally a packed schedule. The fixture will be Manchester United's home game against Newcastle United at 8pm. The Premier League said in a statement: \"The Premier League would like to acknowledge the circumstances that have led to a reduced number of matches on Boxing Day this season, impacting an important tradition in English football. \"There are now several challenges to Premier League fixture scheduling rooted in the expansion of European club competitions - which led to a revision of our domestic calendar ahead of last season, including changes to the FA Cup. \"This ultimately left the Premier League as a 33-weekend competition - fewer than previous seasons, despite being a 380-match competition since 1995.\" Read more:World Athletics blames employees for stolen £1.3mSheffield Wednesday fans 'elated' after administration It added that this year's Boxing Day falling on a Friday had also impacted the fixture list. The remaining fixtures will be spread over the weekend, with seven on Saturday and two on Sunday. 'Special arrangements have been made' The statement added: \"With fewer weekends to work with, the League is bound by how the calendar falls. \"The League can give an assurance that next season there will be more Premier League matches on Boxing Day - as the date falls on a Saturday. \"As with previous years - and in keeping with our commitment to clubs - special arrangements have been made to allow more time between games played across the festive period. \"This will allow greater time for players to recover, with the rest periods between rounds 18, 19 and 20 being increased to ensure that no club plays within 60 hours of another match.\" 'Thoughtless and ridiculous'  The Football Supporters' Association criticised the move in a strongly-worded statement on X. It read: \"The Premier League's TV selections for Xmas and NY have finally been announced a fortnight after they were supposed to be. \"Newcastle United's game at Old Trafford - the longest trip of that game week - has been selected for a ridiculous 8pm kick-off on Boxing Day. Thoughtless.\""
    },
    {
        "title": "CCTV footage shows dramatic moment train crashes into lorry at Dutch level crossing",
        "description": "CCTV footage showing a train dramatically crashing into a lorry at a level crossing has been released in the hopes it will serve as a warning to drivers.",
        "url": "https://news.sky.com/story/cctv-footage-shows-dramatic-moment-train-crashes-into-lorry-at-level-crossing-13461441",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-train-lorry-crash_7068188.png?20251031200335",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-31 20:29:00",
        "Headline": "The video \"shows how quickly things can go wrong at a railway crossing and is shocking to watch\", the train operator has said.",
        "Content": " CCTV footage showing a train dramatically crashing into a lorry at a level crossing has been released in the hopes it will serve as a warning to drivers. The collision occurred in the Dutch village of Meteren, around 70km southeast of Amsterdam, on Thursday. Train operator ProRail said five people sustained injuries in the crash - adding it was releasing the video to \"prevent this from happening again\". The train's 200 passengers were evacuated and taken to the nearby Den Bosch station, local media reported. In the footage, a lorry going across the level crossing can be seen reversing after a car approaches from the opposite direction. As the driver tries to manoeuvre their HGV to safety, the crossing's lights begin flashing and the barriers start coming down - before the train fast approaches and smashes into the back of the lorry. Read more:1,000 objects stolen in heistWhy Andrew is still in line for throne ProRail said the footage \"shows how quickly things can go wrong at a railway crossing and is shocking to watch\". Another video posted on its Instagram shows the extensive and ongoing clean-up efforts to remove the lorry's contents - thousands of pears - from the track and the surrounding area, as well as the damage to the train. Drivers of large vehicles are advised to drive through safety barriers if they find themselves stuck on level crossings, while those in cars are told to focus on getting all passengers out of their vehicle and to safety."
    },
    {
        "title": "Shaine March: Man who stabbed pregnant girlfriend to death after release for teen's murder jailed ",
        "description": "A convicted murderer who killed his pregnant girlfriend by stabbing and slashing her 23 times at her home in Walthamstow, northeast London, has been sentenced to life with a minimum term of 42 years.",
        "url": "https://news.sky.com/story/shaine-march-man-who-stabbed-pregnant-girlfriend-to-death-after-release-for-teens-murder-jailed-13460842",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-shaine-march-alana-odysseos_7053316.jpg?20251017163044",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-31 15:27:00",
        "Headline": "Shaine March attacked Alana Odysseos when she was in the early stages of pregnancy with her third child in July last year.",
        "Content": "A convicted murderer who killed his pregnant girlfriend by stabbing and slashing her 23 times at her home in Walthamstow, northeast London, has been sentenced to life with a minimum term of 42 years. Shaine March, 47, of Surrey Quays, London, attacked Alana Odysseos, 32, when she was in the early stages of pregnancy with her third child on 22 July last year. Today, March appeared in court by video link, from Belmarsh prison, after initially refusing to come to the Old Bailey. He did not react as Ms Odysseos's family spoke of the devastation he had caused them. 'It's only sentencing' Defence barrister, Sandip Patel KC, said March had refused to leave his cell and had told prison staff: \"It's only sentencing.\" March, who previously admitted to manslaughter by diminished responsibility but denied murder, changed his plea and admitted to the murder of Ms Odysseos on the seventh day of his trial. Following the guilty plea, Mr Justice Murray discharged the jury and lifted reporting restrictions of March's previous conviction for murder. It could then be reported that March was aged 21 when he killed a man by stabbing him in the neck at a McDonald's restaurant in January 2000. He was convicted of the murder of Andre Drummond, 17, in July that year and jailed before being released on licence in early 2013. He was then recalled to jail later that year after an assault on another partner in July, and released again in February 2018. Before the killing, March had been seeing Ms Odysseos for around four months. The court heard they had an argument hours before over whether to abort their unborn child, with Ms Odysseos heard to have said: \"I don't want to kill my baby.\" Members of the public in Lynnmouth Road rang 999 after finding Ms Odysseos outside her home wearing a nightie and a dressing gown, clutching her right side. She was bleeding from multiple stab wounds and shouted: \"Shaine stabbed me, he stabbed me. Help, help.\" March walked away and the victim died on the ground outside her home, having suffered stab wounds to her chest, stomach, pelvis, shoulders, buttocks, right arm, thighs and lower legs. Before throwing his mobile phone in a drain, March recorded a voice note saying: \"Mum, I just killed a woman, and I'm going back to jail.\" After his arrest, March told police: \"I did it. I killed her Alana Odysseos. I killed her hahahaha.\" 'I want him to die in prison' The victim's mother, Karen Cronin, said: \"Alana, my beautiful kind and loving daughter, left this earth in the most callous and brutal way imaginable. \"The person who has done this to my daughter - who I don't think deserves the respect of using his name - is evil and a coward. Why did he have to resort to the level of violence he used? \"The anger I feel towards him doesn't feel Christian so I can no longer go to Church. I will never have forgiveness in my heart. \"I want him to die in prison. He should never be let out.\" 'We will never get over our loss' Father, Alan Yates, said his daughter changed after meeting March and became a \"timid vulnerable person who was not our Alana\". He said: \"I hope a sentence is given that means Shaine March will never cause another family the pain and loss we are suffering. It is unimaginable and we will never get over our loss. \"Every day I wonder why he didn't walk away. Alana was pregnant with his child. This meant nothing to him.\""
    },
    {
        "title": "Police release picture of woman after man is pushed on to train tracks",
        "description": "British Transport Police have released a CCTV image of a woman they wish to speak to after a man was pushed on to the tracks at a railway station.",
        "url": "https://news.sky.com/story/police-release-picture-of-woman-after-man-is-pushed-on-to-train-tracks-13461351",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-worcester-park-transport-police_7068047.jpg?20251031181224",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-31 16:36:00",
        "Headline": "The victim suffered multiple fractures after the incident at Worcester Park railway station, police say.",
        "Content": "British Transport Police have released a CCTV image of a woman they wish to speak to after a man was pushed on to the tracks at a railway station. The incident happened at around 10.30am on 30 September at Worcester Park station. The victim was taken to hospital, where he was treated for serious injuries, including a broken shoulder blade, collarbone, ribs and nose, as well as cuts to his legs. Officers believe the woman shown in the CCTV image may have information that could assist their investigation. Read more from Sky News:Ex-sergeant major jailed for sexually assaulting teenage soldierRise in meningitis cases prompts push for vaccinations Anyone who recognises her is urged to contact British Transport Police by texting 61016 or calling 0800 40 50 40, quoting reference 189 of 30 September. Information can also be shared anonymously via Crimestoppers on 0800 555 111."
    },
    {
        "title": "Newly-released emails show Andrew suggested 'catch-up' with Jeffrey Epstein after his prison release",
        "description": "Newly revealed emails show Andrew Mountbatten Windsor told Jeffrey Epstein it would be \"good to catch up in person\" months after the paedophile financier was released from prison.",
        "url": "https://news.sky.com/story/newly-released-emails-show-andrew-suggested-catch-up-with-jeffrey-epstein-after-his-prison-release-13461511",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-andrew-andrew_7055201.jpg?20251019120606",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-31 21:15:00",
        "Headline": "The release of the correspondence comes as Virginia Giuffre's family is calling for an \"investigation\" into Andrew. ",
        "Content": "Newly revealed emails show Andrew Mountbatten Windsor told Jeffrey Epstein it would be \"good to catch up in person\" months after the paedophile financier was released from prison. Epstein, who had been jailed for prostituting minors, was released in July 2009. He emailed the then-prince on 15 April 2010 to suggest he should meet American banker Jes Staley in London later that month. Andrew replied that he would be out of the UK on the suggested date, but said he would try to \"drop by\" New York later in the year. \"I'll look and see if I can make a couple of days before the summer,\" he wrote. \"It would be good to catch up in person.\" Andrew and Epstein were pictured together in New York's Central Park in December 2010, in a meeting Andrew later claimed was to end their friendship. The correspondence was released on Friday in unsealed court documents from a 2023 legal battle between the US Virgin Islands, where Epstein owned a private island, and JP Morgan, over its alleged dealings with the billionaire. The bank settled the lawsuit. The documents show Epstein forwarded the email to Mr Staley, who was banned from holding senior finance roles by the Financial Conduct Authority (FCA) in 2023 after he was found to have misled the regulator over the nature of his relationship with the disgraced billionaire. Virginia Giuffre's family calls for 'investigation'  It comes as Virginia Giuffre's family called for Andrew to be \"investigated\" over her claims against him. Ms Giuffre, who took her own life earlier this year, claimed that - as a teenager - she had sex with Andrew on three occasions after being trafficked by Epstein and Maxwell. Andrew has always denied the claims. Ms Giuffre sued in 2021 and the case was settled outside of court for a sum believed to have been around £12m.  In an interview with Gareth Barlow on Sky News, Ms Giuffre's brother Sky Roberts praised the King for stripping his brother of his remaining titles and ousting him from Windsor Lodge. \"But it's not enough,\" he continued. \"He's [Andrew] is still walking around a free man. He's not going to be living on the side of the road. He should be investigated.\" 👉 Listen to Sky News Daily on your podcast app 👈 Mr Roberts also accused the US government of \"safeguarding documents of people that are implicated\" with Epstein and his ex-girlfriend Ghislaine Maxwell. \"We need to fully investigate them,\" he said, calling for the King to \"tell President Trump 'put your big boy pants on', and let's get these Epstein files released so that we can go after these monsters properly\". Public supports Charles, poll shows  A poll has revealed the public supports the King's decision to strip Andrew of his titles and remove him from the Royal Lodge. Of the 4,739 people surveyed by YouGov, 79% answered \"the right decision\" to the question: \"Do you think the King has made the right or wrong decision to strip Andrew Mountbatten Windsor (formerly Prince Andrew) of his prince title?\" But when asked about the speed of King's response to the Andrew-Epstein revelations, 58% of those asked indicate they feel the monarch moved \"too slowly\". Timeline for Andrew's move out of Windsor While it is understood Andrew will leave Royal Lodge as soon as is practicable, it has now been reported that he will not relocate until after Christmas. This is due to the lengthy process of him giving up the 30-room home, which he currently shares with ex-wife Sarah Ferguson. Read more:Why Andrew is still in line to the throneThe Sandringham homes he could move to Andrew will move on to the King's Sandringham estate, which is the traditional location for the royals' Christmas gathering. The delay means any potential encounters over the festive period will be avoided. Sarah Ferguson will need to make her own accommodation arrangements."
    },
    {
        "title": "Should Prince Andrew Drive be renamed? Here's what residents think",
        "description": "\"I hate it,\" Shirley told us.",
        "url": "https://news.sky.com/story/should-prince-andrew-drive-be-renamed-divided-residents-suggest-other-royals-to-honour-13461378",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-andrew-telford_7068091.png?20251031185529",
        "type": "UK",
        "Author": "Tom Parmenter",
        "Date Published": "2025-10-31 17:32:00",
        "Headline": "Sky News did not find anyone on Prince Andrew Drive who disagreed with the King's decision to strip his brother of his titles - but there was no consensus on whether the road needs a new name.",
        "Content": "\n          National correspondent\n              @TomSkyNews\n  \"I hate it,\" Shirley told us. Every time she has to give her address, it leads to a snide remark or joke at her expense. She's lived on Prince Andrew Drive in Telford, Shropshire, for 35 years. As the national scandal around Andrew Mountbatten Windsor - as he is now called - has deepened, it has become increasingly embarrassing for her. Andrew latest: Virginia Giuffre's brother calls for investigation  A few years ago, another resident started a petition to change the name of the road, and somebody covered up part of the street sign. \"I think we should change it,\" Shirley told us, \"but don't ask me what to.\" \n                  Newly-released emails show Andrew suggested 'catch-up' with Jeffrey Epstein after his prison release\n                 \n                  Public supports King's move to strip Andrew's titles, YouGov poll shows\n                 \n                  What's next for Andrew Mountbatten Windsor?  \n                 After a few minutes weighing up the options, she settled on Prince George Drive. \"At least that looks to the future,\" she added. Linda Boden has lived on the road even longer - she and husband Phil moved here after getting married 45 years ago. \"We have actually had the conversation this morning, that the name of this road will get changed,\" Linda said. Phil told us he wasn't bothered about the name. \"It's just a name, it's not the man… I can't tell you what I think [about him] without swearing you know.\" Cheryl, who lives nearby, told us what really mattered to her were the victims of the Jeffrey Epstein scandal - particularly the late Virginia Giuffre. \"That poor girl needs justice,\" she said. \"It is ridiculous it has gone on this long to be perfectly honest. That poor family are still living with it.\" Read More:Andrew loses his titles - everything we knowThe Sandringham homes he could move into Julie Harper lives on the adjacent road, called Queen Elizabeth Way, and is more than happy with her road name. She told Sky News that the King had made the \"best decision ever\" by removing his brother's titles. I asked where her sympathies lay within this long-running royal scandal and Julie was unequivocal. \"With anybody who has been sexually exploited,\" she said bluntly. Julie believes Princess Anne Drive would be a better name for her neighbours' road. \"She's one of the better ones,\" she added. Changing the road name would be a logistical headache for local authorities and residents, with some telling us it did not bother them and they would not fancy the extra paperwork to amend things such as household bills and driving licences. But Postman Gary told us every time he's making deliveries on Prince Andrew Drive, he feels for the residents. \"We have a little giggle because we know they don't want it named that anymore and I wouldn't either if I lived here. It's probably time it changed.\"  We did not find anyone on Prince Andrew Drive who disagreed with the King's decision to remove his titles and oust him from his home in Windsor. The monarchy needs to retain the support of the public across the UK - that's one of the reasons the King has taken such decisive action at this point in the scandal."
    },
    {
        "title": "Ex-sergeant major jailed for sexually assaulting teenage soldier Jaysley Beck",
        "description": "A former sergeant major has been jailed for six months for sexually assaulting a teenage soldier, who later took her own life after being bombarded with messages by another senior colleague.",
        "url": "https://news.sky.com/story/ex-warrant-officer-jailed-for-sexually-assaulting-teenage-soldier-jaysley-beck-13461196",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-jaysley-beck-michael-webber_7067769.jpg?20251031111702",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-31 13:27:00",
        "Headline": "Michael Webber, who was a Battery Sergeant Major at the time, assaulted 19-year-old Royal Artillery Gunner Jaysley Beck at a work social event in July 2021.",
        "Content": " A former sergeant major has been jailed for six months for sexually assaulting a teenage soldier, who later took her own life after being bombarded with messages by another senior colleague. Michael Webber, who was a 39-year-old Battery Sergeant Major at the time, previously pleaded guilty to one count of sexual assault. He was sentenced at Bulford Court Martial Centre in Salisbury on Friday. He had assaulted 19-year-old Royal Artillery Gunner Jaysley Beck, from Cumbria, at a work social event in July 2021. Gunner Beck, who had joined the Army at 16, said that Webber had \"made a pass\" at her, put his hand between her legs and \"pinned her down\" while trying to kiss her. She pushed him away and spent the night locked in her car before making a complaint to her superiors in the morning. Webber was given a minor sanction, involving him being interviewed and writing Gunner Beck a letter of apology, but the incident was not reported to police. An inquest into her death heard she was later bombarded with messages by bombardier Ryan Mason, another senior colleague, who has since left the army, who expressed his love for her. The 19-year-old's body was found in her room at Larkhill barracks, Wiltshire, on 15 December, 2021. An inquest ruled that her death was a suicide. During the inquest, coroner Nicholas Rheinberg ruled that \"on the balance of probabilities\" the Army's failure to take appropriate action \"more than minimally\" contributed to her death. An army report published in October 2023 also described Gunner Beck being exposed to \"an intense period of unwelcome behaviour\", and said it was \"almost certain this was a causal factor\" in her death. Wiltshire Police investigated a complaint of harassment submitted by Gunner Beck's family after her death, relating to Mr Mason's behaviour, but found the evidence did not support a criminal harassment case. Gunner Beck's mother Leighann McCready said outside the court after Webber's sentencing: \"No sentence will ever be enough. \"While he serves his time, it's us who will live with a life sentence for what he did. And now the army failed to protect her afterwards.\" Ms McCready said her daughter \"did everything right, but was failed by the system that was meant to support and protect her\". \"She followed the rules, but those responsible didn't follow as they failed to act. Failed to report and failed to follow up,\" she added. Ms McCready said she will continue fighting for \"real change\" in the British Army after Gunner Beck's death: \"Not hollow promises or recycled words that have already failed our daughter and continue to fail others. \"Real action means giving soldiers somewhere truly independent to report serious complaints without fear or favour. \"We cannot bring our daughter back. But I will keep fighting to make sure her life leads to change.\" Read more:Army's handling of complaint 'played part in death'Jaysley Beck's mother urges Army to root out abusersSexual harassment probes to be removed from chain of command Minister for veterans and people Louise Sandher-Jones said the sentencing of Webber was an \"important step on the journey to justice\". She said: \"We are honouring Jaysley's legacy by bringing about crucial reform, to provide a place where people are proud to work and have faith in the service justice system. \"The Army has accepted the failings identified by the service inquiry in full and has also responded to the recommendations to improve service life across its culture, policies and practices.\" Major General Jon Swift, assistant chief of the general staff, said: \"We will always be profoundly sorry for the failings that were identified at Jaysley's inquest in February.\" He said the Army acknowledges that Webber's sentencing \"has come too late for their beloved daughter\", adding: \"We are sorry we didn't listen to Jaysley when she first reported her assault. We are determined to make sure the same mistakes don't happen again.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Premier League's Boxing Day fixture decision branded 'thoughtless'",
        "description": "The Premier League has confirmed only one game will take place on Boxing Day this year.",
        "url": "https://news.sky.com/story/premier-league-breaks-boxing-day-fixture-tradition-13461390",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-newcastle-manchester_7068101.jpg?20251031181905",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-31 18:11:00",
        "Headline": "Manchester United's clash with Newcastle United at Old Trafford is the only game scheduled for December 26.",
        "Content": "The Premier League has confirmed only one game will take place on Boxing Day this year. It said the expansion of European competition was behind the move to reduce what is traditionally a packed schedule. The fixture will be Manchester United's home game against Newcastle United at 8pm. The Premier League said in a statement: \"The Premier League would like to acknowledge the circumstances that have led to a reduced number of matches on Boxing Day this season, impacting an important tradition in English football. \"There are now several challenges to Premier League fixture scheduling rooted in the expansion of European club competitions - which led to a revision of our domestic calendar ahead of last season, including changes to the FA Cup. \"This ultimately left the Premier League as a 33-weekend competition - fewer than previous seasons, despite being a 380-match competition since 1995.\" Read more:World Athletics blames employees for stolen £1.3mSheffield Wednesday fans 'elated' after administration It added that this year's Boxing Day falling on a Friday had also impacted the fixture list. The remaining fixtures will be spread over the weekend, with seven on Saturday and two on Sunday. 'Special arrangements have been made' The statement added: \"With fewer weekends to work with, the League is bound by how the calendar falls. \"The League can give an assurance that next season there will be more Premier League matches on Boxing Day - as the date falls on a Saturday. \"As with previous years - and in keeping with our commitment to clubs - special arrangements have been made to allow more time between games played across the festive period. \"This will allow greater time for players to recover, with the rest periods between rounds 18, 19 and 20 being increased to ensure that no club plays within 60 hours of another match.\" 'Thoughtless and ridiculous'  The Football Supporters' Association criticised the move in a strongly-worded statement on X. It read: \"The Premier League's TV selections for Xmas and NY have finally been announced a fortnight after they were supposed to be. \"Newcastle United's game at Old Trafford - the longest trip of that game week - has been selected for a ridiculous 8pm kick-off on Boxing Day. Thoughtless.\""
    },
    {
        "title": "Brother of Virginia Giuffre praises King over Andrew decision - and urges him to pressure Trump over Epstein files",
        "description": "The brother of Virginia Giuffre has praised the King's decision to strip his brother Andrew of his titles - and has called on him to pressure Donald Trump into releasing the Epstein files.",
        "url": "https://news.sky.com/story/brother-of-virginia-giuffre-praises-king-over-andrew-decision-and-urges-him-to-pressure-trump-over-epstein-files-13461242",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-andrew-royal-family_7067902.jpg?20251031143617",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-31 14:35:00",
        "Headline": "In addition to losing his royal titles, Andrew has been ordered to leave Royal Lodge - a 30-room mansion in Windsor Great Park where he lived for more than 20 years.",
        "Content": " The brother of Virginia Giuffre has praised the King's decision to strip his brother Andrew of his titles - and has called on him to pressure Donald Trump into releasing the Epstein files. Speaking to Gareth Barlow on Sky News, Sky Roberts said the King had \"set a precedent to the rest of the world\" that he was standing with survivors of abuse. \"But it's not enough. He's [Andrew] is still walking around a free man. He's not going to be living on the side of the road. He should be investigated,\" he said. Mr Roberts also accused the US government of \"safeguarding documents of people that are implicated\" with paedophile financier Jeffrey Epstein and his ex-girlfriend Ghislaine Maxwell. \"We need to fully investigate them. (The King) should tell President Trump 'put your big boy pants on', and let's get these Epstein files released so that we can go after these monsters properly.\" Ms Giuffre, who took her own life earlier this year, claimed that - as a teenager - she had sex with Andrew on three occasions after being trafficked by Epstein and Maxwell. Andrew has always denied Ms Giuffre's allegations. Ms Giuffre sued in 2021, and the case was settled outside court for a sum believed to have been around £12m. Andrew latest: Follow updates after royal stripped of his titles  In a previous statement, issued on Thursday after the announcement that Andrew will be stripped of his royal titles, the family said Ms Giuffre \"never stopped fighting for accountability for what had happened to her and to countless other survivors like her\". \"An ordinary American girl from an ordinary American family brought down a British prince with her truth and extraordinary courage,\" the family said, adding, \"she declares victory\". The family vowed to continue fighting until \"all of the abusers and abettors connected to Jeffrey Epstein and Ghislaine Maxwell\" are brought to justice. The disgraced royal will now be treated as a commoner and go by the name Andrew Mountbatten Windsor. 'Virginia should be here celebrating'  Elsewhere in the interview, Mr Roberts said the family has felt \"a mixed bag of emotions\" since the palace's latest announcement. \"[Virginia] should be sitting on this camera with you right now celebrating this but also demanding more justice,\" he said. \"I think it's a mixed bag of emotions over the last 24 hours but we are just hell bent to not let her voice die.\" Mr Roberts added he would welcome a meeting with the King and \"love the opportunity to tell my sister's story to the palace\". \"If the King is saying he stands with survivors out there and if the King is saying he stands with survivors and their victims, then meet with us, have a conversation with us,\" he said. \"We're real people with real stories that can affect real change and I think my sister did something unprecedented that says advocacy can affect change, advocacy can lead to justice.\" Andrew no longer Duke of York Andrew Mountbatten Windsor has been removed from the official roll of the peerage, representing a significant step in the formal revocation of his titles. Buckingham Palace confirmed that his name was struck from the roll after the King decided to strip his brother of the Prince and Duke of York titles and the HRH style, effectively ending his public role. Dukes, including the Duke of York, are recorded on the roll of the peerage, which is maintained by the Crown Office under the responsibility of the Lord Chancellor, David Lammy. As justice secretary, Mr Lammy was set to receive royal warrants from the King to remove the Duke from the roll, along with his Prince title and HRH style.  Andrew to leave Royal Lodge in Windsor In addition to losing his royal titles, Andrew has been ordered to leave Royal Lodge - a 30-room mansion in Windsor Great Park where he lived for more than 20 years. Andrew will now be moving to a property on the Sandringham Estate in Norfolk, around 100 miles north of London, which is privately owned by the King. The estate is perhaps most famous as the Royal Family's traditional Christmas holiday residence. It remains unclear when Andrew will leave the property, though it is expected to be \"as soon as practicable\". Read more:Key claims in Virginia Giuffre memoirWhy Charles could no longer ignore public opinionWhere will Andrew live next? It is understood that the King made the decision due to his brother's significant lapses in judgement, and had the backing of the royal family, including the Prince of Wales. Sarah Ferguson, who previously lived with her former husband Andrew at Royal Lodge, will not be provided accommodation by the King and will need to find a new residence. Andrew's downfall  The latest developments in the long-running controversy come amid renewed scrutiny of the King's brother, after he tried earlier this month to address Ms Giuffre's allegations by relinquishing his dukedom and other honours ahead of the release of her posthumous memoir.  Instead of easing scrutiny, Andrew faced mounting criticism over his property, and some MPs pushed for the issue to be debated in parliament. He has also been the subject of damaging media reports, including allegations that he attempted to enlist the Metropolitan Police to collect information for a smear campaign against Ms Giuffre. The King's decision to strip his brother of his titles is likely to be seen by commentators as an effort by the royal family to distance itself from Andrew. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Shaine March: Man who stabbed pregnant girlfriend to death after release for teen's murder jailed ",
        "description": "A convicted murderer who killed his pregnant girlfriend by stabbing and slashing her 23 times at her home in Walthamstow, northeast London, has been sentenced to life with a minimum term of 42 years.",
        "url": "https://news.sky.com/story/shaine-march-man-who-stabbed-pregnant-girlfriend-to-death-after-release-for-teens-murder-jailed-13460842",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-shaine-march-alana-odysseos_7053316.jpg?20251017163044",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-31 15:27:00",
        "Headline": "Shaine March attacked Alana Odysseos when she was in the early stages of pregnancy with her third child in July last year.",
        "Content": "A convicted murderer who killed his pregnant girlfriend by stabbing and slashing her 23 times at her home in Walthamstow, northeast London, has been sentenced to life with a minimum term of 42 years. Shaine March, 47, of Surrey Quays, London, attacked Alana Odysseos, 32, when she was in the early stages of pregnancy with her third child on 22 July last year. Today, March appeared in court by video link, from Belmarsh prison, after initially refusing to come to the Old Bailey. He did not react as Ms Odysseos's family spoke of the devastation he had caused them. 'It's only sentencing' Defence barrister, Sandip Patel KC, said March had refused to leave his cell and had told prison staff: \"It's only sentencing.\" March, who previously admitted to manslaughter by diminished responsibility but denied murder, changed his plea and admitted to the murder of Ms Odysseos on the seventh day of his trial. Following the guilty plea, Mr Justice Murray discharged the jury and lifted reporting restrictions of March's previous conviction for murder. It could then be reported that March was aged 21 when he killed a man by stabbing him in the neck at a McDonald's restaurant in January 2000. He was convicted of the murder of Andre Drummond, 17, in July that year and jailed before being released on licence in early 2013. He was then recalled to jail later that year after an assault on another partner in July, and released again in February 2018. Before the killing, March had been seeing Ms Odysseos for around four months. The court heard they had an argument hours before over whether to abort their unborn child, with Ms Odysseos heard to have said: \"I don't want to kill my baby.\" Members of the public in Lynnmouth Road rang 999 after finding Ms Odysseos outside her home wearing a nightie and a dressing gown, clutching her right side. She was bleeding from multiple stab wounds and shouted: \"Shaine stabbed me, he stabbed me. Help, help.\" March walked away and the victim died on the ground outside her home, having suffered stab wounds to her chest, stomach, pelvis, shoulders, buttocks, right arm, thighs and lower legs. Before throwing his mobile phone in a drain, March recorded a voice note saying: \"Mum, I just killed a woman, and I'm going back to jail.\" After his arrest, March told police: \"I did it. I killed her Alana Odysseos. I killed her hahahaha.\" 'I want him to die in prison' The victim's mother, Karen Cronin, said: \"Alana, my beautiful kind and loving daughter, left this earth in the most callous and brutal way imaginable. \"The person who has done this to my daughter - who I don't think deserves the respect of using his name - is evil and a coward. Why did he have to resort to the level of violence he used? \"The anger I feel towards him doesn't feel Christian so I can no longer go to Church. I will never have forgiveness in my heart. \"I want him to die in prison. He should never be let out.\" 'We will never get over our loss' Father, Alan Yates, said his daughter changed after meeting March and became a \"timid vulnerable person who was not our Alana\". He said: \"I hope a sentence is given that means Shaine March will never cause another family the pain and loss we are suffering. It is unimaginable and we will never get over our loss. \"Every day I wonder why he didn't walk away. Alana was pregnant with his child. This meant nothing to him.\""
    },
    {
        "title": "'Significant' step in establishing national restorative justice programme for Post Office victims",
        "description": "A \"significant\" step has been taken in establishing a national restorative justice programme for victims of the Post Office's Horizon IT scandal.",
        "url": "https://news.sky.com/story/significant-step-in-establishing-national-restorative-justice-programme-for-post-office-victims-13461213",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-post-office-sign_7068058.jpg?20251031171735",
        "type": "UK",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-10-31 11:27:00",
        "Headline": "Long-sought family involvement is included in the proposal, as is partial funding by Fujitsu, and an acknowledgement by the organisers that action \"beyond financial compensation\" is needed. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n A \"significant\" step has been taken in establishing a national restorative justice programme for victims of the Post Office's Horizon IT scandal. Children of affected postmasters, as well as those directly hit by the faulty accounting software, will be part of the partially Fujitsu-funded programme, as the UK's Restorative Justice Council acknowledged more than financial compensation was needed. Money blog: Holidays blow as pound takes another battering  Data from the Fujitsu-made Horizon computer program led to the wrongful prosecution of more than 700 postmasters for theft and false accounting, while many more racked up large debts, lost homes, livelihoods and reputations as they borrowed heavily to plug the incorrectly generated shortfalls in their branches. As part of the inquiry into the scandal, its chair, Sir Wyn Williams, recommended the government, the Post Office and Fujitsu engage in a formal restorative justice plan to provide \"full and fair redress Restorative justice aims to repair harm by bringing together victims and those responsible. \n                  Victims of Post Office Capture scandal say they are being treated as 'second-class' citizens\n                 \n                  First ever compensation scheme launched for postmasters affected by Capture IT scandal\n                 \n                  Post Office compensation 'worse than original injustice', victims' commissioner says\n                 Long-sought family involvement On Thursday, the Restorative Justice Council (RJC), which runs the project, said it would expand engagement to children and families of victims.  The move marked \"a significant advancement in the establishment of a national restorative justice programme for those impacted by the Post Office Horizon IT scandal\", the body said. Relatives have long sought acknowledgement and support for the harm they suffered.  Some have told Sky News how their eating disorder escalated due to the prosecution of a parent, and they carried trauma for decades. Calls for a family fund were made to redress the \"chances that were taken from us growing up\". What's involved? Online listening sessions for children of those affected and people previously unable to attend are planned in an effort to ensure all voices contribute to the restorative justice programme. Also involved in the initiative is equipping the government (via the Department for Business and Trade), Post Office and Fujitsu \"with the necessary skills and knowledge to engage in restorative dialogue with integrity\", the RJC said.  Group-based sessions with organisations involved in the scandal and a confidential safe space service for affected people to share their experiences and explore healing without the pressure of a formal process will be created.  Freelance restorative listeners are being recruited by the service for this purpose.  The formation of the scheme acknowledges the limitations of financial redress, with the RJC saying \"true restoration requires truth, acknowledgement, accountability and meaningful action beyond financial compensation\".  The funding question  The restorative listening and wellbeing service is being funded by Fujitsu. It comes amid questions as to the contribution of the Japanese multinational to redress. Fujitsu has said it is \"morally obligated\" to contribute to the costs, but the extent would be determined by the outcome of the Horizon scandal public inquiry. Further inquiry reports are to be released in the coming months.  The Post Office is government-owned and so it's taxpayers who fund victim payouts. What next? The RJC initiatives are pilot schemes for now. Feedback from them is intended to shape the design of a full, long-term, national restorative justice programme, due to launch in April. An updated report on restorative justice for Post Office victims will be published in January. \"The next phase is about translating their voices into real, restorative action - ensuring that healing, accountability and cultural change progress hand in hand,\" said RJC chief executive Jim Simon.   So far, 145 individuals have been involved, with an extra 200 postmasters expected to be engaged between November and March. \"Engagement is good and continues to grow,\" Mr Simon said."
    },
    {
        "title": "Police release picture of woman after man is pushed on to train tracks",
        "description": "British Transport Police have released a CCTV image of a woman they wish to speak to after a man was pushed on to the tracks at a railway station.",
        "url": "https://news.sky.com/story/police-release-picture-of-woman-after-man-is-pushed-on-to-train-tracks-13461351",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-worcester-park-transport-police_7068047.jpg?20251031181224",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-31 16:36:00",
        "Headline": "The victim suffered multiple fractures after the incident at Worcester Park railway station, police say.",
        "Content": "British Transport Police have released a CCTV image of a woman they wish to speak to after a man was pushed on to the tracks at a railway station. The incident happened at around 10.30am on 30 September at Worcester Park station. The victim was taken to hospital, where he was treated for serious injuries, including a broken shoulder blade, collarbone, ribs and nose, as well as cuts to his legs. Officers believe the woman shown in the CCTV image may have information that could assist their investigation. Read more from Sky News:Ex-sergeant major jailed for sexually assaulting teenage soldierRise in meningitis cases prompts push for vaccinations Anyone who recognises her is urged to contact British Transport Police by texting 61016 or calling 0800 40 50 40, quoting reference 189 of 30 September. Information can also be shared anonymously via Crimestoppers on 0800 555 111."
    },
    {
        "title": "Former TGI Fridays chief in move to snap up UK chain ",
        "description": "The manager of the bulk of TGI Fridays' restaurants around the world has swooped to buy its British operations in a deal which preserves all 2,000 jobs at the chain.",
        "url": "https://news.sky.com/story/former-tgi-fridays-chief-in-move-to-snap-up-uk-chain160-13461324",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-tgi-fridays_6689517.jpg?20241006130825",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-31 15:25:00",
        "Headline": "Sugarloaf TGIF Management has swooped to buy the chain's British operations just over a year after they last changed hands, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The manager of the bulk of TGI Fridays' restaurants around the world has swooped to buy its British operations in a deal which preserves all 2,000 jobs at the chain. Sky News has learnt that Sugarloaf TGIF Management, run by former TGI Fridays chief executive Ray Blanchette, has struck a deal to take control of nearly 50 UK sites. Industry sources said the deal was likely to be announced within days. Money blog: Holidays blow as pound takes another battering The transaction will see TGI Fridays' UK arm form part of a growing international consolidation of the brand under Mr Blanchette. The British chain, which employs just over 2,000 people and is said to have a strong booking pipeline for the crucial festive trading period, was sold just over a year ago to Calveton UK and Breal Capital, two investment firms. The chain now operates from roughly the same number of restaurants as it did a year ago. \n                  Private equity backers call time on bar chain The Alchemist\n                 \n                  Greggs increasing prices due to higher employment costs\n                 \n                  Cote restaurant's owner cooks up fresh capital injection\n                 In a response to an enquiry from Sky News, a spokesperson for the two selling shareholders said: \"After a prolonged period of due diligence we are pleased to announce the sale of TGI Friday's UK to Sugarloaf, the manager and custodian of the worldwide brand. \"During the 12 months of our tenure we have stabilised the team and supply chains, as well as completing the first phase of repositioning the brand through a national relaunch on July 4th this year, which has seen improvements in both revenues and covers.\" The sale of the UK business comes during a tough period for the hospitality industry, which is grappling with a stagnating economy and the impact of tax rises in last year's budget. Rachel Reeves, the chancellor, is under intense pressure not to raise business taxes further when she unveils this year's budget late next month."
    },
    {
        "title": "'Send help': The desperate pleas from Hurricane Melissa survivors",
        "description": "Driving through western Jamaica, it's staggering how wide Hurricane Melissa's field of destruction is.",
        "url": "https://news.sky.com/story/send-help-the-desperate-pleas-from-hurricane-melissa-survivors-13461066",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-jamaica-hurricane-melissa_7067450.jpg?20251031051539",
        "type": "World",
        "Author": "Martha Kelner",
        "Date Published": "2025-10-31 05:11:00",
        "Headline": "The relief effort is intensifying - but Melissa left a devastating trail in her wake, with dozens of deaths confirmed so far.",
        "Content": "\n          US correspondent\n              @marthakelner\n  Driving through western Jamaica, it's staggering how wide Hurricane Melissa's field of destruction is. Town after town, miles apart, where trees have been uprooted and roofs peeled back. Some homes are now just a pile of rubble, and we still don't know how deadly this storm has been, although authorities warn the death toll will likely rise. A total of 49 people have died in Melissa's charge across the Caribbean - 19 in Jamaica alone. My team and I headed from Kingston airport, towards where the hurricane made landfall, referred to as \"ground zero\" of this crisis. On the way, it's clear that so many communities here have been brought to their knees and so many people are desperate for help. We drive under a snarl of mangled power lines and over huge piles of rocks before reaching the town of Lacovia in Saint Elizabeth Parish. At the side of the road, beside a battered and sodden primary school, a woman wearing a red shirt and black tracksuit bottoms holds a handwritten sign in the direction of passing cars. \"Help needed at this shelter,\" it says. The woman's name is Sheree McLeod, and she is an admin assistant at the school. She is in charge of a makeshift shelter in the school, a temporary home for at least 16 people between the ages of 14 and 86. I stop and ask what she needs and almost immediately she begins to cry. 'No emergency teams' \"I've never seen this in my entire life,\" she says. \"It's heartbreaking, I never thought in a million years that I would be in the situation trying to get help and with literally no communication. \"We can't reach any officials, there are no emergency teams. I'm hoping and praying that help can reach us soon. \"The task of a shelter manager is voluntary and the most I can do is just ask for help in whatever way possible.\" Read more:Before and after images show hurricane's destructionWhat we know from the ground following the devastation Sheree shows me the classroom where she and 15 other people rode out the hurricane which she says hung over the town for hours. They had just a sheet of tarpaulin against the window shutters to try to repel gusts of more than 170mph and a deluge of rain. They took a white board off the wall to try to get more shelter.  \"It was very terrible,\" Sheree says. \"We were given eight blankets for the shelter and that was it, but there were 16 people. \"Now all their clothes and blankets that they were provided with got damaged. Some people are sleeping in chairs and on wooden desks.\" Her plea for help is echoed across this part of Jamaica. As we're filming a pile of wooden slats that used to be a house, a passing motorcyclist shouts: \"Send help, Jamaica needs help now.\" The relief effort is intensifying. After I leave Sheree, a convoy of army vehicles speed past in the direction of Black River, the town at the epicentre of this disaster. Diggers work to clear debris from the road late into the night. Ambulance sirens also grow more regular as the day goes on. Help is coming and for many here, it can't come soon enough."
    },
    {
        "title": "Donald Trump calls Nigeria 'country of particular concern' due to 'slaughter' of Christians",
        "description": "Donald Trump has said he is designating Nigeria a \"country of particular concern\" as \"thousands of Christians\" are being killed there.",
        "url": "https://news.sky.com/story/donald-trump-calls-nigeria-country-of-particular-concern-due-to-slaughter-of-christians-13461480",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-donald-trump_7068213.jpg?20251031202710",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-31 20:08:00",
        "Headline": "Nigeria joins North Korea, Saudi Arabia, Iran and China on a list of countries \"of particular concern\" due to violations of religious freedom.",
        "Content": "Donald Trump has said he is designating Nigeria a \"country of particular concern\" as \"thousands of Christians\" are being killed there. Posting on Truth Social, he said radical Islamists are committing \"mass slaughter\" and Christianity is \"facing an existential threat\" in the West African nation. The US president said he was asking officials to \"immediately look into this matter, and report back to me\". Mr Trump quoted figures suggesting 3,100 Christians had been killed in Nigeria, but did not state any source for the numbers or timeframe. He stated: \"We stand ready, willing, and able to save our Great Christian population around the World!\" Nigeria now joins North Korea, Russia, Saudi Arabia, Iran, Pakistan and China on a list of countries \"of particular concern\" due to violations of religious freedom. The move is one step before possible sanctions - which could mean a ban on all non-humanitarian aid. \n                  Donald Trump announces dramatic drop in US refugee intake, with most of them white South Africans\n                 \n                  Trump orders nuclear weapons tests as he meets Xi\n                 \n                  Trump's upbeat opinion of his meeting with Xi brushes over thornier issues\n                 The Nigerian government has vehemently rejected the claims. Analysts have said that, while Christians are among those targeted, the majority of victims of armed groups are Muslims in the country's Muslim-majority north, where the most attacks take place. Mr Trump's move follows efforts by Republican senator Ted Cruz to get fellow evangelical Christians to lobby Congress over claims of \"Christian mass murder\" in Nigeria. Boko Haram - which kidnapped more than 270 schoolgirls in 2014 - is the main group cited in previous warnings by US and international governments. The group has committed \"egregious violations of religious freedom\", according to a 2021 report by the bipartisan US Commission on International Religious Freedom. It said more than 37,000 people had been killed by Islamist groups in Nigeria since 2011. Read more from Sky News:Trump accused of 'new low point' with refugee orderTrump says China tariffs will be cut after 'amazing' meeting Churches and Christian neighbourhoods have been targeted in the past, but experts say Muslims are the most common victims of Boko Haram attacks, which routinely target the police, military and government. Other groups operating said to be operating in the country include Boko Haram offshoot Islamic State in West Africa Province (ISWAP). About half of Nigeria's population is estimated to be Muslim, who mostly live in the north, with roughly the other half following Christianity. US travellers are currently urged to \"reconsider\" travel to Nigeria due to a threat of terrorism, crime, kidnapping and armed gangs. The UK advises its citizens along similar lines."
    },
    {
        "title": "Serbia protests: Thousands gather as student-led movement marks anniversary of Novi Sad tragedy",
        "description": "Tens of thousands of people are expected to gather to mark the anniversary of a major disaster in Serbia, a year after a canopy collapsed outside a train station and killed 16 people.",
        "url": "https://news.sky.com/story/serbia-protests-thousands-gather-as-student-led-movement-marks-anniversary-of-novi-sad-tragedy-13461564",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-seriba-serbia-protest_7068305.jpg?20251031223904",
        "type": "World",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-10-31 22:19:00",
        "Headline": "Students have spent 16 days walking across the country, one day for each of the people who died when a train station canopy collapsed last year.",
        "Content": "\n          Europe correspondent\n              @AliBunkallSKY\n  Tens of thousands of people are expected to gather to mark the anniversary of a major disaster in Serbia, a year after a canopy collapsed outside a train station and killed 16 people. The incident in the northern town of Novi Sad sparked nationwide protests, led by students angry that the tragedy was the consequence of government corruption and cost-cutting. The protest movement, which has grown in size, initially wanted accountability for the tragedy but is now calling for new elections and democratic reform. It has rocked a country which has a long history of anti-government protests. Serbia's prime minister resigned in January along with other government ministers, but so far nobody has been charged or tried in connection with the roof collapse. The protests have been mostly peaceful, although there have been sporadic moments of violence with each side blaming the other for causing it. Hundreds of protesters have been arrested at major gatherings including at a huge demonstration held in Belgrade last March. A series of marches will converge in Novi Sad on Saturday, following 16 days of walking across the country - a day for each of the people who died. Huge crowds were also seen in the town on Friday night. The march has brought more visibility to the student movement, which has been locked in disagreement with the Serbian government for the past year. \n                  Shots fired outside Serbian parliament as fire breaks out\n                 \n                  Tear gas deployed as protesters clash with Serbian police in latest violent demonstration\n                 \n                  Riot police clash with protesters calling for end to Serbian president's rule\n                 \"We have made a huge difference,\" Luka, a student, told us. \"We can see a lot more people are politically active. I can see a lot more people are willing to change, and that's a huge step forward.\" \"We are going to continue to fight against our corrupt government,\" said another protester, Andjela. The demonstrators have been cheered and supported as they've passed through villages and towns, in a sign that the demonstrators are gathering widespread support. People have also given them free food and medical treatment. \"These kids are fighting for values that are normal throughout the world,\" a war veteran on the walk said to us. \"We have laws, but they are not respected, they exist only as dead letters on paper. Crime has prevailed here, especially within state institutions and we must fight against that.\" Train lines between Belgrade and Novi Sad were shut on Friday after a reported bomb scare. Some believe it was an attempt to prevent people from travelling to Novi Sad for the anniversary. Speaking on the eve of the commemorative event, Serbia's President Aleksandar Vucic played down the protests and vowed there would be no change of government. But he did announce a national day of mourning starting at midnight on Friday. The mass protests have also put a spotlight on media freedom in Serbia. News organisations writing or broadcasting criticism of the government, or even just reporting on the student protests, say they have been singled out and targeted. Igor Bozic, news director at the N1 news channel, said: \"The president repeated so many times we are terroristic media, we are enemy of the state and he is targeting us, not only N1 but by also pointing out reporters and anchors, and claiming they're people who don't like this country. \"Immediately that produces a huge number of threats to us because that kind of narrative comes directly from the first man of the country.\" The European Union, which Serbia is hoping to join, has also been critical of the country's approach to independent media, saying only last week that further reforms are needed.  But Serbia's minister for European integration defended his government's handling of the media and the protests, and suggested some news organisations are deliberately destabilising the country. \"I wouldn't say they [anti-government media outlets] are a threat to national security,\" Nemanja Starovic said, \"but on the other hand you have illegal activities and 25,000 illegal political gatherings that are not suppressed but nevertheless they are illegal, and then you have media outlets that are not just covering but participating in gathering and organising such events. \"That is something we cannot support. That is the fact of life we are witnessing here.\""
    },
    {
        "title": "CCTV footage shows dramatic moment train crashes into lorry at Dutch level crossing",
        "description": "CCTV footage showing a train dramatically crashing into a lorry at a level crossing has been released in the hopes it will serve as a warning to drivers.",
        "url": "https://news.sky.com/story/cctv-footage-shows-dramatic-moment-train-crashes-into-lorry-at-level-crossing-13461441",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-train-lorry-crash_7068188.png?20251031200335",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-31 20:29:00",
        "Headline": "The video \"shows how quickly things can go wrong at a railway crossing and is shocking to watch\", the train operator has said.",
        "Content": " CCTV footage showing a train dramatically crashing into a lorry at a level crossing has been released in the hopes it will serve as a warning to drivers. The collision occurred in the Dutch village of Meteren, around 70km southeast of Amsterdam, on Thursday. Train operator ProRail said five people sustained injuries in the crash - adding it was releasing the video to \"prevent this from happening again\". The train's 200 passengers were evacuated and taken to the nearby Den Bosch station, local media reported. In the footage, a lorry going across the level crossing can be seen reversing after a car approaches from the opposite direction. As the driver tries to manoeuvre their HGV to safety, the crossing's lights begin flashing and the barriers start coming down - before the train fast approaches and smashes into the back of the lorry. Read more:1,000 objects stolen in heistWhy Andrew is still in line for throne ProRail said the footage \"shows how quickly things can go wrong at a railway crossing and is shocking to watch\". Another video posted on its Instagram shows the extensive and ongoing clean-up efforts to remove the lorry's contents - thousands of pears - from the track and the surrounding area, as well as the damage to the train. Drivers of large vehicles are advised to drive through safety barriers if they find themselves stuck on level crossings, while those in cars are told to focus on getting all passengers out of their vehicle and to safety."
    },
    {
        "title": "Prosecutors get new information about 2007 murder of Meredith Kercher in Perugia",
        "description": "New information has been received about the 2007 murder of British student Meredith Kercher, sources have confirmed to Sky News.",
        "url": "https://news.sky.com/story/prosecutors-get-new-information-about-2007-murder-of-meredith-kercher-in-perugia-13461508",
        "image_url": "https://e3.365dm.com/19/02/1920x1080/skynews-meredith-kercher-student_4590723.jpg?20190226172709",
        "type": "World",
        "Author": "Simone Baglivo, Europe producer",
        "Date Published": "2025-10-31 22:52:00",
        "Headline": "The infamous case made headlines for years and eventually saw Amanda Knox and her  former boyfriend fully exonerated.",
        "Content": "By Simone Baglivo, Europe producer  New information has been received about the 2007 murder of British student Meredith Kercher, sources have confirmed to Sky News. The sources - from Perugia prosecutor's office - said a decision had not yet been made on whether to formally open a new investigation. The tip came from former Perugia prosecutor Giuliano Mignini, who led the original investigation into the 21-year-old's murder in the Italian university town. According to newspaper La Stampa, Mr Mignini has reported the name of a new potential suspect who allegedly fled Italy \"a few days\" after the murder. \"There are indications that this person may be implicated. It's someone I've never considered before,\" Mr Mignini told the publication. The former prosecutor said he was given the name from a source he considers \"reliable\". Mr Mignini first told Sky News about the possibility of a culprit still at large last year. \"There may still be a culprit who took part in the murder and who has not been discovered yet,\" he said. Rudy Guede, from the Ivory Coast, was convicted in 2008 of the sexual assault and murder of Ms Kercher. His DNA was found at the scene. He was released from prison in 2021 after serving 13 years of a 16-year term. Amanda Knox - along with her ex-boyfriend Raffaele Sollecito - was also convicted of the murder of her British roommate, before being acquitted and then fully exonerated by Italy's Supreme Court. Read more from Sky News:Dramatic moment train crashes into lorry at level crossingHurricane Melissa: Before and after images of Jamaica In an exclusive interview with Sky's Italian news channel in 2024, Ms Knox said she had been \"unjustly accused for 17 years\" and had not killed anyone. Mr Mignini did not immediately respond to requests for comment."
    },
    {
        "title": "Military deployed to enforce curfew after tensions boil over during Tanzania election",
        "description": "The Tanzanian military has been deployed to enforce a curfew after tensions boiled over during the east African country's presidential election.",
        "url": "https://news.sky.com/story/military-deployed-to-enforce-curfew-after-tensions-boil-over-during-tanzania-election-13461153",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-protest-tanzania-election_7067695.jpg?20251031103725",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-31 09:42:00",
        "Headline": "Buses and petrol stations set on fire and polling stations vandalised during unrest",
        "Content": "The Tanzanian military has been deployed to enforce a curfew after tensions boiled over during the east African country's presidential election. Critics of President Samia Suluhu Hassan and his Chama Cha Mapinduzi party, which has ruled since independence in 1961, protested over the harassment of opposition leaders, claiming election choices had been limited.In response to the rioting, internet services were cut and a curfew announced in the commercial capital Dar es Salaam. Tundu Lissu, the leader of the main opposition Chadema party, is currently in prison facing charges of treason, after calling for electoral reform.In addition, the candidate of the second-largest opposition party was barred from running. Amnesty International said it had verified cases of enforced disappearances, arbitrary arrests and extrajudicial killings ahead of the polls, while the US embassy issued a security alert citing \"country-wide\" protests. Hundreds of protesters in the Kimara and Ubungo areas set a bus and a petrol station ablaze, while polling stations were reportedly vandalised outside the capital Dodoma. Tanzania has more than 37 million registered voters, but there have been reports of widespread voter apathy, with low turnout reported. Critics said Ms Hassan, who is seeking her first full term as president, will cruise to victory unchallenged. \n                  'Send help': The desperate pleas from Hurricane Melissa survivors\n                 \n                  Donald Trump calls Nigeria 'country of particular concern' due to 'slaughter' of Christians\n                 \n                  Ukraine war latest: Kyiv claims attacks on more than 150 energy sites - as Russia uses 'secret' missile\n                 Sixteen opposition candidates representing smaller parties are also on the ballot.One university student, James Matonya, told The Associated Press he did not vote because the election was a \"one-horse race\". Human rights organisations have long accused Tanzania's administration of arresting, detaining and intimidating critics and opposition members. Read More:'Send help': The desperate pleas from Hurricane Melissa survivorsTens of thousands killed in two days in Sudan city, analysts believe The electoral commission has up to seven days to announce the final outcome. The president and ruling party have not commented."
    },
    {
        "title": "Donald Trump calls Nigeria 'country of particular concern' due to 'slaughter' of Christians",
        "description": "Donald Trump has said he is designating Nigeria a \"country of particular concern\" as \"thousands of Christians\" are being killed there.",
        "url": "https://news.sky.com/story/donald-trump-calls-nigeria-country-of-particular-concern-due-to-slaughter-of-christians-13461480",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-donald-trump_7068213.jpg?20251031202710",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-31 20:08:00",
        "Headline": "Nigeria joins North Korea, Saudi Arabia, Iran and China on a list of countries \"of particular concern\" due to violations of religious freedom.",
        "Content": "Donald Trump has said he is designating Nigeria a \"country of particular concern\" as \"thousands of Christians\" are being killed there. Posting on Truth Social, he said radical Islamists are committing \"mass slaughter\" and Christianity is \"facing an existential threat\" in the West African nation. The US president said he was asking officials to \"immediately look into this matter, and report back to me\". Mr Trump quoted figures suggesting 3,100 Christians had been killed in Nigeria, but did not state any source for the numbers or timeframe. He stated: \"We stand ready, willing, and able to save our Great Christian population around the World!\" Nigeria now joins North Korea, Russia, Saudi Arabia, Iran, Pakistan and China on a list of countries \"of particular concern\" due to violations of religious freedom. The move is one step before possible sanctions - which could mean a ban on all non-humanitarian aid. \n                  Donald Trump announces dramatic drop in US refugee intake, with most of them white South Africans\n                 \n                  Trump orders nuclear weapons tests as he meets Xi\n                 \n                  Trump's upbeat opinion of his meeting with Xi brushes over thornier issues\n                 The Nigerian government has vehemently rejected the claims. Analysts have said that, while Christians are among those targeted, the majority of victims of armed groups are Muslims in the country's Muslim-majority north, where the most attacks take place. Mr Trump's move follows efforts by Republican senator Ted Cruz to get fellow evangelical Christians to lobby Congress over claims of \"Christian mass murder\" in Nigeria. Boko Haram - which kidnapped more than 270 schoolgirls in 2014 - is the main group cited in previous warnings by US and international governments. The group has committed \"egregious violations of religious freedom\", according to a 2021 report by the bipartisan US Commission on International Religious Freedom. It said more than 37,000 people had been killed by Islamist groups in Nigeria since 2011. Read more from Sky News:Trump accused of 'new low point' with refugee orderTrump says China tariffs will be cut after 'amazing' meeting Churches and Christian neighbourhoods have been targeted in the past, but experts say Muslims are the most common victims of Boko Haram attacks, which routinely target the police, military and government. Other groups operating said to be operating in the country include Boko Haram offshoot Islamic State in West Africa Province (ISWAP). About half of Nigeria's population is estimated to be Muslim, who mostly live in the north, with roughly the other half following Christianity. US travellers are currently urged to \"reconsider\" travel to Nigeria due to a threat of terrorism, crime, kidnapping and armed gangs. The UK advises its citizens along similar lines."
    },
    {
        "title": "Orlando airport close to cancelling all landings due to US government shutdown",
        "description": "Orlando airport, one of America's most popular travel hubs, came close to cancelling all landings after the government's shutdown caused a last-minute scramble for air traffic controllers.",
        "url": "https://news.sky.com/story/orlando-airport-close-to-cancelling-all-landings-due-to-us-government-shutdown-13461058",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-disney-world-orlando_7067444.jpg?20251031015132",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-31 01:27:00",
        "Headline": "The US government shutdown has been going on for more than four weeks, with Republicans and Democrats failing to agree on a funding package. It's left federal workers, including airport staff, without pay.",
        "Content": "Orlando airport, one of America's most popular travel hubs, came close to cancelling all landings after the government's shutdown caused a last-minute scramble for air traffic controllers. The Federal Aviation Administration (FAA) had announced on Thursday evening there would be \"no certified controllers for a period of time\" which would \"prevent landings\". It later reversed the order when enough staff were found, but flights in and out of Orlando - home of Disney World and Universal Studios theme parks - faced delays, some up to 90 minutes. There were also delays at Dallas/Fort Worth and Washington DC airports. FlightAware, a flight tracking website, said nearly 6,000 flights had been delayed and 1,100 cancelled nationwide on Thursday, impacting 20% of flights at United Airlines, American Airlines, Southwest Airlines and Delta Air Lines. Since the US government shutdown began on 1 October, more than 13,000 air traffic controllers have been required to work without pay. Some are taking second jobs to make ends meet, and the number calling in sick has increased. What's going on? In the US, a shutdown happens when funding legislation required to finance the federal government is not agreed on before the next fiscal year begins. This is usually due to political differences over what to spend budgets on. During President Donald Trump's first term in 2018, there was a 35-day shutdown caused by a dispute over expanding barriers on the US-Mexico border. This time, Republicans and Democrats are tussling over a bill that would make health insurance cheaper for millions of Americans and over a reversal of Mr Trump's cuts to Medicaid, a programme that makes healthcare more affordable for the disadvantaged or those on low incomes. As a result of a shutdown, federal workers such as military personnel, secret service agents, NASA, government workers, air traffic controllers, even National Parks staff are either furloughed or required to work for no pay. Explainer: What exactly is a US 'shutdown'? US Transport Secretary Sean Duffy said this week that 44% of flight delays on Sunday and 24% on Monday were caused by air traffic controller absences, compared to 5% on average before the shutdown. The FAA is about 3,500 air traffic controllers short of targeted staffing levels and many had been working mandatoryovertime and six-day weeks even before the shutdown."
    },
    {
        "title": "Thieves steal more than 1,000 items from museum's collection in 'brazen' heist",
        "description": "Thieves have stolen more than 1,000 items from a museum's collection in California, including jewellery, carvings and Native American artefacts.",
        "url": "https://news.sky.com/story/thieves-steal-more-than-1000-items-from-museums-collection-in-brazen-heist-13461184",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-stolen-art-tusks_7067746.png?20251031120640",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-31 10:37:00",
        "Headline": "The burglary took place at the Oakland Museum of California's storage facility with Native American artefacts and jewellery taken.",
        "Content": "Thieves have stolen more than 1,000 items from a museum's collection in California, including jewellery, carvings and Native American artefacts.  The burglary took place at an off-site storage facility holding items for the Oakland Museum of California (OMCA) on 15 October. The museum's director said on Thursday details about the incident were being made public because the items might show up at flea markets, pawn shops and antique stores. \"The theft that occurred represents a brazen act that robs the public of our state's cultural heritage,\" said Lori Fogarty. \"They're not just a loss to the museum. They're a loss to the public, to our community and we're hoping our community can help us bring them home.\" She also said she believed it was an opportunistic crime, rather than a targeted raid. \"We think the thieves found a way to enter the building, and they grabbed what they could easily find and snatch and get out of the building with,\" she said. A metal neckpiece by the late artist Florence Resnikoff, scrimshaw walrus tusks and Native American baskets were taken, with the thieves also making off with historic memorabilia like pins and sporting items. Experts believe some items may have already been sold. John Romero, a retired police captain, told the Los Angeles Times he expects detectives are looking at resale platforms such as Craigslist and Ebay, as well as networks specialising in historic or collectable goods. \"These people are interested in fast cash, not the full appraisal value,\" he said. \"They need to get rid of it quickly.\" Oakland Police Department is working with a specialist art crime unit of the FBI to track down the items. Read more from Sky News:Trump accused of 'new low point' with refugee orderHoliday hotspot airport close to cancelling all landings The OMCA's mission is to document the art, history and natural environment of the Golden State. Its collection carries works by famous Californian artists from the 18th century to present day. The theft at the OMCA took place four days before the brazen jewellery heist at the Louvre museum in France.   Thieves broke into the world-famous Paris museum while it was open to visitors on 19 October and made off with several Napoleonic crown jewels.  Authorities have made five arrests but the stolen items have not yet been recovered."
    },
    {
        "title": "'Significant' step in establishing national restorative justice programme for Post Office victims",
        "description": "A \"significant\" step has been taken in establishing a national restorative justice programme for victims of the Post Office's Horizon IT scandal.",
        "url": "https://news.sky.com/story/significant-step-in-establishing-national-restorative-justice-programme-for-post-office-victims-13461213",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-post-office-sign_7068058.jpg?20251031171735",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-10-31 11:27:00",
        "Headline": "Long-sought family involvement is included in the proposal, as is partial funding by Fujitsu, and an acknowledgement by the organisers that action \"beyond financial compensation\" is needed. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n A \"significant\" step has been taken in establishing a national restorative justice programme for victims of the Post Office's Horizon IT scandal. Children of affected postmasters, as well as those directly hit by the faulty accounting software, will be part of the partially Fujitsu-funded programme, as the UK's Restorative Justice Council acknowledged more than financial compensation was needed. Money blog: Holidays blow as pound takes another battering  Data from the Fujitsu-made Horizon computer program led to the wrongful prosecution of more than 700 postmasters for theft and false accounting, while many more racked up large debts, lost homes, livelihoods and reputations as they borrowed heavily to plug the incorrectly generated shortfalls in their branches. As part of the inquiry into the scandal, its chair, Sir Wyn Williams, recommended the government, the Post Office and Fujitsu engage in a formal restorative justice plan to provide \"full and fair redress Restorative justice aims to repair harm by bringing together victims and those responsible. \n                  Victims of Post Office Capture scandal say they are being treated as 'second-class' citizens\n                 \n                  First ever compensation scheme launched for postmasters affected by Capture IT scandal\n                 \n                  Post Office compensation 'worse than original injustice', victims' commissioner says\n                 Long-sought family involvement On Thursday, the Restorative Justice Council (RJC), which runs the project, said it would expand engagement to children and families of victims.  The move marked \"a significant advancement in the establishment of a national restorative justice programme for those impacted by the Post Office Horizon IT scandal\", the body said. Relatives have long sought acknowledgement and support for the harm they suffered.  Some have told Sky News how their eating disorder escalated due to the prosecution of a parent, and they carried trauma for decades. Calls for a family fund were made to redress the \"chances that were taken from us growing up\". What's involved? Online listening sessions for children of those affected and people previously unable to attend are planned in an effort to ensure all voices contribute to the restorative justice programme. Also involved in the initiative is equipping the government (via the Department for Business and Trade), Post Office and Fujitsu \"with the necessary skills and knowledge to engage in restorative dialogue with integrity\", the RJC said.  Group-based sessions with organisations involved in the scandal and a confidential safe space service for affected people to share their experiences and explore healing without the pressure of a formal process will be created.  Freelance restorative listeners are being recruited by the service for this purpose.  The formation of the scheme acknowledges the limitations of financial redress, with the RJC saying \"true restoration requires truth, acknowledgement, accountability and meaningful action beyond financial compensation\".  The funding question  The restorative listening and wellbeing service is being funded by Fujitsu. It comes amid questions as to the contribution of the Japanese multinational to redress. Fujitsu has said it is \"morally obligated\" to contribute to the costs, but the extent would be determined by the outcome of the Horizon scandal public inquiry. Further inquiry reports are to be released in the coming months.  The Post Office is government-owned and so it's taxpayers who fund victim payouts. What next? The RJC initiatives are pilot schemes for now. Feedback from them is intended to shape the design of a full, long-term, national restorative justice programme, due to launch in April. An updated report on restorative justice for Post Office victims will be published in January. \"The next phase is about translating their voices into real, restorative action - ensuring that healing, accountability and cultural change progress hand in hand,\" said RJC chief executive Jim Simon.   So far, 145 individuals have been involved, with an extra 200 postmasters expected to be engaged between November and March. \"Engagement is good and continues to grow,\" Mr Simon said."
    },
    {
        "title": "Former TGI Fridays chief in move to snap up UK chain ",
        "description": "The manager of the bulk of TGI Fridays' restaurants around the world has swooped to buy its British operations in a deal which preserves all 2,000 jobs at the chain.",
        "url": "https://news.sky.com/story/former-tgi-fridays-chief-in-move-to-snap-up-uk-chain160-13461324",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-tgi-fridays_6689517.jpg?20241006130825",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-31 15:25:00",
        "Headline": "Sugarloaf TGIF Management has swooped to buy the chain's British operations just over a year after they last changed hands, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The manager of the bulk of TGI Fridays' restaurants around the world has swooped to buy its British operations in a deal which preserves all 2,000 jobs at the chain. Sky News has learnt that Sugarloaf TGIF Management, run by former TGI Fridays chief executive Ray Blanchette, has struck a deal to take control of nearly 50 UK sites. Industry sources said the deal was likely to be announced within days. Money blog: Holidays blow as pound takes another battering The transaction will see TGI Fridays' UK arm form part of a growing international consolidation of the brand under Mr Blanchette. The British chain, which employs just over 2,000 people and is said to have a strong booking pipeline for the crucial festive trading period, was sold just over a year ago to Calveton UK and Breal Capital, two investment firms. The chain now operates from roughly the same number of restaurants as it did a year ago. \n                  Private equity backers call time on bar chain The Alchemist\n                 \n                  Greggs increasing prices due to higher employment costs\n                 \n                  Cote restaurant's owner cooks up fresh capital injection\n                 In a response to an enquiry from Sky News, a spokesperson for the two selling shareholders said: \"After a prolonged period of due diligence we are pleased to announce the sale of TGI Friday's UK to Sugarloaf, the manager and custodian of the worldwide brand. \"During the 12 months of our tenure we have stabilised the team and supply chains, as well as completing the first phase of repositioning the brand through a national relaunch on July 4th this year, which has seen improvements in both revenues and covers.\" The sale of the UK business comes during a tough period for the hospitality industry, which is grappling with a stagnating economy and the impact of tax rises in last year's budget. Rachel Reeves, the chancellor, is under intense pressure not to raise business taxes further when she unveils this year's budget late next month."
    },
    {
        "title": "More than 70 migrants returned to France under 'one in, one out' scheme",
        "description": "The government's 'one in, one out' swap deal with France has so far returned 75 migrants, while 51 people have arrived in the UK under the scheme. ",
        "url": "https://news.sky.com/story/more-than-70-migrants-returned-to-france-under-one-in-one-out-scheme-13461209",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-migrants-english-channel_7025462.jpg?20250919180422",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-31 15:35:00",
        "Headline": "In exchange, the UK has accepted 51 vetted migrants from France who came through legal channels.",
        "Content": "The government's 'one in, one out' swap deal with France has so far returned 75 migrants, while 51 people have arrived in the UK under the scheme.  Under the pilot scheme, enacted in August, the UK returns asylum seekers who cross the English Channel via small boat but accepts in exchange the same number of vetted asylum seekers who have come via legal means. The UK made the first removals in September, and on Friday said it had deported 20 more people on a flight this week and 13 last week. The government says its scheme aims to deter small-boat crossings by threatening those who take the journeys with detention and removal to France. Seeking asylum via boat is illegal under UK law, although international law states that seeking asylum is a legal right and there should not be any discriminatory distinction as to the method by which people try and flee persecution.  Read more about UK migration:Immigration not top of public's concerns, poll showsVietnamese migrants to be returned under new deal Prime Minister Sir Keir Starmer says the scheme is working so far, and \"on course\" to achieve the goal of reducing boat crossings. \n                  Newly-released emails show Andrew suggested 'catch-up' with Jeffrey Epstein after his prison release\n                 \n                  Should Prince Andrew Drive be renamed? Here's what residents think\n                 \n                  Ex-sergeant major jailed for sexually assaulting teenage soldier Jaysley Beck\n                 But that was undermined last week by reports that an asylum seeker who had been deported to France had returned to the UK on a small boat. Conservative leader Kemi Badenoch said the man's return to the UK shows the government is \"in total chaos\". He said he was at risk of persecution in France, which was why he had gone back to the UK. Authorities are working to deport him again. A Home Office spokesperson said: \"For many years, illegal migrants entered our country with no consequence. \"These returns send a warning to those considering entering this country illegally: if you come here by small boat, you can be sent back. \"We are scaling up these removals to France and will do whatever it takes to secure our borders.\" Some 36,954 people have crossed the Channel in small boats since the start of 2025, more than the 36,818 record in the whole of last year. French authorities say they have prevented more than 17,600 attempted crossings. Amid political pressure over the housing of asylum seekers, Sir Keir's government announced this week it plans to move people in asylum seeker hotels into military barracks instead. Shadow home secretary Chris Philp said: \"A handful of immigrants have now been returned to France through this deal whilst nearly 16,000 illegal immigrants have crossed the Channel since the deal was announced, meaning we have allowed 99.5% to stay. \"This is clearly no deterrent at all.\""
    },
    {
        "title": "Thieves steal more than 1,000 items from museum's collection in 'brazen' heist",
        "description": "Thieves have stolen more than 1,000 items from a museum's collection in California, including jewellery, carvings and Native American artefacts.",
        "url": "https://news.sky.com/story/thieves-steal-more-than-1000-items-from-museums-collection-in-brazen-heist-13461184",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-stolen-art-tusks_7067746.png?20251031120640",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-31 10:37:00",
        "Headline": "The burglary took place at the Oakland Museum of California's storage facility with Native American artefacts and jewellery taken.",
        "Content": "Thieves have stolen more than 1,000 items from a museum's collection in California, including jewellery, carvings and Native American artefacts.  The burglary took place at an off-site storage facility holding items for the Oakland Museum of California (OMCA) on 15 October. The museum's director said on Thursday details about the incident were being made public because the items might show up at flea markets, pawn shops and antique stores. \"The theft that occurred represents a brazen act that robs the public of our state's cultural heritage,\" said Lori Fogarty. \"They're not just a loss to the museum. They're a loss to the public, to our community and we're hoping our community can help us bring them home.\" She also said she believed it was an opportunistic crime, rather than a targeted raid. \"We think the thieves found a way to enter the building, and they grabbed what they could easily find and snatch and get out of the building with,\" she said. A metal neckpiece by the late artist Florence Resnikoff, scrimshaw walrus tusks and Native American baskets were taken, with the thieves also making off with historic memorabilia like pins and sporting items. Experts believe some items may have already been sold. John Romero, a retired police captain, told the Los Angeles Times he expects detectives are looking at resale platforms such as Craigslist and Ebay, as well as networks specialising in historic or collectable goods. \"These people are interested in fast cash, not the full appraisal value,\" he said. \"They need to get rid of it quickly.\" Oakland Police Department is working with a specialist art crime unit of the FBI to track down the items. Read more from Sky News:Trump accused of 'new low point' with refugee orderHoliday hotspot airport close to cancelling all landings The OMCA's mission is to document the art, history and natural environment of the Golden State. Its collection carries works by famous Californian artists from the 18th century to present day. The theft at the OMCA took place four days before the brazen jewellery heist at the Louvre museum in France.   Thieves broke into the world-famous Paris museum while it was open to visitors on 19 October and made off with several Napoleonic crown jewels.  Authorities have made five arrests but the stolen items have not yet been recovered."
    }
]