[
    {
        "title": "Donald Trump reveals when - and where - he will meet Putin for Ukraine talks",
        "description": "Donald Trump has announced his \"highly anticipated\" meeting with Vladimir Putin will take place next Friday in the US state of Alaska.",
        "url": "https://news.sky.com/story/donald-trump-reveals-when-and-where-he-will-meet-putin-for-ukraine-talks-13408879",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-vladimir-putin_6985699.jpg?20250808155049",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-08 22:05:00",
        "Headline": "The two presidents are expected to discuss the conflict in Ukraine - but the war-torn country's leader Volodymyr Zelenskyy will not be at the meeting.",
        "Content": " Donald Trump has announced his \"highly anticipated\" meeting with Vladimir Putin will take place next Friday in the US state of Alaska. The two presidents are expected to discuss the war in Ukraine - with the talks potentially leading to a breakthrough in Mr Trump's effort to end the conflict. But there's no guarantee it will stop the fighting since Moscow and Kyiv remain far apart on their conditions for peace. Earlier, the US president told reporters \"we're getting very close to a deal\" that would end the war. Mr Trump added there will be \"some swapping of territories to the betterment of both sides\". Follow latest: Ukraine war live updates  The meeting between the two leaders will be the first US-Russia summit since 2021, when former US President Joe Biden met Mr Putin in Switzerland. \n                  Chris Hemsworth describes 'gear shift' after learning he's 10 times more likely to get Alzheimer's\n                 \n                  Trump's Ukraine deadline for Putin arrives - as uncertainty remains over possible meeting\n                 \n                  Apollo 13 astronaut Jim Lovell dies\n                 Mr Trump wrote on Truth Social: \"The highly anticipated meeting between myself, as President of the United States of America, and President Vladimir Putin, of Russia, will take place next Friday, August 15, 2025, in the Great State of Alaska. Further details to follow. Thank you for your attention to this matter!\" The meeting was also confirmed by Kremlin aide Yury Ushakov, who said the leaders will \"focus on discussing options for achieving a long-term peaceful resolution to the Ukrainian crisis\". He added that the two presidents could meet in Russia in future and that an invitation has already been extended to Mr Trump. Yesterday, Mr Trump had told reporters at the White House that he couldn't announce where or when the meeting would take place but he would do so soon. He also suggested that his meeting with the Russian leader could come before any discussion involving Ukrainian President Volodymyr Zelenskyy. \"We're going to have a meeting with Russia, start off with Russia. And we'll announce a location. I think the location will be a very popular one,\" Mr Trump said. The US president added: \"President Putin, I believe, wants to see peace, and Zelenskyy wants to see peace ... in all fairness to President Zelenskyy, he's getting everything he needs to, assuming we get something done.\" Read more:Russia reacts to Trump talks planJD Vance raises concerns about free speech in UK Territory to form part of talks Speaking about the role that territory will play in the peace talks, Mr Trump said: \"You're looking at a territory that's been fought over for three-and-a-half years. A lot of Russians have died. A lot of Ukrainians have died. \"So we're looking at that, but we're actually looking to get some back, and some swapping. \"It's complicated, actually. Nothing is easy. It's very complicated. But we're going to get some back. \"We're going to get some switched. There'll be some swapping of territories to the betterment of both.\" Analysts, including some close to the Kremlin, have suggested that Russia could offer to give up territory it controls outside of the four regions it claims to have annexed. Pressed on if this was the last chance to make a major peace deal, Mr Trump said: \"I don't like using the term last chance ... when those guns start going off, it's awfully tough to get them to stop.\"  Western officials 'to meet in UK' Meanwhile, senior officials from the US, Ukraine and several European countries are due to meet in the UK this weekend to try and reach common positions ahead of the Trump-Putin meeting, according to Axios. Ukraine and several NATO allies are reported to be privately concerned that Mr Trump might agree to Mr Putin's proposals for ending the war without taking their positions into consideration. Since his return to the White House in January, Mr Trump has moved to mend relations with Russia and sought to end the war - with public comments veering between admiration and sharp criticism of Mr Putin. In a sign of his growing frustration with Russia's refusal to halt its military offensive, Mr Trump had threatened to impose new sanctions and tariffs against Moscow - and countries that buy its exports - unless the Kremlin agreed to end the conflict. A deadline was set for yesterday, but it is unclear whether these sanctions are taking effect, or if they will be delayed or cancelled in light of the talks. War grinds on ahead of talks The meeting has been arranged as Russia's bigger army is slowly advancing deeper into Ukraine at great cost in troops and armour while it relentlessly bombards Ukrainian cities. Ukrainian forces are locked in intense battles along the 620-mile frontline that snakes from northeast to southeast Ukraine. The Pokrovsk area of the eastern Donetsk region is taking the brunt of punishment as Russia seeks to break out into the neighbouring Dnipropetrovsk region."
    },
    {
        "title": "A father criticised the use of airdrops in Gaza. Five days later, he was killed by a falling package",
        "description": "Five days before he was killed by a falling aid package, father-of-two Uday al Qaraan called on world leaders to open Gaza's borders to food - and criticised the use of airdrops.",
        "url": "https://news.sky.com/story/gaza-medic-killed-by-airdrop-as-system-delivers-miniscule-aid-13408270",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-dandf-teaser-gaza_6984995.png?20250807173046",
        "type": "Home",
        "Author": "Ben van der Merwe and Lina-Serene, Data and Forensics Unit",
        "Date Published": "2025-08-08 23:33:00",
        "Headline": "Sky News analysis has found that airdrops are making little difference to Gaza's hunger crisis, and pose serious risks to the population.",
        "Content": "By Ben van der Merwe and Lina-Serene, Data and Forensics Unit  Five days before he was killed by a falling aid package, father-of-two Uday al Qaraan called on world leaders to open Gaza's borders to food - and criticised the use of airdrops. \"This isn't aid delivery,\" said the 32-year-old medic as a crowd of children rummaged through the remains of an airdrop behind him. \"This is humiliation.\" Using footage from social media, satellite imagery, eyewitness testimony and flight tracking data, Sky News has examined the dangers posed by airdrops - and just how little difference they are making to Gaza's hunger crisis. A tangled parachute and a crowd in chaos Based on six videos of the airdrop that killed Uday, we were able to locate the incident to a tent camp on the coast of central Gaza. We determined that the drop occurred at approximately 11.50am on 4 August, based on metadata from these videos shared by three eyewitnesses. Flight tracking data shows that only one aid plane, a UAE Armed Forces C-130 Hercules, was in the area at that time. Footage from the ground shows 12 pallets falling from the plane. The four lowest parachutes soon become tangled, and begin to fall in pairs. As a crowd surges towards the landing zone, a gunshot rings out. Nine more follow over a 90-second period. Sakhr al Qaraan, an eyewitness and Uday's neighbour, says that Uday was among those running after the first pallet to land. \"He didn't see the other pallet it was tangled up with, and it fell on him moments later,\" says Sakhr. \"People ran to collect the aid in cold blood, devoid of humanity, and he suffocated under that damned blanket - under the feet of people who had lost all humanity.\" The scene descended into chaos as Palestinians, some armed, tussled over the limited food available. By the time Uday was pulled from the crowd and rushed to hospital, it was too late. The UAE Ministry of Foreign Affairs did not respond to a request for comment. Parachutes failed in half of airdrops analysed This was not the first time that airdrops at this location had posed a threat to those on the ground. The day before Uday was killed, the same plane had dropped aid over the site. The footage below, shared by the UAE Armed Forces, shows the view from inside the plane. Just before the footage ends, it shows that one of the parachutes was broken. Hisham al Armi recorded the scene from the ground. His video shows the broken parachute, as well as another that had failed completely. Military planes dropped aid at the site on eight consecutive days between 30 July and 6 August. Sky News verified footage showing parachute failures during four of those eight airdrops. Flight tracking data shows that almost all of the 67 aid flights over that period followed a similar route along the coast, which is densely packed with tent camps. An Israel Defence Forces (IDF) official told Sky News that the airdrops are routed along the coast, because this is where much of Gaza's population is now concentrated. An IDF spokesperson added the Israeli military \"takes all possible measures to mitigate the harm to uninvolved civilians\". Hisham al Armi told Sky News he is grateful to the countries that donated the aid, but \"the negatives outweigh the positives\". \"Fighting occurs when aid is dropped, and some people are killed ... due to the crush and parachutes.\" Other dangers are also posed by the airdrops. The footage below, taken on 29 July, shows Palestinians venturing into the sea in order to chase aid that had drifted over the water. The IDF has banned Palestinians from entering the sea. One woman, a relative of Uday who witnessed his death, described the airdrops as the \"airborne humiliation of the people\". \"There is not enough aid for them,\" she said. \"It creates problems among the people, and some are killed just to obtain a little aid. And most people don't receive any aid, they remain hungry for days.\" Between 27 July and 1 August, Gaza received an estimated 1,505 tonnes of food aid per day via land routes - 533 tonnes short of what the UN's food security agency says is needed to meet basic needs. Based on flight tracking data, we estimated that airdrops added just 38 tonnes daily, 7% of the shortfall. \"The quantities involved are minuscule in terms of the scale of the need,\" says Sam Rose, Gaza director of UNRWA, the UN agency previously responsible for distributing food in the territory. UNRWA claims it has enough food stationed outside of Gaza to feed the population for three months, but that Israel has not allowed the agency to bring in any food since 2 March. \"We should be dealing with that rather than introducing something else which is costly, dangerous, undignified and somehow legitimises ... the access regime by suggesting that we found a way round it through airdrops,\" Rose says. COGAT, the Israeli agency responsible for coordinating aid deliveries, referred Sky News to a statement in which it said there is \"no limit on the amount of aid\" allowed into Gaza. An IDF spokesperson also denied restricting aid, and said the Israeli military \"will continue to work in order to improve the humanitarian response in the Gaza Strip, along with the international community\". In his interview five days before he was killed, Uday al Qaraan appealed to world leaders to open Gaza's borders. \"What would happen if they just let the aid in?\" he asked. \"If you can fly planes and drop aid from the sky then you can break the siege, you can open a land crossing.\" The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Apollo 13 astronaut Jim Lovell dies",
        "description": "Retired astronaut and the commander of the famous Apollo 13 mission, Jim Lovell, has died aged 97.",
        "url": "https://news.sky.com/story/apollo-13-astronaut-jim-lovell-dies-13408665",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lovell-astronaut_6985953.png?20250808203715",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-08 19:00:00",
        "Headline": "Jim Lovell went on four NASA spaceflights and helped turn the failed Apollo 13 moon mission into a triumph after managing to get back to Earth safely following an oxygen tank explosion.",
        "Content": "Retired astronaut and the commander of the famous Apollo 13 mission, Jim Lovell, has died aged 97. Lovell was one of NASA's most-travelled astronauts in the agency's first decade and flew four times - on Gemini 7, Gemini 8, Apollo 8 and Apollo 13. Lovell helped turn the failed Apollo 13 moon mission into a triumph after managing to get back to Earth safely following an oxygen tank explosion.   He was supposed to have become the fifth man to walk on the moon but the flight was thrown into jeopardy by the sudden explosion - which occurred when the spacecraft was 200,000 miles away from Earth. Lovell and the two other astronauts on board - Fred Haise and Jack Swigert - barely survived and spent four cold days in the cramped lunar module as a lifeboat while working with engineers and controllers on the ground to devise a rescue plan. In a post on X, NASA said: \"We are saddened by the passing of Jim Lovell, commander of Apollo 13 and a four-time spaceflight veteran. \"Lovell's life and work inspired millions. His courage under pressure helped forge our path to the Moon and beyond - a journey that continues today.\" The agency also shared a statement from Lovell's family, which read: \"We are enormously proud of his amazing life and career accomplishments, highlighted by his legendary leadership in pioneering human space flight. \"But, to all of us, he was Dad, Granddad, and the Leader of our family. Most importantly, he was our Hero. \"We will miss his unshakeable optimism, his sense of humour, and the way he made each of us feel we could do the impossible. He was truly one of a kind.\" NASA administrator Sean Duffy said Lovell's life and work \"inspired millions of people across the decades\". \"Jim's character and steadfast courage helped our nation reach the moon and turned a potential tragedy into a success from which we learned an enormous amount,\" he said. \"We mourn his passing even as we celebrate his achievements. \"From a pair of pioneering Gemini missions to the successes of Apollo, Jim helped our nation forge a historic path in space that carries us forward to upcoming Artemis missions to the moon and beyond.\" Read more:Remains of 9/11 victims identified 24 years onStar Wars actor settles Disney lawsuit Hollywood superstar Tom Hanks played Lovell in the 1995 film Apollo 13, bringing the astronaut renewed fame. In the movie, the line \"Houston, we have a problem\" is famously said by Hanks - but in real life, it was Swigert who spotted a warning light and said a slightly different sentence to Mission Control: \"Houston, we've had a problem here.\" The year of the film's release, Lovell was awarded the Congressional Space Medal of Honor by then US president Bill Clinton."
    },
    {
        "title": "Teenager guilty of murder of schoolboy Harvey Willgoose during lunch break",
        "description": "A 15-year-old boy has been found guilty of the murder of Sheffield schoolboy Harvey Willgoose.",
        "url": "https://news.sky.com/story/teenager-guilty-of-murder-of-schoolboy-harvey-willgoose-during-lunch-break-13406898",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-harvey-willgoose-sister_6982813.jpg?20250804155339",
        "type": "Home",
        "Author": "Katerina Vittozzi",
        "Date Published": "2025-08-08 11:28:00",
        "Headline": "Harvey, 15, was killed by a fellow student outside their school cafeteria on 3 February this year.",
        "Content": "\n          North of England correspondent\n              @kvittozzi\n  A 15-year-old boy has been found guilty of the murder of Sheffield schoolboy Harvey Willgoose. Harvey, also 15, was killed by a fellow student outside their school cafeteria in February this year. His parents, Mark and Caroline Willgoose, have told Sky News that school knife crime is \"a way of life for kids\". The defendant, who cannot be named for legal reasons, had brought a 13cm hunting knife with him into All Saints Catholic High School stabbing Harvey twice in the chest just a few minutes into the lunch break. CCTV, released by police after the boy's conviction, showed Harvey arriving at school, as well as earlier footage of the defendant trying to provoke Harvey, who the court heard remained \"peaceful\". Other footage showed the defendant holding a knife in the canteen prior to the stabbing. The boy had previously admitted manslaughter but denied murder. He was found guilty at Sheffield Crown Court on Friday by a majority verdict of 11 to one after 14 hours of jury deliberations. He will be sentenced in October, when the judge will also consider lifting his anonymity. The boy's defence told the court the defendant had \"lost control\", stabbing Harvey after years of bullying and \"an intense period of fear at school\". Moments after stabbing Harvey, he told teachers, \"you know I can't control it\" and \"I'm not right in the head\". Giving evidence, the boy told the court he had no recollection of the moment he killed Harvey, something the prosecution said was \"a lie\". They told the jury the schoolboy \"wanted to show he was hard\" and had become \"obsessed\" with weapons in the lead up to Harvey's death, with photographs of him posing with knives found on his phone. 'Our lives changed forever that day' Speaking outside court after the verdict, Harvey's sister Sophie Willgoose said in a family statement: \"On 3 February, we didn't just lose Harvey, we lost a part of ourselves. Our lives changed forever that day.\" She described him as \"full of life\", a \"warm, funny, caring boy who had a unique ability to bring people together\" and whose \"presence lit up every room\". \"This tragedy has not only devastated our family, it has rippled across the country. People everywhere continue to grieve the loss of our beautiful boy,\" she said. She thanked those who \"held Harvey as he took his last breaths\" and promised to raise awareness of the dangers of knife crime to ensure a \"better, safer future for us all\". Read more from Sky NewsBoy, 4, dies as he walks out of hospitalRestriction zones for dometic abusers introducedTributes to one-year-old girl Detective Inspector Joe Hackworthy, of South Yorkshire Police, the senior investigating officer in Harvey's case, also spoke outside court. \"This trial has been a heartbreaking reminder of the devastation knife crime causes in our communities,\" he said. \"It tears lives and families apart and that has never been more evident than in this tragic case. \"Tonight, one boy's family will spend another night grieving the unimaginable loss of their beloved son, while another boy's family will be living with the reality that their son faces a life behind bars for murder.\" He thanked the Willgoose family, who \"had to endure a lengthy trial because of the murderer's refusal to admit the full extent of what he did on that tragic day\". He urged parents and carers to have \"open and honest\" conversations with their children should they suspect they are carrying knives, or to tell someone they trust if they believe someone else they know is doing so. Chris Hartley, of the Crown Prosecution Service, expressed the organisation's \"huge sympathies\" for Harvey's family and friends. \"The CPS and South Yorkshire Police were able to prove that the defendant did not lose self-control but intended to deliberately attack 15-year-old Harvey,\" he said in a statement read outside court. \"We remind teenagers that there can be horrendous and serious consequences of carrying knives. It has been proven that if you carry these weapons, you are more likely to use them or be a victim of knife crime. You are putting yourself, other people and your future at risk.\" 'We led him into the lion's den' Speaking to Sky News ahead of today's verdict, Harvey's mother, Caroline Willgoose, said she felt she had \"led [her son] into the lion's den\". She said Harvey was a \"school avoider\" who had \"anxiety\" about going there. \"We badgered Harvey into going to school but I don't think people realise that there is a problem in all schools with knives,\" says Mrs Willgoose. \"It's a way of life now for kids, and it needs to stop.\" During the trial, it was revealed that the defendant had had previous violent outbursts at school, and, a few months before Harvey was stabbed, the school had called the police when the defendant's mother contacted them to say she had found a weapon in her son's bag at home. Harvey's parents told Sky News they feel that the school did not take previous knife-related incidents \"seriously enough\" and felt \"100%\" the outcome might have been different if they had. The head of St Clare Catholic Multi Academy Trust - a group of schools including All Saints - also told Sky News Harvey's death \"was an unimaginable tragedy for all\". Steve Davies said: \"We think especially of Harvey's family, loved ones and friends today. We cannot begin to imagine the immeasurable impact the loss of Harvey has had on them. \"Harvey was a much-loved, positive and outgoing pupil whose memory will be cherished by all who knew him. As a community, we have been devastated by his death, and we continue to think of him every day.\" He added: \"Harvey's death was an unimaginable tragedy for all, and one that understandably gives rise to a number of questions from his family and others. \"Now that the trial has finished, a number of investigations aimed at addressing and answering these questions will be able to proceed. We will engage fully and openly with them to help ensure every angle is considered and no key questions are left unresolved.\" Describing her son as \"a character\" who \"never stopped smiling, never stopped singing\", Mrs Willgoose said she was now campaigning for \"all schools and colleges\" to use knife arches. \"I want people to go into schools and talk about the devastation of what knife crime does.\" In an emotional interview, she said she felt her son was \"put here for a reason\" and \"I can't let go until I put things right for him\". \"There's no winners when it comes to knife crime,\" she said. The defendant \"has ruined his life, his parent have got an empty bed\", she added. \"He's got to live with this for the rest of his life.\" Harvey's father, Mark Willgoose, said that his son had had \"a short life, but a good life\". \"He crammed everything in, and you've just got to try and see the positives in that,\" Mr Willgoose added. \"Whatever happens in court, it'll never be justice. It'll never be enough. \"I think we've just got to make sure Harvey's death is not going to be in vain, and if whatever we do saves one life, then it's been worth us doing it.\""
    },
    {
        "title": "My experience interviewing Nicholas Rossi - the fugitive in Scotland now facing a rape trial in Utah",
        "description": "There was always a heavy hint of charade in the company of \"Arthur Knight\".",
        "url": "https://news.sky.com/story/my-experience-interviewing-nicholas-rossi-the-fugitive-in-scotland-now-facing-a-rape-trial-in-utah-13408450",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rossi-nicholas_6985620.jpg?20250808142305",
        "type": "Home",
        "Author": "James Matthews",
        "Date Published": "2025-08-08 05:15:00",
        "Headline": "The tale of \"Arthur Knight\" - real name Nicholas Rossi - was one lifted from the pages of a fictional thriller - a fugitive pursued halfway across the world and discovered only when he had the misfortune to catch COVID and leave his tattoos exposed on a hospital ward.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n  There was always a heavy hint of charade in the company of \"Arthur Knight\". It was hard to square the man presenting as a bumbling aristocrat in Glasgow's west end with one of America's most wanted. And yet, there were always clues. Like his knowledge of Kay Burley. On the day I first arranged to interview him, he told me that TV was a mystery to him and that he never watched it. Then he said he hoped he wouldn't be nailed to the wall by Kay - our then Sky News colleague and presenter. How did he know Kay if he knew nothing about television, I wondered. He also asked how we would \"chyron\" him, an American term for an on-screen title that I was unfamiliar with (and I'm in the business). There was also the matter of the plasma TV screen on his front room wall - he knew TV, alright. Such was the international interest in the story of \"Arthur Knight\" - real name Nicholas Rossi - there was no escaping the attention of TV and everyone else. His was a tale lifted from the pages of a fictional thriller - a fugitive pursued halfway across the world and discovered only when he had the misfortune to catch COVID and leave his tattoos exposed on a hospital ward. Medical staff at Glasgow's Queen Elizabeth University Hospital did the eyes-on execution of an international manhunt. As careful as he was, Rossi left a digital footprint that US authorities followed to a flat in Glasgow. When we first arrived, he had been arrested but was out on bail. It was dark inside his flat, and there wasn't much floor space. Read more from Sky News:Putin: 'I'm not against meeting Zelenskyy' - WatchOasis gig beats Taylor Swift for most 'ground-shaking' concert It made movement difficult for Rossi because he was in a wheelchair. When physical movement demanded finesse, like in lifting him into a car, his wife Miranda manoeuvred him Sumo-wrestler style. Quite the spectacle. We sat down for a number of interviews with Rossi and his wife, Miranda. Always, he addressed my questions with the busy eyes of concentrated deceit. Once, he insisted on sitting with his back to a bookcase. It featured the tome Machiavelli, prominently in shot. It made me wonder how much of him was enjoying this. He was a performer, certainly, and I suppose he'd been thrust centre stage. 👉 Listen to Sky News Daily on your podcast app 👈 He claimed to be an Irish orphan, but he never did get the accent right. It was like a comedy fake when he wrapped an Irish lilt around gravelly tones. He would suddenly start to sound Irish when you reminded him that he was, eh, Irish. Not that he had the paperwork to prove it. There was no birth certificate, no ID for his parents, no idea of exactly where in Ireland he'd been born. He was the boy from nowhere because he knew he had to be - give any journalist a place to go looking for confirmation and therein lies a trail to ruin. So \"Arthur\" kept it vague - his freedom depended on it. When he did commit to detail, he ran into difficulty. He told me he'd been raised in homes run by the Christian Brothers in Ireland, and I asked him which ones, specifically. His reply was: \"St. Mary's and Sacred Heart.\" A quick check with the Christian Brothers revealed they have no facility named Sacred Heart in Ireland, and anything called St Mary's wasn't residential. Of course, it was never going to last for him. The extradition court in Edinburgh had fingerprint and photographic evidence, and there was a tattoo match, too. Next week sees the start of his latest trial. He is accused of raping a woman to whom he had been engaged. The allegations offer a duplication for Rossi's crime modus operandi - isolating women, refusing to leave their company, and engaging in sexual assault. \"Evil,\" is how he was described by Brian Coogan to me. Brian is a former state representative in Rhode Island who, at one stage, was on the verge of adopting the young Rossi. He was warned off by the adoption judge, who refused to let it happen, having seen the file on the young man. Violence in childhood duly extended into adulthood, and Rossi was convicted in 2008 after sexually assaulting Mary Grebinski on a college campus in Ohio. A DNA sample from that attack is what linked Rossi to rape in Utah, and it's what caused the long arm of the law to reach as far as Scotland. The footnote to the story concerns Miranda, Rossi's wife, whom he married in Bristol in 2020. Rossi faked his death in 2020, and his \"widow\", a woman by the name of Louise, ran around telling people he'd passed away. Father Bernard Healey, of Our Lady of Mercy Parish Church in Rhode Island, took a call from an English woman - sounding like \"Hyacinth Bouquet\". She said Rossi had died and asked if he would hold a memorial mass. The priest agreed, but when the invitations started going out on social media, he took a call from the police telling him to cancel the arrangements, as Rossi wasn't dead - he'd faked it and was in hiding. The voice that rang round reporting news of Nicholas' demise was familiar to anyone who has heard his wife Miranda. The two voices sound identical, indeed. How much was Miranda involved in the deceit? It remains an open question in a story about to enter a new chapter - this time, set in an Utah courtroom."
    },
    {
        "title": "Friday night's anti-migrant protests in Norwich were peaceful - but anger is bubbling",
        "description": "Outside the Best Western Brook Hotel in Norwich around 300 anti-migrant protesters sang along to Sweet Caroline, Neil Diamond's song about good times never feeling so good, but that wasn't their message for the migrants living inside the hotel.",
        "url": "https://news.sky.com/story/friday-nights-anti-migrant-protests-in-norwich-were-peaceful-but-anger-is-bubbling-13408870",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-norwich-migrnats_6986127.jpg?20250808234340",
        "type": "Home",
        "Author": "Jason Farrell",
        "Date Published": "2025-08-08 21:31:00",
        "Headline": "The day had been dubbed \"Abolish Asylum Day\" with a call to action for protesters to come out across the county. Around 80 counter protesters also arrived on the scene. ",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n  Outside the Best Western Brook Hotel in Norwich around 300 anti-migrant protesters sang along to Sweet Caroline, Neil Diamond's song about good times never feeling so good, but that wasn't their message for the migrants living inside the hotel. In a town where average rents have increased faster than the rest of England, and hospital waiting times are some of the worst in the country, many who turned out complained about the cost of housing asylum seekers. Stuart, a Norfolk businessman holding a giant St George's flag, said: \"I see my company paying north of a hundred thousand pounds a year in tax and the money is not going back into our system, back into our NHS, when it takes two million pounds a year to keep one hotel open.\" In a theme that we've seen in protests across the country, residents also spoke of their fears for women and girls.  Protester Karen Williams said: \"I have seen with my own eyes school children being hassled from illegal males from this hotel. Being followed, asked for their phone numbers.\" A man who didn't want to be named added: \"That hotel could be full of terrorists. We don't know where they're from, they're undocumented males, all of a certain age. We've been invaded.\" Many wore T-shirts with slogans saying they were not far-right. Although a large portion of the crowd cheered when the name Tommy Robinson was hailed from the stage. The day had been dubbed \"Abolish Asylum Day\" with a call to action for protesters to come out across the country. Here, around 80 counter protesters also arrived on the scene and police used their vans and two lines of officers to create a green zone in the car park to separate the opposing groups. The hotel curtains were closed but no doubt the migrants inside could hear as on one side, a group determined to get rid of them, chanted, \"whose streets, our streets\", and sang Rule Britannia, while the other side's chants assured them: \"Refugees are welcome here.\" Counter protester Stuart said: \"It's unfair that these people are going to be intimidated like that and I want to show that not everybody in the UK thinks this way.\" Hayley, holding a banner which read, \"save our kids from fascists\", said: \"I live in this area, and I see these people every day and they do nothing wrong whatsoever. \"They genuinely are very sweet people who don't deserve what's happening.\" Another counter protester, Cate, said: \"They [migrants] are not who they are made out to be.\" \"I would trust them any day - far more than I would those people,\" she added, nodding towards the anti-migrant protesters. Read more:MP mistakes rowing team for migrant boatFirst migrants detained under return deal with France Organisers on both sides said they came in peace, and peaceful it was. But there is a bubbling anger. The Brook Hotel was taken over by the Home Office nearly three years ago and protests here, that only began this summer, are seeing their numbers grow."
    },
    {
        "title": "At least two dead as wildfires sweep across Greece, Turkey and France",
        "description": "A least two people have died and two others are reported to have died after wildfires tore across southern Europe.",
        "url": "https://news.sky.com/story/at-least-two-dead-as-wildfires-sweep-across-greece-turkey-and-france-13408773",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-athens-greece-wildfire_6985908.jpg?20250808200701",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-08 18:57:00",
        "Headline": "Fast-moving flames, fanned by strong winds, are approaching Athens while the Dardanelles was temporarily shut to shipping.",
        "Content": "A least two people have died and two others are reported to have died after wildfires tore across southern Europe. Fast-moving flames, fanned by strong winds, crossed scrub-covered hillsides in the Keratea region of Greece, getting close to residential areas around 25 miles southeast of Athens on Friday. One man was found dead in Keratea during an evacuation, the Fire Service said. Ukraine war latest - peace deal close - Trump  Two Vietnamese tourists died after falling in the water amid strong winds on the tourist island of Milos in the Cyclades, France24.com said, quoting the Coastguard. Authorities said 190 firefighters, using planes and helicopters to drop water, battled the blazes as thick clouds of black smoke filled the sky. Wildfires in neighbouring Turkey forced the temporary closure of the Dardanelles Strait to shipping because of heavy smoke and reduced visibility in the narrow waterway. A university campus and a care home for the elderly in northwestern Turkey were evacuated by authorities after another fire, which started in a field near Saricaeli village, in Canakkale province, quickly spread to a nearby forested area.  Firefighters in France who contained the country's largest wildfire in decades are on high alert because it is feared forecast high temperatures this weekend could reignite it. One person died as the blazes quickly burned more than 62 square miles in three days in the Aude wine region in southern France, where hundreds of residents were forced to leave their homes. Local authorities said they need to remain vigilant throughout the weekend because temperatures are expected to rise above 30C (86F) during another heatwave. Aude administrator Christian Pouget said 1,000 people had not yet been able to return to their homes after the fire swept through 15 communes in the Corbieres mountain region, destroying or damaging at least 36 homes. One person died at home and at least 21 others were injured, including 16 firefighters, officials said. Some 1,300 homes were still without electricity on Friday morning after infrastructure was extensively damaged, the Aude prefecture said. Residents have been warned not to return home without permission, as many roads remain blocked and dangerous. Those forced to flee have been housed in emergency shelters across 17 municipalities. Many fled to the community of Tuchan when the fire started on Tuesday, its mayor Beatrice Bertrand said. \"We have received and hosted over 200 people. We gave them food, thanks to local businesses who opened their stores despite it being very late,\" she said. \"Civil Protection brought us beds. And also the local villagers offered their homes to welcome them. It was their first night here and many were shocked and scared.\" Read more on Sky News:Gaza from above - 'barren and cropless'Apollo 13 astronaut dies An investigation is under way into the cause of the fire. Authorities said the fire was the largest recorded since France's national fire database was created in 2006, but the minister for ecological transition, Agnes Pannier-Runacher, went further, calling the blaze the worst since 1949 and linking it to climate change."
    },
    {
        "title": "JD Vance warns against UK going down 'dark path' of losing free speech during meeting with David Lammy",
        "description": "JD Vance has said he does not want the UK to go down a \"very dark path\" of losing free speech during a meeting with the foreign secretary at his country estate.",
        "url": "https://news.sky.com/story/jd-vance-warns-against-uk-going-down-dark-path-of-losing-free-speech-during-meeting-with-david-lammy-13408626",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jd-vance-us-vice-president_6985706.jpg?20250808155649",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-08 14:11:00",
        "Headline": "The vice president and the UK's foreign secretary held a televised meeting during the Vance family's summer holiday to England.",
        "Content": " JD Vance has said he does not want the UK to go down a \"very dark path\" of losing free speech during a meeting with the foreign secretary at his country estate. The US vice president has previously raised concerns that free speech is being eroded in the UK. However, during a two-day visit to David Lammy's grace and favour 115-room mansion, Chevening House in Kent, Mr Vance kept his criticism a bit more low key.  Asked about free speech in the UK during a televised meeting of the two men, Mr Vance said he has \"raised concerns\" about free speech in his own country and accused the West of \"censoring rather than engaging\" with different opinions. He said: \"I think the entire collective West, the transatlantic relationship, our NATO allies, certainly the United States under the Biden administration, got a little too comfortable with censoring rather than engaging with a diverse array of opinions. So that's been my view. \"Obviously, I've raised some criticism, concerns about our friends on this side of the Atlantic. \"But the thing that I'd say to the people of England or anybody else, to David, is many of the things that I worry most about were happening in the United States from 2020 to 2024. \"I just don't want other countries to follow us down what I think was a very dark path under the Biden administration.\" Mr Lammy, who has struck up the unlikely relationship over the past few months, did not comment on Mr Vance's indirect criticism. In February, when Sir Keir Starmer was carrying out a similar televised meeting with Donald Trump in the Oval Office, Mr Vance said \"infringements on free speech\" now do not just affect the British, but also American tech companies - \"and by extension American citizens\". Sir Keir quickly interjected, saying: \"We've had free speech for a very long time, it will last a long time, and we are very proud of that.\" Mr Vance and his family are staying with Mr Lammy at Chevening for two days before heading to the Cotswolds for a summer holiday. The vice president was effusive in his praise for the grand estate that comes with Mr Lammy's job, saying \"being here lifts up the human spirit\" as he thanked the \"people of England\" for having such a \"beautiful place for foreigners like me to come and talk about the issues of the day\". He added that he \"loves the UK\". Read more:MP alerts coastguard to 'migrants' - who were charity rowing teamHomelessness minister resigns after 'extortionate' rent hike claims The two politicians went fishing ahead of their meeting, with Mr Vance revealing he caught a few, while all three of his children caught a fish but Mr Lammy did not. He also said his children had fallen asleep on the floor of the large house, and his three-year-old daughter kept asking if she would see Mr Lammy's daughter. Mr Lammy posted a picture of him and Mr Vance laughing as they fished, saying it was a \"real pleasure\" to welcome the Vance family and the vice president \"gave me fishing tips, Kentucky style\". JD Vance confirmed he will holiday in Scotland next week in a trip that could see up to 1,000 police officers deployed as part of security efforts. He confirmed his Scottish trip during talks with Mr Lammy on Friday. Sky News understands the Vance family are likely to visit Ayrshire, the same area where Mr Trump recently stayed where he secured a trade deal with the European Union. Police sources have suggested approximately 1,000 officers will be working across the visit to ensure the vice president and his loved ones are safe, Sky News' Scotland correspondent Conner Gillies reported. Police Scotland declined to comment on the specifics. It is understood the Vance family will not be staying at Trump Turnberry, the luxury Ayrshire resort owned by the US president himself. A Police Scotland spokesperson said: \"Planning is under way for a potential visit to Scotland by the vice president of the United States. \"Details of any visit would be for the White House to comment on, however it is important that we prepare in advance for what would be a significant policing operation.\""
    },
    {
        "title": "Teenager guilty of murder of schoolboy Harvey Willgoose during lunch break",
        "description": "A 15-year-old boy has been found guilty of the murder of Sheffield schoolboy Harvey Willgoose.",
        "url": "https://news.sky.com/story/teenager-guilty-of-murder-of-schoolboy-harvey-willgoose-during-lunch-break-13406898",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-harvey-willgoose-sister_6982813.jpg?20250804155339",
        "type": "UK",
        "Author": "Katerina Vittozzi",
        "Date Published": "2025-08-08 11:28:00",
        "Headline": "Harvey, 15, was killed by a fellow student outside their school cafeteria on 3 February this year.",
        "Content": "\n          North of England correspondent\n              @kvittozzi\n  A 15-year-old boy has been found guilty of the murder of Sheffield schoolboy Harvey Willgoose. Harvey, also 15, was killed by a fellow student outside their school cafeteria in February this year. His parents, Mark and Caroline Willgoose, have told Sky News that school knife crime is \"a way of life for kids\". The defendant, who cannot be named for legal reasons, had brought a 13cm hunting knife with him into All Saints Catholic High School stabbing Harvey twice in the chest just a few minutes into the lunch break. CCTV, released by police after the boy's conviction, showed Harvey arriving at school, as well as earlier footage of the defendant trying to provoke Harvey, who the court heard remained \"peaceful\". Other footage showed the defendant holding a knife in the canteen prior to the stabbing. The boy had previously admitted manslaughter but denied murder. He was found guilty at Sheffield Crown Court on Friday by a majority verdict of 11 to one after 14 hours of jury deliberations. He will be sentenced in October, when the judge will also consider lifting his anonymity. The boy's defence told the court the defendant had \"lost control\", stabbing Harvey after years of bullying and \"an intense period of fear at school\". Moments after stabbing Harvey, he told teachers, \"you know I can't control it\" and \"I'm not right in the head\". Giving evidence, the boy told the court he had no recollection of the moment he killed Harvey, something the prosecution said was \"a lie\". They told the jury the schoolboy \"wanted to show he was hard\" and had become \"obsessed\" with weapons in the lead up to Harvey's death, with photographs of him posing with knives found on his phone. 'Our lives changed forever that day' Speaking outside court after the verdict, Harvey's sister Sophie Willgoose said in a family statement: \"On 3 February, we didn't just lose Harvey, we lost a part of ourselves. Our lives changed forever that day.\" She described him as \"full of life\", a \"warm, funny, caring boy who had a unique ability to bring people together\" and whose \"presence lit up every room\". \"This tragedy has not only devastated our family, it has rippled across the country. People everywhere continue to grieve the loss of our beautiful boy,\" she said. She thanked those who \"held Harvey as he took his last breaths\" and promised to raise awareness of the dangers of knife crime to ensure a \"better, safer future for us all\". Read more from Sky NewsBoy, 4, dies as he walks out of hospitalRestriction zones for dometic abusers introducedTributes to one-year-old girl Detective Inspector Joe Hackworthy, of South Yorkshire Police, the senior investigating officer in Harvey's case, also spoke outside court. \"This trial has been a heartbreaking reminder of the devastation knife crime causes in our communities,\" he said. \"It tears lives and families apart and that has never been more evident than in this tragic case. \"Tonight, one boy's family will spend another night grieving the unimaginable loss of their beloved son, while another boy's family will be living with the reality that their son faces a life behind bars for murder.\" He thanked the Willgoose family, who \"had to endure a lengthy trial because of the murderer's refusal to admit the full extent of what he did on that tragic day\". He urged parents and carers to have \"open and honest\" conversations with their children should they suspect they are carrying knives, or to tell someone they trust if they believe someone else they know is doing so. Chris Hartley, of the Crown Prosecution Service, expressed the organisation's \"huge sympathies\" for Harvey's family and friends. \"The CPS and South Yorkshire Police were able to prove that the defendant did not lose self-control but intended to deliberately attack 15-year-old Harvey,\" he said in a statement read outside court. \"We remind teenagers that there can be horrendous and serious consequences of carrying knives. It has been proven that if you carry these weapons, you are more likely to use them or be a victim of knife crime. You are putting yourself, other people and your future at risk.\" 'We led him into the lion's den' Speaking to Sky News ahead of today's verdict, Harvey's mother, Caroline Willgoose, said she felt she had \"led [her son] into the lion's den\". She said Harvey was a \"school avoider\" who had \"anxiety\" about going there. \"We badgered Harvey into going to school but I don't think people realise that there is a problem in all schools with knives,\" says Mrs Willgoose. \"It's a way of life now for kids, and it needs to stop.\" During the trial, it was revealed that the defendant had had previous violent outbursts at school, and, a few months before Harvey was stabbed, the school had called the police when the defendant's mother contacted them to say she had found a weapon in her son's bag at home. Harvey's parents told Sky News they feel that the school did not take previous knife-related incidents \"seriously enough\" and felt \"100%\" the outcome might have been different if they had. The head of St Clare Catholic Multi Academy Trust - a group of schools including All Saints - also told Sky News Harvey's death \"was an unimaginable tragedy for all\". Steve Davies said: \"We think especially of Harvey's family, loved ones and friends today. We cannot begin to imagine the immeasurable impact the loss of Harvey has had on them. \"Harvey was a much-loved, positive and outgoing pupil whose memory will be cherished by all who knew him. As a community, we have been devastated by his death, and we continue to think of him every day.\" He added: \"Harvey's death was an unimaginable tragedy for all, and one that understandably gives rise to a number of questions from his family and others. \"Now that the trial has finished, a number of investigations aimed at addressing and answering these questions will be able to proceed. We will engage fully and openly with them to help ensure every angle is considered and no key questions are left unresolved.\" Describing her son as \"a character\" who \"never stopped smiling, never stopped singing\", Mrs Willgoose said she was now campaigning for \"all schools and colleges\" to use knife arches. \"I want people to go into schools and talk about the devastation of what knife crime does.\" In an emotional interview, she said she felt her son was \"put here for a reason\" and \"I can't let go until I put things right for him\". \"There's no winners when it comes to knife crime,\" she said. The defendant \"has ruined his life, his parent have got an empty bed\", she added. \"He's got to live with this for the rest of his life.\" Harvey's father, Mark Willgoose, said that his son had had \"a short life, but a good life\". \"He crammed everything in, and you've just got to try and see the positives in that,\" Mr Willgoose added. \"Whatever happens in court, it'll never be justice. It'll never be enough. \"I think we've just got to make sure Harvey's death is not going to be in vain, and if whatever we do saves one life, then it's been worth us doing it.\""
    },
    {
        "title": "JD Vance warns against UK going down 'dark path' of losing free speech during meeting with David Lammy",
        "description": "JD Vance has said he does not want the UK to go down a \"very dark path\" of losing free speech during a meeting with the foreign secretary at his country estate.",
        "url": "https://news.sky.com/story/jd-vance-warns-against-uk-going-down-dark-path-of-losing-free-speech-during-meeting-with-david-lammy-13408626",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jd-vance-us-vice-president_6985706.jpg?20250808155649",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-08 14:11:00",
        "Headline": "The vice president and the UK's foreign secretary held a televised meeting during the Vance family's summer holiday to England.",
        "Content": " JD Vance has said he does not want the UK to go down a \"very dark path\" of losing free speech during a meeting with the foreign secretary at his country estate. The US vice president has previously raised concerns that free speech is being eroded in the UK. However, during a two-day visit to David Lammy's grace and favour 115-room mansion, Chevening House in Kent, Mr Vance kept his criticism a bit more low key.  Asked about free speech in the UK during a televised meeting of the two men, Mr Vance said he has \"raised concerns\" about free speech in his own country and accused the West of \"censoring rather than engaging\" with different opinions. He said: \"I think the entire collective West, the transatlantic relationship, our NATO allies, certainly the United States under the Biden administration, got a little too comfortable with censoring rather than engaging with a diverse array of opinions. So that's been my view. \"Obviously, I've raised some criticism, concerns about our friends on this side of the Atlantic. \"But the thing that I'd say to the people of England or anybody else, to David, is many of the things that I worry most about were happening in the United States from 2020 to 2024. \"I just don't want other countries to follow us down what I think was a very dark path under the Biden administration.\" Mr Lammy, who has struck up the unlikely relationship over the past few months, did not comment on Mr Vance's indirect criticism. In February, when Sir Keir Starmer was carrying out a similar televised meeting with Donald Trump in the Oval Office, Mr Vance said \"infringements on free speech\" now do not just affect the British, but also American tech companies - \"and by extension American citizens\". Sir Keir quickly interjected, saying: \"We've had free speech for a very long time, it will last a long time, and we are very proud of that.\" Mr Vance and his family are staying with Mr Lammy at Chevening for two days before heading to the Cotswolds for a summer holiday. The vice president was effusive in his praise for the grand estate that comes with Mr Lammy's job, saying \"being here lifts up the human spirit\" as he thanked the \"people of England\" for having such a \"beautiful place for foreigners like me to come and talk about the issues of the day\". He added that he \"loves the UK\". Read more:MP alerts coastguard to 'migrants' - who were charity rowing teamHomelessness minister resigns after 'extortionate' rent hike claims The two politicians went fishing ahead of their meeting, with Mr Vance revealing he caught a few, while all three of his children caught a fish but Mr Lammy did not. He also said his children had fallen asleep on the floor of the large house, and his three-year-old daughter kept asking if she would see Mr Lammy's daughter. Mr Lammy posted a picture of him and Mr Vance laughing as they fished, saying it was a \"real pleasure\" to welcome the Vance family and the vice president \"gave me fishing tips, Kentucky style\". JD Vance confirmed he will holiday in Scotland next week in a trip that could see up to 1,000 police officers deployed as part of security efforts. He confirmed his Scottish trip during talks with Mr Lammy on Friday. Sky News understands the Vance family are likely to visit Ayrshire, the same area where Mr Trump recently stayed where he secured a trade deal with the European Union. Police sources have suggested approximately 1,000 officers will be working across the visit to ensure the vice president and his loved ones are safe, Sky News' Scotland correspondent Conner Gillies reported. Police Scotland declined to comment on the specifics. It is understood the Vance family will not be staying at Trump Turnberry, the luxury Ayrshire resort owned by the US president himself. A Police Scotland spokesperson said: \"Planning is under way for a potential visit to Scotland by the vice president of the United States. \"Details of any visit would be for the White House to comment on, however it is important that we prepare in advance for what would be a significant policing operation.\""
    },
    {
        "title": "Friday night's anti-migrant protests in Norwich were peaceful - but anger is bubbling",
        "description": "Outside the Best Western Brook Hotel in Norwich around 300 anti-migrant protesters sang along to Sweet Caroline, Neil Diamond's song about good times never feeling so good, but that wasn't their message for the migrants living inside the hotel.",
        "url": "https://news.sky.com/story/friday-nights-anti-migrant-protests-in-norwich-were-peaceful-but-anger-is-bubbling-13408870",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-norwich-migrnats_6986127.jpg?20250808234340",
        "type": "UK",
        "Author": "Jason Farrell",
        "Date Published": "2025-08-08 21:31:00",
        "Headline": "The day had been dubbed \"Abolish Asylum Day\" with a call to action for protesters to come out across the county. Around 80 counter protesters also arrived on the scene. ",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n  Outside the Best Western Brook Hotel in Norwich around 300 anti-migrant protesters sang along to Sweet Caroline, Neil Diamond's song about good times never feeling so good, but that wasn't their message for the migrants living inside the hotel. In a town where average rents have increased faster than the rest of England, and hospital waiting times are some of the worst in the country, many who turned out complained about the cost of housing asylum seekers. Stuart, a Norfolk businessman holding a giant St George's flag, said: \"I see my company paying north of a hundred thousand pounds a year in tax and the money is not going back into our system, back into our NHS, when it takes two million pounds a year to keep one hotel open.\" In a theme that we've seen in protests across the country, residents also spoke of their fears for women and girls.  Protester Karen Williams said: \"I have seen with my own eyes school children being hassled from illegal males from this hotel. Being followed, asked for their phone numbers.\" A man who didn't want to be named added: \"That hotel could be full of terrorists. We don't know where they're from, they're undocumented males, all of a certain age. We've been invaded.\" Many wore T-shirts with slogans saying they were not far-right. Although a large portion of the crowd cheered when the name Tommy Robinson was hailed from the stage. The day had been dubbed \"Abolish Asylum Day\" with a call to action for protesters to come out across the country. Here, around 80 counter protesters also arrived on the scene and police used their vans and two lines of officers to create a green zone in the car park to separate the opposing groups. The hotel curtains were closed but no doubt the migrants inside could hear as on one side, a group determined to get rid of them, chanted, \"whose streets, our streets\", and sang Rule Britannia, while the other side's chants assured them: \"Refugees are welcome here.\" Counter protester Stuart said: \"It's unfair that these people are going to be intimidated like that and I want to show that not everybody in the UK thinks this way.\" Hayley, holding a banner which read, \"save our kids from fascists\", said: \"I live in this area, and I see these people every day and they do nothing wrong whatsoever. \"They genuinely are very sweet people who don't deserve what's happening.\" Another counter protester, Cate, said: \"They [migrants] are not who they are made out to be.\" \"I would trust them any day - far more than I would those people,\" she added, nodding towards the anti-migrant protesters. Read more:MP mistakes rowing team for migrant boatFirst migrants detained under return deal with France Organisers on both sides said they came in peace, and peaceful it was. But there is a bubbling anger. The Brook Hotel was taken over by the Home Office nearly three years ago and protests here, that only began this summer, are seeing their numbers grow."
    },
    {
        "title": "Young British girl returns to UK from IS detention camp in Syria, authorities say",
        "description": "A young British girl has been repatriated from a detention camp housing alleged Islamic State family members in northwest Syria, authorities in the region have told Sky News.",
        "url": "https://news.sky.com/story/young-british-girl-returns-to-uk-from-is-detention-camp-in-syria-authorities-say-13408657",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-al-hol-syria_6985857.jpg?20250808191446",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-08 15:34:00",
        "Headline": "The girl, who is thought to be around nine years old, was found at the Al Hol camp in northeast Syria, which houses the wives and children of IS fighters and supporters of the terror group.",
        "Content": "A young British girl has been repatriated from a detention camp housing alleged Islamic State family members in northwest Syria, authorities in the region have told Sky News. The girl, who is thought to be around nine years old, was found at the Al Hol camp in northeast Syria, which houses the wives and children of IS fighters and supporters of the terror group. She was being raised by a woman who is not her biological mother and does not speak English, as she has spent most of her life in the camps. It is understood the UK government asked the authorities in northeast Syria to find her in the camp and hand her over. Khaled Ibrahim, a member of the foreign relations department of the Autonomous Administration of North and East Syria (AANES), said the department had been in \"constant touch\" with the British government to determine the identity and location of the girl over the past couple of years. \"She had no idea about her identity, name, or citizenship,\" he said.  Mr Ibrahim said the girl was \"about nine years old\" and does not know her mother or father \"because she was moving from the custody of one woman to another\", as she had lost her parents. \n                  Syria's new president has won over Trump but his chequered past is still causing concern\n                 \n                  Can Syria's new President be trusted?\n                 \n                  Rows of decomposing bodies that haven't been buried because of fierce fighting in Syrian city\n                 \"The camps reflect a very difficult environment for both women and children,\" he said. \"Those children may get imbued with more radical ideas and, thus, they will turn into IS cells. \"This [is] what we've been witnessing recently - the cubs of the caliphate are organised in the camps. There is also communication between IS cells inside and outside the camps. \"This is why we've always said there must be comprehensive solutions for those children since they carry IS heritageand are IS remnants. \"There must be participation by the international community to eliminate IS completely.\" Read more:Inside the 'ticking time bomb' camp where Shamima Begum was held Asked what his message was to the British and other Western governments was, Mr Ibrahim said: \"The chaos that has happened and [is] still happening in Syria outlines that terrorist organisations in Syria have found a fertile ground to reorganise their ranks.\" He added: \"We have information in that regard suggesting that IS is reorganising its ranks in the vicinity of major cities like Damascus, Aleppo, Homs, and other areas. This happens because IS has seized a lot of weapons left behind by the former regime in its military facilities. \"It is also the result of the existing chaos and the interim government's inability to enforce safety and security, in addition to its inability to assert its control over Syria or even carry out its security duties effectively. \"There must be an international collaboration aimed at reorganising what is happening in Syria.\" Last month, IS militants attacked members of the Syrian Democratic Forces (SDF), the security forces controlling large parts of northeast Syria, killing five of their soldiers in Deir Ezzour province. Mr Ibrahim said there has \"absolutely\" been an increase in IS activity after the fall of Bashar al Assad, who had ruled Syria from 2000 until he was overthrown in December last year. \"The daily attacks indicate IS is reorganising its ranks to destabilise the areas of north and east Syria to create security chaos and exploit the disorder already triggered by the fall of the regime.\" An interim deal between the SDF and the new government in Damascus has yet to be fully implemented after the removal of Assad from power, with disagreements remaining over integrating Kurdish forces into a national army. Sky News has asked the Foreign, Commonwealth & Development Office (FCDO) for comment."
    },
    {
        "title": "James Cartwright: Man jailed for raping and murdering ex-fiancee at luxury Surrey hotel",
        "description": "A man who raped and murdered his ex-fiancee at a luxury Surrey hotel has been jailed for life with a minimum term of 28 years.",
        "url": "https://news.sky.com/story/james-cartwright-man-jailed-for-raping-and-murdering-ex-fiancee-at-luxury-surrey-hotel-13408646",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-cartwright-surrey_6985722.jpg?20250808161120",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-08 14:54:00",
        "Headline": "James Cartwright attacked his former partner during the night, before phoning emergency services and claiming he had found her dead bedside him, the prosecution said. ",
        "Content": "A man who raped and murdered his ex-fiancee at a luxury Surrey hotel has been jailed for life with a minimum term of 28 years. The body of Samantha Mickleburgh - described by her family as their \"champagne girl\" who lit up every room - was found at the five-star Pennyhill Park Hotel in Bagshot on 14 April last year. After one afternoon of deliberating, a jury last month unanimously convicted James Cartwright for raping and murdering the mother-of-two during their stay at the hotel for his birthday.   Cartwright, 61, was acquitted of a charge of controlling and coercive behaviour, but prosecutor Louise Oakley argued his conduct during the relationship with Ms Mickleburgh was \"cruel, repressive and overbearing\". Sentencing the defendant at Guildford Crown Court on Friday, Mr Justice Murray said: \"Samantha's family suffer a grief that those who have not experienced it cannot imagine. It lies beyond words to fully describe.\" Six of Ms Mickleburgh's loved ones gave victim impact statements, including one of her sisters, Tracey Carter, who told Cartwright she would \"never understand why you thought you had the right to do the horrific things that you did to Sam\". \"I wish she had never met you,\" she said. \"Did you feel proud of yourself when you lied to my father, saying that Sam had died in her sleep knowing full well the horror that you had put her through? \"Do you take some kind of sadistic enjoyment in your lies? You have caused an indescribable amount of pain and suffering to our family but know this: we are strong and you cannot break us, you cannot take Sam from us. \"I believe you are a monster - an evil, controlling, manipulative predator who really thought you were clever enough to get away with murder, my sister's murder.\" Cartwright, of no fixed address, was jailed for nine years for rape - a sentence which will run concurrent to his sentence for murder. Ms Mickleburgh, from Axminster in Devon, had ended her relationship with Cartwright but \"honoured\" a commitment she had made to spend his 60th birthday with him, the court heard. She booked a twin room with separate beds and a six-course Michelin star dinner at the Surrey hotel. After the second course, Ms Mickleburgh became tired and unwell, with staff in restaurant saying she struggled to stand when Cartwright walked her out. They returned to the room where \"at some point\" she suffered a skull fracture, and Cartwright raped her and strangled her to death with his hands. Read more:Teen guilty of murdering schoolboyBoy, 4, dies after being hit by bus outside hospital He called an ambulance at 8.30am the next morning and claimed he had discovered Ms Mickleburgh dead beside him in bed. Before making the phone call, the prosecution said Cartwright placed an engagement ring on his ex-partner's finger to \"support this assertion that they had become re-engaged the night before\" and \"staged the hotel room\" to make it look as though they had consensual sex. The court heard Cartwright was subject to a conditional caution for harassing a former partner, with prosecutor Ms Oakley saying there is a \"history of controlling and coercive behaviour in terms of his behaviour towards women\"."
    },
    {
        "title": "My experience interviewing Nicholas Rossi - the fugitive in Scotland now facing a rape trial in Utah",
        "description": "There was always a heavy hint of charade in the company of \"Arthur Knight\".",
        "url": "https://news.sky.com/story/my-experience-interviewing-nicholas-rossi-the-fugitive-in-scotland-now-facing-a-rape-trial-in-utah-13408450",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rossi-nicholas_6985620.jpg?20250808142305",
        "type": "UK",
        "Author": "James Matthews",
        "Date Published": "2025-08-08 05:15:00",
        "Headline": "The tale of \"Arthur Knight\" - real name Nicholas Rossi - was one lifted from the pages of a fictional thriller - a fugitive pursued halfway across the world and discovered only when he had the misfortune to catch COVID and leave his tattoos exposed on a hospital ward.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n  There was always a heavy hint of charade in the company of \"Arthur Knight\". It was hard to square the man presenting as a bumbling aristocrat in Glasgow's west end with one of America's most wanted. And yet, there were always clues. Like his knowledge of Kay Burley. On the day I first arranged to interview him, he told me that TV was a mystery to him and that he never watched it. Then he said he hoped he wouldn't be nailed to the wall by Kay - our then Sky News colleague and presenter. How did he know Kay if he knew nothing about television, I wondered. He also asked how we would \"chyron\" him, an American term for an on-screen title that I was unfamiliar with (and I'm in the business). There was also the matter of the plasma TV screen on his front room wall - he knew TV, alright. Such was the international interest in the story of \"Arthur Knight\" - real name Nicholas Rossi - there was no escaping the attention of TV and everyone else. His was a tale lifted from the pages of a fictional thriller - a fugitive pursued halfway across the world and discovered only when he had the misfortune to catch COVID and leave his tattoos exposed on a hospital ward. Medical staff at Glasgow's Queen Elizabeth University Hospital did the eyes-on execution of an international manhunt. As careful as he was, Rossi left a digital footprint that US authorities followed to a flat in Glasgow. When we first arrived, he had been arrested but was out on bail. It was dark inside his flat, and there wasn't much floor space. Read more from Sky News:Putin: 'I'm not against meeting Zelenskyy' - WatchOasis gig beats Taylor Swift for most 'ground-shaking' concert It made movement difficult for Rossi because he was in a wheelchair. When physical movement demanded finesse, like in lifting him into a car, his wife Miranda manoeuvred him Sumo-wrestler style. Quite the spectacle. We sat down for a number of interviews with Rossi and his wife, Miranda. Always, he addressed my questions with the busy eyes of concentrated deceit. Once, he insisted on sitting with his back to a bookcase. It featured the tome Machiavelli, prominently in shot. It made me wonder how much of him was enjoying this. He was a performer, certainly, and I suppose he'd been thrust centre stage. 👉 Listen to Sky News Daily on your podcast app 👈 He claimed to be an Irish orphan, but he never did get the accent right. It was like a comedy fake when he wrapped an Irish lilt around gravelly tones. He would suddenly start to sound Irish when you reminded him that he was, eh, Irish. Not that he had the paperwork to prove it. There was no birth certificate, no ID for his parents, no idea of exactly where in Ireland he'd been born. He was the boy from nowhere because he knew he had to be - give any journalist a place to go looking for confirmation and therein lies a trail to ruin. So \"Arthur\" kept it vague - his freedom depended on it. When he did commit to detail, he ran into difficulty. He told me he'd been raised in homes run by the Christian Brothers in Ireland, and I asked him which ones, specifically. His reply was: \"St. Mary's and Sacred Heart.\" A quick check with the Christian Brothers revealed they have no facility named Sacred Heart in Ireland, and anything called St Mary's wasn't residential. Of course, it was never going to last for him. The extradition court in Edinburgh had fingerprint and photographic evidence, and there was a tattoo match, too. Next week sees the start of his latest trial. He is accused of raping a woman to whom he had been engaged. The allegations offer a duplication for Rossi's crime modus operandi - isolating women, refusing to leave their company, and engaging in sexual assault. \"Evil,\" is how he was described by Brian Coogan to me. Brian is a former state representative in Rhode Island who, at one stage, was on the verge of adopting the young Rossi. He was warned off by the adoption judge, who refused to let it happen, having seen the file on the young man. Violence in childhood duly extended into adulthood, and Rossi was convicted in 2008 after sexually assaulting Mary Grebinski on a college campus in Ohio. A DNA sample from that attack is what linked Rossi to rape in Utah, and it's what caused the long arm of the law to reach as far as Scotland. The footnote to the story concerns Miranda, Rossi's wife, whom he married in Bristol in 2020. Rossi faked his death in 2020, and his \"widow\", a woman by the name of Louise, ran around telling people he'd passed away. Father Bernard Healey, of Our Lady of Mercy Parish Church in Rhode Island, took a call from an English woman - sounding like \"Hyacinth Bouquet\". She said Rossi had died and asked if he would hold a memorial mass. The priest agreed, but when the invitations started going out on social media, he took a call from the police telling him to cancel the arrangements, as Rossi wasn't dead - he'd faked it and was in hiding. The voice that rang round reporting news of Nicholas' demise was familiar to anyone who has heard his wife Miranda. The two voices sound identical, indeed. How much was Miranda involved in the deceit? It remains an open question in a story about to enter a new chapter - this time, set in an Utah courtroom."
    },
    {
        "title": "Boy, 4, dies after being hit by bus as he walked out of hospital in Margate, Kent",
        "description": "A four-year-old boy has died after being struck by a bus outside a hospital in Kent.",
        "url": "https://news.sky.com/story/boy-4-dies-after-being-hit-by-bus-as-he-walked-out-of-hospital-in-margate-kent-13408502",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-zaahir-jan-margate_6985424.jpg?20250808095625",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-08 08:46:00",
        "Headline": "Zaahir Jan was struck after leaving the Queen Elizabeth, Queen Mother Hospital in Margate, where he was visiting his grandmother.",
        "Content": "A four-year-old boy has died after being struck by a bus outside a hospital in Kent. Zaahir Jan had been visiting his grandmother at the Queen Elizabeth, Queen Mother Hospital in Margate when the incident happened just after 4pm on Thursday. Kent Police said the bus, a white single-decker vehicle, was travelling near the entrance to the A&E department when Zaahir left the hospital on foot and was struck. He was taken inside the hospital but died shortly after. His mother, Azaria Green, described her son as a \"sweet, funny boy with a cheeky smile\", on a GoFundMe page. \"Everyone is devastated, but that word doesn't feel like enough to explain how we are all feeling,\" she wrote. \"Our sweet, funny boy with a cheeky smile that could make anyone's heart full. The smile that we can't see again. \"I didn't even get to tell you how much I love you.\" Read more from Sky News:Homelessness minister resigns'Restriction zones' to be introduced for domestic abusers Investigators from Kent Police's Serious Collision Investigation Unit are urging anyone with relevant information to come forward. Witnesses, including passengers travelling on the bus who have not yet spoken to the police, are urged to contact the force."
    },
    {
        "title": "Former PCSO jailed for trying to make 3D printer gun",
        "description": "A former police community support officer who was \"obsessed with weapons\" has been jailed after trying to make a gun using a 3D printer.\n",
        "url": "https://news.sky.com/story/former-pcso-jailed-for-trying-to-make-3d-printer-gun-13408637",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-zoe-watts-3d-printer_6985561.jpg?20250808124501",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-08 17:05:00",
        "Headline": "Former police community support officer Zoe Watts, 39, who was \"obsessed with weapons\" tried to make parts for a semi-automatic weapon at her home in Lincoln.",
        "Content": "A former police community support officer who was \"obsessed with weapons\" has been jailed after trying to make a gun using a 3D printer.\n Zoe Watts, 39, of St Helen's Avenue, Lincoln, has been jailed for eight years and six months after she was found with weapons, including knives and a crossbow, alongside parts for 3D printed guns during a raid on her home on 11 December, Lincolnshire Police said. She was also given a forfeiture and destruction order, and will be subject to a serious crime prevention order for five years following her release. Watts was sentenced on Friday at Lincoln Crown Court following a lengthy investigation that involved multiple departments. Judge Simon Hirst told Watts, who appeared at the hearing via video link from HMP Downview in Surrey, that he realised custody would be more difficult for her because of her neurodivergence, her previous police career and her transgender identity. The conviction and sentencing are the first of their kind in the UK for this type of offence, Lincolnshire Police said. She was arrested by armed officers last December, after she was pulled over while driving her car in Lincoln. \n                  Independent review to examine how govt department handled prosecutions of Post Office staff\n                 \n                  Teenager guilty of murder of schoolboy Harvey Willgoose during lunch break\n                 \n                  JD Vance warns against UK going down 'dark path' of losing free speech during meeting with David Lammy\n                 Lincolnshire Police received information that Watts was buying illegal material online. Officers searched her house while she was away. They found an \"Aladdin's cave\" of weapons, police said. They also discovered a number of \"worrying searches\" online. Police said Watts had used Google to ask, \"has anybody been killed by a 3D printed gun?\" and was looking for ways to buy new weapons. Read more:Teenager found guilty of murder of schoolboyBoy, 4, dies after being hit by bus She told officers she was creating the weapons as toys before she was convicted earlier this year. Detective inspector Gemma Skipworth said: \"This sends a clear message that if you're doing something wrong behind closed doors, it doesn't mean you're safe and can break the rules with impunity. \"3D printers are becoming more and more popular, and people are naturally exploring what they can do with this technology.\" She said downloading plans and using a machine to produce something like a firearm, means \"you're breaking the rules\" and if you are caught, you will face a lengthy jail sentence. \"This case shows how committed my colleagues are to keeping the people of Lincolnshire safe and I'd like to say a huge thank you to everyone who worked on this case,\" Skipworth added."
    },
    {
        "title": "Donald Trump reveals when - and where - he will meet Putin for Ukraine talks",
        "description": "Donald Trump has announced his \"highly anticipated\" meeting with Vladimir Putin will take place next Friday in the US state of Alaska.",
        "url": "https://news.sky.com/story/donald-trump-reveals-when-and-where-he-will-meet-putin-for-ukraine-talks-13408879",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-vladimir-putin_6985699.jpg?20250808155049",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-08 22:05:00",
        "Headline": "The two presidents are expected to discuss the conflict in Ukraine - but the war-torn country's leader Volodymyr Zelenskyy will not be at the meeting.",
        "Content": " Donald Trump has announced his \"highly anticipated\" meeting with Vladimir Putin will take place next Friday in the US state of Alaska. The two presidents are expected to discuss the war in Ukraine - with the talks potentially leading to a breakthrough in Mr Trump's effort to end the conflict. But there's no guarantee it will stop the fighting since Moscow and Kyiv remain far apart on their conditions for peace. Earlier, the US president told reporters \"we're getting very close to a deal\" that would end the war. Mr Trump added there will be \"some swapping of territories to the betterment of both sides\". Follow latest: Ukraine war live updates  The meeting between the two leaders will be the first US-Russia summit since 2021, when former US President Joe Biden met Mr Putin in Switzerland. \n                  Chris Hemsworth describes 'gear shift' after learning he's 10 times more likely to get Alzheimer's\n                 \n                  Trump's Ukraine deadline for Putin arrives - as uncertainty remains over possible meeting\n                 \n                  Apollo 13 astronaut Jim Lovell dies\n                 Mr Trump wrote on Truth Social: \"The highly anticipated meeting between myself, as President of the United States of America, and President Vladimir Putin, of Russia, will take place next Friday, August 15, 2025, in the Great State of Alaska. Further details to follow. Thank you for your attention to this matter!\" The meeting was also confirmed by Kremlin aide Yury Ushakov, who said the leaders will \"focus on discussing options for achieving a long-term peaceful resolution to the Ukrainian crisis\". He added that the two presidents could meet in Russia in future and that an invitation has already been extended to Mr Trump. Yesterday, Mr Trump had told reporters at the White House that he couldn't announce where or when the meeting would take place but he would do so soon. He also suggested that his meeting with the Russian leader could come before any discussion involving Ukrainian President Volodymyr Zelenskyy. \"We're going to have a meeting with Russia, start off with Russia. And we'll announce a location. I think the location will be a very popular one,\" Mr Trump said. The US president added: \"President Putin, I believe, wants to see peace, and Zelenskyy wants to see peace ... in all fairness to President Zelenskyy, he's getting everything he needs to, assuming we get something done.\" Read more:Russia reacts to Trump talks planJD Vance raises concerns about free speech in UK Territory to form part of talks Speaking about the role that territory will play in the peace talks, Mr Trump said: \"You're looking at a territory that's been fought over for three-and-a-half years. A lot of Russians have died. A lot of Ukrainians have died. \"So we're looking at that, but we're actually looking to get some back, and some swapping. \"It's complicated, actually. Nothing is easy. It's very complicated. But we're going to get some back. \"We're going to get some switched. There'll be some swapping of territories to the betterment of both.\" Analysts, including some close to the Kremlin, have suggested that Russia could offer to give up territory it controls outside of the four regions it claims to have annexed. Pressed on if this was the last chance to make a major peace deal, Mr Trump said: \"I don't like using the term last chance ... when those guns start going off, it's awfully tough to get them to stop.\"  Western officials 'to meet in UK' Meanwhile, senior officials from the US, Ukraine and several European countries are due to meet in the UK this weekend to try and reach common positions ahead of the Trump-Putin meeting, according to Axios. Ukraine and several NATO allies are reported to be privately concerned that Mr Trump might agree to Mr Putin's proposals for ending the war without taking their positions into consideration. Since his return to the White House in January, Mr Trump has moved to mend relations with Russia and sought to end the war - with public comments veering between admiration and sharp criticism of Mr Putin. In a sign of his growing frustration with Russia's refusal to halt its military offensive, Mr Trump had threatened to impose new sanctions and tariffs against Moscow - and countries that buy its exports - unless the Kremlin agreed to end the conflict. A deadline was set for yesterday, but it is unclear whether these sanctions are taking effect, or if they will be delayed or cancelled in light of the talks. War grinds on ahead of talks The meeting has been arranged as Russia's bigger army is slowly advancing deeper into Ukraine at great cost in troops and armour while it relentlessly bombards Ukrainian cities. Ukrainian forces are locked in intense battles along the 620-mile frontline that snakes from northeast to southeast Ukraine. The Pokrovsk area of the eastern Donetsk region is taking the brunt of punishment as Russia seeks to break out into the neighbouring Dnipropetrovsk region."
    },
    {
        "title": "A father criticised the use of airdrops in Gaza. Five days later, he was killed by a falling package",
        "description": "Five days before he was killed by a falling aid package, father-of-two Uday al Qaraan called on world leaders to open Gaza's borders to food - and criticised the use of airdrops.",
        "url": "https://news.sky.com/story/gaza-medic-killed-by-airdrop-as-system-delivers-miniscule-aid-13408270",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-dandf-teaser-gaza_6984995.png?20250807173046",
        "type": "World",
        "Author": "Ben van der Merwe and Lina-Serene, Data and Forensics Unit",
        "Date Published": "2025-08-08 23:33:00",
        "Headline": "Sky News analysis has found that airdrops are making little difference to Gaza's hunger crisis, and pose serious risks to the population.",
        "Content": "By Ben van der Merwe and Lina-Serene, Data and Forensics Unit  Five days before he was killed by a falling aid package, father-of-two Uday al Qaraan called on world leaders to open Gaza's borders to food - and criticised the use of airdrops. \"This isn't aid delivery,\" said the 32-year-old medic as a crowd of children rummaged through the remains of an airdrop behind him. \"This is humiliation.\" Using footage from social media, satellite imagery, eyewitness testimony and flight tracking data, Sky News has examined the dangers posed by airdrops - and just how little difference they are making to Gaza's hunger crisis. A tangled parachute and a crowd in chaos Based on six videos of the airdrop that killed Uday, we were able to locate the incident to a tent camp on the coast of central Gaza. We determined that the drop occurred at approximately 11.50am on 4 August, based on metadata from these videos shared by three eyewitnesses. Flight tracking data shows that only one aid plane, a UAE Armed Forces C-130 Hercules, was in the area at that time. Footage from the ground shows 12 pallets falling from the plane. The four lowest parachutes soon become tangled, and begin to fall in pairs. As a crowd surges towards the landing zone, a gunshot rings out. Nine more follow over a 90-second period. Sakhr al Qaraan, an eyewitness and Uday's neighbour, says that Uday was among those running after the first pallet to land. \"He didn't see the other pallet it was tangled up with, and it fell on him moments later,\" says Sakhr. \"People ran to collect the aid in cold blood, devoid of humanity, and he suffocated under that damned blanket - under the feet of people who had lost all humanity.\" The scene descended into chaos as Palestinians, some armed, tussled over the limited food available. By the time Uday was pulled from the crowd and rushed to hospital, it was too late. The UAE Ministry of Foreign Affairs did not respond to a request for comment. Parachutes failed in half of airdrops analysed This was not the first time that airdrops at this location had posed a threat to those on the ground. The day before Uday was killed, the same plane had dropped aid over the site. The footage below, shared by the UAE Armed Forces, shows the view from inside the plane. Just before the footage ends, it shows that one of the parachutes was broken. Hisham al Armi recorded the scene from the ground. His video shows the broken parachute, as well as another that had failed completely. Military planes dropped aid at the site on eight consecutive days between 30 July and 6 August. Sky News verified footage showing parachute failures during four of those eight airdrops. Flight tracking data shows that almost all of the 67 aid flights over that period followed a similar route along the coast, which is densely packed with tent camps. An Israel Defence Forces (IDF) official told Sky News that the airdrops are routed along the coast, because this is where much of Gaza's population is now concentrated. An IDF spokesperson added the Israeli military \"takes all possible measures to mitigate the harm to uninvolved civilians\". Hisham al Armi told Sky News he is grateful to the countries that donated the aid, but \"the negatives outweigh the positives\". \"Fighting occurs when aid is dropped, and some people are killed ... due to the crush and parachutes.\" Other dangers are also posed by the airdrops. The footage below, taken on 29 July, shows Palestinians venturing into the sea in order to chase aid that had drifted over the water. The IDF has banned Palestinians from entering the sea. One woman, a relative of Uday who witnessed his death, described the airdrops as the \"airborne humiliation of the people\". \"There is not enough aid for them,\" she said. \"It creates problems among the people, and some are killed just to obtain a little aid. And most people don't receive any aid, they remain hungry for days.\" Between 27 July and 1 August, Gaza received an estimated 1,505 tonnes of food aid per day via land routes - 533 tonnes short of what the UN's food security agency says is needed to meet basic needs. Based on flight tracking data, we estimated that airdrops added just 38 tonnes daily, 7% of the shortfall. \"The quantities involved are minuscule in terms of the scale of the need,\" says Sam Rose, Gaza director of UNRWA, the UN agency previously responsible for distributing food in the territory. UNRWA claims it has enough food stationed outside of Gaza to feed the population for three months, but that Israel has not allowed the agency to bring in any food since 2 March. \"We should be dealing with that rather than introducing something else which is costly, dangerous, undignified and somehow legitimises ... the access regime by suggesting that we found a way round it through airdrops,\" Rose says. COGAT, the Israeli agency responsible for coordinating aid deliveries, referred Sky News to a statement in which it said there is \"no limit on the amount of aid\" allowed into Gaza. An IDF spokesperson also denied restricting aid, and said the Israeli military \"will continue to work in order to improve the humanitarian response in the Gaza Strip, along with the international community\". In his interview five days before he was killed, Uday al Qaraan appealed to world leaders to open Gaza's borders. \"What would happen if they just let the aid in?\" he asked. \"If you can fly planes and drop aid from the sky then you can break the siege, you can open a land crossing.\" The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Netanyahu's plan for Gaza risks dragging Israel into a conflict with no clear endpoint",
        "description": "Israeli Prime Minister Benjamin Netanyahu's new direction in the war on Gaza risks dragging Israel into a conflict with no clear endpoint.",
        "url": "https://news.sky.com/story/netanyahus-plan-for-gaza-risks-dragging-israel-into-a-conflict-with-no-clear-endpoint-13408468",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-israel-gaza_6985236.jpg?20250808074055",
        "type": "World",
        "Author": "Alex Rossi",
        "Date Published": "2025-08-08 06:27:00",
        "Headline": "Public opposition is growing. Protests have become a near-daily occurrence. Hostage families and their supporters continue to take to the streets, fearing the current strategy puts their loved ones in even greater danger.",
        "Content": "\n          International correspondent\n              @alexrossiSKY\n  Israeli Prime Minister Benjamin Netanyahu's new direction in the war on Gaza risks dragging Israel into a conflict with no clear endpoint. The stated goal remains, at least outwardly, the total destruction of Hamas. But attempting to eliminate an idea, particularly one tied to resistance and Palestinian national identity, is likely an impossible task. The prime minister's plan has now received approval from the security cabinet. Follow the latest updates on the war in Gaza Yet in many ways, this remains one man's war. Public opposition is growing. Protests have become a near-daily occurrence. Hostage families and their supporters continue to take to the streets, fearing the current strategy puts their loved ones in even greater danger. The military also appears increasingly uneasy.  Read more from Alex Rossi:Major strategic and moral risks to Israel's full occupation The chief of staff of the Israel Defence Forces (IDF), Lieutenant General Eyal Zamir, has raised strong objections. He is warning of military fatigue, the risks of a prolonged occupation, and the danger of turning the Israeli army into a long-term policing force for millions of Palestinians. Many within the military, like a significant portion of the Israeli public, would prefer a ceasefire that could lead to the release of more hostages. Israel currently claims to control around 75% of the Gaza Strip. Under the new plan, it will attempt to move into the remaining areas. Under international law, Gaza is already considered under Israeli occupation. According to the United Nations Office for the Coordination of Humanitarian Affairs, 86.3% of the Strip falls within Israeli militarised zones. The most intense operations for the new plan will likely focus on Gaza City, considered the de facto capital of the Strip and the administrative stronghold of Hamas. Taking Gaza City is seen as a key step in weakening Hamas's operational capabilities. Its capture would also carry deep symbolic weight, potentially altering the political landscape of post-war Gaza. Israel believes a large number of hostages are still being held in or near Gaza City. This is one of the main reasons the IDF has previously avoided full incursions into those areas. The risk to those in captivity remains high. Nevertheless, none of these plans will unfold quickly. The campaign could take months to prepare and many more to execute. In the meantime, Israel risks accusations of committing to an open-ended war with no clear exit strategy. Implementing control over Gaza would require a long-term project. Observers suggest it could mirror the military and administrative template used in the occupied West Bank (which has persisted for decades). Such an effort in Gaza would likely take years to set up. The Prime Minister's Office has laid out five conditions that must be met before Israel agrees to end the war. These are: the full disarmament of Hamas, the return of all fifty remaining hostages (twenty of whom are believed to be alive), the complete demilitarisation of Gaza, Israeli security control over the territory, and the replacement of both Hamas and the Palestinian Authority with a new civilian government. These demands, while politically significant, will likely deepen Israel's international isolation as the already horrendous civilian death toll in Gaza continues to climb. Critics argue that the operation is increasingly tied to Netanyahu's own political survival. Since the Hamas-led attack on October 7, 2023, his popularity has collapsed. Polls consistently show a deep loss of public trust, and many Israelis blame him for the intelligence and leadership failures that led to the worst terror attack in the country's history.  Read more: Security cabinet agrees full military takeover of GazaGHF aid sites in Gaza are scenes of 'orchestrated killing' Mass protests, led especially by families of the hostages, have called for new elections and a change in leadership. Netanyahu, however, may view the continuation of war as a means to delay accountability and avoid political defeat. His coalition depends on the support of far-right ministers such as Itamar Ben Gvir and Bezalel Smotrich. Any sign of compromise or willingness to negotiate risks collapsing his fragile government. It is also worth considering just how long this war has already dragged on. After 22 months of devastating conflict, many in Israel believe that Hamas no longer poses a strategic threat. Yet the war's goals have become increasingly ambiguous, and its endpoint remains undefined. Hamas has largely fully transitioned into a guerrilla force. Israel now faces the same dilemma that has haunted major powers before it, fighting an asymmetric enemy deeply embedded in civilian areas. As the United States discovered in Vietnam and the Soviet Union in Afghanistan, fighting such a war comes at a price that is hard to grasp until it is far too late."
    },
    {
        "title": "Gaza seen from above: How life and colour has been stripped from a once bustling port city",
        "description": "The north used to be the breadbasket of the Gaza Strip.",
        "url": "https://news.sky.com/story/gaza-seen-from-above-how-life-and-colour-has-been-stripped-from-a-once-bustling-port-city-13408643",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-aid-drop-israel_6985715.jpg?20250808160456",
        "type": "World",
        "Author": "Diana Magnay",
        "Date Published": "2025-08-08 14:44:00",
        "Headline": "The destruction already wrought on the enclave is clear from the air and, as Israel plans further military action, the plight of those still living in Gaza City is only likely to get worse.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n  The north used to be the breadbasket of the Gaza Strip. Strawberry fields in Beit Lahia, olive and citrus groves, wheat fields, and the agricultural university in Beit Hanoun. It seems impossible even to imagine that now. Follow Gaza latest  We flew down across the northern border on a Royal Jordanian Air Force plane, with a meagre eight tons of humanitarian aid ready to go. Eight tons, when the Integrated Food Security Phase Classification (IPC), the body that has classified Gaza as being on the brink of famine, estimates the population needs 2,038 tons daily. What was once cropland is barren and scorched. Villages and agricultural structures are in ruins. There was a ragged uniformity to the greyness as we flew south and past Beit Lahia towards Gaza City, as though dust from the rubble of a million ruins has sprinkled over the land like ash from a volcano. Gaza City is Benjamin Netanyahu's next target. Not that he hasn't savaged it to date, but there is a cityscape left standing. Buildings ripped and torn by the monstrous force of artillery, no life or colour or vibrancy from the sky in what was once a bustling port city, with ancient mosques and churches, bookshops, villas and cafes along the seafront. Now, like a rash of giant pebbles, a mass of tents stretches down towards the Mediterranean, home to tens of thousands of the 800,000 or so people who are still living here. People who Israel plans to displace once again, before the IDF seizes full control. 👉 Listen to Sky News Daily on your podcast app 👈 There is an anonymity from the sky, though. You cannot see the excitement that our camera teams capture on the ground as young children point to the planes. You do not see the balcony collapsing after an aid package lands on it, and the sheer weight of too many people desperate for food causes them all to fall.  You do not see the misery of a disabled father whose son was hit by a falling pallet, who our camera crews locate as he lies in intensive care. Aid drops are dehumanising and cruel. It is not the fault of the countries that deliver them. They are doing what they can. But they are a terrible way of delivering aid. Read more on Sky News:'No clear endpoint' for NetanyahuStrategic and moral risks to full occupation \"Are we dogs to them? They're throwing aid at us from the sky, are we dogs? They're hunting us\" - that's what Fadia al Najjar, a mother who had lost her son in a shooting at an aid distribution point, told our Gaza crew in al Mawasi earlier in the week. As I looked down over the apocalyptic catastrophe that is Gaza now, I could not forget her words."
    },
    {
        "title": "At least two dead as wildfires sweep across Greece, Turkey and France",
        "description": "A least two people have died and two others are reported to have died after wildfires tore across southern Europe.",
        "url": "https://news.sky.com/story/at-least-two-dead-as-wildfires-sweep-across-greece-turkey-and-france-13408773",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-athens-greece-wildfire_6985908.jpg?20250808200701",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-08 18:57:00",
        "Headline": "Fast-moving flames, fanned by strong winds, are approaching Athens while the Dardanelles was temporarily shut to shipping.",
        "Content": "A least two people have died and two others are reported to have died after wildfires tore across southern Europe. Fast-moving flames, fanned by strong winds, crossed scrub-covered hillsides in the Keratea region of Greece, getting close to residential areas around 25 miles southeast of Athens on Friday. One man was found dead in Keratea during an evacuation, the Fire Service said. Ukraine war latest - peace deal close - Trump  Two Vietnamese tourists died after falling in the water amid strong winds on the tourist island of Milos in the Cyclades, France24.com said, quoting the Coastguard. Authorities said 190 firefighters, using planes and helicopters to drop water, battled the blazes as thick clouds of black smoke filled the sky. Wildfires in neighbouring Turkey forced the temporary closure of the Dardanelles Strait to shipping because of heavy smoke and reduced visibility in the narrow waterway. A university campus and a care home for the elderly in northwestern Turkey were evacuated by authorities after another fire, which started in a field near Saricaeli village, in Canakkale province, quickly spread to a nearby forested area.  Firefighters in France who contained the country's largest wildfire in decades are on high alert because it is feared forecast high temperatures this weekend could reignite it. One person died as the blazes quickly burned more than 62 square miles in three days in the Aude wine region in southern France, where hundreds of residents were forced to leave their homes. Local authorities said they need to remain vigilant throughout the weekend because temperatures are expected to rise above 30C (86F) during another heatwave. Aude administrator Christian Pouget said 1,000 people had not yet been able to return to their homes after the fire swept through 15 communes in the Corbieres mountain region, destroying or damaging at least 36 homes. One person died at home and at least 21 others were injured, including 16 firefighters, officials said. Some 1,300 homes were still without electricity on Friday morning after infrastructure was extensively damaged, the Aude prefecture said. Residents have been warned not to return home without permission, as many roads remain blocked and dangerous. Those forced to flee have been housed in emergency shelters across 17 municipalities. Many fled to the community of Tuchan when the fire started on Tuesday, its mayor Beatrice Bertrand said. \"We have received and hosted over 200 people. We gave them food, thanks to local businesses who opened their stores despite it being very late,\" she said. \"Civil Protection brought us beds. And also the local villagers offered their homes to welcome them. It was their first night here and many were shocked and scared.\" Read more on Sky News:Gaza from above - 'barren and cropless'Apollo 13 astronaut dies An investigation is under way into the cause of the fire. Authorities said the fire was the largest recorded since France's national fire database was created in 2006, but the minister for ecological transition, Agnes Pannier-Runacher, went further, calling the blaze the worst since 1949 and linking it to climate change."
    },
    {
        "title": "My experience interviewing Nicholas Rossi - the fugitive in Scotland now facing a rape trial in Utah",
        "description": "There was always a heavy hint of charade in the company of \"Arthur Knight\".",
        "url": "https://news.sky.com/story/my-experience-interviewing-nicholas-rossi-the-fugitive-in-scotland-now-facing-a-rape-trial-in-utah-13408450",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rossi-nicholas_6985620.jpg?20250808142305",
        "type": "World",
        "Author": "James Matthews",
        "Date Published": "2025-08-08 05:15:00",
        "Headline": "The tale of \"Arthur Knight\" - real name Nicholas Rossi - was one lifted from the pages of a fictional thriller - a fugitive pursued halfway across the world and discovered only when he had the misfortune to catch COVID and leave his tattoos exposed on a hospital ward.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n  There was always a heavy hint of charade in the company of \"Arthur Knight\". It was hard to square the man presenting as a bumbling aristocrat in Glasgow's west end with one of America's most wanted. And yet, there were always clues. Like his knowledge of Kay Burley. On the day I first arranged to interview him, he told me that TV was a mystery to him and that he never watched it. Then he said he hoped he wouldn't be nailed to the wall by Kay - our then Sky News colleague and presenter. How did he know Kay if he knew nothing about television, I wondered. He also asked how we would \"chyron\" him, an American term for an on-screen title that I was unfamiliar with (and I'm in the business). There was also the matter of the plasma TV screen on his front room wall - he knew TV, alright. Such was the international interest in the story of \"Arthur Knight\" - real name Nicholas Rossi - there was no escaping the attention of TV and everyone else. His was a tale lifted from the pages of a fictional thriller - a fugitive pursued halfway across the world and discovered only when he had the misfortune to catch COVID and leave his tattoos exposed on a hospital ward. Medical staff at Glasgow's Queen Elizabeth University Hospital did the eyes-on execution of an international manhunt. As careful as he was, Rossi left a digital footprint that US authorities followed to a flat in Glasgow. When we first arrived, he had been arrested but was out on bail. It was dark inside his flat, and there wasn't much floor space. Read more from Sky News:Putin: 'I'm not against meeting Zelenskyy' - WatchOasis gig beats Taylor Swift for most 'ground-shaking' concert It made movement difficult for Rossi because he was in a wheelchair. When physical movement demanded finesse, like in lifting him into a car, his wife Miranda manoeuvred him Sumo-wrestler style. Quite the spectacle. We sat down for a number of interviews with Rossi and his wife, Miranda. Always, he addressed my questions with the busy eyes of concentrated deceit. Once, he insisted on sitting with his back to a bookcase. It featured the tome Machiavelli, prominently in shot. It made me wonder how much of him was enjoying this. He was a performer, certainly, and I suppose he'd been thrust centre stage. 👉 Listen to Sky News Daily on your podcast app 👈 He claimed to be an Irish orphan, but he never did get the accent right. It was like a comedy fake when he wrapped an Irish lilt around gravelly tones. He would suddenly start to sound Irish when you reminded him that he was, eh, Irish. Not that he had the paperwork to prove it. There was no birth certificate, no ID for his parents, no idea of exactly where in Ireland he'd been born. He was the boy from nowhere because he knew he had to be - give any journalist a place to go looking for confirmation and therein lies a trail to ruin. So \"Arthur\" kept it vague - his freedom depended on it. When he did commit to detail, he ran into difficulty. He told me he'd been raised in homes run by the Christian Brothers in Ireland, and I asked him which ones, specifically. His reply was: \"St. Mary's and Sacred Heart.\" A quick check with the Christian Brothers revealed they have no facility named Sacred Heart in Ireland, and anything called St Mary's wasn't residential. Of course, it was never going to last for him. The extradition court in Edinburgh had fingerprint and photographic evidence, and there was a tattoo match, too. Next week sees the start of his latest trial. He is accused of raping a woman to whom he had been engaged. The allegations offer a duplication for Rossi's crime modus operandi - isolating women, refusing to leave their company, and engaging in sexual assault. \"Evil,\" is how he was described by Brian Coogan to me. Brian is a former state representative in Rhode Island who, at one stage, was on the verge of adopting the young Rossi. He was warned off by the adoption judge, who refused to let it happen, having seen the file on the young man. Violence in childhood duly extended into adulthood, and Rossi was convicted in 2008 after sexually assaulting Mary Grebinski on a college campus in Ohio. A DNA sample from that attack is what linked Rossi to rape in Utah, and it's what caused the long arm of the law to reach as far as Scotland. The footnote to the story concerns Miranda, Rossi's wife, whom he married in Bristol in 2020. Rossi faked his death in 2020, and his \"widow\", a woman by the name of Louise, ran around telling people he'd passed away. Father Bernard Healey, of Our Lady of Mercy Parish Church in Rhode Island, took a call from an English woman - sounding like \"Hyacinth Bouquet\". She said Rossi had died and asked if he would hold a memorial mass. The priest agreed, but when the invitations started going out on social media, he took a call from the police telling him to cancel the arrangements, as Rossi wasn't dead - he'd faked it and was in hiding. The voice that rang round reporting news of Nicholas' demise was familiar to anyone who has heard his wife Miranda. The two voices sound identical, indeed. How much was Miranda involved in the deceit? It remains an open question in a story about to enter a new chapter - this time, set in an Utah courtroom."
    },
    {
        "title": "Young British girl returns to UK from IS detention camp in Syria, authorities say",
        "description": "A young British girl has been repatriated from a detention camp housing alleged Islamic State family members in northwest Syria, authorities in the region have told Sky News.",
        "url": "https://news.sky.com/story/young-british-girl-returns-to-uk-from-is-detention-camp-in-syria-authorities-say-13408657",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-al-hol-syria_6985857.jpg?20250808191446",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-08 15:34:00",
        "Headline": "The girl, who is thought to be around nine years old, was found at the Al Hol camp in northeast Syria, which houses the wives and children of IS fighters and supporters of the terror group.",
        "Content": "A young British girl has been repatriated from a detention camp housing alleged Islamic State family members in northwest Syria, authorities in the region have told Sky News. The girl, who is thought to be around nine years old, was found at the Al Hol camp in northeast Syria, which houses the wives and children of IS fighters and supporters of the terror group. She was being raised by a woman who is not her biological mother and does not speak English, as she has spent most of her life in the camps. It is understood the UK government asked the authorities in northeast Syria to find her in the camp and hand her over. Khaled Ibrahim, a member of the foreign relations department of the Autonomous Administration of North and East Syria (AANES), said the department had been in \"constant touch\" with the British government to determine the identity and location of the girl over the past couple of years. \"She had no idea about her identity, name, or citizenship,\" he said.  Mr Ibrahim said the girl was \"about nine years old\" and does not know her mother or father \"because she was moving from the custody of one woman to another\", as she had lost her parents. \n                  Syria's new president has won over Trump but his chequered past is still causing concern\n                 \n                  Can Syria's new President be trusted?\n                 \n                  Rows of decomposing bodies that haven't been buried because of fierce fighting in Syrian city\n                 \"The camps reflect a very difficult environment for both women and children,\" he said. \"Those children may get imbued with more radical ideas and, thus, they will turn into IS cells. \"This [is] what we've been witnessing recently - the cubs of the caliphate are organised in the camps. There is also communication between IS cells inside and outside the camps. \"This is why we've always said there must be comprehensive solutions for those children since they carry IS heritageand are IS remnants. \"There must be participation by the international community to eliminate IS completely.\" Read more:Inside the 'ticking time bomb' camp where Shamima Begum was held Asked what his message was to the British and other Western governments was, Mr Ibrahim said: \"The chaos that has happened and [is] still happening in Syria outlines that terrorist organisations in Syria have found a fertile ground to reorganise their ranks.\" He added: \"We have information in that regard suggesting that IS is reorganising its ranks in the vicinity of major cities like Damascus, Aleppo, Homs, and other areas. This happens because IS has seized a lot of weapons left behind by the former regime in its military facilities. \"It is also the result of the existing chaos and the interim government's inability to enforce safety and security, in addition to its inability to assert its control over Syria or even carry out its security duties effectively. \"There must be an international collaboration aimed at reorganising what is happening in Syria.\" Last month, IS militants attacked members of the Syrian Democratic Forces (SDF), the security forces controlling large parts of northeast Syria, killing five of their soldiers in Deir Ezzour province. Mr Ibrahim said there has \"absolutely\" been an increase in IS activity after the fall of Bashar al Assad, who had ruled Syria from 2000 until he was overthrown in December last year. \"The daily attacks indicate IS is reorganising its ranks to destabilise the areas of north and east Syria to create security chaos and exploit the disorder already triggered by the fall of the regime.\" An interim deal between the SDF and the new government in Damascus has yet to be fully implemented after the removal of Assad from power, with disagreements remaining over integrating Kurdish forces into a national army. Sky News has asked the Foreign, Commonwealth & Development Office (FCDO) for comment."
    },
    {
        "title": "Germany is one of Israel's strongest allies - so stopping export of arms that could be used in Gaza is huge shift",
        "description": "Germany is traditionally one of Israel's strongest international backers, so the chancellor's message that it will not authorise any exports of military equipment that could be used in Gaza \"until further notice\" is a significant step.",
        "url": "https://news.sky.com/story/germany-is-one-of-israels-strongest-allies-so-stopping-export-of-arms-that-could-be-used-in-gaza-is-huge-shift-13408611",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-germany-israel_6985674.jpg?20250808151901",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-08-08 13:41:00",
        "Headline": "Due to its Nazi past and historic responsibility for the Holocaust, Germany has long had a \"special relationship\" with Israel and has been one of its staunchest supporters.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n Germany is traditionally one of Israel's strongest international backers, so the chancellor's message that it will not authorise any exports of military equipment that could be used in Gaza \"until further notice\" is a significant step. Germany has often avoided the harsh criticism and tougher tones against Israel's government taken by some of its European allies. Gaza escalation 'wrong' says Starmer; follow latest Friday's statement stands out and will isolate Israel further following the announcement of its controversial military takeover plan. Chancellor Friedrich Merz was clear that Israel has a right to defend itself against Hamas, the hostages must be released, there must be negotiations towards a ceasefire, and Hamas does not have a role in Gaza's future. These messages are not new; this has been the government line since October 2023, but the stopping of some exports of military equipment shows the Germans believe Israel has crossed a line. \"In the view of the German government, the even tougher military action taken by the Israeli army in the Gaza Strip, which was decided last night by the Israeli cabinet, makes it increasingly difficult to see how these goals are to be achieved,\" the chancellor said. \"Under these circumstances, the German government will not authorise any exports of military equipment that could be used in the Gaza Strip until further notice.\" Following the announcement, several politicians showed their support, including vice chancellor, Lars Klingbeil, the leader of the Social Democratic Party (SPD), the junior member in Germany's coalition government, who said: \"This is the right decision.\" But others expressed their dismay online, including Johanne Winkel, the chairman of the Young Union, who wrote: \"Israel is doing the dirty work for us starting today, just without German weapons.\" The German-Israeli society said in a statement: \"If this decision by the German government remains in place, it will be a point victory for Hamas in the global propaganda war.\" After the United States, Germany is one of the main exporters of weapons to Israel. In 2023, it approved arms exports worth 326.5 million euros (£283m), including military equipment and war weapons, according to reports by Reuters based on data from the economy ministry. Last year, the approvals halved to 161 million euros (£140m), coinciding with a legal challenge by human rights groups concerned about the potential use of German weapons in the Gaza war.  Not a full weapons embargo - but morally significant Following Friday's announcement, I contacted the government to clarify exactly which weapons exports will be impacted. I'm awaiting a reply but what's clear is the move stops short of a full weapons embargo. Gustav Gressel, a military analyst from the National Defence Academy of the Austrian Armed forces, says: \"Morally, it's a huge shift for Germany but practically it's not that relevant.\" According to his industry sources, the majority of deals this year have been related to the navy and include items such as submarines, which would not be used in the Gaza Strip. But that doesn't mean this move isn't important. \"It's a huge shift. There's still quite a lot of sympathy for Israel. The German environment is much more pro-Israel than the UK so symbolically, it's quite dramatic,\" Dr Gressel said. Germany, due to its Nazi past and historic responsibility for the Holocaust, has long had a \"special relationship\" with Israel and has been one of its staunchest supporters over the years. The country also has a policy of not sending weapons to active conflict zones but had given Israel an exception on the grounds of national defence. Read more from Sky NewsAnalysis: Risk of a conflict with no near endpointAid sites in Gaza are scenes of orchestrated killingWhy the IDF should let journalists into Gaza In the months following the 7 October attacks, as some of Germany's allies became increasingly critical of the actions of Benjamin Netanyahu, Berlin did not waver. But recently, I have noticed a change in tone, a shifting in the government's position. In an interview at the end of May, the foreign minister announced a review of arms exports to Israel in light of possible violations of international humanitarian law in Gaza. \"We are examining whether what is happening in the Gaza Strip is compatible with international humanitarian law,\" Johann Wadephul said in an interview with Suddeutsche Zeitung. \"Further arms deliveries will be authorised based on the outcome of that review.\" There have also been growing calls to halt arms exports by senior members of the SPD. Then, at the beginning of this month, during a visit to Jerusalem, the foreign minister warned Israel was in danger of becoming internationally isolated. \"I see it as Germany's duty to do everything it can to prevent this,\" he said, referring to Germany's \"never-ending historical obligation\" for Israel's security. The government did not join announcements by the French president and UK prime minister to formally recognise a Palestinian state in September but said the process of recognition \"must begin now\". Public perception also appears to be changing. In July, more than 200 prominent German celebrities and journalists urged the chancellor to stop arms deliveries and impose sanctions on Israel. In an open letter, the group pointed to the suffering of children in Gaza and stressed: \"We, too, condemn the horrific crimes of Hamas in the strongest possible terms. But no crime legitimises the collective punishment of millions of innocent people in the most brutal way.\" Meanwhile, a poll this week suggested the majority of Germans (66%) believe their country should put more pressure on Israel to address the devastating humanitarian situation unfolding in the Gaza Strip. The survey by public broadcaster ARD also found the fate of the hostages still in captivity was the main concern for 72% of people polled. So, while it's currently unclear which arms exports Friday's announcement will impact, the statement is hugely significant and marks a major change in policy for Germany."
    },
    {
        "title": "US doubles reward for Venezuelan President Maduro's arrest to $50m",
        "description": "The US has doubled its award for the arrest of Venezuelan President Nicolas Maduro to $50m (&#163;37.2m) as it accuses him of working with cartels to flood the US with fentanyl-laced cocaine.",
        "url": "https://news.sky.com/story/us-doubles-reward-for-venezuelan-president-maduros-arrest-to-50m-13408486",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-nicolas-maduro-venezuela_6796259.jpg?20250110164929",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-08 09:12:00",
        "Headline": "Under US President Donald Trump's predecessor Joe Biden, the offer went up to $25m - the same amount the US offered for the capture of Osama bin Laden following the 11 September 2001 attacks. Now it's doubled to $50m.",
        "Content": "The US has doubled its award for the arrest of Venezuelan President Nicolas Maduro to $50m (£37.2m) as it accuses him of working with cartels to flood the US with fentanyl-laced cocaine. At the time Maduro was indicted in Manhattan federal court in 2020 on federal charges of narco-terrorism and conspiracy to import cocaine, the US offered a $15m reward for his arrest. Under US President Donald Trump's predecessor Joe Biden, the offer went up to $25m - the same amount the US offered for the capture of Osama bin Laden following the 11 September 2001 attacks. \"Under President Trump's leadership, Maduro will not escape justice and he will be held accountable for his despicable crimes,\" Attorney General Pam Bondi said Thursday in a video announcing the new reward. Ms Bondi said the Justice Department has seized more than $700m in assets linked to Maduro, including two private jets, and said nearly seven tonnes of seized cocaine had been traced directly to the leftist leader. Venezuelan foreign minister Yvan Gil released a statement characterising the reward as \"pathetic\" and accusing Ms Bondi of orchestrating a \"crude political propaganda operation\". Read more from Sky News:Trump's deadline for Putin to agree to Ukraine ceasefire arrivesOpenAI releases long-awaited AI chatbot upgrade \n                  Trump's approach to peacemaking is a choice between waging war or doing business\n                 \n                  Trump's Ukraine deadline for Putin arrives - as uncertainty remains over possible meeting\n                 \n                  Donald Trump holds White House ceremony\n                 \"We're not surprised, coming from whom it comes from. \"The same one who promised a nonexistent 'secret list' of Epstein and who wallows in scandals for political favours,\" Mr Gil said, referring to the backlash Ms Bondi faced after the Justice Department announced last month that a long-rumoured \"client list\" of convicted sex offender Jeffrey Epstein does not exist. \"Her show is a joke, a desperate distraction from her own misery.\""
    },
    {
        "title": "Donald Trump reveals when - and where - he will meet Putin for Ukraine talks",
        "description": "Donald Trump has announced his \"highly anticipated\" meeting with Vladimir Putin will take place next Friday in the US state of Alaska.",
        "url": "https://news.sky.com/story/donald-trump-reveals-when-and-where-he-will-meet-putin-for-ukraine-talks-13408879",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-vladimir-putin_6985699.jpg?20250808155049",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-08 22:05:00",
        "Headline": "The two presidents are expected to discuss the conflict in Ukraine - but the war-torn country's leader Volodymyr Zelenskyy will not be at the meeting.",
        "Content": " Donald Trump has announced his \"highly anticipated\" meeting with Vladimir Putin will take place next Friday in the US state of Alaska. The two presidents are expected to discuss the war in Ukraine - with the talks potentially leading to a breakthrough in Mr Trump's effort to end the conflict. But there's no guarantee it will stop the fighting since Moscow and Kyiv remain far apart on their conditions for peace. Earlier, the US president told reporters \"we're getting very close to a deal\" that would end the war. Mr Trump added there will be \"some swapping of territories to the betterment of both sides\". Follow latest: Ukraine war live updates  The meeting between the two leaders will be the first US-Russia summit since 2021, when former US President Joe Biden met Mr Putin in Switzerland. \n                  Chris Hemsworth describes 'gear shift' after learning he's 10 times more likely to get Alzheimer's\n                 \n                  Trump's Ukraine deadline for Putin arrives - as uncertainty remains over possible meeting\n                 \n                  Apollo 13 astronaut Jim Lovell dies\n                 Mr Trump wrote on Truth Social: \"The highly anticipated meeting between myself, as President of the United States of America, and President Vladimir Putin, of Russia, will take place next Friday, August 15, 2025, in the Great State of Alaska. Further details to follow. Thank you for your attention to this matter!\" The meeting was also confirmed by Kremlin aide Yury Ushakov, who said the leaders will \"focus on discussing options for achieving a long-term peaceful resolution to the Ukrainian crisis\". He added that the two presidents could meet in Russia in future and that an invitation has already been extended to Mr Trump. Yesterday, Mr Trump had told reporters at the White House that he couldn't announce where or when the meeting would take place but he would do so soon. He also suggested that his meeting with the Russian leader could come before any discussion involving Ukrainian President Volodymyr Zelenskyy. \"We're going to have a meeting with Russia, start off with Russia. And we'll announce a location. I think the location will be a very popular one,\" Mr Trump said. The US president added: \"President Putin, I believe, wants to see peace, and Zelenskyy wants to see peace ... in all fairness to President Zelenskyy, he's getting everything he needs to, assuming we get something done.\" Read more:Russia reacts to Trump talks planJD Vance raises concerns about free speech in UK Territory to form part of talks Speaking about the role that territory will play in the peace talks, Mr Trump said: \"You're looking at a territory that's been fought over for three-and-a-half years. A lot of Russians have died. A lot of Ukrainians have died. \"So we're looking at that, but we're actually looking to get some back, and some swapping. \"It's complicated, actually. Nothing is easy. It's very complicated. But we're going to get some back. \"We're going to get some switched. There'll be some swapping of territories to the betterment of both.\" Analysts, including some close to the Kremlin, have suggested that Russia could offer to give up territory it controls outside of the four regions it claims to have annexed. Pressed on if this was the last chance to make a major peace deal, Mr Trump said: \"I don't like using the term last chance ... when those guns start going off, it's awfully tough to get them to stop.\"  Western officials 'to meet in UK' Meanwhile, senior officials from the US, Ukraine and several European countries are due to meet in the UK this weekend to try and reach common positions ahead of the Trump-Putin meeting, according to Axios. Ukraine and several NATO allies are reported to be privately concerned that Mr Trump might agree to Mr Putin's proposals for ending the war without taking their positions into consideration. Since his return to the White House in January, Mr Trump has moved to mend relations with Russia and sought to end the war - with public comments veering between admiration and sharp criticism of Mr Putin. In a sign of his growing frustration with Russia's refusal to halt its military offensive, Mr Trump had threatened to impose new sanctions and tariffs against Moscow - and countries that buy its exports - unless the Kremlin agreed to end the conflict. A deadline was set for yesterday, but it is unclear whether these sanctions are taking effect, or if they will be delayed or cancelled in light of the talks. War grinds on ahead of talks The meeting has been arranged as Russia's bigger army is slowly advancing deeper into Ukraine at great cost in troops and armour while it relentlessly bombards Ukrainian cities. Ukrainian forces are locked in intense battles along the 620-mile frontline that snakes from northeast to southeast Ukraine. The Pokrovsk area of the eastern Donetsk region is taking the brunt of punishment as Russia seeks to break out into the neighbouring Dnipropetrovsk region."
    },
    {
        "title": "Trump's Ukraine deadline for Putin arrives - as uncertainty remains over possible meeting",
        "description": "Donald Trump has rowed back on an earlier claim that he will only meet with Vladimir Putin if Volodymyr Zelenskyy is also at the summit - as a US deadline for Moscow to avoid further sanctions arrives.",
        "url": "https://news.sky.com/story/trumps-ukraine-deadline-for-putin-arrives-as-uncertainty-remains-over-possible-meeting-13408418",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-putin-trump_6921632.jpg?20250519175843",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-08 01:27:00",
        "Headline": "Vladimir Putin's announcement that he is prepared to meet the US president came on the eve of a White House deadline for Moscow to show progress in ending the war or face sanctions.",
        "Content": " Donald Trump has rowed back on an earlier claim that he will only meet with Vladimir Putin if Volodymyr Zelenskyy is also at the summit - as a US deadline for Moscow to avoid further sanctions arrives. The Russian president said on Thursday that he hoped to meet the US leader next week, with the summit potentially taking place in the United Arab Emirates. Follow the latest updates from the war in Ukraine Mr Putin's announcement came on the eve of a White House deadline for Moscow to show progress towards ending the three-year-old war in Ukraine or suffer additional economic sanctions. Asked on Thursday if his deadline for Friday would hold, Mr Trump said of Mr Putin: \"It's going to be up to him. We're going to see what he has to say. It's going to be up to him. Very disappointed.\" Asked if Mr Putin needed to meet Volodymyr Zelenskyy in order to meet him, Mr Trump said: \"No, he doesn't.\" Sky News' US correspondent David Blevins said it was \"very difficult to gauge the prospect for a meeting\", with the last few days having left a number of questions unanswered - notably whether Russia is really more inclined to a ceasefire, and whether Mr Putin is ready to sit down with Mr Zelenskyy. \"It's difficult to see why Putin would be prepared to dilute his red lines at this point,\" Blevins said. Two White House officials and a senior administration official have told Sky News that secondary sanctions on Russia are still expected to be implemented on Friday. Meanwhile, Mr Trump has said on his Truth Social account that he will be hosting the president of Azerbaijan, Ilham Aliyev, and the prime minister of Armenia, Nikol Pashinyan, at the White House for an \"official Peace Signing Ceremony\" on Friday. He added: \"These two Nations have been at War for many years, resulting in the deaths of thousands of people. Many Leaders have tried to end the War, with no success, until now, thanks to 'TRUMP'.\" Mr Trump has long been hoping to add Ukraine to the list of wars he boasts of having stopped, claiming during the election last year he could do so in a single day, but has been frustrated since returning to office.  Putin suggests he won't meet with Zelenskyy It comes after a White House official told the Associated Press that a US-Russian summit wouldn't happen if Mr Putin did not agree to meet with Ukrainian president Mr Zelenskyy, but the official later said it only made it less likely. When asked about the prospect of meeting with Mr Zelenskyy, Mr Putin said on Thursday: \"I have already said many times that I have nothing against it in general, it is possible.\" However, he distanced himself from any such meeting happening soon, adding: \"But certain conditions must be created for this. But unfortunately, we are still far from creating such conditions.\" Read more:What could happen when Trump and Putin meet?Could Trump be close to ending the war in Ukraine?  White House Press Secretary Karoline Leavitt has said Mr Trump wants to meet both leaders because he wants this \"brutal war to end\". She added: \"The White House is working through the details of these potential meetings and details will be provided at the appropriate time.\" It is understood that the White House is preparing for the possibility of a bilateral or trilateral meeting as it remains unclear whether Mr Putin will be prepared to meet with the Ukrainian leader. Mr Zelenskyy said he had phone conversations with several European leaders on Thursday amid a flurry of diplomatic activity - as the Ukrainian government fears being sidelined by direct negotiations between Washington and Moscow."
    },
    {
        "title": "Apollo 13 astronaut Jim Lovell dies",
        "description": "Retired astronaut and the commander of the famous Apollo 13 mission, Jim Lovell, has died aged 97.",
        "url": "https://news.sky.com/story/apollo-13-astronaut-jim-lovell-dies-13408665",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lovell-astronaut_6985953.png?20250808203715",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-08 19:00:00",
        "Headline": "Jim Lovell went on four NASA spaceflights and helped turn the failed Apollo 13 moon mission into a triumph after managing to get back to Earth safely following an oxygen tank explosion.",
        "Content": "Retired astronaut and the commander of the famous Apollo 13 mission, Jim Lovell, has died aged 97. Lovell was one of NASA's most-travelled astronauts in the agency's first decade and flew four times - on Gemini 7, Gemini 8, Apollo 8 and Apollo 13. Lovell helped turn the failed Apollo 13 moon mission into a triumph after managing to get back to Earth safely following an oxygen tank explosion.   He was supposed to have become the fifth man to walk on the moon but the flight was thrown into jeopardy by the sudden explosion - which occurred when the spacecraft was 200,000 miles away from Earth. Lovell and the two other astronauts on board - Fred Haise and Jack Swigert - barely survived and spent four cold days in the cramped lunar module as a lifeboat while working with engineers and controllers on the ground to devise a rescue plan. In a post on X, NASA said: \"We are saddened by the passing of Jim Lovell, commander of Apollo 13 and a four-time spaceflight veteran. \"Lovell's life and work inspired millions. His courage under pressure helped forge our path to the Moon and beyond - a journey that continues today.\" The agency also shared a statement from Lovell's family, which read: \"We are enormously proud of his amazing life and career accomplishments, highlighted by his legendary leadership in pioneering human space flight. \"But, to all of us, he was Dad, Granddad, and the Leader of our family. Most importantly, he was our Hero. \"We will miss his unshakeable optimism, his sense of humour, and the way he made each of us feel we could do the impossible. He was truly one of a kind.\" NASA administrator Sean Duffy said Lovell's life and work \"inspired millions of people across the decades\". \"Jim's character and steadfast courage helped our nation reach the moon and turned a potential tragedy into a success from which we learned an enormous amount,\" he said. \"We mourn his passing even as we celebrate his achievements. \"From a pair of pioneering Gemini missions to the successes of Apollo, Jim helped our nation forge a historic path in space that carries us forward to upcoming Artemis missions to the moon and beyond.\" Read more:Remains of 9/11 victims identified 24 years onStar Wars actor settles Disney lawsuit Hollywood superstar Tom Hanks played Lovell in the 1995 film Apollo 13, bringing the astronaut renewed fame. In the movie, the line \"Houston, we have a problem\" is famously said by Hanks - but in real life, it was Swigert who spotted a warning light and said a slightly different sentence to Mission Control: \"Houston, we've had a problem here.\" The year of the film's release, Lovell was awarded the Congressional Space Medal of Honor by then US president Bill Clinton."
    },
    {
        "title": "My experience interviewing Nicholas Rossi - the fugitive in Scotland now facing a rape trial in Utah",
        "description": "There was always a heavy hint of charade in the company of \"Arthur Knight\".",
        "url": "https://news.sky.com/story/my-experience-interviewing-nicholas-rossi-the-fugitive-in-scotland-now-facing-a-rape-trial-in-utah-13408450",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rossi-nicholas_6985620.jpg?20250808142305",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2025-08-08 05:15:00",
        "Headline": "The tale of \"Arthur Knight\" - real name Nicholas Rossi - was one lifted from the pages of a fictional thriller - a fugitive pursued halfway across the world and discovered only when he had the misfortune to catch COVID and leave his tattoos exposed on a hospital ward.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n  There was always a heavy hint of charade in the company of \"Arthur Knight\". It was hard to square the man presenting as a bumbling aristocrat in Glasgow's west end with one of America's most wanted. And yet, there were always clues. Like his knowledge of Kay Burley. On the day I first arranged to interview him, he told me that TV was a mystery to him and that he never watched it. Then he said he hoped he wouldn't be nailed to the wall by Kay - our then Sky News colleague and presenter. How did he know Kay if he knew nothing about television, I wondered. He also asked how we would \"chyron\" him, an American term for an on-screen title that I was unfamiliar with (and I'm in the business). There was also the matter of the plasma TV screen on his front room wall - he knew TV, alright. Such was the international interest in the story of \"Arthur Knight\" - real name Nicholas Rossi - there was no escaping the attention of TV and everyone else. His was a tale lifted from the pages of a fictional thriller - a fugitive pursued halfway across the world and discovered only when he had the misfortune to catch COVID and leave his tattoos exposed on a hospital ward. Medical staff at Glasgow's Queen Elizabeth University Hospital did the eyes-on execution of an international manhunt. As careful as he was, Rossi left a digital footprint that US authorities followed to a flat in Glasgow. When we first arrived, he had been arrested but was out on bail. It was dark inside his flat, and there wasn't much floor space. Read more from Sky News:Putin: 'I'm not against meeting Zelenskyy' - WatchOasis gig beats Taylor Swift for most 'ground-shaking' concert It made movement difficult for Rossi because he was in a wheelchair. When physical movement demanded finesse, like in lifting him into a car, his wife Miranda manoeuvred him Sumo-wrestler style. Quite the spectacle. We sat down for a number of interviews with Rossi and his wife, Miranda. Always, he addressed my questions with the busy eyes of concentrated deceit. Once, he insisted on sitting with his back to a bookcase. It featured the tome Machiavelli, prominently in shot. It made me wonder how much of him was enjoying this. He was a performer, certainly, and I suppose he'd been thrust centre stage. 👉 Listen to Sky News Daily on your podcast app 👈 He claimed to be an Irish orphan, but he never did get the accent right. It was like a comedy fake when he wrapped an Irish lilt around gravelly tones. He would suddenly start to sound Irish when you reminded him that he was, eh, Irish. Not that he had the paperwork to prove it. There was no birth certificate, no ID for his parents, no idea of exactly where in Ireland he'd been born. He was the boy from nowhere because he knew he had to be - give any journalist a place to go looking for confirmation and therein lies a trail to ruin. So \"Arthur\" kept it vague - his freedom depended on it. When he did commit to detail, he ran into difficulty. He told me he'd been raised in homes run by the Christian Brothers in Ireland, and I asked him which ones, specifically. His reply was: \"St. Mary's and Sacred Heart.\" A quick check with the Christian Brothers revealed they have no facility named Sacred Heart in Ireland, and anything called St Mary's wasn't residential. Of course, it was never going to last for him. The extradition court in Edinburgh had fingerprint and photographic evidence, and there was a tattoo match, too. Next week sees the start of his latest trial. He is accused of raping a woman to whom he had been engaged. The allegations offer a duplication for Rossi's crime modus operandi - isolating women, refusing to leave their company, and engaging in sexual assault. \"Evil,\" is how he was described by Brian Coogan to me. Brian is a former state representative in Rhode Island who, at one stage, was on the verge of adopting the young Rossi. He was warned off by the adoption judge, who refused to let it happen, having seen the file on the young man. Violence in childhood duly extended into adulthood, and Rossi was convicted in 2008 after sexually assaulting Mary Grebinski on a college campus in Ohio. A DNA sample from that attack is what linked Rossi to rape in Utah, and it's what caused the long arm of the law to reach as far as Scotland. The footnote to the story concerns Miranda, Rossi's wife, whom he married in Bristol in 2020. Rossi faked his death in 2020, and his \"widow\", a woman by the name of Louise, ran around telling people he'd passed away. Father Bernard Healey, of Our Lady of Mercy Parish Church in Rhode Island, took a call from an English woman - sounding like \"Hyacinth Bouquet\". She said Rossi had died and asked if he would hold a memorial mass. The priest agreed, but when the invitations started going out on social media, he took a call from the police telling him to cancel the arrangements, as Rossi wasn't dead - he'd faked it and was in hiding. The voice that rang round reporting news of Nicholas' demise was familiar to anyone who has heard his wife Miranda. The two voices sound identical, indeed. How much was Miranda involved in the deceit? It remains an open question in a story about to enter a new chapter - this time, set in an Utah courtroom."
    },
    {
        "title": "US doubles reward for Venezuelan President Maduro's arrest to $50m",
        "description": "The US has doubled its award for the arrest of Venezuelan President Nicolas Maduro to $50m (&#163;37.2m) as it accuses him of working with cartels to flood the US with fentanyl-laced cocaine.",
        "url": "https://news.sky.com/story/us-doubles-reward-for-venezuelan-president-maduros-arrest-to-50m-13408486",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-nicolas-maduro-venezuela_6796259.jpg?20250110164929",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-08 09:12:00",
        "Headline": "Under US President Donald Trump's predecessor Joe Biden, the offer went up to $25m - the same amount the US offered for the capture of Osama bin Laden following the 11 September 2001 attacks. Now it's doubled to $50m.",
        "Content": "The US has doubled its award for the arrest of Venezuelan President Nicolas Maduro to $50m (£37.2m) as it accuses him of working with cartels to flood the US with fentanyl-laced cocaine. At the time Maduro was indicted in Manhattan federal court in 2020 on federal charges of narco-terrorism and conspiracy to import cocaine, the US offered a $15m reward for his arrest. Under US President Donald Trump's predecessor Joe Biden, the offer went up to $25m - the same amount the US offered for the capture of Osama bin Laden following the 11 September 2001 attacks. \"Under President Trump's leadership, Maduro will not escape justice and he will be held accountable for his despicable crimes,\" Attorney General Pam Bondi said Thursday in a video announcing the new reward. Ms Bondi said the Justice Department has seized more than $700m in assets linked to Maduro, including two private jets, and said nearly seven tonnes of seized cocaine had been traced directly to the leftist leader. Venezuelan foreign minister Yvan Gil released a statement characterising the reward as \"pathetic\" and accusing Ms Bondi of orchestrating a \"crude political propaganda operation\". Read more from Sky News:Trump's deadline for Putin to agree to Ukraine ceasefire arrivesOpenAI releases long-awaited AI chatbot upgrade \n                  Trump's approach to peacemaking is a choice between waging war or doing business\n                 \n                  Trump's Ukraine deadline for Putin arrives - as uncertainty remains over possible meeting\n                 \n                  Donald Trump holds White House ceremony\n                 \"We're not surprised, coming from whom it comes from. \"The same one who promised a nonexistent 'secret list' of Epstein and who wallows in scandals for political favours,\" Mr Gil said, referring to the backlash Ms Bondi faced after the Justice Department announced last month that a long-rumoured \"client list\" of convicted sex offender Jeffrey Epstein does not exist. \"Her show is a joke, a desperate distraction from her own misery.\""
    },
    {
        "title": "Mandalorian actor Gina Carano settles lawsuit with Disney – and thanks Elon Musk for funding it",
        "description": "Actor Gina Carano has settled her lawsuit with Disney and Lucasfilm after claiming she was wrongfully dismissed from The Mandalorian for expressing her political opinions.",
        "url": "https://news.sky.com/story/mandalorian-actor-gina-carano-settles-lawsuit-with-disney-8211-and-thanks-elon-musk-for-funding-it-13408494",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-gina-carano-mandalorian_6447118.jpg?20240207091815",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-08 09:53:00",
        "Headline": "Carano, 41,  was fired in February 2021 after starring as Rebel ranger Cara Dune in two series of the Disney+ Star Wars series The Mandalorian.",
        "Content": "Actor Gina Carano has settled her lawsuit with Disney and Lucasfilm after claiming she was wrongfully dismissed from The Mandalorian for expressing her political opinions. Carano was fired in February 2021 after starring as Rebel ranger Cara Dune in two series of the Disney+ Star Wars series The Mandalorian. According to court documents, it came after the 41-year-old referenced the Nazis' treatment of Jewish people while discussing current political differences in the US. At the time, production company Lucasfilm said in a statement that her \"social media posts denigrating people based on their cultural and religious identities are abhorrent and unacceptable\". But late on Thursday, she posted on X: \"I have come to an agreement with Disney/Lucasfilm which I believe is the best outcome for all parties involved.\" She added that she \"hopes this brings some healing to the force\". The details of the financial settlement have not been disclosed. When filing her lawsuit at the Californian District Court last year, she had sought $75,000 (£59,000) in damages. She also thanked Elon Musk for financing the lawsuit, despite the two having never met. \"I want to extend my deepest most heartfelt gratitude to Elon Musk, a man I've never met, who did this Good Samaritan deed for me in funding my lawsuit,\" she wrote in her post. \"Thank you Mr. Musk and X for backing my case and asking for nothing in return.\" The X owner is an ardent advocate of free speech and has funded similar legal battles previously. Read more from Sky NewsEddie Murphy 'will get an Oscar eventually'Diddy plotting to return to musicOasis gig more 'ground-shaking' than Taylor Swift's Carano signed off: \"I am excited to flip the page and move onto the next chapter. \"My desires remain in the arts, which is where I hope you will join me. Yes, I'm smiling. From my heart to yours, Gina.\" In response to the settlement, Lucasfilm said in a statement: \"Ms Carano was always well respected by her directors, co-stars, and staff, and she worked hard to perfect her craft while treating her colleagues with kindness and respect. \"With this lawsuit concluded, we look forward to identifying opportunities to work together with Ms. Carano in the near future.\" In legal documents, Carano's team claimed both Disney and Lucasfilm had \"targeted, harassed, publicly humiliated, defamed, and went to great lengths to destroy Carano's career\". She also alleged she was treated differently to her male colleagues. Neither company commented on these claims. Lawyer Gene Schaerr, managing partner at Schaerr Jaffe, said at the time: \"Disney bullied Ms Carano, trying to force her to conform to their views about cultural and political issues, and when that bullying failed, they fired her. \"Punishing employees for their speech on political or social issues is illegal under California law.\" Carano, who began her career as a mixed martial arts fighter, has starred in other Hollywood franchises, including Fast & Furious 6 as Riley Hicks, and Deadpool, in which she played Angel Dust."
    },
    {
        "title": "JD Vance's cordial - then candid - comments left no doubts over the UK-US disagreements",
        "description": "He was cordial, but he was candid.",
        "url": "https://news.sky.com/story/jd-vances-cordial-then-candid-comments-left-no-doubts-over-the-uk-us-disagreements-13408674",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-vance-lammy-chevening_6985768.jpg?20250808171846",
        "type": "US",
        "Author": "Jon Craig",
        "Date Published": "2025-08-08 16:00:00",
        "Headline": "Sitting next to his best British buddy David Lammy at Chevening House, US vice president JD Vance politely but firmly spelled out how the two countries are deeply divided on certain issues. ",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  He was cordial, but he was candid. Sitting next to his best British buddy, David Lammy, US vice president JD Vance politely but firmly spelt out how the two countries are deeply divided on the Middle East and free speech. As the pair met on Friday, first came the cordial part of the VP's remarks. He began by stressing the \"very special relationship between our two countries\". Flattery always goes down well in meetings between UK and US leaders. British politicians love to hear American politicians talk about \"the special relationship\". The cynical view, however, is that it's something the UK cares much more about than the US. But after the pleasantries came the candid part, as the splits on the big issues were laid bare in the vice president's answers to questions from reporters. First, he was questioned about the UK's decision to recognise the state of Palestine. \n                  JD Vance warns against UK going down 'dark path' of losing free speech during meeting with David Lammy\n                 \n                  Chevening is the ultimate ministerial perk – but the foreign secretary's mansion has an ungodly history\n                 \n                  Regime change: Is Trump about to 'Make Iran Great Again'?\n                 \"Do you think that's a bad decision?\" he was asked. In a court of law, that would be called a leading question. Diplomatically, Vance replied: \"We have no plans to recognise a Palestinian state. I don't know what it would mean to really recognise a Palestinian state, given the lack of a functional government there.\" But that was as far as he went. He could have said the US believes it's a terrible decision by the UK because it is Israel that has to make concessions, not Hamas, and it won't help the humanitarian crisis or free the hostages. But he didn't. Instead, very on-message, the vice president talked about President Trump's goals in the Middle East and Gaza, which he said were very simple. \"Number one, we want to make it so that Hamas cannot attack innocent Israeli civilians ever again and we think that has to come through the eradication of Hamas,\" he said. \"Second, the president has been very moved by these terrible images of a humanitarian crisis in Gaza. So we want to make sure that we solve that problem.\" But then came acknowledgment of the US-UK split. \"We may have some disagreements about how exactly to accomplish that goal, and we'll talk about that today.\" Then came the question about free speech in the UK. \"Do you bring any kind of message to the foreign secretary today on that subject?\" he was asked. As President Trump frequently claims, Vance said it was all Joe Biden's fault, for \"censoring rather than engaging with a diverse array of opinions\". He went on: \"Obviously, I've raised some criticism, concerns about our friends on this side of the Atlantic. \"But the thing that I'd say to the people of England or anybody else, to David, is many of the things that I worry most about were happening in the United States from 2020 to 2024 I just don't want other countries to follow us down what I think was a very dark path under the Biden administration.\" At that point, clearly not wanting to be dragged into further controversy about free speech by repeating his previous criticism, he attempted to bring the impromptu news conference to an end, declaring that Mr Lammy had \"a lot of things to do\". It wasn't very subtle, but it worked, apart from a half-hearted and unsuccessful attempt to tease an answer out of Mr Lammy about the split on Palestine. The foreign secretary wasn't falling for that one, however. Read more:Chevening's ungodly historyMP mistakes rowing team for migrant boat And let's face it, Vance was hardly going to denounce UK policy in the opulent Chevening drawing room while he and his family are being lavishly entertained by his buddy David over the weekend. But the vice president skilfully made clear where the two countries disagree. And left no one in any doubt about that."
    },
    {
        "title": "Remains of three 9/11 victims identified more than 20 years after attacks",
        "description": "The remains of three 9/11 victims have been identified thanks to evolving DNA technology, New York City authorities have said.",
        "url": "https://news.sky.com/story/remains-of-three-911-victims-identified-more-than-20-years-after-attacks-13408727",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-towers-setember-11_6985852.jpg?20250808190221",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-08 17:54:00",
        "Headline": "New York's medical examiner's office has tested and retested remains from the World Trade Center as DNA techniques have advanced over the past 24 years. ",
        "Content": "The remains of three 9/11 victims have been identified thanks to evolving DNA technology, New York City authorities have said. Officials announced on Thursday that they have identified the remains of Ryan D. Fitzgerald, a 26-year-old currency trader, Barbara A Keating, a 72-year-old retired non-profit executive, and another woman, whose name is being kept private at her family's request. They were identified through now-improved DNA testing of remains found in the wreckage after the attack on 11 September 2001, New York's medical examiner's office said. The remains of Keating and the woman were recovered in 2001, and Fitzgerald's remains were recovered the following year. Chief medical examiner Dr Jason Graham said in a statement: \"Each new identification testifies to the promise of science and sustained outreach to families despite the passage of time.\" \"We continue this work as our way of honouring the lost.\" Ms Keating was on her way home to California on American Airlines Flight 11 when it was hijacked by al Qaeda terrorists and deliberately crashed into the World Trade Center's North Tower. Her son, Paul Keating, told US media that genetic material from his mother's hairbrush was matched to DNA samples from relatives. Part of his mother's ATM card was the only other trace of her ever recovered from the debris, he said. Read more:California wildfire sees thousands evacuatedSuperman actor says he's joining ICE The 9/11 attacks saw two planes destroy the twin towers in New York, while a third crashed into the Pentagon and a fourth came down in Pennsylvania. A total of 2,977 people were killed, 2,753 of whom were in New York. Around 1,100 victims remain unidentified, the medical examiner's office said. It has steadily identified more remains in the 24 years since 9/11 by retesting fragments as techniques have advanced. New York Mayor Eric Adams said: \"We hope the families receiving answers from the Office of Chief Medical Examiner can take solace in the city's tireless dedication to this mission.\""
    },
    {
        "title": "Visma owners close to picking banks for £16bn London float",
        "description": "The owners of Visma, one of Europe's biggest software companies, are close to hiring bankers for a &#163;16bn flotation that would rank among the London market's biggest for years.",
        "url": "https://news.sky.com/story/visma-owners-close-to-picking-banks-for-16316bn-london-float-13408638",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-london-stock-exchange_6985692.jpg?20250808154241",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-08 14:40:00",
        "Headline": "Several of Wall Street's most prominent banks are expected to win leading roles this month on a listing that will rank among the City's largest for years, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owners of Visma, one of Europe's biggest software companies, are close to hiring bankers for a £16bn flotation that would rank among the London market's biggest for years. Sky News understands that Visma's board and shareholders have convened a beauty parade of investment banks in the last fortnight ahead of an initial public offering (IPO) likely to take place in 2026. Citi, Goldman Sachs, JP Morgan and Morgan Stanley are understood to be among those in contention for the top roles on the deal, City insiders said on Friday. Several banks are expected to be appointed as global coordinators on the IPO as soon as this month.  Visma is a Norwegian company which supplies accounting, payroll, HR and other business software to well over one million small business customers. It has grown at a rapid rate in recent years, both organically and through scores of acquisitions, and has seen its profitability and valuation rise substantially during that period. \n                  Carlyle to seize control of online retailer Very Group from Barclay family\n                 \n                  Rachel Reeves said this flagship policy would raise money - it may end up doing the opposite\n                 \n                  Money blog: The most complained-about broadband, TV and mobile providers named\n                 The business is now valued at about €19bn (£16.4bn) and is partly owned by a number of sovereign wealth funds and other private equity firms. The majority of the company is owned by Hg, the London-based private equity firm which has backed a string of spectacularly successful companies in the software industry. Visma's owners' decision to pick the UK ahead of competition from Amsterdam represents a welcome boost to the City amid ongoing questions about the attractiveness of the London stock market to international companies. Rachel Reeves, the chancellor, used last month's speech at Mansion House to launch a taskforce aimed at generating additional IPO activity in the UK. Spokespeople claiming to represent Visma at Kekst, a communications firm, did not respond to a series of enquiries about the IPO appointments. Hg also failed to respond to a request for comment."
    },
    {
        "title": "Carlyle to seize control of online retailer Very Group from Barclay family",
        "description": "The American investment giant Carlyle is preparing to take control of Very Group, one of Britain's biggest online retailers, in a deal that will end the Barclay family's long tenure at another major UK company.",
        "url": "https://news.sky.com/story/carlyle-to-seize-control-of-online-retailer-very-group-from-barclay-family-13408529",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-very-group-verygroup_6985453.jpg?20250808104049",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-08 09:51:00",
        "Headline": "The US private equity giant is expected to step in to take ownership of one of Britain's biggest online retailers from the Barclay family as early as this autumn, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The American investment giant Carlyle is preparing to take control of Very Group, one of Britain's biggest online retailers, in a deal that will end the Barclay family's long tenure at another major UK company. Sky News has learnt that Carlyle, which is the biggest lender to Very Group's immediate parent company, could assume ownership of the retailer as soon as October under the terms of its financing arrangements. On Friday, sources said that Carlyle was expected to hold further talks in the coming weeks with fellow creditors including IMI, the Abu Dhabi-based vehicle which assumed part of Very Group's debts in a complex deal related to ownership of the Telegraph newspaper titles. Carlyle will probably end up holding a majority stake in Very Group, which has about 4.5 million customers, once it exercises a 'step-in right' which effectively converts its debt into equity ownership, the sources said. Very Group - which is chaired by the former Conservative chancellor Nadhim Zahawi - borrowed a further £600m from Arini, a Mayfair-based fund, earlier this year as it sought to stave off a cash crunch and buy itself breathing space. Precise details of the company's capital and ownership structure will be thrashed out before the change of control rights are triggered at the beginning of October. The Barclay family drew up plans to hire bankers to run an auction of Very Group earlier this year, but a process was never formally launched. \n                  Visma owners close to picking banks for £16bn London float\n                 \n                  Rachel Reeves said this flagship policy would raise money - it may end up doing the opposite\n                 \n                  Money blog: The most complained-about broadband, TV and mobile providers named\n                 Carlyle, which declined to comment, may hold onto the business for a further period before looking to offload it. IMI is also likely to end up with an equity stake or a preferred position in the recapitalised company's debt structure, sources added. Prospective bidders for Very Group were expected to be courted on the basis of its technology-driven financial services arm as well as the core retail offering which sells everything from electrical goods to fashion. Retail industry insiders have long speculated that the business was likely to be valued in the region of £2.5bn - below the valuation which the Barclay family was holding out for in an auction which took place several years ago. Very Group - previously known as Shop Direct - is one of the UK's biggest online shopping businesses, owning the Very and Littlewoods brands and employing 3,700 people. It boasts well over £2bn in annual sales, with about one-fifth of that generated by its Very Finance consumer lending arm. Mr Zahawi was appointed as the company's chairman last year, days after he announced that he was standing down as the MP for Stratford-on-Avon at July's general election. He replaced Aidan Barclay, a senior member of the family which has owned the business for decades. In the 39 weeks to 29 March, Very Group reported a 3.8% fall in revenue to £1.67bn, which it said included \"a decrease in Littlewoods revenue of 15.1%, reflecting the ongoing managed decline of this business\". Nevertheless, it said sales in its home and sports categories were performing strongly. IMI's position is expected to be pivotal to the talks about the future of the business, given Abu Dhabi's status as an important global backer of buyout, credit and infrastructure funds such as those raised and managed by Carlyle. The UAE vehicle is expected to emerge from the protracted saga over the Telegraph's ownership with a 15% stake in the newspapers. Under the original deal struck in 2023, RedBird and IMI paid a total of £1.2bn to refinance the Barclay family's debts to Lloyds Banking Group, with half tied to the media assets and the other half - solely funded by IMI - secured against other family assets including part of Very Group's debt pile. The Barclays, who used to own London's Ritz hotel, have already lost control of other corporate assets including the Yodel parcel delivery service. A spokesman for Very Group declined to comment, while IMI also declined to comment."
    },
    {
        "title": "Citroen urged to fix 'chaotic' recall and pay compensation to affected drivers",
        "description": "Citroen has been told to improve its \"chaotic\" and \"shameful\" recall over a potentially fatal airbag safety fault.&#160;",
        "url": "https://news.sky.com/story/citroen-urged-to-fix-chaotic-recall-and-pay-compensation-to-affected-drivers-13408540",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-citroen-money_6985496.jpg?20250808112542",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-08 10:14:00",
        "Headline": "A \"stop-drive\" recall was issued in June for all Citroen C3 second-generation and DS 3 first-generation vehicles made between 2009 and 2019 due to the risk of the airbag rupturing in a collision, which can cause injury or death.",
        "Content": "Citroen has been told to improve its \"chaotic\" and \"shameful\" recall over a potentially fatal airbag safety fault.  Consumer champion Which? wants the government to intervene if Stellantis, the car brand's parent company, does not improve the process for fixing the fault and offering customers compensation. Read all the latest Money news here A \"stop-drive\" recall was issued in June for all Citroen C3 second-generation and DS 3 first-generation vehicles made between 2009 and 2019 due to the risk of the airbag rupturing in a collision, which can cause injury or death. All affected vehicles are expected to be fixed by the end of next month. Customers were told to \"immediately cease using their vehicle\", but Which? has raised concerns over how this message has been shared. It says it has spoken to several distressed drivers, including the mother of a premature baby who needs hospital treatment and a woman caring for her terminally ill husband, who have been left without transport for weeks or months and forced to hire cars and taxis. A few owners who told Which? they were being offered compensation said they were getting a maximum of £22.50 a day - far less than the cost of car hire in most regions. Sue Davies, head of consumer protection policy at Which?, said: \"From people left stranded with no means of transport, to those paying out a fortune to hire cars and taxis, the emotional and financial burden of this recall has fallen squarely on those least able to absorb it. \"Stellantis must urgently confirm it will pay compensation for alternative transport as well as offer practical solutions, such as offering at-home repairs or towing affected cars to garages. If not, many people will see no alternative but to continue driving cars that are potentially very dangerous. \"The government needs to step in and hold them to account to ensure UK consumers have much greater clarity of what they need to do and what they are entitled to - and are never left in this position again.\" The Driver and Vehicle Standards Agency, the government body that oversees car safety recalls, told Money it was in contact with Citroen on how it is managing the recall. \"We have received reassurances the company is working hard to arrange repairs and minimise disruption for vehicle owners. However, we know there is more that can be done and we continue to reinforce their responsibilities under the code of practice,\" it said. \"We urge all owners of affected vehicles to follow Citroen's advice. To check if your vehicle is affected, car owners can use the checker on Citroen's website.\" The Department for Transport told Money that Heidi Alexander, the transport secretary, and Lilian Greenwood, future of roads minister, were \"actively engaging with manufacturers and industry leaders to ensure any disruption is kept to an absolute minimum\". It added: \"We understand how frustrating these recalls are for those affected. The safety of those drivers and their families remains the transport secretary's top priority.\" Stellantis said: \"The company's focus remains on completing the replacement of airbags in affected vehicles as swiftly as possible. \"Our Citroen network is fully engaged in maximising the number of cars that can be completed every day and, to increase our repair capacity even further and minimise as much as possible the impact on customers, our Peugeot network is now authorised to replace airbags on these cars in addition to at-home options. \"For each and every customer, we discuss options to support mobility, recognising that every driver has specific requirements. These options include replacement airbags at a dealership or at home, courtesy car, support for other mobility options and recovery. We give priority to those with the most urgent needs.\" If you are unsure if you've been affected by the recall, you can contact a Stellantis dealership, which will check for you, or visit the official recall site for your specific vehicle brand."
    },
    {
        "title": "Cheap Eats: Top chef on why Rick Stein is the 'real deal' and how you should complain",
        "description": "Every week, our <a href=\"https://news.sky.com/story/money-latest-interest-rate-cut-decision-bank-of-england-consumer-personal-finance-blog-sky-news-deals-13040934\" target=\"_blank\">Money</a> team interviews top chefs from around the UK, hearing about their cheap food hacks, views on the industry and more.",
        "url": "https://news.sky.com/story/cheap-eats-top-chef-on-why-rick-stein-is-the-real-deal-and-how-you-should-complain-13408535",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-money-cheap-eats-chef_6985293.jpg?20250808060310",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-08 10:02:00",
        "Headline": "The Sky News Money blog team interviews chefs every week for our regular Cheap Eats feature. Today, co-founder of Genuine Restaurants Group Sam Harrison shares his thoughts on Google reviews, his most hated customer habit and his weakness for Pizza Express.",
        "Content": "Every week, our Money team interviews top chefs from around the UK, hearing about their cheap food hacks, views on the industry and more. Today, they speak to the co-founder of Genuine Restaurants Group, Sam Harrison... My favourite cheap eat is... Burnt on Askew Road in Shepherd's Bush, west London - it's a great spot for brunch or lunch. I can have breakfast and a coffee or a stunning sandwich and juice for lunch for under £15. It is independently owned and the owners work really hard. It's exactly the sort of place we should be supporting. I will always have a weakness for Pizza Express... I think it goes back to my childhood and how long the brand has been around. When I order an American Hot pizza, I know exactly what I'm going to get. We serve complimentary filtered still and sparkling water... as I think a lot of people are tired of being forced to drink expensive mineral water and then charged for service on top. It is very important for guests to say there and then if they are unhappy... or would like something changed. Mistakes can happen and any good restaurant will want to get it right there and then. I fully understand some people find it awkward or embarrassing to say anything, so restaurants should make it very easy and comfortable for them. It is about caring for your guests. Google reviews are very important but... there is nothing to stop false reviews. We have had reviews posted that weren't even for our restaurant and getting them removed is almost impossible. You have to work and strive every day to be the very best you can to survive in hospitality in 2025... It is as simple as that. A lot of restaurants are closing and more will. Those who deserve to will survive, but it's tough at the moment for everyone. If I were prime minister for the day... I'd lower VAT for a start, and also I'd want to open up the flow of workforce to make it easier to recruit and retain staff. I'd also look at tax incentives for entrepreneurs to help support businesses to grow and thrive. Each time we open somewhere new, we create jobs and boost the local economy and the government needs to support this and to make the reward more proportional to the risk. Rick Stein is... the real deal. Rick and his ex-wife Jill taught me almost everything I know about running restaurants. Every day they showed me the importance of hard work and how it never stops. If you want to be the best, then you have to be setting standards day in and day out. Obviously Rick is famous as a chef, but he is also a brilliant people person - he just really gets people. Rick and Jill always put their guests first, as all hospitality owners should. One thing I hate customers doing is when they... click their fingers… yes, it is still a thing. A good restaurant should have good wines at all levels and all price points... I am very proud of our house wine at £29, but I think the more expensive wines do reflect even better quality. More Cheap Eats:'Celebrity chefs are worst thing in industry'Top chef on overrated trend he doesn't get'We charge diners £225 for our tasting menu' I like restaurants where the mobile reception doesn't work... It's fun to take photos to remember the occasion, but it's nice to see diners enjoying each other's company and chatting without a phone in sight too. Customers eat out a lot more now... and have so much choice in terms of restaurants and also delivery. So you have to work harder than ever to win them over as regulars. But I think that is a good thing. On the whole, we are very lucky because we have incredible guests who have been coming to my places for 20 years. They must like what we do!"
    },
    {
        "title": "JD Vance warns against UK going down 'dark path' of losing free speech during meeting with David Lammy",
        "description": "JD Vance has said he does not want the UK to go down a \"very dark path\" of losing free speech during a meeting with the foreign secretary at his country estate.",
        "url": "https://news.sky.com/story/jd-vance-warns-against-uk-going-down-dark-path-of-losing-free-speech-during-meeting-with-david-lammy-13408626",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jd-vance-us-vice-president_6985706.jpg?20250808155649",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-08 14:11:00",
        "Headline": "The vice president and the UK's foreign secretary held a televised meeting during the Vance family's summer holiday to England.",
        "Content": " JD Vance has said he does not want the UK to go down a \"very dark path\" of losing free speech during a meeting with the foreign secretary at his country estate. The US vice president has previously raised concerns that free speech is being eroded in the UK. However, during a two-day visit to David Lammy's grace and favour 115-room mansion, Chevening House in Kent, Mr Vance kept his criticism a bit more low key.  Asked about free speech in the UK during a televised meeting of the two men, Mr Vance said he has \"raised concerns\" about free speech in his own country and accused the West of \"censoring rather than engaging\" with different opinions. He said: \"I think the entire collective West, the transatlantic relationship, our NATO allies, certainly the United States under the Biden administration, got a little too comfortable with censoring rather than engaging with a diverse array of opinions. So that's been my view. \"Obviously, I've raised some criticism, concerns about our friends on this side of the Atlantic. \"But the thing that I'd say to the people of England or anybody else, to David, is many of the things that I worry most about were happening in the United States from 2020 to 2024. \"I just don't want other countries to follow us down what I think was a very dark path under the Biden administration.\" Mr Lammy, who has struck up the unlikely relationship over the past few months, did not comment on Mr Vance's indirect criticism. In February, when Sir Keir Starmer was carrying out a similar televised meeting with Donald Trump in the Oval Office, Mr Vance said \"infringements on free speech\" now do not just affect the British, but also American tech companies - \"and by extension American citizens\". Sir Keir quickly interjected, saying: \"We've had free speech for a very long time, it will last a long time, and we are very proud of that.\" Mr Vance and his family are staying with Mr Lammy at Chevening for two days before heading to the Cotswolds for a summer holiday. The vice president was effusive in his praise for the grand estate that comes with Mr Lammy's job, saying \"being here lifts up the human spirit\" as he thanked the \"people of England\" for having such a \"beautiful place for foreigners like me to come and talk about the issues of the day\". He added that he \"loves the UK\". Read more:MP alerts coastguard to 'migrants' - who were charity rowing teamHomelessness minister resigns after 'extortionate' rent hike claims The two politicians went fishing ahead of their meeting, with Mr Vance revealing he caught a few, while all three of his children caught a fish but Mr Lammy did not. He also said his children had fallen asleep on the floor of the large house, and his three-year-old daughter kept asking if she would see Mr Lammy's daughter. Mr Lammy posted a picture of him and Mr Vance laughing as they fished, saying it was a \"real pleasure\" to welcome the Vance family and the vice president \"gave me fishing tips, Kentucky style\". JD Vance confirmed he will holiday in Scotland next week in a trip that could see up to 1,000 police officers deployed as part of security efforts. He confirmed his Scottish trip during talks with Mr Lammy on Friday. Sky News understands the Vance family are likely to visit Ayrshire, the same area where Mr Trump recently stayed where he secured a trade deal with the European Union. Police sources have suggested approximately 1,000 officers will be working across the visit to ensure the vice president and his loved ones are safe, Sky News' Scotland correspondent Conner Gillies reported. Police Scotland declined to comment on the specifics. It is understood the Vance family will not be staying at Trump Turnberry, the luxury Ayrshire resort owned by the US president himself. A Police Scotland spokesperson said: \"Planning is under way for a potential visit to Scotland by the vice president of the United States. \"Details of any visit would be for the White House to comment on, however it is important that we prepare in advance for what would be a significant policing operation.\""
    },
    {
        "title": "JD Vance's cordial - then candid - comments left no doubts over the UK-US disagreements",
        "description": "He was cordial, but he was candid.",
        "url": "https://news.sky.com/story/jd-vances-cordial-then-candid-comments-left-no-doubts-over-the-uk-us-disagreements-13408674",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-vance-lammy-chevening_6985768.jpg?20250808171846",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-08-08 16:00:00",
        "Headline": "Sitting next to his best British buddy David Lammy at Chevening House, US vice president JD Vance politely but firmly spelled out how the two countries are deeply divided on certain issues. ",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  He was cordial, but he was candid. Sitting next to his best British buddy, David Lammy, US vice president JD Vance politely but firmly spelt out how the two countries are deeply divided on the Middle East and free speech. As the pair met on Friday, first came the cordial part of the VP's remarks. He began by stressing the \"very special relationship between our two countries\". Flattery always goes down well in meetings between UK and US leaders. British politicians love to hear American politicians talk about \"the special relationship\". The cynical view, however, is that it's something the UK cares much more about than the US. But after the pleasantries came the candid part, as the splits on the big issues were laid bare in the vice president's answers to questions from reporters. First, he was questioned about the UK's decision to recognise the state of Palestine. \n                  JD Vance warns against UK going down 'dark path' of losing free speech during meeting with David Lammy\n                 \n                  Chevening is the ultimate ministerial perk – but the foreign secretary's mansion has an ungodly history\n                 \n                  Regime change: Is Trump about to 'Make Iran Great Again'?\n                 \"Do you think that's a bad decision?\" he was asked. In a court of law, that would be called a leading question. Diplomatically, Vance replied: \"We have no plans to recognise a Palestinian state. I don't know what it would mean to really recognise a Palestinian state, given the lack of a functional government there.\" But that was as far as he went. He could have said the US believes it's a terrible decision by the UK because it is Israel that has to make concessions, not Hamas, and it won't help the humanitarian crisis or free the hostages. But he didn't. Instead, very on-message, the vice president talked about President Trump's goals in the Middle East and Gaza, which he said were very simple. \"Number one, we want to make it so that Hamas cannot attack innocent Israeli civilians ever again and we think that has to come through the eradication of Hamas,\" he said. \"Second, the president has been very moved by these terrible images of a humanitarian crisis in Gaza. So we want to make sure that we solve that problem.\" But then came acknowledgment of the US-UK split. \"We may have some disagreements about how exactly to accomplish that goal, and we'll talk about that today.\" Then came the question about free speech in the UK. \"Do you bring any kind of message to the foreign secretary today on that subject?\" he was asked. As President Trump frequently claims, Vance said it was all Joe Biden's fault, for \"censoring rather than engaging with a diverse array of opinions\". He went on: \"Obviously, I've raised some criticism, concerns about our friends on this side of the Atlantic. \"But the thing that I'd say to the people of England or anybody else, to David, is many of the things that I worry most about were happening in the United States from 2020 to 2024 I just don't want other countries to follow us down what I think was a very dark path under the Biden administration.\" At that point, clearly not wanting to be dragged into further controversy about free speech by repeating his previous criticism, he attempted to bring the impromptu news conference to an end, declaring that Mr Lammy had \"a lot of things to do\". It wasn't very subtle, but it worked, apart from a half-hearted and unsuccessful attempt to tease an answer out of Mr Lammy about the split on Palestine. The foreign secretary wasn't falling for that one, however. Read more:Chevening's ungodly historyMP mistakes rowing team for migrant boat And let's face it, Vance was hardly going to denounce UK policy in the opulent Chevening drawing room while he and his family are being lavishly entertained by his buddy David over the weekend. But the vice president skilfully made clear where the two countries disagree. And left no one in any doubt about that."
    },
    {
        "title": "Ex-Reform MP Rupert Lowe alerts coastguard to 'migrants' - who were a charity rowing team",
        "description": "MP Rupert Lowe alerted the coastguard to potential migrants on a boat - who turned out to be a charity rowing crew.",
        "url": "https://news.sky.com/story/ex-reform-mp-rupert-lowe-alerts-coastguard-to-migrants-who-were-a-charity-rowing-team-13408534",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rupert-lowe-row4mnd_6985493.jpg?20250808111913",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-08 10:01:00",
        "Headline": "The MP has donated to the crew's cause but said he makes no apologies for being vigilant about small boat migrants.",
        "Content": "MP Rupert Lowe alerted the coastguard to potential migrants on a boat - who turned out to be a charity rowing crew. The independent Great Yarmouth MP posted a picture on social media on Thursday night of a boat near some wind turbines off the Norfolk Coast, saying he had alerted the authorities. He wrote dinghies were coming into Great Yarmouth, \"RIGHT NOW\". \"If these are illegal migrants, I will be using every tool at my disposal to ensure those individuals are deported,\" he added. Politics latest: Lammy to meet US vice president in UK But the \"dinghy\" was actually an ocean rowing boat crewed by ROW4MND, a team of four attempting to row from Land's End to John O'Groats for motor neurone disease research. Mr Lowe, who was suspended from Reform UK in March, posted on Friday morning that it was a \"false alarm\" and was a boat of charity rowers, \"thank goodness\". \n                  Why next year's Scottish elections could get messy\n                 \n                  Fact-checking Farage: Are foreigners more likely than Britons to commit sexual offences?\n                 \n                  Nigel Farage demands apology over 'disgusting' Jimmy Savile comparison\n                 He said he would donate £1,000 to their charity \"as a well done\" - but warned people to \"watch out for any real illegal migrants\". \"We received a huge number of urgent complaints from constituents - I make no apologies over being vigilant for my constituents. It is a national crisis,\" he wrote. \"No mass deportations for the charity rowers, but we definitely need it for the illegal migrants!\" Police wanted to send a boat to check It is the first of four gruelling rows the crew will take over four years in an attempt to raise £57m for motor neurone disease research, inspired by the deaths of rugby players Rob Burrow and Doddie Weir from the condition. Matthew Parker, Mike Bates, Aaron Kneebone and Liz Wardley said the coastguard initially contacted them and asked if they could see a dinghy nearby. Ex-Royal Marine Mr Bates, a British record holder for rowing across the Atlantic solo, said it soon became clear the coastguard was asking about their boat. \"I looked to my right and there was maybe a dozen individuals stood on the shoreline staring at us,\" he told the PA news agency. After the coastguard accepted they were not carrying migrants, they rowed on through the night but hours later were contacted again by the coastguard because the police had \"asked if they could send a lifeboat out to check who we were\". 'I've not been mistaken for a migrant before' A friend then forwarded Mr Lowe's post, which Mr Bates said was \"a moment of light relief\". \"We found it hilarious. I've not been mistaken for a migrant before,\" he said. \"The best comment was the one asking where the Royal Navy were when you need them. I'm a former Royal Marine, so the Royal Navy were on the boat. \"But it was almost like a vigilante-style, people following us down the beach. \"They hadn't twigged that we were parallel to the shore for hours and not trying to land.\" Read more:Is Corbyn's comeback a headache for Starmer - or a red herring? Gruelling four-year challenge The crew set off from Land's End on 25 July, heading north, but bad weather forced them to stop, and they decided to return to Land's End and start again, heading anticlockwise around the UK. Next year, the team is hoping to row from John O'Groats to Land's End, then from California to Hawaii in 2027 and New York to London in 2028. Mr Bates said: \"We're rowing for hope, we're rowing to find a cure, and hopefully we'll raise £57m - we certainly will if MPs keep talking about us. Maybe Rupert will give us a donation.\""
    },
    {
        "title": "Chevening is the ultimate ministerial perk – but the foreign secretary's mansion has an ungodly history",
        "description": "Welcome to the house of scandal, scares and squabbles, Mr Vice President.",
        "url": "https://news.sky.com/story/chevening-is-the-ultimate-ministerial-perk-8211-but-the-foreign-secretarys-mansion-has-an-ungodly-history-13408607",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jd-vance-david-lammy_6985600.jpg?20250808135753",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-08-08 13:34:00",
        "Headline": "David Lammy is this weekend hosting JD Vance at the grace-and-favour mansion - where scandals and squabbles aplenty have taken place over the years.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Welcome to the house of scandal, scares and squabbles, Mr Vice President. Chevening is the ultimate ministerial perk. Apart from the prime minister's hideaway, Chequers, it's the most lavish of all government grace-and-favour mansions. Foreign Secretary David Lammy says he and his weekend house guest JD Vance get on because they \"share a similar working-class background\" and are \"both Christians\".  Politics latest: JD Vance arrives in the UK But Chevening could not be more upper class. It was home to earls, viscounts and other titled aristocrats for 250 years - and has had an ungodly history. Set in 3,000 acres in Kent countryside, this 17th-century mansion has a lake, marble fireplaces and chandeliers, 13 Roman tombstones and a suit of armour from the Spanish Armada. Chevening faced scandal in 1999 when Labour foreign secretary Robin Cook's ex-wife, Margaret, who loved the place, vented her fury at him taking second wife, Gaynor Regan, who had been his mistress, to Chevening. In a bitter memoir, A Slight and Delicate Creature, in which she accused him of womanising and drunkenness, Margaret wrote acidly that she hoped Gaynor enjoyed the food and drink that she had paid for. In 2020, at the start of the Covid pandemic, just weeks after divorcing his wife Marina, PM Boris Johnson was accused of missing Cobra meetings as he spent two weeks at Chevening with then-girlfriend Carrie Symonds, now his wife. The most alarming scare came when a senior diplomat apparently could not escape Chevening's maze. It's claimed that an Italian ambassador who was not very tall had ventured into the maze. So the story goes, wearing an exquisite dark blue designer suit and Gucci loafers, His Excellency was lost in the maze for over an hour and tore his clothes and muddied his fancy shoes. Squabbles over the tenancy of this jewel of HM Government's grace-and-favour mansions date back to Margaret Thatcher and Sir Geoffrey Howe and have continued to a present-day rivalry between Mr Lammy and Angela Rayner. It's claimed that back in 1989, Sir Geoffrey, furious at being shuffled by Mrs Thatcher from the Foreign Office to Leader of the Commons, turned political assassin and triggered her downfall partly because of the bitter blow of losing Chevening. In David Cameron's Coalition government, foreign secretary William Hague and the Liberal Democrat deputy PM Nick Clegg were forced to take it in turns to enjoy weekends in Chevening's luxury. And under Theresa May, Mr Johnson - then foreign secretary - was forced to share with not one ministerial colleague but two, Brexit secretary David Davis and international trade secretary Liam Fox. More recently, another foreign secretary, Liz Truss, and deputy PM Dominic Raab fought a bitter battle over who was entitled to spend weekends there. Eventually, she called it an \"exalted flat share\". And embarrassingly, when she became PM, she was asked to repay £12,000 for missing bathrobes, lavish dinners and wine-fuelled summer parties during her Tory leadership campaign, though she disputed the amount. After Labour's election victory last year, deputy PM Rayner was said to have \"locked horns\" with Mr Lammy over Chevening after she lost out to Rachel Reeves over the Dorneywood grace-and-favour mansion. In the Blair years, hair-shirt chancellor Gordon Brown had no interest in luxury stately homes, so Dorneywood was given to John Prescott, who was famously photographed playing croquet when he was supposed to be running the country. Read more:MP mistakes rowing team for migrant boatInside Corbyn's new party This weekend, despite Chevening's ungodly history, Mr Lammy and Mr Vance are expected to deepen their relationship by attending 12th-century St Botolph's Church, which is inside the vast grounds. In March this year, as their transatlantic bromance was burgeoning, they took mass together at the vice president's residence in Washington when Vance hosted the Lammy family. So with relations between the Labour foreign secretary and the Republican vice president so cordial, what could possibly go wrong? Just don't go in the maze, JD."
    },
    {
        "title": "Apollo 13 astronaut Jim Lovell dies",
        "description": "Retired astronaut and the commander of the famous Apollo 13 mission, Jim Lovell, has died aged 97.",
        "url": "https://news.sky.com/story/apollo-13-astronaut-jim-lovell-dies-13408665",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lovell-astronaut_6985953.png?20250808203715",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-08 19:00:00",
        "Headline": "Jim Lovell went on four NASA spaceflights and helped turn the failed Apollo 13 moon mission into a triumph after managing to get back to Earth safely following an oxygen tank explosion.",
        "Content": "Retired astronaut and the commander of the famous Apollo 13 mission, Jim Lovell, has died aged 97. Lovell was one of NASA's most-travelled astronauts in the agency's first decade and flew four times - on Gemini 7, Gemini 8, Apollo 8 and Apollo 13. Lovell helped turn the failed Apollo 13 moon mission into a triumph after managing to get back to Earth safely following an oxygen tank explosion.   He was supposed to have become the fifth man to walk on the moon but the flight was thrown into jeopardy by the sudden explosion - which occurred when the spacecraft was 200,000 miles away from Earth. Lovell and the two other astronauts on board - Fred Haise and Jack Swigert - barely survived and spent four cold days in the cramped lunar module as a lifeboat while working with engineers and controllers on the ground to devise a rescue plan. In a post on X, NASA said: \"We are saddened by the passing of Jim Lovell, commander of Apollo 13 and a four-time spaceflight veteran. \"Lovell's life and work inspired millions. His courage under pressure helped forge our path to the Moon and beyond - a journey that continues today.\" The agency also shared a statement from Lovell's family, which read: \"We are enormously proud of his amazing life and career accomplishments, highlighted by his legendary leadership in pioneering human space flight. \"But, to all of us, he was Dad, Granddad, and the Leader of our family. Most importantly, he was our Hero. \"We will miss his unshakeable optimism, his sense of humour, and the way he made each of us feel we could do the impossible. He was truly one of a kind.\" NASA administrator Sean Duffy said Lovell's life and work \"inspired millions of people across the decades\". \"Jim's character and steadfast courage helped our nation reach the moon and turned a potential tragedy into a success from which we learned an enormous amount,\" he said. \"We mourn his passing even as we celebrate his achievements. \"From a pair of pioneering Gemini missions to the successes of Apollo, Jim helped our nation forge a historic path in space that carries us forward to upcoming Artemis missions to the moon and beyond.\" Read more:Remains of 9/11 victims identified 24 years onStar Wars actor settles Disney lawsuit Hollywood superstar Tom Hanks played Lovell in the 1995 film Apollo 13, bringing the astronaut renewed fame. In the movie, the line \"Houston, we have a problem\" is famously said by Hanks - but in real life, it was Swigert who spotted a warning light and said a slightly different sentence to Mission Control: \"Houston, we've had a problem here.\" The year of the film's release, Lovell was awarded the Congressional Space Medal of Honor by then US president Bill Clinton."
    },
    {
        "title": "At least two dead as wildfires sweep across Greece, Turkey and France",
        "description": "A least two people have died and two others are reported to have died after wildfires tore across southern Europe.",
        "url": "https://news.sky.com/story/at-least-two-dead-as-wildfires-sweep-across-greece-turkey-and-france-13408773",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-athens-greece-wildfire_6985908.jpg?20250808200701",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-08 18:57:00",
        "Headline": "Fast-moving flames, fanned by strong winds, are approaching Athens while the Dardanelles was temporarily shut to shipping.",
        "Content": "A least two people have died and two others are reported to have died after wildfires tore across southern Europe. Fast-moving flames, fanned by strong winds, crossed scrub-covered hillsides in the Keratea region of Greece, getting close to residential areas around 25 miles southeast of Athens on Friday. One man was found dead in Keratea during an evacuation, the Fire Service said. Ukraine war latest - peace deal close - Trump  Two Vietnamese tourists died after falling in the water amid strong winds on the tourist island of Milos in the Cyclades, France24.com said, quoting the Coastguard. Authorities said 190 firefighters, using planes and helicopters to drop water, battled the blazes as thick clouds of black smoke filled the sky. Wildfires in neighbouring Turkey forced the temporary closure of the Dardanelles Strait to shipping because of heavy smoke and reduced visibility in the narrow waterway. A university campus and a care home for the elderly in northwestern Turkey were evacuated by authorities after another fire, which started in a field near Saricaeli village, in Canakkale province, quickly spread to a nearby forested area.  Firefighters in France who contained the country's largest wildfire in decades are on high alert because it is feared forecast high temperatures this weekend could reignite it. One person died as the blazes quickly burned more than 62 square miles in three days in the Aude wine region in southern France, where hundreds of residents were forced to leave their homes. Local authorities said they need to remain vigilant throughout the weekend because temperatures are expected to rise above 30C (86F) during another heatwave. Aude administrator Christian Pouget said 1,000 people had not yet been able to return to their homes after the fire swept through 15 communes in the Corbieres mountain region, destroying or damaging at least 36 homes. One person died at home and at least 21 others were injured, including 16 firefighters, officials said. Some 1,300 homes were still without electricity on Friday morning after infrastructure was extensively damaged, the Aude prefecture said. Residents have been warned not to return home without permission, as many roads remain blocked and dangerous. Those forced to flee have been housed in emergency shelters across 17 municipalities. Many fled to the community of Tuchan when the fire started on Tuesday, its mayor Beatrice Bertrand said. \"We have received and hosted over 200 people. We gave them food, thanks to local businesses who opened their stores despite it being very late,\" she said. \"Civil Protection brought us beds. And also the local villagers offered their homes to welcome them. It was their first night here and many were shocked and scared.\" Read more on Sky News:Gaza from above - 'barren and cropless'Apollo 13 astronaut dies An investigation is under way into the cause of the fire. Authorities said the fire was the largest recorded since France's national fire database was created in 2006, but the minister for ecological transition, Agnes Pannier-Runacher, went further, calling the blaze the worst since 1949 and linking it to climate change."
    },
    {
        "title": "Mandalorian actor Gina Carano settles lawsuit with Disney – and thanks Elon Musk for funding it",
        "description": "Actor Gina Carano has settled her lawsuit with Disney and Lucasfilm after claiming she was wrongfully dismissed from The Mandalorian for expressing her political opinions.",
        "url": "https://news.sky.com/story/mandalorian-actor-gina-carano-settles-lawsuit-with-disney-8211-and-thanks-elon-musk-for-funding-it-13408494",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-gina-carano-mandalorian_6447118.jpg?20240207091815",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-08 09:53:00",
        "Headline": "Carano, 41,  was fired in February 2021 after starring as Rebel ranger Cara Dune in two series of the Disney+ Star Wars series The Mandalorian.",
        "Content": "Actor Gina Carano has settled her lawsuit with Disney and Lucasfilm after claiming she was wrongfully dismissed from The Mandalorian for expressing her political opinions. Carano was fired in February 2021 after starring as Rebel ranger Cara Dune in two series of the Disney+ Star Wars series The Mandalorian. According to court documents, it came after the 41-year-old referenced the Nazis' treatment of Jewish people while discussing current political differences in the US. At the time, production company Lucasfilm said in a statement that her \"social media posts denigrating people based on their cultural and religious identities are abhorrent and unacceptable\". But late on Thursday, she posted on X: \"I have come to an agreement with Disney/Lucasfilm which I believe is the best outcome for all parties involved.\" She added that she \"hopes this brings some healing to the force\". The details of the financial settlement have not been disclosed. When filing her lawsuit at the Californian District Court last year, she had sought $75,000 (£59,000) in damages. She also thanked Elon Musk for financing the lawsuit, despite the two having never met. \"I want to extend my deepest most heartfelt gratitude to Elon Musk, a man I've never met, who did this Good Samaritan deed for me in funding my lawsuit,\" she wrote in her post. \"Thank you Mr. Musk and X for backing my case and asking for nothing in return.\" The X owner is an ardent advocate of free speech and has funded similar legal battles previously. Read more from Sky NewsEddie Murphy 'will get an Oscar eventually'Diddy plotting to return to musicOasis gig more 'ground-shaking' than Taylor Swift's Carano signed off: \"I am excited to flip the page and move onto the next chapter. \"My desires remain in the arts, which is where I hope you will join me. Yes, I'm smiling. From my heart to yours, Gina.\" In response to the settlement, Lucasfilm said in a statement: \"Ms Carano was always well respected by her directors, co-stars, and staff, and she worked hard to perfect her craft while treating her colleagues with kindness and respect. \"With this lawsuit concluded, we look forward to identifying opportunities to work together with Ms. Carano in the near future.\" In legal documents, Carano's team claimed both Disney and Lucasfilm had \"targeted, harassed, publicly humiliated, defamed, and went to great lengths to destroy Carano's career\". She also alleged she was treated differently to her male colleagues. Neither company commented on these claims. Lawyer Gene Schaerr, managing partner at Schaerr Jaffe, said at the time: \"Disney bullied Ms Carano, trying to force her to conform to their views about cultural and political issues, and when that bullying failed, they fired her. \"Punishing employees for their speech on political or social issues is illegal under California law.\" Carano, who began her career as a mixed martial arts fighter, has starred in other Hollywood franchises, including Fast & Furious 6 as Riley Hicks, and Deadpool, in which she played Angel Dust."
    },
    {
        "title": "Man charged with theft of flowers from Ozzy Osbourne tribute",
        "description": "A man has been charged in connection with theft from a tribute to Ozzy Osbourne in Birmingham.",
        "url": "https://news.sky.com/story/man-charged-with-theft-of-flowers-from-ozzy-osbourne-tribute-13408632",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-uk-birmingham-osbourne_6978098.jpg?20250730145552",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-08 15:40:00",
        "Headline": "A sea of flowers and other tributes covered Birmingham city centre after Osbourne's death was announced on 23 July.",
        "Content": "A man has been charged in connection with theft from a tribute to Ozzy Osbourne in Birmingham. Parviz Jafari, 45, was arrested on Saturday after police received reports tributes had been stolen from the city centre. Officers attended the scene, near Black Sabbath Bridge and a mural painted in Osbourne's honour, and after making inquiries, identified Jafari as a suspect. He was arrested, charged with theft of flowers, and will appear before magistrates on 3 September, West Midlands Police said.  Osbourne died aged 76 on 23 July, having lived with Parkinson's disease for many years. His death came just weeks after performing a final farewell Black Sabbath gig at Birmingham's Villa Park. Thousands of fans turned out to see his funeral cortege go by a week later, with his family placing their flowers to add to the sea left by locals.  Sharon Osbourne and her children Kelly, Jack, and Aimee were in tears as they took in the crowds. They each carried a pink rose wrapped in black paper and tied with a purple ribbon to match Black Sabbath's traditional colours."
    }
]