[
    {
        "title": "What do Epstein documents say about Trump, Andrew and Mandelson?",
        "description": "Thousands of documents from disgraced financier Jeffrey Epstein have been released, which reference Donald Trump, Andrew Mountbatten-Windsor and Peter Mandelson among others.",
        "url": "https://news.sky.com/story/explainer-what-do-epsteins-emails-say-about-trump-13469184",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-andrew-prince-peter_7067348.jpg?20251030212634",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-12 15:49:00",
        "Headline": "The release of more than 20,000 documents related to Jeffrey Epstein provides an insight into his relationships with the likes of Donald Trump, former duke Andrew Mountbatten-Windsor and ex-politician and diplomat Peter Mandelson.",
        "Content": " Thousands of documents from disgraced financier Jeffrey Epstein have been released, which reference Donald Trump, Andrew Mountbatten-Windsor and Peter Mandelson among others. Democrats on the House Oversight Committee initially published several emails which they said \"raises questions about Trump and Epstein's relationship, Trump's knowledge of Epstein's crimes\" and the president's relationship to Epstein's victims. White House press secretary, Karoline Leavitt, said the \"selectively leaked emails\" were an attempt to \"create a fake narrative to smear President Trump\". He has consistently denied any involvement or knowledge about Epstein's sex trafficking operation. Trump latest: 20,000 pages published in response to 'leak' It prompted Republicans to retaliate by releasing more than 20,000 pages from Epstein's files and accusing Democrats of \"cherry-picking\" their documents. Here's what the emails say... :: Epstein discusses Trump Three messages, dated between 2011 and 2019, are between Jeffrey Epstein and his sex trafficking co-conspirator Ghislaine Maxwell and between Epstein and author Michael Wolff. In the first exchange of emails, between Epstein and his associate Ghislaine Maxwell, dated 2 April 2011, Epstein wrote: i want you to realize that that dog that hasn't barked is trump.. Virginia spent hours at my house with him ,, he has never once been mentioned. police chief. etc. im 75% there Maxwell responded: I have been thinking about that... The name Virginia, refers to Virginia Giuffre, a prominent Epstein survivor who died in April and had never accused Mr Trump of wrongdoing. Ms Giuffre made allegations of three sexual encounters with Andrew Mountbatten-Windsor, who was stripped of his prince title, in her autobiography which was released last month - allegations Andrew has denied. In the second exchange of emails, between Epstein and Michael Wolff, a journalist who has written several books about the Trump administration, dated 31 January 2019, Epstein wrote: [REDACTED NAME] worked at mara lago. . she was the one that accused prince andrew. . trump said me to resign, never a member ever.. of course he knew about the girls as he asked ghislaine to stop The third email exchange, between Epstein and Wolff, dated between 15 and 16 December 2015 shows that Wolff wrote: I hear CNN planning to ask Trump tonight about his relationship with you--either on air or in scrum afterwards. Epstein replied: if we were able to craft an answer for him, what do you think it should be? Wolff responded: I think you should let him hang himself. If he says he hasn't been on the plane or the house, then that gives you a valuable PR and political currency. You can hang him in a way that potentially generates a positive benefit for you, or, if it really looks like he could win, you could save him, generating a debt. Of course, it is possible that, when asked, he'll say Jeffrey is a great guy and has gotten a raw deal and is a victim of political correctness, which is to be outlawed in a Trump regime. Responding to the release of emails, Mr Wolff posted a video on Instagram: \"I have been trying to talk about this story for a very long time now and perhaps we're getting close to the smoking gun. \"These two men... had the closest of relationships for more than a decade.\" :: Andrew included in Epstein emails In several email exchanges, Epstein refers to Andrew Mountbatten-Windsor and a picture of him with victim Virginia Giuffre. A photo emerged in 2011 of Andrew, which has become infamous, showing the former prince with his arm around Virginia Giuffre, apparently taken in Ghislaine Maxwell's London home. The former duke, who was recently stripped of his titles, has previously said he didn't recall meeting Ms Giuffre and claimed an image of the pair could have been doctored. Although the name of the \"girl\" is redacted, Epstein appears in his email exchange to be referring to Ms Giuffre, who at the time had spoken to The Mail on Sunday, which had published the photo. In an email from Epstein to a reporter on 1 July 2011, he said: The girl has fled the country with an outstanding arrest warrant. The da (sic) after she accused others, said in writing that she has no credibility, she was never 15 years old working for me, her story made it seem like she first worked for trump at that age and was met by ghislaine maxwell. Total horseshit, the daily mail paid her money, they admitted it, with the statement that it took money to coax out the truth. Yes she was on my plane, and yes she had her picture taken with Andrew, as many of my employees have. In a separate email to a publicist on 1 July 2011, Epstein writes: The girl who accused Prince Andrew can also easily be proven to be a liar. I think Buckingham Palace would love it. You should task someone to investigate the girl Virginia Roberts, that has caused the Queen's son all this agro (sic). I promise you she is a fraud. You and I will be able to go to ascot (sic) for the rest of our lives. :: Mandelson and Epstein talk Trump According to the documents, Peter Mandelson, who was sacked as the UK ambassador to the US in September, was continuing his connections with Epstein in 2016. Sir Keir Starmer dismissed him after learning about emails between him and Epstein from 2005 to 2010 - including after Epstein's conviction for soliciting a minor for prostitution. In an exchange between Epstein and Peter Mandelson on 6 November 2016, Epstein wrote: 63 years old. . you made it Responding to the message referring to his birthday several days before, Mr Mandelson replied: Just. I have decided to extend my life by spending more of it in the US. On the same day, and just before the 2016 US presidential election, Epstein then replies: in the donald white house Epstein goes on to refer to Andrew and Mr Mandelson's partner, now husband, Reinaldo Avila da Silva: trump/ and having agreat [sic] deal of fun. In hindsight. you were right about staying away from andrew. I was right in your staying with rinaldo [sic] According to the documents, Mandelson responds: Of course, donald in WH. Will he get there? Yes, without Andrew it would not have gone nuclear. Did you advise me to stay with R ? Such a handful but loyal and never embarrassing.  In a separate email from 7 March 2011, Epstein received an interview request from the BBC via his lawyer: We are keen to explore the possibility of conducting an interview with Mr Epstein, on the subject of the stories which are circulating, however inaccurately, about both him and Prince Andrew, the Duke of York; we'd be keen to hear from Mr Epstein first hand so that the various and at times, speculative reporting which is at large in the UK press can be betterscrutinised?\". The message was forwarded to Mr Mandelson, who replied, bluntly: No!! In May this year, Mr Mandelson was asked by Sky News about his relationship with Epstein: \"I'm not answering any questions about him. My knowledge of him is something I regret, I wish I'd never met him in the first place.\" Read more from Sky News:Key claims by Virginia Giuffre in memoirGhislaine Maxwell appeals to TrumpUS Congress summons Andrew Sky News' US news partner NBC News has reached out to lawyers for Michael Wolff, Maxwell and the family of Virginia Giuffre for comment. The top Democrat on the House committee, Robert Garcia of California, said in a statement that the released emails \"raise glaring questions about what else the White House is hiding and the nature of the relationship between Epstein and the President\". The Oversight Committee Democrats say the emails strike \"a blow against the White House's Epstein cover-up\". But White House press secretary, Karoline Leavitt said in a statement: \"The Democrats selectively leaked emails to the liberal media to create a fake narrative to smear President Trump. \"The 'unnamed victim' referenced in these emails is the late Virginia Giuffre, who repeatedly said President Trump was not involved in any wrongdoing whatsoever and 'couldn't have been friendlier' to her in their limited interactions.\""
    },
    {
        "title": "How No 10 plunged itself into crisis ahead of a perilous budget",
        "description": "Double-dealing, plotting, declarations of loyalty and treachery - in recent weeks the nation has feasted on Celebrity Traitors. ",
        "url": "https://news.sky.com/story/how-no-10-plunged-itself-into-crisis-ahead-of-a-perilous-budget-13469238",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-beth-rigby_6933158.jpg?20250602133605",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-11-12 17:33:00",
        "Headline": "Ahead of a critical budget later this month, Downing Street descended into a crisis of its own making - and Labour MPs are furious.",
        "Content": "\n          Political editor\n              @BethRigby\n  Double-dealing, plotting, declarations of loyalty and treachery - in recent weeks the nation has feasted on Celebrity Traitors.  But these sorts of antics emanating from Downing Street, a couple of weeks out from a critical budget, feels far less entertaining and only serves to further hurt a struggling prime minister. It wasn't the intention. Allies of Keir Starmer have been alive to growing talk of a possible post-budget challenge, which has building amid growing concerns from MPs about the upcoming manifesto-breaking budget, the continued dire polling, and a Downing Street forever on the back foot. There was a decision, as I understand it, from the PM's team, in light of questions being asked about a possible challenge, to put it out there that he would stay and fight a leadership challenge should it come. Politics latest: Starmer denies authorising attack on Streeting I was briefed about this on Tuesday by allies that wanted to make the case to the parliamentary party about the perils of trying to oust a sitting prime minister 18 months into the parliamentary term. My contacts made it very clear to me that the PM would fight any challenge, in turn triggering a three-month leadership battle that would spook the markets, create more chaos and further damage the Labour brand. \n                  Labour's dilemma: The two-child benefit cap\n                 \n                  Starmer and Reeves hint at tax rises to come ahead of unusual pre-budget speech today\n                 \n                  How Rachel Reeves might fill £30bn budget black hole\n                 They also stressed the PM has no intention of giving way just 18 months in. The intention was to try to see off any plot and scare the parliamentary party into line at the prospect of a full-on meltdown should the challenge come. But the decision by some of the PM's allies to anonymously also drop the name of prime traitor suspect - Wes Streeting - into briefings has badly backfired and plunged No 10 into crisis. 'Frustration' after PM's allies went 'too far' As for the clean-up job, Mr Streeting - already carded for the morning round ahead of a speech on the NHS on Wednesday - has come out to declare his loyalty (tick), but also take aim at the No 10 briefers, and called on the PM to take them to task. On the part of No 10, I was told by sources on Wednesday morning that there wasn't an attempt to brief against the health secretary - there is a view that some of Sir Keir's allies might have gone too far, rather to make it clear the PM was prepared to fight a challenge if it came. I am told by one No 10 source there is \"frustration\" over how his played out and it had \"got out of control\". \"Wes is doing a good job, is an asset and doing a big speech today making the broader case of not cutting spending ahead of the budget,\" said a source.  But putting the genie back in the bottle is no easy feat. MPs are furious at the briefings and exasperated that No 10 have made a mountain out of a molehill, with some suggesting that there wasn't an active plot post-budget, and they have created a crisis when there wasn't one. \"They've done this before,\" observed on senior party figure. \"They pick a fight of their own making and imply everything is a calamity ahead of a big possible negative, be it the budget or the Batley and Spen by-election [in an effort to get MPs to rally around the PM]. \"It's worked in the past; I think they have misplayed it this time. They have started a fire they cannot put out.\"  The prime minister has been left badly burnt in all of this. He was forced at PMQs to defend his health secretary and his chief of staff as Kemi Badenoch goaded him over No 10's \"toxic culture\", and called for him to sack Morgan McSweeney, his chief of staff. The PM told his party that he \"never authorised\" briefings against his cabinet and that it was \"completely unacceptable\". But when his team were later asked about what the PM was going to do about it, they didn't appear to have an answer. If he takes no action, it will only feed into the sense among many in his party that Sir Keir doesn't have a grip of his operation and is not leading from the front. That's difficult when his health secretary, having professed his loyalty, has called on the PM to deal with those briefing against him. It's a mess.  Budget measures to calm febrile party And this mess comes at a time that is already so difficult for this government. Number 10 and No 11 knows exactly how difficult the coming weeks are going to be. The chancellor has been out pitch rolling her budget, trying to explain the reasons behind potential manifesto-breaking pledges and arguing that the alternatives - cutting spending and a return to austerity or breaking fiscal rules, and the knock on effect in the markets - are far worse. The prime minister is also going to be out making the case as Downing Street and the Treasury work out how they can possibly try to sell a manifesto-breaking budget to voters already completely disillusioned with this Labour administration. I'm told that the current working plan is to do a combination of tax rises and action on the two-child benefit cap in order for the prime minister to be able to argue that in breaking his manifesto pledges, he is trying his hardest to protect the poorest in society and those working people he has spoken of being endlessly in his mind's eye when he takes decisions in No 10. The final decisions are yet to be taken, but the current thinking is to lift the basic rate of income tax - perhaps by 2p - and then simultaneously cut national insurance contributions for those on the basic rate of income tax (those who earn up to £50,000 a year). That way, the chancellor can raise several billion in tax from those with the 'broadest shoulders' - higher-rate taxpayers and pensioners or landlords. At the same time, the chancellor intends to move on the two-child benefit cap - although it's unclear if that will be a full or partial lifting of that cap - in order to argue that Labour is trying to still protect those on lower incomes from tax hikes. Those two measures will be designed to try to calm a febrile party and prevent panic after the budget. As one informed MP put it to me, the combination of tax rises for wealthier workers and more support for parents with more than two children are arguments that many MPs could get behind.  More bad news at moment of peril This is also why No 10 getting ahead of a possible post-budget coup has surprised me a little, given that pretty much all the conversations about a possible challenge to the PM have been linked to the ballot box test next May. One party figure told me on Wednesday it would be \"insane and catastrophic\" to for the party to try and bring down a Labour PM over a Labour budget, given, for a start, how the markets would react, and thinks the No 10 briefing is a reflection of how \"paranoid and out of touch\" the Starmer operation is with the parliamentary party. But it is also true that there is a settled view among some very senior figures in the party that Sir Keir lacks the charisma, leadership and communication skills to take on Nigel Farage, while broken manifesto promises will kill his hopes of standing for a second term. As one figure put it to me: \"Breaking those promises will destroy him. The public won't give him a hearing again. We need a clean skin.\" The whispered plots around Westminster are now front page news - not something the Sir Keir would have wanted as he prepares to front up what is shaping up to be his biggest test as prime minister yet, should he break the most sacred of his manifesto pledges on not raising VAT, income tax and national insurance on working people. There is no doubt the budget will be a moment of peril - and those who wanted to be faithful to the PM this week have somehow only managed to make his situation even worse."
    },
    {
        "title": "Resident doctor strikes: I don't want people to suffer but we have to walk out again, says BMA chief",
        "description": "The British Medical Association (BMA) has defended a new round of resident doctor walkouts starting on Friday, insisting medics' pay is still \"way down\" compared with 2008 and that the government has failed to finish \"a journey\" towards restoring it.",
        "url": "https://news.sky.com/story/resident-doctor-strikes-i-dont-want-people-to-suffer-but-we-have-to-walk-out-again-says-bma-chief-13469110",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-doctor-strike-nhs_6977891.jpg?20250730131411",
        "type": "Home",
        "Author": "Ashish Joshi",
        "Date Published": "2025-11-12 13:13:00",
        "Headline": "Resident doctors - previously known as junior doctors - are beginning their latest strike action this week. The health secretary isn't happy, having hoped a pay deal reached after coming to office last year would put the issue to bed for the long-term.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n  The British Medical Association (BMA) has defended a new round of resident doctor walkouts starting on Friday, insisting medics' pay is still \"way down\" compared with 2008 and that the government has failed to finish \"a journey\" towards restoring it. BMA chair Dr Tom Dolphin told Sky News the dispute remains rooted in years of pay erosion that have left resident doctors far behind other public sector workers. \"When we started the dispute, […] the lowest level of the resident doctors were being paid £14 an hour,\" he said. \"There were some pay rises over the last couple of years that brought that partly back to the value it should be at, but not all the way. \"The secretary of state (Wes Streeting) himself called it a journey, implying there were further steps to come, but we haven't seen that.\" When asked if the row ultimately \"comes down to money\", he replied: \"In the sense that the secretary of state doesn't want to or isn't able to fund the pay increases to match the value that we had in 2008.\" Dr Dolphin argued that while \"the general worker in the economy as a whole\" has seen pay catch up since the 2008 financial crash, \"doctors are still way down\". The government points out that its 29% settlement last year was one of the largest in the public sector and was intended to draw a line under two years of walkouts. After the most recent pay awards, in 2025/26 a medic just out of university receives a basic salary of £38,831 and has estimated average earnings of £45,900 after factors like extra pay for unsociable hours are taken into account, according to medical think tank the Nuffield Trust. That average figure rises to £54,400 by the second year and a more senior speciality registrar earns an average of £80,500. The BMA says that when the dispute started, the most junior doctors were making around £14 per hour. That works out at £29,120 per year for a 40-hour week. That's very close to the earnings of a doctor fresh out of medical school in 2022/23 - £29,384, according to Full Fact. But that's over a 52-week year without taking into account paid holiday or unsociable hours. But Dr Dolphin said the deal still fell short: \"The gap was biggest for doctors and needed the biggest amount of restoration, and that's what we got.\" He defended the BMA's use of the Retail Price Index (RPI), a metric rejected by the Office for National Statistics, saying it \"better reflects the costs people face\". Should resident doctors get a pay rise? Have your say in the poll at the bottom of this story. 'Who do you think is treating the patients?' With Chancellor Rachel Reeves preparing her budget amid warnings of deep cuts, Dr Dolphin said the BMA is not demanding an immediate cash injection. \"We're quite happy for that money to be deferred with some kind of multi-year pay deal so that we can end the dispute and avoid having further industrial action about pay for several years to come,\" he said. \"Money spent in the NHS is returned to the economy. For every pound you spend, you get several pounds back.\" When pressed on whether the £1.7bn cost of previous strike action could have been better spent on treatment and technology for NHS cancer patients, he hit back: \"Who do you think is treating the cancer patients? It's the doctors.\" Read more on Sky News:Thousands of NHS redundanciesSentence and fine over patient death Strikes will cause disruption, union boss admits Dr Dolphin rejected suggestions that the dispute could destabilise the government, calling the idea \"implausible\". He admitted prolonged strikes have tested public patience, but said the government had left doctors with no choice. \"A prolonged industrial dispute makes people annoyed with both sides,\" he said. \"It is vexing to us that we are still in this dispute.\" \"I don't want patients to suffer,\" he added. \"I accept that the strikes cause disruption… of course that's upsetting for them. I completely get that. And I'm sorry that it's happening.\""
    },
    {
        "title": "NASA cancels space launch as strongest 'cannibal storm' in 20 years heads to Britain",
        "description": "NASA has postponed a space launch due to a \"cannibal\" solar storm that could also disrupt GPS, communication systems and power grids.",
        "url": "https://news.sky.com/story/powerful-cannibal-storm-to-hit-earth-today-and-it-could-disrupt-communications-and-gps-13469128",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-nasa-blue-origin-space_7080286.jpg?20251112163205",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-12 13:25:00",
        "Headline": "The geomagnetic storm is set to reach Britain today and could be one of the largest in 20 years.",
        "Content": "NASA has postponed a space launch due to a \"cannibal\" solar storm that could also disrupt GPS, communication systems and power grids. The British Geological Survey (BGS) upgraded its forecast to the maximum and said the ongoing storm had already interfered with communications and satellite navigation. It said the storm could feed off another one, becoming a \"cannibal storm\" - one of the biggest in 20 years - and reaching Britain this afternoon. Blue Origin - the space tech company founded by Amazon boss Jeff Bezos - was due to launch its rocket, New Glenn, today. The mission was set to take two Mars-bound NASA spacecraft, called ESCAPADE, into the cosmos. Announcing the postponement on Twitter, Blue Origin said: \"New Glenn is ready to launch. \"However, due to highly elevated solar activity and its potential effects on the ESCAPADE spacecraft, NASA is postponing launch until space weather conditions improve. \n                  Trump renominates billionaire Musk ally Jared Isaacman to lead NASA\n                 \n                  Brightest ever flare from supermassive black hole spotted by scientists in California\n                 \n                  How and when to see the beaver supermoon - the biggest full moon of the year \n                 \"We are currently assessing opportunities to establish our next launch window based on forecasted space weather and range availability.\" The effects of the solar storm aren't just limited to the Cape Canaveral launch site in Florida. It's also expected to bring a dazzling display of Northern Lights to Britain later. The storm led to impressive sightings of the aurora borealis in some parts of the UK overnight and the same could happen later - assuming clear, dark skies. But solar storms carry serious implications for energy infrastructure and navigation, and are therefore listed as a primary hazard on the UK's National Risk Register. They're caused by an explosion of particles, energy, magnetic fields, and material blasted into space by the sun - and can disturb the Earth's magnetic field, according to NASA. The latest event has already created the biggest geoelectric field at ground level since BGS records began. Gemma Richardson, geomagnetic hazard specialist with the BGS, said: \"Space weather can have a real impact on the lives of people across the planet. \"BGS records real-time data of geomagnetic conditions, underpinning the national forecast service. \"Our data suggests that this event could be one of the biggest storms we've seen in 20 years\". People in Scotland, northern England and Northern Ireland have the best chance of seeing Northern lights, according to the BGS. Cloud is forecast in other areas but the Met Office said it might break enough to provide a glimpse over southeast England. Get the Sky News forecast for your area The colours of the aurora are produced by charged particles from the sun hitting atoms and molecules in Earth's upper atmosphere. Solar storms can reach Earth from the sun in as little as 17 hours, but can sometimes take much longer. Read more from Sky News:Three men arrested after body found in fieldGovernment to use military driving examiners to cut test backlog The latest one could hit the highest level of G5, according to the BGS, a rating that warns of possible power blackouts, GPS problems lasting days, and problems orientating spacecraft. NASA says solar storms don't cause direct harm to humans as the planet's magnetic field and atmosphere protect us from the worst of the effects."
    },
    {
        "title": "Ukraine ministers toppled amid embezzlement and kickbacks scandal",
        "description": "Ukraine's justice and energy ministers have resigned amid a major embezzlement and kickbacks scandal involving the state nuclear power company.",
        "url": "https://news.sky.com/story/ukraine-ministers-toppled-amid-embezzlement-and-kickbacks-scandal-13469290",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-volodymyr-zelenskyy_7080505.jpg?20251112210402",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-12 19:53:00",
        "Headline": "The justice and energy ministers resigned after Volodymyr Zelenskyy called for their removal.",
        "Content": "Ukraine's justice and energy ministers have resigned amid a major embezzlement and kickbacks scandal involving the state nuclear power company. Volodymyr Zelenskyy called for the removal of Justice Minister Herman Halushchenko and Energy Minister Svitlana Grynchuk on Wednesday, with the pair later submitting their resignations. The damaging scandal - fast becoming one of the most significant government crises since Moscow launched its full-scale invasion - has put top officials under scrutiny. It could not come at a worse time for Ukraine, as Russia's renewed attacks on energy infrastructure cause rolling blackouts and Kyiv's outnumbered forces retreat under relentless assaults. At the centre of the scandal, Mr Halushchenko and other well-known ministers and officials are alleged to have gained payments from constructing fortifications against Moscow's assaults on energy infrastructure. Former Deputy Prime Minister Oleksiy Chernyshov is also alleged to have been involved. Mr Halushchenko said he would defend himself legally, while Mr Grynchuk posted on social media: \"Within the scope of my professional activities there were no violations of the law.\" The findings of a 15-month investigation, including 1,000 hours of wiretaps, were revealed by the same anti-corruption watchdogs Mr Zelenskyy sought to weaken earlier this year. \n                  'This is Europe's problem': The migrants stuck in East Libya's detention centres\n                 \n                  Trump latest: President to sign bill to end US shutdown tonight - as White House dismisses latest Epstein files\n                 \n                  'This is Europe's problem': Inside smuggling trade bringing migrants from Africa\n                 These resulted in the detention of five people, and another seven linked to about $100m (£76m) in alleged kickbacks in the energy sector. Ukrainian officials are scrambling for European funds to manage mounting energy shortages as Moscow targets critical infrastructure and natural gas production in an attempt to damage public morale. The nation has been plagued by corruption since gaining independence, and Mr Zelenskyy was elected on a mandate to eliminate graft. Read more:Newly opened 758-metre bridge in China collapsesPolice in Germany arrest suspected Hamas memberMilitary procurement scandals also led to the ousting of Defence Minister Oleksii Reznikov in 2023. Oleksandr Merezhko, a lawmaker with Zelenskyy's party, said the scandal looks \"really bad in the eyes of our European and American partners\". He said: \"Internally this scandal will be used to undermine unity and stability within the country. Externally, our enemies will use it as an argument to stop aid to Ukraine. \"While Russians destroy our power grid and people have to endure blackouts, someone at the top was stealing money during the war.\" But questions remain over how high the alleged corruption goes. The National Anti-Corruption Bureau, known as NABU, refrained from identifying the suspects. But it said they included a businessman, a former adviser to the energy minister, an executive who oversaw physical protection at state energy company Energoatem, and others responsible for money laundering. It dubbed the scheme \"Midas\". The agency also accused eight people of abuse of office, bribery, and possession of disproportionate assets. The investigation, which NABU said conducted over 70 raids, was welcomed by the Ukrainian president, who urged officials to cooperate with it. Energoatom said the inquiry didn't disrupt its operations. NABU released excerpts of tapes in which the network, using code names and secretive language, discussed blackmail and pressuring Energoatom contractors to extract 10% to 15% in bribes and kickbacks in exchange for them to do business without facing internal blocks. The network took advantage of a regulation enforced during martial law prohibiting contractors from claiming debts in court from companies providing essential services, such as Energoatom, which has annual revenues of around $4.7 billion (£3.6 billion). Four others worked to launder the money at a Kyiv office. The tapes, which have not been independently verified, say about $1.2 million was handed to a former deputy prime minister, whom the plotters called \"Che Guevara,\" after the Argentinian revolutionary leader. Ms Svyrydenko also said the cabinet submitted proposals to apply sanctions against Timur Mindich, a close associate of Zelenskyy, and businessman Alexander Tsukerman."
    },
    {
        "title": "Baroness Newlove, the victims campaigner whose husband Garry was murdered by gang of teenagers, has died",
        "description": "Baroness Newlove, the Victims' Commissioner and campaigner, whose husband Garry was murdered by a gang of teenagers in 2007, has died aged 63.",
        "url": "https://news.sky.com/story/baroness-newlove-the-campaigner-whose-husband-garry-was-murdered-by-gang-of-teenagers-has-died-13469168",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-baroness-newlove-helen-margaret-newlove_7080233.jpg?20251112152458",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-12 15:08:00",
        "Headline": "Lady Newlove had called for the death penalty to be brought back after her husband was killed in 2007 and has campaigned on behalf of victims of crime since.",
        "Content": "Baroness Newlove, the Victims' Commissioner and campaigner, whose husband Garry was murdered by a gang of teenagers in 2007, has died aged 63. In a statement, the Office of the Victims' Commissioner said: \"We are deeply saddened to share that Baroness Helen Newlove, the Victims' Commissioner for England and Wales, has passed away following a short illness. Our thoughts are with her family at this difficult time. \"Helen was a committed and passionate advocate for victims, drawing on her own experience of the criminal justice system. She was determined that all victims should be treated with compassion, decency and respect - and she consistently led by example.\" Baroness Newlove had called for the death penalty to be brought back after her husband was killed and had campaigned on behalf of victims of crime since. She first served as the Victims' Commissioner for England and Wales for six years from March 2013 to May 2019 before being re-appointed in October 2023. She was due to serve until the end of the year. Mr Newlove, a salesman with a plastics company, left his home to remonstrate with the group of drunk teenagers who had damaged his wife's car. He was kicked \"like a football\" in front of his terrified wife and three daughters. He suffered massive head injuries and died two days later in hospital. Three teenagers were found guilty in January 2008 of the murder, which was the trial heard was committed after a seven-hour drinking binge. In the wake of the shocking crime, Baroness Newlove became a national voice for victims - campaigning for authorities to take action against persistent anti-social behaviour and youth violence following her husband's killing. Read more from Sky News:Government to use military driving examiners to cut driving test backlogNASA cancels space launch as 'cannibal storm' heads to Britain In 2010, Lady Newlove was made a life peer for her work on youth crime. As Victims' Commissioner, she laid the groundwork for victims' rights to be enshrined in law, and last month published the biggest survey of victims ever carried out by the independent body. Justice Secretary David Lammy paid tribute, saying he was \"deeply saddened\" to learn of Lady Newlove's death. The deputy prime minister said: \"As both Victims' Commissioner, and deputy speaker in the House of Lords, Helen brought unparalleled experience and dedication to her roles. \"She championed the rights of victims and witnesses and held agencies to account. \"Her leadership shaped the Victims' Code, strengthened victims' voices in the criminal justice system, and ensured that the Victims and Prisoners Act progressed with victims' interests at its heart.\" He added: \"Helen was an extraordinary public servant whose life's work and her legacy are defined by courage, compassion, and an unwavering commitment to justice. \"My thoughts remain with her family and her loved ones at this incredibly difficult time.\" Former prime minister David Cameron posted on X: \"Desperately sad to hear that Helen Newlove has died. Helen was so wonderful, warm, brave and plain speaking. She suffered the tragedy of watching her beloved husband, Garry, being murdered by thugs - and then turned that experience into a second life of service. \"Service to her community, to the country and to parliament - but, most of all, service to victims of crime to make sure they got a proper hearing and a better deal. \"It was a privilege to meet her and an honour to help her into a position where she could dedicate herself to the service of others. \"My thoughts and heartfelt condolences are with Helen's husband, Paul, and her daughters, Zoe, Danielle and Amy. Helen leaves a legacy that they - and we all - can be proud of.\" Several other peers paid tribute in the House of Lords."
    },
    {
        "title": "Newly opened 758-metre bridge in China collapses",
        "description": "A newly opened bridge has partially collapsed in China.",
        "url": "https://news.sky.com/story/newly-opened-758-metre-bridge-in-china-collapses-13469162",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/2614d40b3952dd45e1d534a22db246ec3387da4e20a653b2a4610b472589ed18_7080188.jpg?20251112150221",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-12 14:36:00",
        "Headline": "Footage shows part of the bridge, in the southwestern province of Sichuan, crashing into the ground just months after its construction.",
        "Content": " A newly opened bridge has partially collapsed in China. In footage, part of the bridge, in China's southwestern province of Sichuan, crashes into the ground as a huge cloud of smoke rises up next to a mountain. There were no reports of any casualties. Police in the city of Maerkang had closed the 758-metre-long Hongqi bridge to traffic on Monday afternoon after cracks appeared on nearby shops and roads. Shifts were also seen in the terrain of a mountain, local government said. Read more:Trump orders nuclear weapons tests as he meets XiDonald Trump says tariffs will be cut after meeting with Xi Conditions on the mountainside then worsened on Tuesday afternoon, with continuous heavy rainfall triggering landslides and causing the collapse of the approach bridge and roadbed. Construction of the bridge finished earlier this year, according to the contractor Sichuan Road & Bridge Group on social media. The bridge is located on a highway linking the country's heartland with Tibet. An investigation into the cause of the collapse has been launched. According to Chinese media, there was one truck on the bridge at the time of the collapse. The driver was successfully rescued."
    },
    {
        "title": "Sir Keir Starmer expresses 'sincere regret' over appointment of Labour donor to chair football regulator",
        "description": "Sir Keir Starmer has expressed \"sincere regret\" over signing off the appointment of a Labour donor as the first chair of England's new football regulator.",
        "url": "https://news.sky.com/story/sir-keir-starmer-expresses-sincere-regret-over-appointment-of-labour-donor-to-chair-football-regulator-13469369",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-football_7080552.jpg?20251112215931",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-12 21:50:00",
        "Headline": "The prime minister had recused himself from decisions related to the appointment of a chair for the new regulator because of his interest in football, and football-related hospitality he had received.",
        "Content": " Sir Keir Starmer has expressed \"sincere regret\" over signing off the appointment of a Labour donor as the first chair of England's new football regulator. In a letter to his ethics adviser on Wednesday, the prime minister said he made an \"unfortunate error\" in signing off the appointment of David Kogan, having recused himself from decisions related to the process due to his interest in football. It comes after Culture Secretary Lisa Nandy apologised following an independent investigation last week that found that she had \"unknowingly\" breached the public appointments code by failing to declare £2,900 in donations from Mr Kogan in 2020. Politics latest: Starmer apologises to Streeting after coup accusations The former media executive also donated to Sir Keir's Labour leadership campaign in 2020 and to his constituency party in the run-up to last year's general election. The prime minister wrote in his letter to his ethics advisers, Sir Laurie Magnus, explaining that he had agreed to \"recuse myself from decisions relating to the Football Governance Bill\" in autumn 2024 because of his interest in football, and football-related hospitality he had received. However, he continued: \"In April 2025, a note was submitted to me informing me that, after running the appointment process, the Culture Secretary wanted to appoint David Kogan as the inaugural chair of the Independent Football Regulator, subject to pre-appointment scrutiny by the Select Committee. \n                  Football fans infiltrated tightly-controlled derby clash disguised as stewards\n                 \n                  Over 1,000 players suspended in widening Turkish football betting investigation\n                 \n                  Tories demand investigation into Lisa Nandy over failure to disclose donations from head of new football regulator\n                 \"The note asked me whether I was content. I confirmed that I was supportive. \"I knew that the decision was for the Secretary of State to take and I replied on the basis that the decision had been taken. \"In retrospect, it would have been better if I had not been given the note or confirmed that I was content with the appointment. This was an unfortunate error for which I express my sincere regret.\" The prime minister added that he has asked his officials to carry out an internal review of the processes by which recusals are managed in No 10. Sir Laurie wrote in his reply that Sir Keir's involvement was \"regrettable\" in light of his recusal, and welcomed the internal review. He added: \"I consider that the disclosures made in your letter are an important demonstration of your commitment to transparency and to ensuring that mistakes are acknowledged and necessary steps taken to improve processes underpinning standards in public life.\" Downing Street insisted on Tuesday the appointment had been made by the Culture Secretary, not the prime minister. Mr Kogan was confirmed as the new head of the Independent Football Regulator in October, after being named the government's preferred candidate in April. He had originally been approached about the job by the previous Conservative government under Rishi Sunak. However, the Tories say the prime minister has been \"caught offside signing off on the appointment of a major donor to a powerful new role\". Shadow Cabinet Office minister Alex Burghart said: \"This isn't just sloppy; it's a serious lapse of judgment from a man who promised integrity and transparency - and potentially another serious breach of the rules. \"It's yet more scandal right at the heart of his Government. Amidst open civil war in the Labour Party, it is clear the prime minister doesn't have the backbone to control his own administration or simply doesn't care.\""
    },
    {
        "title": "Resident doctor strikes: I don't want people to suffer but we have to walk out again, says BMA chief",
        "description": "The British Medical Association (BMA) has defended a new round of resident doctor walkouts starting on Friday, insisting medics' pay is still \"way down\" compared with 2008 and that the government has failed to finish \"a journey\" towards restoring it.",
        "url": "https://news.sky.com/story/resident-doctor-strikes-i-dont-want-people-to-suffer-but-we-have-to-walk-out-again-says-bma-chief-13469110",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-doctor-strike-nhs_6977891.jpg?20250730131411",
        "type": "UK",
        "Author": "Ashish Joshi",
        "Date Published": "2025-11-12 13:13:00",
        "Headline": "Resident doctors - previously known as junior doctors - are beginning their latest strike action this week. The health secretary isn't happy, having hoped a pay deal reached after coming to office last year would put the issue to bed for the long-term.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n  The British Medical Association (BMA) has defended a new round of resident doctor walkouts starting on Friday, insisting medics' pay is still \"way down\" compared with 2008 and that the government has failed to finish \"a journey\" towards restoring it. BMA chair Dr Tom Dolphin told Sky News the dispute remains rooted in years of pay erosion that have left resident doctors far behind other public sector workers. \"When we started the dispute, […] the lowest level of the resident doctors were being paid £14 an hour,\" he said. \"There were some pay rises over the last couple of years that brought that partly back to the value it should be at, but not all the way. \"The secretary of state (Wes Streeting) himself called it a journey, implying there were further steps to come, but we haven't seen that.\" When asked if the row ultimately \"comes down to money\", he replied: \"In the sense that the secretary of state doesn't want to or isn't able to fund the pay increases to match the value that we had in 2008.\" Dr Dolphin argued that while \"the general worker in the economy as a whole\" has seen pay catch up since the 2008 financial crash, \"doctors are still way down\". The government points out that its 29% settlement last year was one of the largest in the public sector and was intended to draw a line under two years of walkouts. After the most recent pay awards, in 2025/26 a medic just out of university receives a basic salary of £38,831 and has estimated average earnings of £45,900 after factors like extra pay for unsociable hours are taken into account, according to medical think tank the Nuffield Trust. That average figure rises to £54,400 by the second year and a more senior speciality registrar earns an average of £80,500. The BMA says that when the dispute started, the most junior doctors were making around £14 per hour. That works out at £29,120 per year for a 40-hour week. That's very close to the earnings of a doctor fresh out of medical school in 2022/23 - £29,384, according to Full Fact. But that's over a 52-week year without taking into account paid holiday or unsociable hours. But Dr Dolphin said the deal still fell short: \"The gap was biggest for doctors and needed the biggest amount of restoration, and that's what we got.\" He defended the BMA's use of the Retail Price Index (RPI), a metric rejected by the Office for National Statistics, saying it \"better reflects the costs people face\". Should resident doctors get a pay rise? Have your say in the poll at the bottom of this story. 'Who do you think is treating the patients?' With Chancellor Rachel Reeves preparing her budget amid warnings of deep cuts, Dr Dolphin said the BMA is not demanding an immediate cash injection. \"We're quite happy for that money to be deferred with some kind of multi-year pay deal so that we can end the dispute and avoid having further industrial action about pay for several years to come,\" he said. \"Money spent in the NHS is returned to the economy. For every pound you spend, you get several pounds back.\" When pressed on whether the £1.7bn cost of previous strike action could have been better spent on treatment and technology for NHS cancer patients, he hit back: \"Who do you think is treating the cancer patients? It's the doctors.\" Read more on Sky News:Thousands of NHS redundanciesSentence and fine over patient death Strikes will cause disruption, union boss admits Dr Dolphin rejected suggestions that the dispute could destabilise the government, calling the idea \"implausible\". He admitted prolonged strikes have tested public patience, but said the government had left doctors with no choice. \"A prolonged industrial dispute makes people annoyed with both sides,\" he said. \"It is vexing to us that we are still in this dispute.\" \"I don't want patients to suffer,\" he added. \"I accept that the strikes cause disruption… of course that's upsetting for them. I completely get that. And I'm sorry that it's happening.\""
    },
    {
        "title": "Epstein said Andrew did have photo taken with Virginia Giuffre, emails show",
        "description": "Newly released emails from Jeffrey Epstein include one in which the late paedophile financier describes how Andrew Mountbatten-Windsor did have his photo taken with victim Virginia Giuffre.",
        "url": "https://news.sky.com/story/epstein-claimed-andrew-did-have-photo-taken-with-virginia-giuffre-emails-show-13469255",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-prince-andrew-virginia-roberts_6897144.jpg?20251016192019",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-12 18:34:00",
        "Headline": "The former Duke of York, who was recently stripped of his titles, has previously said he didn't recall meeting Ms Giuffre and claimed an image of the pair could have been doctored.",
        "Content": "Newly released emails from Jeffrey Epstein include one in which the late paedophile financier describes how Andrew Mountbatten-Windsor did have his photo taken with victim Virginia Giuffre. The former duke, who was recently stripped of his titles, has previously said he didn't recall meeting Ms Giuffre and claimed an image of the pair could have been doctored. Ms Giuffre, who took her own life earlier this year, claimed in her recently released autobiography that - as a teenager - she had sex with Andrew on three occasions after being trafficked by Epstein and Ghislaine Maxwell. Andrew has always strongly denied the claims. Trump latest: 20,000 pages from Epstein files released The details have emerged after thousands of files from the Jeffrey Epstein estate were released by Republicans on the House Oversight Committee. The email that discusses the photograph was one of those released and features an exchange with a journalist in 2011. \n                  Princess Beatrice appears at her first charity event in UK since Andrew stripped of prince title\n                 \n                  Ghislaine Maxwell's emails from minimum-security jail leaked - amid claims of 'VIP treatment'\n                 \n                  Congress letter to Andrew: Read in full\n                 A picture emerged in 2011 of Andrew, which has become infamous, showing the former prince with his arm around Virginia Giuffre, apparently taken in Ghislaine Maxwell's London home. Although the name of the \"girl\" is redacted, Epstein appears in his email exchange to be referring to Ms Giuffre, who at the time had spoken to The Mail on Sunday, which had published the photo and her account of encountering Andrew while travelling with Epstein. After cutting ties with Epstein, she moved to Australia. She also changed her surname from Roberts to Giuffre. An email from Epstein to the journalist read: \"The girl has fled the country with an outstanding arrest warrant. The da (sic) after she accused others, said in writing that she has no credibility, she was never 15 years old working for me, her story made it seem like she first worked for trump at that age and was met by ghislaine maxwell. \"Total horseshit, the daily mail paid her money, they admitted it, with the statement that it took money to coax out the truth. \"Yes she was on my plane, and yes she had her picture taken with Andrew, as many of my employees have. \"I have never misled you, this girl is a total liar, they (sic) authorities should check her australian immigration form... I will ask if they will cooperate - Prince people.\" In a different email exchange in March 2011 about an inquiry from a news reporter, Epstein messages someone listed as \"The Duke\", which is thought to be Andrew. Epstein told him: \"Im not sure how to respond, the only person she didn't have sex with was Elvis.\" It prompted the following response: \"Please make sure that every statement or legal letter states clearly that I am NOT involved and that I knew and know NOTHING about any of these allegations. \"I can't take any more of this my end.\" It is not clear if Epstein, who killed himself in 2019 while awaiting trial on sex-trafficking charges, was writing about Ms Giuffre. Read more from Sky News:What do Epstein's emails say about Trump?Congress summons Andrew over Epstein Epstein: 'She is a fraud' In a separate email to a publicist in July 2011, Epstein writes: \"The girl who accused Prince Andrew can also easily be proven to be a liar. \"I think Buckingham Palace would love it. You should task someone to investigate the girl Virginia Roberts, that has caused the Queen's son all this agro (sic). \"I promise you she is a fraud. You and I will be able to go to ascot (sic) for the rest of our lives.\" Speaking to Newsnight in 2019, Andrew said: \"I have absolutely no memory of that photograph ever being taken... you can't prove whether or not that photograph is faked or not... \"That's me but whether that's my hand or whether that's the position I... but I don't... I have simply no recollection of the photograph ever being taken.\""
    },
    {
        "title": "Abuse 'ignored' at Medomsley Detention Centre where UK's 'most prolific' sex offender attacked young men, report finds",
        "description": "Decades of abuse of thousands of young men by staff at a detention centre in County Durham was \"ignored and dismissed\" by the prison service, the police and the Home Office, an investigation has found.",
        "url": "https://news.sky.com/story/abuse-of-thousands-of-young-men-at-county-durham-detention-centre-ignored-and-dismissed-investigation-finds-13468544",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-medomsley-detention-centre_7079238.jpg?20251111142013",
        "type": "UK",
        "Author": "Greg Milam",
        "Date Published": "2025-11-12 11:00:00",
        "Headline": "The Prisons and Probation Ombudsman issues a report into how \"horrific\" physical and sexual violence was allowed to continue against 17 to 21-year-olds at the Medomsley Detention Centre - and highlights the abuse by officer Neville Husband.",
        "Content": "\n          Chief North of England correspondent\n              @GregMilamSky\n  Decades of abuse of thousands of young men by staff at a detention centre in County Durham was \"ignored and dismissed\" by the prison service, the police and the Home Office, an investigation has found. Warning: Readers may find the content below distressing The Prisons and Probation Ombudsman (PPO) has issued a report into how \"horrific\" physical and sexual violence was allowed to continue against 17 to 21-year-olds at the Medomsley Detention Centre in Consett. It named officer Neville Husband who was thought to have groomed and attacked hundreds of trainees in Medomsley's kitchens. He was described by the ombudsman \"as possibly the most prolific sex offender in British history\".  The abuse at Medomsley continued \"unchallenged\" for the entire 26 years of its operation, from 1961 to 1987, according to the report from ombudsman Adrian Usher. There was, he said, \"extreme violence and acts of a sadistic nature\". The centre held inmates who were all first-time offenders and who had been convicted of crimes ranging from shoplifting and non-payment of fines to robbery. \n                  Disabled woman took her own life after benefits wrongly stopped, coroner finds\n                 \n                  'No reason to suspect equipment failure' in fatal skydive, inquest told\n                 \n                  Woman dies in skydiving incident in County Durham\n                 Several members of staff were convicted after investigations by Durham Constabulary in 2001 and 2023 found widespread abuse of more than 2,000 detainees at Medomsley. But the ombudsman investigated what authorities knew about the abuse, whether there were opportunities to have intervened at the time and what was done about any opportunities. Husband 'used power with devastating effect' Husband was finally convicted of sexual assault and was jailed in 2003 and again in 2005. He died in 2010. Mr Usher said: \"The illegitimate power imbalance that existed between Husband and the trainees and other staff further flourished within a culture of collusion and silence from other employees. \"Husband used this power with devastating effect.\" Trainees 'physically abused' Trainees were physically abused from the moment they arrived, when they bathed, were strip searched, during physical education, while working and even during medical examinations, the PPO found. Victims were targeted for being perceived as gay or weak. Inmates who failed to address staff as \"sir\" would be punched. Witnesses said baths were either scalding hot or freezing cold. A number of them said if they were ill, painkillers could be taped to their forehead and they would be told to run around until the pill had dissolved. Medomsley leaders at every level 'failed'  Mr Usher said: \"Leaders at every level at Medomsley, including the warden, failed in their duty to protect the best interests of those under their charge. Either staff in leadership roles were aware of the abuse, in which case they were complicit, or they lacked dedication and professional curiosity to such an extent as to not be professionally competent.\" \"The knowledge of abuse by the Prison Service, the police, the Home Office and other organisations of authority was ignored and dismissed. The authorities failed in their duty to keep detainees safe,\" Mr Usher added. The report highlights a complaint, written in 1965, of an officer striking an inmate with \"a distinct blow\". The handwritten response below dismisses it as \"playfulness\". Staff 'took law into own hands' A letter sent to all detention centre wardens in 1967 refers to the \"increasing number of complaints of assault\" and warns of staff \"taking the law into their own hands\" with discipline going \"beyond the legitimate\". The police officers who delivered 17-year-old Eric Sampson to Medomsley in December 1977 told him he was going to \"get the hell kicked out\" of him there, he said. Victim - 'I could have been killed' \"The violence I had done to me was terrible. I could have been killed in there,\" said Mr Sampson. \"Every day and night was hell on earth for the full nine weeks. \"With all the abuse, and obviously the sexual abuse, it totally ruined my life. It should never have happened in the first place, or it should have been stopped.\" The inquiry spoke to 79 victims and witnesses. Over 2,000 former inmates came forward to give their testimony to Operation Seabrook, a police investigation that led to five retired officers being convicted of abuse in 2019. Lawyer David Greenwood, who represents victims of the abuse at Medomsley, said he has been contacted by men who were held at 20 other detention centres around the country, alleging similar violence. \"I think it was a systematic thing. These prison officers were cogs in a big machine which was designed, culturally or by training, to treat boys really badly,\" he said. Mr Greenwood is calling for a wider inquiry into abuse at all of the detention centres. What have the police said? The ombudsman's report found police officers from both Durham and Cleveland police were \"aware that physical and sexual abuse was taking place at Medomsley from as early as 1965 due to complaints of abuse made at police stations\". It said officers who ignored, dismissed or took no action \"failed in their duty to report and investigate crime\". In response to the report, Durham Constabulary has publicly apologised for \"the force's historic failure to investigate decades of horrifying abuse\". Chief Constable Rachel Bacon said: \"This report makes for extremely difficult reading. It exposes shameful failings by police at that time: both to recognise that the physical violence meted out by staff at Medomsley amounted to abuse or to adequately investigate allegations by those victims who did have the bravery to come forward and report what happened to them. \"I am satisfied that policing standards at Durham Constabulary are worlds apart from those which sadly appear to have existed at that time.\" Cleveland Police said in a statement: \"All victims of any form of abuse or exploitation should always be listened to and action taken to prevent any further forms of abuse, and we acknowledge this was not the case many decades ago. \"We know cases like this have a lasting impact upon victims and Cleveland Police has, and continues to, improve its service and support to all those affected by abuse, especially those in cases of children and young people.\" The ombudsman's report pointed out that the victims have never received a public apology and the complaints process for children in custody remains the same today as it was at the time of the abuse. Mr Usher said: \"I leave it to all of the bodies in this investigation to examine their organisational consciences and determine if there is any action taken today, despite such an extended passage of time, that would diminish, even fractionally, the trauma that is still being felt by victims to this day.\" The government has since issued an apology and announced a new safeguarding panel to improve protections for children in custody. Minister for youth justice Jake Richards said: \"To the men who suffered such horrific abuse at Medomsley, I want to say again - I am truly sorry. The failings set out in today's report by the Prisons and Probation Ombudsman are truly harrowing, and we must ensure nothing like this ever happens again. \"This government is establishing a Youth Custody Safeguarding Panel to review how we protect children in custody today. It will ensure their voices are heard, that complaints are taken seriously, and that every child is kept safe from harm.\""
    },
    {
        "title": "Family of Katie Fox, who was fatally stabbed in neck in Birmingham, pay tribute to her",
        "description": "The family of a woman who died after being stabbed in the neck in Birmingham city centre has paid tribute to her.",
        "url": "https://news.sky.com/story/family-of-katie-fox-who-was-fatally-stabbed-in-neck-in-birmingham-pay-tribute-to-her-13469218",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-katie-fox-birmingham_7080307.jpg?20251112165704",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-12 16:52:00",
        "Headline": "The 34-year-old, who died after being attacked on Smallbrook Queensway on Friday, was \"so beautiful and kind\" and \"our special and gentle daughter,\" her family says.",
        "Content": "The family of a woman who died after being stabbed in the neck in Birmingham city centre has paid tribute to her. Katie Fox, 34, was described by her loved ones as a \"shining light in their lives\" after she was reported on Monday to have died in hospital. She had been left critically injured after she was attacked in Smallbrook Queensway shortly before 9pm on Friday night. Her family said in a statement released by West Midlands Police: \"Gone too soon Dear Katie, so beautiful and kind. \"A part of us was snatched away on that very fateful night, a part of us also vanished suddenly, when you passed away, leaving us all with such sadness and heartache. \"You were a shining light in our lives, you were so special in every way, you were everything a daughter could be and much more. \"Your loss to us has been so hard to bear and so hard to comprehend, but we know that you are still with us and giving us the strength in every way. You are, our guardian angel. \n                  Woman, 34, has died after being stabbed in the neck in Birmingham\n                 \n                  Djeison Rafael: Man charged with attempted murder after woman stabbed in the neck in centre of Birmingham\n                 \n                  Woman critically injured in Birmingham after being stabbed in neck in 'unprovoked attack'\n                 \"God bless you Katie, our special and gentle daughter.\" The family also thanked the emergency services and those who had shown \"support during this most difficult time\" . Read more:Nasa cancels space launchReform pulls out of BBC documentaryDecades of abuse ignored - report The statement continued: \"We ask at this most difficult time that we be allowed to grieve the loss of our most precious daughter in peace and in privacy. \"God bless Katie, forever in our hearts.\" Djeison Rafael, 21, appeared at Birmingham Magistrates Court on Monday morning, accused of murdering Ms Fox. This breaking news story is being updated and more details will be published shortly. Please refresh the page for the latest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Boy, 5, dies after wall collapsed on top of him at Chislehurst golf centre",
        "description": "A five-year-old boy has died and a six-year-old girl has been injured after a wall collapsed at a golf centre.",
        "url": "https://news.sky.com/story/boy-5-dies-after-wall-collapsed-on-top-of-him-at-golf-centre-13469159",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sidcup-family-golf_7080240.jpg?20251112153858",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-12 14:53:00",
        "Headline": "Medics rushed to Sidcup Family Golf on Sunday before the boy, who has since died, was rushed to hospital in a life-threatening condition.",
        "Content": "A five-year-old boy has died and a six-year-old girl has been injured after a wall collapsed at a golf centre. Police officers and paramedics attended Sidcup Family Golf in Chislehurst on Sunday evening following reports a child had been injured. The boy was taken to hospital by London Air Ambulance in a life-threatening condition, but he died in hospital on Tuesday. His family is being supported by specialist officers, the Met Police said. The girl has since been discharged from hospital. Enquiries are ongoing and officers are working with the local health and safety inspector. Read more:Nasa cancels space launchReform pulls out of BBC documentary In a statement, Sidcup Family Golf said it was closed following an incident on site. It said: \"Our thoughts are with those affected. \"We appreciate your understanding at this time and will share further updates when appropriate.\" The Met Police said enquiries are ongoing and officers are working with the Health and Safety Executive."
    },
    {
        "title": "Sir Keir Starmer expresses 'sincere regret' over appointment of Labour donor to chair football regulator",
        "description": "Sir Keir Starmer has expressed \"sincere regret\" over signing off the appointment of a Labour donor as the first chair of England's new football regulator.",
        "url": "https://news.sky.com/story/sir-keir-starmer-expresses-sincere-regret-over-appointment-of-labour-donor-to-chair-football-regulator-13469369",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-football_7080552.jpg?20251112215931",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-12 21:50:00",
        "Headline": "The prime minister had recused himself from decisions related to the appointment of a chair for the new regulator because of his interest in football, and football-related hospitality he had received.",
        "Content": " Sir Keir Starmer has expressed \"sincere regret\" over signing off the appointment of a Labour donor as the first chair of England's new football regulator. In a letter to his ethics adviser on Wednesday, the prime minister said he made an \"unfortunate error\" in signing off the appointment of David Kogan, having recused himself from decisions related to the process due to his interest in football. It comes after Culture Secretary Lisa Nandy apologised following an independent investigation last week that found that she had \"unknowingly\" breached the public appointments code by failing to declare £2,900 in donations from Mr Kogan in 2020. Politics latest: Starmer apologises to Streeting after coup accusations The former media executive also donated to Sir Keir's Labour leadership campaign in 2020 and to his constituency party in the run-up to last year's general election. The prime minister wrote in his letter to his ethics advisers, Sir Laurie Magnus, explaining that he had agreed to \"recuse myself from decisions relating to the Football Governance Bill\" in autumn 2024 because of his interest in football, and football-related hospitality he had received. However, he continued: \"In April 2025, a note was submitted to me informing me that, after running the appointment process, the Culture Secretary wanted to appoint David Kogan as the inaugural chair of the Independent Football Regulator, subject to pre-appointment scrutiny by the Select Committee. \n                  Football fans infiltrated tightly-controlled derby clash disguised as stewards\n                 \n                  Over 1,000 players suspended in widening Turkish football betting investigation\n                 \n                  Tories demand investigation into Lisa Nandy over failure to disclose donations from head of new football regulator\n                 \"The note asked me whether I was content. I confirmed that I was supportive. \"I knew that the decision was for the Secretary of State to take and I replied on the basis that the decision had been taken. \"In retrospect, it would have been better if I had not been given the note or confirmed that I was content with the appointment. This was an unfortunate error for which I express my sincere regret.\" The prime minister added that he has asked his officials to carry out an internal review of the processes by which recusals are managed in No 10. Sir Laurie wrote in his reply that Sir Keir's involvement was \"regrettable\" in light of his recusal, and welcomed the internal review. He added: \"I consider that the disclosures made in your letter are an important demonstration of your commitment to transparency and to ensuring that mistakes are acknowledged and necessary steps taken to improve processes underpinning standards in public life.\" Downing Street insisted on Tuesday the appointment had been made by the Culture Secretary, not the prime minister. Mr Kogan was confirmed as the new head of the Independent Football Regulator in October, after being named the government's preferred candidate in April. He had originally been approached about the job by the previous Conservative government under Rishi Sunak. However, the Tories say the prime minister has been \"caught offside signing off on the appointment of a major donor to a powerful new role\". Shadow Cabinet Office minister Alex Burghart said: \"This isn't just sloppy; it's a serious lapse of judgment from a man who promised integrity and transparency - and potentially another serious breach of the rules. \"It's yet more scandal right at the heart of his Government. Amidst open civil war in the Labour Party, it is clear the prime minister doesn't have the backbone to control his own administration or simply doesn't care.\""
    },
    {
        "title": "The families of British citizens detained abroad have called for more support",
        "description": "A group of campaigners whose family members have been detained by foreign states have called for more government support, including a special envoy to help while loved ones are in custody.",
        "url": "https://news.sky.com/story/the-families-of-british-citizens-detained-abroad-have-called-for-more-support-13469240",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-craig-foreman-lindsay-foreman_7017156.jpg?20250911143122",
        "type": "UK",
        "Author": "Sadiya Chowdhury",
        "Date Published": "2025-11-12 17:40:00",
        "Headline": "The families of Nazanin Zaghari-Ratcliffe, Jagtar Singh Johal and  Craig and Lindsay Foreman have spoken of the difficulties of advocating for loved ones.",
        "Content": "\n          News correspondent\n              @esadiya\n A group of campaigners whose family members have been detained by foreign states have called for more government support, including a special envoy to help while loved ones are in custody. The husband of Nazanin Zaghari-Ratcliffe, the brother of Jagtar Singh Johal and the son of Craig and Lindsay Foreman spoke of their experiences of advocating for their loved ones to return, describing their communications with the Foreign, Commonwealth and Development Office (FCDO) as slow, confusing, and at times ineffective. Joe Bennett, whose mother, Lindsay Foreman, is detained with her husband Craig in Iran on espionage charges, said initial guidance from the UK government was not to talk to other affected families, but said he ignored the advice and reached out to Richard Ratcliffe - the husband of Nazanin Zaghari-Ratcliffe who had been detained for six years in Iran. \"You're completely alienated at the beginning,\" he told Sky News, speaking at a conference in London run by APPG, which focuses on the arbitrary detention of British citizens abroad. \"To have the support of the others gives you a sense that you're not alone in this. \"For the FCDO to say 'don't speak to them', it can put your parents at risk, made no sense to me. \"It was kind of scare tactics. This is how they tend to try and deal with things - it's all hush, hush, keep it quiet, don't say anything.\" \n                  UK summons Russian ambassador over 'utterly unacceptable' violations into NATO airspace\n                 \n                  UK advises against all travel to Israel\n                 \n                  David Lammy's ambitious green foreign policy plans will require cash and commitment\n                 Mr Bennett said he feels he needs to be shouting about the Foremans' plight, especially after finding out yesterday that his mother is on hunger strike. Read more from Sky News:Newly opened 758-metre bridge in China collapsesNASA cancels space launch as 'cannibal storm' heads to Britain \"You could tell she was really down,\" he said, describing the phone call with Lindsay Foreman. \"Her voice was cracking and then she got into tears. The hunger strike is because there's been so many promises made to her and her husband Craig that haven't been fulfilled, like being able to see each other once a week.\" An emotional Mr Bennett told Sky News he told his mother to \"listen to your body\" and not put herself at risk as he criticised the UK government's lack of action outside of welfare and consular assistance. \"It's these broken promises on both sides,\" he said before revealing he is considering asking a third country for help, \"because of the lack of action from the Foreign Office\". \"There's been a lot of success stories with the Qataris and Oman are seen as a mediator for the UK. For me it's about exploring all options, and that's the other thing that annoys me, that I'm having to do that contact and outreach. The government should be exploring those options.\" Gurpreet Singh Johal, whose brother, Jagtar, has been detained in India for eight years, said he feels as if he is up against both the Indian and British governments. Jagtar, a Sikh activist, claims to have been tortured. \"I thought the British government would help us,\" Gurpreet said. \"I didn't realise I'd be up against the Indian government and the UK government. \"Right now, I don't even know if the (UK) government is on my side in terms of bringing Jagtar back.\" Jagtar Johal, 38, was arrested in Punjab shortly after his wedding in 2017. He was acquitted earlier this year in a case in which he was accused of financially supporting a terror group, but he still faces federal charges from the Indian authorities. Richard Ratcliffe described the problem as one of waiting, speaking about the nine years since his wife, Nazanin, was arrested in Iran on espionage charges. \"It is not the people, but the policy,\" he said, adding legislation is needed to put in a policy framework. Sky News has approached the FCDO for comment."
    },
    {
        "title": "NASA cancels space launch as strongest 'cannibal storm' in 20 years heads to Britain",
        "description": "NASA has postponed a space launch due to a \"cannibal\" solar storm that could also disrupt GPS, communication systems and power grids.",
        "url": "https://news.sky.com/story/powerful-cannibal-storm-to-hit-earth-today-and-it-could-disrupt-communications-and-gps-13469128",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-nasa-blue-origin-space_7080286.jpg?20251112163205",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-12 13:25:00",
        "Headline": "The geomagnetic storm is set to reach Britain today and could be one of the largest in 20 years.",
        "Content": "NASA has postponed a space launch due to a \"cannibal\" solar storm that could also disrupt GPS, communication systems and power grids. The British Geological Survey (BGS) upgraded its forecast to the maximum and said the ongoing storm had already interfered with communications and satellite navigation. It said the storm could feed off another one, becoming a \"cannibal storm\" - one of the biggest in 20 years - and reaching Britain this afternoon. Blue Origin - the space tech company founded by Amazon boss Jeff Bezos - was due to launch its rocket, New Glenn, today. The mission was set to take two Mars-bound NASA spacecraft, called ESCAPADE, into the cosmos. Announcing the postponement on Twitter, Blue Origin said: \"New Glenn is ready to launch. \"However, due to highly elevated solar activity and its potential effects on the ESCAPADE spacecraft, NASA is postponing launch until space weather conditions improve. \n                  Trump renominates billionaire Musk ally Jared Isaacman to lead NASA\n                 \n                  Brightest ever flare from supermassive black hole spotted by scientists in California\n                 \n                  How and when to see the beaver supermoon - the biggest full moon of the year \n                 \"We are currently assessing opportunities to establish our next launch window based on forecasted space weather and range availability.\" The effects of the solar storm aren't just limited to the Cape Canaveral launch site in Florida. It's also expected to bring a dazzling display of Northern Lights to Britain later. The storm led to impressive sightings of the aurora borealis in some parts of the UK overnight and the same could happen later - assuming clear, dark skies. But solar storms carry serious implications for energy infrastructure and navigation, and are therefore listed as a primary hazard on the UK's National Risk Register. They're caused by an explosion of particles, energy, magnetic fields, and material blasted into space by the sun - and can disturb the Earth's magnetic field, according to NASA. The latest event has already created the biggest geoelectric field at ground level since BGS records began. Gemma Richardson, geomagnetic hazard specialist with the BGS, said: \"Space weather can have a real impact on the lives of people across the planet. \"BGS records real-time data of geomagnetic conditions, underpinning the national forecast service. \"Our data suggests that this event could be one of the biggest storms we've seen in 20 years\". People in Scotland, northern England and Northern Ireland have the best chance of seeing Northern lights, according to the BGS. Cloud is forecast in other areas but the Met Office said it might break enough to provide a glimpse over southeast England. Get the Sky News forecast for your area The colours of the aurora are produced by charged particles from the sun hitting atoms and molecules in Earth's upper atmosphere. Solar storms can reach Earth from the sun in as little as 17 hours, but can sometimes take much longer. Read more from Sky News:Three men arrested after body found in fieldGovernment to use military driving examiners to cut test backlog The latest one could hit the highest level of G5, according to the BGS, a rating that warns of possible power blackouts, GPS problems lasting days, and problems orientating spacecraft. NASA says solar storms don't cause direct harm to humans as the planet's magnetic field and atmosphere protect us from the worst of the effects."
    },
    {
        "title": "Baroness Newlove, the victims campaigner whose husband Garry was murdered by gang of teenagers, has died",
        "description": "Baroness Newlove, the Victims' Commissioner and campaigner, whose husband Garry was murdered by a gang of teenagers in 2007, has died aged 63.",
        "url": "https://news.sky.com/story/baroness-newlove-the-campaigner-whose-husband-garry-was-murdered-by-gang-of-teenagers-has-died-13469168",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-baroness-newlove-helen-margaret-newlove_7080233.jpg?20251112152458",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-12 15:08:00",
        "Headline": "Lady Newlove had called for the death penalty to be brought back after her husband was killed in 2007 and has campaigned on behalf of victims of crime since.",
        "Content": "Baroness Newlove, the Victims' Commissioner and campaigner, whose husband Garry was murdered by a gang of teenagers in 2007, has died aged 63. In a statement, the Office of the Victims' Commissioner said: \"We are deeply saddened to share that Baroness Helen Newlove, the Victims' Commissioner for England and Wales, has passed away following a short illness. Our thoughts are with her family at this difficult time. \"Helen was a committed and passionate advocate for victims, drawing on her own experience of the criminal justice system. She was determined that all victims should be treated with compassion, decency and respect - and she consistently led by example.\" Baroness Newlove had called for the death penalty to be brought back after her husband was killed and had campaigned on behalf of victims of crime since. She first served as the Victims' Commissioner for England and Wales for six years from March 2013 to May 2019 before being re-appointed in October 2023. She was due to serve until the end of the year. Mr Newlove, a salesman with a plastics company, left his home to remonstrate with the group of drunk teenagers who had damaged his wife's car. He was kicked \"like a football\" in front of his terrified wife and three daughters. He suffered massive head injuries and died two days later in hospital. Three teenagers were found guilty in January 2008 of the murder, which was the trial heard was committed after a seven-hour drinking binge. In the wake of the shocking crime, Baroness Newlove became a national voice for victims - campaigning for authorities to take action against persistent anti-social behaviour and youth violence following her husband's killing. Read more from Sky News:Government to use military driving examiners to cut driving test backlogNASA cancels space launch as 'cannibal storm' heads to Britain In 2010, Lady Newlove was made a life peer for her work on youth crime. As Victims' Commissioner, she laid the groundwork for victims' rights to be enshrined in law, and last month published the biggest survey of victims ever carried out by the independent body. Justice Secretary David Lammy paid tribute, saying he was \"deeply saddened\" to learn of Lady Newlove's death. The deputy prime minister said: \"As both Victims' Commissioner, and deputy speaker in the House of Lords, Helen brought unparalleled experience and dedication to her roles. \"She championed the rights of victims and witnesses and held agencies to account. \"Her leadership shaped the Victims' Code, strengthened victims' voices in the criminal justice system, and ensured that the Victims and Prisoners Act progressed with victims' interests at its heart.\" He added: \"Helen was an extraordinary public servant whose life's work and her legacy are defined by courage, compassion, and an unwavering commitment to justice. \"My thoughts remain with her family and her loved ones at this incredibly difficult time.\" Former prime minister David Cameron posted on X: \"Desperately sad to hear that Helen Newlove has died. Helen was so wonderful, warm, brave and plain speaking. She suffered the tragedy of watching her beloved husband, Garry, being murdered by thugs - and then turned that experience into a second life of service. \"Service to her community, to the country and to parliament - but, most of all, service to victims of crime to make sure they got a proper hearing and a better deal. \"It was a privilege to meet her and an honour to help her into a position where she could dedicate herself to the service of others. \"My thoughts and heartfelt condolences are with Helen's husband, Paul, and her daughters, Zoe, Danielle and Amy. Helen leaves a legacy that they - and we all - can be proud of.\" Several other peers paid tribute in the House of Lords."
    },
    {
        "title": "Ukraine ministers toppled amid embezzlement and kickbacks scandal",
        "description": "Ukraine's justice and energy ministers have resigned amid a major embezzlement and kickbacks scandal involving the state nuclear power company.",
        "url": "https://news.sky.com/story/ukraine-ministers-toppled-amid-embezzlement-and-kickbacks-scandal-13469290",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-volodymyr-zelenskyy_7080505.jpg?20251112210402",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-12 19:53:00",
        "Headline": "The justice and energy ministers resigned after Volodymyr Zelenskyy called for their removal.",
        "Content": "Ukraine's justice and energy ministers have resigned amid a major embezzlement and kickbacks scandal involving the state nuclear power company. Volodymyr Zelenskyy called for the removal of Justice Minister Herman Halushchenko and Energy Minister Svitlana Grynchuk on Wednesday, with the pair later submitting their resignations. The damaging scandal - fast becoming one of the most significant government crises since Moscow launched its full-scale invasion - has put top officials under scrutiny. It could not come at a worse time for Ukraine, as Russia's renewed attacks on energy infrastructure cause rolling blackouts and Kyiv's outnumbered forces retreat under relentless assaults. At the centre of the scandal, Mr Halushchenko and other well-known ministers and officials are alleged to have gained payments from constructing fortifications against Moscow's assaults on energy infrastructure. Former Deputy Prime Minister Oleksiy Chernyshov is also alleged to have been involved. Mr Halushchenko said he would defend himself legally, while Mr Grynchuk posted on social media: \"Within the scope of my professional activities there were no violations of the law.\" The findings of a 15-month investigation, including 1,000 hours of wiretaps, were revealed by the same anti-corruption watchdogs Mr Zelenskyy sought to weaken earlier this year. \n                  'This is Europe's problem': The migrants stuck in East Libya's detention centres\n                 \n                  Trump latest: President to sign bill to end US shutdown tonight - as White House dismisses latest Epstein files\n                 \n                  'This is Europe's problem': Inside smuggling trade bringing migrants from Africa\n                 These resulted in the detention of five people, and another seven linked to about $100m (£76m) in alleged kickbacks in the energy sector. Ukrainian officials are scrambling for European funds to manage mounting energy shortages as Moscow targets critical infrastructure and natural gas production in an attempt to damage public morale. The nation has been plagued by corruption since gaining independence, and Mr Zelenskyy was elected on a mandate to eliminate graft. Read more:Newly opened 758-metre bridge in China collapsesPolice in Germany arrest suspected Hamas memberMilitary procurement scandals also led to the ousting of Defence Minister Oleksii Reznikov in 2023. Oleksandr Merezhko, a lawmaker with Zelenskyy's party, said the scandal looks \"really bad in the eyes of our European and American partners\". He said: \"Internally this scandal will be used to undermine unity and stability within the country. Externally, our enemies will use it as an argument to stop aid to Ukraine. \"While Russians destroy our power grid and people have to endure blackouts, someone at the top was stealing money during the war.\" But questions remain over how high the alleged corruption goes. The National Anti-Corruption Bureau, known as NABU, refrained from identifying the suspects. But it said they included a businessman, a former adviser to the energy minister, an executive who oversaw physical protection at state energy company Energoatem, and others responsible for money laundering. It dubbed the scheme \"Midas\". The agency also accused eight people of abuse of office, bribery, and possession of disproportionate assets. The investigation, which NABU said conducted over 70 raids, was welcomed by the Ukrainian president, who urged officials to cooperate with it. Energoatom said the inquiry didn't disrupt its operations. NABU released excerpts of tapes in which the network, using code names and secretive language, discussed blackmail and pressuring Energoatom contractors to extract 10% to 15% in bribes and kickbacks in exchange for them to do business without facing internal blocks. The network took advantage of a regulation enforced during martial law prohibiting contractors from claiming debts in court from companies providing essential services, such as Energoatom, which has annual revenues of around $4.7 billion (£3.6 billion). Four others worked to launder the money at a Kyiv office. The tapes, which have not been independently verified, say about $1.2 million was handed to a former deputy prime minister, whom the plotters called \"Che Guevara,\" after the Argentinian revolutionary leader. Ms Svyrydenko also said the cabinet submitted proposals to apply sanctions against Timur Mindich, a close associate of Zelenskyy, and businessman Alexander Tsukerman."
    },
    {
        "title": "Police in Germany arrest suspected Hamas member who 'acquired Glock pistols to attack Jewish institutions'",
        "description": "Police in Germany have arrested a suspected Hamas member who allegedly obtained guns and ammunition to attack Jewish targets.",
        "url": "https://news.sky.com/story/police-in-germany-arrest-suspected-hamas-member-who-acquired-glock-pistols-to-attack-jewish-institutions-13469217",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-berlin-police-germany_7080314.jpg?20251112170456",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-11-12 16:56:00",
        "Headline": "Lebanese-born Borhan El-K was picked up on the motorway after crossing into Germany from the Czech Republic.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n Police in Germany have arrested a suspected Hamas member who allegedly obtained guns and ammunition to attack Jewish targets. Lebanese-born Borhan El-K was picked up on the motorway after crossing into Germany from the Czech Republic on Tuesday night. In a statement, the German federal prosecutor's office alleged in August he had procured an automatic rifle, eight Glock pistols and more than 600 pieces of ammunition in Germany. It's claimed the weapons were then handed to Wael FM, another suspected member of the Palestinian armed group Hamas, in Berlin. Wael FM was arrested with the items on 1 October along with two other men named as Adeb Al G and Ahmad I. The men, whose full names have not been released due to German privacy laws, were charged with preparing a serious act of violence endangering the German state and being members of a foreign terrorist organisation. Authorities believe that the group had been gathering supplies since the summer. \"The weapons were intended for use by Hamas in assassination attacks on Israeli or Jewish institutions in Germany,\" the federal prosecutor's office said in a statement at the time. Read more from Sky News:NASA cancels space launch as 'cannibal storm' heads to BritainNewly opened 758-metre bridge in China collapses A source suggested that the first three men were detained when they met for the weapons handover. The arrests came a day before Yom Kippur, the holiest day of the Jewish calendar. Hamas - which is considered a terrorist organisation by the EU - previously denied any connection to the men and said the allegations against it were \"baseless\". Another alleged member of the group, Mohammed A, was arrested on 3 November in London at the request of German police. He's accused of taking five handguns and ammunition from Abed Al G and transporting them to Vienna where they were stored. This morning Danish Police searched premises linked to Borhan El-K and another suspect in and around Copenhagen following Mr El-K's arrest on Tuesday. He was due to appear before a judge today. In February, four suspected Hamas members went on trial in Berlin accused of plotting attacks on Jewish sites in Europe."
    },
    {
        "title": "Trump asks Israeli president to 'fully pardon' Netanyahu in corruption trial",
        "description": "Donald Trump has sent a letter to the Israeli president urging him to \"fully pardon\" Benjamin Netanyahu in his long-running corruption trial.",
        "url": "https://news.sky.com/story/trump-asks-israeli-president-to-fully-pardon-netanyahu-in-corruption-trial-13469073",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-donald-trump-benjamin-netanyahu_7080062.jpg?20251112121922",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-12 12:11:00",
        "Headline": "Benjamin Netanyahu's trial began in 2020 and has not yet concluded - but Donald Trump said it was time to let him \"unite Israel by pardoning him\".",
        "Content": "Donald Trump has sent a letter to the Israeli president urging him to \"fully pardon\" Benjamin Netanyahu in his long-running corruption trial. The US president told Isaac Herzog his prime minister had \"stood tall for Israel in the face of strong adversaries\" and Mr Netanyahu's \"attention cannot be unnecessarily diverted\". Mr Netanyahu's trial, which began in 2020, has not yet concluded. He has pleaded not guilty to all charges, which include bribery and fraud. He was indicted in 2019 in three cases, including allegations of receiving nearly 700,000 shekels (£166,500) in gifts from business representatives. In the letter, Mr Trump wrote that he \"absolutely respects the independence of the Israeli Justice System, and its requirements\". But he added that he believed \"this 'case' against Bibi\" - a nickname for Mr Netanyahu - \"who has fought alongside me for a long time, including against the very tough adversary of Israel, Iran, is a political, unjustified prosecution\". He said Mr Netanyahu was \"now leading Israel into a time of peace\" and it was time to let him \"unite Israel by pardoning him\". In response, Mr Herzog's office said anyone seeking a presidential pardon \"must submit a formal request in accordance with the established procedures\". In the letter, they said: \"President Herzog holds President Trump in the highest regard and continues to express his deep appreciation for President Trump's unwavering support for Israel, his tremendous contribution to the return of the hostages, to reshaping the situation in the Middle East and Gaza especially, and to ensuring the security of the State of Israel. \"Alongside and not withstanding this, as the Office of the President has made clear throughout, anyone seeking a Presidential pardon must submit a formal request in accordance with the established procedures.\"  Mr Trump also called on Mr Herzog to pardon the prime minister when the American president addressed the parliament during a visit to Israel last month. Despite the largely ceremonial role of the Israeli presidency, Mr Herzog has the authority to pardon convicted criminals under unusual circumstances. Read more from Sky News:UK stops some intel sharing with the USDozens of protesters storm COP30 venue  Earlier this week, Mr Trump's son-in-law met Mr Netanyahu to discuss the future of the Gaza ceasefire. Jared Kushner met the prime minister in Jerusalem on Monday, according to an Israeli government official. International correspondent Donald Trump's latest intervention on behalf of Benjamin Netanyahu is as unprecedented as it is unorthodox. There is no historical analogue to a US president wading in like this to call for a pardon of a leader of a foreign country when a trial is still ongoing. It raises all sorts of questions about sovereignty and due process. But perhaps we should not be surprised. Mr Trump, after all, has a different way of doing things. There are obvious issues that are more pragmatic. \nUnder Israeli law, the president - whose role is largely ceremonial - does have the power to issue a pardon. However, traditionally a pardon is only issued after a conviction – and also only if the individual or their lawyer asks for one. So, why is the US president doing this? Like Mr Netanyahu, he sees the case as a left-wing witch hunt. This is, of course, not the first time Mr Trump has intervened. On 13 October, while speaking in the Israeli parliament, he addressed President Isaac Herzog directly: \"Mr President, why don’t you give him a pardon?\" he said, before adding \"cigars and champagne, who the hell cares about it?\" Mr Trump's move to send the letter is likely to be as divisive as the Israeli PM is as a figure in Israeli politics."
    },
    {
        "title": "Chinese hackers are sabotaging key infrastructure in Australia, spy chief warns ",
        "description": "Hackers working for the Chinese military and government have been probing Australia&#8217;s key infrastructure and telecoms network, warns spy chief. ",
        "url": "https://news.sky.com/story/chinese-hackers-are-sabotaging-key-infrastructure-in-australia-spy-chief-warns-13469027",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-mike-burgess-asio-security_7080012.jpg?20251112114157",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-12 11:01:00",
        "Headline": "Spy chief Mike Burgess says Chinese hackers have penetrated US systems and aim to do the same in Australia.",
        "Content": "Hackers working for the Chinese military and government have been probing Australia’s key infrastructure and telecoms network, warns spy chief.  Mike Burgess, director-general of security for the Australian Security Intelligence Organisation, warned Australians could have their water and electricity supplies cut off as well as extensive banking trouble if hackers managed to cause widespread telecoms disruption. \"Foreign governments have elite teams investigating these possibilities right now,\" Mr Burgess insisted. However, China's foreign ministry accused Burgess's statement of spreading false narratives. The warning demonstrates the difficulty faced by Australian prime minister Anthony Albanese in trying to keep China close economically while trying to mitigate security concerns. Burgess said espionage was estimated to have cost the country A$12.5bn (£6.2bn) last year, including billions in trade secrets and intellectual property. In particular, he highlighted the activities of the Chinese hacking groups Salt Typhoon and Volt Typhoon. \n                  Helen Garner's 'unsparing' diary collection becomes first to win prestigious Baillie Gifford non-fiction prize\n                 \n                  MP names suspect who confessed to murdering British toddler Cheryl Grimmer\n                 \n                  Burning space debris which crashed to Earth may have come from Chinese rocket, says expert\n                 He highlighted how Salt Typhoon had previously penetrated US telecoms systems intending to disrupt operations and pre-position for potential sabotage. In December, Washington said China had hacked dozens of countries and at least eight major US telecommunication companies, including: AT&T, Verizon and Lumen Technologies. This resulted in officials in Beijing having access to the private texts and calls of a \"large number\" of Americans. US officials later urged Americans to use encrypted messaging apps to minimise the chances of China intercepting their communications. Senior White House official Anne Neuberger said authorities didn't believe any classified communications had been compromised. A senior US official said that China's access was large enough to risk an \"ongoing compromise\". China rejected the accusations that it was responsible for the hack. Burgess also warned that Australian companies could be crippled as trade competitors or that elections could be affected.  Chinese officials made complaints to the Australian government and private sector about ASIO whenever he spokepublicly about China, Burgess said during a speech last week. \"It won't stop my resolve,\" he said. Not the first time alarms have been raised Concerns were raised in Canberra in February after Chinese warships conducted live-fire drills with minimal warning in the Tasman Sea. Australian authorities only heard about the drills when a commercial pilot for Virgin Australia notified Airservices Australia. The drills resulted in 49 flights having to change their path."
    },
    {
        "title": "Princess Anne lays a wreath at memorial service in Singapore",
        "description": "It was a sombre occasion when the Princess Royal paid tribute to those who gave their lives defending freedom thousands of miles from home.",
        "url": "https://news.sky.com/story/princess-anne-lays-a-wreath-at-memorial-service-in-singapore-13469021",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-princess-anne-singapore_7079976.jpg?20251112110437",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-12 10:53:00",
        "Headline": "Her two-day visit to the island country marks 60 years of diplomatic relations with the UK.",
        "Content": "It was a sombre occasion when the Princess Royal paid tribute to those who gave their lives defending freedom thousands of miles from home. Under grey skies, Anne joined British and Singaporean veterans in a minute's silence at the Kranji War Cemetery in Singapore. She then took a poppy wreath in her hands and laid it at the memorial before taking two steps back. Nearly 4,500 Commonwealth casualties of the Second World War, who died defending Singapore and Malaya from Japan, are laid to rest in the cemetery. Among them is Midshipman James Bremridge, a relative of Anne's husband Sir Timothy Laurence. Mr Bremridge, who died aged 18, served aboard HMS Repulse, which was sunk by Japanese aircraft in the South China Sea in December 1941. Sir Timothy laid a wreath on his grave. \n                  Princess Anne makes surprise Ukraine visit - and leaves a personal tribute\n                 \n                  King shows no sign of slowing down at Italian-themed food celebration\n                 \n                  Princess Anne thanks hospital staff for 'filling in the blanks' after horse accident\n                 During the visit, Anne met staff from the Commonwealth War Graves Commission, which she heads, and was greeted by its vice chair Peter Hudson. Commander Tim Curnock of the British Royal Navy read an extract from For the Fallen, before the assembled veterans said \"we will remember them\" in unison. Read more:King leads nation in remembrancePrince Harry on what it means to be British Along with the princess, the presidents of the Singapore Armed Veterans' League and veterans' charity Sandbag were also invited to lay wreaths at the memorial. The piper, who played to mark the occasion, stood at the top of the cemetery overlooking the rows of headstones and saluted after Anne spoke to him. The two-day visit to Singapore marks 60 years of diplomatic relations with the UK. The Princess Royal also visited the National Orchid Garden, where a flower was named after her in a short ceremony. The purple bloom, now called Dendrobium Anne, was \"very special\" she said. The princess was also shown around the VIP garden, where orchid hybrids named after various heads of state are kept. She paused to admire one called Dendrobium Elizabeth after her late mother. Six members of the royal family have had orchids named after them in the garden, including the Prince and Princess of Wales in 2012. Anne also visited HMS Spey, which has been deployed to the Indo-Pacific region since 2021."
    },
    {
        "title": "Newly opened 758-metre bridge in China collapses",
        "description": "A newly opened bridge has partially collapsed in China.",
        "url": "https://news.sky.com/story/newly-opened-758-metre-bridge-in-china-collapses-13469162",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/2614d40b3952dd45e1d534a22db246ec3387da4e20a653b2a4610b472589ed18_7080188.jpg?20251112150221",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-12 14:36:00",
        "Headline": "Footage shows part of the bridge, in the southwestern province of Sichuan, crashing into the ground just months after its construction.",
        "Content": " A newly opened bridge has partially collapsed in China. In footage, part of the bridge, in China's southwestern province of Sichuan, crashes into the ground as a huge cloud of smoke rises up next to a mountain. There were no reports of any casualties. Police in the city of Maerkang had closed the 758-metre-long Hongqi bridge to traffic on Monday afternoon after cracks appeared on nearby shops and roads. Shifts were also seen in the terrain of a mountain, local government said. Read more:Trump orders nuclear weapons tests as he meets XiDonald Trump says tariffs will be cut after meeting with Xi Conditions on the mountainside then worsened on Tuesday afternoon, with continuous heavy rainfall triggering landslides and causing the collapse of the approach bridge and roadbed. Construction of the bridge finished earlier this year, according to the contractor Sichuan Road & Bridge Group on social media. The bridge is located on a highway linking the country's heartland with Tibet. An investigation into the cause of the collapse has been launched. According to Chinese media, there was one truck on the bridge at the time of the collapse. The driver was successfully rescued."
    },
    {
        "title": "UK cuts funding to AIDS, tuberculosis and malaria project by £150m",
        "description": "The UK has cut &#163;150m from its contribution to a global project which combats AIDS, tuberculosis and malaria.",
        "url": "https://news.sky.com/story/uk-cuts-funding-to-aids-tuberculosis-and-malaria-project-by-163150m-13468997",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-malaria-vaccine-ivory-coast_7079932.jpg?20251112101915",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-12 09:55:00",
        "Headline": "The UK has historically been one of the biggest donors to the Geneva-based Global Fund - its £850m pledge for 2026 to 2028 represents a 15% drop in funding.",
        "Content": "The UK has cut £150m from its contribution to a global project which combats AIDS, tuberculosis and malaria. The pledge of £850m for the period of 2026 to 2028 represents a 15% drop from the £1bn contributed for 2023-25. The UK has historically been one of the biggest donors to the Geneva-based Global Fund, which raises and invests money to fight AIDS, tuberculosis and malaria. It comes as European nations face growing pressure from US President Donald Trump to commit more funding to defence. Foreign Secretary Yvette Cooper said the latest funding was an \"investment in our shared security and prosperity\" and it would help to save \"up to 1.3 million lives and protect British people and our NHS from the spread of diseases\". But some charities and aid groups have criticised the drop in funding, calling it \"disappointing\". Joanna Rea, director of advocacy for UNICEF in the UK, said: \"Cutting the UK's pledge to the Global Fund to fight AIDS, tuberculosis and malaria jeopardises vital partnerships that protect children from preventable diseases. \"It's a disappointing decision and comes as the UK prepares to co-host a replenishment conference and should be encouraging other donors.\" Earlier this year, the government cut its overall aid budget from 0.5% to 0.3% of gross national income so it could divert funds for annual defence spending. Read more:'Slashing aid will lead to unrest and risk UK security'What foreign aid is being cut by the UK?  The UK is also set to co-host a pledging event for the fund with South Africa later this month in Johannesburg as world leaders gather for the G20 summit. The Global Fund is trying to raise $18bn (£13.7bn) for its work in the coming three-year period. The money will help it save 23 million lives and move the world closer to ending the three deadly infectious diseases, it says. In October, Germany committed €1bn (£882m), which was €300m (£265m) lower than its pledge in the last funding cycle."
    },
    {
        "title": "What do Epstein documents say about Trump, Andrew and Mandelson?",
        "description": "Thousands of documents from disgraced financier Jeffrey Epstein have been released, which reference Donald Trump, Andrew Mountbatten-Windsor and Peter Mandelson among others.",
        "url": "https://news.sky.com/story/explainer-what-do-epsteins-emails-say-about-trump-13469184",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-andrew-prince-peter_7067348.jpg?20251030212634",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-12 15:49:00",
        "Headline": "The release of more than 20,000 documents related to Jeffrey Epstein provides an insight into his relationships with the likes of Donald Trump, former duke Andrew Mountbatten-Windsor and ex-politician and diplomat Peter Mandelson.",
        "Content": " Thousands of documents from disgraced financier Jeffrey Epstein have been released, which reference Donald Trump, Andrew Mountbatten-Windsor and Peter Mandelson among others. Democrats on the House Oversight Committee initially published several emails which they said \"raises questions about Trump and Epstein's relationship, Trump's knowledge of Epstein's crimes\" and the president's relationship to Epstein's victims. White House press secretary, Karoline Leavitt, said the \"selectively leaked emails\" were an attempt to \"create a fake narrative to smear President Trump\". He has consistently denied any involvement or knowledge about Epstein's sex trafficking operation. Trump latest: 20,000 pages published in response to 'leak' It prompted Republicans to retaliate by releasing more than 20,000 pages from Epstein's files and accusing Democrats of \"cherry-picking\" their documents. Here's what the emails say... :: Epstein discusses Trump Three messages, dated between 2011 and 2019, are between Jeffrey Epstein and his sex trafficking co-conspirator Ghislaine Maxwell and between Epstein and author Michael Wolff. In the first exchange of emails, between Epstein and his associate Ghislaine Maxwell, dated 2 April 2011, Epstein wrote: i want you to realize that that dog that hasn't barked is trump.. Virginia spent hours at my house with him ,, he has never once been mentioned. police chief. etc. im 75% there Maxwell responded: I have been thinking about that... The name Virginia, refers to Virginia Giuffre, a prominent Epstein survivor who died in April and had never accused Mr Trump of wrongdoing. Ms Giuffre made allegations of three sexual encounters with Andrew Mountbatten-Windsor, who was stripped of his prince title, in her autobiography which was released last month - allegations Andrew has denied. In the second exchange of emails, between Epstein and Michael Wolff, a journalist who has written several books about the Trump administration, dated 31 January 2019, Epstein wrote: [REDACTED NAME] worked at mara lago. . she was the one that accused prince andrew. . trump said me to resign, never a member ever.. of course he knew about the girls as he asked ghislaine to stop The third email exchange, between Epstein and Wolff, dated between 15 and 16 December 2015 shows that Wolff wrote: I hear CNN planning to ask Trump tonight about his relationship with you--either on air or in scrum afterwards. Epstein replied: if we were able to craft an answer for him, what do you think it should be? Wolff responded: I think you should let him hang himself. If he says he hasn't been on the plane or the house, then that gives you a valuable PR and political currency. You can hang him in a way that potentially generates a positive benefit for you, or, if it really looks like he could win, you could save him, generating a debt. Of course, it is possible that, when asked, he'll say Jeffrey is a great guy and has gotten a raw deal and is a victim of political correctness, which is to be outlawed in a Trump regime. Responding to the release of emails, Mr Wolff posted a video on Instagram: \"I have been trying to talk about this story for a very long time now and perhaps we're getting close to the smoking gun. \"These two men... had the closest of relationships for more than a decade.\" :: Andrew included in Epstein emails In several email exchanges, Epstein refers to Andrew Mountbatten-Windsor and a picture of him with victim Virginia Giuffre. A photo emerged in 2011 of Andrew, which has become infamous, showing the former prince with his arm around Virginia Giuffre, apparently taken in Ghislaine Maxwell's London home. The former duke, who was recently stripped of his titles, has previously said he didn't recall meeting Ms Giuffre and claimed an image of the pair could have been doctored. Although the name of the \"girl\" is redacted, Epstein appears in his email exchange to be referring to Ms Giuffre, who at the time had spoken to The Mail on Sunday, which had published the photo. In an email from Epstein to a reporter on 1 July 2011, he said: The girl has fled the country with an outstanding arrest warrant. The da (sic) after she accused others, said in writing that she has no credibility, she was never 15 years old working for me, her story made it seem like she first worked for trump at that age and was met by ghislaine maxwell. Total horseshit, the daily mail paid her money, they admitted it, with the statement that it took money to coax out the truth. Yes she was on my plane, and yes she had her picture taken with Andrew, as many of my employees have. In a separate email to a publicist on 1 July 2011, Epstein writes: The girl who accused Prince Andrew can also easily be proven to be a liar. I think Buckingham Palace would love it. You should task someone to investigate the girl Virginia Roberts, that has caused the Queen's son all this agro (sic). I promise you she is a fraud. You and I will be able to go to ascot (sic) for the rest of our lives. :: Mandelson and Epstein talk Trump According to the documents, Peter Mandelson, who was sacked as the UK ambassador to the US in September, was continuing his connections with Epstein in 2016. Sir Keir Starmer dismissed him after learning about emails between him and Epstein from 2005 to 2010 - including after Epstein's conviction for soliciting a minor for prostitution. In an exchange between Epstein and Peter Mandelson on 6 November 2016, Epstein wrote: 63 years old. . you made it Responding to the message referring to his birthday several days before, Mr Mandelson replied: Just. I have decided to extend my life by spending more of it in the US. On the same day, and just before the 2016 US presidential election, Epstein then replies: in the donald white house Epstein goes on to refer to Andrew and Mr Mandelson's partner, now husband, Reinaldo Avila da Silva: trump/ and having agreat [sic] deal of fun. In hindsight. you were right about staying away from andrew. I was right in your staying with rinaldo [sic] According to the documents, Mandelson responds: Of course, donald in WH. Will he get there? Yes, without Andrew it would not have gone nuclear. Did you advise me to stay with R ? Such a handful but loyal and never embarrassing.  In a separate email from 7 March 2011, Epstein received an interview request from the BBC via his lawyer: We are keen to explore the possibility of conducting an interview with Mr Epstein, on the subject of the stories which are circulating, however inaccurately, about both him and Prince Andrew, the Duke of York; we'd be keen to hear from Mr Epstein first hand so that the various and at times, speculative reporting which is at large in the UK press can be betterscrutinised?\". The message was forwarded to Mr Mandelson, who replied, bluntly: No!! In May this year, Mr Mandelson was asked by Sky News about his relationship with Epstein: \"I'm not answering any questions about him. My knowledge of him is something I regret, I wish I'd never met him in the first place.\" Read more from Sky News:Key claims by Virginia Giuffre in memoirGhislaine Maxwell appeals to TrumpUS Congress summons Andrew Sky News' US news partner NBC News has reached out to lawyers for Michael Wolff, Maxwell and the family of Virginia Giuffre for comment. The top Democrat on the House committee, Robert Garcia of California, said in a statement that the released emails \"raise glaring questions about what else the White House is hiding and the nature of the relationship between Epstein and the President\". The Oversight Committee Democrats say the emails strike \"a blow against the White House's Epstein cover-up\". But White House press secretary, Karoline Leavitt said in a statement: \"The Democrats selectively leaked emails to the liberal media to create a fake narrative to smear President Trump. \"The 'unnamed victim' referenced in these emails is the late Virginia Giuffre, who repeatedly said President Trump was not involved in any wrongdoing whatsoever and 'couldn't have been friendlier' to her in their limited interactions.\""
    },
    {
        "title": "Trump and the Epstein questions that will not go away",
        "description": "The newly released files have dragged Donald Trump's name back into one of the darkest scandals of modern American life.",
        "url": "https://news.sky.com/story/trump-and-the-epstein-questions-that-will-not-go-away-13469364",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-donald-trump-president_7080550.jpg?20251112215527",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-11-12 21:44:00",
        "Headline": "Emails from the estate of Jeffrey Epstein, released by a congressional committee, don't allege any criminal activity by the president.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n The newly released files have dragged Donald Trump's name back into one of the darkest scandals of modern American life. Emails from the estate of Jeffrey Epstein, released by a congressional committee, don't allege any criminal activity by the president. But the Democrats say they raise fresh questions about what he knew about the paedophile and when he knew it. The key detail comes from two Epstein emails, one sent to his girlfriend, Ghislaine Maxwell, another to author Michael Wolff. In 2011, he wrote to Maxwell: \"I want you to realize that the dog that hasn't barked is Trump. VICTIM spent hours at my house with him… he has never once been mentioned. police chief etc. I'm 75% there.\" Trump latest: 20,000 pages published in response to 'leak' White House press secretary Karoline Leavitt said Democrats had redacted the name because the victim in question was Virginia Guiffre, who never accused the president of wrongdoing. In a 2019 exchange with Wolff, Epstein wrote: \"trump said he asked me to resign, never a member ever. of course he knew about the girls as he asked ghislaine to stop\". Those words are ambiguous and we don't know the context in which they were written but earlier this year, Trump said he had fallen out with Jeffrey Epstein after he \"stole\" young women who worked at his Mar-a-Lago club in Florida and it could be a reference to that dispute.  For years, Trump promised to declassify all Epstein-related files - a pledge positioning him as a truth-teller exposing elite corruption. Now that others are releasing those materials first, the image that helped return him to the White House takes a hit. Instead of leading the charge, he's reacting to it, and among his base, there are many who remain convinced of an Epstein-related cover-up. Legally, there is nothing new here pointing to liability, but reputationally, this is dangerous terrain for the president. Read more:What do Epstein documents say about Trump, Andrew and Mandelson?Andrew did have photo taken with Virginia Giuffre, Epstein said The mention of a \"victim\" spending hours with him at Epstein's home, without clear context, invites headlines and speculation that could linger for months. But he has weathered much worse - his survival often relies on turning scandal into proof of persecution. That explains why the White House is doubling down on its claim that Democrats are releasing selective documents to the \"liberal media\" to smear Donald Trump."
    },
    {
        "title": "Epstein said Andrew did have photo taken with Virginia Giuffre, emails show",
        "description": "Newly released emails from Jeffrey Epstein include one in which the late paedophile financier describes how Andrew Mountbatten-Windsor did have his photo taken with victim Virginia Giuffre.",
        "url": "https://news.sky.com/story/epstein-claimed-andrew-did-have-photo-taken-with-virginia-giuffre-emails-show-13469255",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-prince-andrew-virginia-roberts_6897144.jpg?20251016192019",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-12 18:34:00",
        "Headline": "The former Duke of York, who was recently stripped of his titles, has previously said he didn't recall meeting Ms Giuffre and claimed an image of the pair could have been doctored.",
        "Content": "Newly released emails from Jeffrey Epstein include one in which the late paedophile financier describes how Andrew Mountbatten-Windsor did have his photo taken with victim Virginia Giuffre. The former duke, who was recently stripped of his titles, has previously said he didn't recall meeting Ms Giuffre and claimed an image of the pair could have been doctored. Ms Giuffre, who took her own life earlier this year, claimed in her recently released autobiography that - as a teenager - she had sex with Andrew on three occasions after being trafficked by Epstein and Ghislaine Maxwell. Andrew has always strongly denied the claims. Trump latest: 20,000 pages from Epstein files released The details have emerged after thousands of files from the Jeffrey Epstein estate were released by Republicans on the House Oversight Committee. The email that discusses the photograph was one of those released and features an exchange with a journalist in 2011. \n                  Princess Beatrice appears at her first charity event in UK since Andrew stripped of prince title\n                 \n                  Ghislaine Maxwell's emails from minimum-security jail leaked - amid claims of 'VIP treatment'\n                 \n                  Congress letter to Andrew: Read in full\n                 A picture emerged in 2011 of Andrew, which has become infamous, showing the former prince with his arm around Virginia Giuffre, apparently taken in Ghislaine Maxwell's London home. Although the name of the \"girl\" is redacted, Epstein appears in his email exchange to be referring to Ms Giuffre, who at the time had spoken to The Mail on Sunday, which had published the photo and her account of encountering Andrew while travelling with Epstein. After cutting ties with Epstein, she moved to Australia. She also changed her surname from Roberts to Giuffre. An email from Epstein to the journalist read: \"The girl has fled the country with an outstanding arrest warrant. The da (sic) after she accused others, said in writing that she has no credibility, she was never 15 years old working for me, her story made it seem like she first worked for trump at that age and was met by ghislaine maxwell. \"Total horseshit, the daily mail paid her money, they admitted it, with the statement that it took money to coax out the truth. \"Yes she was on my plane, and yes she had her picture taken with Andrew, as many of my employees have. \"I have never misled you, this girl is a total liar, they (sic) authorities should check her australian immigration form... I will ask if they will cooperate - Prince people.\" In a different email exchange in March 2011 about an inquiry from a news reporter, Epstein messages someone listed as \"The Duke\", which is thought to be Andrew. Epstein told him: \"Im not sure how to respond, the only person she didn't have sex with was Elvis.\" It prompted the following response: \"Please make sure that every statement or legal letter states clearly that I am NOT involved and that I knew and know NOTHING about any of these allegations. \"I can't take any more of this my end.\" It is not clear if Epstein, who killed himself in 2019 while awaiting trial on sex-trafficking charges, was writing about Ms Giuffre. Read more from Sky News:What do Epstein's emails say about Trump?Congress summons Andrew over Epstein Epstein: 'She is a fraud' In a separate email to a publicist in July 2011, Epstein writes: \"The girl who accused Prince Andrew can also easily be proven to be a liar. \"I think Buckingham Palace would love it. You should task someone to investigate the girl Virginia Roberts, that has caused the Queen's son all this agro (sic). \"I promise you she is a fraud. You and I will be able to go to ascot (sic) for the rest of our lives.\" Speaking to Newsnight in 2019, Andrew said: \"I have absolutely no memory of that photograph ever being taken... you can't prove whether or not that photograph is faked or not... \"That's me but whether that's my hand or whether that's the position I... but I don't... I have simply no recollection of the photograph ever being taken.\""
    },
    {
        "title": "Trump asks Israeli president to 'fully pardon' Netanyahu in corruption trial",
        "description": "Donald Trump has sent a letter to the Israeli president urging him to \"fully pardon\" Benjamin Netanyahu in his long-running corruption trial.",
        "url": "https://news.sky.com/story/trump-asks-israeli-president-to-fully-pardon-netanyahu-in-corruption-trial-13469073",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-donald-trump-benjamin-netanyahu_7080062.jpg?20251112121922",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-12 12:11:00",
        "Headline": "Benjamin Netanyahu's trial began in 2020 and has not yet concluded - but Donald Trump said it was time to let him \"unite Israel by pardoning him\".",
        "Content": "Donald Trump has sent a letter to the Israeli president urging him to \"fully pardon\" Benjamin Netanyahu in his long-running corruption trial. The US president told Isaac Herzog his prime minister had \"stood tall for Israel in the face of strong adversaries\" and Mr Netanyahu's \"attention cannot be unnecessarily diverted\". Mr Netanyahu's trial, which began in 2020, has not yet concluded. He has pleaded not guilty to all charges, which include bribery and fraud. He was indicted in 2019 in three cases, including allegations of receiving nearly 700,000 shekels (£166,500) in gifts from business representatives. In the letter, Mr Trump wrote that he \"absolutely respects the independence of the Israeli Justice System, and its requirements\". But he added that he believed \"this 'case' against Bibi\" - a nickname for Mr Netanyahu - \"who has fought alongside me for a long time, including against the very tough adversary of Israel, Iran, is a political, unjustified prosecution\". He said Mr Netanyahu was \"now leading Israel into a time of peace\" and it was time to let him \"unite Israel by pardoning him\". In response, Mr Herzog's office said anyone seeking a presidential pardon \"must submit a formal request in accordance with the established procedures\". In the letter, they said: \"President Herzog holds President Trump in the highest regard and continues to express his deep appreciation for President Trump's unwavering support for Israel, his tremendous contribution to the return of the hostages, to reshaping the situation in the Middle East and Gaza especially, and to ensuring the security of the State of Israel. \"Alongside and not withstanding this, as the Office of the President has made clear throughout, anyone seeking a Presidential pardon must submit a formal request in accordance with the established procedures.\"  Mr Trump also called on Mr Herzog to pardon the prime minister when the American president addressed the parliament during a visit to Israel last month. Despite the largely ceremonial role of the Israeli presidency, Mr Herzog has the authority to pardon convicted criminals under unusual circumstances. Read more from Sky News:UK stops some intel sharing with the USDozens of protesters storm COP30 venue  Earlier this week, Mr Trump's son-in-law met Mr Netanyahu to discuss the future of the Gaza ceasefire. Jared Kushner met the prime minister in Jerusalem on Monday, according to an Israeli government official. International correspondent Donald Trump's latest intervention on behalf of Benjamin Netanyahu is as unprecedented as it is unorthodox. There is no historical analogue to a US president wading in like this to call for a pardon of a leader of a foreign country when a trial is still ongoing. It raises all sorts of questions about sovereignty and due process. But perhaps we should not be surprised. Mr Trump, after all, has a different way of doing things. There are obvious issues that are more pragmatic. \nUnder Israeli law, the president - whose role is largely ceremonial - does have the power to issue a pardon. However, traditionally a pardon is only issued after a conviction – and also only if the individual or their lawyer asks for one. So, why is the US president doing this? Like Mr Netanyahu, he sees the case as a left-wing witch hunt. This is, of course, not the first time Mr Trump has intervened. On 13 October, while speaking in the Israeli parliament, he addressed President Isaac Herzog directly: \"Mr President, why don’t you give him a pardon?\" he said, before adding \"cigars and champagne, who the hell cares about it?\" Mr Trump's move to send the letter is likely to be as divisive as the Israeli PM is as a figure in Israeli politics."
    },
    {
        "title": "Wealth managers WH Ireland and Team in all-share merger talks",
        "description": "WH Ireland, the wealth management group, is in talks about an all-share merger with Team, another London-listed operator in the sector.",
        "url": "https://news.sky.com/story/wealth-managers-wh-ireland-and-team-in-all-share-merger-talks-13469250",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-london-city-financial_6928635.jpg?20250527115210",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-12 18:15:00",
        "Headline": "The London-listed minnows, which between them have a market capitalisation of barely £20m, are in discussions about a deal to join forces, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n WH Ireland, the wealth management group, is in talks about an all-share merger with Team, another London-listed operator in the sector. Sky News has learnt that the two companies are in advanced discussions about a deal that could value WH Ireland at more than 4p-per-share - roughly eight times the value of a rival transaction which was voted down by its shareholders last month. Sources said the deal, if completed, would create a larger player in the UK wealth management market, although the companies are relative minnows with a combined market capitalisation of just £20m. Both WH Ireland and Team declined to comment. The value that the prospective deal places on WH Ireland's stock may prompt questions from its shareholders about why a transaction worth a fraction of its value received a recommendation from its board and advisers. Last month, Sky News revealed that the £1m sale of WH Ireland's wealth management division to Oberon Investments was on the brink of collapse after a group of investors moved to block it. WH Ireland's wealth arm has about £830m of assets under management, while Team has total assets under management or administration of more than £1bn. \n                  Guests 'kicked out' as hotel chain collapses | Money blog\n                 \n                  Thousands of NHS staff to be made redundant after funding agreed\n                 \n                  NSK plans to shut UK factories - placing hundreds of jobs at risk\n                 The former's biggest shareholders, according to its website, include TFG Asset Management, which owns 29.9%, the prominent City figure Hugh Osmond, who holds just under 10%, and Melvin Lawson, owner of a 9.7% stake. The board of WH Ireland is chaired by Simon Moore, who also chairs LV Financial Services, the life insurance mutual."
    },
    {
        "title": "Thousands of NHS staff to be made redundant after funding agreed",
        "description": "Thousands of job cuts at the NHS will go ahead after the &#163;1bn needed to fund the redundancies was approved by the Treasury.",
        "url": "https://news.sky.com/story/thousands-of-nhs-staff-to-be-made-redundant-after-funding-agreed-13468879",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-nhs-cuts-generic-logo_7079718.jpg?20251112012331",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-12 00:51:00",
        "Headline": "The government says the jobs will go in order to slash \"unnecessary bureaucracy\" and ensure taxpayers' money is being \"spent wisely\".",
        "Content": "Thousands of job cuts at the NHS will go ahead after the £1bn needed to fund the redundancies was approved by the Treasury. The government had already announced its intention to slash the headcount across both NHS England and the Department of Health by around 18,000 administrative staff and managers, including on local health boards. The move is designed to remove \"unnecessary bureaucracy\" and raise £1bn a year by the end of the parliament to improve services for patients by freeing up more cash for operations. NHS England, the Department of Health and Social Care, and the Treasury had been in talks over how to pay for the £1bn one-off bill for redundancies. It is understood the Treasury has not granted additional funding for the departures over and above the NHS's current cash settlement, but the NHS will be permitted to overspend its budget this year to pay for redundancies, recouping the costs further down the line. 'Every penny will be spent wisely' Chancellor Rachel Reeves is set to make further announcements regarding the health service in the budget on 26 November. And addressing the NHS providers' annual conference in Manchester today, Mr Streeting is expected to say the government will be \"protecting investment in the NHS\". He will add: \"I want to reassure taxpayers that every penny they are being asked to pay will be spent wisely. \"Our investment to offer more services at evenings and weekends, arm staff with modern technology, and improving staff retention is working. \"At the same time, cuts to wasteful spending on things like recruitment agencies saw productivity grow by 2.4% in the most recent figures - we are getting better bang for our buck.\" Mr Streeting's speech is due to be given just hours after he became entrenched in rumours of a possible coup attempt against Sir Keir Starmer, whose poll ratings have plummeted ahead of what's set to be a tough budget. Mr Streeting's spokesperson was forced to deny he was doing anything other than concentrating on the health service. Read more from Sky News:Russian troops in Mad Max-style videoShamima Begum 'should be repatriated' He is also expected on Wednesday to give NHS leaders the go-ahead for a 50% cut to headcounts in Integrated Care Boards, which plan health services for specific regions. They have been tasked with transforming the NHS into a neighbourhood health service - as set down in the government's long-term plans for the NHS. Those include abolishing NHS England, which will be brought back into the health department within two years. Watch Wes Streeting on Mornings With Ridge And Frost from 7am on Sky News."
    },
    {
        "title": "NSK plans to shut UK factories - placing hundreds of jobs at risk",
        "description": "A Japanese manufacturing firm is facing a union battle over plans to shut factories in County Durham with the loss of hundreds of jobs.",
        "url": "https://news.sky.com/story/nsk-plans-to-shut-uk-factory-placing-hundreds-of-jobs-at-risk-13468896",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-nissan-sunderland_6915096.jpg?20250513124842",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-11-12 05:41:00",
        "Headline": "NSK, which has supplied bearings to automotive producers in the UK including Nissan's Sunderland plant, says the Peterlee site has become unprofitable. ",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n A Japanese manufacturing firm is facing a union battle over plans to shut factories in County Durham with the loss of hundreds of jobs. NSK said it was proposing to close its two sites in Peterlee as part of a strategy to exit unprofitable businesses. The factories, which produce bearings for the automotive industry, employ up to 400 people. Money latest: The autumn driving hazards that could cost you thousands NSK said it had begun consultations with union representatives on its plans. Unite the Union said it would fight the planned closures. It described the announcement as a \"betrayal\" of the workforce. The company first began operations at Peterlee in 1976. It has another UK manufacturing facility at Newark in Nottinghamshire and another three in Germany and Poland. The Peterlee factories produce bearings for steering columns and wheel hubs. Its customers are understood to include VW, Renault and fellow Japanese firm Nissan, which has sprawling car production facilities just up the coast at nearby Sunderland. Its statement said NSK Europe had faced \"persistent challenges in the profitability of locally manufactured products\". \"NSK will continue discussions with stakeholders and provide support measures for affected staff if the closure proceeds, which is expected to be completed no later than March 2027. \"The company has not yet determined the full impact of this decision on its business performance,\" the statement concluded. Challenges for UK manufacturers in recent times include Brexit red tape and high energy costs, though the Peterlee operation is understood to have been run on power generated purely from wind. Unite blamed pressures on automotive parts suppliers from weak demand hitting car manufacturers during the transition away from internal combustion engines to electric vehicles.   Read more from Sky News:Unemployment rate jumps to highest level since late 2020Chancellor all but confirms she'll break tax promises  Its general secretary Sharon Graham said: \"This is a complete betrayal by NSK of its County Durham workforce, who have broken their backs hitting performance targets that they were told would keep their factories safe. \"There is a viable business case for keeping these sites open and Unite will fight tooth and nail for that to happen.\" Unite said it was urging the government to intervene with financial support to protect automotive jobs.  "
    },
    {
        "title": "'Forget London': Top chef on UK's new food capital and the supermarket butter every kitchen needs",
        "description": "Every month the Money blog interviews a top chef from around the UK, hearing about their cheap food hacks, views on the industry and more. Today they speak to Kevin Bonello, head chef at the Grade II* listed hotel The Grand, York.",
        "url": "https://news.sky.com/story/forget-london-top-chef-on-uks-new-food-capital-and-the-supermarket-butter-every-kitchen-needs-13469043",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-kevin-bonello-chef_7079881.jpg?20251112092340",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-12 11:25:00",
        "Headline": "Kevin Bonello says those in search of amazing restaurants should try a certain area in the North rather than the capital.",
        "Content": "Every month the Money blog interviews a top chef from around the UK, hearing about their cheap food hacks, views on the industry and more. Today they speak to Kevin Bonello, head chef at the Grade II* listed hotel The Grand, York. If I were prime minister for the day... I'd focus on improving working conditions across the industry to make them fairer and more sustainable, to help attract and retain talent. I'd put in place more government incentives for people to move into hospitality - we need the industry to carry on thriving and this would help to support that, as people are moving away from it. I would also encourage the nice side of cheffing to be shown more in TV... and media. Showcasing the passion, teamwork and artistry behind the industry would inspire more people to pursue it as a fulfilling career. Read all the latest Money news here The place I love to go to for a cheap meal in York is... Robinsons. It's on what the locals call Bishy Road, a quaint street that feels like a small village but is just a few minutes' walk from the city centre. It has a greengrocer, butcher, cookware shop and restaurants and has a fabulous atmosphere. The team at Robinsons has a background in Michelin-starred restaurants, so the food is exceptional, and the service is relaxed, making for the perfect combination. My favourite dish there is Turkish eggs, with the poached eggs changed to scrambled. Accompanied by fresh orange juice and an Americano. My favourite budget recipe is... San Marzano tomato sauce. (Makes 2kg - freeze and use for pasta sauce or a pizza base) Method Chefs shouldn't bother trying to make dried pasta... fresh pasta can be made at home easily and tastes great, but we all know too well how sometimes you need something quick and easy for dinner. I always have a really good quality dried pasta in my pantry for those evenings when I need to have something simple and quick, yet it is still going to satisfy me. Read more from the Cheap Eats series:Fortnum and Mason's pastry guru reveals best supermarket dessertTop chef on why Rick Stein is the 'real deal'TV chef points finger on hospitality woes Mobiles should only be for photography in restaurants... not to have conversations or scroll on social media. I think mealtimes are about enjoying the food with others and appreciating the time together, so I feel it's much nicer for you, those you're with and the atmosphere if phones are out of sight. The best pizza in the UK is... Cresci. I am lucky enough for it to be in York, but it is an authentic Italian pizza restaurant in the city that makes delicious dough, amazing flavour combinations in toppings and cooks them perfectly. My favourite supermarket own-brand item is... Tesco's Finest truffle butter. This is great to use in a number of ways to add an extra something to a dinner. I like to finish a risotto with it by whisking it in at the last minute or tossing roasted winter veg in the melted butter before serving - delicious. Forget London, head to Cumbria... It's an excellent place with a fantastic variety of amazing restaurants serving a high calibre of food. My personal favourites are L'Enclume and Source at Gilpin."
    },
    {
        "title": "How No 10 plunged itself into crisis ahead of a perilous budget",
        "description": "Double-dealing, plotting, declarations of loyalty and treachery - in recent weeks the nation has feasted on Celebrity Traitors. ",
        "url": "https://news.sky.com/story/how-no-10-plunged-itself-into-crisis-ahead-of-a-perilous-budget-13469238",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-beth-rigby_6933158.jpg?20250602133605",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-11-12 17:33:00",
        "Headline": "Ahead of a critical budget later this month, Downing Street descended into a crisis of its own making - and Labour MPs are furious.",
        "Content": "\n          Political editor\n              @BethRigby\n  Double-dealing, plotting, declarations of loyalty and treachery - in recent weeks the nation has feasted on Celebrity Traitors.  But these sorts of antics emanating from Downing Street, a couple of weeks out from a critical budget, feels far less entertaining and only serves to further hurt a struggling prime minister. It wasn't the intention. Allies of Keir Starmer have been alive to growing talk of a possible post-budget challenge, which has building amid growing concerns from MPs about the upcoming manifesto-breaking budget, the continued dire polling, and a Downing Street forever on the back foot. There was a decision, as I understand it, from the PM's team, in light of questions being asked about a possible challenge, to put it out there that he would stay and fight a leadership challenge should it come. Politics latest: Starmer denies authorising attack on Streeting I was briefed about this on Tuesday by allies that wanted to make the case to the parliamentary party about the perils of trying to oust a sitting prime minister 18 months into the parliamentary term. My contacts made it very clear to me that the PM would fight any challenge, in turn triggering a three-month leadership battle that would spook the markets, create more chaos and further damage the Labour brand. \n                  Labour's dilemma: The two-child benefit cap\n                 \n                  Starmer and Reeves hint at tax rises to come ahead of unusual pre-budget speech today\n                 \n                  How Rachel Reeves might fill £30bn budget black hole\n                 They also stressed the PM has no intention of giving way just 18 months in. The intention was to try to see off any plot and scare the parliamentary party into line at the prospect of a full-on meltdown should the challenge come. But the decision by some of the PM's allies to anonymously also drop the name of prime traitor suspect - Wes Streeting - into briefings has badly backfired and plunged No 10 into crisis. 'Frustration' after PM's allies went 'too far' As for the clean-up job, Mr Streeting - already carded for the morning round ahead of a speech on the NHS on Wednesday - has come out to declare his loyalty (tick), but also take aim at the No 10 briefers, and called on the PM to take them to task. On the part of No 10, I was told by sources on Wednesday morning that there wasn't an attempt to brief against the health secretary - there is a view that some of Sir Keir's allies might have gone too far, rather to make it clear the PM was prepared to fight a challenge if it came. I am told by one No 10 source there is \"frustration\" over how his played out and it had \"got out of control\". \"Wes is doing a good job, is an asset and doing a big speech today making the broader case of not cutting spending ahead of the budget,\" said a source.  But putting the genie back in the bottle is no easy feat. MPs are furious at the briefings and exasperated that No 10 have made a mountain out of a molehill, with some suggesting that there wasn't an active plot post-budget, and they have created a crisis when there wasn't one. \"They've done this before,\" observed on senior party figure. \"They pick a fight of their own making and imply everything is a calamity ahead of a big possible negative, be it the budget or the Batley and Spen by-election [in an effort to get MPs to rally around the PM]. \"It's worked in the past; I think they have misplayed it this time. They have started a fire they cannot put out.\"  The prime minister has been left badly burnt in all of this. He was forced at PMQs to defend his health secretary and his chief of staff as Kemi Badenoch goaded him over No 10's \"toxic culture\", and called for him to sack Morgan McSweeney, his chief of staff. The PM told his party that he \"never authorised\" briefings against his cabinet and that it was \"completely unacceptable\". But when his team were later asked about what the PM was going to do about it, they didn't appear to have an answer. If he takes no action, it will only feed into the sense among many in his party that Sir Keir doesn't have a grip of his operation and is not leading from the front. That's difficult when his health secretary, having professed his loyalty, has called on the PM to deal with those briefing against him. It's a mess.  Budget measures to calm febrile party And this mess comes at a time that is already so difficult for this government. Number 10 and No 11 knows exactly how difficult the coming weeks are going to be. The chancellor has been out pitch rolling her budget, trying to explain the reasons behind potential manifesto-breaking pledges and arguing that the alternatives - cutting spending and a return to austerity or breaking fiscal rules, and the knock on effect in the markets - are far worse. The prime minister is also going to be out making the case as Downing Street and the Treasury work out how they can possibly try to sell a manifesto-breaking budget to voters already completely disillusioned with this Labour administration. I'm told that the current working plan is to do a combination of tax rises and action on the two-child benefit cap in order for the prime minister to be able to argue that in breaking his manifesto pledges, he is trying his hardest to protect the poorest in society and those working people he has spoken of being endlessly in his mind's eye when he takes decisions in No 10. The final decisions are yet to be taken, but the current thinking is to lift the basic rate of income tax - perhaps by 2p - and then simultaneously cut national insurance contributions for those on the basic rate of income tax (those who earn up to £50,000 a year). That way, the chancellor can raise several billion in tax from those with the 'broadest shoulders' - higher-rate taxpayers and pensioners or landlords. At the same time, the chancellor intends to move on the two-child benefit cap - although it's unclear if that will be a full or partial lifting of that cap - in order to argue that Labour is trying to still protect those on lower incomes from tax hikes. Those two measures will be designed to try to calm a febrile party and prevent panic after the budget. As one informed MP put it to me, the combination of tax rises for wealthier workers and more support for parents with more than two children are arguments that many MPs could get behind.  More bad news at moment of peril This is also why No 10 getting ahead of a possible post-budget coup has surprised me a little, given that pretty much all the conversations about a possible challenge to the PM have been linked to the ballot box test next May. One party figure told me on Wednesday it would be \"insane and catastrophic\" to for the party to try and bring down a Labour PM over a Labour budget, given, for a start, how the markets would react, and thinks the No 10 briefing is a reflection of how \"paranoid and out of touch\" the Starmer operation is with the parliamentary party. But it is also true that there is a settled view among some very senior figures in the party that Sir Keir lacks the charisma, leadership and communication skills to take on Nigel Farage, while broken manifesto promises will kill his hopes of standing for a second term. As one figure put it to me: \"Breaking those promises will destroy him. The public won't give him a hearing again. We need a clean skin.\" The whispered plots around Westminster are now front page news - not something the Sir Keir would have wanted as he prepares to front up what is shaping up to be his biggest test as prime minister yet, should he break the most sacred of his manifesto pledges on not raising VAT, income tax and national insurance on working people. There is no doubt the budget will be a moment of peril - and those who wanted to be faithful to the PM this week have somehow only managed to make his situation even worse."
    },
    {
        "title": "Resident doctor strikes: I don't want people to suffer but we have to walk out again, says BMA chief",
        "description": "The British Medical Association (BMA) has defended a new round of resident doctor walkouts starting on Friday, insisting medics' pay is still \"way down\" compared with 2008 and that the government has failed to finish \"a journey\" towards restoring it.",
        "url": "https://news.sky.com/story/resident-doctor-strikes-i-dont-want-people-to-suffer-but-we-have-to-walk-out-again-says-bma-chief-13469110",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-doctor-strike-nhs_6977891.jpg?20250730131411",
        "type": "Politics",
        "Author": "Ashish Joshi",
        "Date Published": "2025-11-12 13:13:00",
        "Headline": "Resident doctors - previously known as junior doctors - are beginning their latest strike action this week. The health secretary isn't happy, having hoped a pay deal reached after coming to office last year would put the issue to bed for the long-term.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n  The British Medical Association (BMA) has defended a new round of resident doctor walkouts starting on Friday, insisting medics' pay is still \"way down\" compared with 2008 and that the government has failed to finish \"a journey\" towards restoring it. BMA chair Dr Tom Dolphin told Sky News the dispute remains rooted in years of pay erosion that have left resident doctors far behind other public sector workers. \"When we started the dispute, […] the lowest level of the resident doctors were being paid £14 an hour,\" he said. \"There were some pay rises over the last couple of years that brought that partly back to the value it should be at, but not all the way. \"The secretary of state (Wes Streeting) himself called it a journey, implying there were further steps to come, but we haven't seen that.\" When asked if the row ultimately \"comes down to money\", he replied: \"In the sense that the secretary of state doesn't want to or isn't able to fund the pay increases to match the value that we had in 2008.\" Dr Dolphin argued that while \"the general worker in the economy as a whole\" has seen pay catch up since the 2008 financial crash, \"doctors are still way down\". The government points out that its 29% settlement last year was one of the largest in the public sector and was intended to draw a line under two years of walkouts. After the most recent pay awards, in 2025/26 a medic just out of university receives a basic salary of £38,831 and has estimated average earnings of £45,900 after factors like extra pay for unsociable hours are taken into account, according to medical think tank the Nuffield Trust. That average figure rises to £54,400 by the second year and a more senior speciality registrar earns an average of £80,500. The BMA says that when the dispute started, the most junior doctors were making around £14 per hour. That works out at £29,120 per year for a 40-hour week. That's very close to the earnings of a doctor fresh out of medical school in 2022/23 - £29,384, according to Full Fact. But that's over a 52-week year without taking into account paid holiday or unsociable hours. But Dr Dolphin said the deal still fell short: \"The gap was biggest for doctors and needed the biggest amount of restoration, and that's what we got.\" He defended the BMA's use of the Retail Price Index (RPI), a metric rejected by the Office for National Statistics, saying it \"better reflects the costs people face\". Should resident doctors get a pay rise? Have your say in the poll at the bottom of this story. 'Who do you think is treating the patients?' With Chancellor Rachel Reeves preparing her budget amid warnings of deep cuts, Dr Dolphin said the BMA is not demanding an immediate cash injection. \"We're quite happy for that money to be deferred with some kind of multi-year pay deal so that we can end the dispute and avoid having further industrial action about pay for several years to come,\" he said. \"Money spent in the NHS is returned to the economy. For every pound you spend, you get several pounds back.\" When pressed on whether the £1.7bn cost of previous strike action could have been better spent on treatment and technology for NHS cancer patients, he hit back: \"Who do you think is treating the cancer patients? It's the doctors.\" Read more on Sky News:Thousands of NHS redundanciesSentence and fine over patient death Strikes will cause disruption, union boss admits Dr Dolphin rejected suggestions that the dispute could destabilise the government, calling the idea \"implausible\". He admitted prolonged strikes have tested public patience, but said the government had left doctors with no choice. \"A prolonged industrial dispute makes people annoyed with both sides,\" he said. \"It is vexing to us that we are still in this dispute.\" \"I don't want patients to suffer,\" he added. \"I accept that the strikes cause disruption… of course that's upsetting for them. I completely get that. And I'm sorry that it's happening.\""
    },
    {
        "title": "Sir Keir Starmer expresses 'sincere regret' over appointment of Labour donor to chair football regulator",
        "description": "Sir Keir Starmer has expressed \"sincere regret\" over signing off the appointment of a Labour donor as the first chair of England's new football regulator.",
        "url": "https://news.sky.com/story/sir-keir-starmer-expresses-sincere-regret-over-appointment-of-labour-donor-to-chair-football-regulator-13469369",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-football_7080552.jpg?20251112215931",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-12 21:50:00",
        "Headline": "The prime minister had recused himself from decisions related to the appointment of a chair for the new regulator because of his interest in football, and football-related hospitality he had received.",
        "Content": " Sir Keir Starmer has expressed \"sincere regret\" over signing off the appointment of a Labour donor as the first chair of England's new football regulator. In a letter to his ethics adviser on Wednesday, the prime minister said he made an \"unfortunate error\" in signing off the appointment of David Kogan, having recused himself from decisions related to the process due to his interest in football. It comes after Culture Secretary Lisa Nandy apologised following an independent investigation last week that found that she had \"unknowingly\" breached the public appointments code by failing to declare £2,900 in donations from Mr Kogan in 2020. Politics latest: Starmer apologises to Streeting after coup accusations The former media executive also donated to Sir Keir's Labour leadership campaign in 2020 and to his constituency party in the run-up to last year's general election. The prime minister wrote in his letter to his ethics advisers, Sir Laurie Magnus, explaining that he had agreed to \"recuse myself from decisions relating to the Football Governance Bill\" in autumn 2024 because of his interest in football, and football-related hospitality he had received. However, he continued: \"In April 2025, a note was submitted to me informing me that, after running the appointment process, the Culture Secretary wanted to appoint David Kogan as the inaugural chair of the Independent Football Regulator, subject to pre-appointment scrutiny by the Select Committee. \n                  Football fans infiltrated tightly-controlled derby clash disguised as stewards\n                 \n                  Over 1,000 players suspended in widening Turkish football betting investigation\n                 \n                  Tories demand investigation into Lisa Nandy over failure to disclose donations from head of new football regulator\n                 \"The note asked me whether I was content. I confirmed that I was supportive. \"I knew that the decision was for the Secretary of State to take and I replied on the basis that the decision had been taken. \"In retrospect, it would have been better if I had not been given the note or confirmed that I was content with the appointment. This was an unfortunate error for which I express my sincere regret.\" The prime minister added that he has asked his officials to carry out an internal review of the processes by which recusals are managed in No 10. Sir Laurie wrote in his reply that Sir Keir's involvement was \"regrettable\" in light of his recusal, and welcomed the internal review. He added: \"I consider that the disclosures made in your letter are an important demonstration of your commitment to transparency and to ensuring that mistakes are acknowledged and necessary steps taken to improve processes underpinning standards in public life.\" Downing Street insisted on Tuesday the appointment had been made by the Culture Secretary, not the prime minister. Mr Kogan was confirmed as the new head of the Independent Football Regulator in October, after being named the government's preferred candidate in April. He had originally been approached about the job by the previous Conservative government under Rishi Sunak. However, the Tories say the prime minister has been \"caught offside signing off on the appointment of a major donor to a powerful new role\". Shadow Cabinet Office minister Alex Burghart said: \"This isn't just sloppy; it's a serious lapse of judgment from a man who promised integrity and transparency - and potentially another serious breach of the rules. \"It's yet more scandal right at the heart of his Government. Amidst open civil war in the Labour Party, it is clear the prime minister doesn't have the backbone to control his own administration or simply doesn't care.\""
    },
    {
        "title": "Reform pulls out of BBC documentary amid Trump legal threat",
        "description": "Reform UK has pulled out of a BBC documentary about the party amid a row over the broadcaster's misleading editing of a Donald Trump speech.&#160;",
        "url": "https://news.sky.com/story/reform-pulls-out-of-bbc-documentary-amid-trump-legal-threat-13469098",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-nigel-farage-reform_7078390.jpg?20251110165210",
        "type": "Politics",
        "Author": "Bethany Minelle",
        "Date Published": "2025-11-12 12:53:00",
        "Headline": "Nigel Farage's party will no longer assist the filmmakers amid controversy over how the BBC edited one of Donald Trump's speeches.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Reform UK has pulled out of a BBC documentary about the party amid a row over the broadcaster's misleading editing of a Donald Trump speech.  The Rise Of Reform had been due to air in January, fronted by Laura Kuenssberg, and was being made by the independent production company October Films. An internal memo sent to all Reform MPs, councillors and other senior figures, and seen by Sky News, told party officials to stop assisting with the documentary.  A senior official wrote: \"Hi all, as you will be aware October Films have been filming a documentary with Kuenssberg on the rise of Reform. \"As part of this, they have been visiting and filming at Reform councils and speaking to our councillors and council leaders across the country. \"We want to be clear that October Films have always conducted themselves professionally, and there is no suggestion from our side that they would maliciously misrepresent Reform UK. However, following the Panorama documentary the trust has been lost.\" The email continued: \"If you are approached to participate, we would strongly advise you decline. If you have already participated, we would strongly advise that you contact October Films and explicitly withdraw consent for your footage to be used.\" \n                  Trump has 'obligation' to sue 'very dishonest' BBC\n                 \n                  BBC staff seemed fed up of Tim Davie's 'nothing to see' approach\n                 \n                  Who is Sir Robbie Gibb and why are there calls to get him off BBC board?\n                 Production company 'shocked' over misleading edit Meanwhile, a source close to October Films told Sky News the company was \"shocked\" it wasn't told about concerns over the Panorama Trump documentary, despite an internal review at the corporation highlighting the misleading edit back in January. October Films worked on the one-hour Panorama special, Trump: A Second Chance with a majority in-house BBC team, which included a BBC director, executive producer, editor and lawyer. The source told Sky News: \"October Films were not informed there was any question of integrity with the edit. Had they been given the opportunity, they would have insisted on the edit being changed.\" October Films - who are an Emmy and BAFTA-winning independent producer, with credits including BBC2's Laura Kuenssberg: State of Chaos, Channel 4's Levison Wood: Walking With…, and CNN's First Ladies - are understood to have first learned of the misleading edit when a leaked BBC memo was published in The Telegraph.  Sky News understands the concealed cut in the president's speech was present in the first version of the film shown to executive producers at an early viewing, with those producers not told an edit had been made. Despite subsequent internal viewings, and various changes and tweaks to other parts of the film ahead of sign-off by senior editorial figures, as well as the BBC's compliance and legal teams, the clip containing the president's spliced quotes remained intact as part of the final edit. Sky News approached the BBC for comment and were told they had \"nothing to add to the BBC Chair's letter to CMS committee\". In his letter, Samir Shah described the edit as an \"error of judgement\" and admitted it \"did give the impression of a direct call for violent action\". October Films declined to comment. Where was the documentary shown? The 57-minute Panorama special - Trump: A Second Chance? - first aired on BBC One on 28 October 2024, a week before the US election. The documentary aired in the UK and was put on iPlayer. A shorter international version was cut, but the Capitol speech moment was not included in that cut-down version. The film never aired in the US and couldn't be viewed in the US on iPlayer as the content was geoblocked. What was the misleading edit? While the BBC say the film received \"no significant audience feedback\" at the time, the corporation says it has since received over 500 complaints after an internal memo detailing investigations into impartiality was leaked to The Telegraph. The most contentious issue raised in the memo was the cutting together two parts of a long Trump speech, which he had made on 6 January 2021. Tap here to follow Trump100 wherever you get your podcasts This was the day of the storming of the Capitol building in Washington by Trump supporters who believed the 2020 election had been stolen by Joe Biden. In the documentary, the clip was presented as one sentence, in which Mr Trump appeared to say: \"We're gonna walk down to the Capitol and I'll be with you and we fight. We fight like hell and if you don't fight like hell, you're not gonna have a country anymore.\" In reality Mr Trump's words, \"We're gonna walk down to the Capitol and I'll be with you,\" came around 50 minutes before he said, \"and we fight. We fight like hell….\" The cut had been covered by crowd shots. When were issues over the cut first raised? The author of the leaked memo, Michael Prescott, former adviser to the BBC's Editorial Guidelines and Standards Board (EGSB), says he first raised concerns over impartiality after watching the documentary when it aired on the BBC. He says his complaint led to an investigation by senior EGSC advisor David Grossman, with a report delivered in January 2025. He said this report raised the alarm over the edit of Mr Trump's Capitol Hill speech. Read more:Donald Trump and his long history of lawsuits against the media'Mistakes cost us' says BBC boss Tim Davie Mr Prescott said that following the review BBC executives \"refused to accept there had been a breach of standards and doubled down on its defence of Panorama\". He says he was told at an EGSC meeting in May 2025 that it was \"normal practice to edit speeches into short form clips\". It was after this meeting in May that Mr Prescott says he wrote to the BBC chairman, Samir Shah, asking him to \"take some form of action,\" but \"received no reply\". What's the fallout been and what's next? The misleading edit has already led to the departure of BBC director-general, Tim Davie, and the head of BBC News, Deborah Turness. Adding to the BBC's problems, on Monday, the corporation received a letter from Mr Trump's lawyers, threatening to sue them for $1bn. They have been asked to issue a \"full and fair retraction\" of the documentary, \"apologise immediately\" and \"appropriately compensate\" the US president. The BBC has been given a deadline of 10pm UK time on Friday to respond."
    },
    {
        "title": "Thousands of NHS staff to be made redundant after funding agreed",
        "description": "Thousands of job cuts at the NHS will go ahead after the &#163;1bn needed to fund the redundancies was approved by the Treasury.",
        "url": "https://news.sky.com/story/thousands-of-nhs-staff-to-be-made-redundant-after-funding-agreed-13468879",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-nhs-cuts-generic-logo_7079718.jpg?20251112012331",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-12 00:51:00",
        "Headline": "The government says the jobs will go in order to slash \"unnecessary bureaucracy\" and ensure taxpayers' money is being \"spent wisely\".",
        "Content": "Thousands of job cuts at the NHS will go ahead after the £1bn needed to fund the redundancies was approved by the Treasury. The government had already announced its intention to slash the headcount across both NHS England and the Department of Health by around 18,000 administrative staff and managers, including on local health boards. The move is designed to remove \"unnecessary bureaucracy\" and raise £1bn a year by the end of the parliament to improve services for patients by freeing up more cash for operations. NHS England, the Department of Health and Social Care, and the Treasury had been in talks over how to pay for the £1bn one-off bill for redundancies. It is understood the Treasury has not granted additional funding for the departures over and above the NHS's current cash settlement, but the NHS will be permitted to overspend its budget this year to pay for redundancies, recouping the costs further down the line. 'Every penny will be spent wisely' Chancellor Rachel Reeves is set to make further announcements regarding the health service in the budget on 26 November. And addressing the NHS providers' annual conference in Manchester today, Mr Streeting is expected to say the government will be \"protecting investment in the NHS\". He will add: \"I want to reassure taxpayers that every penny they are being asked to pay will be spent wisely. \"Our investment to offer more services at evenings and weekends, arm staff with modern technology, and improving staff retention is working. \"At the same time, cuts to wasteful spending on things like recruitment agencies saw productivity grow by 2.4% in the most recent figures - we are getting better bang for our buck.\" Mr Streeting's speech is due to be given just hours after he became entrenched in rumours of a possible coup attempt against Sir Keir Starmer, whose poll ratings have plummeted ahead of what's set to be a tough budget. Mr Streeting's spokesperson was forced to deny he was doing anything other than concentrating on the health service. Read more from Sky News:Russian troops in Mad Max-style videoShamima Begum 'should be repatriated' He is also expected on Wednesday to give NHS leaders the go-ahead for a 50% cut to headcounts in Integrated Care Boards, which plan health services for specific regions. They have been tasked with transforming the NHS into a neighbourhood health service - as set down in the government's long-term plans for the NHS. Those include abolishing NHS England, which will be brought back into the health department within two years. Watch Wes Streeting on Mornings With Ridge And Frost from 7am on Sky News."
    },
    {
        "title": "Sir Keir Starmer says he 'never authorised attacks' on Wes Streeting after coup claims",
        "description": "Sir Keir Starmer has said he \"never authorised attacks\" on cabinet members after his Number 10 team briefed that Wes Streeting was plotting a coup.",
        "url": "https://news.sky.com/story/sir-keir-starmer-says-he-never-authorised-attacks-on-wes-streeting-after-coup-claims-13469091",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-pmqs_7080048.jpg?20251112121112",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-12 12:41:00",
        "Headline": "The health secretary spent the morning saying he was not going to try to oust Sir Keir Starmer and replace him.",
        "Content": " Sir Keir Starmer has said he \"never authorised attacks\" on cabinet members after his Number 10 team briefed that Wes Streeting was plotting a coup. The prime minister backed his health secretary, who spent the morning batting off overnight claims - which he said came from Number 10 - that he was planning to oust Sir Keir after the budget and take his place. But the Labour leader failed to say he had full confidence in his chief of staff Morgan McSweeney, when asked by Conservative leader Kemi Badenoch. Politics latest: Starmer says any attack on cabinet members is unacceptable  He told Prime Minister's Questions: \"Morgan McSweeney, my team and I are absolutely focused on delivering for the country. \"Let me be clear. I've never authorised attacks on cabinet members. I appointed them to that post because they're the best people to carry out that job.\" \n                  Starmer says former Tory ministers have 'serious questions to answer' over Afghan data breach\n                 \n                  The most memorable PMQs moments: Insults, gaffes and front bench dance moves\n                 \n                  Police given more time to question suspect over 'arson attacks' on properties linked to Starmer\n                 Ms Badenoch said she did not hear Sir Keir back Mr McSweeney. The prime minister's spokesperson later said he had full confidence in his chief of staff - and claimed the briefing against Mr Streeting came from outside Number 10, in what appears to be a blame game. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Sir Keir did publicly back Mr Streeting, telling PMQs he has helped deliver five million extra NHS appointments and is \"doing a very good job\". \"Any attack on any member of my cabinet is completely unacceptable,\" Sir Keir added. \"This is a united team and we are delivering.\" His last line received jeers from the opposition benches, with Speaker Lindsay Hoyle having to intervene, telling MPs if they \"want to audition for the pantomime, I suggest you go to the Old Vic\".  Ms Badenoch accused Sir Keir of having \"lost control of Number 10\" and said two weeks from the 26 November budget, \"the government has descended into civil war\". She said Labour MPs were \"chuntering\" from the benches facing her and said they were the \"feral MPs that Number 10 has been talking about\". \"Unbelievably, the prime minister's advisers have been reduced to briefing that MPs can't get rid of him and - I'm not making this up - they can't get rid of him because it would destabilise international markets,\" Ms Badenoch added. \"Why does the prime minister think that there would be a market meltdown if the health secretary took over?\"  Hours earlier, at 7am, Mr Streeting told Mornings with Ridge and Frost he would not try to oust Sir Keir and accused allies of the prime minister in Number 10 of briefing against him. \"I do think that going out and calling your Labour MPs 'feral' is not very helpful,\" he said. \"I do think that trying to kneecap one of your own team when they are out, not just making the case for the government, but actually delivering the change that we promised, I think that is also self-defeating and self-destructive behaviour.\" He added: \"Whoever's been briefing this has been watching too much Celebrity Traitors. \"This is just about the worst attack on a faithful I've seen since Joe Marler was kicked out and banished in the final.\""
    },
    {
        "title": "NASA cancels space launch as strongest 'cannibal storm' in 20 years heads to Britain",
        "description": "NASA has postponed a space launch due to a \"cannibal\" solar storm that could also disrupt GPS, communication systems and power grids.",
        "url": "https://news.sky.com/story/powerful-cannibal-storm-to-hit-earth-today-and-it-could-disrupt-communications-and-gps-13469128",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-nasa-blue-origin-space_7080286.jpg?20251112163205",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-11-12 13:25:00",
        "Headline": "The geomagnetic storm is set to reach Britain today and could be one of the largest in 20 years.",
        "Content": "NASA has postponed a space launch due to a \"cannibal\" solar storm that could also disrupt GPS, communication systems and power grids. The British Geological Survey (BGS) upgraded its forecast to the maximum and said the ongoing storm had already interfered with communications and satellite navigation. It said the storm could feed off another one, becoming a \"cannibal storm\" - one of the biggest in 20 years - and reaching Britain this afternoon. Blue Origin - the space tech company founded by Amazon boss Jeff Bezos - was due to launch its rocket, New Glenn, today. The mission was set to take two Mars-bound NASA spacecraft, called ESCAPADE, into the cosmos. Announcing the postponement on Twitter, Blue Origin said: \"New Glenn is ready to launch. \"However, due to highly elevated solar activity and its potential effects on the ESCAPADE spacecraft, NASA is postponing launch until space weather conditions improve. \n                  Trump renominates billionaire Musk ally Jared Isaacman to lead NASA\n                 \n                  Brightest ever flare from supermassive black hole spotted by scientists in California\n                 \n                  How and when to see the beaver supermoon - the biggest full moon of the year \n                 \"We are currently assessing opportunities to establish our next launch window based on forecasted space weather and range availability.\" The effects of the solar storm aren't just limited to the Cape Canaveral launch site in Florida. It's also expected to bring a dazzling display of Northern Lights to Britain later. The storm led to impressive sightings of the aurora borealis in some parts of the UK overnight and the same could happen later - assuming clear, dark skies. But solar storms carry serious implications for energy infrastructure and navigation, and are therefore listed as a primary hazard on the UK's National Risk Register. They're caused by an explosion of particles, energy, magnetic fields, and material blasted into space by the sun - and can disturb the Earth's magnetic field, according to NASA. The latest event has already created the biggest geoelectric field at ground level since BGS records began. Gemma Richardson, geomagnetic hazard specialist with the BGS, said: \"Space weather can have a real impact on the lives of people across the planet. \"BGS records real-time data of geomagnetic conditions, underpinning the national forecast service. \"Our data suggests that this event could be one of the biggest storms we've seen in 20 years\". People in Scotland, northern England and Northern Ireland have the best chance of seeing Northern lights, according to the BGS. Cloud is forecast in other areas but the Met Office said it might break enough to provide a glimpse over southeast England. Get the Sky News forecast for your area The colours of the aurora are produced by charged particles from the sun hitting atoms and molecules in Earth's upper atmosphere. Solar storms can reach Earth from the sun in as little as 17 hours, but can sometimes take much longer. Read more from Sky News:Three men arrested after body found in fieldGovernment to use military driving examiners to cut test backlog The latest one could hit the highest level of G5, according to the BGS, a rating that warns of possible power blackouts, GPS problems lasting days, and problems orientating spacecraft. NASA says solar storms don't cause direct harm to humans as the planet's magnetic field and atmosphere protect us from the worst of the effects."
    },
    {
        "title": "Police take no further action over Bob Vylan's London performance",
        "description": "Police will take no further action over alleged chants at a Bob Vylan concert in London.",
        "url": "https://news.sky.com/story/police-take-no-further-action-over-bob-vylans-london-performance-13469052",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-bob-vylan-glastonbury_7056913.jpg?20251021024333",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-12 11:44:00",
        "Headline": "The singer, real name Pascal Robinson-Foster, was alleged to have chanted \"death to the IDF\" at a concert in London in May.",
        "Content": "Police will take no further action over alleged chants at a Bob Vylan concert in London. Met Police had launched an investigation after allegations the singer, real name Pascal Robinson-Foster, was heard in footage saying \"death to the IDF (Israel Defence League)\". The footage was filmed at a performance supporting Iggy Pop, 78, at Alexandra Palace in May. In a video, Mr Robinson-Foster is also alleged to have said: \"Death to every single IDF soldier out there as an agent of terror for Israel.\" But the Met Police confirmed they are closing the investigation following advice from the Crown Prosecution Service (CPS). 'No further action will be taken' A spokesperson for the force said: \"On Wednesday 2 July, officers became aware of footage that appeared to have been filmed at Alexandra Palace in London on 28 May. An investigation was launched into the language used in the footage. \"Early investigative advice was sought from the Crown Prosecution Service who considered a number of potential offences but determined that, based on the information and material available, there would likely be insufficient evidence to take the case forward. \"As a result, officers have decided that no further action will be taken. We recognise the concerns that the footage caused, particularly among many in London's Jewish communities. \"It emerged during a period where we have seen a concerning rise in antisemitic hate crime. \"We continue to work closely with community representatives to understand those concerns, to ensure the safety and security of Jewish Londoners and to provide reassurance moving forward.\" Read more:Trump's son-in-law and Netanyahu meet to discuss Gaza ceasefireMarco Rubio warns Israel against West Bank annexation It followed footage of Mr Robinson-Foster allegedly leading a chant of \"death, death to the IDF\" during a BBC live-streamed performance at Glastonbury Festival, in June earlier this year, leading to an investigation from Avon and Somerset Police. A man, in his 30s, understood to be Mr Robinson-Foster, had voluntarily attended an interview on Monday in relation to the band's Glastonbury performance, the force said. Police added the individual was not arrested but an investigation is ongoing. After the Glastonbury appearance, the group were dropped from a number of festivals."
    }
]