[
    {
        "title": "British surgeon claims IDF shooting Gazans in specific areas - 'almost like a game of target practice'",
        "description": "A British surgeon who recently returned from Gaza has told Sky News that there is \"profound malnutrition\" among the population - and claims IDF soldiers are shooting civilians at aid points \"like a game of target practice\".",
        "url": "https://news.sky.com/story/almost-like-a-game-of-target-practice-british-surgeon-says-idf-shooting-gazans-at-aid-points-13401434",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-palestinians-hunger_6972406.jpg?20250724104931",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-24 21:56:00",
        "Headline": "Dr Maynard told Sky News he operated on boys as young as 11 who had been \"shot at food distribution points\" run by the US- and Israeli-backed Gaza Health Foundation (GHF) last week. ",
        "Content": " A British surgeon who recently returned from Gaza has told Sky News that there is \"profound malnutrition\" among the population - and claims IDF soldiers are shooting civilians at aid points \"like a game of target practice\". Dr Nick Maynard spent four weeks working inside Nasser Hospital, where a lack of food has left medics struggling to treat children and toddlers. The conditions inside the hospital, in the south of the Strip, have been documented in a Sky News report.  Dr Maynard told The World with Yalda Hakim: \"I met several doctors who had cartons of formula feed in their luggage - and they were all confiscated by the Israeli border guards. Nothing else got confiscated, just the formula feed. \"There were four premature babies who died during the first two weeks when I was in Nasser Hospital - and there will be many, many more deaths until the Israelis allow proper food to get in there.\" In other developments: • Israel and the US have recalled their teams from Gaza ceasefire talks • US envoy Steve Witkoff has accused Hamas \"of failing to act in good faith\" • France has announced that it will recognise the state of Palestine • An influential group of MPs is calling on the UK to \"immediately\" do the same  'They were shells' Dr Nick Maynard has been going to Gaza for the past 15 years - and this is his third visit to the territory since the war began. The British surgeon added that virtually all of the kids in the paediatric unit of Nasser Hospital are being fed with sugar water. \"They've got a small amount of formula feed for very small babies, but not enough,\" he warned. Dr Maynard said the lack of aid has also had a huge impact on his colleagues. \"I saw people I'd known for years and I didn't recognise some of them,\" he added. \"Two colleagues had lost 20kg and 30kg respectively. They were shells, they're all hungry. \"They're going to work every day, then going home to their tents where they have no food.\"  IDF 'shooting Gazans at aid points' Elsewhere in the interview, Dr Maynard claimed Israeli soldiers are shooting civilians at aid points \"almost like a game of target practice\". He has operated on boys as young as 11 who had been \"shot at food distribution points\" run by the US and Israel-backed Gaza Humanitarian Foundation. \"They had gone to get food for their starving families and they were shot,\" he said. \"I operated on one 12-year-old boy who died on the operating table because his injuries were so severe.\"  Dr Maynard continued: \"What was even more distressing was the pattern of injuries that we saw, the clustering of injuries to particular body parts on certain days. \"One day they'd be coming in predominately with gunshot wounds to the head or the neck, another day to the abdomen. \"Twelve days ago, four young teenage boys came in, all of whom had been shot in the testicles and deliberately so. \"The clustering was far too obvious to be accidental, and it seemed to us like this was almost like a game of target practice. \"I would never have believed this possible unless I'd witnessed this with my own eyes.\" Sky News has contacted the Israeli Defence Forces for comment. An IDF spokesperson previously told Sky News it \"strongly rejected\" the accusations that its forces were instructed to deliberately shoot at civilians. \"To be clear, IDF directives prohibit deliberate attacks on civilians,\" the spokesperson said, adding that the incidents are \"being examined by the relevant IDF authorities\". Read more:Medics at Nasser hospital struggle to feed childrenGaza food situation 'worst its ever been'  The Gaza Humanitarian Foundation has been managing the supply of aid to Gaza since Israel lifted an 11-week blockade in May. It has four aid distribution sites, all of which are located in Israeli military zones, with journalists prohibited from entering. More than 1,000 people have been reported killed while trying to receive food aid since the GHF took over, according to the UN. UNRWA, its relief agency for Gaza, has heavily criticised the scheme. Commissioner general Philippe Lazzarini said: \"The so-called 'GHF' distribution scheme is a sadistic death trap. Snipers open fire randomly on crowds as if they are given a licence to kill.\" Just a fraction of the aid trucks needed are making it into the enclave, the UN has said, while multiple aid groups and the World Health Organisation have warned Gazans are facing \"mass starvation\". Mr Lazzarini quoted a colleague on Thursday and said malnourished Palestinians in the Gaza \"are neither dead nor alive, they are walking corpses\"."
    },
    {
        "title": "Hulk Hogan dies aged 71",
        "description": "The legendary WWE wrestler Hulk Hogan has died aged 71.",
        "url": "https://news.sky.com/story/wrestling-star-hulk-hogan-has-died-13401278",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-hulk-hogan_6972794.jpg?20250724171654",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-24 15:44:00",
        "Headline": "Hogan is perhaps the most iconic star in WWE's five-decade history - with his distinctive blonde moustache and colourful headbands helping him become a pop culture phenomenon. ",
        "Content": " The legendary WWE wrestler Hulk Hogan has died aged 71. Police have said emergency services responders treated Hogan at his home in Clearwater, Florida, for cardiac arrest at around 10am local time (3pm UK time) today but he died in hospital around an hour and 15 minutes later. Hogan, whose real name was Terry Bollea, is perhaps the most iconic star in WWE's five-decade history - known for his distinctive blonde moustache and colourful headbands. His charisma and theatrics in the ring are credited with helping to transform professional wrestling into a family entertainment sport. Hogan was the main draw for the first-ever WrestleMania in 1985 and was a fixture for years in its signature event, facing everyone from Andre The Giant and Randy Savage to The Rock and even company chairman Vince McMahon. He claimed his first WWE world championship by defeating the Iron Sheik in 1984. Hogan went on to win five more world championships and was inducted into the WWE Hall of Fame in 2005 by Sylvester Stallone. \n                  Hungary bans Irish rap group Kneecap from entering country over 'antisemitic hate speech'\n                 \n                  'A local lad done good': Fans remember Ozzy Osbourne in his hometown of Birmingham\n                 \n                  Ozzy Osbourne obituary: Heavy metal, reality TV, and biting bats – the wild life of Birmingham's Prince Of Darkness\n                 Undertaker among WWE icons to pay tribute WWE said in a post this evening: \"WWE is saddened to learn WWE Hall of Famer Hulk Hogan has passed away. One of pop culture's most recognizable figures, Hogan helped WWE achieve global recognition in the 1980s. WWE extends its condolences to Hogan's family, friends, and fans.\" Hogan's friend and fellow former professional wrestler, Ric Flair, wrote on X: \"I am absolutely shocked to hear about the passing of my close friend @HulkHogan! Hulk has been by my side since we started in the wrestling business. \"An incredible athlete, talent, friend, and father!\" Mr McMahon wrote on X after Hogan's death: \"The world lost a treasure today. Hulk Hogan was the greatest WWE Superstar of ALL TIME, someone who was loved and admired around the world... He leaves us with one of his favourite expressions, 'Train, take your vitamins and say your prayers.' Today, we pray for him.\" WWE icon The Undertaker wrote on X: \"The wrestling world has lost a true legend. His contributions to our business are immeasurable and for that I am appreciative. Thank you, Hulk Hogan.\" Former WWE wrestler Triple H wrote on social media in a tribute to Hogan: \"He was the archetype of what it meant to be a 'Superstar' - a global sensation that inspired millions to work hard at whatever it was they wanted to accomplish and a look that made him recognizable to fans around the world.\" Hogan goes to Hollywood The wrestler was also able to transcend his \"Hulkamania\" fanbase to become a celebrity outside the wrestling world, appearing in numerous movies and television shows, including a reality show about his life on VH1, Hogan Knows Best. His notable movie appearances include playing Thunderlips in Rocky III and Shep Ramsey in Suburban Commando. In 2024, he appeared at the Republican National Convention to endorse the presidential bid of Donald Trump. Hogan said he made the decision to support the Republican candidate after seeing his combative, fist-pumping reaction to an attempted assassination on the campaign trail. In a reference to so-called \"Hulkamania\", he ripped off his shirt to reveal a Trump tank top and bellowed to a cheering crowd: \"Let Trumpamania run wild, brother... Let Trumpamania rule again!\" The US president paid tribute to Hogan in a Truth Social post today, writing: \"We lost a great friend today, the 'Hulkster'. Hulk Hogan was MAGA (Make America Great Again) all the way - Strong, tough, smart, but with the biggest heart. He gave an absolutely electric speech at the Republican National Convention, that was one of the highlights of the entire week. He entertained fans from all over the World, and the cultural impact he had was massive. To his wife, Sky, and family, we give our warmest best wishes and love. Hulk Hogan will be greatly missed!\" US vice president JD Vance has also paid tribute, writing on X: \"Hulk Hogan was a great American icon. One of the first people I ever truly admired as a kid. The last time I saw him we promised we'd get beers together next time we saw each other. The next time will have to be on the other side, my friend! Rest in peace.\" Hogan's support of Trump did not go down well with all wrestling fans and it was far from his only controversy. The gossip website Gawker posted a video in 2012 of him having sex with his former best friend's wife. Hogan sued on privacy grounds and was awarded a $140m judgement in 2016. A year earlier he was suspended by the WWE after another secret recording revealed that Hogan had used a racial slur. He was reinstated in 2018. The making of a pop culture phenomenon Born in the US state of Georgia in August 1953, Hogan played bass guitar in local bands before getting involved in the wrestling scene in Florida in the 1970s. The young wrestler, who later admitted to taking anabolic steroids during his career, gained notoriety as his biceps turned into what he dubbed the \"24-inch pythons\". The \"Hulk\" moniker came from comparisons to the comic-book hero portrayed on TV at the time. He would end up paying royalties to Marvel Comics for years. \"Hogan\" was the invention of Mr McMahon, the owner of what was then called the World Wrestling Federation (WWF), who wanted Irish representation among his stable of stars. Hogan was married three times and had two children. In an update at 1.47pm local time (6.47pm UK time), Clearwater Police Major Nate Burnside said there were \"no signs of foul play or suspicious activity\" in relation to the wrestler's death. He added that Hogan's family are being supported."
    },
    {
        "title": "Venezuelan scarred after being sent to maximum security prison by Trump administration",
        "description": "Arturo Suarez cries as he hugs his family for the first time in months. ",
        "url": "https://news.sky.com/story/we-were-constantly-beaten-venezuelan-sent-to-maximum-security-prison-by-trump-administration-speaks-out-13400927",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-venezuela-suarez_6972157.jpg?20250724045445",
        "type": "Home",
        "Author": "Martha Kelner",
        "Date Published": "2025-07-24 03:19:00",
        "Headline": "The 34-year-old was one of more than 250 Venezuelan men sent by the Trump administration to a maximum security prison in El Salvador, despite having no criminal record in any of the four countries he has lived in.",
        "Content": "\n          US correspondent\n              @marthakelner\n  Arturo Suarez cries as he hugs his family for the first time in months.  His sister's modest home in Caracas, Venezuela's capital city, is decorated with red, blue and black balloons and banners to welcome him back. Friends and neighbours fill the living room and the street outside. He video calls other family members elsewhere in the world. This is the first time they have heard his voice since March. \"I hadn't felt so safe for a while,\" Arturo tells Sky News, \"when I hugged my brothers, my uncle, my aunt, that's where I felt that the nightmare was over, that I had made it home.\" Then the story of what he had endured begins to pour out of him. The 34-year-old was one of more than 250 Venezuelan men sent by the Trump administration to a maximum security prison in El Salvador, despite having no criminal record in any of the four countries he has lived in. \n                  Snipers, Secret Service sweeps and a personal chef on standby: Scotland awaits Trump's arrival\n                 \n                  Epstein questions keep coming as White House tightens its grip on who can answer them\n                 \n                  Donald Trump told in May his name appears in Epstein files - report\n                 Last week, he was released as part of a prisoner swap with 10 American citizens and permanent residents detained in Venezuela. But he is scarred by the four months he spent at the CECOT prison, a terrorism confinement centre, in El Salvador, alongside some of the world's most dangerous men. Read more from Sky News: 'Everyone's on edge': Epping braces for another hotel protestOzzy Osbourne dies just weeks after farewell show \"We were constantly beaten,\" he says, \"we suffered physical, verbal, and psychological abuse. \"There wasn't a day the wardens didn't tell us that the only way we'd leave that place was if we were dead. In fact, the first words the head of the prison said to us after the first beating was 'welcome to hell'.\" Arturo is an aspiring singer. He had moved to the US to escape Venezuela's authoritarian regime and set up home in North Carolina. He had a feeling when Donald Trump became president for a second time that there would be a crackdown on immigration, as promised in his campaign. But, because Arturo had followed all the legal channels to enter the country, he didn't think he would be caught up in the deportation policy. He was wrong. While he was filming a music video in a house in North Carolina in March, he was arrested by immigration agents and accused by the White House of being a gang member, although they have provided little evidence publicly to support that claim. He was then flown to El Salvador - a country he had never even visited - and put in a maximum security prison. His ordeal was under way. \"We were sleeping 19 people to a cell,\" he says, \"if we spoke loudly, they would take away our mattresses, if they found us bathing more than once a day, they'd take away the mattresses from us. \"The punishment was severe. It was beatings and humiliations and they took away our food. \"I remember we were exercising and a cellmate, very politely, asked the prison head if we could bathe a second time that day, since we were doing exercise. \"His words were 'that's your problem, it's not my problem if you exercise'. We were also made to eat with our hands. \"They tried to take our humanity away from us. They tried to make us lose everything.\" The Trump administration paid El Salvador millions of dollars to detain the 252 Venezuelan men, claiming they were part of the notorious Tren De Aragua gang. Homeland Security Secretary, Kristi Noem, visited the prison for a tour and photoshoot in March and Arturo saw her. \"Obviously they did a show of this,\" he says, \"they had cameras. When she came in, my cellmates and I began to make the help sign, which she disliked a lot. We began to shout freedom.\" Arturo was denied due process to appeal his extradition to El Salvador and was not allowed to speak to a lawyer or any family or friends during his time in prison. I spoke to Arturo's brother Nelson in April as he appealed for his release. He said Arturo's only crime was having tattoos, which the White House cited as evidence of involvement with gangs. On a video call, Arturo shows me the tattoos. Most of them, he says, are in tribute to his late mother. I ask if he thinks that the Trump administration believed he was a gang member. \"I think it was just an excuse to get us out,\" he says, \"we weren't taken for having tattoos or belonging to a criminal gang. \"We were taken for being Venezuelans. And today I want to tell the world that being Venezuelan is not a crime.\" When he applied for asylum in the United States, Arturo had hoped to be reunited eventually with his wife, Nathali, and their 10-month-old daughter Nahiara, who are currently in Chile. \"When I was given the opportunity to go to the United States, I was going to go with my wife,\" he says, \"we found out that she was pregnant but I went anyway because it was for the future, for my daughter's future. \"Unfortunately, this decision led me to one of the most brutal prisons. What I most long for, is to be with my daughter and my wife.\" He's now being supported by other family members in Venezuela, but he will never return to the US. He went for a better life but instead was labelled a criminal. Now, he says, he just wants to clear his name."
    },
    {
        "title": "France to become first G7 nation to recognise Palestine as a state",
        "description": "Emmanuel Macron has said France will recognise Palestine as a state later this year.",
        "url": "https://news.sky.com/story/france-to-become-first-g7-nation-to-recognise-palestine-as-a-state-13401391",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-emmanuel-macron-french-president_6973092.jpg?20250724230447",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-24 20:09:00",
        "Headline": "Emmanuel Macron has announced that France will recognise Palestinian statehood at the UN General Assembly - heaping pressure on the UK to do the same.",
        "Content": "Emmanuel Macron has said France will recognise Palestine as a state later this year. The French leader announced the major change of policy in a letter to the president of the Palestinian Authority, Mahmoud Abbas, which Mr Macron also published online on Thursday evening. President Macron said he will make the formal announcement at the UN General Assembly, being held in September. France will become the first member of the G7 - a group of seven of the world's largest advanced economies - to recognise a Palestinian state. The G7 includes Canada, France, Germany, Italy, Japan, the UK, and the US. In his post explaining the decision, Mr Macron called for an immediate ceasefire in Gaza, the release of the hostages by Hamas and for much more humanitarian aid to reach those in the territory. But Israel's prime minister Benjamin Netanyahu has hit out at Mr Macron's stance, and said that it \"rewards terror and risks creating another Iranian proxy\". In a post on X, Mr Netanyahu added that a \"Palestinian state in these conditions would be a launch pad to annihilate Israel - not to live in peace beside it\". \n                  Can Syria's new President be trusted?\n                 \n                  Iran's crackdown on so-called Afghan spies\n                 \n                  Trump applying 'heavy pressure' on Netanyahu to end war in Gaza\n                 He warned: \"Let's be clear: The Palestinians do not seek a state alongside Israel; they seek a state instead of Israel.\" But despite the condemnation from Israel, the move heaps pressure on France's allies such as the UK, and Sir Keir Starmer insisted on Thursday night that he is \"clear that statehood is the inalienable right of the Palestinian people\". However, the prime minister has resisted calls from within Labour to recognise Palestine immediately, as he believes this should come after a ceasefire is agreed, as part of the peace process in Gaza. \"A ceasefire will put us on a path to the recognition of a Palestinian state and a two-state solution which guarantees peace and security for Palestinians and Israelis,\" he said. Currently, half of the G20 recognise Palestine as a state, while nations including the UK, US, and Germany do not. But pressure has been growing on Sir Keir to change course, with senior Labour figures including the Mayor of London, Sir Sadiq Khan, publicly calling for a change in government policy. Read more:Inside hospital where there's virtually no food for malnourished childrenPeople in Gaza are 'walking corpses' - with one in five kids malnourished - UN  'Humanitarian catastrophe' Just hours before Mr Macron's announcement, Sir Keir said he would be holding an \"emergency call\" on Friday with the leaders of France and Germany over what he called the \"humanitarian catastrophe\" in Gaza. Sir Keir said that \"the suffering and starvation unfolding in Gaza is unspeakable and indefensible\". He went on to say that it has been \"grave for some time\", but that it has now \"reached new depths and continues to worsen\".  Sir Keir said: \"I will hold an emergency call with E3 partners tomorrow, where we will discuss what we can do urgently to stop the killing and get people the food they desperately need while pulling together all the steps necessary to build a lasting peace.\" The PM added that \"we all agree\" on the need for Israel to \"change course and allow aid that is desperately needed to enter Gaza without delay\".  He wrote: \"It is hard to see a hopeful future in such dark times. But I must reiterate my call for all sides to engage in good faith, and at pace, to bring about an immediate ceasefire and for Hamas to unconditionally release all hostages.\" Mr Macron pressed for recognition of Palestinian statehood in a recent address to the UK's Parliament earlier this month, where he said it was the \"only path to peace\". Across the globe, more than 140 countries recognise Palestine as a state."
    },
    {
        "title": "Daniel Gunter guilty of murdering his two-week-old baby son in hospital",
        "description": "The father of a two-week-old baby has been found guilty of murdering him in hospital.",
        "url": "https://news.sky.com/story/father-guilty-of-murdering-his-two-week-old-baby-son-in-hospital-13400432",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-daniel-gunter-brendon-staddon_6972690.jpg?20250724163411",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-24 14:00:00",
        "Headline": "Baby Brendon Staddon suffered \"catastrophic injuries\" to his head, neck, legs and jaw, while he was a patient at the special care baby unit at Yeovil District Hospital in Somerset on 5 March 2024.",
        "Content": " The father of a two-week-old baby has been found guilty of murdering him in hospital. Daniel Gunter, 27, killed his son, Brendon Staddon, on 5 March 2024, a jury at Bristol Crown Court has concluded. Baby Brendon suffered \"catastrophic injuries\" to his head, neck, legs and jaw, while he was a patient at the special care baby unit at Yeovil District Hospital in Somerset. The jury found Gunter guilty of his son's murder, but the baby's mother, Gunter's former partner Sophie Staddon, 23, was cleared of causing or allowing the death of a child. Staddon was previously found not guilty of murder, and Gunter was cleared of causing or allowing the death of a child on the direction of the trial judge, Mr Justice Swift. The defendants showed no emotion as the verdicts were returned. \"Daniel Gunter, you have been found guilty of murder. You will be remanded into custody pending the sentencing hearing,\" the judge said. \n                  Detective who helped catch 'sadistic' serial killer Peter Tobin believes there are more victims out there\n                 \n                  Michael Harvey: Man who attempted to murder woman while on date in Glasgow jailed for nine years\n                 \n                  Scottish parliament seeking views for new law that would create register for domestic abusers\n                 \"Sophie Staddon, you have been acquitted by the jury. Your bail will no longer be necessary, and you are free to go.\" Gunter, of no fixed address, will be sentenced at Bristol Crown Court on 3 October. The court heard baby Brendon was born prematurely at 33 weeks on 20 February 2024 and was described by prosecutor Charles Row KC as weighing \"less than a couple of bags of sugar\". Hospital staff discovered Brendan's serious injuries after Staddon told nurses her son was cold and asked them to check on him around 4am on 5 March. But while staff rushed to Brendon's cot to try and save him, his parents walked outside for a cigarette, Mr Row said during the three-week trial. He said Brendon was found with his baby grow open and staff soon realised he had suffered devastating injuries. \"In plain language, his head had been crushed so as to shatter his skull. He was badly bruised from head to toe, with deep scratches in his neck,\" Mr Row said. \"He was later found to have, amongst other injuries, a broken neck, a broken jaw, broken legs, broken ankles and broken wrists.\" Staff carried the baby's \"limp, lifeless body\" to the resuscitation area, but Brendon did not respond to treatment. His parents were arrested by police outside the hospital as they were smoking. Read more from Sky News:Mother and children named as shooting victimsEpping braces for another hotel protest Social services and Gunter's family had raised concerns about the couple's \"lack of emotional warmth\" toward their child before his death, Mr Row said. The jury were told that, over several days after his son was born, Gunter was told to stop handling, overstimulating and fussing baby Brendon by tickling him, poking him and not allowing him to rest. One of the nurses on the ward looking after him said she was \"left with the impression\" Gunter did not take criticism well. Mr Row told the jury that over-stimulation \"can have the consequence of distressing the child, causing crying and for oxygen levels to drop\". The jury members were also told how Gunter was seen \"being rough\" when handling Brendon and that he had become angry when Brendon urinated on him during a nappy change. In the hours before Brendon's death, when a nurse enquired as to whether everything was okay with Brendon, Gunter replied \"yes, he's alright\", but in a way the nurse considered odd. A post-mortem examination found Brendon died of \"blunt force impact(s) head injury\" with multiple non-accidental injuries to the head. The prosecution said during the trial that the jury needed to understand the \"sheer brutality\" involved in Brendon's death, with Mr Row adding that \"there was hardly a part of his body that was spared\". Senior investigating officer Detective Chief Inspector Nadine Partridge said after the trial's conclusion: \"It breaks my heart to see someone do such vicious things to a poor, innocent child who had his whole life ahead of him. Brendon was failed in life. In death, justice is the only protection we can still offer him.\" Brendon's grandfather Simon Gunter said: \"[Brendon] was born early and was so tiny, but so beautiful... As a family, we were so happy and excited. We had bought clothes, toys and supplies... and we all had exciting plans for the future.\"But, we have been robbed of a life of memories of Brendon... They have been taken from us and he will never be replaced. I hope Daniel gets what he deserves for what he did to Brendon. \"Today, some justice has been served, but we still have many unanswered questions.\""
    },
    {
        "title": "Jay Slater took ecstasy and cocaine before he went missing - but did not steal a Rolex watch, inquest hears",
        "description": "British teenager Jay Slater had taken ecstasy, cocaine and possibly ketamine - but did not steal a Rolex watch as he claimed on Snapchat - the night before he went missing in Tenerife, an inquest into his death has heard.",
        "url": "https://news.sky.com/story/jay-slater-took-ecstasy-and-cocaine-before-he-went-missing-but-did-not-steal-a-rolex-watch-inquest-hears-13401209",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-jay-slater-tenerife_6585856.jpg?20240619201021",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-24 13:54:00",
        "Headline": "The teenager went missing in Tenerife on 17 June last year before his body was found in a ravine around four weeks later.",
        "Content": "British teenager Jay Slater had taken ecstasy, cocaine and possibly ketamine - but did not steal a Rolex watch as he claimed on Snapchat - the night before he went missing in Tenerife, an inquest into his death has heard. Bradley Geoghegan, who was on holiday with Mr Slater on the Spanish island, said the 19-year-old had also been drinking alcohol before he was last seen on 17 June last year. Mr Slater's disappearance sparked a huge search until his body was eventually found by a mountain rescue team from the Spanish Civil Guard in a ravine near the village of Masca around four weeks later on 15 July. Home Office pathologist Dr Richard Shepherd said in May that a post-mortem examination gave the cause of death as head injuries, and Mr Slater's body showed no evidence of restraint or assault, with the pattern of injuries consistent with a fall from a height. The teenager, from Oswaldtwistle, Lancashire, had been to the NRG music festival with friends at the Papagayo nightclub in the resort of Playa de las Americas on 16 June. Follow latest: Jay Slater inquest live updates During the night out he was forced to leave a nightclub for being too drunk. However, instead of going back to the apartment he shared with Mr Geoghegan, he went to an Airbnb miles away in the northern village of Masca with two men they had met on the holiday. \n                  Snipers, Secret Service sweeps and a personal chef on standby: Scotland awaits Trump's arrival\n                 \n                  Labour doesn't have the one thing striking doctors want \n                 \n                  New internet rules enforced from today - but this grieving mother is sceptical they will work\n                 The next morning Mr Geoghegan said he got a video call from Mr Slater, who was walking along a road and was still \"under the influence\", Preston Coroner's Court heard. Mr Geoghegan said: \"I said put your maps on to see how far you were. It was like a 14-hour walk or an hour drive. I said, 'Get a taxi back', then he just goes, 'I will ring you back'.\" He added that did not think his friend had any money on him, and taxis in Tenerife insisted on payment up front before carrying a fare. The inquest into Mr Slater's death had begun in May but was adjourned the same day. Dr James Adeley, a senior coroner for Lancashire and Blackburn with Darwen, made the decision after a number of witnesses who had been asked to give evidence could not be traced or were unable to attend. The adjournment allowed for time to trace the witnesses who had been with him in the hours before he vanished. Witness says Slater didn't steal watch This includes Ayub Qassim - one of the two men staying in the Airbnb that Mr Slater travelled back to. Mr Qassim said he and Steven Roccas, the second man staying in the Airbnb, met Mr Slater and his friends out in Tenerife. He added that Mr Slater asked if he could come back to his and Mr Roccas' apartment on the night before he went missing. Read more:Everything you need to know about the Jay Slater inquestHow search for missing teenager captured nation's attentionInside the valley where Jay Slater's body was found Mr Qassim, giving evidence via videolink, told the hearing: \"I did say, 'Bro, oh mate, it's so far away from the strip.' There's nothing happening there other than scenery. I said I would drop him off in the morning. He rolled with us.\" The coroner then asked Mr Qassim about messages Mr Slater had sent about a watch possibly being stolen. Mr Qassim said while still on the strip before leaving for their apartment he saw what he described as a Romanian \"Lucky-lucky\" man take a watch from another person and tried to sell it to him and Mr Slater. He added: \"Jay did not steal no watch. I can say 100%.\" While on the drive to the Airbnb Mr Slater then posted a message to friends on social media, saying: \"Just took a 12k Rolly (Rolex) off some c*** with this Maili (Somalian) kid. Off to get 10 quid (thousand) for it. Off my undies ha, ha, ha.\" Coroner Dr Adeley asked the witness: \"You were not involved in taking a watch?\" Mr Qassim replied: \"No. And neither was he.\" He said when they got to his Airbnb he gave Mr Slater a blanket and pillow and told him he could sleep on the sofa before going off to his own bed. Slater said he 'cut his leg on a cactus' Lucy Law, who had to be traced along with Mr Geoghegan and Mr Qassim after the inquest was adjourned in May, was next to speak at the hearing and said Mr Slater was \"definitely on a buzz... but not visibly mangled\" the night before he went missing. Ms Law said Mr Slater told her \"there's no way I'm going home\" after she suggested it. She is believed to be the last person to have had contact with the teenager after she spoke to him on a 22-second call on the morning he went missing. He is believed to have said he had cut his leg on a cactus and got lost in the mountains. His phone battery was also said to be on 1% at this point. Ms Law said during the call she asked him: \"What on earth are you doing? \"Where are you? \"He was just, 'I'm in the middle of the mountains',\" she added. Mr Slater said he needed a drink and asked if cactus were poisonous, which left her \"panicking\" she said. Excerpts from the Spanish authorities was read out by the coroner, including from local mountain rescue services, who searched the treacherous Juan Lopez Ravine, where Mr Slater's body was found, as part of their 29-day hunt. About 20m from where Mr Slater's body was found was his Armani bag containing his phone and nitrous oxide gas canisters. The authorities suggested Mr Slater may have believed, because he could see the sea from the ravine, he could reach a beach and get help. Meanwhile, the coroner's officer Alice Swarbrick said she was unable to get in touch with Mr Slater's friend Brandon Hodgson and Mr Roccas so that they could give evidence at the inquest. The inquest continues on Friday."
    },
    {
        "title": "Daniel Gunter guilty of murdering his two-week-old baby son in hospital",
        "description": "The father of a two-week-old baby has been found guilty of murdering him in hospital.",
        "url": "https://news.sky.com/story/father-guilty-of-murdering-his-two-week-old-baby-son-in-hospital-13400432",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-daniel-gunter-brendon-staddon_6972690.jpg?20250724163411",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-24 14:00:00",
        "Headline": "Baby Brendon Staddon suffered \"catastrophic injuries\" to his head, neck, legs and jaw, while he was a patient at the special care baby unit at Yeovil District Hospital in Somerset on 5 March 2024.",
        "Content": " The father of a two-week-old baby has been found guilty of murdering him in hospital. Daniel Gunter, 27, killed his son, Brendon Staddon, on 5 March 2024, a jury at Bristol Crown Court has concluded. Baby Brendon suffered \"catastrophic injuries\" to his head, neck, legs and jaw, while he was a patient at the special care baby unit at Yeovil District Hospital in Somerset. The jury found Gunter guilty of his son's murder, but the baby's mother, Gunter's former partner Sophie Staddon, 23, was cleared of causing or allowing the death of a child. Staddon was previously found not guilty of murder, and Gunter was cleared of causing or allowing the death of a child on the direction of the trial judge, Mr Justice Swift. The defendants showed no emotion as the verdicts were returned. \"Daniel Gunter, you have been found guilty of murder. You will be remanded into custody pending the sentencing hearing,\" the judge said. \n                  Detective who helped catch 'sadistic' serial killer Peter Tobin believes there are more victims out there\n                 \n                  Michael Harvey: Man who attempted to murder woman while on date in Glasgow jailed for nine years\n                 \n                  Scottish parliament seeking views for new law that would create register for domestic abusers\n                 \"Sophie Staddon, you have been acquitted by the jury. Your bail will no longer be necessary, and you are free to go.\" Gunter, of no fixed address, will be sentenced at Bristol Crown Court on 3 October. The court heard baby Brendon was born prematurely at 33 weeks on 20 February 2024 and was described by prosecutor Charles Row KC as weighing \"less than a couple of bags of sugar\". Hospital staff discovered Brendan's serious injuries after Staddon told nurses her son was cold and asked them to check on him around 4am on 5 March. But while staff rushed to Brendon's cot to try and save him, his parents walked outside for a cigarette, Mr Row said during the three-week trial. He said Brendon was found with his baby grow open and staff soon realised he had suffered devastating injuries. \"In plain language, his head had been crushed so as to shatter his skull. He was badly bruised from head to toe, with deep scratches in his neck,\" Mr Row said. \"He was later found to have, amongst other injuries, a broken neck, a broken jaw, broken legs, broken ankles and broken wrists.\" Staff carried the baby's \"limp, lifeless body\" to the resuscitation area, but Brendon did not respond to treatment. His parents were arrested by police outside the hospital as they were smoking. Read more from Sky News:Mother and children named as shooting victimsEpping braces for another hotel protest Social services and Gunter's family had raised concerns about the couple's \"lack of emotional warmth\" toward their child before his death, Mr Row said. The jury were told that, over several days after his son was born, Gunter was told to stop handling, overstimulating and fussing baby Brendon by tickling him, poking him and not allowing him to rest. One of the nurses on the ward looking after him said she was \"left with the impression\" Gunter did not take criticism well. Mr Row told the jury that over-stimulation \"can have the consequence of distressing the child, causing crying and for oxygen levels to drop\". The jury members were also told how Gunter was seen \"being rough\" when handling Brendon and that he had become angry when Brendon urinated on him during a nappy change. In the hours before Brendon's death, when a nurse enquired as to whether everything was okay with Brendon, Gunter replied \"yes, he's alright\", but in a way the nurse considered odd. A post-mortem examination found Brendon died of \"blunt force impact(s) head injury\" with multiple non-accidental injuries to the head. The prosecution said during the trial that the jury needed to understand the \"sheer brutality\" involved in Brendon's death, with Mr Row adding that \"there was hardly a part of his body that was spared\". Senior investigating officer Detective Chief Inspector Nadine Partridge said after the trial's conclusion: \"It breaks my heart to see someone do such vicious things to a poor, innocent child who had his whole life ahead of him. Brendon was failed in life. In death, justice is the only protection we can still offer him.\" Brendon's grandfather Simon Gunter said: \"[Brendon] was born early and was so tiny, but so beautiful... As a family, we were so happy and excited. We had bought clothes, toys and supplies... and we all had exciting plans for the future.\"But, we have been robbed of a life of memories of Brendon... They have been taken from us and he will never be replaced. I hope Daniel gets what he deserves for what he did to Brendon. \"Today, some justice has been served, but we still have many unanswered questions.\""
    },
    {
        "title": "Two children and mother who died in Northern Ireland shooting named",
        "description": "Two children and a woman who died in a shooting in County Fermanagh have been named.",
        "url": "https://news.sky.com/story/two-children-and-woman-who-died-in-northern-ireland-shooting-named-13401117",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-vanessa-whyte-james-rutledge_6972482.jpg?20250724122142",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-24 11:14:00",
        "Headline": "A man, who is a member of the same household, was seriously injured in the shooting in the village of Maguiresbridge, about 75 miles (120km) southwest of Belfast.",
        "Content": "Two children and a woman who died in a shooting in County Fermanagh have been named. Vanessa Whyte, 45, and her daughter Sara Rutledge, aged 13, and 14-year-old son James Rutledge, died in the shooting on Wednesday morning, the Police Service of Northern Ireland (PSNI) said. A man, who is a member of the same household, was seriously injured in the shooting in the village of Maguiresbridge, about 75 miles (120km) southwest of Belfast. Police launched a murder investigation, and officers are probing whether it was a triple murder and attempted suicide. Police don't anticipate any arrests being made at this stage, Superintendent Robert McGowan, district commander for Fermanagh and Omagh, said at a news conference on Wednesday. \"There is limited domestic history involving the people concerned and that is certainly one line of inquiry that the detectives will take forward,\" he said. Emergency services were called to the Drummeer Road area of the village at around 8am on Wednesday after receiving a 999 call from the house where the shooting took place. Two people were found dead at the scene, and two others were seriously injured. One patient was taken to the Royal Victoria Hospital in Belfast by air ambulance. Another was taken by ambulance to South West Acute Hospital where they later died. Detective Chief Inspector Neil McGuinness asked people with information about the incident to contact police. \"I am particularly keen to hear from anyone who had spoken to Vanessa, Sara or James over the last few weeks. If you are someone that Vanessa, Sara or James may have confided in, please come and speak to us,\" he said. \"Any information, no matter how small or insignificant it may seem could prove crucial to our investigation.\" A local Gaelic football club said the victims were all \"active and beloved\" members of their club. Sara and James Rutledge also used to be part of a local cricket club, which said in a statement that it was \"extremely saddened by the tragic events\". \"Both of them turned out to be talented young cricketers and two absolutely lovely-natured children,\" the statement read. Read more from Sky News:Epping braces for another hotel protestPilots killed in Southend Airport crash named Secretary of State for Northern Ireland Hilary Benn said: \"The news from Maguiresbridge is tragic and deeply distressing. \"My thoughts are with the victims, their relatives and the local community in Fermanagh.\" Sinn Fein MP Pat Cullen has expressed her deep shock over the shooting. \"I'm also thinking of all the wee school friends of those two wee children and what that must feel like for all of them and how the next few days and weeks will be for everyone, particularly just at the beginning of the school holidays,\" she said. DUP MLA Deborah Erskine, who represents Co Fermanagh in the Northern Ireland Assembly, said that the community was \"stunned\" by the shooting in \"a rural, quiet area\"."
    },
    {
        "title": "FA could boycott social media over racism - as it says platforms have 'avoided responsibility' over online abuse",
        "description": "The Football Association has told Sky News it would consider boycotting social media over racism.",
        "url": "https://news.sky.com/story/fa-could-boycott-social-media-over-racism-as-it-says-platforms-have-avoided-responsibility-over-online-abuse-13401262",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jess-carter-england_6969249.jpg?20250720142428",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-07-24 15:30:00",
        "Headline": "The FA's chief executive has told Sky News he hopes to see \"real change\" in how social media companies handle abuse on their platforms, after England star Jess Carter discussed the racism she's faced during the Women's Euros.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  The Football Association has told Sky News it would consider boycotting social media over racism. FA chief executive Mark Bullingham also said platforms have \"avoided responsibility\" and have made no contact since England star Jess Carter revealed the scale of abuse she's faced throughout the Women's Euros in Switzerland. Mr Bullingham spoke of his anger when asked about the inaction by Elon Musk's X and Mark Zuckerberg's Instagram in the face of Carter's concerns. In the five days since the FA reported the abuse faced by Carter to British police, Sky News has had no response from either company. \"We haven't [either],\" Mr Bullingham said in an interview ahead of the Lionesses playing Spain in the Euros final on Sunday. \"Our general perspective is that those companies have really avoided the responsibility for this over the last few years, they should be taking. \"Our hope is that with the new online safety legislation, Ofcom can now bring personal and corporate accountability, so that we see real change. We haven't seen that in the last few years. We would like to see it now.\" \n                  David Coote: Former Premier League referee charged by FA over Jurgen Klopp comments\n                 \n                  Millwall fans accused of singing 'vile chants' about murder of Leeds United supporters\n                 \n                  Tottenham midfielder Rodrigo Bentancur suspended for seven games over alleged racist remark about teammate Son Heung-min\n                 Neither has Kick It Out - English football's anti-discrimination body - whose chairman Sanjay Bhandari told Sky News on Sunday that \"it's got worse\" on X and Instagram.  And Mr Bullingham said: \"We've generally seen them go backwards in the last couple of years, rather than forwards. \"I think the thing that we campaigned for so hard was the legislation that would then allow the government, or really Ofcom, to bring accountability through. And that's what we need to see now.\" That would mean online safety regulator Ofcom using its powers to fine social media companies that are not quickly removing racism. \"Absolutely they should be fining the companies and individuals,\" Mr Bullingham said. When asked about whether the FA would boycott social media, Mr Bullingham said: \"We'd absolutely consider anything that we thought would help. \"I think what is more likely at the moment to drive change is personal fines, corporate fines that will really start to make these companies take action in the right place.\" The issue has become an increasing priority for the FA since Marcus Rashford, Jadon Sancho and Bukayo Saka were targeted with racist abuse online after missing penalties in England's defeat to Italy in the men's Euros final in 2021. All England players are now briefed by police on action to deal with racism online - particularly around tournaments.  \"You're angry that in this day and age, that's all happening,\" Mr Bullingham said. \"Our view is the social media companies need to do more. They need to prevent this happening. \"They need to find ways to take it down quicker, and then they need to work with us and the authorities to make sure that we're prosecuting people for what are effectively hate crimes.\" The England players are now trying to focus on defending their European Championship title in the final against Spain. FA chief hails Lionesses' 'unprecedented success' It is a golden era for the Lionesses, having reached a third consecutive tournament final. Sunday's game is a rematch of the 2023 World Cup final - which saw Spain beat England. \"It's an incredibly special moment for English football,\" Mr Bullingham said. \"We see the excitement amongst fans and it pulls the country together in a way very few other things can. So incredibly exciting. \"We don't take it for granted to make these finals and we want to enjoy every moment. \"I have to have that conversation with my kids regularly that this is not normal. \"It's become more normal. But I grew up in an era where we were happy to qualify for tournaments. \"So it's really unprecedented success.\" Read more:All you need to know ahead of the Euros finalWho is England's teenage super-sub?  The hope is to keep it going under Sarina Wiegman, who is under contract until the 2027 World Cup. The Dutch manager has taken the Lionesses to three finals after also making it to two with her homeland team. \"Serena is an incredibly special coach, and I think we've got an incredibly special group of players,\" Mr Bullingham said. What frustrates the football chief is discussing whether Wiegman would be under consideration for the English men's team job. \"It's a little bit disrespectful for Lionesses to assume that the England men's job is more senior than the women's,\" he said. \"That's not the way we view our organisation. We view them as equal. \"Of course, she's talented enough to do any job in world football. But we're very, very happy with the fact she's with us and she's with us through to at least 2027.\" What is missing at Wembley is a statue to honour the Women's Euro 2022 win. \"We've got one in the pipeline,\" Mr Bullingham said."
    },
    {
        "title": "British surgeon claims IDF shooting Gazans in specific areas - 'almost like a game of target practice'",
        "description": "A British surgeon who recently returned from Gaza has told Sky News that there is \"profound malnutrition\" among the population - and claims IDF soldiers are shooting civilians at aid points \"like a game of target practice\".",
        "url": "https://news.sky.com/story/almost-like-a-game-of-target-practice-british-surgeon-says-idf-shooting-gazans-at-aid-points-13401434",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-palestinians-hunger_6972406.jpg?20250724104931",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-24 21:56:00",
        "Headline": "Dr Maynard told Sky News he operated on boys as young as 11 who had been \"shot at food distribution points\" run by the US- and Israeli-backed Gaza Health Foundation (GHF) last week. ",
        "Content": " A British surgeon who recently returned from Gaza has told Sky News that there is \"profound malnutrition\" among the population - and claims IDF soldiers are shooting civilians at aid points \"like a game of target practice\". Dr Nick Maynard spent four weeks working inside Nasser Hospital, where a lack of food has left medics struggling to treat children and toddlers. The conditions inside the hospital, in the south of the Strip, have been documented in a Sky News report.  Dr Maynard told The World with Yalda Hakim: \"I met several doctors who had cartons of formula feed in their luggage - and they were all confiscated by the Israeli border guards. Nothing else got confiscated, just the formula feed. \"There were four premature babies who died during the first two weeks when I was in Nasser Hospital - and there will be many, many more deaths until the Israelis allow proper food to get in there.\" In other developments: • Israel and the US have recalled their teams from Gaza ceasefire talks • US envoy Steve Witkoff has accused Hamas \"of failing to act in good faith\" • France has announced that it will recognise the state of Palestine • An influential group of MPs is calling on the UK to \"immediately\" do the same  'They were shells' Dr Nick Maynard has been going to Gaza for the past 15 years - and this is his third visit to the territory since the war began. The British surgeon added that virtually all of the kids in the paediatric unit of Nasser Hospital are being fed with sugar water. \"They've got a small amount of formula feed for very small babies, but not enough,\" he warned. Dr Maynard said the lack of aid has also had a huge impact on his colleagues. \"I saw people I'd known for years and I didn't recognise some of them,\" he added. \"Two colleagues had lost 20kg and 30kg respectively. They were shells, they're all hungry. \"They're going to work every day, then going home to their tents where they have no food.\"  IDF 'shooting Gazans at aid points' Elsewhere in the interview, Dr Maynard claimed Israeli soldiers are shooting civilians at aid points \"almost like a game of target practice\". He has operated on boys as young as 11 who had been \"shot at food distribution points\" run by the US and Israel-backed Gaza Humanitarian Foundation. \"They had gone to get food for their starving families and they were shot,\" he said. \"I operated on one 12-year-old boy who died on the operating table because his injuries were so severe.\"  Dr Maynard continued: \"What was even more distressing was the pattern of injuries that we saw, the clustering of injuries to particular body parts on certain days. \"One day they'd be coming in predominately with gunshot wounds to the head or the neck, another day to the abdomen. \"Twelve days ago, four young teenage boys came in, all of whom had been shot in the testicles and deliberately so. \"The clustering was far too obvious to be accidental, and it seemed to us like this was almost like a game of target practice. \"I would never have believed this possible unless I'd witnessed this with my own eyes.\" Sky News has contacted the Israeli Defence Forces for comment. An IDF spokesperson previously told Sky News it \"strongly rejected\" the accusations that its forces were instructed to deliberately shoot at civilians. \"To be clear, IDF directives prohibit deliberate attacks on civilians,\" the spokesperson said, adding that the incidents are \"being examined by the relevant IDF authorities\". Read more:Medics at Nasser hospital struggle to feed childrenGaza food situation 'worst its ever been'  The Gaza Humanitarian Foundation has been managing the supply of aid to Gaza since Israel lifted an 11-week blockade in May. It has four aid distribution sites, all of which are located in Israeli military zones, with journalists prohibited from entering. More than 1,000 people have been reported killed while trying to receive food aid since the GHF took over, according to the UN. UNRWA, its relief agency for Gaza, has heavily criticised the scheme. Commissioner general Philippe Lazzarini said: \"The so-called 'GHF' distribution scheme is a sadistic death trap. Snipers open fire randomly on crowds as if they are given a licence to kill.\" Just a fraction of the aid trucks needed are making it into the enclave, the UN has said, while multiple aid groups and the World Health Organisation have warned Gazans are facing \"mass starvation\". Mr Lazzarini quoted a colleague on Thursday and said malnourished Palestinians in the Gaza \"are neither dead nor alive, they are walking corpses\"."
    },
    {
        "title": "Inside Gaza's Nasser Hospital - where there's virtually no food for malnourished children",
        "description": "In Nasser Hospital in southern Gaza, they have virtually nothing left to eat.",
        "url": "https://news.sky.com/story/inside-gazas-nasser-hospital-8211-where-theres-virtually-no-food-for-malnourished-children-13401219",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-nasser-hospital-gaza_6972856.jpg?20250724183520",
        "type": "World",
        "Author": "John Sparks",
        "Date Published": "2025-07-24 14:26:00",
        "Headline": "Huda, 12, is a patient at Nasser Hospital. But with almost no food left, medics are struggling to treat the children and toddlers.",
        "Content": "\n          International correspondent\n              @sparkomat\n  In Nasser Hospital in southern Gaza, they have virtually nothing left to eat. Warning: This article contains images that some readers may find distressing. Huda has lost half her body weight since March, when Israel shut the crossings into Gaza, and imposed a blockade. The 12-year-old girl knows she doesn't look well. \"Before, I used to look like this,\" Huda says, pointing to a picture on her tablet. \"The war changed me. Malnutrition has turned my hair yellow because I lack protein. You see here, this is how I was before the war.\" Her mother says her needs are simple: fresh fruit and vegetables, fish, maybe a little meat - but she won't find it here. \n                  British surgeon claims IDF shooting Gazans in specific areas - 'almost like a game of target practice'\n                 \n                  France to become first G7 nation to recognise Palestine as a state\n                 \n                  People in Gaza are 'walking corpses' - with one in five children malnourished, says UN\n                 Huda can only wish for a brighter future now. \"Can you help me travel abroad for treatment? I want to be like you. I'm a child. I want to play and be like you,\" she says. Amir's story Three-year-old Amir was sitting in a tent together with his mother, father and his grandparents when it was hit by projectiles. Medical staff carried out surgery on his intestines and were able to stop the bleeding - but they can't feed him properly. Instead, he's given dextrose, a mixture of sugar and water which has no nutritional value. Amir's mother and his siblings were all killed in the attack and his father is no longer able to speak. \"His father is in a terrible state and won't accept the reality. What did these children do? Tell me, what was their crime?\" Amir's aunt says. The desperate scenes of hungry children in Gaza have not been caused by scarcity. There's plenty of food waiting at the crossings or held in warehouses within the territory. Israel claims the United Nations is failing to distribute it. Both Israel and the US have taken charge of the food distribution, with the UN's hundreds of aid centres shut. Instead, the UN tries to organise convoys but says it can't obtain the necessary permits - and faces draconian restrictions on aid. Sometimes food is made available at communal kitchens called 'tikiya'. 'I want life to be how it was' Everyone is desperate for whatever they can get - and many leave with nothing. \"It's been two months since we've eaten bread,\" one young girl says. \"There's no food, there's no nutrition. I want life to go back to how it was, I want meat and flour to come in. I want the end of the tikiya.\" Read more:Gazan doctor held in 'inhumane' conditionsStarvation 'knocking on every door' in Gaza  Dr Adil Husain, an American doctor who spent two weeks at Nasser Hospital, treated a three-year-old called Hasan while he was there. Weighing just 6kg, Hasan should be 15kg at his age. \"He needs special feeds, and these feeds are literally miles away. They're literally right there at the border, but it's being blockaded by the forces, they're not letting them in, so it's intentional and deliberate starvation,\" Dr Husain tells me. Hasan died two days after Dr Husain examined him. \"It's just so distressing that this is something man-made, this is a man-made starvation, this is a man-made crisis,\" he says. Israel says it has not identified starvation, but this feels like a situation that is entirely preventable."
    },
    {
        "title": "France to become first G7 nation to recognise Palestine as a state",
        "description": "Emmanuel Macron has said France will recognise Palestine as a state later this year.",
        "url": "https://news.sky.com/story/france-to-become-first-g7-nation-to-recognise-palestine-as-a-state-13401391",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-emmanuel-macron-french-president_6973092.jpg?20250724230447",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-24 20:09:00",
        "Headline": "Emmanuel Macron has announced that France will recognise Palestinian statehood at the UN General Assembly - heaping pressure on the UK to do the same.",
        "Content": "Emmanuel Macron has said France will recognise Palestine as a state later this year. The French leader announced the major change of policy in a letter to the president of the Palestinian Authority, Mahmoud Abbas, which Mr Macron also published online on Thursday evening. President Macron said he will make the formal announcement at the UN General Assembly, being held in September. France will become the first member of the G7 - a group of seven of the world's largest advanced economies - to recognise a Palestinian state. The G7 includes Canada, France, Germany, Italy, Japan, the UK, and the US. In his post explaining the decision, Mr Macron called for an immediate ceasefire in Gaza, the release of the hostages by Hamas and for much more humanitarian aid to reach those in the territory. But Israel's prime minister Benjamin Netanyahu has hit out at Mr Macron's stance, and said that it \"rewards terror and risks creating another Iranian proxy\". In a post on X, Mr Netanyahu added that a \"Palestinian state in these conditions would be a launch pad to annihilate Israel - not to live in peace beside it\". \n                  Can Syria's new President be trusted?\n                 \n                  Iran's crackdown on so-called Afghan spies\n                 \n                  Trump applying 'heavy pressure' on Netanyahu to end war in Gaza\n                 He warned: \"Let's be clear: The Palestinians do not seek a state alongside Israel; they seek a state instead of Israel.\" But despite the condemnation from Israel, the move heaps pressure on France's allies such as the UK, and Sir Keir Starmer insisted on Thursday night that he is \"clear that statehood is the inalienable right of the Palestinian people\". However, the prime minister has resisted calls from within Labour to recognise Palestine immediately, as he believes this should come after a ceasefire is agreed, as part of the peace process in Gaza. \"A ceasefire will put us on a path to the recognition of a Palestinian state and a two-state solution which guarantees peace and security for Palestinians and Israelis,\" he said. Currently, half of the G20 recognise Palestine as a state, while nations including the UK, US, and Germany do not. But pressure has been growing on Sir Keir to change course, with senior Labour figures including the Mayor of London, Sir Sadiq Khan, publicly calling for a change in government policy. Read more:Inside hospital where there's virtually no food for malnourished childrenPeople in Gaza are 'walking corpses' - with one in five kids malnourished - UN  'Humanitarian catastrophe' Just hours before Mr Macron's announcement, Sir Keir said he would be holding an \"emergency call\" on Friday with the leaders of France and Germany over what he called the \"humanitarian catastrophe\" in Gaza. Sir Keir said that \"the suffering and starvation unfolding in Gaza is unspeakable and indefensible\". He went on to say that it has been \"grave for some time\", but that it has now \"reached new depths and continues to worsen\".  Sir Keir said: \"I will hold an emergency call with E3 partners tomorrow, where we will discuss what we can do urgently to stop the killing and get people the food they desperately need while pulling together all the steps necessary to build a lasting peace.\" The PM added that \"we all agree\" on the need for Israel to \"change course and allow aid that is desperately needed to enter Gaza without delay\".  He wrote: \"It is hard to see a hopeful future in such dark times. But I must reiterate my call for all sides to engage in good faith, and at pace, to bring about an immediate ceasefire and for Hamas to unconditionally release all hostages.\" Mr Macron pressed for recognition of Palestinian statehood in a recent address to the UK's Parliament earlier this month, where he said it was the \"only path to peace\". Across the globe, more than 140 countries recognise Palestine as a state."
    },
    {
        "title": "Eleven civilians killed as Thailand and Cambodia exchange fire in escalating border dispute",
        "description": "Eleven Thai civilians and a soldier have been killed in clashes between Thailand and Cambodia, officials have said, as long-standing tensions in disputed border areas boiled over into open conflict.",
        "url": "https://news.sky.com/story/nine-civilians-killed-as-thailand-and-cambodia-exchange-fire-in-escalating-border-dispute-13400941",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-soldier-land-mine-hospital_6972253.jpg?20250724080358",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-24 05:38:00",
        "Headline": "Both neighbours accuse each other of opening fire first as diplomats have been recalled amid growing tensions.",
        "Content": " Eleven Thai civilians and a soldier have been killed in clashes between Thailand and Cambodia, officials have said, as long-standing tensions in disputed border areas boiled over into open conflict. Among those killed was an eight-year-old boy, the army said in a statement. It said most casualties occurred in Si Sa Ket province, where six people were killed after shots were fired at a fuel station. Another 14 people have been injured in three Thai border provinces. Thailand's health minister Somsak Thepsuthin confirmed the fatalities to reporters, adding Cambodia's actions, including an attack on a hospital, should be considered war crimes. Both countries accuse one another of starting the military clashes and have downgraded their diplomatic relations in the rapidly escalating dispute. Thailand has also sealed all land border crossings with Cambodia. Early on Thursday, a Thai F-16 fighter jet bombed targets in Cambodia, according to Thailand's army. \n                  Why have tensions escalated between Thailand and Cambodia - and is it safe to travel there?\n                 \n                  13 women found guilty for selling babies for cash in Cambodia \n                 \n                  'They fall in love with me': Inside the fraud factories driving the online scam boom\n                 \"We have used air power against military targets as planned,\" Thai army deputy spokesperson Richa Suksuwanon said. Cambodia's defence ministry said Thai jets had dropped bombs on a road near the ancient Preah Vihear temple, saying it \"strongly condemns the reckless and brutal military aggression of the Kingdom of Thailand against the sovereignty and territorial integrity of Cambodia\". What has caused Thailand-Cambodia border clashes? 'Civilian areas targeted' Clashes are ongoing in at least six areas along the border, the Thai defence ministry said. Thailand's foreign ministry said Cambodian troops fired \"heavy artillery\" on a Thai military base on Thursday morning and also targeted civilian areas, including a hospital. \"The Royal Thai Government is prepared to intensify our self-defence measures if Cambodia persists in its armed attack and violations upon Thailand's sovereignty,\" the ministry said in a statement. A livestream video from Thailand's side showed people, including children and the elderly, running from their homes and hiding in a concrete bunker as explosions sounded. The clash happened in an area where the ancient Prasat Ta Muen Thom temple stands along the border between Thailand's Surin province and Cambodia's Oddar Meanchey province. 'Conflict not spreading' Thailand's acting premier said fighting must first stop before peace talks can start. Caretaker Prime Minister Phumtham Wechayachai told reporters there had been no declaration of war and conflict was not spreading into more provinces. He said Cambodia had fired heavy weapons into Thailand without any specific targets, resulting in civilian deaths. Earlier on Thursday, Cambodia downgraded diplomatic relations with Thailand to their lowest level, expelled the Thai ambassador and recalled all Cambodian staff from its embassy in Bangkok. Asia correspondent This border dispute is nothing new. It dates back more than a century.  There have been clashes in the past and people killed and they've turned down the heat quickly.  But be in no doubt, this is a serious inflection point - the worst hostilities between these two neighbours in more than a decade.  And while a full-scale war still seems unlikely, the political dynamics in the two nations could create some serious jeopardy. Two strongmen are playing an outsized role from the sidelines, both determined to show some political flex - Cambodia's former leader Hun Sen and Thailand's former PM Thaksin Shinawatra - both of their children have been leading their nations, but not exactly from the front. The two families were close.  But recently, Hun Sen infuriated Mr Shinawatra when he leaked a phone call with his daughter, Prime Minister Paetongtarn, that led to her suspension. So there's anger in Thailand and a Cambodian economy that's struggling.  The Cambodian leadership was infuriated by Thailand closing their border and thus crushing much needed trade.  But there are also a lot of friendly nations in ASEAN who are meant to ensure none of their members fight.  They will be pushing hard to find the off-ramp as soon as possible. The day before, its neighbour withdrew its ambassador and expelled the top Cambodian diplomat in protest after five Thai soldiers were wounded in a land mine blast, one of whom lost part of a leg. A week earlier, a land mine in a different contested area exploded and wounded three Thai soldiers, including one who lost a foot. Relations between the southeast Asian neighbours have collapsed after a Cambodian soldier was killed in an armed confrontation in a disputed border area in May. Read more on Sky News:UK's 'tough choices''Man-made starvation' in GazaMan 'scarred' by Trump max security prison Nationalist passions on both sides have further inflamed the situation, and Thailand's prime minister was suspended earlier this month as an investigation was opened into possible ethics violations over her handling of the border dispute. Border disputes are longstanding issues that have caused periodic tensions between the countries. The most prominent and violent conflicts have been around the 1,000-year-old Preah Vihear temple. In 1962, the International Court of Justice recognised Cambodian sovereignty over the temple area."
    },
    {
        "title": "Why have tensions escalated between Thailand and Cambodia - and is it safe to travel there?",
        "description": "Military clashes have erupted between Thailand and Cambodia, killing at least 12 people, including 11 civilians.",
        "url": "https://news.sky.com/story/why-have-tensions-escalated-between-thailand-and-cambodia-13400990",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-thailand-cambodia-conflict_6972374.jpg?20250724103519",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-24 07:59:00",
        "Headline": "A long-standing dispute over border areas escalated into an exchange of gunfire, shelling and rockets being launched, with both sides accusing the other on initiating the violence. Here is all you need to know.",
        "Content": " Military clashes have erupted between Thailand and Cambodia, killing at least 12 people, including 11 civilians. A long-standing dispute over border areas escalated into an exchange of gunfire, shelling and rockets being launched on 24 July, with both sides accusing one another of initiating the violence. Relations between the Southeast Asian neighbours deteriorated sharply after an armed confrontation in May that killed a Cambodian soldier. Nationalist passions on both sides have further inflamed the situation. Here is all you need to know about the situation and how it got to this stage. What is happening in Thailand and Cambodia? Tensions first broke out on Thursday morning in an area near the ancient Ta Muen Thom temple along the border of Thailand's Surin province and Cambodia's Oddar Meanchey province. The Thai army said that most casualties occurred in the Si Sa Ket province, where six people were killed after shots were fired at a fuel station. At least 14 people were injured in three other border provinces. An eight-year-old boy was among those killed, Thailand's health minister Somsak Thepsuthin said. Thailand's foreign ministry said Cambodian troops fired \"heavy artillery\" on a Thai military base on Thursday morning and also targeted civilian areas, including a hospital. In response, the Thai army said a Thai F-16 fighter jet bombed military targets in Cambodia. Cambodia's defence ministry said Thai jets had dropped bombs on a road near the ancient Preah Vihear temple, saying it \"strongly condemns the reckless and brutal military aggression of the Kingdom of Thailand against the sovereignty and territorial integrity of Cambodia\". Clashes are now thought to be ongoing in at least six areas along the border, the Thai defence ministry said. What caused the escalation? For more than a century, Thailand and Cambodia have laid claim to undisputed points along their 817-km (508-mile) land border. This has led to skirmishes over several years and at least a dozen deaths, including during a weeklong exchange of artillery in 2011. Tensions were reignited in May after a Cambodian soldier was killed during a brief exchange of gunfire, which escalated into a full-blown diplomatic crisis and now has triggered recent armed clashes. Both countries agreed to de-escalate tensions, but Cambodian and Thai authorities continued to implement or threaten restrictions on the other. Tighter restrictions on Thailand's land border with Cambodia were implemented, stopping almost all crossings except for students, medical patients and others with essential needs. Thai authorities sealed the border entirely after Thursday's escalation. Meanwhile, Cambodia has banned Thai movies and TV shows, stopped the import of Thai fuel, fruits and vegetables and boycotted some of its neighbour's international internet links and power supply. Earlier on Thursday, Cambodia said it was downgrading diplomatic relations with Thailand to their lowest level, expelling the Thai ambassador and recalling all Cambodian staff from its embassy in Bangkok. That was in response to Thailand withdrawing its ambassador and expelling the Cambodian ambassador a day earlier, in protest against a number of land mine blasts that injured a total of eight Thai soldiers. Thai authorities alleged the mines were recently laid along paths that by mutual agreement were supposed to be safe. They said the mines were Russian-made and not of a type used by Thailand's military. Cambodia accused Thailand of making \"baseless accusations\", pointing out that the unexploded mines could have been from previous periods of unrest. Political fallout  Earlier this month, Thailand's former prime minister Paetongtarn Shinawatra attempted to resolve tensions via a call with Cambodia's influential former prime minister and current president of the senate, Hun Sen. Their conversation was later leaked, revealing Ms Shinawatra referred to Mr Sen - who stepped down as prime minister in favour of his son Hun Manet in 2023 - \"uncle\" and criticised Thai military leadership. Her comments caused widespread outrage and protests and led to Ms Shinawatra being suspended from her position on 1 July after a court ruling. Her ally, former defence minister Phumtham Wechayachai was appointed as acting prime minister. Mr Wechayachai said on Thursday that fighting between Cambodia and Thailand must stop before negotiations between the two sides can begin. Is it safe to travel there? The neighbouring countries are both hugely popular with tourists, but since tensions escalated on the border on Thursday, the UK Foreign Office (FCDO) has updated its advice for individuals already in the area or planning to visit. The FCDO website states: \"There are reports of fighting including rocket and artillery fire on 24 July between Thailand and Cambodia at several locations along the border. Casualties have been reported, as well as evacuations of areas close to the border.\" It adds that British nationals should \"exercise a high level of vigilance in border areas\" and \"follow the instructions of local authorities. There are also unexploded landmines in the border area\". The US Embassy in Thailand also released new advice, telling US citizens to \"follow direction from Thai security services and consult local government authorities for the latest information\". Why is the border contested? Tensions over the border largely stem back to a 1907 map drawn under French colonial rule that was used to separate Cambodia from Thailand. Cambodia has used the map as a reference to claim territory, while Thailand has argued the map is inaccurate. The most prominent and violent conflicts have been over the 1,000-year-old Preah Vihear temple. In 1962, the International Court of Justice awarded Cambodia sovereignty over the temple area, which caused irritation between the neighbouring countries. Cambodia went back to the court in 2011, following several clashes between its army and Thai forces that killed about 20 people and displaced thousands. The court reaffirmed the ruling in Cambodia's favour in 2013. Cambodia has again turned to the international court to resolve the border disputes but Thailand has rejected the court's jurisdiction."
    },
    {
        "title": "People in Gaza are 'walking corpses' - with one in five children malnourished, says UN",
        "description": "A fifth of the children in Gaza City are malnourished and more than 100 people, most of them youngsters, have reportedly died of hunger there, the UN has said.",
        "url": "https://news.sky.com/story/people-in-gaza-are-walking-corpses-with-one-in-five-children-malnourished-says-un-13401169",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-palestinians-gaza-city_6972707.jpg?20250724154431",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-24 12:47:00",
        "Headline": "Most of the youngsters the UN sees are \"emaciated, weak and at high risk of dying if they don't get the treatment they urgently need\", while the UNRWA's frontline health workers are surviving on \"one small meal a day\".",
        "Content": " A fifth of the children in Gaza City are malnourished and more than 100 people, most of them youngsters, have reportedly died of hunger there, the UN has said. Philippe Lazzarini, the commissioner-general of the UN Relief and Works Agency (UNRWA), quoting a colleague, said on Thursday that people in Gaza, where the supply and distribution of aid is controlled by Israel, \"are neither dead nor alive, they are walking corpses\". Most of the youngsters the agency sees are \"emaciated, weak and at high risk of dying if they don't get the treatment they urgently need\". \"This deepening crisis is affecting everyone, including those trying to save lives in the war-torn enclave,\" Mr Lazzirini said. UNRWA's frontline health workers are surviving on \"one small meal a day, often just lentils, if at all. They are increasingly fainting from hunger while at work\". \"When caretakers cannot find enough to eat, the entire humanitarian system is collapsing.\" The warning comes as news organisations asked Israel to allow journalists to move freely in and out of Gaza amid fears that reporters there are facing the risk of starvation. \n                  British surgeon claims IDF shooting Gazans in specific areas - 'almost like a game of target practice'\n                 \n                  France to become first G7 nation to recognise Palestine as a state\n                 \n                  Inside Gaza's Nasser Hospital - where there's virtually no food for malnourished children\n                 BBC News, Agence France Press, Associated Press and Reuters said in a statement published on Thursday that they are \"desperately concerned for our journalists in Gaza, who are increasingly unable to feed themselves and their families\". They said: \"For many months, these independent journalists have been the world's eyes and ears on the ground in Gaza. They are now facing the same dire circumstances as those they are covering. \"Journalists endure many deprivations and hardships in war zones. We are deeply alarmed that the threat of starvation is now one of them. \"We once again urge the Israeli authorities to allow journalists in and out of Gaza. It is essential that adequate food supplies reach the people there.\" Israeli government spokesperson David Mencer told Sky News that food shortages have \"been engineered by Hamas\", and that there \"is no famine in Gaza\".  Speaking on Wednesday's News Hour with Mark Austin, Mr Mencer said aid is \"flowing\" into the territory but Hamas \"loots the trucks [and] deliberately endangers its own people\". The fighters deny stealing food. More than 4,400 aid trucks have been allowed into Gaza since Israel lifted its blockade in May, roughly 70 trucks a day, which is the lowest rate of the war and far below the 500-600 trucks a day the UN says is needed. \"The problem is not Israel,\" he said. \"The problem is Hamas.\" Read more:Gaza situation 'worst ever' - charityHundreds of thousands 'food insecure''Scarred' by Trump max security prison The UK and several other countries have condemned the current aid delivery model, known as the Gaza Humanitarian Foundation, which is backed by the Israeli and American governments. It has reportedly resulted in Israeli troops firing on Palestinian civilians in search of food on multiple occasions. More than 800 people have reportedly been killed in recent weeks trying to reach food, mostly in shootings by Israeli soldiers posted near distribution centres. More than 2.1 million people live in Gaza, according to the UN."
    },
    {
        "title": "Venezuelan scarred after being sent to maximum security prison by Trump administration",
        "description": "Arturo Suarez cries as he hugs his family for the first time in months. ",
        "url": "https://news.sky.com/story/we-were-constantly-beaten-venezuelan-sent-to-maximum-security-prison-by-trump-administration-speaks-out-13400927",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-venezuela-suarez_6972157.jpg?20250724045445",
        "type": "World",
        "Author": "Martha Kelner",
        "Date Published": "2025-07-24 03:19:00",
        "Headline": "The 34-year-old was one of more than 250 Venezuelan men sent by the Trump administration to a maximum security prison in El Salvador, despite having no criminal record in any of the four countries he has lived in.",
        "Content": "\n          US correspondent\n              @marthakelner\n  Arturo Suarez cries as he hugs his family for the first time in months.  His sister's modest home in Caracas, Venezuela's capital city, is decorated with red, blue and black balloons and banners to welcome him back. Friends and neighbours fill the living room and the street outside. He video calls other family members elsewhere in the world. This is the first time they have heard his voice since March. \"I hadn't felt so safe for a while,\" Arturo tells Sky News, \"when I hugged my brothers, my uncle, my aunt, that's where I felt that the nightmare was over, that I had made it home.\" Then the story of what he had endured begins to pour out of him. The 34-year-old was one of more than 250 Venezuelan men sent by the Trump administration to a maximum security prison in El Salvador, despite having no criminal record in any of the four countries he has lived in. \n                  Snipers, Secret Service sweeps and a personal chef on standby: Scotland awaits Trump's arrival\n                 \n                  Epstein questions keep coming as White House tightens its grip on who can answer them\n                 \n                  Donald Trump told in May his name appears in Epstein files - report\n                 Last week, he was released as part of a prisoner swap with 10 American citizens and permanent residents detained in Venezuela. But he is scarred by the four months he spent at the CECOT prison, a terrorism confinement centre, in El Salvador, alongside some of the world's most dangerous men. Read more from Sky News: 'Everyone's on edge': Epping braces for another hotel protestOzzy Osbourne dies just weeks after farewell show \"We were constantly beaten,\" he says, \"we suffered physical, verbal, and psychological abuse. \"There wasn't a day the wardens didn't tell us that the only way we'd leave that place was if we were dead. In fact, the first words the head of the prison said to us after the first beating was 'welcome to hell'.\" Arturo is an aspiring singer. He had moved to the US to escape Venezuela's authoritarian regime and set up home in North Carolina. He had a feeling when Donald Trump became president for a second time that there would be a crackdown on immigration, as promised in his campaign. But, because Arturo had followed all the legal channels to enter the country, he didn't think he would be caught up in the deportation policy. He was wrong. While he was filming a music video in a house in North Carolina in March, he was arrested by immigration agents and accused by the White House of being a gang member, although they have provided little evidence publicly to support that claim. He was then flown to El Salvador - a country he had never even visited - and put in a maximum security prison. His ordeal was under way. \"We were sleeping 19 people to a cell,\" he says, \"if we spoke loudly, they would take away our mattresses, if they found us bathing more than once a day, they'd take away the mattresses from us. \"The punishment was severe. It was beatings and humiliations and they took away our food. \"I remember we were exercising and a cellmate, very politely, asked the prison head if we could bathe a second time that day, since we were doing exercise. \"His words were 'that's your problem, it's not my problem if you exercise'. We were also made to eat with our hands. \"They tried to take our humanity away from us. They tried to make us lose everything.\" The Trump administration paid El Salvador millions of dollars to detain the 252 Venezuelan men, claiming they were part of the notorious Tren De Aragua gang. Homeland Security Secretary, Kristi Noem, visited the prison for a tour and photoshoot in March and Arturo saw her. \"Obviously they did a show of this,\" he says, \"they had cameras. When she came in, my cellmates and I began to make the help sign, which she disliked a lot. We began to shout freedom.\" Arturo was denied due process to appeal his extradition to El Salvador and was not allowed to speak to a lawyer or any family or friends during his time in prison. I spoke to Arturo's brother Nelson in April as he appealed for his release. He said Arturo's only crime was having tattoos, which the White House cited as evidence of involvement with gangs. On a video call, Arturo shows me the tattoos. Most of them, he says, are in tribute to his late mother. I ask if he thinks that the Trump administration believed he was a gang member. \"I think it was just an excuse to get us out,\" he says, \"we weren't taken for having tattoos or belonging to a criminal gang. \"We were taken for being Venezuelans. And today I want to tell the world that being Venezuelan is not a crime.\" When he applied for asylum in the United States, Arturo had hoped to be reunited eventually with his wife, Nathali, and their 10-month-old daughter Nahiara, who are currently in Chile. \"When I was given the opportunity to go to the United States, I was going to go with my wife,\" he says, \"we found out that she was pregnant but I went anyway because it was for the future, for my daughter's future. \"Unfortunately, this decision led me to one of the most brutal prisons. What I most long for, is to be with my daughter and my wife.\" He's now being supported by other family members in Venezuela, but he will never return to the US. He went for a better life but instead was labelled a criminal. Now, he says, he just wants to clear his name."
    },
    {
        "title": "Plane with 48 people on board crashes in Russia's far east",
        "description": "A Russian plane carrying 48 people - including children - has crashed with no survivors, according to reports.",
        "url": "https://news.sky.com/story/plane-with-49-people-on-board-crashes-in-russias-far-east-13400976",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-tynda-angara-airlines_6972296.jpg?20250724092116",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-24 07:11:00",
        "Headline": "Burning wreckage of the Soviet-era aircraft was found by a rescue helicopter after it lost contact with air traffic controllers close to its destination.",
        "Content": " A Russian plane carrying 48 people - including children - has crashed with no survivors, according to reports. The aircraft was flying from the city of Blagoveshchensk on the Russian-Chinese border to the remote town of Tynda, regional governor Vasily Orlov said. \"All necessary forces and means have been deployed to search for the plane,\" Mr Orlov said on Telegram, adding all passengers and crew were killed in the crash. An error during landing in poor visibility caused the crash in the eastern part of the Amur region, TASS news agency reported. Unverified video, shot from a helicopter and posted on social media, appeared to show the plane had come down in a densely forested area. It caught fire during its descent, and no survivors were spotted during an aerial inspection of the site, TASS said, quoting a statement from the regional civil defence and fire safety centre. \"According to the director of Tynda Airport, the plane caught fire upon impact, and a Mi-8 helicopter crew flying over the area reported no signs of survivors,\" the statement said. The Interfax news agency, citing unnamed sources in the emergency services, said there were difficult weather conditions in the area. The transport prosecutor's office in Russia's far east reported the site of the crash was 10 miles (15km) south of Tynda, adding in an online statement that the plane was trying to make a second approach during landing when contact with it was lost. Burning fuselage of the plane, which was from the Soviet era and was nearly 50 years old, was found by a rescue helicopter south of Tynda, emergency officials said, adding that rescue crews were rushing to the scene. The Antonov An-24 passenger jet, built in 1976 according to its tail number, and operated by a privately-owned Siberia-based airline called Angara, disappeared from radar over the area, local officials said. It was believed to be a few kilometres away from its destination when it lost contact, the SHOT news agency reported. Read more from Sky News:Town 'on edge' ahead of hotel protest11 dead in escalating tensions'Man-made starvation' in Gaza The local emergencies ministry put the number of people on board somewhat lower, at around 40, while Russia's Emergency Situations Ministry said 48 people were on board the flight. It was unclear why numbers differed. Yuliya Petina, an emergency services official, wrote on Telegram: \"During the search operation, a Mi-8 helicopter belonging to Rossaviatsiya discovered the fuselage of the aircraft, which was on fire. \"Rescuers continue to make their way to the scene of the accident\". An investigation has been launched, authorities said."
    },
    {
        "title": "Donald Trump told in May his name appears in Epstein files - report",
        "description": "Donald Trump was told in May that his name appears multiple times in justice department files related to convicted paedophile Jeffrey Epstein, according to the Wall Street Journal.",
        "url": "https://news.sky.com/story/donald-trump-told-in-may-his-name-appears-in-epstein-files-report-13401019",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump_6970970.jpg?20250722172533",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-24 08:26:00",
        "Headline": "The US president is under pressure for not following though on a campaign promise to release all Jeffrey Epstein files. A report now claims he was told his name was included in the files.",
        "Content": " Donald Trump was told in May that his name appears multiple times in justice department files related to convicted paedophile Jeffrey Epstein, according to the Wall Street Journal. The American president has come under fire for not releasing the documents - breaking a campaign promise - with some questioning his ties to Epstein. Now the newspaper reports Mr Trump is aware his name is included in the files, along with many other high-profile figures. Being mentioned in the records is not a sign of wrongdoing, and Mr Trump has not been accused of anything. The White House initially described the report as \"fake news\", but Reuters news agency said an official told them the administration isn't denying Mr Trump's name is there. Attorney General Pam Bondi and her deputy Todd Blanche issued a statement that does not directly address the Wall Street Journal's report. \"Nothing in the files warranted further investigation or prosecution, and we have filed a motion in court to unseal the underlying grand jury transcripts,\" they said. \"As part of our routine briefing, we made the president aware of the findings.\" The Journal reports officials told the president the files contained what they felt was unverified hearsay about many people, including Mr Trump. The president was friendly with Epstein in the 1990s and early 2000s, and he appears multiple times on flight logs for his private plane in the 1990s. Mr Trump has said their friendship ended before Epstein's legal troubles first began two decades ago. Officials also told Mr Trump the Justice Department didn't plan to release more documents, because they include child pornography and victims' personal information, the Journal added. Last week, Trump began legal action against the Journal, after it alleged he sent a suggestive birthday message to Epstein in 2003. The US president said he was seeking at least $20 billion in damages and said the report regarding the message was \"fake\". Among those named in the legal action is the Journal's parent company and owner Rupert Murdoch. Judge rejects bid to unseal Epstein grand jury materialsAll we know about Trump and Epstein's 'friendship' The Justice Department said earlier this month there is no basis to continue probing the Epstein case. This sparked anger among prominent Trump supporters who demanded more information about wealthy and powerful people linked to Epstein. Material had been released in the criminal case against Epstein's former associate Ghislaine Maxwell, who was sentenced to 20 years in prison for child sex trafficking and other crimes. During her trial, Epstein's pilot testified Mr Trump flew on Epstein's private jet multiple times - although Mr Trump has denied being on the plane."
    },
    {
        "title": "Venezuelan scarred after being sent to maximum security prison by Trump administration",
        "description": "Arturo Suarez cries as he hugs his family for the first time in months. ",
        "url": "https://news.sky.com/story/we-were-constantly-beaten-venezuelan-sent-to-maximum-security-prison-by-trump-administration-speaks-out-13400927",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-venezuela-suarez_6972157.jpg?20250724045445",
        "type": "US",
        "Author": "Martha Kelner",
        "Date Published": "2025-07-24 03:19:00",
        "Headline": "The 34-year-old was one of more than 250 Venezuelan men sent by the Trump administration to a maximum security prison in El Salvador, despite having no criminal record in any of the four countries he has lived in.",
        "Content": "\n          US correspondent\n              @marthakelner\n  Arturo Suarez cries as he hugs his family for the first time in months.  His sister's modest home in Caracas, Venezuela's capital city, is decorated with red, blue and black balloons and banners to welcome him back. Friends and neighbours fill the living room and the street outside. He video calls other family members elsewhere in the world. This is the first time they have heard his voice since March. \"I hadn't felt so safe for a while,\" Arturo tells Sky News, \"when I hugged my brothers, my uncle, my aunt, that's where I felt that the nightmare was over, that I had made it home.\" Then the story of what he had endured begins to pour out of him. The 34-year-old was one of more than 250 Venezuelan men sent by the Trump administration to a maximum security prison in El Salvador, despite having no criminal record in any of the four countries he has lived in. \n                  Snipers, Secret Service sweeps and a personal chef on standby: Scotland awaits Trump's arrival\n                 \n                  Epstein questions keep coming as White House tightens its grip on who can answer them\n                 \n                  Donald Trump told in May his name appears in Epstein files - report\n                 Last week, he was released as part of a prisoner swap with 10 American citizens and permanent residents detained in Venezuela. But he is scarred by the four months he spent at the CECOT prison, a terrorism confinement centre, in El Salvador, alongside some of the world's most dangerous men. Read more from Sky News: 'Everyone's on edge': Epping braces for another hotel protestOzzy Osbourne dies just weeks after farewell show \"We were constantly beaten,\" he says, \"we suffered physical, verbal, and psychological abuse. \"There wasn't a day the wardens didn't tell us that the only way we'd leave that place was if we were dead. In fact, the first words the head of the prison said to us after the first beating was 'welcome to hell'.\" Arturo is an aspiring singer. He had moved to the US to escape Venezuela's authoritarian regime and set up home in North Carolina. He had a feeling when Donald Trump became president for a second time that there would be a crackdown on immigration, as promised in his campaign. But, because Arturo had followed all the legal channels to enter the country, he didn't think he would be caught up in the deportation policy. He was wrong. While he was filming a music video in a house in North Carolina in March, he was arrested by immigration agents and accused by the White House of being a gang member, although they have provided little evidence publicly to support that claim. He was then flown to El Salvador - a country he had never even visited - and put in a maximum security prison. His ordeal was under way. \"We were sleeping 19 people to a cell,\" he says, \"if we spoke loudly, they would take away our mattresses, if they found us bathing more than once a day, they'd take away the mattresses from us. \"The punishment was severe. It was beatings and humiliations and they took away our food. \"I remember we were exercising and a cellmate, very politely, asked the prison head if we could bathe a second time that day, since we were doing exercise. \"His words were 'that's your problem, it's not my problem if you exercise'. We were also made to eat with our hands. \"They tried to take our humanity away from us. They tried to make us lose everything.\" The Trump administration paid El Salvador millions of dollars to detain the 252 Venezuelan men, claiming they were part of the notorious Tren De Aragua gang. Homeland Security Secretary, Kristi Noem, visited the prison for a tour and photoshoot in March and Arturo saw her. \"Obviously they did a show of this,\" he says, \"they had cameras. When she came in, my cellmates and I began to make the help sign, which she disliked a lot. We began to shout freedom.\" Arturo was denied due process to appeal his extradition to El Salvador and was not allowed to speak to a lawyer or any family or friends during his time in prison. I spoke to Arturo's brother Nelson in April as he appealed for his release. He said Arturo's only crime was having tattoos, which the White House cited as evidence of involvement with gangs. On a video call, Arturo shows me the tattoos. Most of them, he says, are in tribute to his late mother. I ask if he thinks that the Trump administration believed he was a gang member. \"I think it was just an excuse to get us out,\" he says, \"we weren't taken for having tattoos or belonging to a criminal gang. \"We were taken for being Venezuelans. And today I want to tell the world that being Venezuelan is not a crime.\" When he applied for asylum in the United States, Arturo had hoped to be reunited eventually with his wife, Nathali, and their 10-month-old daughter Nahiara, who are currently in Chile. \"When I was given the opportunity to go to the United States, I was going to go with my wife,\" he says, \"we found out that she was pregnant but I went anyway because it was for the future, for my daughter's future. \"Unfortunately, this decision led me to one of the most brutal prisons. What I most long for, is to be with my daughter and my wife.\" He's now being supported by other family members in Venezuela, but he will never return to the US. He went for a better life but instead was labelled a criminal. Now, he says, he just wants to clear his name."
    },
    {
        "title": "Epstein questions keep coming as White House tightens its grip on who can answer them",
        "description": "Another day, another headline about Jeffrey Epstein for the White House to contend with.",
        "url": "https://news.sky.com/story/epstein-questions-keep-coming-as-white-house-tightens-its-grip-on-who-can-answer-them-13401333",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-trump-donald_6972875.jpg?20250724191514",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-07-24 17:52:00",
        "Headline": "In a clumsy attempt to shut down questions from his own base, the Trump administration has inadvertently shifted the focus to the president's relationship with Epstein.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  Another day, another headline about Jeffrey Epstein for the White House to contend with. The Wall Street Journal has reported that US attorney general Pam Bondi met with President Trump in May to inform him that his name appears multiple times in files related to Jeffrey Epstein, who took his own life while awaiting trial on sex trafficking charges in 2019. While the appearance of anyone's name in the files would not in itself indicate wrongdoing, it adds fuel to the fire of those peddling a conspiracy of the president's own making. Trump latest: Questions hang over Ghislaine Maxwell meeting  During the election campaign, he implied the Biden administration was concealing something in the Epstein files and vowed to release them. Once elected, his Department of Justice said it had reviewed the files and there was nothing to see. In a clumsy attempt to shut down questions from their own base, they shifted the focus to the question of Donald Trump's own relationship with Epstein. \n                  Snipers, Secret Service sweeps and a personal chef on standby: Scotland awaits Trump's arrival\n                 \n                  Donald Trump told in May his name appears in Epstein files - report\n                 \n                  Venezuelan scarred after being sent to maximum security prison by Trump administration\n                 The two were friends in the nineties and noughties with Trump flying several times on Epstein's plane according to flight records. Again, there is no indication of any wrongdoing. Three times in two weeks though, the president has attempted to quell the media storm. He did a U-turn and ordered the release of grand jury testimony related to Epstein. A judge has declined that request, ruling it doesn't meet the bar. He filed a lawsuit against Rupert Murdoch and the Wall Street Journal for a report alleging he had sent a suggestive birthday letter to Epstein, something Trump calls \"fake news\". And he gave his seal of approval to the justice department's decision to meet with Epstein's former girlfriend and accomplice, the jailed Ghislaine Maxwell. Read more:All we know about Trump and Epstein's 'friendship'US president denies writing Epstein letter  In a break from his usual all-hands-on-deck approach of having key figures promote and defend him, the president doesn't want his administration talking about Epstein, according to NBC. A senior administration source, speaking on condition of anonymity, told the network no one is allowed to speak about it without high-level vetting.  \"The communications office has to be directly involved in every aspect of this,\" they said. \"Every 'i' must be dotted and every 't' must be crossed through us. \"The questions are going to come, but whether we engage or not is part of the consideration.\""
    },
    {
        "title": "Donald Trump told in May his name appears in Epstein files - report",
        "description": "Donald Trump was told in May that his name appears multiple times in justice department files related to convicted paedophile Jeffrey Epstein, according to the Wall Street Journal.",
        "url": "https://news.sky.com/story/donald-trump-told-in-may-his-name-appears-in-epstein-files-report-13401019",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump_6970970.jpg?20250722172533",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-24 08:26:00",
        "Headline": "The US president is under pressure for not following though on a campaign promise to release all Jeffrey Epstein files. A report now claims he was told his name was included in the files.",
        "Content": " Donald Trump was told in May that his name appears multiple times in justice department files related to convicted paedophile Jeffrey Epstein, according to the Wall Street Journal. The American president has come under fire for not releasing the documents - breaking a campaign promise - with some questioning his ties to Epstein. Now the newspaper reports Mr Trump is aware his name is included in the files, along with many other high-profile figures. Being mentioned in the records is not a sign of wrongdoing, and Mr Trump has not been accused of anything. The White House initially described the report as \"fake news\", but Reuters news agency said an official told them the administration isn't denying Mr Trump's name is there. Attorney General Pam Bondi and her deputy Todd Blanche issued a statement that does not directly address the Wall Street Journal's report. \"Nothing in the files warranted further investigation or prosecution, and we have filed a motion in court to unseal the underlying grand jury transcripts,\" they said. \"As part of our routine briefing, we made the president aware of the findings.\" The Journal reports officials told the president the files contained what they felt was unverified hearsay about many people, including Mr Trump. The president was friendly with Epstein in the 1990s and early 2000s, and he appears multiple times on flight logs for his private plane in the 1990s. Mr Trump has said their friendship ended before Epstein's legal troubles first began two decades ago. Officials also told Mr Trump the Justice Department didn't plan to release more documents, because they include child pornography and victims' personal information, the Journal added. Last week, Trump began legal action against the Journal, after it alleged he sent a suggestive birthday message to Epstein in 2003. The US president said he was seeking at least $20 billion in damages and said the report regarding the message was \"fake\". Among those named in the legal action is the Journal's parent company and owner Rupert Murdoch. Judge rejects bid to unseal Epstein grand jury materialsAll we know about Trump and Epstein's 'friendship' The Justice Department said earlier this month there is no basis to continue probing the Epstein case. This sparked anger among prominent Trump supporters who demanded more information about wealthy and powerful people linked to Epstein. Material had been released in the criminal case against Epstein's former associate Ghislaine Maxwell, who was sentenced to 20 years in prison for child sex trafficking and other crimes. During her trial, Epstein's pilot testified Mr Trump flew on Epstein's private jet multiple times - although Mr Trump has denied being on the plane."
    },
    {
        "title": "Hulk Hogan dies aged 71",
        "description": "The legendary WWE wrestler Hulk Hogan has died aged 71.",
        "url": "https://news.sky.com/story/wrestling-star-hulk-hogan-has-died-13401278",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-hulk-hogan_6972794.jpg?20250724171654",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-24 15:44:00",
        "Headline": "Hogan is perhaps the most iconic star in WWE's five-decade history - with his distinctive blonde moustache and colourful headbands helping him become a pop culture phenomenon. ",
        "Content": " The legendary WWE wrestler Hulk Hogan has died aged 71. Police have said emergency services responders treated Hogan at his home in Clearwater, Florida, for cardiac arrest at around 10am local time (3pm UK time) today but he died in hospital around an hour and 15 minutes later. Hogan, whose real name was Terry Bollea, is perhaps the most iconic star in WWE's five-decade history - known for his distinctive blonde moustache and colourful headbands. His charisma and theatrics in the ring are credited with helping to transform professional wrestling into a family entertainment sport. Hogan was the main draw for the first-ever WrestleMania in 1985 and was a fixture for years in its signature event, facing everyone from Andre The Giant and Randy Savage to The Rock and even company chairman Vince McMahon. He claimed his first WWE world championship by defeating the Iron Sheik in 1984. Hogan went on to win five more world championships and was inducted into the WWE Hall of Fame in 2005 by Sylvester Stallone. \n                  Hungary bans Irish rap group Kneecap from entering country over 'antisemitic hate speech'\n                 \n                  'A local lad done good': Fans remember Ozzy Osbourne in his hometown of Birmingham\n                 \n                  Ozzy Osbourne obituary: Heavy metal, reality TV, and biting bats – the wild life of Birmingham's Prince Of Darkness\n                 Undertaker among WWE icons to pay tribute WWE said in a post this evening: \"WWE is saddened to learn WWE Hall of Famer Hulk Hogan has passed away. One of pop culture's most recognizable figures, Hogan helped WWE achieve global recognition in the 1980s. WWE extends its condolences to Hogan's family, friends, and fans.\" Hogan's friend and fellow former professional wrestler, Ric Flair, wrote on X: \"I am absolutely shocked to hear about the passing of my close friend @HulkHogan! Hulk has been by my side since we started in the wrestling business. \"An incredible athlete, talent, friend, and father!\" Mr McMahon wrote on X after Hogan's death: \"The world lost a treasure today. Hulk Hogan was the greatest WWE Superstar of ALL TIME, someone who was loved and admired around the world... He leaves us with one of his favourite expressions, 'Train, take your vitamins and say your prayers.' Today, we pray for him.\" WWE icon The Undertaker wrote on X: \"The wrestling world has lost a true legend. His contributions to our business are immeasurable and for that I am appreciative. Thank you, Hulk Hogan.\" Former WWE wrestler Triple H wrote on social media in a tribute to Hogan: \"He was the archetype of what it meant to be a 'Superstar' - a global sensation that inspired millions to work hard at whatever it was they wanted to accomplish and a look that made him recognizable to fans around the world.\" Hogan goes to Hollywood The wrestler was also able to transcend his \"Hulkamania\" fanbase to become a celebrity outside the wrestling world, appearing in numerous movies and television shows, including a reality show about his life on VH1, Hogan Knows Best. His notable movie appearances include playing Thunderlips in Rocky III and Shep Ramsey in Suburban Commando. In 2024, he appeared at the Republican National Convention to endorse the presidential bid of Donald Trump. Hogan said he made the decision to support the Republican candidate after seeing his combative, fist-pumping reaction to an attempted assassination on the campaign trail. In a reference to so-called \"Hulkamania\", he ripped off his shirt to reveal a Trump tank top and bellowed to a cheering crowd: \"Let Trumpamania run wild, brother... Let Trumpamania rule again!\" The US president paid tribute to Hogan in a Truth Social post today, writing: \"We lost a great friend today, the 'Hulkster'. Hulk Hogan was MAGA (Make America Great Again) all the way - Strong, tough, smart, but with the biggest heart. He gave an absolutely electric speech at the Republican National Convention, that was one of the highlights of the entire week. He entertained fans from all over the World, and the cultural impact he had was massive. To his wife, Sky, and family, we give our warmest best wishes and love. Hulk Hogan will be greatly missed!\" US vice president JD Vance has also paid tribute, writing on X: \"Hulk Hogan was a great American icon. One of the first people I ever truly admired as a kid. The last time I saw him we promised we'd get beers together next time we saw each other. The next time will have to be on the other side, my friend! Rest in peace.\" Hogan's support of Trump did not go down well with all wrestling fans and it was far from his only controversy. The gossip website Gawker posted a video in 2012 of him having sex with his former best friend's wife. Hogan sued on privacy grounds and was awarded a $140m judgement in 2016. A year earlier he was suspended by the WWE after another secret recording revealed that Hogan had used a racial slur. He was reinstated in 2018. The making of a pop culture phenomenon Born in the US state of Georgia in August 1953, Hogan played bass guitar in local bands before getting involved in the wrestling scene in Florida in the 1970s. The young wrestler, who later admitted to taking anabolic steroids during his career, gained notoriety as his biceps turned into what he dubbed the \"24-inch pythons\". The \"Hulk\" moniker came from comparisons to the comic-book hero portrayed on TV at the time. He would end up paying royalties to Marvel Comics for years. \"Hogan\" was the invention of Mr McMahon, the owner of what was then called the World Wrestling Federation (WWF), who wanted Irish representation among his stable of stars. Hogan was married three times and had two children. In an update at 1.47pm local time (6.47pm UK time), Clearwater Police Major Nate Burnside said there were \"no signs of foul play or suspicious activity\" in relation to the wrestler's death. He added that Hogan's family are being supported."
    },
    {
        "title": "Lloyds Bank's Charlie Nunn expects two more interest rate cuts in 2025",
        "description": "The head of the UK's biggest mortgage lender has said he expects two more interest rate cuts this year, making borrowing cheaper. ",
        "url": "https://news.sky.com/story/lloyds-banks-charlie-nunn-expects-two-more-interest-rate-cuts-in-2025-13401105",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-rachel-reeves-lloyds_6965189.jpg?20250715101527",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-24 10:43:00",
        "Headline": "Chief executive Charlie Nunn also warned Chancellor Rachel Reeves not to increase taxes on financial services after the bank's better than expected profits. ",
        "Content": "The head of the UK's biggest mortgage lender has said he expects two more interest rate cuts this year, making borrowing cheaper.  Chief executive of Lloyds Banking Group Charlie Nunn told Sky News he expected the Bank of England to make the cuts two more times before 2026, likely bringing the base interest rate to 3.75%. Two cuts are currently anticipated by investors, the first of which is due to be a 0.25 percentage point reduction next month. Money blog: World's most powerful passports revealed The banking group owns Halifax and Bank of Scotland, making it the biggest provider of mortgages. Mr Nunn also forecast house price growth of between 2 and 3%. \"We helped 34,000 first-time buyers in the first half [of the year] alone, 64,000 last year. And of course, it was driven by the stamp duty changes in Q1 [the first three months of the year]. So Q2 [the second three months] was a bit slower, but we continue to see real strength in customers wanting to buy homes and take mortgages. So we think that will continue,\" he said. \n                  Trump takes aim at Fed chair Jerome Powell again and says he 'should be ashamed'\n                 \n                  Tariffs hit US economy forecast but the Fed unmoved by latest Trump threats with no change to interest rates\n                 \n                  Why many assume interest rates will fall further - but no one really has a clue\n                  It comes as the bank reported higher profits than City of London analysts had expected. Half-yearly profit at the lender reached £3.5bn as people borrowed and deposited more. The bank has benefited from high interest rates, set at 4.25% by the Bank of England to control inflation, which have made borrowing more expensive for households and businesses. Over the last six months, the difference between what Lloyds earns on loans and what it pays out rose. Mr Nunn told Sky News the profits were due to increased market share in mortgages and small business lending, as well as productivity improvements. Despite this, Mr Nunn warned the chancellor against raising taxes on financial services, saying it was one of the highest taxed in the world. Chancellor Rachel Reeves is expected to announce tax rises in the autumn as her vow to bring down debt has come under pressure due to the rising cost of borrowing and government spending U-turns."
    },
    {
        "title": "Trade war uncertainty prompts halt to eurozone rate cuts",
        "description": "The European Central Bank (ECB) has kept its core interest rates on hold after seven successive cuts, citing uncertainty over the threatened US trade war escalation.",
        "url": "https://news.sky.com/story/trade-war-uncertainty-prompts-halt-to-eurozone-rate-cuts-13401157",
        "image_url": "https://e3.365dm.com/22/07/1920x1080/skynews-european-central-bank_5841483.jpg?20220721132445",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-07-24 12:17:00",
        "Headline": "The ECB has been able to bring rates down at a solid pace but there is a risk of a reversal should the EU-US trade fight result in a tit-for-tat escalation.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The European Central Bank (ECB) has kept its core interest rates on hold after seven successive cuts, citing uncertainty over the threatened US trade war escalation. The governing council has acted eight times in 12 months to bring down borrowing costs for the 20 European Union member states which use the euro. The Bank first acted in a bid to help stoke economic growth as Russia-Ukraine war-linked inflation started to ease, with the pace of price growth across the eurozone now back at the ECB's target of 2%. Money latest: World's most powerful passports It is expected to remain stable but that would be jeopardised in the event of a damaging tit-for-tat escalation in Donald Trump's trade war. EU diplomats expressed optimism on Wednesday evening that a deal to avert the worst of the 30% baseline rate, threatened by the president against EU goods shipped to America, was close. A failure to secure a truce by 1 August would see that higher rate kick in. But it was hoped that talks would settle on a 15% sum - with some exemptions also possible. \n                  Economists say the cost of living crisis is over - here's why many households disagree\n                 \n                  Bank of England holds rate but eyes cuts ahead despite global risks\n                 \n                  Is the cost of living crisis over? Here's what the data reveals\n                  The ECB's estimates show that higher US tariffs would result in lower growth and, depending on the extent of EU retaliation, inflation in the euro zone over the medium term. Its baseline projection from June, which incorporates 10% US tariffs, saw price growth below 2% over the next 18 months, aided by a stronger euro and weaker oil prices. But the European Commission is readying several packages of measures, worth a combined €93bn (£81bn) that could be deployed in the event of a truce failing to be agreed. The first tranche is slated to take effect on 7 August. In addition to targeting imports of US goods, the countermeasures could even be extended to services. Any retaliation would likely fan the flames of inflation in the euro area as the higher cost of many US products would likely be passed on down supply chains to consumers. More rate cuts ahead? Given the current uncertainty, the ECB said it in its statement that it would decide policy \"meeting by meeting... based on its assessment of the inflation outlook and the risks surrounding it\". Money markets were still pricing in a further interest rate reduction, probably by March, as inflation was seen at risk of going too low. Even the ECB's baseline projection from June, which incorporates 10% tariffs from the United States, saw price growth below 2% over the next 18 months. Financial markets and economists are currently split on the prospects for further rate reductions. The main deposit rate stands at 2% - down from 4% a year earlier."
    },
    {
        "title": "North Sea rivals weigh bids for exploration assets of ailing Prax Group",
        "description": "Some of the North Sea&#8217;s biggest independent oil producers are examining bids for the upstream operations of Prax Group, the energy conglomerate whose collapse has triggered the closure of one of Britain's few remaining oil refineries.",
        "url": "https://news.sky.com/story/north-sea-rivals-weigh-bids-for-exploration-assets-of-ailing-prax-group-13401328",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-prax-lindsey_6953513.jpg?20250630080643",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-24 17:31:00",
        "Headline": "Enquest and Serica Energy are among the North Sea players which have been considering offers for Prax's exploration and production arm ahead of a Thursday deadline, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Some of the North Sea’s biggest independent oil producers are examining bids for the upstream operations of Prax Group, the energy conglomerate whose collapse has triggered the closure of one of Britain's few remaining oil refineries. Sky News has learnt that Enquest and Serica Energy have been in talks with administrators handling the insolvency of parts of the group about submitting offers for its exploration and production arm ahead of a deadline on Thursday evening. Ithaca Energy, another independent player, has also held discussions about an offer but has decided not to lodge one, according to a source close to the company. Money latest: The world's most powerful passports Prax's E&P arm largely consists of the assets it acquired when it swooped for Hurricane Energy in a £250m deal in 2023. The upstream assets are not themselves in insolvency proceedings, although the money generated from their sale will be used to repay creditors of the wider group. The bid deadline comes in the same week that the Official Receiver said the Prax Lindsey refinery in Lincolnshire would shut after no buyer was found for it. \n                  Lloyds Bank's Charlie Nunn expects two more interest rate cuts in 2025\n                 \n                  Trade war uncertainty prompts halt to eurozone rate cuts\n                 \n                  Money blog: BT and EE customers facing outages; 25% house price rise forecast\n                 Hundreds of jobs will be lost as a consequence of the closure. A sale process is also pending for its downstream petrol forecourts business. A spokesperson for Teneo, the administrators of State Oil and other assets in the Prax Group, said: \"The ongoing management and operation of Prax E&P and its subsidiaries is a matter for the directors of those companies.\" Enquest, Ithaca and Serica all declined to comment."
    },
    {
        "title": "AO chair Cooper interviewed for Channel 4 chair job",
        "description": "The chairman of AO, the online electrical goods retailer, has been interviewed to become the next chair of state-owned broadcaster Channel 4.",
        "url": "https://news.sky.com/story/ao-chair-cooper-interviewed-for-channel-4-chair-job-13401036",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-channel-4-channel-four_6846256.jpg?20250304185310",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-24 08:53:00",
        "Headline": "Geoff Cooper has joined Justin King, Wol Kolade and Debbie Wosskow on the shortlist of candidates to replace Sir Ian Cheshire at the helm of the state-owned broadcaster, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The chairman of AO, the online electrical goods retailer, has been interviewed to become the next chair of state-owned broadcaster Channel 4. Sky News has learnt that Geoff Cooper, a former boss of the builders' merchant Travis Perkins, is among the candidates in the running to take on the post in the coming months. Whitehall insiders said that Mr Cooper was now one of the shortlisted contenders awaiting news of whether they would get the nod from Ofcom, the media regulator and culture secretary Lisa Nandy. In recent weeks, Sky News has revealed that those vying to replace Sir Ian Cheshire include Justin King, the former J Sainsbury boss; Wol Kolade, a private equity executive who has donated substantial sums of money to the Conservative Party; Debbie Wosskow, a start-up founder who already sits on the Channel 4 board. Simon Dingemans, a former Goldman Sachs banker who sits on the board of WPP, the marketing services group, has also been shortlisted, according to the Financial Times. Sir Ian stepped down earlier this year after just one term, having presided over a successful attempt to thwart privatisation by the last Tory government. He was replaced on an interim basis by Dawn Airey, the media industry executive who has occupied top jobs at companies including ITV, Channel 5 and Yahoo!. \n                  City financier Kolade joins ranks of Channel 4 chair contenders\n                 \n                  Former Sainsbury's chief King in frame to head Channel 4\n                 \n                  How Clean Is Your House? presenter Kim Woodburn dies\n                 The race to lead the state-owned broadcaster's board has acquired additional importance since the resignation of Alex Mahon, its long-serving chief executive. It has since been reported that Alex Burford, another Channel 4 non-executive director and the boss of Warner Records UK, is a possible contender to replace Ms Mahon. A vocal opponent of Channel 4's privatisation, which was abandoned by the last Conservative government, Ms Mahon is leaving to join Superstruct, a private equity-owned live entertainment company. The appointment of a new chair is expected to take place by the autumn, with the chosen candidate expected to lead the recruitment of Ms Mahon's successor. The Department for Culture, Media and Sport has declined to comment on the recruitment process, while Mr Cooper could not be reached for comment."
    },
    {
        "title": "Wise co-founder accuses £10bn fintech of 'misleading' investors",
        "description": "The fintech entrepreneur who has gone to war with the &#163;10bn payments company he co-founded has accused it of \"misleading\" its own investors and warned that a move to extend its current governance arrangements could be derailed in court.",
        "url": "https://news.sky.com/story/wise-co-founder-accuses-16310bn-fintech-of-8220misleading8221-investors-13401213",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-wise-bank_6969917.jpg?20250721132310",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-24 14:05:00",
        "Headline": "Taavet Hinrikus's investment vehicle, Skaala, has told Sky News that Wise's proposals to move its listing to the US and extend its dual-class voting structure could face legal derailment.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The fintech entrepreneur who has gone to war with the £10bn payments company he co-founded has accused it of \"misleading\" its own investors and warned that a move to extend its current governance arrangements could be derailed in court. In a statement issued to Sky News, Taavet Hinrikus's investment vehicle, Skaala, said Wise's claim that its proposals to extend its dual-class share structure by a decade when it moves its main listing to the US should have been updated through a formal stock exchange announcement. Mr Hinrikus is angry that the voting share structure has been wrapped up in a wider vote on the move to the US, which he says is undemocratic and unfair on investors. Money latest: World's most powerful passports \"On 21 July, Wise released a market announcement claiming that 'three key independent proxy advisory firms - ISS, Glass Lewis and PIRC - have come out unanimously in favour of the proposal and recommend shareholders vote for it',\" Skaala said. \"This statement has subsequently been proven to be misleading. \"In reality, PIRC's report - issued on 15 July - explicitly recommended shareholders vote against the scheme, citing serious concerns about governance. \n                  Lloyds Bank's Charlie Nunn expects two more interest rate cuts in 2025\n                 \n                  Trade war uncertainty prompts halt to eurozone rate cuts\n                 \n                  Money blog: BT and EE customers facing outages; 25% house price rise forecast\n                 \"Investors are overwhelmingly influenced by the views of professional proxy advisors. \"Wise should have made a corrective announcement via RNS to update the market. \"Skaala called for this immediately on learning of the issue, but Wise instead chose to quietly issue a statement on its website on 23 July 2025 with no accompanying statement to the market.\" It is the latest salvo in an escalating row between Skaala, which owns just over 5% of Wise's shares, and the company - which continues to be run by his co-founder, Kristo Kaarmann. Glass Lewis and ISS have both amended their reports since the public disclosure of the dispute on Monday, although neither has changed their voting recommendations. Mr Hinrikus also said that Wise's chairman, David Wells, had claimed incorrectly that \"Skaala's call to separate the extension of dual-class rights from the US listing 'misrepresents how a scheme of arrangement operates legally and in practice'\". He accused Mr Wells of making claims which were \"legally and commercially unfounded\". \"Skaala has put forward several practical, legally viable options for Wise to address shareholder concerns,\" it told Sky News on Thursday. \"These include proposing two alternative schemes of arrangement - both facilitating the US dual-listing, but offering shareholders the choice to approve it either with or without the 10-year extension of the dual-class voting rights. \"These alternatives have been clearly set out in Skaala's correspondence with Wise and referenced in Glass Lewis's Report Feedback Statement to its clients. \"Wise has thus far rejected these proposals out of hand.\" Skaala also claimed there was \"a substantial risk the [High] Court will decline to sanction [the proposals] at the sanctions hearing in [the second quarter of 2026], given the procedural, fairness and transparency issues surrounding the scheme as presented\". \"In such a scenario, the dual listing would be materially delayed - possibly by months - and significant cost and risk would be introduced unnecessarily. \"Should Wise only seek to restructure the Scheme after a failed Court sanction, any new scheme would face further delays and risk regulatory clearances being lost or needing to be reobtained. \"This entirely avoidable situation is the direct result of the Company's insistence on securing enhanced voting rights for CEO Kristo Kaarmann under the current proposal,\" Skaala said. Wise's existing dual-class structure was put in place in 2021, when the company floated in London with a pledge that it would revert to a single class of shares five years after its stock market debut. In response, Wise said PIRC's recommendation to shareholders to vote in favour of the company's plans was contained in a report submitted to it on 10 July. \"We were made aware [on 23 July] that PIRC had made available reports to subscribers on 15 July 2025 that recommended against the proposal. \"Wise was never provided with a copy of these reports and, as soon as we became aware of the 15 July reports, requested copies from PIRC.\" Shares in Wise, which has a market capitalisation of £10.3bn, have risen by more than a third in the last year."
    },
    {
        "title": "Satellite tracker Spaceflux reaches lift-off with £5m funding boost",
        "description": "A British space surveillance company which has won a string of government contracts will this week announce a &#163;5.4m fundraising to expand its global network of advanced telescopes.",
        "url": "https://news.sky.com/story/satellite-tracker-spaceflux-reaches-lift-off-with-1635m-funding-boost-13401077",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-telescope-spaceflux_6972415.jpg?20250724105814",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-24 09:52:00",
        "Headline": "The British-based provider of space-related technology to the MoD will announce on Friday that it has secured £5.4m in a round led by the UK Innovation & Science Seed Fund, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A British space surveillance company which has won a string of government contracts will this week announce a £5.4m fundraising to expand its global network of advanced telescopes. Sky News understands that Spaceflux, which was founded three years ago, has secured the injection of capital in a round led by the UK Innovation & Science Seed Fund (UKI2S), which is managed by Future Planet Capital, as well as Foresight Group and Blackfinch Ventures. Seraphim Space, the listed specialist investor in space-related companies, is also contributing funding. Money blog: Renowned chef thinks luxury item should be wiped off menus Spaceflux uses artificial intelligence and optical sensors to track satellites and debris across all orbits, with its daylight tracking capability meaning it can expand the observation window beyond night-time operations. Its provision of space situational awareness technologies is in growing demand amid warnings that a week-long disruption to satellite navigation could incur a £7.6bn hit to the UK economy. In a statement to Sky News, Marco Rocchetto, CEO and co-founder of Spaceflux, said: \"As space becomes increasingly essential to our economy, environment and daily lives, it is also becoming more congested and contested. \n                  Lloyds Bank's Charlie Nunn expects two more interest rate cuts in 2025\n                 \n                  Trade war uncertainty prompts halt to eurozone rate cuts\n                 \n                  Money blog: BT and EE customers facing outages; 25% house price rise forecast\n                 \"This investment strengthens our ability to protect satellite technology that delivers crucial insights to Earth around the clock, reducing collision risks, and supporting a safer, more sustainable space environment for future generations\". The valuation at which the funding was being committed was unclear on Thursday. Spaceflux, which serves government and commercial customers, has been the exclusive provider of geostationary satellite tracking for the Ministry of Defence and UK Space Agency since 2023. Read more on Sky News:Tesla looks to cheaper modelWelfare versus warfare: Why PM must choose Alex Leigh, an investment director at UKI2S, said: \"This investment marks a significant step in the convergence of defence and space, where dual-use technologies are becoming increasingly important to UK capability. \"Spaceflux's technology offers critical insights to help monitor and safeguard orbital assets - supporting both national security and the wider commercial ecosystem. \"The company is well-positioned to scale its impact and meet the needs of customers navigating an increasingly complex space environment.\""
    },
    {
        "title": "A profit boost for Lloyds, working mums and a trade deal with India",
        "description": "Darren McCaffrey talks to Allie Renison, director of SEC Newgate, about the new trade deal between the UK and India.",
        "url": "https://news.sky.com/story/a-profit-boost-for-lloyds-working-mums-and-a-trade-deal-with-india-13401138",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-biz-podcast-podcast_6937464.jpg?20250609141833",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-24 11:40:00",
        "Headline": "No subtitle found",
        "Content": "Darren McCaffrey talks to Allie Renison, director of SEC Newgate, about the new trade deal between the UK and India. Darren is also joined by Lloyds banking boss Charlie Nunn to discuss a rise in the company's profits. And Sophie Maunder, from maternity coaching provider Matri, talks about why some women aren't going back to work after having children. :: Listen and subscribe to the Sky News Business Podcast here."
    },
    {
        "title": "France to become first G7 nation to recognise Palestine as a state",
        "description": "Emmanuel Macron has said France will recognise Palestine as a state later this year.",
        "url": "https://news.sky.com/story/france-to-become-first-g7-nation-to-recognise-palestine-as-a-state-13401391",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-emmanuel-macron-french-president_6973092.jpg?20250724230447",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-24 20:09:00",
        "Headline": "Emmanuel Macron has announced that France will recognise Palestinian statehood at the UN General Assembly - heaping pressure on the UK to do the same.",
        "Content": "Emmanuel Macron has said France will recognise Palestine as a state later this year. The French leader announced the major change of policy in a letter to the president of the Palestinian Authority, Mahmoud Abbas, which Mr Macron also published online on Thursday evening. President Macron said he will make the formal announcement at the UN General Assembly, being held in September. France will become the first member of the G7 - a group of seven of the world's largest advanced economies - to recognise a Palestinian state. The G7 includes Canada, France, Germany, Italy, Japan, the UK, and the US. In his post explaining the decision, Mr Macron called for an immediate ceasefire in Gaza, the release of the hostages by Hamas and for much more humanitarian aid to reach those in the territory. But Israel's prime minister Benjamin Netanyahu has hit out at Mr Macron's stance, and said that it \"rewards terror and risks creating another Iranian proxy\". In a post on X, Mr Netanyahu added that a \"Palestinian state in these conditions would be a launch pad to annihilate Israel - not to live in peace beside it\". \n                  Can Syria's new President be trusted?\n                 \n                  Iran's crackdown on so-called Afghan spies\n                 \n                  Trump applying 'heavy pressure' on Netanyahu to end war in Gaza\n                 He warned: \"Let's be clear: The Palestinians do not seek a state alongside Israel; they seek a state instead of Israel.\" But despite the condemnation from Israel, the move heaps pressure on France's allies such as the UK, and Sir Keir Starmer insisted on Thursday night that he is \"clear that statehood is the inalienable right of the Palestinian people\". However, the prime minister has resisted calls from within Labour to recognise Palestine immediately, as he believes this should come after a ceasefire is agreed, as part of the peace process in Gaza. \"A ceasefire will put us on a path to the recognition of a Palestinian state and a two-state solution which guarantees peace and security for Palestinians and Israelis,\" he said. Currently, half of the G20 recognise Palestine as a state, while nations including the UK, US, and Germany do not. But pressure has been growing on Sir Keir to change course, with senior Labour figures including the Mayor of London, Sir Sadiq Khan, publicly calling for a change in government policy. Read more:Inside hospital where there's virtually no food for malnourished childrenPeople in Gaza are 'walking corpses' - with one in five kids malnourished - UN  'Humanitarian catastrophe' Just hours before Mr Macron's announcement, Sir Keir said he would be holding an \"emergency call\" on Friday with the leaders of France and Germany over what he called the \"humanitarian catastrophe\" in Gaza. Sir Keir said that \"the suffering and starvation unfolding in Gaza is unspeakable and indefensible\". He went on to say that it has been \"grave for some time\", but that it has now \"reached new depths and continues to worsen\".  Sir Keir said: \"I will hold an emergency call with E3 partners tomorrow, where we will discuss what we can do urgently to stop the killing and get people the food they desperately need while pulling together all the steps necessary to build a lasting peace.\" The PM added that \"we all agree\" on the need for Israel to \"change course and allow aid that is desperately needed to enter Gaza without delay\".  He wrote: \"It is hard to see a hopeful future in such dark times. But I must reiterate my call for all sides to engage in good faith, and at pace, to bring about an immediate ceasefire and for Hamas to unconditionally release all hostages.\" Mr Macron pressed for recognition of Palestinian statehood in a recent address to the UK's Parliament earlier this month, where he said it was the \"only path to peace\". Across the globe, more than 140 countries recognise Palestine as a state."
    },
    {
        "title": "Starmer sends remaining rebel Labour MPs warning",
        "description": "Sir Keir Starmer has sent a warning to Labour MPs who have rebelled against the government after suspending four MPs.",
        "url": "https://news.sky.com/story/starmer-sends-remaining-rebel-labour-mps-warning-13401084",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-keir-starmer-downing-street_6966237.jpg?20250716154528",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-07-24 10:04:00",
        "Headline": "Four Labour MPs were suspended from Labour for voting against the government and the PM has now warned the 43 MPs who also rebelled.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Sir Keir Starmer has sent a warning to Labour MPs who have rebelled against the government after suspending four MPs. The prime minister suffered his largest rebellion on 1 July after 47 Labour MPs voted against the welfare bill, which had been heavily watered down after threats of a larger rebellion. Last week, he suspended four of the backbenchers - Brian Leishman, Chris Hinchliff, Neil Duncan-Jordan and Rachael Maskell - later defending his decision by saying those who \"repeatedly break the whip\" have to be dealt with. Labour chief whip Sir Alan Campbell sent a letter, seen by Sky News, on Wednesday to the rest of the rebels, reminding them that voting against the government is breaking Labour's rules. Each rebel's letter was personalised with a reminder of what and when they had voted against the government. It was followed by: \"I am writing regarding your vote in the above divisions. \"As you know, it is against the standing orders of the Parliamentary Labour Party to vote contrary to the frontbench position and in so doing therefore, you have broken the whip.\" \n                  France to become first G7 nation to recognise Palestine as a state\n                 \n                  Govt 'shadowy' to reveal Rayner warning about social cohesion in 'readout', Harriet Harman says\n                 \n                  Politics latest: Labour is 'full of control freaks', says Corbyn - as he denies party launch was 'messy'\n                 Most votes in parliament are ruled by the \"whipping\" system, where MPs must vote in line with their party. Party whips, selected MPs and peers, rally MPs or peers to ensure they vote according to their leader's agenda. A one-line whip means MPs are \"requested\" but not required to attend the vote, a two-line whip signifies attendance is \"necessary\" and MPs must request permission to miss it, and a three-line whip means attendance is \"essential\". Disobeying the whip - voting against their party - can limit an MP's chances of promotion; they can be selected for unpopular duties, have the whip suspended or even be expelled from the parliamentary party (to \"have the whip removed\"). Some votes are \"unwhipped\" - a free vote - where MPs do not have to vote on party lines. MPs from all parties have been given a free vote for the Assisted Dying Bill. Labour MP Jon Trickett, one of the welfare bill rebels, said he had received the letter informing him he had voted against the welfare reforms six times in one day. \"I don't repent my votes. I was elected on a pledge to stand by working-class electors and above all the poorest,\" he wrote on X.  Sir Keir's watered down welfare bill meant the government will only save £2 billion instead of the £5bn it said the original bill would save, The Resolution Foundation estimated. He has admitted the week of the vote was \"tough\" and he should have engaged with backbenchers better. The PM also said he did not regret suspending the four Labour MPs, who now sit as independent MPs. He told Sky News: \"I'm determined that we will change this country for the better for millions of working people. \"I'm not going to be deflected from that and therefore we have to deal with people who repeatedly break the whip, because everyone was elected as a Labour MP on the manifesto of change and everybody needs to deliver as a Labour government.\""
    },
    {
        "title": "Lloyds Bank's Charlie Nunn expects two more interest rate cuts in 2025",
        "description": "The head of the UK's biggest mortgage lender has said he expects two more interest rate cuts this year, making borrowing cheaper. ",
        "url": "https://news.sky.com/story/lloyds-banks-charlie-nunn-expects-two-more-interest-rate-cuts-in-2025-13401105",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-rachel-reeves-lloyds_6965189.jpg?20250715101527",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-24 10:43:00",
        "Headline": "Chief executive Charlie Nunn also warned Chancellor Rachel Reeves not to increase taxes on financial services after the bank's better than expected profits. ",
        "Content": "The head of the UK's biggest mortgage lender has said he expects two more interest rate cuts this year, making borrowing cheaper.  Chief executive of Lloyds Banking Group Charlie Nunn told Sky News he expected the Bank of England to make the cuts two more times before 2026, likely bringing the base interest rate to 3.75%. Two cuts are currently anticipated by investors, the first of which is due to be a 0.25 percentage point reduction next month. Money blog: World's most powerful passports revealed The banking group owns Halifax and Bank of Scotland, making it the biggest provider of mortgages. Mr Nunn also forecast house price growth of between 2 and 3%. \"We helped 34,000 first-time buyers in the first half [of the year] alone, 64,000 last year. And of course, it was driven by the stamp duty changes in Q1 [the first three months of the year]. So Q2 [the second three months] was a bit slower, but we continue to see real strength in customers wanting to buy homes and take mortgages. So we think that will continue,\" he said. \n                  Trump takes aim at Fed chair Jerome Powell again and says he 'should be ashamed'\n                 \n                  Tariffs hit US economy forecast but the Fed unmoved by latest Trump threats with no change to interest rates\n                 \n                  Why many assume interest rates will fall further - but no one really has a clue\n                  It comes as the bank reported higher profits than City of London analysts had expected. Half-yearly profit at the lender reached £3.5bn as people borrowed and deposited more. The bank has benefited from high interest rates, set at 4.25% by the Bank of England to control inflation, which have made borrowing more expensive for households and businesses. Over the last six months, the difference between what Lloyds earns on loans and what it pays out rose. Mr Nunn told Sky News the profits were due to increased market share in mortgages and small business lending, as well as productivity improvements. Despite this, Mr Nunn warned the chancellor against raising taxes on financial services, saying it was one of the highest taxed in the world. Chancellor Rachel Reeves is expected to announce tax rises in the autumn as her vow to bring down debt has come under pressure due to the rising cost of borrowing and government spending U-turns."
    },
    {
        "title": "New measure to track pledge to halve violence against women and girls",
        "description": "A new tool for monitoring violence against women and girls (VAWG) has drawn a mixed reaction from campaigners as the government seeks to halve its levels within the next decade. ",
        "url": "https://news.sky.com/story/new-measure-to-track-pledge-to-halve-violence-against-women-and-girls-13401171",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-women-march-trump_6803070.jpg?20250118152507",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-07-24 12:59:00",
        "Headline": "The combined prevalence of domestic abuse, sexual assault and stalking will be used - but campaigners say it doesn't cover the broad spectrum of crimes women face amid a rise in online misogyny. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n A new tool for monitoring violence against women and girls (VAWG) has drawn a mixed reaction from campaigners as the government seeks to halve its levels within the next decade.  The Office for National Statistics's (ONS) new combined estimate of the prevalence of domestic abuse, sexual assault and stalking in England and Wales will be used as the main measure for assessing Labour's landmark goal. Politics Live: Labour is 'full of control freaks', says Corbyn Experts and MPs told Sky News that it was a \"welcome sign\" ministers are taking the manifesto pledge seriously. But there is concern it doesn't capture all crimes that affect women, including femicide and online misogyny, with the End Violence Against Women coalition suggesting the new metric has been created \"for the ease of government\". According to new ONS estimates published on Thursday, about one in eight women aged 16 and over in England and Wales were victims of domestic abuse, sexual assault or stalking in the year to March. It is the first time an estimate has been made of the combined prevalence of domestic abuse, sexual assault and stalking. \n                  France to become first G7 nation to recognise Palestine as a state\n                 \n                  Govt 'shadowy' to reveal Rayner warning about social cohesion in 'readout', Harriet Harman says\n                 \n                  Politics latest: Labour is 'full of control freaks', says Corbyn - as he denies party launch was 'messy'\n                 The figures use data collected as part of the Crime Survey for England and Wales. Labour MP Jess Asato, who previously worked for domestic abuse charity Safelives, told Sky News this is the \"best way\" to measure VAWG as not all victims report crime so police figures \"don't give a view of the actual prevalence\". \"This is a really good sign the government is taking this mission very seriously,\" she said. Ms Asato has recently urged the government to ban \"nudification apps\", which use artificial intelligence to create fake nude images of people without their consent. The Lowesoft MP said the tools \"disproportionately affects girls\" and should be seen for what they are - \"a tool for facilitating digital sexual assault\". It comes amid mounting concern about online misogyny, with MPs warned earlier this summer that deepfake pornography is the next sexual violence epidemic facing schools. Meanwhile Clare Moody, the Association of Police and Crime Commissioners Joint Lead on Victims and VAWG, wrote an article for Policing Insight today in which she said called tackling VAWG \"one of the great societal issues of our time... particularly in a digital era with social media and the online world fuelling so much misogyny and male violence towards women\". 'Created for government ease' Rebecca Hitchen, Head of Policy and Campaigns at End Violence Against Women (EVAW), warned the data being used to assess the government's goal fails to capture the full scale of incidents affecting women. The government's own definition of VAWG includes online crimes such as revenge porn and upskirting, as well as honour-based abuse and female genital mutilation. Ms Hitchen said.\"Our concern is that this measure has been created for the ease of government, rather than trying to truly represent the scale and impact of violence against women and girls. \"Questions must be asked about the extent to which this measure may impact on funding decisions, as the government's choice to assess itself on this basis may dictate the direction of resources.\"  EVAW are now calling for a consultation to open so that women's groups can discuss with the government how best to measure its commitment. Labour's 2024 manifesto pledged that they would \"halve violence against women and girls in a decade\" by using \"every government tool available to target perpetrators and address the root causes of abuse and violence\". A number of policies have since been announced to tackle what Prime Minister Sir Keir Starmer has called a \"national emergency\". Read More:'I earned six-figures - but was left without a penny to escape husband who was ready to kill me'Domestic abuse specialists placed in 999 control rooms after women's murders More details about the VAWG strategy and how its progress will be monitored will be set out in September. Home Secretary Yvette Cooper said: \"As part of our mission to tackle the national emergency of Violence Against Women and Girls, we have made sure that for the first time the figures are being recorded in a combined way, showing that 1 in 8 women were victims of domestic abuse, stalking or sexual assault last year. \"That is why we have already started to put domestic abuse specialists in 999 control rooms, invested in major new perpetrator programmes, and why we are publishing a transformative cross-government VAWG strategy in September, because everybody has a right to feel safe on our streets.\""
    },
    {
        "title": "Thousands of cancer cases could be prevented with more breast removal surgeries, study suggests",
        "description": "Thousands of cancer cases could potentially be prevented if more women were offered breast removal surgery, according to a study.",
        "url": "https://news.sky.com/story/thousands-of-cancer-cases-could-be-prevented-with-more-breast-removal-surgeries-study-suggests-13401269",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-breast-mammogram-breast-cancer_6972788.jpg?20250724171527",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-07-24 15:41:00",
        "Headline": "A specialist nurse says the study gives \"valuable insights\" but women should consider all options.",
        "Content": "Thousands of cancer cases could potentially be prevented if more women were offered breast removal surgery, according to a study. A mastectomy is offered to some people who already have breast cancer, but research suggests about 6,500 cases could be prevented each year if more preventative procedures were done. Risk-reducing mastectomies (RRM) are currently only an option for women with the BRCA1, BRCA2, PALB2 genes. But the study says people with other genes - including ATM, CHEK2, RAD51C, RAD51D - might benefit if they also have other high-risk factors. These include family history of the disease, whether they breast fed, mammogram density and the number of children they've had. Researchers suggest that if all women 30 to 55 with a risk of 35% or more could be identified - and they all then had RRM - an estimated 6,538 cases could be prevented each year. That equates to about 11% of the 59,000 UK women diagnosed annually. \n                  Dermot Murnaghan 'fell through the gaps' with prostate cancer diagnosis\n                 \n                  We are entering 'golden age' of cancer treatment - and also facing a less gilded era too\n                 \n                  Many cancers no longer 'a death sentence' as treatment on 'cusp of golden era', NHS England medical director says\n                 The economic evaluation by Queen Mary University of London and the London School of Hygiene and Tropical Medicine (LSHTM) said it would be a cost effective strategy. It added that women carrying one of the other genes linked to breast cancer could potentially be found by \"cascade testing\", in which tests are offered to family members. One of the authors said it was the first time a risk factor for offering RRM had been defined. \"Our results could have significant clinical implications to expand access to mastectomy beyond those patients with known genetic susceptibility in high penetrance genes - BRCA1/ BRCA2/ PALB2 - who are traditionally offered this,\" said Professor Ranjit Manchanda, professor of gynaecological oncology at Queen Mary. \"We recommend that more research is carried out to evaluate the acceptability, uptake, and long-term outcomes of RRM among this group,\" he added. Read more from Sky News:Antarctica's oldest ice arrives in UK for analysisBabies born with DNA from three people in the UK Louise Grimsdell, Breast Cancer Now senior clinical nurse specialist, stressed that women should consider all options - not just surgery. \"While this modelling provides valuable insights into the cost-effectiveness of risk-reducing mastectomy for women with a high risk of developing breast cancer, each individual must be offered all risk-management options that are suitable for them,\" she said. \"Choosing to have risk-reducing surgery is a complex and deeply personal decision that comes with emotional and physical implications,\" added Ms Grimsdell. \"So, it's vital women can consider all their options, including screening and risk-reducing medications, and are supported by their clinician to make an informed decision that's right for them. \"It's also crucial that the unacceptably long waits that far too many women who chose risk-reducing surgery are facing are urgently tackled.\" The study appears in the journal JAMA Oncology."
    },
    {
        "title": "Silicon Valley's gamble to back Trump pays off after president unveils AI action plan",
        "description": "Silicon Valley's gamble to back Donald Trump just paid off. Big time.",
        "url": "https://news.sky.com/story/silicon-valleys-gamble-to-back-trump-pays-off-after-president-unveils-ai-action-plan-13401057",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-trump-ai_6972399.jpg?20250724104724",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-07-24 09:25:00",
        "Headline": "Donald Trump's 28-page AI strategy, \"Winning the AI Race: America's AI Action Plan,\" is a streamlined, focused, and recommendation-heavy policy document, backed by three new executive orders.  ",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  Silicon Valley's gamble to back Donald Trump just paid off. Big time. The president's 28-page AI strategy, \"Winning the AI Race: America's AI Action Plan\", is a streamlined, focused, and recommendation-heavy policy document, backed by three new executive orders. It reads as if it was written by Silicon Valley to turn its demands for AI into national policy - because it was. The man behind the plan, David Sacks, the White House AI and cryptocurrency tsar, is a founding partner of PayPal and a high-profile tech investor. With its call for deregulation, infrastructure investment and more relaxed AI export rules, the plan is designed to turbocharge big tech's bet on increasingly powerful generative AI. For a president dedicated to putting America first, it's a sensible plan. The dominance of US big tech, from social media to the fastest and best computer chips, is undeniable. Given the potential size of the AI prize, removing red tape to boost the development of AI is surely a good thing. Slashing environmental and planning requirements for AI datacentres and energy infrastructure to power them, then removing red tape around the development and use of AI in finance, healthcare, the workplace and scientific research will surely see America reap those rewards first and cement its role as the AI superpower. \n                  Donald Trump declares US is going to 'win' AI race as administration unveils action plan\n                 \n                  Tech giant OpenAI signs deal with government to boost efficiency in public services\n                 \n                  Routine eye scan 'could predict 10-year heart attack and stroke risk', University of Dundee study suggests\n                 The ostensible threat to its dominance is China. By stimulating the development of the best AI models in the US, and removing blocks on the export of US-developed AI technology like certain high-performance computer processors imposed by the last administration, the plan hopes to embed US-built AI into the global economy ahead of Chinese technology. While Silicon Valley may have staged a coup in terms of federal policy, the plan doesn't necessarily fix its bet on AI. The likes of Meta, Microsoft, Open AI, Google, Apple and X are investing hundreds of billions of dollars in AI and its associated energy-hungry infrastructure. But, so far at least, have realised profits that are an order of magnitude less. Most companies and individuals are still trying to figure out how to use generative AI. The money behind that massive AI investment is starting to get nervous. Action plan doesn't guarantee success Critics of big tech go as far as to say the urgency of the \"race\" that the action plan is designed to win was dreamt up by Silicon Valley lobbyists to persuade an America-first White House to do their bidding before the AI bubble bursts. Trump's AI action plan should help calm their nerves, but it doesn't necessarily guarantee success. Despite promising to slash red tape and prioritise AI datacentres stuck in years-long queues to access America's ageing electricity grid, the AI action plan says nothing of who is going to finance it. American consumers may react badly if their utility bills soar to pay for the quintupling of energy infrastructure America's AI industry is forecast to require, especially if the AI isn't benefiting them. As written, the AI action plan doesn't seem particularly concerned about that at all. It mentions re-training for workers displaced by AI, but no mechanism to pay for it. More importantly, it vows to remove regulations that limit the adoption of AI, to the point of threatening to remove federal funding from states that do. Read more from Sky News:US and Japan agree trade deal - EU more optimisticMan who killed four university students jailed for life Some of those laws might be holding back the adoption of technology that could benefit consumers or make local government more efficient. Many of them, however, protect consumers by ensuring their data isn't exploited, tech firms don't steal their intellectual property to improve their AI, their access to healthcare or insurance isn't unfairly controlled by an algorithm, or their local environment isn't destroyed by data centres' insatiable demand for energy and water for cooling. Ordinary Americans may end up serving AI, not the other way round."
    },
    {
        "title": "Satellite tracker Spaceflux reaches lift-off with £5m funding boost",
        "description": "A British space surveillance company which has won a string of government contracts will this week announce a &#163;5.4m fundraising to expand its global network of advanced telescopes.",
        "url": "https://news.sky.com/story/satellite-tracker-spaceflux-reaches-lift-off-with-1635m-funding-boost-13401077",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-telescope-spaceflux_6972415.jpg?20250724105814",
        "type": "Technology",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-24 09:52:00",
        "Headline": "The British-based provider of space-related technology to the MoD will announce on Friday that it has secured £5.4m in a round led by the UK Innovation & Science Seed Fund, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A British space surveillance company which has won a string of government contracts will this week announce a £5.4m fundraising to expand its global network of advanced telescopes. Sky News understands that Spaceflux, which was founded three years ago, has secured the injection of capital in a round led by the UK Innovation & Science Seed Fund (UKI2S), which is managed by Future Planet Capital, as well as Foresight Group and Blackfinch Ventures. Seraphim Space, the listed specialist investor in space-related companies, is also contributing funding. Money blog: Renowned chef thinks luxury item should be wiped off menus Spaceflux uses artificial intelligence and optical sensors to track satellites and debris across all orbits, with its daylight tracking capability meaning it can expand the observation window beyond night-time operations. Its provision of space situational awareness technologies is in growing demand amid warnings that a week-long disruption to satellite navigation could incur a £7.6bn hit to the UK economy. In a statement to Sky News, Marco Rocchetto, CEO and co-founder of Spaceflux, said: \"As space becomes increasingly essential to our economy, environment and daily lives, it is also becoming more congested and contested. \n                  Lloyds Bank's Charlie Nunn expects two more interest rate cuts in 2025\n                 \n                  Trade war uncertainty prompts halt to eurozone rate cuts\n                 \n                  Money blog: BT and EE customers facing outages; 25% house price rise forecast\n                 \"This investment strengthens our ability to protect satellite technology that delivers crucial insights to Earth around the clock, reducing collision risks, and supporting a safer, more sustainable space environment for future generations\". The valuation at which the funding was being committed was unclear on Thursday. Spaceflux, which serves government and commercial customers, has been the exclusive provider of geostationary satellite tracking for the Ministry of Defence and UK Space Agency since 2023. Read more on Sky News:Tesla looks to cheaper modelWelfare versus warfare: Why PM must choose Alex Leigh, an investment director at UKI2S, said: \"This investment marks a significant step in the convergence of defence and space, where dual-use technologies are becoming increasingly important to UK capability. \"Spaceflux's technology offers critical insights to help monitor and safeguard orbital assets - supporting both national security and the wider commercial ecosystem. \"The company is well-positioned to scale its impact and meet the needs of customers navigating an increasingly complex space environment.\""
    },
    {
        "title": "Hulk Hogan dies aged 71",
        "description": "The legendary WWE wrestler Hulk Hogan has died aged 71.",
        "url": "https://news.sky.com/story/wrestling-star-hulk-hogan-has-died-13401278",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-hulk-hogan_6972794.jpg?20250724171654",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-24 15:44:00",
        "Headline": "Hogan is perhaps the most iconic star in WWE's five-decade history - with his distinctive blonde moustache and colourful headbands helping him become a pop culture phenomenon. ",
        "Content": " The legendary WWE wrestler Hulk Hogan has died aged 71. Police have said emergency services responders treated Hogan at his home in Clearwater, Florida, for cardiac arrest at around 10am local time (3pm UK time) today but he died in hospital around an hour and 15 minutes later. Hogan, whose real name was Terry Bollea, is perhaps the most iconic star in WWE's five-decade history - known for his distinctive blonde moustache and colourful headbands. His charisma and theatrics in the ring are credited with helping to transform professional wrestling into a family entertainment sport. Hogan was the main draw for the first-ever WrestleMania in 1985 and was a fixture for years in its signature event, facing everyone from Andre The Giant and Randy Savage to The Rock and even company chairman Vince McMahon. He claimed his first WWE world championship by defeating the Iron Sheik in 1984. Hogan went on to win five more world championships and was inducted into the WWE Hall of Fame in 2005 by Sylvester Stallone. \n                  Hungary bans Irish rap group Kneecap from entering country over 'antisemitic hate speech'\n                 \n                  'A local lad done good': Fans remember Ozzy Osbourne in his hometown of Birmingham\n                 \n                  Ozzy Osbourne obituary: Heavy metal, reality TV, and biting bats – the wild life of Birmingham's Prince Of Darkness\n                 Undertaker among WWE icons to pay tribute WWE said in a post this evening: \"WWE is saddened to learn WWE Hall of Famer Hulk Hogan has passed away. One of pop culture's most recognizable figures, Hogan helped WWE achieve global recognition in the 1980s. WWE extends its condolences to Hogan's family, friends, and fans.\" Hogan's friend and fellow former professional wrestler, Ric Flair, wrote on X: \"I am absolutely shocked to hear about the passing of my close friend @HulkHogan! Hulk has been by my side since we started in the wrestling business. \"An incredible athlete, talent, friend, and father!\" Mr McMahon wrote on X after Hogan's death: \"The world lost a treasure today. Hulk Hogan was the greatest WWE Superstar of ALL TIME, someone who was loved and admired around the world... He leaves us with one of his favourite expressions, 'Train, take your vitamins and say your prayers.' Today, we pray for him.\" WWE icon The Undertaker wrote on X: \"The wrestling world has lost a true legend. His contributions to our business are immeasurable and for that I am appreciative. Thank you, Hulk Hogan.\" Former WWE wrestler Triple H wrote on social media in a tribute to Hogan: \"He was the archetype of what it meant to be a 'Superstar' - a global sensation that inspired millions to work hard at whatever it was they wanted to accomplish and a look that made him recognizable to fans around the world.\" Hogan goes to Hollywood The wrestler was also able to transcend his \"Hulkamania\" fanbase to become a celebrity outside the wrestling world, appearing in numerous movies and television shows, including a reality show about his life on VH1, Hogan Knows Best. His notable movie appearances include playing Thunderlips in Rocky III and Shep Ramsey in Suburban Commando. In 2024, he appeared at the Republican National Convention to endorse the presidential bid of Donald Trump. Hogan said he made the decision to support the Republican candidate after seeing his combative, fist-pumping reaction to an attempted assassination on the campaign trail. In a reference to so-called \"Hulkamania\", he ripped off his shirt to reveal a Trump tank top and bellowed to a cheering crowd: \"Let Trumpamania run wild, brother... Let Trumpamania rule again!\" The US president paid tribute to Hogan in a Truth Social post today, writing: \"We lost a great friend today, the 'Hulkster'. Hulk Hogan was MAGA (Make America Great Again) all the way - Strong, tough, smart, but with the biggest heart. He gave an absolutely electric speech at the Republican National Convention, that was one of the highlights of the entire week. He entertained fans from all over the World, and the cultural impact he had was massive. To his wife, Sky, and family, we give our warmest best wishes and love. Hulk Hogan will be greatly missed!\" US vice president JD Vance has also paid tribute, writing on X: \"Hulk Hogan was a great American icon. One of the first people I ever truly admired as a kid. The last time I saw him we promised we'd get beers together next time we saw each other. The next time will have to be on the other side, my friend! Rest in peace.\" Hogan's support of Trump did not go down well with all wrestling fans and it was far from his only controversy. The gossip website Gawker posted a video in 2012 of him having sex with his former best friend's wife. Hogan sued on privacy grounds and was awarded a $140m judgement in 2016. A year earlier he was suspended by the WWE after another secret recording revealed that Hogan had used a racial slur. He was reinstated in 2018. The making of a pop culture phenomenon Born in the US state of Georgia in August 1953, Hogan played bass guitar in local bands before getting involved in the wrestling scene in Florida in the 1970s. The young wrestler, who later admitted to taking anabolic steroids during his career, gained notoriety as his biceps turned into what he dubbed the \"24-inch pythons\". The \"Hulk\" moniker came from comparisons to the comic-book hero portrayed on TV at the time. He would end up paying royalties to Marvel Comics for years. \"Hogan\" was the invention of Mr McMahon, the owner of what was then called the World Wrestling Federation (WWF), who wanted Irish representation among his stable of stars. Hogan was married three times and had two children. In an update at 1.47pm local time (6.47pm UK time), Clearwater Police Major Nate Burnside said there were \"no signs of foul play or suspicious activity\" in relation to the wrestler's death. He added that Hogan's family are being supported."
    },
    {
        "title": "Hungary bans Irish rap group Kneecap from entering country over 'antisemitic hate speech'",
        "description": "Hungarian authorities have banned the Irish rap group Kneecap from entering the country, accusing them of engaging in \"antisemitic hate speech\" and \"supporting terrorism\".&#160;",
        "url": "https://news.sky.com/story/hungary-bans-irish-rap-group-kneecap-from-entering-country-over-antisemitic-hate-speech-13401238",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kneecap-belfast_6894896.jpg?20250423181336",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-24 15:01:00",
        "Headline": "Budapest stated that the band's appearance posed a \"national security threat\", while Kneecap said the ban was an attempt to \"silence those who call out genocide\" against Palestinians.",
        "Content": "Hungarian authorities have banned the Irish rap group Kneecap from entering the country, accusing them of engaging in \"antisemitic hate speech\" and \"supporting terrorism\".  Kneecap were set to perform at the Sziget Festival, taking place from 6 to 11 August in Budapest. The Belfast-based band, which often shares pro-Palestinian messages during its shows, has attracted controversy in recent months after accusing the Israeli government of committing \"genocide\" in Gaza. Hungarian government spokesman Zoltan Kovacs said on Thursday that the band's members \"repeatedly engage in antisemitic hate speech supporting terrorism and terrorist groups\". \"Hungary has zero tolerance for antisemitism in any form,\" Kovacs said on X, adding that the band's planned performance \"posed a national security threat,\" and the band has therefore been formally banned from entering Hungary for three years. \"If they enter, expulsion will follow under international norms,\" Kovacs added. Responding to the spokesman's comments, Kneecap said \"there is no legal basis\" for Hungary's decision and that \"no member of Kneecap has ever been convicted of any crime in any country\". \n                  British surgeon claims IDF shooting Gazans in specific areas - 'almost like a game of target practice'\n                 \n                  Inside Gaza's Nasser Hospital - where there's virtually no food for malnourished children\n                 \n                  France to become first G7 nation to recognise Palestine as a state\n                 \"It is clear that this is a political distraction and a further attempt to silence those who call out genocide against the Palestinian people,\" the band said in a statement on X. During Kneecap's gig at Britain's Glastonbury Festival in June, frontman Liam Óg Ó hAnnaidh, performing under the stage name Mo Chara, accused Israel of war crimes in Gaza. Ahead of the gig, Prime Minister Keir Starmer said he doesn't think Kneecap's planned performance was \"appropriate\". Following Kneecap's performance at Glastonbury, a criminal investigation was launched into comments made on stage by the trio. However, police ultimately decided not to pursue further action, citing \"insufficient evidence to provide a realistic prospect of conviction for any offence\". Kneecap called the investigation \"political policing intimidation\". Mo Chara has been formally charged with a terrorism offence after allegedly displaying a flag in support of the militant group Hezbollah during a gig in November. He denies the offence. Hezbollah is designated as a terrorist organisation by the UK and the US."
    }
]