[
    {
        "title": "Military action in Greenland 'always an option' says White House",
        "description": "Using the military to take Greenland is \"always an option\" the White House says, amid mounting tension over Donald Trump's plans for the territory.",
        "url": "https://news.sky.com/story/military-action-in-greenland-always-an-option-says-white-house-13491330",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/d8e87493b7d85a48cf7cc96d235b8325d995d88a7ceb256b12554b878890f99a_7127964.jpg?20260107021120",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-06 22:19:00",
        "Headline": "A statement from the Trump administration said utilising the US military was one of a range of options open to the president regarding Greenland.",
        "Content": "Using the military to take Greenland is \"always an option\" the White House says, amid mounting tension over Donald Trump's plans for the territory. The US president has been vocal about his desire to annex the self-governing island, despite it being part of Denmark - a NATO ally. In recent days, Danish Prime Minister Mette Frederiksen has warned that US military action to seize the territory would spell the end of NATO. But now a statement from the White House has defended a military approach, insisting that it is \"always an option\" open to the president. The statement said: \"President Trump has made it well known that acquiring Greenland ‌is a national security priority ‌of the United States, and it's vital ​to deter our adversaries in the Arctic region. \"The ‍president and his team are discussing a range of options to pursue this important ‌foreign policy goal, ⁠and of course, utilizing the ‌US military is ‍always an option at the commander-in-chief's disposal.\" The foreign ministers of Denmark and Greenland have requested a meeting with US secretary of state Marco Rubio. Trump: We need Greenland Fears that the US will act against Greenland have mounted following the arrest of Venezuelan president Nicolas Maduro in an audacious American raid on Caracas. Mr Trump has justified his actions on the international stage by citing the Monroe Doctrine - a US policy named after former president James Monroe, who asserted the right of his country to intervene in foreign affairs across the Americas in its own interest. And with the door left open to further interventions in the western hemisphere, the president has reiterated his territorial ambitions for Greenland. On Monday, he spoke to Sky's US partner network NBC News about Greenland, saying that \"we need it for national security, right now\". US threats 'not going away' With tensions mounting, Prime Minister Sir Keir Starmer has joined other leaders from Europe and Canada in throwing his weight behind Ms Fredriksen and Denmark, saying \"I stand with her. She's right about the future of Greenland.\" But a senior US official told Reuters that opposition from other NATO leaders would not stop the push to bring Greenland under US control. \"It's not going away,\" the official said, speaking on condition of anonymity. Read more:There's a sense in Greenland that US may now take it overTrump has ripped up the rule book, where could US strike next? How could US take Greenland? One option described was the outright purchase of the territory. They said: \"Diplomacy is always the president's first option with anything, and dealmaking. \"He loves deals. So if a good deal can be struck to acquire Greenland, that would definitely be his first instinct.\" Another option involved creating a ‌Compact of Free Association (COFA) between the US and Greenland. The US already has COFA deals with three Pacific Island nations, giving America military access in exchange for financial aid. The official added that Mr Trump wants to acquire Greenland during his current term in office."
    },
    {
        "title": "UK weather: Heavy snow on the way via first named storm of 2026",
        "description": "Britain's first named storm of the year is set to strike this week, bringing heavy snow and strong winds as a new year cold snap continues to bite.",
        "url": "https://news.sky.com/story/storm-goretti-to-bring-heavy-snow-and-strong-winds-to-the-uk-13490981",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-northumberland-weather_7127968.jpg?20260106114416",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-06 09:00:00",
        "Headline": "Warnings issued by the Met Office, with the first named storm of the year due to arrive after the coldest night of winter so far saw UK temperatures drop as low as -12.5C.",
        "Content": "Britain's first named storm of the year is set to strike this week, bringing heavy snow and strong winds as a new year cold snap continues to bite. The French meteorological service, Meteo France, has named it Goretti - and the south of the UK is expected to be most heavily affected on Thursday and Friday. Sky News meteorologist Dr Christopher England said the \"exact storm track is a little uncertain\" but the \"most likely scenario is heavy rain spreading from the southwest on Thursday turning to snow from around Wales across to East Anglia\". He said \"significant falls\" were likely, along with \"severe gales around southern coasts\". As it happened: 'Multi-hazard' event on way this week The UK Health Security Agency (UKHSA) has extended its amber cold health alerts across England until midday on Sunday. The warnings came after what the Met Office has reported as \"the coldest night of the winter so far,\" and as a major incident was declared in Aberdeenshire. Aberdeenshire council said that expects a \"prolonged period of significant impacts\" over the weather, warning of: • Travel delays on roads are likely, stranding some vehicles and passengers;• Some delays and cancellations to rail and air travel are likely;• There is a good chance that some rural communities could become cut off;• Injuries from slips and falls are likely on icy surfaces;• Untreated pavements and cycle paths likely to be impassable;• There is a good chance that power cuts may occur, with the potential to affect other services, such as mobile phone coverage. Check the latest weather forecast where you are New weather warnings issued by Met Office The Met Office has issued fresh weather warnings for Wednesday, Thursday, and Friday. Three yellow warnings are in effect on Wednesday. One, for ice, covers Northern Ireland. A second warning for snow and ice is also in effect across northern mainland Scotland, part of the Outer Hebrides, and the Orkney Islands. And a third - for ice - covers much of the rest of the UK, except southwest England and the west coasts of Wales and Scotland. Thursday sees two new yellow warnings: One for wind in the southwest of England, and one for snow in much of Wales, the Midlands, Bath and Bristol, and Oxford. The snow warning lasts until midday on Friday, and warns that in some areas \"5-10 cm of snow may settle with the potential for up to 20 cm in some locations, especially over higher ground\". Two amber warnings for snow were in effect in Scotland throughout Tuesday, as hundreds of schools in Shetland, Orkney, and Aberdeenshire remained shut. Read more from Sky News:Maduro says he is 'prisoner of war' - as Trump reactsGovernment plans new driving rule for over-70s Meanwhile, Monday night was \"the coldest night of the winter so far,\" according to the Met Office, after a low temperature of -12.5C (9.5F) was recorded in Marham, Norfolk. Those waking up in London at 5am faced temperatures down to -5C (23F), with overnight lows of -11.2C (11.84F) in Dalwhinnie, in the Scottish Highlands. In a post on social media, the Met Office said: \"Last night was the coldest night of the winter so far, making it a very cold and frosty start for most of us this morning.\" National Rail said that train services in northern Scotland will be disrupted until the end of the day on Tuesday."
    },
    {
        "title": "Learner drivers face longer waits for tests under new rules",
        "description": "Bereaved families and the AA say the government's long-awaited strategy to cut roads deaths does not go far enough, with \"missed opportunities\" to save young drivers.",
        "url": "https://news.sky.com/story/drink-drive-limit-to-be-lowered-and-new-restriction-on-learners-road-safety-plans-revealed-13491340",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-learner-driving-file-pic_7128532.jpg?20260107021416",
        "type": "Home",
        "Author": "Dan Whitehead",
        "Date Published": "2026-01-06 22:49:00",
        "Headline": "Edmund King, president of The AA, told Sky News the new strategy was \"welcome\" and \"ambitious\", but fell short on protecting young motorists.",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n Bereaved families and the AA say the government's long-awaited strategy to cut roads deaths does not go far enough, with \"missed opportunities\" to save young drivers. The Road Safety Strategy published today includes plans for mandatory eye-tests for the over 70s, lowering the drink-drive limit in England and Wales, and to consult on a minimum learning period for new motorists of up to six months before taking a driving test. The government says this will give learner drivers more time to develop their skills, with statistics showing nearly a quarter of deaths and serious injuries on Britain's roads involve drivers aged 17-24, despite only making up around 6% of licence holders. But campaigners say the measure falls short of what could have been achieved. Nicole and Chris Taylor's daughter Rebecca was just 18 when she died in a car crash in Northamptonshire in 2008. \"If the government thinks this is enough for us - it's not enough, there's a lot more that should have been done and can be done,\" Nicole said. Chris said he was disappointed by the strategy. \"Having a longer learning period would be a good idea,\" he added. \"But the reality of this is that we have to let young drivers on their own at some point, therefore we need to protect them when that happens.\" The couple - along with hundreds of other families - have spent years campaigning for so-called Graduated Driving Licences (GDL) to be introduced. 'Missed opportunity' In countries such as Australia and Canada, GDLs see restrictions placed on newly-qualified drivers in their first few months of being behind the wheel, such as a limit on passenger numbers and a ban on driving late at night - factors that often feature in serious collisions. The measures have been proven to reduce serious injuries and deaths. Edmund King, president of The AA, told Sky News the new strategy was \"welcome\" and \"ambitious\", but fell short on protecting young motorists. He said: \"We've spoken to colleagues in Canada and Australia about GDLs and the one measure that they all tell us saves the most lives is limiting the number of same age passengers from a car for six months. \"We think that would have been a small price to pay and would save over 50 lives a year, so I think it is a missed opportunity.\" Read more:Worst areas for uninsured driving revealedSeven red flags your mechanic is ripping you off New strategy 'a turning point', says minister The government hopes the measures in the strategy - the first major reform to road safety in nearly two decades - will reduce deaths and serious injuries by 65% by 2035. Transport Secretary Heidi Alexander said: \"Every life lost on our roads is a tragedy that devastates families and communities. For too long, progress on road safety has stalled. This strategy marks a turning point. \"We are taking decisive action to make our roads safer for everyone, from new drivers taking their first lessons to older motorists wanting to maintain their independence. The measures we are announcing today will save thousands of lives over the coming decade.\" The government says the current drink drive limit is the highest in Europe and has not been changed since 1967 - with drink-driving accounting for one in six road fatalities in 2023. It says it'll explore preventative technology, such as alcohol interlock devices, which can include breathalysers attached to a vehicle's ignition. A new Road Safety Board, chaired by the minister for local transport, will be created to oversee delivery of the strategy."
    },
    {
        "title": "Feeling ignored, bad behaviour by staff and long-term trauma: What you told us about your maternity experiences",
        "description": "\"I did everything I was supposed to do. I attended my appointments. I raised concerns. I listened to professionals. I trusted the system. And that trust very nearly killed me.\"",
        "url": "https://news.sky.com/story/feeling-ignored-bad-behaviour-by-staff-and-long-term-trauma-what-you-told-us-about-your-maternity-experiences-13491236",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-maternity-care-data-x-forensics_7128308.png?20260106174141",
        "type": "Home",
        "Author": "Daniel Dunford, Kaitlin Tosh and Joely Santa Cruz, Sky News Data x Forensics team",
        "Date Published": "2026-01-06 16:47:00",
        "Headline": "Hundreds of you got in touch with Sky News to share your experiences. We read all of your messages. Here's what you told us.",
        "Content": "By Daniel Dunford, Kaitlin Tosh and Joely Santa Cruz, Sky News Data x Forensics team  \"I did everything I was supposed to do. I attended my appointments. I raised concerns. I listened to professionals. I trusted the system. And that trust very nearly killed me.\" Those are the words of Louise Prashad, one of more than 180 people who wrote to Sky News to share their birth stories, after we covered the stories of three women who had suffered traumatic maternity experiences. Almost all the people who wrote in - more than 90% of the accounts we analysed - said they felt ignored or not listened to at some point by the healthcare workers who they had put their faith in during one of the most intimate and significant moments in their lives. More than four in five listed staff behaviour that was actively detrimental. For example, staff shouting at them or physically assaulting them in response to making loud noises during childbirth, or in one case telling a new mother not to ring the help bell for a couple of hours because there was a big football match on. More than two thirds of people who wrote to us said they have had long-term mental trauma as a result of their childbirth experiences, while almost half said their babies were harmed as a result of what happened to them. The impact of the birth trauma was not limited to mothers and babies. Many of the testimonies we received came from the partners, parents, siblings or other children of those giving birth, explaining how they too were left traumatised by what happened to their loved ones. These experiences often led to marriages or other relationships breaking down, or the inability to add further children to the family. The accounts we received are not representative of the normal childbirth experience, as measured in a recent survey by the Care Quality Commission (CQC). But the fact so many people reported similar experiences, and they have clearly had such a long-term impact, show how important the issue is. Many of the issues raised by our readers also echoed the findings of the CQC report. One in five respondents to that survey said they felt their concerns during labour were not taken seriously. One in four said they didn’t feel that postnatal mental health support was sufficient. Deaths during childbirth “By the time anyone listened, it was too late. Daniel had died.\" Deaths of mothers or babies are still fortunately very rare during childbirth, but the risks are higher for older mothers, black and Asian women, and women in the most deprived parts of the UK. The difference in death rates among newborns, comparing the most and least deprived areas, has been getting steadily wider over the last five years. As of 2023, a baby born in one of the most deprived parts of the country was 2.4 times more likely to die in childbirth compared with a baby born in one of the least deprived parts of the country. A few of the people who wrote to us explained that they had bad experiences giving birth in the UK, but better experiences with either earlier or subsequent children in other countries, like Ireland, Italy, and Australia. These examples are individual experiences, but UN data does show while health outcomes for mothers in most parts of the world have got considerably better in recent decades, they have been getting worse in the UK. Royal correspondent After years of warnings, reviews, and mounting pressure, 2026 could be a pivotal moment for maternity services. We've long-known maternity care is in crisis. It is a vital service but one which is under sustained strain. And in some cases, failing mothers and babies with tragic consequences. Multiple national investigations over the last decade have highlighted serious failings. Each report written has made several recommendations, and yet the system still struggles. Fundamental change is long overdue, and it could come with the publication of the Amos review. Baroness Amos is looking into system-wide issues, to understand why problems persist, and what needs to change. But there is already scepticism as to what the review will achieve.  Sky News has received hundreds of emails from families sharing their birth traumas. All similar stories, each one harrowing. Many families feel deep mistrust, telling us we've been here before, and lessons haven't been learnt. There's a lot of pressure to get this right, and progress will be judged by positive outcomes not promises. Of the 186 countries the UN collects data for, the UK was one of only 14 where maternal mortality rates were higher in 2020 than they were in 1985. The US and Canada were also in that group, while Cyprus and Finland were the only other European countries represented. Over that time, the UK has fallen from having the ninth-lowest maternal mortality rate in the world to now being 42nd on that list. How outstanding staff made awful experiences bearable While most of the people who felt compelled to write to us shared bad or traumatic experiences, there were also positive stories to tell. One woman wrote about how fear of NHS hospitals meant her daughter-in-law had her two children at home. She said both children were born safely and successfully. There were many others who praised individual staff members for making their otherwise awful experiences bearable. \"On 8 April 2023, during the night shift, a gynaecology student from University College London (UCL), a blonde male, was present in theatre. He held my hand and gently stroked my forehead during the whole time I was haemorrhaging,\" said one woman. \"I still look for his face in the crowd every time I walk pass UCL, I don't know his name, but he was the single person who made me feel I was still alive. If you ever read this, thank you.\" If you have suffered from birth trauma and would like to share your story, contact Sky News by messaging us on WhatsApp +44 7583 000853 or emailing news@skynews.com. The Data x Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Number of written questions to government departments doubles in a year",
        "description": "Key Whitehall departments had to answer almost twice as many questions from MPs and peers in 2025 as the year before - with AI blamed for the massive rise, Sky News can reveal.",
        "url": "https://news.sky.com/story/number-of-written-questions-to-government-departments-doubles-in-a-year-13491299",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-james-mcmurdock-mp_7004903.jpg?20250829182503",
        "type": "Home",
        "Author": "Sam Coates",
        "Date Published": "2026-01-06 20:43:00",
        "Headline": "A senior government source has suggested MPs may be using AI to submit written questions to ministers.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Key Whitehall departments had to answer almost twice as many questions from MPs and peers in 2025 as the year before - with AI blamed for the massive rise, Sky News can reveal. MPs have been accused of diverting resources and wasting public money after the number of Written Parliamentary Questions (WPQs) rose to 90,331, up from 49,125 in 2024, which was close to the average for the previous decade. Politics latest - follow live The Department for Health and Social Care saw a 97% increase in questions compared to the previous year. The Home Office saw a 92% increase, the Department for Education saw a 97% increase, and the housing department saw a 101% increase. Submissions from some MPs surged 10 or 20-fold in the second half of 2025 compared to the same period the year before, following the general election. Just 10 MPs accounted for 20% of the Commons WPQs submitted in the second half of 2025. These included a Lib Dem MP, Al Pinkerton, whose use increased more than 20-fold from 36 to 721, and independent MP James McMurdock, who on 2 January alone saw 342 questions tabled in his name on a range of subjects from Palestine funding to road deterioration and the UK-Italy young leaders programme. All MPs we spoke to strongly rejected any claim that their questions waste time or are not in the public interest, and no MPs admitted to using AI in their questions. The increase was confined to pockets of the Commons, and there was no massive difference in the number of WPQs submitted by members of the House of Lords over the two periods compared. Many MPs believe WPQs are an essential tool for extracting critical information from government departments. Some told Sky News the growth in questions stemmed from the government's failure to answer their first attempts, while a number of new MPs said they were learning the system. Is AI behind the rise? But senior government sources have launched an extraordinary attack on MPs for the growth of questions - which they believe could be time-wasting. \"Some of the WPQs we are seeing are so obscure, and others are so generic, that you're regularly left wondering how any MP would have come up with them, and perhaps the answer is that they haven't,\" a senior source said. \"Put it this way: when we look at the increase in WPQs from some MPs, the random variety of subjects they're asking about, and the lack of any apparent rationale behind their questions, we ask ourselves: how would this look any different if all their WPQs were being generated by AI? And the truth is it wouldn't.\" Sky News has been told by multiple government sources they believe they are seeing the increased use of AI tools to generate written questions. They suggest an MP with a general interest in a subject may ask an AI tool to give them 10 questions to ask the government about it, or - if they simply want to get their numbers up in a hurry - may ask AI to provide them with multiple questions asking the government about its performance across a range of different areas. Read more from Sky News:UK agrees to send troops to Ukraine'Humiliating' defeats for Chagos deal However, one MP whose use of written questions has increased 10-fold in a year showed Sky News how he keeps a written list on his phone of every subject he wants to ask about and denied ever using AI to write them for him. Ben Obese-Jecty, Tory MP for Huntingdon, tabled 150 questions in the second half of 2024 and 1,683 in the same period a year later. He said if Whitehall wanted to reduce the number of questions, they should give better answers the first time they are asked. 'It's like a chess game' \"My message to those in government who are complaining about the volume of questions is: answer them properly, ensure that we can hold the government to account and maybe the number of questions that you have to suffer responding to will reduce,\" he told Sky News. \"I know that I personally don't use AI to write questions. I have a running list on my phone and as questions come up during the day I will make a note of something that I want to ask the government to get some more clarity on it.\" Sky News challenged Mr Obese-Jecty why he asked about such a variety of topics, including the impact on the grocery industry of weight loss drugs. \"All of the questions are certainly valid, and if they weren't valid, they wouldn't be allowed to be tabled in the first instance,\" he replied. \"A lot of those questions are [there because it's] like a chess game, and each question is effectively an opening gambit in a back and forth where you will ask a question and then slowly drill down into a topic.\" Civil servants 'spending half their time' with WPQs Under the current rules, MPs can submit up to 20 written questions electronically each day. There is currently an inquiry by the Commons Procedure Committee into WPQs, which could change this limit. The Whitehall source said: \"People think civil service departments are these huge bureaucracies where there are endless numbers of staff waiting to churn out answers to WPQs and FOI [Freedom of Information] requests. \"But the truth is the individual units in charge of each specific area are fairly small, and too many important civil service teams are currently spending half their time dealing with WPQs. \"MPs mean well, but if they are sending hundreds of WPQs asking for the latest update from the teams responsible for removing RAAC concrete in schools, or reducing cancer screening waiting times, or responding to Hurricane Melissa, they have to understand they are diverting resources from the actual work they're supposed to care about. \"If the House wants to remove the 20-per-day limit, while simultaneously allowing members to use AI to write their questions, that is a recipe for chaos.\""
    },
    {
        "title": "UK and France sign declaration of intent to send troops to Ukraine in event of peace deal",
        "description": "The UK and France have signed a joint declaration pledging to deploy troops to Ukraine in the event of a peace deal, to guarantee the nation's security.",
        "url": "https://news.sky.com/story/uk-and-france-sign-declaration-of-intent-to-send-forces-to-ukraine-in-event-of-peace-deal-13491266",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-emmanuel-macron-volodymyr-zelenskyy_7128346.jpg?20260106184015",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-06 18:33:00",
        "Headline": "Sir Keir Starmer and French President Emmanuel Macron have been holding a meeting of the Coalition of the Willing in Paris.",
        "Content": "The UK and France have signed a joint declaration pledging to deploy troops to Ukraine in the event of a peace deal, to guarantee the nation's security. The agreement states that a \"multinational force for Ukraine\" would be deployed to the eastern European country to deter further attacks from Russia and bolster security guarantees. This would also allow the Ukrainian armed forces to rebuild strength, Sir Keir Starmer has announced. Ukraine latest - follow live It follows a meeting of the so-called Coalition of the Willing in Paris on Tuesday afternoon, led by French President Emmanuel Macron and the British prime minister. Jared Kushner, the US president's son-in-law, and the US special envoy, Steve Witkoff, also attended the talks, along with a number of other European leaders, including Ukrainian President Volodymyr Zelenskyy. Starmer: We want peace that can last Sir Keir has previously stated that the UK might deploy troops to Ukraine following a peace deal, but this agreement now creates the legal framework for allowing British and French troops to operate there. The declaration was formally unveiled at a news conference by Mr Macron, Ukrainian President Volodymyr Zelenskyy and Sir Keir. Addressing the media, Sir Keir said: \"We've had a very constructive meeting. \"The purpose of the Coalition of the Willing is to help to deliver a peace that can last and to work with the US to guarantee Ukrainian security for the long term. \"This work is more advanced than ever.\" Europe correspondent Although not to be underplayed, the Anglo-French commitment to put a multi-national force into Ukraine after a ceasefire was always on the table. But the US commitment, to provide a backstop if Russia invaded Ukraine again, is significant, not least because of the rocky, constantly changing tone from Donald Trump. The unexpected, late addition of Jared Kushner and Steve Witkoff in the post-meeting press conference was a sign of unity. The language was equally supportive: Witkoff described European leaders as \"colleagues\" and Sir Keir Starmer as \"incredible\". It seemed normal and yet the European-American relationship under Trump has been anything but. The elephant in the room - Greenland - was successfully put to one side for now, and for the sake of focusing on Ukraine. But as much as tonight's outcome may satisfy the Ukrainians, there was one person not in Paris: Vladimir Putin. How will he react to the prospect of NATO member troops in Ukraine? Is he prepared to pull back his forces from part or all of the Donbas? Does he even want peace at all? Read Alistair's full analysis here The PM said the UK would participate in US-led \"monitoring and verification of any ceasefire\", would provide arms to Ukraine in the long-term, and would seek binding commitments to support Ukraine in case of a future armed attack by Russia. As well as ensuring that soldiers would be deployed on Ukrainian soil, the agreement also covers protection for Ukraine's skies and sea, Sir Keir added. The declaration also states that the two countries would establish \"military hubs\" in Ukraine, so that military equipment could be deployed for defensive needs. Sir Keir added: \"This is all about building the practical foundations on which peace would rest. But we can only get to a peace deal if Putin is ready to make compromises. \"We have to be frank - for all Russia's words, Putin is not showing that he is ready for peace.\" He concluded that the UK and its allies will continue to turn up the pressure on Russia until \"they come to the table in good faith\". Speaking at the news conference, Mr Macron said the summit had seen European nations discuss \"strong security guarantees\" with the US representatives, while Mr Zelenskyy called the joint declaration \"very concrete\". The Ukrainian president added: \"This illustrates the willingness of the coalition and the European countries to work for peace. \"We want to be ready so that when diplomacy reaches peace, we can deploy the forces of the Coalition of the Willing.\" US wants 'killing to stop' Ukraine already has enough details and knows which countries will get involved in the agreement, including what each of them will contribute separately, Mr Zelenskyy said. But he admitted that some issues \"remain open\" with the revised 20-point peace plan, with the biggest problem being \"the issue of territory\". Speaking on behalf of the US, Mr Witkoff said he would meet with the Ukrainian delegation again on Tuesday evening, but that they are \"largely finished with security protocols\". He added: \"We are here to mediate and help in the peace process, and we're prepared to do anything necessary to get to that place. President Trump strongly, fervently believes that this killing has to stop, that the carnage has to stop.\" Donald Trump's son-in-law, Mr Kushner, later said the agreement is \"a very, very big milestone\", in answer to a question from a journalist."
    },
    {
        "title": "US makes big commitment to Ukraine peace deal – but one man is missing from talks",
        "description": "Although not to be underplayed, the Anglo-French commitment to put a multi-national force into Ukraine after a ceasefire was always on the table.",
        "url": "https://news.sky.com/story/us-makes-big-commitment-to-ukraine-peace-deal-8211-but-one-man-is-missing-from-talks-13491316",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-sir-keir-starmer-steve-witkoff_7128506.jpg?20260106224212",
        "type": "Home",
        "Author": "Alistair Bunkall",
        "Date Published": "2026-01-06 21:59:00",
        "Headline": "Britain, France, and the US are all making commitments to get a deal over the line, but the reaction of Russia remains unknown.",
        "Content": "\n          Europe correspondent\n              @AliBunkallSKY\n Although not to be underplayed, the Anglo-French commitment to put a multi-national force into Ukraine after a ceasefire was always on the table. But the US commitment, to provide a backstop if Russia invaded Ukraine again, is significant, not least because of the rocky, constantly changing tone from Donald Trump. The unexpected, late addition of Jared Kushner and Steve Witkoff in the post-meeting press conference was a sign of unity. The language was equally supportive: Witkoff described European leaders as \"colleagues\" and Sir Keir Starmer as \"incredible\". It seemed normal and yet the European-American relationship under Trump has been anything but. The elephant in the room - Greenland - was successfully put to one side for now, and for the sake of focusing on Ukraine. Trump latest: 'Military an option' to acquire Greenland \n                  Ukraine's allies meet to discuss security as Trump's Greenland threat looms\n                 \n                  Ukraine did not attack Putin's residence, says Trump after American checks\n                 \n                  How sanctions are boosting Russian wine\n                 But as much as tonight's outcome may satisfy the Ukrainians, there was one person not in Paris: Vladimir Putin. How will he react to the prospect of NATO member troops in Ukraine? Is he prepared to pull back his forces from part or all of the Donbas? Does he even want peace at all? For all the progress here in Paris, it's moot unless Putin is prepared to make concessions on his own maximalist demands."
    },
    {
        "title": "Musk must urgently deal with Grok AI's ability to generate sexualised images, government warns",
        "description": "Elon Musk's X must urgently deal with its in-built artificial intelligence Grok being used to generate \"absolutely appalling\" fake sexualised images, Technology Secretary Liz Kendall has said. ",
        "url": "https://news.sky.com/story/musk-must-urgently-deal-with-grok-ais-ability-to-generate-sexualised-images-government-warns-13491169",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-grok-xai-elon-musk_7127468.jpg?20260105181755",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-06 13:47:00",
        "Headline": "Since the start of the new year, numerous X users have reported accounts using Grok to generate images of them without clothing.",
        "Content": "Elon Musk's X must urgently deal with its in-built artificial intelligence Grok being used to generate \"absolutely appalling\" fake sexualised images, Technology Secretary Liz Kendall has said.  Ofcom raised \"serious concerns\" on Monday with the social media platform's AI tool, as it can be used to create \"undressed images of people and sexualised images of children\". Since the start of the new year, X users - mainly women - have reported that accounts have used Grok to generate images of them without clothing. There are also several cases where Grok has created sexualised images of children, according to analysis by news agency Reuters. \"What we have been seeing online in recent days has been absolutely appalling, and unacceptable in decent society,\" said Ms Kendall. \"No one should have to go through the ordeal of seeing intimate deepfakes of themselves online. \"We cannot and will not allow the proliferation of these demeaning and degrading images, which are disproportionately aimed at women and girls. \n                  'Breakthrough' blood test at home could help more people spot Alzheimer's, say scientists\n                 \n                  NHS reveals first conditions eligible for video appointments\n                 \n                  Ofcom makes 'urgent contact' with X over concerns Grok AI can generate 'sexualised images of children'\n                 \"X needs to deal with this urgently. It is absolutely right that Ofcom is looking into this as a matter of urgency and it has my full backing to take any enforcement action it deems necessary.\" Sir Ed Davey, the leader of the Liberal Democrats, has called for the National Crime Agency (NCA) to launch a criminal investigation into X. He said some of the Grok-generated images are \"disgusting\" and called on the UK government \"to act very quickly to stop this, probably to reduce access to X\". Sir Ed, who has a long-running rivalry with X owner, Elon Musk, called for the tech billionaire to be \"held to account\". Sky News has seen multiple users sharing disgust, after non-consensual deepfakes of themselves in bikinis were shared on the app. A statement shared on X's official safety account said: \"We take action against illegal content on X, including Child Sexual Abuse Material (CSAM), by removing it, permanently suspending accounts, and working with local governments and law enforcement as necessary.\" A post on the Grok X account previously said there had been \"isolated cases where users prompted for and received AI images depicting minors in minimal clothing. \"xAI has safeguards, but improvements are ongoing to block such requests entirely,\" it added. On Friday, French ministers reported sexually explicit content generated by Grok on X to prosecutors, saying that the \"sexual and sexist\" content was \"manifestly illegal\". Can X be forced to take action? Under the Online Safety Act, which began being fully enforced in July, it is an offence to share intimate imagery of someone without their permission, even if it is made using AI. The act allows companies that enable deepfakes to be shared online to be fined up to £18m, or 10% of their qualifying worldwide revenue, whichever is greater.  That applies even if the company is based outside the UK, like X, but has a lot of UK users or the potential to harm UK users. The EU has similar regulation, called the Digital Services Act (DSA), and can also fine companies. In fact, just last month, X was handed a €120m (£104m) fine for breaching the DSA - a move that has caused consternation in the US, where the vice president JD Vance is among those who have attacked European \"censorship\" of free speech, leaving Keir Starmer and other leaders having having to mount a defence. Read more:Why Trump administration is so annoyed with Europe's online rules In December, the Trump administration sanctioned British and European online safety campaigners it accused of censoring \"American viewpoints\". However, in the USA, some groups are also calling on authorities to take action against xAI. The Consumer Federation of America (CFA) on Monday wrote to the Federal Trade Commission, the Federal Communications Commission, the Department of Justice, and all attorneys general, demanding swift action. \"xAI is purposefully and recklessly endangering people on their platform and hoping to avoid accountability just because it's 'AI',\" said Ben Winters, Director of AI and Data Privacy at CFA. \"AI is no different than any other product - the company has chosen to break the law and must be held accountable.\""
    },
    {
        "title": "South Yorkshire Police wrongly told family their son had died in car crash",
        "description": "Police wrongly told a family their son had died in a car crash when he had in fact survived.",
        "url": "https://news.sky.com/story/south-yorkshire-police-admit-wrongly-telling-trevor-wynns-family-he-had-died-after-identity-mix-up-13491228",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-crash-rotherham_7109447.jpg?20251213211800",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-06 16:38:00",
        "Headline": "The family of Trevor Wynn spent Christmas mourning the teenager after police told them he had died in a car crash - until he woke up in hospital on Sunday. ",
        "Content": "Police wrongly told a family their son had died in a car crash when he had in fact survived. South Yorkshire Police (SYP) informed the family of Trevor Wynn, 17, that he had passed away, along with a girl of the same age, following a serious collision on Todwick Road in Rotherham, on 13 December. At the time, it had been thought that Joshua Johnson, 18, was under sedation in hospital after being injured. SYP said new \"information came to light\" on Sunday, which had prompted further identification processes being undertaken. The further checks were taken after the teenager - previously thought to be Mr Johnson - woke up in hospital and said he was Mr Wynn, Sky News correspondent Emma Birchley said. The tests confirmed that Mr Wynn was the badly injured young man in hospital receiving treatment, and Mr Johnson was the person who died. The \"astonishing mistake\" had resulted in Mr Wynn's family spending Christmas and New Year with the belief he had died, while Mr Johnson's family believed he was injured in hospital, Birchley said. \n                  Christmas Day shooting leaves man fighting for life\n                 \n                  Key findings from the police watchdog's Hillsborough report\n                 \n                  Boy, 16, in life-threatening condition after shooting\n                 \"It's being reported... that that information was, in fact, the patient waking up and saying, 'I'm Trevor',\" she said. \"At that point, checks are done, forensic tests. And it's confirmed that, in fact it's Trevor in the hospital bed. And really sadly, it's Joshua who has died.\" Families of both teenagers will be offered the support of specialist services, police said. Assistant Chief Constable Colin McFarlane said it came as \"a huge shock to everyone, and we recognise the additional trauma this may cause. \"We are supporting Trevor and all the families through this and have engaged specialist agencies to help provide that support. \"I have also offered to meet with both sets of parents, as I am sure they will have many questions, most of which we are not able to answer yet, but we are absolutely committed to understanding how this happened so it cannot happen again. \"We have taken the decision to refer ourselves to the Independent Office for Police Conduct (IOPC). \"We will co-operate fully with any subsequent investigation and will be led by the IOPC on the next steps to determine how this happened, and how we can ensure this never happens again in the future.\" Read more on Sky News:Chelsea manager's speeding convictionNew rules for drivers over 70Baby formula recall An 18-year-old was arrested on suspicion of causing death by dangerous driving and a 19-year-old was held on suspicion of perverting the course of justice. Both have been bailed pending further inquiries. In its statement, SYP said: \"All of those involved have asked that we thank the public for their support but ask that they are now left in peace to process the future they now face.\""
    },
    {
        "title": "Learner drivers face longer waits for tests under new rules",
        "description": "Bereaved families and the AA say the government's long-awaited strategy to cut roads deaths does not go far enough, with \"missed opportunities\" to save young drivers.",
        "url": "https://news.sky.com/story/drink-drive-limit-to-be-lowered-and-new-restriction-on-learners-road-safety-plans-revealed-13491340",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-learner-driving-file-pic_7128532.jpg?20260107021416",
        "type": "UK",
        "Author": "Dan Whitehead",
        "Date Published": "2026-01-06 22:49:00",
        "Headline": "Edmund King, president of The AA, told Sky News the new strategy was \"welcome\" and \"ambitious\", but fell short on protecting young motorists.",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n Bereaved families and the AA say the government's long-awaited strategy to cut roads deaths does not go far enough, with \"missed opportunities\" to save young drivers. The Road Safety Strategy published today includes plans for mandatory eye-tests for the over 70s, lowering the drink-drive limit in England and Wales, and to consult on a minimum learning period for new motorists of up to six months before taking a driving test. The government says this will give learner drivers more time to develop their skills, with statistics showing nearly a quarter of deaths and serious injuries on Britain's roads involve drivers aged 17-24, despite only making up around 6% of licence holders. But campaigners say the measure falls short of what could have been achieved. Nicole and Chris Taylor's daughter Rebecca was just 18 when she died in a car crash in Northamptonshire in 2008. \"If the government thinks this is enough for us - it's not enough, there's a lot more that should have been done and can be done,\" Nicole said. Chris said he was disappointed by the strategy. \"Having a longer learning period would be a good idea,\" he added. \"But the reality of this is that we have to let young drivers on their own at some point, therefore we need to protect them when that happens.\" The couple - along with hundreds of other families - have spent years campaigning for so-called Graduated Driving Licences (GDL) to be introduced. 'Missed opportunity' In countries such as Australia and Canada, GDLs see restrictions placed on newly-qualified drivers in their first few months of being behind the wheel, such as a limit on passenger numbers and a ban on driving late at night - factors that often feature in serious collisions. The measures have been proven to reduce serious injuries and deaths. Edmund King, president of The AA, told Sky News the new strategy was \"welcome\" and \"ambitious\", but fell short on protecting young motorists. He said: \"We've spoken to colleagues in Canada and Australia about GDLs and the one measure that they all tell us saves the most lives is limiting the number of same age passengers from a car for six months. \"We think that would have been a small price to pay and would save over 50 lives a year, so I think it is a missed opportunity.\" Read more:Worst areas for uninsured driving revealedSeven red flags your mechanic is ripping you off New strategy 'a turning point', says minister The government hopes the measures in the strategy - the first major reform to road safety in nearly two decades - will reduce deaths and serious injuries by 65% by 2035. Transport Secretary Heidi Alexander said: \"Every life lost on our roads is a tragedy that devastates families and communities. For too long, progress on road safety has stalled. This strategy marks a turning point. \"We are taking decisive action to make our roads safer for everyone, from new drivers taking their first lessons to older motorists wanting to maintain their independence. The measures we are announcing today will save thousands of lives over the coming decade.\" The government says the current drink drive limit is the highest in Europe and has not been changed since 1967 - with drink-driving accounting for one in six road fatalities in 2023. It says it'll explore preventative technology, such as alcohol interlock devices, which can include breathalysers attached to a vehicle's ignition. A new Road Safety Board, chaired by the minister for local transport, will be created to oversee delivery of the strategy."
    },
    {
        "title": "UK weather: Heavy snow on the way via first named storm of 2026",
        "description": "Britain's first named storm of the year is set to strike this week, bringing heavy snow and strong winds as a new year cold snap continues to bite.",
        "url": "https://news.sky.com/story/storm-goretti-to-bring-heavy-snow-and-strong-winds-to-the-uk-13490981",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-northumberland-weather_7127968.jpg?20260106114416",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-06 09:00:00",
        "Headline": "Warnings issued by the Met Office, with the first named storm of the year due to arrive after the coldest night of winter so far saw UK temperatures drop as low as -12.5C.",
        "Content": "Britain's first named storm of the year is set to strike this week, bringing heavy snow and strong winds as a new year cold snap continues to bite. The French meteorological service, Meteo France, has named it Goretti - and the south of the UK is expected to be most heavily affected on Thursday and Friday. Sky News meteorologist Dr Christopher England said the \"exact storm track is a little uncertain\" but the \"most likely scenario is heavy rain spreading from the southwest on Thursday turning to snow from around Wales across to East Anglia\". He said \"significant falls\" were likely, along with \"severe gales around southern coasts\". As it happened: 'Multi-hazard' event on way this week The UK Health Security Agency (UKHSA) has extended its amber cold health alerts across England until midday on Sunday. The warnings came after what the Met Office has reported as \"the coldest night of the winter so far,\" and as a major incident was declared in Aberdeenshire. Aberdeenshire council said that expects a \"prolonged period of significant impacts\" over the weather, warning of: • Travel delays on roads are likely, stranding some vehicles and passengers;• Some delays and cancellations to rail and air travel are likely;• There is a good chance that some rural communities could become cut off;• Injuries from slips and falls are likely on icy surfaces;• Untreated pavements and cycle paths likely to be impassable;• There is a good chance that power cuts may occur, with the potential to affect other services, such as mobile phone coverage. Check the latest weather forecast where you are New weather warnings issued by Met Office The Met Office has issued fresh weather warnings for Wednesday, Thursday, and Friday. Three yellow warnings are in effect on Wednesday. One, for ice, covers Northern Ireland. A second warning for snow and ice is also in effect across northern mainland Scotland, part of the Outer Hebrides, and the Orkney Islands. And a third - for ice - covers much of the rest of the UK, except southwest England and the west coasts of Wales and Scotland. Thursday sees two new yellow warnings: One for wind in the southwest of England, and one for snow in much of Wales, the Midlands, Bath and Bristol, and Oxford. The snow warning lasts until midday on Friday, and warns that in some areas \"5-10 cm of snow may settle with the potential for up to 20 cm in some locations, especially over higher ground\". Two amber warnings for snow were in effect in Scotland throughout Tuesday, as hundreds of schools in Shetland, Orkney, and Aberdeenshire remained shut. Read more from Sky News:Maduro says he is 'prisoner of war' - as Trump reactsGovernment plans new driving rule for over-70s Meanwhile, Monday night was \"the coldest night of the winter so far,\" according to the Met Office, after a low temperature of -12.5C (9.5F) was recorded in Marham, Norfolk. Those waking up in London at 5am faced temperatures down to -5C (23F), with overnight lows of -11.2C (11.84F) in Dalwhinnie, in the Scottish Highlands. In a post on social media, the Met Office said: \"Last night was the coldest night of the winter so far, making it a very cold and frosty start for most of us this morning.\" National Rail said that train services in northern Scotland will be disrupted until the end of the day on Tuesday."
    },
    {
        "title": "Number of written questions to government departments doubles in a year",
        "description": "Key Whitehall departments had to answer almost twice as many questions from MPs and peers in 2025 as the year before - with AI blamed for the massive rise, Sky News can reveal.",
        "url": "https://news.sky.com/story/number-of-written-questions-to-government-departments-doubles-in-a-year-13491299",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-james-mcmurdock-mp_7004903.jpg?20250829182503",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2026-01-06 20:43:00",
        "Headline": "A senior government source has suggested MPs may be using AI to submit written questions to ministers.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Key Whitehall departments had to answer almost twice as many questions from MPs and peers in 2025 as the year before - with AI blamed for the massive rise, Sky News can reveal. MPs have been accused of diverting resources and wasting public money after the number of Written Parliamentary Questions (WPQs) rose to 90,331, up from 49,125 in 2024, which was close to the average for the previous decade. Politics latest - follow live The Department for Health and Social Care saw a 97% increase in questions compared to the previous year. The Home Office saw a 92% increase, the Department for Education saw a 97% increase, and the housing department saw a 101% increase. Submissions from some MPs surged 10 or 20-fold in the second half of 2025 compared to the same period the year before, following the general election. Just 10 MPs accounted for 20% of the Commons WPQs submitted in the second half of 2025. These included a Lib Dem MP, Al Pinkerton, whose use increased more than 20-fold from 36 to 721, and independent MP James McMurdock, who on 2 January alone saw 342 questions tabled in his name on a range of subjects from Palestine funding to road deterioration and the UK-Italy young leaders programme. All MPs we spoke to strongly rejected any claim that their questions waste time or are not in the public interest, and no MPs admitted to using AI in their questions. The increase was confined to pockets of the Commons, and there was no massive difference in the number of WPQs submitted by members of the House of Lords over the two periods compared. Many MPs believe WPQs are an essential tool for extracting critical information from government departments. Some told Sky News the growth in questions stemmed from the government's failure to answer their first attempts, while a number of new MPs said they were learning the system. Is AI behind the rise? But senior government sources have launched an extraordinary attack on MPs for the growth of questions - which they believe could be time-wasting. \"Some of the WPQs we are seeing are so obscure, and others are so generic, that you're regularly left wondering how any MP would have come up with them, and perhaps the answer is that they haven't,\" a senior source said. \"Put it this way: when we look at the increase in WPQs from some MPs, the random variety of subjects they're asking about, and the lack of any apparent rationale behind their questions, we ask ourselves: how would this look any different if all their WPQs were being generated by AI? And the truth is it wouldn't.\" Sky News has been told by multiple government sources they believe they are seeing the increased use of AI tools to generate written questions. They suggest an MP with a general interest in a subject may ask an AI tool to give them 10 questions to ask the government about it, or - if they simply want to get their numbers up in a hurry - may ask AI to provide them with multiple questions asking the government about its performance across a range of different areas. Read more from Sky News:UK agrees to send troops to Ukraine'Humiliating' defeats for Chagos deal However, one MP whose use of written questions has increased 10-fold in a year showed Sky News how he keeps a written list on his phone of every subject he wants to ask about and denied ever using AI to write them for him. Ben Obese-Jecty, Tory MP for Huntingdon, tabled 150 questions in the second half of 2024 and 1,683 in the same period a year later. He said if Whitehall wanted to reduce the number of questions, they should give better answers the first time they are asked. 'It's like a chess game' \"My message to those in government who are complaining about the volume of questions is: answer them properly, ensure that we can hold the government to account and maybe the number of questions that you have to suffer responding to will reduce,\" he told Sky News. \"I know that I personally don't use AI to write questions. I have a running list on my phone and as questions come up during the day I will make a note of something that I want to ask the government to get some more clarity on it.\" Sky News challenged Mr Obese-Jecty why he asked about such a variety of topics, including the impact on the grocery industry of weight loss drugs. \"All of the questions are certainly valid, and if they weren't valid, they wouldn't be allowed to be tabled in the first instance,\" he replied. \"A lot of those questions are [there because it's] like a chess game, and each question is effectively an opening gambit in a back and forth where you will ask a question and then slowly drill down into a topic.\" Civil servants 'spending half their time' with WPQs Under the current rules, MPs can submit up to 20 written questions electronically each day. There is currently an inquiry by the Commons Procedure Committee into WPQs, which could change this limit. The Whitehall source said: \"People think civil service departments are these huge bureaucracies where there are endless numbers of staff waiting to churn out answers to WPQs and FOI [Freedom of Information] requests. \"But the truth is the individual units in charge of each specific area are fairly small, and too many important civil service teams are currently spending half their time dealing with WPQs. \"MPs mean well, but if they are sending hundreds of WPQs asking for the latest update from the teams responsible for removing RAAC concrete in schools, or reducing cancer screening waiting times, or responding to Hurricane Melissa, they have to understand they are diverting resources from the actual work they're supposed to care about. \"If the House wants to remove the 20-per-day limit, while simultaneously allowing members to use AI to write their questions, that is a recipe for chaos.\""
    },
    {
        "title": "UK and France sign declaration of intent to send troops to Ukraine in event of peace deal",
        "description": "The UK and France have signed a joint declaration pledging to deploy troops to Ukraine in the event of a peace deal, to guarantee the nation's security.",
        "url": "https://news.sky.com/story/uk-and-france-sign-declaration-of-intent-to-send-forces-to-ukraine-in-event-of-peace-deal-13491266",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-emmanuel-macron-volodymyr-zelenskyy_7128346.jpg?20260106184015",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-06 18:33:00",
        "Headline": "Sir Keir Starmer and French President Emmanuel Macron have been holding a meeting of the Coalition of the Willing in Paris.",
        "Content": "The UK and France have signed a joint declaration pledging to deploy troops to Ukraine in the event of a peace deal, to guarantee the nation's security. The agreement states that a \"multinational force for Ukraine\" would be deployed to the eastern European country to deter further attacks from Russia and bolster security guarantees. This would also allow the Ukrainian armed forces to rebuild strength, Sir Keir Starmer has announced. Ukraine latest - follow live It follows a meeting of the so-called Coalition of the Willing in Paris on Tuesday afternoon, led by French President Emmanuel Macron and the British prime minister. Jared Kushner, the US president's son-in-law, and the US special envoy, Steve Witkoff, also attended the talks, along with a number of other European leaders, including Ukrainian President Volodymyr Zelenskyy. Starmer: We want peace that can last Sir Keir has previously stated that the UK might deploy troops to Ukraine following a peace deal, but this agreement now creates the legal framework for allowing British and French troops to operate there. The declaration was formally unveiled at a news conference by Mr Macron, Ukrainian President Volodymyr Zelenskyy and Sir Keir. Addressing the media, Sir Keir said: \"We've had a very constructive meeting. \"The purpose of the Coalition of the Willing is to help to deliver a peace that can last and to work with the US to guarantee Ukrainian security for the long term. \"This work is more advanced than ever.\" Europe correspondent Although not to be underplayed, the Anglo-French commitment to put a multi-national force into Ukraine after a ceasefire was always on the table. But the US commitment, to provide a backstop if Russia invaded Ukraine again, is significant, not least because of the rocky, constantly changing tone from Donald Trump. The unexpected, late addition of Jared Kushner and Steve Witkoff in the post-meeting press conference was a sign of unity. The language was equally supportive: Witkoff described European leaders as \"colleagues\" and Sir Keir Starmer as \"incredible\". It seemed normal and yet the European-American relationship under Trump has been anything but. The elephant in the room - Greenland - was successfully put to one side for now, and for the sake of focusing on Ukraine. But as much as tonight's outcome may satisfy the Ukrainians, there was one person not in Paris: Vladimir Putin. How will he react to the prospect of NATO member troops in Ukraine? Is he prepared to pull back his forces from part or all of the Donbas? Does he even want peace at all? Read Alistair's full analysis here The PM said the UK would participate in US-led \"monitoring and verification of any ceasefire\", would provide arms to Ukraine in the long-term, and would seek binding commitments to support Ukraine in case of a future armed attack by Russia. As well as ensuring that soldiers would be deployed on Ukrainian soil, the agreement also covers protection for Ukraine's skies and sea, Sir Keir added. The declaration also states that the two countries would establish \"military hubs\" in Ukraine, so that military equipment could be deployed for defensive needs. Sir Keir added: \"This is all about building the practical foundations on which peace would rest. But we can only get to a peace deal if Putin is ready to make compromises. \"We have to be frank - for all Russia's words, Putin is not showing that he is ready for peace.\" He concluded that the UK and its allies will continue to turn up the pressure on Russia until \"they come to the table in good faith\". Speaking at the news conference, Mr Macron said the summit had seen European nations discuss \"strong security guarantees\" with the US representatives, while Mr Zelenskyy called the joint declaration \"very concrete\". The Ukrainian president added: \"This illustrates the willingness of the coalition and the European countries to work for peace. \"We want to be ready so that when diplomacy reaches peace, we can deploy the forces of the Coalition of the Willing.\" US wants 'killing to stop' Ukraine already has enough details and knows which countries will get involved in the agreement, including what each of them will contribute separately, Mr Zelenskyy said. But he admitted that some issues \"remain open\" with the revised 20-point peace plan, with the biggest problem being \"the issue of territory\". Speaking on behalf of the US, Mr Witkoff said he would meet with the Ukrainian delegation again on Tuesday evening, but that they are \"largely finished with security protocols\". He added: \"We are here to mediate and help in the peace process, and we're prepared to do anything necessary to get to that place. President Trump strongly, fervently believes that this killing has to stop, that the carnage has to stop.\" Donald Trump's son-in-law, Mr Kushner, later said the agreement is \"a very, very big milestone\", in answer to a question from a journalist."
    },
    {
        "title": "Manchester United speaking to several former players about being interim head coach",
        "description": "Manchester United have been in talks with several former players to take on the role of interim head coach, as the club seeks a manager to lead the team until the end of the season following Ruben Amorim's departure.",
        "url": "https://news.sky.com/story/manchester-united-speaking-to-several-former-players-about-being-interim-head-coach-13491310",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-darren-fletcher-manchester-united_7128455.jpg?20260106213316",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-06 21:19:00",
        "Headline": "The Old Trafford-based club are exploring external options to take up the post of interim manager following Ruben Amorim's exit, with Michael Carrick, Ole Gunnar Solskjaer and Ruud van Nistelrooy among those contacted.",
        "Content": "Manchester United have been in talks with several former players to take on the role of interim head coach, as the club seeks a manager to lead the team until the end of the season following Ruben Amorim's departure. Michael Carrick and Ole Gunnar Solskjaer have been informally approached about the possibility of managing the team, along with the current caretaker Darren Fletcher. It's expected that other candidates will also be contacted before any decision is taken. Ruben Amorim was dismissed on Monday after 14 disappointing months, which came to a bitter end following Friday's heated meeting with director of football Jason Wilcox. Under-18s boss and former midfielder Fletcher has been temporarily promoted to interim head coach for Wednesday's Premier League trip to Burnley. Fletcher is expected to stay in charge for Sunday's FA Cup third-round match against Brighton while United weigh their options. \"It's surreal,\" said Fletcher, who made 342 appearances for the Red Devils and has worked in a variety of different roles for them since 2020. \n                  Learner drivers face longer waits for tests under new rules\n                 \n                  UK weather: Heavy snow on the way via first named storm of 2026\n                 \n                  Number of written questions to government departments doubles in a year\n                 \"I don't even think it's in my wildest dreams that that was something that could potentially happen.\" Fletcher said leading the team was \"an amazing honour\", even though \"not in the circumstances I expected it to happen\". \"But I've got a job to do, and I've got to lead the team tomorrow, and think of the great honour and pride in doing that.\" Read more from Sky News:UK and France to send forces to UkraineStorm Goretti to bring heavy snow and strong winds On Tuesday, the club also spoke to former boss and treble hero Ole Gunnar Solskjær, who was named as Jose Mourinho's temporary replacement in December 2018 and got the full-time post in March 2019. Solskjaer led Man Utd to second place in the Premier League in 2020-21 and a Europa League final defeat to Villarreal before being sacked in November 2021. Since leaving Old Trafford, he has only managed Turkish club Besiktas. Carrick, who had been part of Solskjaer's coaching team, briefly served as caretaker manager before departing the club. The former United midfielder later managed Championship side Middlesbrough from October 2022 until last June. Ruud van Nistelrooy, who managed United between Erik ten Hag's departure and Amorim's arrival in November 2024, is also reportedly being considered. Another club legend, he was dismissed by Leicester towards the end of last season. Sky Sports is reporting that the club haven't ruled out the possibility of making a substantive appointment, if they decide the right coach is available. It's thought club's bosses would like to have someone in place before the Manchester derby on 17 January."
    },
    {
        "title": "Feeling ignored, bad behaviour by staff and long-term trauma: What you told us about your maternity experiences",
        "description": "\"I did everything I was supposed to do. I attended my appointments. I raised concerns. I listened to professionals. I trusted the system. And that trust very nearly killed me.\"",
        "url": "https://news.sky.com/story/feeling-ignored-bad-behaviour-by-staff-and-long-term-trauma-what-you-told-us-about-your-maternity-experiences-13491236",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-maternity-care-data-x-forensics_7128308.png?20260106174141",
        "type": "UK",
        "Author": "Daniel Dunford, Kaitlin Tosh and Joely Santa Cruz, Sky News Data x Forensics team",
        "Date Published": "2026-01-06 16:47:00",
        "Headline": "Hundreds of you got in touch with Sky News to share your experiences. We read all of your messages. Here's what you told us.",
        "Content": "By Daniel Dunford, Kaitlin Tosh and Joely Santa Cruz, Sky News Data x Forensics team  \"I did everything I was supposed to do. I attended my appointments. I raised concerns. I listened to professionals. I trusted the system. And that trust very nearly killed me.\" Those are the words of Louise Prashad, one of more than 180 people who wrote to Sky News to share their birth stories, after we covered the stories of three women who had suffered traumatic maternity experiences. Almost all the people who wrote in - more than 90% of the accounts we analysed - said they felt ignored or not listened to at some point by the healthcare workers who they had put their faith in during one of the most intimate and significant moments in their lives. More than four in five listed staff behaviour that was actively detrimental. For example, staff shouting at them or physically assaulting them in response to making loud noises during childbirth, or in one case telling a new mother not to ring the help bell for a couple of hours because there was a big football match on. More than two thirds of people who wrote to us said they have had long-term mental trauma as a result of their childbirth experiences, while almost half said their babies were harmed as a result of what happened to them. The impact of the birth trauma was not limited to mothers and babies. Many of the testimonies we received came from the partners, parents, siblings or other children of those giving birth, explaining how they too were left traumatised by what happened to their loved ones. These experiences often led to marriages or other relationships breaking down, or the inability to add further children to the family. The accounts we received are not representative of the normal childbirth experience, as measured in a recent survey by the Care Quality Commission (CQC). But the fact so many people reported similar experiences, and they have clearly had such a long-term impact, show how important the issue is. Many of the issues raised by our readers also echoed the findings of the CQC report. One in five respondents to that survey said they felt their concerns during labour were not taken seriously. One in four said they didn’t feel that postnatal mental health support was sufficient. Deaths during childbirth “By the time anyone listened, it was too late. Daniel had died.\" Deaths of mothers or babies are still fortunately very rare during childbirth, but the risks are higher for older mothers, black and Asian women, and women in the most deprived parts of the UK. The difference in death rates among newborns, comparing the most and least deprived areas, has been getting steadily wider over the last five years. As of 2023, a baby born in one of the most deprived parts of the country was 2.4 times more likely to die in childbirth compared with a baby born in one of the least deprived parts of the country. A few of the people who wrote to us explained that they had bad experiences giving birth in the UK, but better experiences with either earlier or subsequent children in other countries, like Ireland, Italy, and Australia. These examples are individual experiences, but UN data does show while health outcomes for mothers in most parts of the world have got considerably better in recent decades, they have been getting worse in the UK. Royal correspondent After years of warnings, reviews, and mounting pressure, 2026 could be a pivotal moment for maternity services. We've long-known maternity care is in crisis. It is a vital service but one which is under sustained strain. And in some cases, failing mothers and babies with tragic consequences. Multiple national investigations over the last decade have highlighted serious failings. Each report written has made several recommendations, and yet the system still struggles. Fundamental change is long overdue, and it could come with the publication of the Amos review. Baroness Amos is looking into system-wide issues, to understand why problems persist, and what needs to change. But there is already scepticism as to what the review will achieve.  Sky News has received hundreds of emails from families sharing their birth traumas. All similar stories, each one harrowing. Many families feel deep mistrust, telling us we've been here before, and lessons haven't been learnt. There's a lot of pressure to get this right, and progress will be judged by positive outcomes not promises. Of the 186 countries the UN collects data for, the UK was one of only 14 where maternal mortality rates were higher in 2020 than they were in 1985. The US and Canada were also in that group, while Cyprus and Finland were the only other European countries represented. Over that time, the UK has fallen from having the ninth-lowest maternal mortality rate in the world to now being 42nd on that list. How outstanding staff made awful experiences bearable While most of the people who felt compelled to write to us shared bad or traumatic experiences, there were also positive stories to tell. One woman wrote about how fear of NHS hospitals meant her daughter-in-law had her two children at home. She said both children were born safely and successfully. There were many others who praised individual staff members for making their otherwise awful experiences bearable. \"On 8 April 2023, during the night shift, a gynaecology student from University College London (UCL), a blonde male, was present in theatre. He held my hand and gently stroked my forehead during the whole time I was haemorrhaging,\" said one woman. \"I still look for his face in the crowd every time I walk pass UCL, I don't know his name, but he was the single person who made me feel I was still alive. If you ever read this, thank you.\" If you have suffered from birth trauma and would like to share your story, contact Sky News by messaging us on WhatsApp +44 7583 000853 or emailing news@skynews.com. The Data x Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Badenoch calls for police chief to go over Israeli football fan ban",
        "description": "Kemi Badenoch has called for the chief constable of West Midlands Police to resign over the force's decision to ban Israeli football fans from attending a match in Birmingham.",
        "url": "https://news.sky.com/story/no-political-influence-in-decision-to-ban-maccabi-tel-aviv-fans-say-police-13491231",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-craig-guildford-west-midlands-police_7128510.jpg?20260106224647",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-06 16:54:00",
        "Headline": "The Conservative leader called West Midlands Police Chief Constable Craig Guildford's position \"untenable\" and said that police had misled parliament.",
        "Content": "Kemi Badenoch has called for the chief constable of West Midlands Police to resign over the force's decision to ban Israeli football fans from attending a match in Birmingham. Bosses from West Midlands Police were grilled by MPs on the Home Affairs Select Committee over their decision to bar Maccabi Tel Aviv fans from the Europa League fixture at Villa Park on 6 November last year. Following the meeting, Tory leader Kemi Badenoch said the position of Chief Constable Craig Guildford was \"untenable\". Writing on X, Mrs Badenoch said West Midlands Police had \"capitulated to Islamists and then collaborated with them to cover it up.\" \"They knew extremists were planning to attack Jews for going to a football match, and their response was to blame and remove Jewish people instead. \"They presented an inversion of reality and misled a Parliamentary Committee. We have had enough of this in Britain. The Chief Constable's position is untenable.\" \"The British Police serve the British public, not local sectarian interests,\" she wrote. 'No political influence' in decision to ban Israeli fans During the meeting, West Midlands Police denied that the decision to ban Israeli fans from a football match in Birmingham was influenced by political factors. Its bosses also denied that they were looking for a reason to ban the fans of Maccabi Tel Aviv from attending the Europa League match against Aston Villa in November last year, saying the decision was \"reasonable\" and based on an assessment of the risk. CC Craig Guildford said he didn't believe there was any political influence in the decision to ban fans, telling MPs: \"I do not believe there was political influence on that decision, I do not believe that to be the case. \"I believe the information that we provided and the advice, provided to the SAG [Safety Advisory Group], and the decision-making by the SAG in all those around the table in the SAG. \"I am sure the SAG chair took into account what people thought. [But] my personal opinion is there wasn't any political interference.\" While he said he was \"sure\" that local politicians and community members wanted to influence the ban, he reiterated that he didn't believe the decision was influenced. Local independent MP Ayoub Khan was firmly against the match going ahead in Birmingham, and met with the police on the matter. Some local councillors also lobbied for the ban. The Safety Advisory Group includes representatives from police, other emergency services, and the local council, which advises on safety for public events. 'No conspiracy' Police chiefs told MPs they weren't looking for a reason to ban Maccabi fans, saying the decision was based on an operational assessment of the safety risk. Conservative committee chair Karen Bradley put to the police representatives: \"It feels to us, from everything we've seen, that there was a need that you felt that you had to justify banning these fans, and that a scraping was done to find a reason\". CC Craig Guildford responded: \"That's absolutely not the case. I'm really sorry if it comes across that way.\" Assistant Chief Constable Mike O'Hara told MPs that he \"understood the frustration, but there is no conspiracy here, this is a decision based on safety.\" He outlined that police had intelligence that some local \"vigilante groups\" would actively seek out Maccabi fans and target them with violence. He also said police had seen people who were \"purporting to be Maccabi fans online who were goading local community members, and saying this is what you're going to get\". ACC O'Hara said the decision was made by weighing up the \"very hot\" local community reception, and evidence from Dutch police saying Maccabi fans had actively targeted locals in Amsterdam. He called the decision to ban Maccabi fans in the circumstances \"reasonable\". 'Didn't mean' to misrepresent views of Jewish community Later in the session, ACC O'Hara told MPs he was \"personally quite gutted\" to realise he may have misrepresented the views of the Jewish community. Labour MP Joani Reid pointed out that the force told MPs at a previous meeting that the ban on Maccabi Tel Aviv fans was supported by the local Jewish community. However, she said this was untrue. ACC O'Hara responded: \"It was never my intention to misrepresent the views of the Jewish community. \"I was personally quite gutted to leave the first session, to be contacted by the chair and to understand that I had caused confusion or consternation. \"That was never my intention. I immediately apologised, which was then shared with the community. \"I will do whatever I can with our local commanders to continue to improve our working relationship with the Jewish community.\""
    },
    {
        "title": "South Yorkshire Police wrongly told family their son had died in car crash",
        "description": "Police wrongly told a family their son had died in a car crash when he had in fact survived.",
        "url": "https://news.sky.com/story/south-yorkshire-police-admit-wrongly-telling-trevor-wynns-family-he-had-died-after-identity-mix-up-13491228",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-crash-rotherham_7109447.jpg?20251213211800",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-06 16:38:00",
        "Headline": "The family of Trevor Wynn spent Christmas mourning the teenager after police told them he had died in a car crash - until he woke up in hospital on Sunday. ",
        "Content": "Police wrongly told a family their son had died in a car crash when he had in fact survived. South Yorkshire Police (SYP) informed the family of Trevor Wynn, 17, that he had passed away, along with a girl of the same age, following a serious collision on Todwick Road in Rotherham, on 13 December. At the time, it had been thought that Joshua Johnson, 18, was under sedation in hospital after being injured. SYP said new \"information came to light\" on Sunday, which had prompted further identification processes being undertaken. The further checks were taken after the teenager - previously thought to be Mr Johnson - woke up in hospital and said he was Mr Wynn, Sky News correspondent Emma Birchley said. The tests confirmed that Mr Wynn was the badly injured young man in hospital receiving treatment, and Mr Johnson was the person who died. The \"astonishing mistake\" had resulted in Mr Wynn's family spending Christmas and New Year with the belief he had died, while Mr Johnson's family believed he was injured in hospital, Birchley said. \n                  Christmas Day shooting leaves man fighting for life\n                 \n                  Key findings from the police watchdog's Hillsborough report\n                 \n                  Boy, 16, in life-threatening condition after shooting\n                 \"It's being reported... that that information was, in fact, the patient waking up and saying, 'I'm Trevor',\" she said. \"At that point, checks are done, forensic tests. And it's confirmed that, in fact it's Trevor in the hospital bed. And really sadly, it's Joshua who has died.\" Families of both teenagers will be offered the support of specialist services, police said. Assistant Chief Constable Colin McFarlane said it came as \"a huge shock to everyone, and we recognise the additional trauma this may cause. \"We are supporting Trevor and all the families through this and have engaged specialist agencies to help provide that support. \"I have also offered to meet with both sets of parents, as I am sure they will have many questions, most of which we are not able to answer yet, but we are absolutely committed to understanding how this happened so it cannot happen again. \"We have taken the decision to refer ourselves to the Independent Office for Police Conduct (IOPC). \"We will co-operate fully with any subsequent investigation and will be led by the IOPC on the next steps to determine how this happened, and how we can ensure this never happens again in the future.\" Read more on Sky News:Chelsea manager's speeding convictionNew rules for drivers over 70Baby formula recall An 18-year-old was arrested on suspicion of causing death by dangerous driving and a 19-year-old was held on suspicion of perverting the course of justice. Both have been bailed pending further inquiries. In its statement, SYP said: \"All of those involved have asked that we thank the public for their support but ask that they are now left in peace to process the future they now face.\""
    },
    {
        "title": "Fujitsu boss rejects MP's claim firm is 'a parasite on the British state'",
        "description": "Fujitsu's European boss has denied that the company is \"a parasite on the British state\" after MPs challenged it over its position on Post Office scandal compensation.",
        "url": "https://news.sky.com/story/fujitsu-boss-rejects-mps-claim-firm-is-a-parasite-on-the-british-state-13491263",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-fujitsu-horizon-post-office_7128348.jpg?20260106185226",
        "type": "UK",
        "Author": "Adele Robinson",
        "Date Published": "2026-01-06 18:12:00",
        "Headline": "The company behind the Horizon post office scandal is yet to contribute towards compensation, despite saying two years ago it had a \"moral obligation\" to. ",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n Fujitsu's European boss has denied that the company is \"a parasite on the British state\" after MPs challenged it over its position on Post Office scandal compensation. The confrontation came during a parliamentary committee session examining the \"continued search for justice and accountability\" for victims. The government has set aside £1.8bn for redress for sub‑postmasters wrongly prosecuted due to failures in Fujitsu's Horizon IT system. The company is yet to contribute towards compensation despite saying it had a \"moral obligation\" to, two years ago. Paul Patterson, director at Fujitsu Services Ltd, was also questioned by MPs about the company securing public sector contract extensions worth an estimated £500m, amid assurances it would not bid for new UK government work. Chair of the Business and Trade Select Committee of MPs, Liam Byrne, told the executive: \"Your refusal to tell us how much Fujitsu will pay into a £1.8bn bill for taxpayers leads people to the conclusion that frankly Fujitsu is behaving like a parasite on the British state without an obligation to step up to its obligations.\" The Fujitsu boss rejected the accusation stating: \"We're not a parasite... the government has got an option as to whether they wish to extend those contracts or not. If you wish us to walk away from those contracts, we'll walk away from those contracts,\" he said. He argued that ending Fujitsu's government work would be \"detrimental to society\" and insisted the company had only extended its Post Office contract because ministers requested it. The executive pointed to Fujitsu's four‑decade presence in the UK, its 5,000 employees and its network of subcontractors, saying the firm remained \"a very serious organisation\" committed to its responsibilities. Pressure is mounting on the government to secure a substantial financial contribution from Fujitsu, which built and maintained the Horizon system at the centre of one of the UK's biggest miscarriages of justice. During the committee hearing, however, it became clear that Fujitsu will be waiting until the conclusion to the public inquiry into the scandal, chaired by Sir Wyn Williams, before announcing a specific figure. Read more:Second Horizon victim 'forced' to sue Post OfficeAppeal court delay for first Capture case Mr Patterson also said that Fujitsu needs to be \"informed by Sir Wyn\" adding that more information has come to light since he last appeared before the committee including about the \"Capture system\". \"I didn't know about a Capture system,\" he said, \"I didn't know there were victims of that, I didn't know there was legal advice in 2013 telling the Post Office what to do or not to. \"That is why Sir Wyn's advice is really, really important to us and will inform the commitment I am giving you again and that I have given to the committee before that we will contribute to redress.\" Capture was an accounting system used in the 1990s pre‑dating Horizon, which also produced unreliable data. Sky News has helped expose the scale of the scandal by uncovering a long‑lost document in a retired expert's garage. The session also heard from others connected to the Post Office scandal, including victims' lawyers, who echoed calls for greater urgency in delivering redress and justice. Nigel Railton, chair of the Post Office, said it was his personal opinion that the government should legislate to exonerate Capture victims, similar to Horizon victims."
    },
    {
        "title": "Two men left stranded after dramatic attempt to rescue dog from icy Essex lake",
        "description": "Firefighters were called to a lake in Essex after an attempt to rescue a dog in freezing weather left two men stranded in icy water.",
        "url": "https://news.sky.com/story/two-men-left-stranded-after-dramatic-attempt-to-rescue-dog-from-icy-essex-lake-13491093",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-dog-rescue-frozen-weather_7127959.jpg?20260106113413",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-06 11:01:00",
        "Headline": "Firefighters called to the incident at Connaught Water in Epping Forest are urging the public to \"stay out of the water and call us\" in cold weather emergencies. ",
        "Content": "Firefighters were called to a lake in Essex after an attempt to rescue a dog in freezing weather left two men stranded in icy water. The incident took place at Connaught Water in Epping Forest over the weekend, ahead of the coldest night of the year on Monday and warnings of Storm Goretti - the first named storm of the year. Follow latest: Britons shiver in coldest night of winter Video from Sunday shows the men in the water, before emergency services arrived to help the men from the lake. Temperatures in Epping Forest District dropped as low as -6C in the early hours of Sunday morning, according to timeanddate.com. Ozgur Ontas, an eyewitness who filmed the incident, told Sky News: \"My family and I were walking around the lake, we live nearby, when suddenly we saw a man fall into the water and someone else helping him. \"There was a crowd behind them. They immediately called for first aid, and they managed to get the dog out of the lake within ten or fifteen minutes.\" \n                  Five arrested over plot to steal 'tonnes' of charity clothes to fund crime\n                 \n                  Deported migrant sex offender given £500 to leave country\n                 \n                  David Lammy to face Commons grilling over wrongly released migrant sex offender\n                 Mr Ontas added that \"first aid arrived and took him away\" and that the dog was \"wet but fine\". Essex Fire and Rescue Service said in a statement that a \"member of the public fell through ice\" in the attempt to save the dog. It added that \"the dog was safely reunited with its owners,\" and that both men were able to get out of the water and were left in the care of the ambulance service. Read more:Was the US attack in Venezuela legal?Chelsea hire former Hull boss as new head coach Gary Dyer, the fire brigade's watch manager, added that while the force \"completely understand why people want to help in situations like this\", he also warned that \"cold water can overwhelm the body very quickly\". \"The safest thing to do is stay out of the water and call us - we have the training and equipment to respond safely,\" he added."
    },
    {
        "title": "Military action in Greenland 'always an option' says White House",
        "description": "Using the military to take Greenland is \"always an option\" the White House says, amid mounting tension over Donald Trump's plans for the territory.",
        "url": "https://news.sky.com/story/military-action-in-greenland-always-an-option-says-white-house-13491330",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/d8e87493b7d85a48cf7cc96d235b8325d995d88a7ceb256b12554b878890f99a_7127964.jpg?20260107021120",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-06 22:19:00",
        "Headline": "A statement from the Trump administration said utilising the US military was one of a range of options open to the president regarding Greenland.",
        "Content": "Using the military to take Greenland is \"always an option\" the White House says, amid mounting tension over Donald Trump's plans for the territory. The US president has been vocal about his desire to annex the self-governing island, despite it being part of Denmark - a NATO ally. In recent days, Danish Prime Minister Mette Frederiksen has warned that US military action to seize the territory would spell the end of NATO. But now a statement from the White House has defended a military approach, insisting that it is \"always an option\" open to the president. The statement said: \"President Trump has made it well known that acquiring Greenland ‌is a national security priority ‌of the United States, and it's vital ​to deter our adversaries in the Arctic region. \"The ‍president and his team are discussing a range of options to pursue this important ‌foreign policy goal, ⁠and of course, utilizing the ‌US military is ‍always an option at the commander-in-chief's disposal.\" The foreign ministers of Denmark and Greenland have requested a meeting with US secretary of state Marco Rubio. Trump: We need Greenland Fears that the US will act against Greenland have mounted following the arrest of Venezuelan president Nicolas Maduro in an audacious American raid on Caracas. Mr Trump has justified his actions on the international stage by citing the Monroe Doctrine - a US policy named after former president James Monroe, who asserted the right of his country to intervene in foreign affairs across the Americas in its own interest. And with the door left open to further interventions in the western hemisphere, the president has reiterated his territorial ambitions for Greenland. On Monday, he spoke to Sky's US partner network NBC News about Greenland, saying that \"we need it for national security, right now\". US threats 'not going away' With tensions mounting, Prime Minister Sir Keir Starmer has joined other leaders from Europe and Canada in throwing his weight behind Ms Fredriksen and Denmark, saying \"I stand with her. She's right about the future of Greenland.\" But a senior US official told Reuters that opposition from other NATO leaders would not stop the push to bring Greenland under US control. \"It's not going away,\" the official said, speaking on condition of anonymity. Read more:There's a sense in Greenland that US may now take it overTrump has ripped up the rule book, where could US strike next? How could US take Greenland? One option described was the outright purchase of the territory. They said: \"Diplomacy is always the president's first option with anything, and dealmaking. \"He loves deals. So if a good deal can be struck to acquire Greenland, that would definitely be his first instinct.\" Another option involved creating a ‌Compact of Free Association (COFA) between the US and Greenland. The US already has COFA deals with three Pacific Island nations, giving America military access in exchange for financial aid. The official added that Mr Trump wants to acquire Greenland during his current term in office."
    },
    {
        "title": "There's a sense in Greenland that Trump may now take over territory",
        "description": "Greenland is in the eye of an intense diplomatic storm, not that you would know it being here.",
        "url": "https://news.sky.com/story/greenlanders-dont-appreciate-trumps-advances-but-there-is-little-here-to-stop-us-troops-13491258",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-greenland-danish-flag_7128142.jpg?20260106142605",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2026-01-06 17:54:00",
        "Headline": "The US president has not shown NATO much respect and taking Greenland may be hard to resist. But doing so would effectively end the Western alliance.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n Greenland is in the eye of an intense diplomatic storm, not that you would know it being here. The mother of all diplomatic rows is erupting over Donald Trump's renewed claims on the place. A joint statement by European leaders marks an extraordinary moment and a new nadir in transatlantic relations. It warns President Trump in as many words to back off. \"Greenland belongs to its people,\" it says. \"It is for Denmark and Greenland, and them only, to decide on matters concerning Denmark and Greenland.\" Greenlanders are taking it in their stride. They are getting used to Donald Trump's advances on their country. A very small minority welcomes them. We spoke to one of their leaders, Jorgen Boassen - en route to Greenland's capital Nuuk - in Copenhagen. \n                  Military action in Greenland 'always an option' says White House\n                 \n                  Trump says he's 'very serious' about taking Greenland - despite warnings it will end NATO\n                 \n                  Trump: US has to have Greenland\n                 He is in little doubt Trump will take Greenland and says he will welcome it. \"He will come. He has decided, you know. Nobody can change his mind, I know. I can feel that. But I think it's not bad. It's a new opportunity for us.\" The vast majority of islanders, though, reject Trump's attempt to annex their land, say opinion polls. Greenland's Prime Minister, Jens-Frederik Nielsen, gained power in last year's elections, campaigning for independence at some point in the future, from Denmark and certainly from the US. Read more from Sky News:Greenland PM and Europe warn US presidentCould Trump actually take over Greenland?  Over the weekend, he released a statement condemning the American president. \"That's enough now,\" wrote Mr Nielsen. \"No more pressure. No more insinuations. No more fantasies of annexation.\" Denmark's prime minister Mette Frederiksen has not minced her words. An American move on Greenland would be a NATO member country attacking the other, effectively the end of the alliance. But Donald Trump has not shown much respect for that alliance, and taking Greenland might be hard to resist, whatever the disastrous impact on transatlantic relations. If he sent in armed forces, there would be little stopping them, regardless of international outrage. There is a sense here that he may now go ahead and do it."
    },
    {
        "title": "US makes big commitment to Ukraine peace deal – but one man is missing from talks",
        "description": "Although not to be underplayed, the Anglo-French commitment to put a multi-national force into Ukraine after a ceasefire was always on the table.",
        "url": "https://news.sky.com/story/us-makes-big-commitment-to-ukraine-peace-deal-8211-but-one-man-is-missing-from-talks-13491316",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-sir-keir-starmer-steve-witkoff_7128506.jpg?20260106224212",
        "type": "World",
        "Author": "Alistair Bunkall",
        "Date Published": "2026-01-06 21:59:00",
        "Headline": "Britain, France, and the US are all making commitments to get a deal over the line, but the reaction of Russia remains unknown.",
        "Content": "\n          Europe correspondent\n              @AliBunkallSKY\n Although not to be underplayed, the Anglo-French commitment to put a multi-national force into Ukraine after a ceasefire was always on the table. But the US commitment, to provide a backstop if Russia invaded Ukraine again, is significant, not least because of the rocky, constantly changing tone from Donald Trump. The unexpected, late addition of Jared Kushner and Steve Witkoff in the post-meeting press conference was a sign of unity. The language was equally supportive: Witkoff described European leaders as \"colleagues\" and Sir Keir Starmer as \"incredible\". It seemed normal and yet the European-American relationship under Trump has been anything but. The elephant in the room - Greenland - was successfully put to one side for now, and for the sake of focusing on Ukraine. Trump latest: 'Military an option' to acquire Greenland \n                  Ukraine's allies meet to discuss security as Trump's Greenland threat looms\n                 \n                  Ukraine did not attack Putin's residence, says Trump after American checks\n                 \n                  How sanctions are boosting Russian wine\n                 But as much as tonight's outcome may satisfy the Ukrainians, there was one person not in Paris: Vladimir Putin. How will he react to the prospect of NATO member troops in Ukraine? Is he prepared to pull back his forces from part or all of the Donbas? Does he even want peace at all? For all the progress here in Paris, it's moot unless Putin is prepared to make concessions on his own maximalist demands."
    },
    {
        "title": "'Breakthrough' blood test at home could help more people spot Alzheimer's, say scientists",
        "description": "A new \"breakthrough\" blood test can help spot the key warning signs of Alzheimer's, latest research suggests.",
        "url": "https://news.sky.com/story/breakthrough-blood-test-at-home-could-help-more-people-spot-alzheimers-say-scientists-13491064",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-blood-test-alzheimers_7127867.jpg?20260106101403",
        "type": "World",
        "Author": "Mickey Carroll",
        "Date Published": "2026-01-06 10:05:00",
        "Headline": "The new self-sampling method, which is done at home and the dry sample sent by post, could make Alzheimer's testing much more accessible.",
        "Content": "\n          Science and technology reporter\n       A new \"breakthrough\" blood test can help spot the key warning signs of Alzheimer's, latest research suggests. The technique, using a blood sample taken with a finger prick at home and posted to a laboratory without refrigeration, could make detecting the disease easier, especially in places where traditional tests are hard to access, said scientists. They claimed the self-sampling method could \"fundamentally change\" how they conduct research into the progressive brain disorder. Alzheimer's is a type of dementia that affects memory, thinking and behaviour. It is usually tested for through brain scans or spinal fluid tests, which can be both invasive and expensive. There are also increasingly accurate clinical blood tests but they need trained personnel and temperature-controlled storage of the blood samples, which limits who can use them. In the new study, scientists found that by using a few drops of blood from the fingertip and drying it on a card, they could see proteins linked to Alzheimer's disease and other brain changes in 337 people. The results from the blood tests showed a strong correlation with more traditional tests, and the trial participants were able to get the blood samples themselves without help from the researchers. \n                  Ex-Man United star said heading ball 'hasn't helped' following dementia diagnosis before death\n                 \n                  Alzheimer's among elderly more widespread than previously thought, new study shows\n                 \n                  UK patients to trial blood test that could 'revolutionise' Alzheimer's diagnosis\n                 The study was led by Nicholas Ashton who works at the Banner Health Institute in Arizona and for the University of Gothenburg's Sahlgrenska Academy. He said: \"This breakthrough could fundamentally change how we conduct Alzheimer's research by proving that the same biomarkers doctors use to detect Alzheimer's pathology can be measured from a simple finger prick collected at home or in more remote community settings.\" The researcher added: \"While we're still years away from clinical use, we're opening doors to research that was previously impossible - studying diverse populations, conducting large-scale screening studies, and including communities that have been historically underrepresented in Alzheimer's studies.\" Read more from Sky News:Government plans new driving rule for over-70sNHS reveals first conditions eligible for video appointments The new self-sampling method, which is done at home and the dry sample sent by post, could make Alzheimer's testing much more accessible. \"What excites me most is that this work makes this type of research far more accessible,\" said Anne Corbett, professor in dementia research at the University of Exeter, which also contributed to the research. She added: \"We're moving toward a future where anyone, anywhere, can contribute to advancing our understanding of brain diseases. This isn't just a technical advancement - it's a paradigm shift in how we conduct neuroscience research.\" Co-author Clive Ballard, professor of age-related diseases at the University of Exeter Medical School, explained: \"Our ongoing work will determine whether this could also be a valuable way of identifying people in the community who would benefit from more detailed diagnostic tests for Alzheimer's disease.\""
    },
    {
        "title": "Why are people protesting in Iran? Everything you need to know",
        "description": "Protests sparked by a widening economic crisis have swept across Iran for more than a week.",
        "url": "https://news.sky.com/story/why-are-people-protesting-in-iran-everything-you-need-to-know-13490639",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-iran-protests_7122338.jpg?20251230174333",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-06 17:17:00",
        "Headline": "Protests in Iran have been ongoing for more than a week. Nearly 30 people are reported to have died, with thousands more arrested. Here is what you need to know.",
        "Content": "Protests sparked by a widening economic crisis have swept across Iran for more than a week. Demonstrations began in the capital, Tehran, on 28 December and have since spread to over 257 locations in 27 of Iran's 31 provinces, according to the US-based Human Rights Activists News Agency (HRANA). At least 29 people have died, two of which were members of Iran's security forces, and more than 1,200 people have been detained, HRANA reported. The protests do not appear to be slowing down and have the potential to be the biggest challenge clerical rulers have seen since the 1979 Islamic Revolution when former supreme leader Ayatollah Ruhollah Khomeini installed a Shia theocracy. Here is what you need to know. What caused the demonstrations? Demonstrations began on 28 December when shopkeepers and bazaar merchants in Tehran staged a strike as the Iranian currency hit an all-time low against the US dollar. Iran's economy has been suffering for years and problems were exacerbated after Donald Trump reimposed US sanctions during his first term as president in 2018 and ended an international deal over the country's nuclear programme. Sanctions from the United Nations were also reimposed on the country in September 2025. The country's long-standing economic crisis deepened again after Israel and the US launched strikes on the Islamic Republic in June last year in a 12-day war that targeted several of Iran's nuclear sites. Iran maintains its nuclear energy programme is entirely peaceful and claimed it has not tried to build a nuclear bomb. 'We are all caught up in this' Problems with the economy has meant the nation has been struggling with an annual inflation rate of some 40%, with prices of essentials including cooking oil, meat, rice and cheese increasing beyond the means of most people. \"We are all caught up in this. I mean everyone,\" Shirin, a 45-year-old housewife in the city of Kermanshah, told Sky News. \"A few days ago a tray of eggs were 280,000 tomans and now that has gone up to 500,000 tomans [approximately £9].\" She said the price of five kilograms of cooking oil had also jumped from 470,000 (approximately £11) to 1,200,000-1,400,000 tomans (approximately £25). It comes after Iranian President Masoud Pezeshkian announced his government will halt the process of providing a preferential subsidised rate of foreign currency to those who import goods. Instead, the state will give a monthly subsidy to each person in Iran. By doing so, merchants are likely to hike the price of goods when the measure comes into force on 10 January. Last year, the nation also introduced a new pricing tier for its nationally subsidised petrol, raising the price and putting further pressure on the population. How widespread are the protests? While protests initially focused on the economy, they have since focused on wider political issues, with protesters being heard chanting anti-government statements. Footage from 30 December showed university students marching alongside shopkeepers and merchants in Tehran, chanting \"rest in peace Reza Shah\", a reference to the founder of the royal dynasty ousted in the 1979 Islamic revolution. A day after, on 31 December, protesters attempted to storm a local government building in the southern Fars province, state media confirmed. The Fars news agency, which is believed to be close to Iran's paramilitary Revolutionary Guard, reported on 5 January that some 250 police officers and 45 members of the guard's voluntary Basij force were hurt in the demonstrations. It also alleged, without offering evidence, that demonstrators carried firearms and grenades. The most intense clashes have been reported in western parts of Iran, but there have also been clashes between demonstrators and police in central areas, and in the southern Baluchestan province. Demonstrators were filmed sitting down in front of security forces in Tehran's Grand Bazaar market, while videos circulated online reportedly showing security forces in Malekshahi County in Iran's Ilam province firing on civilians and raiding a hospital. President Mr Pezeshkian later said he assigned the interior ministry to form a special team for a \"full-fledged investigation\" of what had been happening in the province, acknowledging the \"incident in a hospital\". Ilam province is mainly home to the country's Kurdish and Lur ethnic groups and faces severe economic hardship. On 5 January Kurdish opposition groups - considered the strongest opposition to the current regime - met and expressed full support for the protests and \"uprisings against the Islamic Republic\". The seven parties agreed to \"intensify dialogue among Kurdish political forces\" and \"establish a roadmap to strengthen the political and national Kurdish movements in Iran\", which could indicate that protests may escalate further. How is the US involved? On 2 January, US president Mr Trump warned Iran via a post on social media that if Tehran \"violently kills peaceful protesters,\" the United States \"will come to their rescue\". \"We are locked and loaded and ready to go\", the president said, without specifying what actions he was considering. While it remains unclear how and if Mr Trump will intervene, his comments sparked an immediate, angry response, with Iranian officials threatening to target American troops in the Middle East. Read more from Sky News:Where could Trump strike next?What it was like inside Maduro's 'dramatic' court hearing The comments took on new importance after the US military captured and extradited Venezuelan president Nicolas Maduro, a longtime ally of Tehran, to New York. One Iranian official told Reuters that some authorities fear Iran could be \"the next victim of Trump's ‍aggressive foreign policy\". How has the Iranian government responded? Shortly after protests began, Mr Pezeshkian said he had asked the interior minister to listen to the \"legitimate demands\" of the protesters. The unusual response to unrest developed when the Iranian government offered to set up a dialogue with protest leaders on 30 December. \"We officially recognise the protests,\" the government said. \"We hear ​their voices and we know that this originates from natural pressure arising from the pressure on people's livelihoods.\" In his first comments on the disorder on 3 January, Supreme Leader Ayatollah ‌Ali Khamenei sought to differentiate between protesters and rioters, saying the latter should be \"should be put in their place\". Ali Larijani, an advisor to Mr Khamenei, added that the Iranian government \"consider the positions of the protesting merchants separate from those of the destructive elements\". Addressing comments made by Mr Trump he added: \"We and Trump should know that American interference in this internal issue is equivalent to chaos across the entire region and the destruction of American interests.\" Has this happened before? Protests in Iran are not unheard of, with protests occurring in the 1970s, 1990s and early 2000s. More recently, Iran faced protests across the country in 2022 over price hikes, including for bread. The country's clerical rulers were rocked by the boldest unrest in years over the same period and into 2023 after the death of a 22-year-old Iranian Kurdish woman, Mahsa Amini, in the custody of the morality police, who enforce strict dress codes. More than 500 people died in the months-long security crackdown and over 22,000 were detained."
    },
    {
        "title": "Sparkler candles banned by Swiss mayor after New Year's bar fire killed 40",
        "description": "The Swiss bar that caught fire during a New Year's celebration and killed 40 people had not been inspected since 2019, officials have said. ",
        "url": "https://news.sky.com/story/sparkler-candles-banned-by-swiss-mayor-after-new-years-bar-fire-killed-40-13491030",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-switzerland-bar-crans-montana_7124711.jpg?20260102194550",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-06 09:06:00",
        "Headline": "The fire at Le Constellation bar in Crans-Montana, Switzerland, on New Year's Day killed 40 people and injured 116.",
        "Content": "The Swiss bar that caught fire during a New Year's celebration and killed 40 people had not been inspected since 2019, officials have said.  The Crans-Montana mayor, Nicolas Feraud, apologised at a news conference, and said that all sparkler candles, which were blamed for the fire, have now been banned inside the town's venues. \"We are profoundly sorry,\" he told reporters. \"We did not have an indication that the checks had not been done.\" He added that bars in the town are meant to have such inspections each year. The incident at Le Constellation bar on New Year's Day also injured a total of 116 people, of whom more than two-thirds are still in hospital. Most of the victims were teenagers. The Municipality of Crans-Montana said it will commission an external firm to carry out an immediate inspection \"of all public establishments in the municipality\". Mr Feraud added that authorities have closed another venue run by the two managers of Le Constellation, who, according to the Valais region's chief prosecutor, are suspected of involuntary homicide, involuntary bodily harm and involuntarily causing a fire. \n                  British teenager confirmed dead after Swiss bar fire - as all 40 victims are identified\n                 \n                  Managers of Swiss bar where fire killed 40 during New Year's event face criminal investigation\n                 \n                  Swiss bar fire: 'We saw terrible things - it could have happened to me'\n                 On Sunday, police said circumstances did not currently merit the two people being put under arrest, and they did not see a flight risk. The mayor then said a 2019 fire report of the venue did not mention problems, that security considered the soundproof foam used in the bar to be acceptable at the time, and that a fire alarm was not required due to the bar's size. However, he added that fire checks of bars are required every year in Crans-Montana. Read more: Why 'Grenfell-like' material made fire at ski resort spread so fast All victims of the bar fire have since been identified, including a teenager with British citizenship. Charlotte Niddam, 15, and a joint British, Israeli and French national previously attended Immanuel College, a private school in Hertfordshire. In a post on social media, her family said: \"It is with great sadness that we announce the passing of our beautiful daughter and sister.\" Read more from Sky News:Baby formula batches recalledTrump: We need to take GreenlandUK feels coldest night of winter Giving an update on Monday, Swiss police said that 83 people injured in the fire were still in hospital. They did not give any further details. The severity of the burns suffered by some victims made the identification process more difficult, requiring families to supply DNA samples, authorities said."
    },
    {
        "title": "US troops injured during operation to capture Maduro - as Trump hails 'brilliant' military action",
        "description": "Donald Trump has revealed new details of the operation to capture Nicolas Maduro which saw \"many\" killed, as supporters of the deposed Venezuelan president took to the streets.",
        "url": "https://news.sky.com/story/donald-trump-says-many-killed-in-tactically-brilliant-venezuela-operation-but-mostly-cubans-13491212",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-republicans_7128175.jpg?20260106151650",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-06 16:07:00",
        "Headline": "The US president has heralded the \"amazing military feat\" that saw American forces capture the Venezuelan leader Nicolas Maduro, who he branded a \"bad guy\" who had \"killed millions of people\".",
        "Content": "Donald Trump has revealed new details of the operation to capture Nicolas Maduro which saw \"many\" killed, as supporters of the deposed Venezuelan president took to the streets. Describing the military operation as \"brilliant tactically\" and \"complex\", the US president said \"a lot of people were killed\" but they were \"mostly Cubans\". He clarified that no US military personnel were among the dead and the fatalities were \"on the other side\". However at least seven US service members were injured during the operation, a Pentagon official told Sky's US partner NBC News. One of those hurt suffered multiple gunshot wounds to the legs. Two service members are still recovering from their injuries, while the other five have returned to duty. Venezuela's military said at least 24 Venezuelan security officers were killed in the US operation. Cuba's government has said that 32 Cuban military and police officers working in Venezuela died in the operation. Venezuela's interim president Delcy Rodriguez has declared seven days of mourning for the members of its military who died. \n                  Trump announces 'high quality' oil deal with Venezuela\n                 \n                  Military action in Greenland 'always an option' says White House\n                 \n                  Why are people protesting in Iran? Everything you need to know\n                 \"We had a lot of boots on the ground, but it was amazing. And think of it, nobody was killed,\" Mr Trump said in an address to the Kennedy Centre on Tuesday. \"And on the other side, a lot of people were killed. Unfortunately, I say that, soldiers, Cubans, mostly Cubans, but many, many killed.\" Mr Trump said soldiers on the ground in Venezuela were \"protected and our guys weren't\", adding that electricity to \"almost the entire country\" was cut off during the operation that involved 152 aircraft. He also criticised US Democrats for failing to congratulate him on the seizure of Maduro, who he described as a \"bad guy\". \"He gets up there and he tries to imitate my dance a little bit... But he's a violent guy, and he's killed millions of people,\" he said. His remarks come as footage emerged of Venezuela's interior minister Diosdado Cabello and a group of armed men shouting their support for Maduro. \"Loyal forever, traitors never, doubting is treason,\" they chanted. Venezuela's attorney-general Tarek ​Saab said \"dozens\" of officials and civilians were killed, without specifying if he was talking about Venezuelans, and a team of three prosecutors would investigate the deaths. Mr Saab also criticised the US's seizure of Maduro to put him on trial for drugs and weapons charges in New York, arguing that America had no jurisdiction. Read more:Maduro says he is 'prisoner of war'Trump 'serious' about taking Greenland US House speaker Mike Johnson said he did not expect the US to deploy troops on the ground in Venezuela. The American military action was \"not a regime change\" operation, he told reporters. His comments came after US secretary of state Marco Rubio and other top officials briefed leaders in the US Congress on the operation in Venezuela on Monday. 👉 Tap here to follow Trump100 wherever you get your podcasts👈  The briefing was met with criticism from Democrats, with Senator Chuck Schumer saying the session \"posed far more questions than it answered\". Meanwhile, the US is believed to be planning to intercept a sanctioned tanker that has been used to carry Venezuelan crude oil, CBS News reported. The US would prefer to capture the ship rather than sink it, sources told the American broadcaster, in a move reminiscent of the military's seizure of another crude oil tanker in December. US forces have been pursuing the tanker - called the Marinera after its name was changed from Bella 1 - as part of its campaign of sanctions and military operations against Venezuelan tankers in the Caribbean. Ships like the Marinera are part of a so-called shadow fleet of ships that illegally transport oil between sanctioned nations like Russia, Iran and Venezuela."
    },
    {
        "title": "Trump is likely gambling he could get away with Greenland grab as NATO needs US more than he needs it",
        "description": "It is becoming increasingly clear that Donald Trump is serious about taking Greenland from Denmark, a NATO ally, despite warnings that such a move would destroy the alliance.",
        "url": "https://news.sky.com/story/trump-is-likely-gambling-he-could-get-away-with-greenland-grab-as-nato-needs-us-more-than-he-needs-it-13491116",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-greenland-denmark_7128047.jpg?20260106124820",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2026-01-06 13:40:00",
        "Headline": "The US president knows no European nation would seriously try to stop him by force - because they would lose.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n It is becoming increasingly clear that Donald Trump is serious about taking Greenland from Denmark, a NATO ally, despite warnings that such a move would destroy the alliance. The US president knows no European nation would seriously try to stop him by force because they would lose. He is also probably gambling that Washington could get away with an Arctic land grab, as the rest of NATO needs the US more than he needs them. Trump latest: Is Greenland next? Of course, diplomatic charm offensives or backroom deals may yet prevail, but the uncomfortable truth when it comes to Mr Trump's calculations is that he has a point. Decades of overreliance by most NATO nations on American fighting power, weapons and technology mean the ability of the transatlantic alliance to defend itself without the United States (let alone counter a threat from Washington) has become dangerously compromised. The UK, despite presenting itself as the most powerful European military in NATO, is in a particularly precarious position. Its armed forces have benefitted hugely from the \"special relationship\" with the US, most notably through a unique partnership on nuclear weapons, such as the missiles and submarines that launch the warheads. The British government says its nuclear capability - the cornerstone of defence and security policy - is sovereign. But the US relationship is clearly a vital component. Britain's reliance on conventional US military power is also critical. On a battlefield, things known as enablers are key, and America provides a lot of them. This includes intelligence feeds from satellites to find and track targets, electronic warfare capabilities to protect aircraft, warships and tanks from enemy attack, and logistical supplies - vital for any military to be able to replenish stores or transport troops and supplies. Read more from Sky News:Ukraine's allies meet as Trump's Greenland threat loomsMaduro says he is 'prisoner of war' NATO alliance assumes it will operate alongside US in war In any wartime scenario, the UK assumes it will be operating alongside the US, with its far larger and better-equipped army, navy and air force. This has allowed successive British governments over the years to scrimp on expensive additional \"enabling\" capabilities in the belief that America would always be there. But what if it is not? The same question is true for the rest of the NATO alliance. Most other member states similarly rely on US enablers to help their troops be as effective as possible, especially on the modern battlefield. Then there is all the American kit bought and operated by British and other NATO armed forces, such as Chinook helicopters, F-35 fast jets and P-8 maritime patrol aircraft. NATO tries to do more in anticipation of US soldiers doing less Plans drawn up by the Supreme Allied Commander Europe (SACEUR) - NATO's top military commander and a role that has so far always been held by an American officer - to defend allied territory rely on contributions from all 32 member states. However, the US still has a dominant role even as its European allies and Canada try to do more in anticipation of American soldiers being told to do a lot less. And that is the reality now, before any mention of Greenland. Greenland threats should be final wake-up call for UK, Europe and Canada In the wake of Mr Trump's strikes on Venezuela and capture of its president, Danish Prime Minister Mette Frederiksen warned that an attack by the US on a NATO ally - namely Greenland - would spell the end of the alliance and \"post-Second World War security\". But, as the biggest losers from such a breakdown in security apparatus would be the rest of NATO, such a prospect is hardly going to deter America's commander-in-chief. Instead, it should be the final wake-up call for the UK, Europe and Canada never to allow themselves to slide into such a position of profound weakness again."
    },
    {
        "title": "Military action in Greenland 'always an option' says White House",
        "description": "Using the military to take Greenland is \"always an option\" the White House says, amid mounting tension over Donald Trump's plans for the territory.",
        "url": "https://news.sky.com/story/military-action-in-greenland-always-an-option-says-white-house-13491330",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/d8e87493b7d85a48cf7cc96d235b8325d995d88a7ceb256b12554b878890f99a_7127964.jpg?20260107021120",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-06 22:19:00",
        "Headline": "A statement from the Trump administration said utilising the US military was one of a range of options open to the president regarding Greenland.",
        "Content": "Using the military to take Greenland is \"always an option\" the White House says, amid mounting tension over Donald Trump's plans for the territory. The US president has been vocal about his desire to annex the self-governing island, despite it being part of Denmark - a NATO ally. In recent days, Danish Prime Minister Mette Frederiksen has warned that US military action to seize the territory would spell the end of NATO. But now a statement from the White House has defended a military approach, insisting that it is \"always an option\" open to the president. The statement said: \"President Trump has made it well known that acquiring Greenland ‌is a national security priority ‌of the United States, and it's vital ​to deter our adversaries in the Arctic region. \"The ‍president and his team are discussing a range of options to pursue this important ‌foreign policy goal, ⁠and of course, utilizing the ‌US military is ‍always an option at the commander-in-chief's disposal.\" The foreign ministers of Denmark and Greenland have requested a meeting with US secretary of state Marco Rubio. Trump: We need Greenland Fears that the US will act against Greenland have mounted following the arrest of Venezuelan president Nicolas Maduro in an audacious American raid on Caracas. Mr Trump has justified his actions on the international stage by citing the Monroe Doctrine - a US policy named after former president James Monroe, who asserted the right of his country to intervene in foreign affairs across the Americas in its own interest. And with the door left open to further interventions in the western hemisphere, the president has reiterated his territorial ambitions for Greenland. On Monday, he spoke to Sky's US partner network NBC News about Greenland, saying that \"we need it for national security, right now\". US threats 'not going away' With tensions mounting, Prime Minister Sir Keir Starmer has joined other leaders from Europe and Canada in throwing his weight behind Ms Fredriksen and Denmark, saying \"I stand with her. She's right about the future of Greenland.\" But a senior US official told Reuters that opposition from other NATO leaders would not stop the push to bring Greenland under US control. \"It's not going away,\" the official said, speaking on condition of anonymity. Read more:There's a sense in Greenland that US may now take it overTrump has ripped up the rule book, where could US strike next? How could US take Greenland? One option described was the outright purchase of the territory. They said: \"Diplomacy is always the president's first option with anything, and dealmaking. \"He loves deals. So if a good deal can be struck to acquire Greenland, that would definitely be his first instinct.\" Another option involved creating a ‌Compact of Free Association (COFA) between the US and Greenland. The US already has COFA deals with three Pacific Island nations, giving America military access in exchange for financial aid. The official added that Mr Trump wants to acquire Greenland during his current term in office."
    },
    {
        "title": "There's a sense in Greenland that Trump may now take over territory",
        "description": "Greenland is in the eye of an intense diplomatic storm, not that you would know it being here.",
        "url": "https://news.sky.com/story/greenlanders-dont-appreciate-trumps-advances-but-there-is-little-here-to-stop-us-troops-13491258",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-greenland-danish-flag_7128142.jpg?20260106142605",
        "type": "US",
        "Author": "Dominic Waghorn",
        "Date Published": "2026-01-06 17:54:00",
        "Headline": "The US president has not shown NATO much respect and taking Greenland may be hard to resist. But doing so would effectively end the Western alliance.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n Greenland is in the eye of an intense diplomatic storm, not that you would know it being here. The mother of all diplomatic rows is erupting over Donald Trump's renewed claims on the place. A joint statement by European leaders marks an extraordinary moment and a new nadir in transatlantic relations. It warns President Trump in as many words to back off. \"Greenland belongs to its people,\" it says. \"It is for Denmark and Greenland, and them only, to decide on matters concerning Denmark and Greenland.\" Greenlanders are taking it in their stride. They are getting used to Donald Trump's advances on their country. A very small minority welcomes them. We spoke to one of their leaders, Jorgen Boassen - en route to Greenland's capital Nuuk - in Copenhagen. \n                  Military action in Greenland 'always an option' says White House\n                 \n                  Trump says he's 'very serious' about taking Greenland - despite warnings it will end NATO\n                 \n                  Trump: US has to have Greenland\n                 He is in little doubt Trump will take Greenland and says he will welcome it. \"He will come. He has decided, you know. Nobody can change his mind, I know. I can feel that. But I think it's not bad. It's a new opportunity for us.\" The vast majority of islanders, though, reject Trump's attempt to annex their land, say opinion polls. Greenland's Prime Minister, Jens-Frederik Nielsen, gained power in last year's elections, campaigning for independence at some point in the future, from Denmark and certainly from the US. Read more from Sky News:Greenland PM and Europe warn US presidentCould Trump actually take over Greenland?  Over the weekend, he released a statement condemning the American president. \"That's enough now,\" wrote Mr Nielsen. \"No more pressure. No more insinuations. No more fantasies of annexation.\" Denmark's prime minister Mette Frederiksen has not minced her words. An American move on Greenland would be a NATO member country attacking the other, effectively the end of the alliance. But Donald Trump has not shown much respect for that alliance, and taking Greenland might be hard to resist, whatever the disastrous impact on transatlantic relations. If he sent in armed forces, there would be little stopping them, regardless of international outrage. There is a sense here that he may now go ahead and do it."
    },
    {
        "title": "US troops injured during operation to capture Maduro - as Trump hails 'brilliant' military action",
        "description": "Donald Trump has revealed new details of the operation to capture Nicolas Maduro which saw \"many\" killed, as supporters of the deposed Venezuelan president took to the streets.",
        "url": "https://news.sky.com/story/donald-trump-says-many-killed-in-tactically-brilliant-venezuela-operation-but-mostly-cubans-13491212",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-republicans_7128175.jpg?20260106151650",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-06 16:07:00",
        "Headline": "The US president has heralded the \"amazing military feat\" that saw American forces capture the Venezuelan leader Nicolas Maduro, who he branded a \"bad guy\" who had \"killed millions of people\".",
        "Content": "Donald Trump has revealed new details of the operation to capture Nicolas Maduro which saw \"many\" killed, as supporters of the deposed Venezuelan president took to the streets. Describing the military operation as \"brilliant tactically\" and \"complex\", the US president said \"a lot of people were killed\" but they were \"mostly Cubans\". He clarified that no US military personnel were among the dead and the fatalities were \"on the other side\". However at least seven US service members were injured during the operation, a Pentagon official told Sky's US partner NBC News. One of those hurt suffered multiple gunshot wounds to the legs. Two service members are still recovering from their injuries, while the other five have returned to duty. Venezuela's military said at least 24 Venezuelan security officers were killed in the US operation. Cuba's government has said that 32 Cuban military and police officers working in Venezuela died in the operation. Venezuela's interim president Delcy Rodriguez has declared seven days of mourning for the members of its military who died. \n                  Trump announces 'high quality' oil deal with Venezuela\n                 \n                  Military action in Greenland 'always an option' says White House\n                 \n                  Why are people protesting in Iran? Everything you need to know\n                 \"We had a lot of boots on the ground, but it was amazing. And think of it, nobody was killed,\" Mr Trump said in an address to the Kennedy Centre on Tuesday. \"And on the other side, a lot of people were killed. Unfortunately, I say that, soldiers, Cubans, mostly Cubans, but many, many killed.\" Mr Trump said soldiers on the ground in Venezuela were \"protected and our guys weren't\", adding that electricity to \"almost the entire country\" was cut off during the operation that involved 152 aircraft. He also criticised US Democrats for failing to congratulate him on the seizure of Maduro, who he described as a \"bad guy\". \"He gets up there and he tries to imitate my dance a little bit... But he's a violent guy, and he's killed millions of people,\" he said. His remarks come as footage emerged of Venezuela's interior minister Diosdado Cabello and a group of armed men shouting their support for Maduro. \"Loyal forever, traitors never, doubting is treason,\" they chanted. Venezuela's attorney-general Tarek ​Saab said \"dozens\" of officials and civilians were killed, without specifying if he was talking about Venezuelans, and a team of three prosecutors would investigate the deaths. Mr Saab also criticised the US's seizure of Maduro to put him on trial for drugs and weapons charges in New York, arguing that America had no jurisdiction. Read more:Maduro says he is 'prisoner of war'Trump 'serious' about taking Greenland US House speaker Mike Johnson said he did not expect the US to deploy troops on the ground in Venezuela. The American military action was \"not a regime change\" operation, he told reporters. His comments came after US secretary of state Marco Rubio and other top officials briefed leaders in the US Congress on the operation in Venezuela on Monday. 👉 Tap here to follow Trump100 wherever you get your podcasts👈  The briefing was met with criticism from Democrats, with Senator Chuck Schumer saying the session \"posed far more questions than it answered\". Meanwhile, the US is believed to be planning to intercept a sanctioned tanker that has been used to carry Venezuelan crude oil, CBS News reported. The US would prefer to capture the ship rather than sink it, sources told the American broadcaster, in a move reminiscent of the military's seizure of another crude oil tanker in December. US forces have been pursuing the tanker - called the Marinera after its name was changed from Bella 1 - as part of its campaign of sanctions and military operations against Venezuelan tankers in the Caribbean. Ships like the Marinera are part of a so-called shadow fleet of ships that illegally transport oil between sanctioned nations like Russia, Iran and Venezuela."
    },
    {
        "title": "Musk must urgently deal with Grok AI's ability to generate sexualised images, government warns",
        "description": "Elon Musk's X must urgently deal with its in-built artificial intelligence Grok being used to generate \"absolutely appalling\" fake sexualised images, Technology Secretary Liz Kendall has said. ",
        "url": "https://news.sky.com/story/musk-must-urgently-deal-with-grok-ais-ability-to-generate-sexualised-images-government-warns-13491169",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-grok-xai-elon-musk_7127468.jpg?20260105181755",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-06 13:47:00",
        "Headline": "Since the start of the new year, numerous X users have reported accounts using Grok to generate images of them without clothing.",
        "Content": "Elon Musk's X must urgently deal with its in-built artificial intelligence Grok being used to generate \"absolutely appalling\" fake sexualised images, Technology Secretary Liz Kendall has said.  Ofcom raised \"serious concerns\" on Monday with the social media platform's AI tool, as it can be used to create \"undressed images of people and sexualised images of children\". Since the start of the new year, X users - mainly women - have reported that accounts have used Grok to generate images of them without clothing. There are also several cases where Grok has created sexualised images of children, according to analysis by news agency Reuters. \"What we have been seeing online in recent days has been absolutely appalling, and unacceptable in decent society,\" said Ms Kendall. \"No one should have to go through the ordeal of seeing intimate deepfakes of themselves online. \"We cannot and will not allow the proliferation of these demeaning and degrading images, which are disproportionately aimed at women and girls. \n                  'Breakthrough' blood test at home could help more people spot Alzheimer's, say scientists\n                 \n                  NHS reveals first conditions eligible for video appointments\n                 \n                  Ofcom makes 'urgent contact' with X over concerns Grok AI can generate 'sexualised images of children'\n                 \"X needs to deal with this urgently. It is absolutely right that Ofcom is looking into this as a matter of urgency and it has my full backing to take any enforcement action it deems necessary.\" Sir Ed Davey, the leader of the Liberal Democrats, has called for the National Crime Agency (NCA) to launch a criminal investigation into X. He said some of the Grok-generated images are \"disgusting\" and called on the UK government \"to act very quickly to stop this, probably to reduce access to X\". Sir Ed, who has a long-running rivalry with X owner, Elon Musk, called for the tech billionaire to be \"held to account\". Sky News has seen multiple users sharing disgust, after non-consensual deepfakes of themselves in bikinis were shared on the app. A statement shared on X's official safety account said: \"We take action against illegal content on X, including Child Sexual Abuse Material (CSAM), by removing it, permanently suspending accounts, and working with local governments and law enforcement as necessary.\" A post on the Grok X account previously said there had been \"isolated cases where users prompted for and received AI images depicting minors in minimal clothing. \"xAI has safeguards, but improvements are ongoing to block such requests entirely,\" it added. On Friday, French ministers reported sexually explicit content generated by Grok on X to prosecutors, saying that the \"sexual and sexist\" content was \"manifestly illegal\". Can X be forced to take action? Under the Online Safety Act, which began being fully enforced in July, it is an offence to share intimate imagery of someone without their permission, even if it is made using AI. The act allows companies that enable deepfakes to be shared online to be fined up to £18m, or 10% of their qualifying worldwide revenue, whichever is greater.  That applies even if the company is based outside the UK, like X, but has a lot of UK users or the potential to harm UK users. The EU has similar regulation, called the Digital Services Act (DSA), and can also fine companies. In fact, just last month, X was handed a €120m (£104m) fine for breaching the DSA - a move that has caused consternation in the US, where the vice president JD Vance is among those who have attacked European \"censorship\" of free speech, leaving Keir Starmer and other leaders having having to mount a defence. Read more:Why Trump administration is so annoyed with Europe's online rules In December, the Trump administration sanctioned British and European online safety campaigners it accused of censoring \"American viewpoints\". However, in the USA, some groups are also calling on authorities to take action against xAI. The Consumer Federation of America (CFA) on Monday wrote to the Federal Trade Commission, the Federal Communications Commission, the Department of Justice, and all attorneys general, demanding swift action. \"xAI is purposefully and recklessly endangering people on their platform and hoping to avoid accountability just because it's 'AI',\" said Ben Winters, Director of AI and Data Privacy at CFA. \"AI is no different than any other product - the company has chosen to break the law and must be held accountable.\""
    },
    {
        "title": "Who is Barry Pollack - the seasoned lawyer representing Nicolas Maduro?",
        "description": "When the ousted Venezuelan president Nicolas Maduro stands on trial in New York he will have a seasoned lawyer representing him.",
        "url": "https://news.sky.com/story/who-is-barry-pollack-the-seasoned-lawyer-representing-nicolas-maduro-13491096",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-barry-pollack-lawyer_7127396.jpg?20260105172042",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-06 11:08:00",
        "Headline": "The Washington veteran defending the deposed Venezuelan leader, has previously represented WikiLeaks founder Julian Assange and is said to \"reek credibility\". ",
        "Content": "When the ousted Venezuelan president Nicolas Maduro stands on trial in New York he will have a seasoned lawyer representing him. Barry Pollack, the lawyer who represented WikiLeaks founder Julian Assange, will defend Maduro who faces drugs and weapons charges after being extradited in a US military operation. Mr Pollack stood next to Maduro on 5 January as he pleaded not guilty to the numerous charges, including narco-terrorism conspiracy. Maduro's trial will be closely watched around the globe and potentially involve legal challenges. So who is the veteran lawyer who has taken on the case? Who is Barry Pollack? Mr Pollack is a partner at Harris St Laurent & Weschler LLP, a boutique law firm based in New York and has a career spanning more than 30 years. A graduate of Indiana University and Georgetown University School of Law, he has extensive experience representing individuals including executives and high-ranking government officials as well as corporations. Over his three-decade career, according to the law firm guide Chambers USA, Mr Pollack has cultivated a reputation in elite legal circles as a \"thorough and deep-thinking lawyer\" who \"lives, breathes and sleeps trials\". Andy Birrell, the president of the National Association of Criminal Defence Lawyers, a group Mr Pollack once headed, described him to Sky News' US partner network, NBC News, as someone who \"reeks credibility\". \"There's always challenges in high-profile cases, but Barry's a veteran. He's done it before,\" Mr Birrell said. \"He's a person that absolutely reeks credibility. I think that Barry's a person who presents as someone who is trying to get at the truth and people like that, they respect that.\" Assange plea deal  One of Mr Pollack's most high profile cases was representing Julian Assange. The WikiLeaks founder faced US Espionage Act charges for the website's mass release of secret documents, including diplomatic cables and accounts of military action in Iraq and Afghanistan. After months of negotiations, he pleaded guilty to a single count of conspiring to obtain and disclose classified defence information. The 2024 deal Mr Pollack struck let Assange walk out of a British prison and enter his plea in the US before returning to his native Australia. In remarks to reporters after Assange's release in 2024, Mr Pollack argued that his client never should have been charged under the Espionage Act and framed the case as a test of free speech rights. Other successes for Mr Pollack include winning a complete acquittal for Michael Krautz, a former accountant at energy company Enron, who faced criminal fraud charges. He also defended Martin Tankleff, who served 17 years in prison after having been wrongfully convicted of killing his parents as a teenager. Mr Pollack managed to get those convictions reversed and all charges against him dismissed. What has Pollack said about Maduro? At Maduro's arraignment in Manhattan federal court Mr Pollack said he expected to contest what he termed Maduro's \"military abduction,\" signalling that the defence will argue the US military's operation to capture him was unlawful. At one point near the end of the hearing, he said his client \"is head of a sovereign state and entitled to the privilege\" that the status ensures. He added that Maduro was not requesting his release, but may do at a later stage. Read more:What it was like inside Maduro's 'dramatic' court hearingMaduro successor banned from UKHow America captured Venezuela's president What about Cilia Flores? Mark Donnelly, a lawyer based in Houston, Texas is representing Maduro's wife and former first lady of Venezuela, Cilia Flores. Mr Donnelly joined the firm Parker Sanchez & Donnelly after 12 years working in the Department of Justice, where he worked as a senior advisor to the United States attorney for the southern district of Texas, according to his biography on the firm's website. He assisted in the impeachment trial of Texas Attorney General Ken Paxton in 2023 and his firm lists his areas of expertise as white collar criminal defence, business litigation, real estate litigation and whistleblower actions. In court on 5 January, Mr Donnelly said Flores had sustained significant injuries during her capture, including severe bruising on her ribs. He asked that she be provided X-rays and a physical evaluation. The former first lady was pictured with bandages on her forehead and right temple."
    },
    {
        "title": "Mickey Rourke tells fans he is not behind 'humiliating' $100k eviction fundraiser",
        "description": "Hollywood star Mickey Rourke has told fans he is not behind a \"humiliating\" fundraising website set up to support him - and urged well-wishers to try and get their money back as the total reached almost $100,000.",
        "url": "https://news.sky.com/story/mickey-rourke-tells-fans-he-is-not-behind-humiliating-100k-eviction-fundraiser-13491063",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-mickey-rourke-instagram_7127875.jpg?20260106102201",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-06 11:40:00",
        "Headline": "A GoFundMe page set up at the weekend said The Wrestler star was facing a \"very real and urgent situation: the threat of eviction from his home\". However, the actor has denied being behind it and told fans to try and get their money back.",
        "Content": "Hollywood star Mickey Rourke has told fans he is not behind a \"humiliating\" fundraising website set up to support him - and urged well-wishers to try and get their money back as the total reached almost $100,000. The Oscar-nominated actor and former boxer shared a video statement on Instagram saying he was \"really frustrated\" and \"confused\" by the page, titled \"Help Mickey Rourke Stay in His Home\", which was set up on crowdfunding platform GoFundMe over the weekend. \"Somebody set up some kind of foundation or fund for me, to donate money, like in a charity, and that's not me,\" Rourke told his 488,000 followers, saying he did not know who was behind it. \"If I needed money I wouldn't ask for no f***ing charity.\" The GoFundMe page said Rourke was facing a \"very real and urgent situation: the threat of eviction from his home\". The page organiser is listed as Liya-Joelle Jones, an assistant to Rourke's manager, Kimberly Hines, and its description said it had been set up with his \"full permission to help cover immediate housing-related expenses\" and prevent eviction from happening. According to the Hollywood Reporter, which first reported on the fundraiser, Jones told the outlet Rourke was \"going through a very difficult time right now\" and it had been \"incredibly touching to see how many people care about him and want to help\". Sat with his dog, Lucky, in his video, Rourke denied having anything to do with the page and said he was going to talk to his lawyer to \"get to the bottom of this\". The 73-year-old admitted he had done a \"really terrible job\" in managing his career, but said after years of therapy, he has \"worked very hard\" and is \"not that wild man\" of his past. The actor was known for films including 9 1/2 Weeks, Rumble Fish and The Pope of Greenwich Village in the 1980s, and continued to act while also pursuing his boxing career in the 1990s. In 2008, he starred in The Wrestler - a performance that earned him a BAFTA and an Oscar nomination for best actor. In 2025, he appeared on Celebrity Big Brother in the UK, but was kicked out of the house over \"use of inappropriate language\" and \"instances of unacceptable behaviour\". He caused upset in the house from the start and made former Dance Moms star JoJo Siwa cry after making comments about her sexuality. In his video, Rourke said COVID and the Hollywood strikes in 2023 had \"killed\" his money, and he had previously been in a \"bad situation\" with his rent. Read more from Sky News:Was the US attack in Venezuela legal?Chalamet and Buckley among Critics Choice winners However, he described the fundraising page as \"very embarrassing\", and told fans: \"Don't give any money, and if you gave money, get it back… \"I would never ask strangers or fans or anybody for a nickel. That's not my style. You ask anyone who knows me. It's humiliating and it's really f***ing embarrassing.\" He told fans he is \"grateful for what I have - I've got a roof over my head, I've got food to eat… everything's okay\", and added: \"Get your money back, please, I don't need anybody's money and I wouldn't do it this way, I've got too much pride.\" Sky News has contacted Hines and representatives for Rourke for comment."
    },
    {
        "title": "Fujitsu boss rejects MP's claim firm is 'a parasite on the British state'",
        "description": "Fujitsu's European boss has denied that the company is \"a parasite on the British state\" after MPs challenged it over its position on Post Office scandal compensation.",
        "url": "https://news.sky.com/story/fujitsu-boss-rejects-mps-claim-firm-is-a-parasite-on-the-british-state-13491263",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-fujitsu-horizon-post-office_7128348.jpg?20260106185226",
        "type": "Business",
        "Author": "Adele Robinson",
        "Date Published": "2026-01-06 18:12:00",
        "Headline": "The company behind the Horizon post office scandal is yet to contribute towards compensation, despite saying two years ago it had a \"moral obligation\" to. ",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n Fujitsu's European boss has denied that the company is \"a parasite on the British state\" after MPs challenged it over its position on Post Office scandal compensation. The confrontation came during a parliamentary committee session examining the \"continued search for justice and accountability\" for victims. The government has set aside £1.8bn for redress for sub‑postmasters wrongly prosecuted due to failures in Fujitsu's Horizon IT system. The company is yet to contribute towards compensation despite saying it had a \"moral obligation\" to, two years ago. Paul Patterson, director at Fujitsu Services Ltd, was also questioned by MPs about the company securing public sector contract extensions worth an estimated £500m, amid assurances it would not bid for new UK government work. Chair of the Business and Trade Select Committee of MPs, Liam Byrne, told the executive: \"Your refusal to tell us how much Fujitsu will pay into a £1.8bn bill for taxpayers leads people to the conclusion that frankly Fujitsu is behaving like a parasite on the British state without an obligation to step up to its obligations.\" The Fujitsu boss rejected the accusation stating: \"We're not a parasite... the government has got an option as to whether they wish to extend those contracts or not. If you wish us to walk away from those contracts, we'll walk away from those contracts,\" he said. He argued that ending Fujitsu's government work would be \"detrimental to society\" and insisted the company had only extended its Post Office contract because ministers requested it. The executive pointed to Fujitsu's four‑decade presence in the UK, its 5,000 employees and its network of subcontractors, saying the firm remained \"a very serious organisation\" committed to its responsibilities. Pressure is mounting on the government to secure a substantial financial contribution from Fujitsu, which built and maintained the Horizon system at the centre of one of the UK's biggest miscarriages of justice. During the committee hearing, however, it became clear that Fujitsu will be waiting until the conclusion to the public inquiry into the scandal, chaired by Sir Wyn Williams, before announcing a specific figure. Read more:Second Horizon victim 'forced' to sue Post OfficeAppeal court delay for first Capture case Mr Patterson also said that Fujitsu needs to be \"informed by Sir Wyn\" adding that more information has come to light since he last appeared before the committee including about the \"Capture system\". \"I didn't know about a Capture system,\" he said, \"I didn't know there were victims of that, I didn't know there was legal advice in 2013 telling the Post Office what to do or not to. \"That is why Sir Wyn's advice is really, really important to us and will inform the commitment I am giving you again and that I have given to the committee before that we will contribute to redress.\" Capture was an accounting system used in the 1990s pre‑dating Horizon, which also produced unreliable data. Sky News has helped expose the scale of the scandal by uncovering a long‑lost document in a retired expert's garage. The session also heard from others connected to the Post Office scandal, including victims' lawyers, who echoed calls for greater urgency in delivering redress and justice. Nigel Railton, chair of the Post Office, said it was his personal opinion that the government should legislate to exonerate Capture victims, similar to Horizon victims."
    },
    {
        "title": "High street giant Next has bumper Christmas but remains cautious amid worsening UK jobs market",
        "description": "One of the UK's largest clothing retailers has reported a bumper Christmas but warned of a slowdown.",
        "url": "https://news.sky.com/story/high-street-giant-next-has-bumper-christmas-but-remains-cautious-amid-worsening-uk-jobs-market-13491009",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-next-retail_6826301.jpg?20250212084912",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2026-01-06 07:49:00",
        "Headline": "The company believes it will have a pre-tax profit of £1.15bn for the year to 31 January, £15m more than expected, thanks to strong sales in the run-up to Christmas.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n One of the UK's largest clothing retailers has reported a bumper Christmas but warned of a slowdown. The update from department store Next, considered a good indicator of the health of the high street, contrasts with the fortunes of Claire's and The Original Factory Shop (TOFS), which are on the brink of collapse with more than 2,000 jobs at risk. Next has, for the fifth time in a row, increased its profit guidance, believing it will have a pre-tax profit of £1.15bn for the year to 31 January, £15m more than expected, thanks to strong sales in the run-up to Christmas. Money blog: Three major pension reforms happening in 2026 The company again said it was boosted by the cyber attack on rival Marks and Spencer, \"very favourable summer weather\", and improved stock levels. Sales were up 10.6% in the nine weeks to Christmas, compared to last year, Next said. But it cautioned it will face a \"tough\" time in the UK through the first half of 2026 as it sees jobs market woes weighing on consumer spending. The unemployment rate has risen to 5.1% since Labour came to power in July 2024, as the increase in employer national insurance contributions weighed on hiring. \n                  Facewatch: The controversial tech that retailers have deployed to tackle shoplifting and violence\n                 \n                  Asda to sell 24 stores only to rent them back as it struggles with debt pile\n                 \n                  M&S reveals cost of cyber attack as profit almost wiped out\n                 Record Christmas for supermarkets Supermarkets also had a record festive period, according to industry data from consumer insight company Worldpanel by Numerator. Shoppers spent an average of £476 at supermarkets in December, the figures showed, and grocers saw sales rise 3.8% to £13.8bn in the four weeks to 28 December. Behind the rise was £1bn in spending on premium own brands for the first time, which were in 92% of shoppers' baskets as people sought to treat themselves at a lower price point. Deals and promotions were increasingly popular, making up a third (33.3%) of spending, up from 32% last year, the highest proportion of overall sales since December 2019, before the COVID pandemic. Lower price rises, as inflation slowed, increased use of loyalty cards and buying deals were behind the boost, Worldpanel by Numerator said."
    },
    {
        "title": "Trump needs US oil firms to make his Venezuela plan work - but can they deliver?",
        "description": "Donald Trump wants US oil companies to go into Venezuela, fix the oil infrastructure and boost production, but it's unlikely to be straightforward. ",
        "url": "https://news.sky.com/story/trump-needs-us-oil-firms-to-make-his-venezuela-plan-work-but-can-they-deliver-13491103",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-oil-venezuela_7107432.jpg?20251211133920",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2026-01-06 11:32:00",
        "Headline": "Difficulties in extracting Venezuela oil, sanctions and political uncertainty could mean problems for oil giants. But the rewards may be great and share prices are up. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Donald Trump wants US oil companies to go into Venezuela, fix the oil infrastructure and boost production, but it's unlikely to be straightforward.  The stakes are high - the US President has suggested oil will play a key role in financing his plans to \"run\" Venezuela until there has been a full transition following his forces' capture of former leader Nicolas Maduro. Mr Trump has said \"it won't cost us anything because the money coming out of the ground is very substantial\". The US, he added, would \"get reimbursed for everything that we spend\". But he is depending on private American companies to make the plan work. \"We're going to have our very large United States oil companies, the biggest anywhere in the world, go in, spend billions of dollars, fix the badly broken infrastructure, the oil infrastructure, and start making money for the country,\" Mr Trump told a press conference on Saturday following Maduro's capture. So, who are the firms he is depending on? Money blog: Three major pension reforms happening in 2026 \n                  Rush for gold and US oil shares after Trump's Venezuela strike\n                 \n                  UK must increase North Sea drilling to boost economy, says US ambassador\n                 \n                  Petrofac administration not a great start to the week for Ed Miliband though relief could come\n                 There is currently only one US multinational oil company in Venezuela - Chevron. Another two, Exxon Mobil and ConocoPhillips, left after Maduro's predecessor, Hugo Chavez, nationalised the oil industry, rendering them superfluous. Today there appears to be plenty of potential for increasing production - while Venezuela has the world's largest oil reserves, it accounts for just 1% of global supply. As Chevron has already been exporting oil from Venezuela, it could be best placed to benefit from production expansion. But the company is not prepared to talk about the potential opportunity from Maduro's overthrow, telling Sky News it did not comment on commercial matters or speculate on future investments. \"Chevron remains focused on the safety and wellbeing of our employees, as well as the integrity of our assets. We continue to operate in full compliance with all relevant laws and regulations,\" a spokesperson said. The other two big US oil companies - Exxon Mobil and ConocoPhillips - have outstanding claims against the Venezuelan government for its nationalisation of oil assets. ConocoPhillips is also giving little away on the prospects of Venezuelan projects, saying it is \"monitoring developments in Venezuela and their potential implications for global energy supply and stability\". \"It would be premature to speculate on any future business activities or investments,\" a spokesperson said. But reporting from CBS News said representatives from the trio are meeting US Energy Secretary Chris Wright on Thursday. Benefitting already Whether or not the oil majors see a business case in investing more in Venezuela, they're already benefiting from Maduro's removal through higher share prices. The value of Chevron's shares rose 5% on Monday, with ConocoPhillips boosted and Exxon Mobil gaining more than 2%. Trump latest: US president 'very serious' about taking Greenland Oil refiners Marathon Petroleum, Phillips 66, PBF Energy and Valero Energy have also seen their share price rises - between 3.4% and 9.3% - and shares in oil services companies Haliburton, Baker Hughes and SLB are up between 4% and 9%. A good investment case?  And if the appeal of more crude oil reserves to feed US oil refineries and fill petrol pumps isn't enough, Mr Trump has also offered to sweeten the deal. While he acknowledged the significant cost companies would have to incur to develop the infrastructure needed to increase production and move oil from Venezuela, Mr Trump said on Tuesday that they'll be \"reimbursed by us or through revenue\". But clear challenges and uncertainties remain that could complicate the picture. Venezuela's former vice president Delcy Rodriguez has been sworn in as the new premier with the approval of the Trump administration. But no one knows what will come next for the country's opposition and governance. How Venezuela will be ruled still remains to be seen. Even the specifics of oil regulation are unclear. Whether the US-imposed quarantine on Venezuelan oil - enforced initially in December to seek compliance from Caracas - stays in place is unknown. And Venezuela is still under international sanctions, so its exports are subject to extra levies. Challenges A previous major buyer of Venezuelan oil, China, is currently buying less due to the US quarantine and associated increased costs. There are also difficulties associated with extracting the more viscous kind of crude oil buried in the Venezuelan ground and the cost and time involved in updating the country's ageing infrastructure. Lastly, in seeking greater oil production in Venezuela Mr Trump is trying to push down oil prices. \"Having a Venezuela that's an oil producer is good for the United States because it keeps the price of oil down,\" the US President has said. But that movement in prices could dampen the appeal for the US oil companies he is relying on to get involved. Sky News has contacted Exxon Mobil for comment."
    },
    {
        "title": "How much has sacking managers cost Manchester United?",
        "description": "With Monday's decision to fire head coach Ruben Amorim, Manchester United payouts to sacked managers and their staff could have reached nearly &#163;98m since 2014, the year following longtime coach Sir Alex Ferguson's retirement. ",
        "url": "https://news.sky.com/story/how-much-has-sacking-managers-cost-manchester-united-13491240",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-manchester-united-ruben-amorim_7128278.png?20260106171615",
        "type": "Business",
        "Author": "Kate Schneider and Alicja Hagopian, data journalists",
        "Date Published": "2026-01-06 17:11:00",
        "Headline": "Ruben Amorim's dismissal means Manchester United will soon have paid out around £100m to fired managerial and senior staff since 2014.",
        "Content": "By Kate Schneider and Alicja Hagopian, data journalists  With Monday's decision to fire head coach Ruben Amorim, Manchester United payouts to sacked managers and their staff could have reached nearly £98m since 2014, the year following longtime coach Sir Alex Ferguson's retirement.  Amorim had managed Manchester United since November 2024 and was contracted to the club until the end of next season, in summer of 2027. Ending his contract 18 months early means Manchester United could face a £12m payout, Sky Sports News reports. The payout would come during a financially difficult time for the club, which have made a loss six years in a row. Since 2014, Manchester United have seen ten new managers - nearly one each year. Over the same period, they have paid out almost £86m in \"costs associated with loss of office\" to former team managers, coaches, other senior staff, and board members. The Sky News Data x Forensics team analysed the club's financial statements filed with the US Securities and Exchange Commission to calculate the cost of these payouts. Now, Amorim's estimated payout could push the total to nearly £98m. High manager turnover The high cost of Manchester United's payouts can largely be explained by high manager turnover over the past few years, said Kieran Maguire, associate professor in football finance at the University of Liverpool. \"There's been a lot of churn at Manchester United,\" said Mr Maguire. \"Each time you have a reset, there is a cost involved as far as the club is concerned.\" Since Sir Alex's retirement in 2013 after 27 years, the club has had six permanent managers and four interim managers. \"You could argue, it's a reflection of a lack of success because the clubs don't dismiss managers if they're successful,\" said Mr Maguire. Although new managers are often signed on for several years, many do not last the full length of their contract. In the post-Ferguson era, Manchester United managers in total have left the club with over 147 months - around 4,500 days - still left on their contracts. Most notably, David Moyes left less than one year into his six-year contract. The payout was at just £5m, according to reports at the time, far from the £36m which he would have earned over the full contract. The terms of these contracts vary, but many have break clauses which allow for early dismissals if certain conditions, such as qualifying for the Champions League, aren't met, explained Mr Maguire. The Big Six Despite Manchester United's high turnover rate, Chelsea and Tottenham have had the most managers among the traditional Big Six English Premier League clubs since 2010. Newly appointed Liam Rosenior will become Chelsea's sixteenth manager in as many years, following Enzo Maresca's departure last week. Since 2010, the team has rarely seen a manager make it past the two-year mark. Chelsea has spent £193m in payouts towards former managers, senior staff, executives, and board members since 2010, according to Mr Maguire's calculations. Tottenham's current manager Thomas Frank has been at the helm since the end of last season. The club has had twelve managers - counting separately Ryan Mason's two interim stints - since 2010. On the other hand, Liverpool, Arsenal, and Man City have ushered fewer managers through their doors. Though Liverpool saw rapid management turnover in the early 2010s, the club have seen more stability in recent years with only two managers in the past decade. Meanwhile, Arsenal have remained in mostly steady hands, with Mikel Arteta entering his sixth year as manager, following a short leadership stint from Unai Emery and several decades under Arsène Wenger. Man Utd's financial woes Manchester United's managerial woes are matched by financial ones, its filings show. The club has incurred losses six years in a row, with £39.7m lost in their most recent financial year. The club may also face additional, less obvious costs from replacing Amorim beyond the payments owed to him and departing staff from his core team. The £98m figure excludes the costs of recruiting new head coaches. For instance, Sky Sports News reported last year that releasing Ruben Amorim from his previous contract with Sporting Lisbon cost Manchester United around £9.2m. Once brought in, new managers often - although not always - choose to reshape the club's squad, said Mr Maguire. \"If a new manager wants to impose a particular style of football, then that becomes quite an expensive exercise because the manager will have identified playing talent that they want to recruit,\" he said. \"Therefore, it can often coincide with an increase in transfer spend.\" However, the costs of dismissing Amorim are likely ones the club are willing to swallow on the hopes they can improve their standings. Qualification for the Champions League, Mr Maguire said, is worth between a minimum of £40m and more than £150m if they secure the top place. Manchester United have failed to break into the top five in the Premier League since the 2022/23 season. \"Clubs such as Chelsea and Manchester United want to be in the Champions League and are therefore willing to incur a financial cost in sacking a manager if they believe that will allow them to get over,\" said Mr Maquire. \"With Manchester United sitting sixth in the Premier League, the club's leadership has reluctantly made the decision that it is the right time to make a change,\" read the club's statement announcing Amorim's departure. \"This will give the team the best opportunity of the highest possible Premier League finish.\""
    },
    {
        "title": "Cabinet revolt brewing over business rates hike - as hospitality warned not to protest",
        "description": "A cabinet revolt is brewing over the upcoming business rates increase - as hospitality has been warned not to protest, Sky News can reveal.",
        "url": "https://news.sky.com/story/cabinet-revolt-brewing-over-business-rates-hike-as-hospitality-warned-not-to-protest-13491082",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-yvette-cooper-rachel-reeves_7127911.jpg?20260106104715",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-01-06 10:39:00",
        "Headline": "Pubs have been banning Labour MPs in protest over the rises, which will begin in April.",
        "Content": "A cabinet revolt is brewing over the upcoming business rates increase - as hospitality has been warned not to protest, Sky News can reveal. There is \"ongoing cabinet-level opposition\" to the hike, and ministers are \"not happy about it\", deputy political editor Sam Coates revealed on the Politics at Sam and Anne's podcast. Politics latest updates In November's budget, Chancellor Rachel Reeves announced a shake-up to how business rates are calculated, with a new band for retail, hospitality and leisure - bringing an end to the relief scheme first introduced in 2020 during the pandemic. The sector argues the new business rates, while lower than before COVID, do not go far enough. They say because the tax is based on rateable property values (an official estimate of a commercial property's annual rental value), they are disproportionately affected because they have physical stores, restaurants and pubs - unlike online giants. 👉Listen to Politics at Sam and Anne's on your podcast app👈 \n                  Hundreds of jobs to be lost in TGI Fridays insolvency plan\n                 \n                  Budget 2025: Hospitality pleads for 'lifeline' as Rachel Reeves accused of imposing 'stealth tax'\n                 \n                  Former TGI Fridays chief in move to snap up UK chain \n                 Sir Keir Starmer has acknowledged the industry will struggle with the new rates, telling LBC this week: \"Obviously, what's happened is there were reductions in place during COVID, which were always going to be unwound. \"At some point, the overall rates are going to be lower. But I accept that because of revaluation, that means that some will have their bills going up.\" He said the government is putting transitional relief in place and they are looking at what else they can do, such as \"licensing freedoms\". Chef Tom Kerridge, who has four gastropubs, said his rateable values at The Coach in Marlow had risen 100% from £50,000 to £106,000, which he said is \"unsustainable\". Several pubs have already barred Labour MPs in protest at the changes. However, Sky News understands the government has been warning businesses not to protest over the changes if they want to get any concessions. Read more:Reeves' budget tax rises 'a pub killer', say landlordsRules-based system 'disintegrating before our eyes' An industry insider said the government has been telling the business community if they want help, then they should take a cue from farmers, who were given a reprieve just before Christmas when the government raised the threshold for inheritance tax from £1m to £2.5m. But, the industry insider said the government has been telling them farmers were \"good, fair negotiators and didn't make a big campaign of it, which is why they got what they wanted\". The messaging appears confusing as farmers carried out protests over many months, with tractors blocking Whitehall becoming commonplace. Sam Coates said: \"Anybody who spent a second in Whitehall looking at those tractors trundling down and the mass campaign knows that that's just utter nonsense. \"What's really happening here is, despite the facts being completely untrue, this is government basically threatening the industry. \"The implication, I don't know which Whitehall department it is, but the implication quite clearly is 'stop being so aggressive with your briefing if you want anything at all for your industry'. \"Now that doesn't smack of a government coming at things from a position of strength to my mind.\" The Valuation Office Agency, which provides the government with property valuations, has said an increase in rateable value does not necessarily mean a similar rise in business rates, as there is transitional relief available, including: • A £3.2bn transitional relief scheme to support the largest ratepayers, including airports and hospitality • £500m to help the smallest businesses • A £1.3bn expansion of the Supporting Small Business scheme for those who were eligible for retail, hospitality and leisure relief as they transition."
    },
    {
        "title": "Former owner Advent behind €6bn approach for Yodel-owner InPost",
        "description": "The private equity firm Advent International is spearheading a multibillion-euro takeover bid for InPost, the owner of British parcel delivery firm Yodel.",
        "url": "https://news.sky.com/story/former-owner-advent-behind-83646bn-approach-for-yodel-owner-inpost-13491137",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-inpost-locker_7128080.jpg?20260106131657",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-06 13:05:00",
        "Headline": "Advent International, which took InPost public nearly five years ago, is said to be part of a consortium exploring a fresh takeover of the e-commerce logistics giant, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The private equity firm Advent International is spearheading a multibillion-euro takeover bid for InPost, the owner of British parcel delivery firm Yodel. Sky News has learnt that Advent, which is a minority investor in InPost after taking it public in Amsterdam in 2021, is part of a consortium looking to acquire the company. Banking sources speculated on Tuesday that other major shareholders in InPost might also be involved in the consortium. Money latest: Mobile provider reveals price hike Any offer would be likely to value the company at in excess of €6bn (£5.2bn). Headquartered in Poland, InPost is among the world's biggest delivery and e-commerce logistics companies. In its most recent fiscal quarter, it delivered more than 350 million parcels across the markets in which it operates, including Britain. \n                  Trump announces 'high quality' oil deal with Venezuela\n                 \n                  Fujitsu boss rejects MP's claim firm is 'a parasite on the British state'\n                 \n                  High street giant Next has bumper Christmas but remains cautious amid worsening UK jobs market\n                 In a statement to the Euronext Amsterdam exchange on Tuesday, InPost said: \"In view of the recent share price and trading volume development, InPost S.A. announces that it has received an indicative proposal regarding a potential acquisition of all shares in the company. \"A special committee has been formed of supervisory and management board members of the company that will carefully consider all aspects of a potential transaction, ensuring that the interests of the company and all of its stakeholders are taken into account in the decision-making with respect to a potential transaction. \"At this time, there can be no assurance that this will lead to a transaction.\" Shares in InPost were up about 20% on the back of the statement, giving the company a market capitalisation of €5.8bn. Even with that surge, its stock has fallen by close to a fifth over the last year. Advent originally invested in InPost in 2017, later selling part of its stake to PPF, a Czech investment firm. Analysts speculated that PPF was also likely to be involved in any formal takeover bid. Advent and InPost declined to comment."
    },
    {
        "title": "TPG closes in on £1bn-plus deal for GP patient records system supplier",
        "description": "The American private equity giant TPG is closing in on a &#163;1bn-plus deal to buy the company which supplies the electronic patient record system used by the majority of Britain's GPs.",
        "url": "https://news.sky.com/story/tpg-closes-in-on-1631bn-plus-deal-for-gp-patient-records-system-supplier-13491127",
        "image_url": "https://e3.365dm.com/22/03/1920x1080/skynews-gp-doctor-video_5698052.jpg?20220308005255",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-06 12:46:00",
        "Headline": "The buyout firm is close to buying Optum UK, which supplies the systems used by NHS doctors to manage patient records, from US giant UnitedHealth, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The American private equity giant TPG is closing in on a £1bn-plus deal to buy the company which supplies the electronic patient record system used by the majority of Britain's GPs. Sky News has learnt that TPG has struck the outline of a deal to acquire Optum's UK operation, which is owned by the New York-listed healthcare giant UnitedHealth Group. Sources said the deal, which could be announced in the coming weeks, was likely to be worth in the region of £1.2bn-£1.4bn, although they cautioned that it had yet to be finalised and could still fall apart. Money latest: Mobile provider reveals price hike If concluded, the transaction will come just two years after the business last changed hands. One private equity source suggested that TPG could seek to combine Optum UK with Nextech, a US-based provider of electronic medical record software to doctors' practices. Optum UK's business includes EMIS, which was taken over by the UnitedHealth subsidiary in 2023 in a deal worth about £1.2bn. \n                  Trump announces 'high quality' oil deal with Venezuela\n                 \n                  Fujitsu boss rejects MP's claim firm is 'a parasite on the British state'\n                 \n                  High street giant Next has bumper Christmas but remains cautious amid worsening UK jobs market\n                 The takeover was engineered under the stewardship of Sir Andrew Witty, the former GlaxoSmithKline boss who has now stepped down as UnitedHealth's chief executive. The US-listed company's stock has fallen by exactly a third over the last year, leaving it with a market capitalisation on Tuesday of just under $310bn. Bank of America has been advising on the sale process, which also drew interest from buyout firms including Blackstone. The prospective sale formed part of efforts by Sir Andrew's successor, Stephen Hemsley, to arrest the company's alarming valuation decline, they added. Optum's takeover of EMIS was approved in September 2023 by British competition regulators following an in-depth Phase 2 investigation. TPG and Optum both declined to comment."
    },
    {
        "title": "FTSE 100 bosses' pay overtakes typical worker's annual salary in less than three days of 2026, says new research",
        "description": "The bosses of the most valuable UK-listed companies had to work less than three days of 2026 to earn more than a typical worker does in a year, new research shows.",
        "url": "https://news.sky.com/story/ftse-100-bosses-pay-overtakes-typical-workers-annual-salary-in-less-than-three-days-of-2026-13490984",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-waterloo-bridge-london_6988596.jpg?20250812074610",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-01-06 07:00:00",
        "Headline": "Average FTSE 100 CEO pay (excluding pension contributions) stands at £4.40m, equivalent to an hourly rate of £1,353.23 and 113 times the average full-time worker's pay of £39,039.",
        "Content": "The bosses of the most valuable UK-listed companies had to work less than three days of 2026 to earn more than a typical worker does in a year, new research shows. The earnings of FTSE 100 chief executives surpassed the average salary of British workers just before midday on Tuesday, according to analysis from thinktank the High Pay Centre. Average pay (excluding pension contributions) for heads of UK blue chip companies stands at £4.40m, equivalent to an hourly rate of £1,353.23 and 113 times the average full-time worker's pay of £39,039. The analysis is based on company pay disclosures and government statistics. Money blog: Three major pension reforms happening in 2026  The CEOs are not the only business leaders being well paid. Partners at so-called Magic Circle law firms will earn the average UK full-time salary on 8 January, while partners at the Big Four accounting firms will do so on 20 January. Those in the top 1% of incomes will reach the point on 19 March. \n                  Bank of America boss Brian Moynihan warns countries to 'be careful' when raising tax\n                 \n                  First Lady Mayor of London in more than 800 years celebrated in procession\n                 \n                  Medieval church tower suspended 45ft above ground in 'never seen before' feat\n                 It comes after the chief executive of the London Stock Exchange, Dame Julia Hoggett, said in November that UK companies were being more \"forceful\" in rewarding top executives with higher pay packages to attract the best talent. For the 2024-25 financial year, FTSE 100 chief executive pay grew by 6.8% to a record £4.58m from £4.29m the previous year, according to an earlier report by the High Pay Centre. Among the highest paid were Simon Peckham and Peter Dilnot, the former and current bosses of aerospace manufacturing company Melrose Industries, who received a combined salary of £58.9m in 2024-25. In December, Bet365, a non-listed betting company, was criticised after it was revealed chief executive Denise Coates received a pay package of at least £280m in 2025. 'Huge gulf in how most people's work is valued' Behind the gap between CEO and typical worker pay is the fall in trade union membership, the High Pay Centre said. \"The figures out today once again emphasise the huge gulf in how the work of most people is valued compared to a small number of feted executives,\" said the thinktank's interim director, Andrew Speke. \"The idea that executives, as a class, are individually contributing over 100 times more in value than the workers they rely on is simply not credible.\" \"Bolder\" reform beyond the government's recently passed Employment Rights Act is needed, Mr Speke said, calling for governance reform including democratic worker representation on all major company boards. \"We are also calling for companies that pay excessive sums to their highest earners to be taxed more, with the proceeds invested in education, helping to tackle deep-rooted inequalities and improve social mobility,\" he added."
    },
    {
        "title": "Nestle recalls baby formula batches over toxin fears",
        "description": "Batches of baby formula are being recalled due to the risk of a toxin that causes nausea, vomiting, and abdominal cramps.",
        "url": "https://news.sky.com/story/nestle-recalls-baby-formula-batches-over-toxin-fears-13490959",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-baby-formula-formula_7127632.jpg?20260106045837",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-01-06 04:51:00",
        "Headline": "Cereulide is highly heat-resistant, and unlikely to be destroyed by cooking, boiling water, or being made into baby formula.",
        "Content": "Batches of baby formula are being recalled due to the risk of a toxin that causes nausea, vomiting, and abdominal cramps. Nestle is recalling specific batches of its SMA infant formula and follow-on formula due to the potential presence of cereulide. The toxin is highly heat-resistant, and unlikely to be destroyed by cooking, boiling water, or being made into baby formula, the Food Standards Agency (FSA) said. Once consumed, it can lead to rapid onset of symptoms including nausea, vomiting, and abdominal cramps, the agency said. In a recall notice, Nestle said the step was a \"precautionary measure\" and that \"the safety and wellbeing of babies is our absolute priority\". The notice continued: \"There have been no confirmed reports of any illness associated with consumption of the products concerned. \"Nevertheless, out of an abundance of caution, Nestle has decided to perform this voluntary product recall in line with our strict product quality and safety protocols. \"Consumers who may have these batches should not feed this product to their baby.\" The notice added: \"We understand that this news may cause concern for parents, and we sincerely apologise for any concern or inconvenience caused to parents, caregivers, and customers.\" Read more from Sky News:Arctic blitz spreads across UKAll New Year's bar fire victims identified The affected products were on sale in the UK and Ireland, with the specific batch numbers listed on the FSA and Nestle websites. Batch codes can be found on the base of the tin or box for powdered formulas, or on the base of the outer box and on the container for ready-made formulas. Customers who bought an affected item are encouraged to contact Nestle for a refund."
    },
    {
        "title": "UK and France sign declaration of intent to send troops to Ukraine in event of peace deal",
        "description": "The UK and France have signed a joint declaration pledging to deploy troops to Ukraine in the event of a peace deal, to guarantee the nation's security.",
        "url": "https://news.sky.com/story/uk-and-france-sign-declaration-of-intent-to-send-forces-to-ukraine-in-event-of-peace-deal-13491266",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-emmanuel-macron-volodymyr-zelenskyy_7128346.jpg?20260106184015",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-06 18:33:00",
        "Headline": "Sir Keir Starmer and French President Emmanuel Macron have been holding a meeting of the Coalition of the Willing in Paris.",
        "Content": "The UK and France have signed a joint declaration pledging to deploy troops to Ukraine in the event of a peace deal, to guarantee the nation's security. The agreement states that a \"multinational force for Ukraine\" would be deployed to the eastern European country to deter further attacks from Russia and bolster security guarantees. This would also allow the Ukrainian armed forces to rebuild strength, Sir Keir Starmer has announced. Ukraine latest - follow live It follows a meeting of the so-called Coalition of the Willing in Paris on Tuesday afternoon, led by French President Emmanuel Macron and the British prime minister. Jared Kushner, the US president's son-in-law, and the US special envoy, Steve Witkoff, also attended the talks, along with a number of other European leaders, including Ukrainian President Volodymyr Zelenskyy. Starmer: We want peace that can last Sir Keir has previously stated that the UK might deploy troops to Ukraine following a peace deal, but this agreement now creates the legal framework for allowing British and French troops to operate there. The declaration was formally unveiled at a news conference by Mr Macron, Ukrainian President Volodymyr Zelenskyy and Sir Keir. Addressing the media, Sir Keir said: \"We've had a very constructive meeting. \"The purpose of the Coalition of the Willing is to help to deliver a peace that can last and to work with the US to guarantee Ukrainian security for the long term. \"This work is more advanced than ever.\" Europe correspondent Although not to be underplayed, the Anglo-French commitment to put a multi-national force into Ukraine after a ceasefire was always on the table. But the US commitment, to provide a backstop if Russia invaded Ukraine again, is significant, not least because of the rocky, constantly changing tone from Donald Trump. The unexpected, late addition of Jared Kushner and Steve Witkoff in the post-meeting press conference was a sign of unity. The language was equally supportive: Witkoff described European leaders as \"colleagues\" and Sir Keir Starmer as \"incredible\". It seemed normal and yet the European-American relationship under Trump has been anything but. The elephant in the room - Greenland - was successfully put to one side for now, and for the sake of focusing on Ukraine. But as much as tonight's outcome may satisfy the Ukrainians, there was one person not in Paris: Vladimir Putin. How will he react to the prospect of NATO member troops in Ukraine? Is he prepared to pull back his forces from part or all of the Donbas? Does he even want peace at all? Read Alistair's full analysis here The PM said the UK would participate in US-led \"monitoring and verification of any ceasefire\", would provide arms to Ukraine in the long-term, and would seek binding commitments to support Ukraine in case of a future armed attack by Russia. As well as ensuring that soldiers would be deployed on Ukrainian soil, the agreement also covers protection for Ukraine's skies and sea, Sir Keir added. The declaration also states that the two countries would establish \"military hubs\" in Ukraine, so that military equipment could be deployed for defensive needs. Sir Keir added: \"This is all about building the practical foundations on which peace would rest. But we can only get to a peace deal if Putin is ready to make compromises. \"We have to be frank - for all Russia's words, Putin is not showing that he is ready for peace.\" He concluded that the UK and its allies will continue to turn up the pressure on Russia until \"they come to the table in good faith\". Speaking at the news conference, Mr Macron said the summit had seen European nations discuss \"strong security guarantees\" with the US representatives, while Mr Zelenskyy called the joint declaration \"very concrete\". The Ukrainian president added: \"This illustrates the willingness of the coalition and the European countries to work for peace. \"We want to be ready so that when diplomacy reaches peace, we can deploy the forces of the Coalition of the Willing.\" US wants 'killing to stop' Ukraine already has enough details and knows which countries will get involved in the agreement, including what each of them will contribute separately, Mr Zelenskyy said. But he admitted that some issues \"remain open\" with the revised 20-point peace plan, with the biggest problem being \"the issue of territory\". Speaking on behalf of the US, Mr Witkoff said he would meet with the Ukrainian delegation again on Tuesday evening, but that they are \"largely finished with security protocols\". He added: \"We are here to mediate and help in the peace process, and we're prepared to do anything necessary to get to that place. President Trump strongly, fervently believes that this killing has to stop, that the carnage has to stop.\" Donald Trump's son-in-law, Mr Kushner, later said the agreement is \"a very, very big milestone\", in answer to a question from a journalist."
    },
    {
        "title": "Number of written questions to government departments doubles in a year",
        "description": "Key Whitehall departments had to answer almost twice as many questions from MPs and peers in 2025 as the year before - with AI blamed for the massive rise, Sky News can reveal.",
        "url": "https://news.sky.com/story/number-of-written-questions-to-government-departments-doubles-in-a-year-13491299",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-james-mcmurdock-mp_7004903.jpg?20250829182503",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2026-01-06 20:43:00",
        "Headline": "A senior government source has suggested MPs may be using AI to submit written questions to ministers.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Key Whitehall departments had to answer almost twice as many questions from MPs and peers in 2025 as the year before - with AI blamed for the massive rise, Sky News can reveal. MPs have been accused of diverting resources and wasting public money after the number of Written Parliamentary Questions (WPQs) rose to 90,331, up from 49,125 in 2024, which was close to the average for the previous decade. Politics latest - follow live The Department for Health and Social Care saw a 97% increase in questions compared to the previous year. The Home Office saw a 92% increase, the Department for Education saw a 97% increase, and the housing department saw a 101% increase. Submissions from some MPs surged 10 or 20-fold in the second half of 2025 compared to the same period the year before, following the general election. Just 10 MPs accounted for 20% of the Commons WPQs submitted in the second half of 2025. These included a Lib Dem MP, Al Pinkerton, whose use increased more than 20-fold from 36 to 721, and independent MP James McMurdock, who on 2 January alone saw 342 questions tabled in his name on a range of subjects from Palestine funding to road deterioration and the UK-Italy young leaders programme. All MPs we spoke to strongly rejected any claim that their questions waste time or are not in the public interest, and no MPs admitted to using AI in their questions. The increase was confined to pockets of the Commons, and there was no massive difference in the number of WPQs submitted by members of the House of Lords over the two periods compared. Many MPs believe WPQs are an essential tool for extracting critical information from government departments. Some told Sky News the growth in questions stemmed from the government's failure to answer their first attempts, while a number of new MPs said they were learning the system. Is AI behind the rise? But senior government sources have launched an extraordinary attack on MPs for the growth of questions - which they believe could be time-wasting. \"Some of the WPQs we are seeing are so obscure, and others are so generic, that you're regularly left wondering how any MP would have come up with them, and perhaps the answer is that they haven't,\" a senior source said. \"Put it this way: when we look at the increase in WPQs from some MPs, the random variety of subjects they're asking about, and the lack of any apparent rationale behind their questions, we ask ourselves: how would this look any different if all their WPQs were being generated by AI? And the truth is it wouldn't.\" Sky News has been told by multiple government sources they believe they are seeing the increased use of AI tools to generate written questions. They suggest an MP with a general interest in a subject may ask an AI tool to give them 10 questions to ask the government about it, or - if they simply want to get their numbers up in a hurry - may ask AI to provide them with multiple questions asking the government about its performance across a range of different areas. Read more from Sky News:UK agrees to send troops to Ukraine'Humiliating' defeats for Chagos deal However, one MP whose use of written questions has increased 10-fold in a year showed Sky News how he keeps a written list on his phone of every subject he wants to ask about and denied ever using AI to write them for him. Ben Obese-Jecty, Tory MP for Huntingdon, tabled 150 questions in the second half of 2024 and 1,683 in the same period a year later. He said if Whitehall wanted to reduce the number of questions, they should give better answers the first time they are asked. 'It's like a chess game' \"My message to those in government who are complaining about the volume of questions is: answer them properly, ensure that we can hold the government to account and maybe the number of questions that you have to suffer responding to will reduce,\" he told Sky News. \"I know that I personally don't use AI to write questions. I have a running list on my phone and as questions come up during the day I will make a note of something that I want to ask the government to get some more clarity on it.\" Sky News challenged Mr Obese-Jecty why he asked about such a variety of topics, including the impact on the grocery industry of weight loss drugs. \"All of the questions are certainly valid, and if they weren't valid, they wouldn't be allowed to be tabled in the first instance,\" he replied. \"A lot of those questions are [there because it's] like a chess game, and each question is effectively an opening gambit in a back and forth where you will ask a question and then slowly drill down into a topic.\" Civil servants 'spending half their time' with WPQs Under the current rules, MPs can submit up to 20 written questions electronically each day. There is currently an inquiry by the Commons Procedure Committee into WPQs, which could change this limit. The Whitehall source said: \"People think civil service departments are these huge bureaucracies where there are endless numbers of staff waiting to churn out answers to WPQs and FOI [Freedom of Information] requests. \"But the truth is the individual units in charge of each specific area are fairly small, and too many important civil service teams are currently spending half their time dealing with WPQs. \"MPs mean well, but if they are sending hundreds of WPQs asking for the latest update from the teams responsible for removing RAAC concrete in schools, or reducing cancer screening waiting times, or responding to Hurricane Melissa, they have to understand they are diverting resources from the actual work they're supposed to care about. \"If the House wants to remove the 20-per-day limit, while simultaneously allowing members to use AI to write their questions, that is a recipe for chaos.\""
    },
    {
        "title": "Learner drivers face longer waits for tests under new rules",
        "description": "Bereaved families and the AA say the government's long-awaited strategy to cut roads deaths does not go far enough, with \"missed opportunities\" to save young drivers.",
        "url": "https://news.sky.com/story/drink-drive-limit-to-be-lowered-and-new-restriction-on-learners-road-safety-plans-revealed-13491340",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-learner-driving-file-pic_7128532.jpg?20260107021416",
        "type": "Politics",
        "Author": "Dan Whitehead",
        "Date Published": "2026-01-06 22:49:00",
        "Headline": "Edmund King, president of The AA, told Sky News the new strategy was \"welcome\" and \"ambitious\", but fell short on protecting young motorists.",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n Bereaved families and the AA say the government's long-awaited strategy to cut roads deaths does not go far enough, with \"missed opportunities\" to save young drivers. The Road Safety Strategy published today includes plans for mandatory eye-tests for the over 70s, lowering the drink-drive limit in England and Wales, and to consult on a minimum learning period for new motorists of up to six months before taking a driving test. The government says this will give learner drivers more time to develop their skills, with statistics showing nearly a quarter of deaths and serious injuries on Britain's roads involve drivers aged 17-24, despite only making up around 6% of licence holders. But campaigners say the measure falls short of what could have been achieved. Nicole and Chris Taylor's daughter Rebecca was just 18 when she died in a car crash in Northamptonshire in 2008. \"If the government thinks this is enough for us - it's not enough, there's a lot more that should have been done and can be done,\" Nicole said. Chris said he was disappointed by the strategy. \"Having a longer learning period would be a good idea,\" he added. \"But the reality of this is that we have to let young drivers on their own at some point, therefore we need to protect them when that happens.\" The couple - along with hundreds of other families - have spent years campaigning for so-called Graduated Driving Licences (GDL) to be introduced. 'Missed opportunity' In countries such as Australia and Canada, GDLs see restrictions placed on newly-qualified drivers in their first few months of being behind the wheel, such as a limit on passenger numbers and a ban on driving late at night - factors that often feature in serious collisions. The measures have been proven to reduce serious injuries and deaths. Edmund King, president of The AA, told Sky News the new strategy was \"welcome\" and \"ambitious\", but fell short on protecting young motorists. He said: \"We've spoken to colleagues in Canada and Australia about GDLs and the one measure that they all tell us saves the most lives is limiting the number of same age passengers from a car for six months. \"We think that would have been a small price to pay and would save over 50 lives a year, so I think it is a missed opportunity.\" Read more:Worst areas for uninsured driving revealedSeven red flags your mechanic is ripping you off New strategy 'a turning point', says minister The government hopes the measures in the strategy - the first major reform to road safety in nearly two decades - will reduce deaths and serious injuries by 65% by 2035. Transport Secretary Heidi Alexander said: \"Every life lost on our roads is a tragedy that devastates families and communities. For too long, progress on road safety has stalled. This strategy marks a turning point. \"We are taking decisive action to make our roads safer for everyone, from new drivers taking their first lessons to older motorists wanting to maintain their independence. The measures we are announcing today will save thousands of lives over the coming decade.\" The government says the current drink drive limit is the highest in Europe and has not been changed since 1967 - with drink-driving accounting for one in six road fatalities in 2023. It says it'll explore preventative technology, such as alcohol interlock devices, which can include breathalysers attached to a vehicle's ignition. A new Road Safety Board, chaired by the minister for local transport, will be created to oversee delivery of the strategy."
    },
    {
        "title": "Maduro successor Delcy Rodriguez banned from UK for targeting political opponents",
        "description": "The interim president of Venezuela is banned from the UK for targeting political opponents, Sky News has confirmed.",
        "url": "https://news.sky.com/story/maduro-successor-delcy-rodriguez-banned-from-uk-for-targeting-political-opponents-13491036",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-delcy-rodriguez-venezuela_7127818.jpg?20260106093125",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2026-01-06 10:48:00",
        "Headline": "The interim president of Venezuela was added to the UK sanction list back in 2020, and is still there, having been sworn in after Maduro's capture. She is one of many members of the Maduro regime designated by the UK.",
        "Content": "\n          Political reporter\n              @TimJ_B\n The interim president of Venezuela is banned from the UK for targeting political opponents, Sky News has confirmed. Delcy Rodriguez was sworn in as Venezuela's interim president after Nicolas Maduro was captured by the US in its weekend raid on the South American nation. Formerly vice president, Ms Rodriguez has been a controversial figure for her role within the oppressive Maduro regime. Politics live: Rules-based system 'disintegrating before our eyes' Sky News has confirmed via Treasury documents that she had been sanctioned by the UK in 2020, and still appears on the list. This included her being subject to an asset freeze, disqualified as a director and subject to a travel ban. The reasons given for her being added were: \"There are reasonable grounds to suspect that her actions on the Presidential Commission and then as president of the Constituent Assembly have undermined democracy and the rule of law in Venezuela, including usurping the powers of the National Assembly and using them to target the opposition and prevent them taking part in the political process.\" \n                  Trump announces 'high quality' oil deal with Venezuela\n                 \n                  Could Trump go for Greenland or Cuba next?\n                 \n                  US troops injured during operation to capture Maduro - as Trump hails 'brilliant' military action\n                 Ms Rodriguez was added to the UK sanctions list after EU sanctions were grandfathered into the British list after Brexit, having been designated by the bloc in 2018. Tory MP Ben Obese-Jecty told Sky News: \"Yesterday, the foreign secretary couldn't confirm to me whether the newly sworn in president of Venezuela, Delcy Rodriguez, was already sanctioned by the UK. \"How can we expect the situation for the people of Venezuela to improve if its new president is part of the regime already deemed by us to be illegitimate?\" Read more:Streeting sends warning to Trump over GreenlandWhy is Trump so interested in Venezuela's oil? 👉 Follow Trump100 on your podcast app 👈  UK documents say the regulations \"impose financial, director disqualification, trade and immigration sanctions\" to encourage the Venezuelan government \"respect democratic principles and institutions, the separation of powers and the rule of law; refrain from actions, policies or activities which repress civil society; participate in negotiations with its political opponents in good faith to bring about a peaceful solution to the political crisis; and comply with international human rights law and respect human rights\". And the travel ban means: \"Designated individuals will be refused leave to enter or remain in the UK. \"Any applications they make for a visa to travel to the UK, including for transit purposes, will be refused. \"Any foreign national who is subject to a travel ban under these regulations, and who is currently in the UK, will have their permission to stay in the UK cancelled, and steps will be taken to remove them from the UK.\" Many members of the Maduro regime appear in the sanctions list, but notably not the man himself. A nation's leader being sanctioned is not novel, with the likes of Russia's Vladimir Putin, Belarus's Alexander Lukashenko and Myanmar's Min Aung Hlaing all currently under similar measures. Asked about the sanctions, senior Labour MP and chair of the Foreign Affairs Select Committee Dame Emily Thornbery said swathes of the Venezuelan government are sanctioned, including senior members of the judiciary and military. She added: \"There is a very sizeable chunk of the establishment at the top of Venezuela... now, if you're going to change Venezuela, you don't just snatch Maduro in the middle of the night. \"There is much more work that needs to be done, and that is the reality.\" A Downing Street source said they would not comment on sanctions. Sky News has approached the FCDO for comment."
    },
    {
        "title": "Fujitsu boss rejects MP's claim firm is 'a parasite on the British state'",
        "description": "Fujitsu's European boss has denied that the company is \"a parasite on the British state\" after MPs challenged it over its position on Post Office scandal compensation.",
        "url": "https://news.sky.com/story/fujitsu-boss-rejects-mps-claim-firm-is-a-parasite-on-the-british-state-13491263",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-fujitsu-horizon-post-office_7128348.jpg?20260106185226",
        "type": "Politics",
        "Author": "Adele Robinson",
        "Date Published": "2026-01-06 18:12:00",
        "Headline": "The company behind the Horizon post office scandal is yet to contribute towards compensation, despite saying two years ago it had a \"moral obligation\" to. ",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n Fujitsu's European boss has denied that the company is \"a parasite on the British state\" after MPs challenged it over its position on Post Office scandal compensation. The confrontation came during a parliamentary committee session examining the \"continued search for justice and accountability\" for victims. The government has set aside £1.8bn for redress for sub‑postmasters wrongly prosecuted due to failures in Fujitsu's Horizon IT system. The company is yet to contribute towards compensation despite saying it had a \"moral obligation\" to, two years ago. Paul Patterson, director at Fujitsu Services Ltd, was also questioned by MPs about the company securing public sector contract extensions worth an estimated £500m, amid assurances it would not bid for new UK government work. Chair of the Business and Trade Select Committee of MPs, Liam Byrne, told the executive: \"Your refusal to tell us how much Fujitsu will pay into a £1.8bn bill for taxpayers leads people to the conclusion that frankly Fujitsu is behaving like a parasite on the British state without an obligation to step up to its obligations.\" The Fujitsu boss rejected the accusation stating: \"We're not a parasite... the government has got an option as to whether they wish to extend those contracts or not. If you wish us to walk away from those contracts, we'll walk away from those contracts,\" he said. He argued that ending Fujitsu's government work would be \"detrimental to society\" and insisted the company had only extended its Post Office contract because ministers requested it. The executive pointed to Fujitsu's four‑decade presence in the UK, its 5,000 employees and its network of subcontractors, saying the firm remained \"a very serious organisation\" committed to its responsibilities. Pressure is mounting on the government to secure a substantial financial contribution from Fujitsu, which built and maintained the Horizon system at the centre of one of the UK's biggest miscarriages of justice. During the committee hearing, however, it became clear that Fujitsu will be waiting until the conclusion to the public inquiry into the scandal, chaired by Sir Wyn Williams, before announcing a specific figure. Read more:Second Horizon victim 'forced' to sue Post OfficeAppeal court delay for first Capture case Mr Patterson also said that Fujitsu needs to be \"informed by Sir Wyn\" adding that more information has come to light since he last appeared before the committee including about the \"Capture system\". \"I didn't know about a Capture system,\" he said, \"I didn't know there were victims of that, I didn't know there was legal advice in 2013 telling the Post Office what to do or not to. \"That is why Sir Wyn's advice is really, really important to us and will inform the commitment I am giving you again and that I have given to the committee before that we will contribute to redress.\" Capture was an accounting system used in the 1990s pre‑dating Horizon, which also produced unreliable data. Sky News has helped expose the scale of the scandal by uncovering a long‑lost document in a retired expert's garage. The session also heard from others connected to the Post Office scandal, including victims' lawyers, who echoed calls for greater urgency in delivering redress and justice. Nigel Railton, chair of the Post Office, said it was his personal opinion that the government should legislate to exonerate Capture victims, similar to Horizon victims."
    },
    {
        "title": "Cabinet revolt brewing over business rates hike - as hospitality warned not to protest",
        "description": "A cabinet revolt is brewing over the upcoming business rates increase - as hospitality has been warned not to protest, Sky News can reveal.",
        "url": "https://news.sky.com/story/cabinet-revolt-brewing-over-business-rates-hike-as-hospitality-warned-not-to-protest-13491082",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-yvette-cooper-rachel-reeves_7127911.jpg?20260106104715",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-06 10:39:00",
        "Headline": "Pubs have been banning Labour MPs in protest over the rises, which will begin in April.",
        "Content": "A cabinet revolt is brewing over the upcoming business rates increase - as hospitality has been warned not to protest, Sky News can reveal. There is \"ongoing cabinet-level opposition\" to the hike, and ministers are \"not happy about it\", deputy political editor Sam Coates revealed on the Politics at Sam and Anne's podcast. Politics latest updates In November's budget, Chancellor Rachel Reeves announced a shake-up to how business rates are calculated, with a new band for retail, hospitality and leisure - bringing an end to the relief scheme first introduced in 2020 during the pandemic. The sector argues the new business rates, while lower than before COVID, do not go far enough. They say because the tax is based on rateable property values (an official estimate of a commercial property's annual rental value), they are disproportionately affected because they have physical stores, restaurants and pubs - unlike online giants. 👉Listen to Politics at Sam and Anne's on your podcast app👈 \n                  Hundreds of jobs to be lost in TGI Fridays insolvency plan\n                 \n                  Budget 2025: Hospitality pleads for 'lifeline' as Rachel Reeves accused of imposing 'stealth tax'\n                 \n                  Former TGI Fridays chief in move to snap up UK chain \n                 Sir Keir Starmer has acknowledged the industry will struggle with the new rates, telling LBC this week: \"Obviously, what's happened is there were reductions in place during COVID, which were always going to be unwound. \"At some point, the overall rates are going to be lower. But I accept that because of revaluation, that means that some will have their bills going up.\" He said the government is putting transitional relief in place and they are looking at what else they can do, such as \"licensing freedoms\". Chef Tom Kerridge, who has four gastropubs, said his rateable values at The Coach in Marlow had risen 100% from £50,000 to £106,000, which he said is \"unsustainable\". Several pubs have already barred Labour MPs in protest at the changes. However, Sky News understands the government has been warning businesses not to protest over the changes if they want to get any concessions. Read more:Reeves' budget tax rises 'a pub killer', say landlordsRules-based system 'disintegrating before our eyes' An industry insider said the government has been telling the business community if they want help, then they should take a cue from farmers, who were given a reprieve just before Christmas when the government raised the threshold for inheritance tax from £1m to £2.5m. But, the industry insider said the government has been telling them farmers were \"good, fair negotiators and didn't make a big campaign of it, which is why they got what they wanted\". The messaging appears confusing as farmers carried out protests over many months, with tractors blocking Whitehall becoming commonplace. Sam Coates said: \"Anybody who spent a second in Whitehall looking at those tractors trundling down and the mass campaign knows that that's just utter nonsense. \"What's really happening here is, despite the facts being completely untrue, this is government basically threatening the industry. \"The implication, I don't know which Whitehall department it is, but the implication quite clearly is 'stop being so aggressive with your briefing if you want anything at all for your industry'. \"Now that doesn't smack of a government coming at things from a position of strength to my mind.\" The Valuation Office Agency, which provides the government with property valuations, has said an increase in rateable value does not necessarily mean a similar rise in business rates, as there is transitional relief available, including: • A £3.2bn transitional relief scheme to support the largest ratepayers, including airports and hospitality • £500m to help the smallest businesses • A £1.3bn expansion of the Supporting Small Business scheme for those who were eligible for retail, hospitality and leisure relief as they transition."
    },
    {
        "title": "Chagos deal suffers 'humiliating' defeats as government loses four votes",
        "description": "Sir Keir Starmer has suffered four \"humiliating\" defeats in parliament over plans to hand sovereignty of the Chagos Islands to Mauritius.",
        "url": "https://news.sky.com/story/chagos-deal-suffers-humiliating-defeats-as-government-loses-four-votes-13490956",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-diego-garcia-chagos_6874792.jpg?20250403110156",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-06 02:11:00",
        "Headline": "Plans to hand over sovereignty of the Chagos Islands to Mauritius will return to the Commons, after the House of Lords inflicted four defeats on the government.",
        "Content": "Sir Keir Starmer has suffered four \"humiliating\" defeats in parliament over plans to hand sovereignty of the Chagos Islands to Mauritius. The archipelago is home to the British Indian Ocean Territory, and its largest island, Diego Garcia, hosts a joint US-UK military base. Now plans to transfer the islands back to Mauritius have suffered a setback, after the House of Lords inflicted four defeats on the government's deal. What were they? The first defeat concerned proposals to lease Diego Garcia back from Mauritius for 99 years, at the cost of some £101m per year. An amendment was proposed that payments to Mauritius should stop if the Diego Garcia base could no longer be used. The government opposed it, but was defeated by eight votes. The Lib Dems then dealt the government a second blow with an amendment proposing that Chagossians in the UK should get a referendum on the deal. A third defeat came in the form of a Tory amendment that would force ministers to publish detailed costings of payments to Mauritius. Then the government faced a final defeat when the Lib Dems proposed that parliament be given oversight of spending linked to the treaty, allowing MPs to stop payments to Mauritius if it breaches the terms of the deal. Tories condemn 'terrible' legislation But the government did manage to narrowly defeat a proposal to stop the islands being handed over unless the move was backed by a majority of Chagossians in a referendum. Shadow foreign secretary Dame Priti Patel said Labour had faced a \"humiliating defeat\". She added: \"Keir Starmer is weak and incapable of standing up for Britain at home and abroad. Britain's defence and security are at risk because of this terrible legislation.\" The deal will now return to the House of Commons, where the government will have the chance to throw out the Lords' amendments. Read more:Starmer plots end of peer show for ToriesUN committee 'deeply concerned' by Chagos deal How did we get here? Negotiations between the UK and Mauritius over the islands began in 2022, when the Conservatives were in office. Formerly a French possession, the Chagos Islands were ceded to Britain in 1814 and formed into the British Indian Ocean Territory in 1965. Britain displaced its local population in the early 1970s and since then only military personnel have been allowed access. Mauritius has long sought sovereignty over the islands, taking its case to the International Court of Justice, which agreed Britain was obliged to end its administration over the territory."
    },
    {
        "title": "Musk must urgently deal with Grok AI's ability to generate sexualised images, government warns",
        "description": "Elon Musk's X must urgently deal with its in-built artificial intelligence Grok being used to generate \"absolutely appalling\" fake sexualised images, Technology Secretary Liz Kendall has said. ",
        "url": "https://news.sky.com/story/musk-must-urgently-deal-with-grok-ais-ability-to-generate-sexualised-images-government-warns-13491169",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-grok-xai-elon-musk_7127468.jpg?20260105181755",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-06 13:47:00",
        "Headline": "Since the start of the new year, numerous X users have reported accounts using Grok to generate images of them without clothing.",
        "Content": "Elon Musk's X must urgently deal with its in-built artificial intelligence Grok being used to generate \"absolutely appalling\" fake sexualised images, Technology Secretary Liz Kendall has said.  Ofcom raised \"serious concerns\" on Monday with the social media platform's AI tool, as it can be used to create \"undressed images of people and sexualised images of children\". Since the start of the new year, X users - mainly women - have reported that accounts have used Grok to generate images of them without clothing. There are also several cases where Grok has created sexualised images of children, according to analysis by news agency Reuters. \"What we have been seeing online in recent days has been absolutely appalling, and unacceptable in decent society,\" said Ms Kendall. \"No one should have to go through the ordeal of seeing intimate deepfakes of themselves online. \"We cannot and will not allow the proliferation of these demeaning and degrading images, which are disproportionately aimed at women and girls. \n                  'Breakthrough' blood test at home could help more people spot Alzheimer's, say scientists\n                 \n                  NHS reveals first conditions eligible for video appointments\n                 \n                  Ofcom makes 'urgent contact' with X over concerns Grok AI can generate 'sexualised images of children'\n                 \"X needs to deal with this urgently. It is absolutely right that Ofcom is looking into this as a matter of urgency and it has my full backing to take any enforcement action it deems necessary.\" Sir Ed Davey, the leader of the Liberal Democrats, has called for the National Crime Agency (NCA) to launch a criminal investigation into X. He said some of the Grok-generated images are \"disgusting\" and called on the UK government \"to act very quickly to stop this, probably to reduce access to X\". Sir Ed, who has a long-running rivalry with X owner, Elon Musk, called for the tech billionaire to be \"held to account\". Sky News has seen multiple users sharing disgust, after non-consensual deepfakes of themselves in bikinis were shared on the app. A statement shared on X's official safety account said: \"We take action against illegal content on X, including Child Sexual Abuse Material (CSAM), by removing it, permanently suspending accounts, and working with local governments and law enforcement as necessary.\" A post on the Grok X account previously said there had been \"isolated cases where users prompted for and received AI images depicting minors in minimal clothing. \"xAI has safeguards, but improvements are ongoing to block such requests entirely,\" it added. On Friday, French ministers reported sexually explicit content generated by Grok on X to prosecutors, saying that the \"sexual and sexist\" content was \"manifestly illegal\". Can X be forced to take action? Under the Online Safety Act, which began being fully enforced in July, it is an offence to share intimate imagery of someone without their permission, even if it is made using AI. The act allows companies that enable deepfakes to be shared online to be fined up to £18m, or 10% of their qualifying worldwide revenue, whichever is greater.  That applies even if the company is based outside the UK, like X, but has a lot of UK users or the potential to harm UK users. The EU has similar regulation, called the Digital Services Act (DSA), and can also fine companies. In fact, just last month, X was handed a €120m (£104m) fine for breaching the DSA - a move that has caused consternation in the US, where the vice president JD Vance is among those who have attacked European \"censorship\" of free speech, leaving Keir Starmer and other leaders having having to mount a defence. Read more:Why Trump administration is so annoyed with Europe's online rules In December, the Trump administration sanctioned British and European online safety campaigners it accused of censoring \"American viewpoints\". However, in the USA, some groups are also calling on authorities to take action against xAI. The Consumer Federation of America (CFA) on Monday wrote to the Federal Trade Commission, the Federal Communications Commission, the Department of Justice, and all attorneys general, demanding swift action. \"xAI is purposefully and recklessly endangering people on their platform and hoping to avoid accountability just because it's 'AI',\" said Ben Winters, Director of AI and Data Privacy at CFA. \"AI is no different than any other product - the company has chosen to break the law and must be held accountable.\""
    },
    {
        "title": "'Breakthrough' blood test at home could help more people spot Alzheimer's, say scientists",
        "description": "A new \"breakthrough\" blood test can help spot the key warning signs of Alzheimer's, latest research suggests.",
        "url": "https://news.sky.com/story/breakthrough-blood-test-at-home-could-help-more-people-spot-alzheimers-say-scientists-13491064",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-blood-test-alzheimers_7127867.jpg?20260106101403",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2026-01-06 10:05:00",
        "Headline": "The new self-sampling method, which is done at home and the dry sample sent by post, could make Alzheimer's testing much more accessible.",
        "Content": "\n          Science and technology reporter\n       A new \"breakthrough\" blood test can help spot the key warning signs of Alzheimer's, latest research suggests. The technique, using a blood sample taken with a finger prick at home and posted to a laboratory without refrigeration, could make detecting the disease easier, especially in places where traditional tests are hard to access, said scientists. They claimed the self-sampling method could \"fundamentally change\" how they conduct research into the progressive brain disorder. Alzheimer's is a type of dementia that affects memory, thinking and behaviour. It is usually tested for through brain scans or spinal fluid tests, which can be both invasive and expensive. There are also increasingly accurate clinical blood tests but they need trained personnel and temperature-controlled storage of the blood samples, which limits who can use them. In the new study, scientists found that by using a few drops of blood from the fingertip and drying it on a card, they could see proteins linked to Alzheimer's disease and other brain changes in 337 people. The results from the blood tests showed a strong correlation with more traditional tests, and the trial participants were able to get the blood samples themselves without help from the researchers. \n                  Ex-Man United star said heading ball 'hasn't helped' following dementia diagnosis before death\n                 \n                  Alzheimer's among elderly more widespread than previously thought, new study shows\n                 \n                  UK patients to trial blood test that could 'revolutionise' Alzheimer's diagnosis\n                 The study was led by Nicholas Ashton who works at the Banner Health Institute in Arizona and for the University of Gothenburg's Sahlgrenska Academy. He said: \"This breakthrough could fundamentally change how we conduct Alzheimer's research by proving that the same biomarkers doctors use to detect Alzheimer's pathology can be measured from a simple finger prick collected at home or in more remote community settings.\" The researcher added: \"While we're still years away from clinical use, we're opening doors to research that was previously impossible - studying diverse populations, conducting large-scale screening studies, and including communities that have been historically underrepresented in Alzheimer's studies.\" Read more from Sky News:Government plans new driving rule for over-70sNHS reveals first conditions eligible for video appointments The new self-sampling method, which is done at home and the dry sample sent by post, could make Alzheimer's testing much more accessible. \"What excites me most is that this work makes this type of research far more accessible,\" said Anne Corbett, professor in dementia research at the University of Exeter, which also contributed to the research. She added: \"We're moving toward a future where anyone, anywhere, can contribute to advancing our understanding of brain diseases. This isn't just a technical advancement - it's a paradigm shift in how we conduct neuroscience research.\" Co-author Clive Ballard, professor of age-related diseases at the University of Exeter Medical School, explained: \"Our ongoing work will determine whether this could also be a valuable way of identifying people in the community who would benefit from more detailed diagnostic tests for Alzheimer's disease.\""
    },
    {
        "title": "NHS reveals first conditions eligible for video appointments",
        "description": "Men with prostate cancer symptoms will be able to get fast-tracked video appointments with doctors via an upgraded NHS app.",
        "url": "https://news.sky.com/story/nhs-app-to-fast-track-prostate-cancer-diagnoses-13490955",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-doctor-phone_7127628.jpg?20260106024752",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-06 01:54:00",
        "Headline": "It's another step in the government's efforts to make healthcare more accessible via what ministers have described as an \"online hospital\".",
        "Content": "Men with prostate cancer symptoms will be able to get fast-tracked video appointments with doctors via an upgraded NHS app. Health Secretary Wes Streeting said he was determined to make accessing healthcare \"as simple as ordering a cab or takeaway\", and ensure those facing long waits are \"seen on time again\". The video service is part of what the government has been describing as a new \"online hospital\", which effectively means improvements to the NHS app. Prostate enlargement and a raised prostate specific antigen level - a possible sign of prostate cancer - are among the first conditions that will be managed when the service launches next year. Others include women's health issues such as severe menopausal symptoms and symptoms of endometriosis or fibroids, eye problems like cataracts, glaucoma and macular degeneration, and patients with iron deficiency anaemia and inflammatory bowel disease. Following referral from a GP, they will be able to use the app for a video consultation with doctors across England. Read more from Sky News:We need Greenland now, says TrumpMan Utd's leadership may have made things worse Officials hope it will drive down waiting lists, as people will be able to speak to doctors without leaving their home, though they can choose to wait for in-person appointments if preferred. Tests, scans, and procedures will continue to take place at sites close to people's homes, though people can have ongoing monitoring through the app. Professor Stella Vig, national clinical director for elective care at NHS England, said providing faster and more convenient access to diagnosis and treatments \"will have a real and positive impact\". It's another step in the government's efforts to make healthcare more accessible online. Last year, it made it mandatory for all GP surgeries in England to offer online booking."
    },
    {
        "title": "Mickey Rourke tells fans he is not behind 'humiliating' $100k eviction fundraiser",
        "description": "Hollywood star Mickey Rourke has told fans he is not behind a \"humiliating\" fundraising website set up to support him - and urged well-wishers to try and get their money back as the total reached almost $100,000.",
        "url": "https://news.sky.com/story/mickey-rourke-tells-fans-he-is-not-behind-humiliating-100k-eviction-fundraiser-13491063",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-mickey-rourke-instagram_7127875.jpg?20260106102201",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-06 11:40:00",
        "Headline": "A GoFundMe page set up at the weekend said The Wrestler star was facing a \"very real and urgent situation: the threat of eviction from his home\". However, the actor has denied being behind it and told fans to try and get their money back.",
        "Content": "Hollywood star Mickey Rourke has told fans he is not behind a \"humiliating\" fundraising website set up to support him - and urged well-wishers to try and get their money back as the total reached almost $100,000. The Oscar-nominated actor and former boxer shared a video statement on Instagram saying he was \"really frustrated\" and \"confused\" by the page, titled \"Help Mickey Rourke Stay in His Home\", which was set up on crowdfunding platform GoFundMe over the weekend. \"Somebody set up some kind of foundation or fund for me, to donate money, like in a charity, and that's not me,\" Rourke told his 488,000 followers, saying he did not know who was behind it. \"If I needed money I wouldn't ask for no f***ing charity.\" The GoFundMe page said Rourke was facing a \"very real and urgent situation: the threat of eviction from his home\". The page organiser is listed as Liya-Joelle Jones, an assistant to Rourke's manager, Kimberly Hines, and its description said it had been set up with his \"full permission to help cover immediate housing-related expenses\" and prevent eviction from happening. According to the Hollywood Reporter, which first reported on the fundraiser, Jones told the outlet Rourke was \"going through a very difficult time right now\" and it had been \"incredibly touching to see how many people care about him and want to help\". Sat with his dog, Lucky, in his video, Rourke denied having anything to do with the page and said he was going to talk to his lawyer to \"get to the bottom of this\". The 73-year-old admitted he had done a \"really terrible job\" in managing his career, but said after years of therapy, he has \"worked very hard\" and is \"not that wild man\" of his past. The actor was known for films including 9 1/2 Weeks, Rumble Fish and The Pope of Greenwich Village in the 1980s, and continued to act while also pursuing his boxing career in the 1990s. In 2008, he starred in The Wrestler - a performance that earned him a BAFTA and an Oscar nomination for best actor. In 2025, he appeared on Celebrity Big Brother in the UK, but was kicked out of the house over \"use of inappropriate language\" and \"instances of unacceptable behaviour\". He caused upset in the house from the start and made former Dance Moms star JoJo Siwa cry after making comments about her sexuality. In his video, Rourke said COVID and the Hollywood strikes in 2023 had \"killed\" his money, and he had previously been in a \"bad situation\" with his rent. Read more from Sky News:Was the US attack in Venezuela legal?Chalamet and Buckley among Critics Choice winners However, he described the fundraising page as \"very embarrassing\", and told fans: \"Don't give any money, and if you gave money, get it back… \"I would never ask strangers or fans or anybody for a nickel. That's not my style. You ask anyone who knows me. It's humiliating and it's really f***ing embarrassing.\" He told fans he is \"grateful for what I have - I've got a roof over my head, I've got food to eat… everything's okay\", and added: \"Get your money back, please, I don't need anybody's money and I wouldn't do it this way, I've got too much pride.\" Sky News has contacted Hines and representatives for Rourke for comment."
    }
]