[
    {
        "title": "Big benefits cuts are imminent - here's what to expect and why it could be just the start",
        "description": "Those with \"milder mental health\" issues and \"lower-level physical conditions\" could see their disability benefits cut, as the government looks to shave &#163;6bn off the welfare bill.",
        "url": "https://news.sky.com/story/these-are-the-big-benefits-changes-you-should-expect-and-why-they-could-be-just-the-start-13331073",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-beth-rigby-rachel-reeves_6859956.jpg?20250317193442",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-03-17 19:06:00",
        "Headline": "With little more than a week to go until Rachel Reeves delivers the spring statement, the Treasury is looking for ways to plug a hole in the public finances. The welfare system is set for billions of pounds in cuts - but some in government think the changes don't go far enough.",
        "Content": "\n          Political editor\n              @BethRigby\n  Those with \"milder mental health\" issues and \"lower-level physical conditions\" could see their disability benefits cut, as the government looks to shave £6bn off the welfare bill. Liz Kendall, the work and pensions secretary, is expected to target sickness and disability benefit payments for savings on Tuesday, which comes ahead of the spring statement next Wednesday. Politics latest: Welfare reforms 'imminent' Her welfare reform green paper will arrive after Downing Street insisted there is a \"moral and an economic case for fixing our broken system\". Government figures argue the rising sickness and disability bill, which has ballooned since the pandemic, is unsustainable and will \"leave the welfare state losing legitimacy\" in the eyes of the wider public if not dealt with. The cuts come as the chancellor eyes a hole in the public finances on the back of lower than expected growth and rising borrowing costs, with the £9.9bn headroom she had at the budget in October now wiped out. Rachel Reeves' self-imposed fiscal rules mean day-to-day government spending must be covered by tax revenue by 2029-30, which leaves her needing billions of pounds in spending cuts (after ruling out further tax rises, her other option).  What changes should we expect? Ms Kendall is expected to target personal independence payments (PIP) - one of the main forms of disability benefits for those with long-term illnesses or disabilities - amid a spike in claimants. The PIP bill has grown from £13.7bn a year before the pandemic to £21.8bn in the current financial year, and is set to increase to £34.1bn by the end of the decade. The number of people claiming this disability benefit is projected to more than double from two million to 4.3 million. The work and pensions secretary will tell MPs that Labour will protect those who have a serious condition and can't work, and the government's rowed back from plans to freeze PIP payments after backlash from its backbench MPs. These payments are now expected to rise in line with inflation, but the eligibility criteria will be tightened to whittle back the number of people eligible to claim. One government figure told me it would result in some conditions, such as \"milder mental health\" or \"lower-level physical conditions\", being ineligible for PIP. But they stressed that those with more severe conditions and who are never going to be able to work would be protected and cared for. Read more:Which benefits could be cut?Why Labour MPs are so uncomfortable  The key principles driving reforms The changes are likely to draw criticism from some MPs, though one senior Labour source said they didn't think there would be any ministerial resignations over the benefit announcements. Another Labour figure told me they would be \"massively shocked\" if there were resignations. However, a number of Labour MPs have voiced their concerns, as has the Manchester mayor Andy Burnham. In a bid to assuage MPs, the work and pensions secretary is also expected to earmark £1bn of savings into employment support programmes as she frames the reforms around three clear principles. 👉 Tap here to listen to Electoral Dysfunction on your podcast app 👈 The first will be to prevent people from falling into long-term economic inactivity with a better support offer to get people back into work quickly. The second will be to change the incentive systems to move people away from welfare dependency. This could see Ms Kendall slash the highest level of incapacity benefit for working age people who have an illness or disability that limits their ability to work, while increasing the basic rate of support for those out of work (universal credit). This is because the lower level of unemployment benefit has led to more people claiming for additional incapacity and disability benefits, while disincentivising them to try to find work. The government will also announce a \"right to try\" scheme, allowing those on incapacity benefits to try returning to work without the risk of losing their benefits, as happens in the current system.  'I don't think they go far enough' But with one in 10 working age people claiming sickness benefits, and one in eight young people not in education, employment or training, the reforms on Tuesday could be just the start of bigger changes - and potentially bigger political battles. The cost of long-term sickness and disability benefits for working-age people has risen by about £20bn since the pandemic to about £48bn, and is forecast to hit almost £100bn by 2030. \"People are trapped on benefits and the bill is getting out of hand,\" said one government figure. \"We are currently spending more than three times the annual policing bill on these benefits. It's getting out of hand. \"I don't think the reforms go far enough, and I don't think people have clocked the size of the numbers going on here.\""
    },
    {
        "title": "'He doesn't speak for Ireland': Irish leaders critical of McGregor-Trump meeting",
        "description": "Mixed martial arts fighter Conor McGregor has met Donald Trump in the Oval Office after complaining about Ireland's \"illegal immigration racket\".",
        "url": "https://news.sky.com/story/conor-mcgregor-in-white-house-for-talks-on-irelands-illegal-immigration-racket-13330939",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-conor-mcgregor-donald-trump_6859911.jpg?20250317183553",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-17 14:10:00",
        "Headline": "The 36-year-old appeared in the White House briefing room and complained about immigration during a St. Patrick's Day visit to Washington DC.",
        "Content": " Mixed martial arts fighter Conor McGregor has met Donald Trump in the Oval Office after complaining about Ireland's \"illegal immigration racket\". The 36-year-old told Mr Trump that his work ethic was \"inspiring\", with the two men sharing jovial comments about the fighter's suit and a map featuring the Gulf of Mexico labelled as the Gulf of America. In comments made in the White House briefing room before the meeting during the St. Patrick's Day visit, he said he was visiting the White House to \"raise the issues the people of Ireland face\". \"What is going on in Ireland is a travesty,\" he said. \"Our government is the government of zero action with zero accountability.\" McGregor warned \"Ireland is at the cusp of potentially losing its Irishness\" due to the \"illegal immigration racket\". \"Ireland and America, we are siblings. We consider America our big sibling. So it's important for Ireland to be a peaceful, prosperous country for 40 million Irish Americans to have a place to visit, [to] come back to their home. \"So we wish for our relationship with the United States to continue, and we wish to be taken care of by the big bro. The United States should look after its little bro. And that's how we feel,\" McGregor said. \n                  Conor McGregor: Tesco among shops ditching alcohol linked to MMA star after rape case\n                 \n                  Conor McGregor speaks after losing civil rape case as feminist march held in Dublin\n                 \n                  Woman who accused Conor McGregor of rape wins civil assault case - and is awarded damages\n                 White House press secretary Karoline Leavitt, who appeared alongside McGregor in the briefing room, said: \"We couldn't think of a better guest to have with us on St. Patrick's Day.\" At a meeting with Irish Prime Minister Micheal Martin last week, Mr Trump said McGregor was his favourite Irish person partly because \"he's got the best tattoos I've ever seen\". But Mr Martin and deputy prime minister Simon Harris have been critical of today's Trump-McGregor meeting. In a post on X, Mr Martin said: \"McGregor's remarks are wrong, and do not reflect the spirit of St Patrick's Day, or the views of the people of Ireland.\" Meanwhile, Mr Harris said that McGregor was not in the US to represent Ireland and did not speak for the people of Ireland, and \"has no mandate to\". In exclusive comments made to Sky News' David Blevins about Mr Martin's comments, McGregor said: \"Shame on him for saying that, speaking down on an Irish man.\" He added: \"Every metric available to us has shown that the government of Ireland has failed the people of Ireland.\" Mr Trump is well known for his support of Ultimate Fighting Championship, which McGregor is best known for competing in, and attended bouts during the 2024 presidential campaign. Read more: The deepening ties that led to the controversial Tates flying to freedom in US McGregor is a controversial figure in Ireland after a woman who accused him of raping her won her civil case and was awarded more than £200,000 in damages. Tesco was among the retailers that stopped selling alcohol brands linked to McGregor after Nikita Hand was awarded €248,603 (£206,000) after a jury found McGregor assaulted her in a hotel in 2018. McGregor is appealing against the outcome of the civil case. McGregor also pleaded guilty to assaulting a man in a Dublin pub in 2019 and has been subject to several other allegations of assault and sexual assault. His social media posts were also linked to the 2023 Dublin riots. Irish police were reportedly investigating McGregor's posts for alleged incitement to hatred in relation to the riots. McGregor, nicknamed the Notorious, rose to worldwide prominence for winning several UFC championships."
    },
    {
        "title": "Paedophile who spent 27 years on the run guilty of dozens of child sexual abuse offences",
        "description": "A British paedophile who spent 27 years on the run in Thailand after stealing another man's identity has been found guilty of 97 offences, including dozens of historical child sexual abuse offences.",
        "url": "https://news.sky.com/story/paedophile-who-spent-27-years-on-the-run-guilty-of-dozens-of-child-sexual-abuse-offences-13327060",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-richard-burrows-heathrow_6854113.jpg?20250317142119",
        "type": "Home",
        "Author": "Greg Milam",
        "Date Published": "2025-03-17 14:06:00",
        "Headline": "Richard Burrows spent 27 years on the run, but was arrested at Heathrow Airport on his return from Thailand on the eve of his 80th birthday.",
        "Content": "\n          Chief North of England correspondent\n              @GregMilamSky\n  A British paedophile who spent 27 years on the run in Thailand after stealing another man's identity has been found guilty of 97 offences, including dozens of historical child sexual abuse offences. Richard Burrows, a former boarding school housemaster and scout leader, spent decades living in an area he described as \"paradise\" after fleeing the UK when he was due to appear in court in 1997. He was arrested at Heathrow Airport on his return from Thailand on the eve of his 80th birthday last March. Burrows, who lived in the southern Thailand province of Phuket, told family he had come back to face his accusers and his maker - police say the truth was that he simply had run out of money. He had previously admitted dozens of offences dating from the mid-1960s to the mid-1990s. The jury at Chester Crown Court heard that Burrows systematically abused boys with whom he came into contact. Before his trial Burrows admitted 43 offences - including indecent assault of boys, making indecent images of children, possession of indecent images of children and four counts of possession of false identity documents with intent. He denied 54 others which jurors convicted him of on Monday. Those offences include indecent assault of boys, buggery, attempted buggery and indecency with a child. Mark Connor KC said: \"He obtained positions of trust and responsibility which he breached to satisfy himself sexually with the youngsters.\" Burrows has been remanded in custody and will be sentenced on Monday 7 April for a total of 97 offences. He had worked as a housemaster at a school for troubled teenagers in Cheshire in the 1960s. He was later involved with the scouts and amateur radio clubs in the Midlands Read more:Decades on the beach - Burrows' life in hiding Victim describes 'despicable, evil human being' James Harvey was 13 or 14 when he was befriended by Burrows through his involvement with the sea scouts. Burrows admitted indecently assaulting James in a caravan after visiting an RAF show. James has waived his right to anonymity as a victim of a sexual offence. He told Sky News: \"The reason I'm doing this is to at least put a face to the real children who from the age of 10, 12, 13, put their trust in this man. I want his name to be trashed in the world for everybody that ever knew him and thought that he was okay. \"I think he's pathetic in the true sense of the word. His impulses and emotions have driven everything that he's done probably throughout the whole of his life and have left him looking like a shambling, despicable, evil human being that could casually over 60 years do this to children and still wake up in the morning and find a way of justifying it. \"I think he's pathetic, I think he's weak. There is nothing about this man that deserves anything other than loathing.\" During his trial, Burrows admitted being a paedophile but denied the more serious allegations, describing them as \"degrading and disgusting\". The court heard that Burrows believed his actions had done no harm to the children. As he planned his return to the UK last year, he told his brother that \"not all paedophiles are the same\". \"I just think that's a disgusting comment to make,\" detective inspector Eli Atkinson of Cheshire Police told Sky News. \"What we see when we talk to the victims is that it absolutely did do harm. For the vast majority of them, that is their first sexual experience at the age of nine, ten, eleven, twelve, that affects a person for the rest of their life.\"  How paedophile's crimes spanned four decades The jury was told how Burrows, who is originally from Sutton Coldfield, systematically abused 26 young boys across Cheshire, the West Midlands and West Mercia between 1968 and 1995. The offences in Cheshire took place between 1969 and 1971 while he was working as a housemaster, looking after vulnerable children at Danesford Children's Home in Congleton. His victims in the West Midlands and West Mercia were abused between 1968 and 1995, the majority through local scout groups where Burrows worked as a leader. In each case, he befriended the victims by using his position of trust over them and their personal interests, such as radio communications or boating. After gaining their trust, and in many cases the trust of their families, Burrows then went on to sexually abuse the boys. While some of his victims attempted to speak out at the time, many simply did not feel that they would be believed. It was not until the 1990s that many of the victims had the confidence to come forward. Burrows was first arrested in April 1997 and charged with child sexual offences. When he failed to appear at Chester Crown Court that December, a warrant was issued for his arrest. Over the years, police made numerous televised appeals for help to track down Burrows on the BBC's Crimewatch programme. It prompted more accusers to come forward. But Burrows had left the UK. He obtained a passport using the name Peter Leslie Smith having cloned the identity of an unwell acquaintance. Read more from Sky News:Inside Syria's stunned coastal citiesPolice searching for missing woman launch murder probeConor McGregor to meet Trump Fears there could be more victims During a routine reappraisal of the case, police used facial recognition software to confirm that \"Smith\" was in fact Burrows, and that he was living openly in Thailand. When they became aware of his plans to return to the UK, police allowed Burrows to travel on his fake passport so he could be arrested as he touched down. Cheshire Police say they are not able to say whether Burrows might have offended during his time living abroad. DI Atkinson said it is possible there are other victims who have not come forward. \"There may well be. There's a lot of reasons why people have really difficult decisions to make as to whether they come forward in cases like this. \"It would not surprise me if, given the length of time that he offended over and the level of offending, if there were more people out there who were victims of him.\" James Harvey has questions over why Burrows was granted bail in 1997. He also wonders whether he could have done more to report him earlier. \"People listening to me now might think 'Oh, I'd behave differently' but we had no language, no framework, no understanding, no imagination that this same person had done to us, would go on and do something so much worse to somebody else. \"It is almost impossible for me to sit here and say I wish I had done that. There was no way that I could, literally. We lived in this kind of unbelievable ignorance and innocence that there were predators like this living in every single one of our institutions.\" Burrows has now been convicted. Some of his accusers died before seeing him finally face justice."
    },
    {
        "title": "John 'Paddy' Hemingway: Last surviving Battle of Britain pilot dies aged 105",
        "description": "The last surviving Battle of Britain pilot John 'Paddy' Hemingway has died aged 105. ",
        "url": "https://news.sky.com/story/john-paddy-hemingway-last-surviving-battle-of-britain-pilot-dies-aged-105-13330998",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-john-hemingway_6860059.jpg?20250317225643",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-17 15:55:00",
        "Headline": "Hemingway never saw his role in the Battle of Britain as \"anything other than doing the job he was trained to do,\" the RAF said, adding that \"his courage in the face of overwhelming odds demonstrated his sense of duty and the importance of British resilience\".",
        "Content": "The last surviving Battle of Britain pilot John 'Paddy' Hemingway has died aged 105.  The Royal Air Force said he died peacefully on Monday. Paddy Hemingway, one of 'the Few' and a revered figure in British aviation history, played a key role in defending the United Kingdom against the Nazis in the summer of 1940, when he was just 19. 'The Few' refers to a speech by Sir Winston Churchill in the House of Commons in August that year as the Battle of Britain reached its peak. Praising the efforts of RAF fighter pilots, the wartime prime minister said that \"never in the field of human conflict was so much owed by so many to so few.\" In an online tribute, the RAF said Hemingway's squadron shot down 90 enemy aircraft during an 11-day period in May 1940. In August, he was twice forced to bail out of his Hurricane fighter plane and the following year, he broke his hand in another bailing out - this time at 600 feet (183m) after his plane's instruments failed in bad weather. His parachute failed to open properly but, luckily it caught on the branches of a tree, sparing him further injury. Near the end of World War Two, while serving in the Mediterranean, he was forced to bail out a fourth time near Ravenna in Italy after his Spitfire was hit multiple times by anti-aircraft fire. Dropping into enemy territory, he contacted Italian partisans, who helped him return to his squadron. Hemingway never saw his role in the Battle of Britain as anything other than doing the job he was trained to do, the RAF said. The force described him as always having a \"twinkle in his eyes as he recalled the fun times with colleagues in France and London. \"His courage in the face of overwhelming odds demonstrated his sense of duty and the importance of British resilience.\" Hemingway, the RAF said, was a \"quiet, composed, thoughtful and mischievous individual\" who \"embodied the spirit of all those who flew sorties over this green and pleasant land\". Read more from Sky News:McGregor meets Donald TrumpKate enjoys a Guinness$50m for man hurt by hot tea In July 1941, he was awarded the Distinguished Flying Cross (DFC) and in September of that year, he was Mentioned in Dispatches. Prime Minister Sir Keir Starmer said: \"Very sad to hear of the passing of Group Captain John 'Paddy' Hemingway, the last known Battle of Britain pilot. \"His courage, and that of all RAF pilots, helped end WWII and secure our freedom. We will never forget their bravery and service. \"Thank you, John 'Paddy' Hemingway.\" Defence Secretary John Healey said Hemingway's generation \"understood the importance of freedom and sacrificed so much to achieve it\". Air Chief Marshal Sir Rich Knighton, the Chief of the Air Staff, said the flyer was \"an amazing character whose life story embodies all that was and remains great about the Royal Air Force\". This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Kemi Badenoch says UK target to reach net zero by 2050 'impossible'",
        "description": "Tory leader Kemi Badenoch has dismayed green Conservatives by declaring the UK's target to reach net zero by 2050 \"impossible\".",
        "url": "https://news.sky.com/story/kemi-badenoch-says-uk-target-to-reach-net-zero-by-2050-impossible-13331102",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-kemi-badenoch-conservative_6860006.jpg?20250317222212",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-03-17 20:02:00",
        "Headline": "The Conservative leader's remarks are criticised by a Tory environmental group which says she has made a mistake.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Tory leader Kemi Badenoch has dismayed green Conservatives by declaring the UK's target to reach net zero by 2050 \"impossible\". In a speech on Tuesday, the Conservative Party leader is expected to tell what she says is the \"unvarnished truth\" that the net zero goal cannot be achieved without \"a serious drop in our living standards or by bankrupting us\". Ms Badenoch will say she is not making a \"moral judgement\" on net zero or debating whether climate change exists. But, as she begins to renew party policy, she will say that current climate policies are \"largely failing\" to improve nature and \"driving up the cost of energy\". Politics latest: Follow live updates Net zero means cutting emissions of greenhouse gases, which cause climate change, to virtually zero, and absorbing the rest elsewhere. Scientists say the world must reach that point by 2050 to avoid even worse flooding, wildfires, and other damage - but that action is lagging behind. The UK has already cut its greenhouse gas emissions in half. The next half is expected to be more challenging as it requires changes to people's heating, cars and diet - things that often need upfront costs, but could save people money in the long run with the right government support, advisers have said. Ms Badenoch's plans take the Conservative Party to its most sceptical position on net zero yet - a target set in law by Tory Prime Minister Theresa May in 2019. And it comes at a time when Reform UK is questioning climate science and US President Donald Trump, leader of the second most polluting country in the world, is dismantling nature protections.  Ms Badenoch's \"policy renewal\" she is outlining on Tuesday will see shadow cabinet members set core priority questions as a move towards formulating new policy for the party. Sam Hall, of the Conservative Environment Network of 50 MPs, said it was \"a mistake\" for Ms Badenoch to have \"jumped the gun on her own policy review and decided net zero isn't possible by 2050\". He said the Tory leader was right to question Labour's climate plans, but that the target is driven \"not by optimism but by scientific reality; without it climate change impacts and costs will continue to worsen\". Abandoning the science would risk losing voter's support, he added. Climate reporter The UK public has long been supportive of government climate action – that's true across voters of different parties too. Labour capitalised on this in last year's general election and swooped to victory with a green mandate.\n\n Rishi Sunak's attempts to roll back some climate policies flopped, and polling by More In Common found Labour's arguments that clean power and climate action are the best way to tackle the cost of living cut through with people. For now, at least. The tide of climate scepticism has been rising since Sunak's days, with Reform UK questioning climate science altogether and Kemi Badenoch now calling the 2050 target \"impossible\" – though she did stress she doesn't want to dismantle it and that she does believe in climate change. And she's not wrong that it is going to be hard. Given the strong public support for climate action, it's not surprising Sunak's attempt to politicise the issue didn't work out for him.\n\n But now others following in his footsteps have been emboldened by US President Donald Trump. Their attacks are gathering speed - and they might start to take root.\n\n\n\n This may be an inflection point for goodwill towards climate action in the Conservative Party – which has a long legacy of supporting it – and more broadly in the UK. Labour cannot take public support for its net zero plans for granted at a time when political consensus on it is fracturing.\n\n And given the next stage of the country's climate action is about to get more disruptive for people, it is just when it needs this public support more than ever.\n\n Four in five Conservative voters in last year's general election and two thirds of Reform voters thought it was important that the government cared about tackling climate change, according to polling by More in Common. Shaun Spiers, executive director of thinktank Green Alliance, called it \"disappointing\" to see Ms Badenoch \"turn her back on cleaner, cheaper, homegrown energy\". \"It is even more disappointing to see the leader of the opposition take cues from climate deniers across the pond,\" he added, in a veiled swipe at President Trump. \"Net zero is not 'nice-to-have', it's an achievable, evidence-based target designed to protect the UK from the worst impacts of climate change.\" The UK's Climate Change Committee (CCC), which advises governments on how to reach net zero, said last month the goal is \"ambitious\" but \"deliverable\". But it also warned as Labour took office last summer that, at that time, just one third of the cuts to greenhouse gases needed to reach an interim 2030 target were covered by a \"credible plan\"."
    },
    {
        "title": "Sky News obtains first accounts of what happened inside Syrian cities shaken by bloody violence",
        "description": "No checkpoint is the same, some want paperwork, others wave you through after a brief look inside - but from Damascus to Latakia, there are a lot of checkpoints, and in one way or another, you are checked every time.",
        "url": "https://news.sky.com/story/sky-news-obtains-first-accounts-of-what-happened-inside-syrian-cities-shaken-by-bloody-violence-13330703",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-alawite-syria_6859250.jpg?20250317052743",
        "type": "Home",
        "Author": "Stuart Ramsay",
        "Date Published": "2025-03-17 02:05:00",
        "Headline": "Sky News has been hearing from victims and survivors of revenge attacks in the Latakia region between fighters loyal to the deposed president Bashar al Assad and forces affiliated to Syria's new rulers.",
        "Content": "\n          Chief correspondent\n              @ramsaysky\n  No checkpoint is the same, some want paperwork, others wave you through after a brief look inside - but from Damascus to Latakia, there are a lot of checkpoints, and in one way or another, you are checked every time. It wasn't like this just a month or two ago, but it is now after the most violent few days the country has seen since Bashar al Assad was forced from power in December last year. We drove through cities like Jableh, on Syria's Mediterranean coast, almost unrecognisable now. The bustling streets, markets and shops are silent, apart from the sirens of passing General Security convoys - their armed soldiers packed on the back of pick-up trucks. The debris of battle is everywhere, buildings are burnt out and peppered with bullet holes, glass from smashed shopfront windows spills across the pavement and spent machine gun casings litter the streets. After three months of relatively peaceful times, things have dramatically changed here, all because of the events of 6, 7 and 8 March. A Thursday, Friday, and Saturday that could determine Syria's future. Driving out of Jableh and over a bridge, we pass through another checkpoint, then through a deserted village, home to a community of Syrian Alawites. Shops and homes are destroyed, soldiers guard the roads in and out. We are on our way to the Hmeimim air base, home to the Russian military in Syria. It's also now home to as many as 10,000 Alawites who are now camping in and around the base. They are seeking shelter and protection, watched on by Russian soldiers who remain inside. Some of the thousands are in tents or under makeshift cover, others are sleeping rough or in their cars. I first visited the airbase last December - then it consisted of a small cluster of shops and restaurants, established over years to service the Russian personnel. Now the shops are shuttered and the restaurants cleared of tables to allow the families to sleep. As I approached the gates of the base, I was surrounded by people pushing against each other, trying to get to me to tell me stories of being burnt out of their houses, or of family members killed in front of their eyes. A young woman pulled me aside. \"We need help, international help,\" she whispered. \"We need international peacekeepers; my house was on fire.\" The Alawites are a religious minority in Syria, originating from Shia Islam. The overthrown president Bashar al Assad belonged to the sect. They make up around 10% of Syria's population, which is majority Sunni, and mainly live in the country's coastal regions. During Assad's reign, the Alawites made up a large part of his support base and held top posts in the army and security agencies. Since his fall from power, many Alawites were fired from their jobs and some former soldiers who reconciled with the new authorities were killed. Civilians have now been targeted in revenge killings by Sunni Muslim militants loyal to the new government, who have blamed Assad's loyalists for attacks against the country's new security forces in recent weeks. The Alawites, along with Syria's other minority communities, including Kurds, Christians and Druze, have said they are concerned about revenge attacks and are not convinced by the new government's promise of an inclusive country. In the crowd, I met Adiba Shehaidi. She's sleeping rough outside the base after escaping her village, Ain al Arous. \"They attacked us, just like that, slaughtered us, our friends, our neighbours, our children, our relatives - our in-laws, all of them, were slaughtered. They stormed the houses, shooting…\" she recounted her story of escape. \"What can we say? To the world, what can we say? What was our crime?\" she cried. We were told that whole families had been killed with some buried in mass graves. Not far away from the base, in the village of Al Sanobar - we found one. A mass grave consisting of two trenches, dug under the cover of darkness by villagers. They buried 80 people here. Sticks had been placed in the earth to signal a body buried beneath. We are told a family of 17 are in one of the graves. Further into the village, we came across a group of men digging more graves. They told us they had found the bodies of their families, friends, and neighbours littered on the streets and in houses. So far, they have buried 223 people, all from this one village. On trucks, the bodies wrapped in blankets and plastic were brought to their final resting place near their homes. Under a blistering sun a simple ceremony is held, then side by side they are buried. These families have been devastated - their anguish obvious. Read more:Alawites take refuge from Syrian armyGovernment forces clash with Assad loyalistsSyria vows to investigate mass killings Convoys of government security forces are now constantly patrolling all the areas where the killings took place, and they are trying to encourage the Alawites to return to their villages, saying it is now safe. The head of General Security, Mustafa Kunefate, told me what happened here was unacceptable and must not happen again. He explained how Assad loyalists had attacked and killed soldiers, police officers, and civilians - filming it and posting it on social media. This, he said, led to \"undisciplined groups\" arriving to this part of Syria, acting \"outside of the Ministry of Defence's command\". \"Among these groups were some with a questionable intent, many arrived with no clear instructions, simply coming to break the siege on the Ministry of Defence personnel and police,\" Mr Kunefate told me. \"This resulted in chaos and a breakdown of discipline among the fighting groups that entered the coastal region.\" The scene of some of the worst fighting happened in the city of Jableh when the pro-Assad militia attacked. Much of the centre of town has been badly damaged in the fighting, and it is tense. General Security convoys constantly patrol the city, home to Sunni civilians who were murdered like their Alawite neighbours. Imad Bitar's father Talal died after his car was fired upon by Assad fighters. I met him in their family home where he told me he wants peace but believes it will only happen when Assad's fighters are captured. \"We must find a way to live together, our only demand now is for the remaining factions to leave Syria and for those responsible for the regime's crimes to face a formal trial. It's not about sectarian divisions, it's about justice.\" This has been a difficult time for the new government trying to unite Syria. The massacres of Alawites at the hands of militia puts President Ahmed al Sharaa's unity project in jeopardy. But if there is a positive from that dreadful weekend, it is that the government acknowledges the mistakes and is promising to bring those responsible to justice. The World with Yalda Hakim at 9pm on Sky News will feature a series of special reports on Syria from our chief correspondent Stuart Ramsay and special correspondent Alex Crawford. Watch their latest report inside Al-Hol camp, where thousands of families affiliated to the former Islamic State group are being held by Kurdish forces in northeast Syria."
    },
    {
        "title": "Drag queen The Vivienne died after taking ketamine, family says",
        "description": "Drag queen James Lee Williams - known as \"The Vivienne\"- died after taking ketamine, their family has said.",
        "url": "https://news.sky.com/story/drag-queen-the-vivienne-died-after-taking-ketamine-family-says-13331059",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-the-vivienne-drag-race-uk_6792406.jpg?20250105223330",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-17 18:22:00",
        "Headline": "The drag star, whose real name is James Lee Williams, was found dead at their home in Cheshire on 5 January. ",
        "Content": "Drag queen James Lee Williams - known as \"The Vivienne\"- died after taking ketamine, their family has said. Williams, who won the first series of RuPaul's Drag Race UK in 2019 under their drag name, was found dead at the age of 32 at their home in Cheshire on 5 January. In a statement shared in an Instagram story today, Williams' manager Simon Jones said the \"family and I feel it is important to say how James tragically died\". Mr Jones continued: \"We hope that by us releasing this information, we can raise awareness about the dangers of ongoing ketamine usage and what it can do to your body. \"Ketamine usage is on the rise, particularly amongst young people, and I don't think the full dangers of the drug are being discussed.\" Mr Jones added that he and the family are working with mental health and addiction service Adferiad on a campaign to \"raise vital awareness and give information on how to get help if you are struggling with ketamine usage\". Williams reportedly died after suffering a cardiac arrest caused by ketamine - a general anaesthetic that is also used as a recreational drug, Donna Chaves, from Adferiad, said: \"We are incredibly grateful to James's family for choosing to support and work with us on this campaign. \"Their courage in sharing James's story will help raise vital awareness of the devastating impact substance use can have. We are seeing a worrying rise in the number of people using ketamine, often unaware of the serious risks it poses to their physical and mental health. \"Addiction can affect anyone, and too many people suffer in silence due to stigma and lack of understanding. \"By opening conversations and challenging misconceptions, we can help prevent further tragedies and support those in need to find hope and recovery.\" An inquest into the death of Williams was opened and adjourned at Cheshire Coroner's Court in Warrington last month. The TV personality, who grew up in Colwyn Bay, North Wales, before moving to Liverpool, came third in the 2023 edition of Dancing On Ice. The star performed as the Wicked Witch of the West in a UK and Ireland tour of The Wizard Of Oz musical and reprised the role in the West End at the Gillian Lynne Theatre last year. Read more from Sky News:Conor McGregor meets Donald Trump at White HousePrincess of Wales enjoys Guinness at St Patrick's Day event Man injured by hot tea awarded $50m in damages They were due back on stage this month as the Childcatcher in a tour of Chitty Chitty Bang Bang, a role they first played last year. Their funeral in Bodelwyddan, Denbighshire, North Wales, was attended by RuPaul's Drag Race UK contestants Tia Kofi and Baga Chipz, along with Steps singer Ian \"H\" Watkins, TV personality Kim Woodburn and Coronation Street actress Claire Sweeney. The government is seeking expert advice after illegal use of ketamine surged to record levels. In the year ending March 2023, an estimated 299,000 people aged 16 to 59 had reported use of the substance, which is controlled as class B, according to the Home Office. According to the UK national anti-drug advisory service Frank, ketamine reduces sensations in the body which can make users feel dream-like and detached, chilled, relaxed and happy, but also confused and nauseated. A full inquest into the death of The Vivienne was listed to take place on 30 June."
    },
    {
        "title": "Vandals damage Tesla cars in Belfast",
        "description": "Vandals have damaged around 20 Tesla vehicles at a dealership in Belfast, police have said.",
        "url": "https://news.sky.com/story/vandals-damage-tesla-cars-in-belfast-13331090",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tesla-belfast_6859923.jpg?20250317201406",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-17 19:25:00",
        "Headline": "Around 20 vehicles were targeted at a dealership, with wing mirrors knocked off, windows smashed and bodywork dented, police say.",
        "Content": "Vandals have damaged around 20 Tesla vehicles at a dealership in Belfast, police have said. The Police Service of Northern Ireland (PSNI) said the incident happened in the Boucher Road area in the south of the city on Sunday. Most of the cars had their wing mirrors broken, while some had their windows smashed and others sustained bodywork dents. Police did not mention a suspected motive for the vandalism in their statement - as they urged witnesses to come forward. The Tesla brand has become a target for demonstrations and vandalism in the US and elsewhere in recent weeks after its chief executive Elon Musk took a key role in Donald Trump's administration. The billionaire businessman and owner of X is a friend and supporter of Mr Trump and contributed millions of dollars to his re-election campaign. Musk, a vocal critic of big government, has been leading efforts to cut federal spending via the Department of Government Efficiency (DOGE), with plans for mass layoffs of federal workers.  Police in Oregon said \"more than a dozen\" shots were fired at a Tesla dealership last week - the second time the business had been targeted in a week. Four Cybertrucks were destroyed by fire in Seattle, but police have not said if it was arson. Damage to Tesla vehicles has also been reported in Massachusetts, Washington and South Carolina, police told ABC News said. In a bid to boost sales and support the brand, Mr Trump said he would buy one in front of the White House last week. Read more:What's gone wrong at Musk's Tesla?Musk's X hit by cyber attack Standing in front of several Teslas, the US president declared the red Model S \"beautiful\" and urged Americans to buy Tesla in solidarity with Musk, whom he called \"a great American\". It came after Tesla shares plunged by at least 15%, meaning the stock has lost more than half its value since its peak in December, after Mr Trump refused to rule out a recession in the US economy."
    },
    {
        "title": "Big benefits cuts are imminent - here's what to expect and why it could be just the start",
        "description": "Those with \"milder mental health\" issues and \"lower-level physical conditions\" could see their disability benefits cut, as the government looks to shave &#163;6bn off the welfare bill.",
        "url": "https://news.sky.com/story/these-are-the-big-benefits-changes-you-should-expect-and-why-they-could-be-just-the-start-13331073",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-beth-rigby-rachel-reeves_6859956.jpg?20250317193442",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-03-17 19:06:00",
        "Headline": "With little more than a week to go until Rachel Reeves delivers the spring statement, the Treasury is looking for ways to plug a hole in the public finances. The welfare system is set for billions of pounds in cuts - but some in government think the changes don't go far enough.",
        "Content": "\n          Political editor\n              @BethRigby\n  Those with \"milder mental health\" issues and \"lower-level physical conditions\" could see their disability benefits cut, as the government looks to shave £6bn off the welfare bill. Liz Kendall, the work and pensions secretary, is expected to target sickness and disability benefit payments for savings on Tuesday, which comes ahead of the spring statement next Wednesday. Politics latest: Welfare reforms 'imminent' Her welfare reform green paper will arrive after Downing Street insisted there is a \"moral and an economic case for fixing our broken system\". Government figures argue the rising sickness and disability bill, which has ballooned since the pandemic, is unsustainable and will \"leave the welfare state losing legitimacy\" in the eyes of the wider public if not dealt with. The cuts come as the chancellor eyes a hole in the public finances on the back of lower than expected growth and rising borrowing costs, with the £9.9bn headroom she had at the budget in October now wiped out. Rachel Reeves' self-imposed fiscal rules mean day-to-day government spending must be covered by tax revenue by 2029-30, which leaves her needing billions of pounds in spending cuts (after ruling out further tax rises, her other option).  What changes should we expect? Ms Kendall is expected to target personal independence payments (PIP) - one of the main forms of disability benefits for those with long-term illnesses or disabilities - amid a spike in claimants. The PIP bill has grown from £13.7bn a year before the pandemic to £21.8bn in the current financial year, and is set to increase to £34.1bn by the end of the decade. The number of people claiming this disability benefit is projected to more than double from two million to 4.3 million. The work and pensions secretary will tell MPs that Labour will protect those who have a serious condition and can't work, and the government's rowed back from plans to freeze PIP payments after backlash from its backbench MPs. These payments are now expected to rise in line with inflation, but the eligibility criteria will be tightened to whittle back the number of people eligible to claim. One government figure told me it would result in some conditions, such as \"milder mental health\" or \"lower-level physical conditions\", being ineligible for PIP. But they stressed that those with more severe conditions and who are never going to be able to work would be protected and cared for. Read more:Which benefits could be cut?Why Labour MPs are so uncomfortable  The key principles driving reforms The changes are likely to draw criticism from some MPs, though one senior Labour source said they didn't think there would be any ministerial resignations over the benefit announcements. Another Labour figure told me they would be \"massively shocked\" if there were resignations. However, a number of Labour MPs have voiced their concerns, as has the Manchester mayor Andy Burnham. In a bid to assuage MPs, the work and pensions secretary is also expected to earmark £1bn of savings into employment support programmes as she frames the reforms around three clear principles. 👉 Tap here to listen to Electoral Dysfunction on your podcast app 👈 The first will be to prevent people from falling into long-term economic inactivity with a better support offer to get people back into work quickly. The second will be to change the incentive systems to move people away from welfare dependency. This could see Ms Kendall slash the highest level of incapacity benefit for working age people who have an illness or disability that limits their ability to work, while increasing the basic rate of support for those out of work (universal credit). This is because the lower level of unemployment benefit has led to more people claiming for additional incapacity and disability benefits, while disincentivising them to try to find work. The government will also announce a \"right to try\" scheme, allowing those on incapacity benefits to try returning to work without the risk of losing their benefits, as happens in the current system.  'I don't think they go far enough' But with one in 10 working age people claiming sickness benefits, and one in eight young people not in education, employment or training, the reforms on Tuesday could be just the start of bigger changes - and potentially bigger political battles. The cost of long-term sickness and disability benefits for working-age people has risen by about £20bn since the pandemic to about £48bn, and is forecast to hit almost £100bn by 2030. \"People are trapped on benefits and the bill is getting out of hand,\" said one government figure. \"We are currently spending more than three times the annual policing bill on these benefits. It's getting out of hand. \"I don't think the reforms go far enough, and I don't think people have clocked the size of the numbers going on here.\""
    },
    {
        "title": "John 'Paddy' Hemingway: Last surviving Battle of Britain pilot dies aged 105",
        "description": "The last surviving Battle of Britain pilot John 'Paddy' Hemingway has died aged 105. ",
        "url": "https://news.sky.com/story/john-paddy-hemingway-last-surviving-battle-of-britain-pilot-dies-aged-105-13330998",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-john-hemingway_6860059.jpg?20250317225643",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-17 15:55:00",
        "Headline": "Hemingway never saw his role in the Battle of Britain as \"anything other than doing the job he was trained to do,\" the RAF said, adding that \"his courage in the face of overwhelming odds demonstrated his sense of duty and the importance of British resilience\".",
        "Content": "The last surviving Battle of Britain pilot John 'Paddy' Hemingway has died aged 105.  The Royal Air Force said he died peacefully on Monday. Paddy Hemingway, one of 'the Few' and a revered figure in British aviation history, played a key role in defending the United Kingdom against the Nazis in the summer of 1940, when he was just 19. 'The Few' refers to a speech by Sir Winston Churchill in the House of Commons in August that year as the Battle of Britain reached its peak. Praising the efforts of RAF fighter pilots, the wartime prime minister said that \"never in the field of human conflict was so much owed by so many to so few.\" In an online tribute, the RAF said Hemingway's squadron shot down 90 enemy aircraft during an 11-day period in May 1940. In August, he was twice forced to bail out of his Hurricane fighter plane and the following year, he broke his hand in another bailing out - this time at 600 feet (183m) after his plane's instruments failed in bad weather. His parachute failed to open properly but, luckily it caught on the branches of a tree, sparing him further injury. Near the end of World War Two, while serving in the Mediterranean, he was forced to bail out a fourth time near Ravenna in Italy after his Spitfire was hit multiple times by anti-aircraft fire. Dropping into enemy territory, he contacted Italian partisans, who helped him return to his squadron. Hemingway never saw his role in the Battle of Britain as anything other than doing the job he was trained to do, the RAF said. The force described him as always having a \"twinkle in his eyes as he recalled the fun times with colleagues in France and London. \"His courage in the face of overwhelming odds demonstrated his sense of duty and the importance of British resilience.\" Hemingway, the RAF said, was a \"quiet, composed, thoughtful and mischievous individual\" who \"embodied the spirit of all those who flew sorties over this green and pleasant land\". Read more from Sky News:McGregor meets Donald TrumpKate enjoys a Guinness$50m for man hurt by hot tea In July 1941, he was awarded the Distinguished Flying Cross (DFC) and in September of that year, he was Mentioned in Dispatches. Prime Minister Sir Keir Starmer said: \"Very sad to hear of the passing of Group Captain John 'Paddy' Hemingway, the last known Battle of Britain pilot. \"His courage, and that of all RAF pilots, helped end WWII and secure our freedom. We will never forget their bravery and service. \"Thank you, John 'Paddy' Hemingway.\" Defence Secretary John Healey said Hemingway's generation \"understood the importance of freedom and sacrificed so much to achieve it\". Air Chief Marshal Sir Rich Knighton, the Chief of the Air Staff, said the flyer was \"an amazing character whose life story embodies all that was and remains great about the Royal Air Force\". This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Kemi Badenoch says UK target to reach net zero by 2050 'impossible'",
        "description": "Tory leader Kemi Badenoch has dismayed green Conservatives by declaring the UK's target to reach net zero by 2050 \"impossible\".",
        "url": "https://news.sky.com/story/kemi-badenoch-says-uk-target-to-reach-net-zero-by-2050-impossible-13331102",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-kemi-badenoch-conservative_6860006.jpg?20250317222212",
        "type": "UK",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-03-17 20:02:00",
        "Headline": "The Conservative leader's remarks are criticised by a Tory environmental group which says she has made a mistake.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Tory leader Kemi Badenoch has dismayed green Conservatives by declaring the UK's target to reach net zero by 2050 \"impossible\". In a speech on Tuesday, the Conservative Party leader is expected to tell what she says is the \"unvarnished truth\" that the net zero goal cannot be achieved without \"a serious drop in our living standards or by bankrupting us\". Ms Badenoch will say she is not making a \"moral judgement\" on net zero or debating whether climate change exists. But, as she begins to renew party policy, she will say that current climate policies are \"largely failing\" to improve nature and \"driving up the cost of energy\". Politics latest: Follow live updates Net zero means cutting emissions of greenhouse gases, which cause climate change, to virtually zero, and absorbing the rest elsewhere. Scientists say the world must reach that point by 2050 to avoid even worse flooding, wildfires, and other damage - but that action is lagging behind. The UK has already cut its greenhouse gas emissions in half. The next half is expected to be more challenging as it requires changes to people's heating, cars and diet - things that often need upfront costs, but could save people money in the long run with the right government support, advisers have said. Ms Badenoch's plans take the Conservative Party to its most sceptical position on net zero yet - a target set in law by Tory Prime Minister Theresa May in 2019. And it comes at a time when Reform UK is questioning climate science and US President Donald Trump, leader of the second most polluting country in the world, is dismantling nature protections.  Ms Badenoch's \"policy renewal\" she is outlining on Tuesday will see shadow cabinet members set core priority questions as a move towards formulating new policy for the party. Sam Hall, of the Conservative Environment Network of 50 MPs, said it was \"a mistake\" for Ms Badenoch to have \"jumped the gun on her own policy review and decided net zero isn't possible by 2050\". He said the Tory leader was right to question Labour's climate plans, but that the target is driven \"not by optimism but by scientific reality; without it climate change impacts and costs will continue to worsen\". Abandoning the science would risk losing voter's support, he added. Climate reporter The UK public has long been supportive of government climate action – that's true across voters of different parties too. Labour capitalised on this in last year's general election and swooped to victory with a green mandate.\n\n Rishi Sunak's attempts to roll back some climate policies flopped, and polling by More In Common found Labour's arguments that clean power and climate action are the best way to tackle the cost of living cut through with people. For now, at least. The tide of climate scepticism has been rising since Sunak's days, with Reform UK questioning climate science altogether and Kemi Badenoch now calling the 2050 target \"impossible\" – though she did stress she doesn't want to dismantle it and that she does believe in climate change. And she's not wrong that it is going to be hard. Given the strong public support for climate action, it's not surprising Sunak's attempt to politicise the issue didn't work out for him.\n\n But now others following in his footsteps have been emboldened by US President Donald Trump. Their attacks are gathering speed - and they might start to take root.\n\n\n\n This may be an inflection point for goodwill towards climate action in the Conservative Party – which has a long legacy of supporting it – and more broadly in the UK. Labour cannot take public support for its net zero plans for granted at a time when political consensus on it is fracturing.\n\n And given the next stage of the country's climate action is about to get more disruptive for people, it is just when it needs this public support more than ever.\n\n Four in five Conservative voters in last year's general election and two thirds of Reform voters thought it was important that the government cared about tackling climate change, according to polling by More in Common. Shaun Spiers, executive director of thinktank Green Alliance, called it \"disappointing\" to see Ms Badenoch \"turn her back on cleaner, cheaper, homegrown energy\". \"It is even more disappointing to see the leader of the opposition take cues from climate deniers across the pond,\" he added, in a veiled swipe at President Trump. \"Net zero is not 'nice-to-have', it's an achievable, evidence-based target designed to protect the UK from the worst impacts of climate change.\" The UK's Climate Change Committee (CCC), which advises governments on how to reach net zero, said last month the goal is \"ambitious\" but \"deliverable\". But it also warned as Labour took office last summer that, at that time, just one third of the cuts to greenhouse gases needed to reach an interim 2030 target were covered by a \"credible plan\"."
    },
    {
        "title": "Israel breaking international law over Gaza aid blockade, UK government says for first time",
        "description": "Israel is breaking international law by stopping aid into Gaza, the UK government has said for the first time.",
        "url": "https://news.sky.com/story/israel-breaking-international-law-over-gaza-aid-blockade-uk-government-says-for-first-time-13331023",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-gaza-food_6859287.jpg?20250317071933",
        "type": "UK",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-03-17 17:07:00",
        "Headline": "The foreign secretary describes Israel's decision to stop all goods from entering the strip as \"unacceptable, hugely alarming and very worrying\" - in a significant strengthening of the UK's language.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  Israel is breaking international law by stopping aid into Gaza, the UK government has said for the first time. Foreign Secretary David Lammy said that while Israel \"quite rightly must defend its own security\", the ongoing blockade of goods and supplies to the strip was a \"breach of international law\". Appearing in the Commons, Mr Lammy was repeatedly asked about Israel's decision at the beginning of the month, which came about following disagreements with Hamas over ceasefire terms set out in January following 15 months of war sparked by the 7 October attack against Israel. Badenoch heckled at speech - politics latest updates Asked by Labour MP Rupa Huq what the \"consequences\" would be for Israel's \"provocative action\" during the holy month of Ramadan, the foreign secretary said for the first time that Israel was in breach of international law. \"Well, my honourable friend is right,\" he said. \"This is a breach of international law. \"Israel quite rightly must defend its own security but we find the lack of aid - it's now been 15 days since aid got into Gaza - unacceptable, hugely alarming and very worrying. \n                  Lammy and European foreign ministers back Egyptian plan for Gaza rebuild\n                 \n                  David Lammy promises £55m in support for Ukraine on visit to war-torn country\n                 \n                  Foreign secretary says people should 'follow the rules' in other countries after 18-year-old constituent jailed in Dubai\n                 \"We would urge Israel to get back to the amount of trucks that we were seeing going in, way beyond 600, so that Palestinians can get the necessary humanitarian support they need at this time.\" Israeli Prime Minister Benjamin Netanyahu made the decision to stop aid going into Gaza after Hamas rejected an Israeli request to extend the first phase of the Gaza ceasefire. The militant group said it would only release the remaining Israeli hostages under the terms of the already agreed-upon phased deal, and not as per the plan put forward by US Middle East envoy Steve Witkoff, which would see the first phase of the ceasefire deal continue through Ramadan and Passover, or until 20 April. The war between Israel and Hamas has left most of Gaza's population of over 2 million dependent on international aid. Approximately 600 aid trucks had been entering the strip every day since the ceasefire began in January. Israel claims that Hamas hijacks the trucks and \"turns aid into weapons\". The Israel foreign ministry has claimed there is \"no shortage of essential products in the strip whatsoever\". \"The only humanitarian suffering in Gaza is that of the Israeli hostages, who are being chained, starved, and held in Hamas tunnels.\" The UK government has previously stopped short of accusing Israel of breaking international law, saying only in a joint statement with French and German foreign ministers at the beginning of the month that the most recent aid blockade \"would risk violating international humanitarian law\". \"Humanitarian aid should never be contingent on a ceasefire or used as a political tool,\" they added. \"We reiterate that the civilians of Gaza who have suffered so much must be allowed to return to their homes and rebuild their lives.\" Last September the UK suspended arms sales to Israel on the grounds that, following a review of export licences for UK arms, there was a \"clear risk\" they might be used to commit \"a serious violation of international humanitarian law\". The suspension covered components that go into military aircraft that have been used in Gaza, including helicopters and drones, as well as items which facilitate ground targeting. But it did not include parts for multinational F-35 fighter jets - something that has concerned opposition MPs and human rights charities. Read more:Inside Syrian cities shaken by bloody violenceIsrael accused of 'genocidal acts' against Palestinians The move prompted a critical response from Mr Netanyahu, who said it was \"shameful\" and \"will not change Israel's determination to defeat Hamas, a genocidal terrorist organization that savagely murdered 1200 people on October 7, including 14 British citizens\". The war in Gaza began after Hamas militants carried out a cross-border raid into southern Israel on 7 October 2023, killing 1,200 people and capturing around 250 hostages, according to Israeli officials. Israel responded by launching an air and ground offensive in Gaza which has killed more than 48,000 Palestinians, say Gaza health officials. The Gaza health ministry does not distinguish between civilians and combatants in its count but said more than half of the fatalities were women and children."
    },
    {
        "title": "Drag queen The Vivienne died after taking ketamine, family says",
        "description": "Drag queen James Lee Williams - known as \"The Vivienne\"- died after taking ketamine, their family has said.",
        "url": "https://news.sky.com/story/drag-queen-the-vivienne-died-after-taking-ketamine-family-says-13331059",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-the-vivienne-drag-race-uk_6792406.jpg?20250105223330",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-17 18:22:00",
        "Headline": "The drag star, whose real name is James Lee Williams, was found dead at their home in Cheshire on 5 January. ",
        "Content": "Drag queen James Lee Williams - known as \"The Vivienne\"- died after taking ketamine, their family has said. Williams, who won the first series of RuPaul's Drag Race UK in 2019 under their drag name, was found dead at the age of 32 at their home in Cheshire on 5 January. In a statement shared in an Instagram story today, Williams' manager Simon Jones said the \"family and I feel it is important to say how James tragically died\". Mr Jones continued: \"We hope that by us releasing this information, we can raise awareness about the dangers of ongoing ketamine usage and what it can do to your body. \"Ketamine usage is on the rise, particularly amongst young people, and I don't think the full dangers of the drug are being discussed.\" Mr Jones added that he and the family are working with mental health and addiction service Adferiad on a campaign to \"raise vital awareness and give information on how to get help if you are struggling with ketamine usage\". Williams reportedly died after suffering a cardiac arrest caused by ketamine - a general anaesthetic that is also used as a recreational drug, Donna Chaves, from Adferiad, said: \"We are incredibly grateful to James's family for choosing to support and work with us on this campaign. \"Their courage in sharing James's story will help raise vital awareness of the devastating impact substance use can have. We are seeing a worrying rise in the number of people using ketamine, often unaware of the serious risks it poses to their physical and mental health. \"Addiction can affect anyone, and too many people suffer in silence due to stigma and lack of understanding. \"By opening conversations and challenging misconceptions, we can help prevent further tragedies and support those in need to find hope and recovery.\" An inquest into the death of Williams was opened and adjourned at Cheshire Coroner's Court in Warrington last month. The TV personality, who grew up in Colwyn Bay, North Wales, before moving to Liverpool, came third in the 2023 edition of Dancing On Ice. The star performed as the Wicked Witch of the West in a UK and Ireland tour of The Wizard Of Oz musical and reprised the role in the West End at the Gillian Lynne Theatre last year. Read more from Sky News:Conor McGregor meets Donald Trump at White HousePrincess of Wales enjoys Guinness at St Patrick's Day event Man injured by hot tea awarded $50m in damages They were due back on stage this month as the Childcatcher in a tour of Chitty Chitty Bang Bang, a role they first played last year. Their funeral in Bodelwyddan, Denbighshire, North Wales, was attended by RuPaul's Drag Race UK contestants Tia Kofi and Baga Chipz, along with Steps singer Ian \"H\" Watkins, TV personality Kim Woodburn and Coronation Street actress Claire Sweeney. The government is seeking expert advice after illegal use of ketamine surged to record levels. In the year ending March 2023, an estimated 299,000 people aged 16 to 59 had reported use of the substance, which is controlled as class B, according to the Home Office. According to the UK national anti-drug advisory service Frank, ketamine reduces sensations in the body which can make users feel dream-like and detached, chilled, relaxed and happy, but also confused and nauseated. A full inquest into the death of The Vivienne was listed to take place on 30 June."
    },
    {
        "title": "Teenage motorist admits causing deaths of three passengers as he drove home from school",
        "description": "A teenage motorist has admitted causing the deaths of three passengers after he crashed into another car while driving home from school.  ",
        "url": "https://news.sky.com/story/teenage-motorist-admits-causing-deaths-of-three-passengers-as-he-drove-home-from-school-13331104",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-harry-purcell-tilly_6859999.jpg?20250317205316",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-17 20:00:00",
        "Headline": "Harry Purcell, 17, and 16-year-old Tilly Seccombe (both pictured below) along with Frank Wormald, 16, were passengers in a car driven by Edward Spencer who had only passed his driving test five weeks before the collision.",
        "Content": "A teenage motorist has admitted causing the deaths of three passengers after he crashed into another car while driving home from school.   Edward Spencer, now 19, had only passed his driving test five weeks before the collision between Chipping Campden in Gloucestershire and Shipston-on-Stour in Warwickshire in April 2023. His three passengers - Harry Purcell, 17, Tilly Seccombe, 16, and Frank Wormald, 16 - died as a result of their injuries. All four were sixth form students at Chipping Campden School. A woman and two young children, who were travelling in the other car involved in the crash, were seriously injured and continue to receive treatment for their life-changing injuries. Spencer, from Newbold on Stour in Warwickshire, pleaded guilty to three counts of causing death by careless driving and three counts of causing serious injury by careless driving at Warwick Crown Court on Monday. He was granted bail and will be sentenced on 28 April. Warwickshire Police said Spencer, who was 17 at the time of the crash, lost control of his Ford Fiesta on the B4035 Campden Road. Speaking after Monday's court hearing, Inspector Michael Huntley urged young people and their parents to consider the limitations of being a newly-qualified driver. \"Drivers need to be aware of the devastating consequences that can occur if a car is driven carelessly,\" he said. \"Edward Spencer had only passed his test five weeks prior to the collision and his careless actions cost the lives of three young people travelling in his car.\" Read more from Sky News:Paedophile who spent 27 years on the run jailedLucy Letby's lawyers call for inquiry to be suspended He added: \"So many lives have been ruined by this terrible incident. I can't begin to imagine the pain this has caused, and our thoughts remain with the individuals and families affected. \"Edward Spencer will live with the consequences of his careless actions for the rest of his life, as will the families of all those involved.\""
    },
    {
        "title": "Canada's new Prime Minister Mark Carney meets King Charles and Sir Keir Starmer",
        "description": "Canada's new prime minister Mark Carney has met Sir Keir Starmer in Downing Street this evening, with the UK leader welcoming the relationship between the \"two sovereign allies\". ",
        "url": "https://news.sky.com/story/mark-carney-meets-king-as-he-looks-to-strengthen-eu-alliances-amid-us-rift-13330877",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-mark-carney-king-charles_6859841.jpg?20250317170609",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-17 12:09:00",
        "Headline": "The former Bank of England governor, who was sworn in as Canada's new leader last week, arrived in London from Paris where he met French President Emmanuel Macron.",
        "Content": "Canada's new prime minister Mark Carney has met Sir Keir Starmer in Downing Street this evening, with the UK leader welcoming the relationship between the \"two sovereign allies\".  The former Bank of England governor also met King Charles, who is Canada's head of state, at Buckingham Palace where Mr Carney told the monarch they had \"much to catch up on\". The visit to the UK comes as US President Donald Trump has been threatening Canada's sovereignty by repeatedly suggesting he would make it the 51st US state - something Mr Carney called \"disrespectful\" in a press conference this evening. Mr Carney, who was sworn in on Friday, succeeded Justin Trudeau as Canada's prime minister and leader of the Liberal Party. He had arrived in London from Paris, where he met French President Emmanuel Macron. He said it was important to strengthen ties with \"reliable allies\" in Europe at a critical time for relations between Canada and its bigger neighbour, the US. In the press conference, Mr Carney dismissed a question about allies not vocally supporting Canada as a sovereign nation, saying: \"We don't need another country to validate our sovereignty, we are sovereign.\" Sir Keir said it was \"fantastic\" to have Mr Carney in the UK so early in his tenure and that the relationship between the two countries \"has always been strong\". \"Two sovereign allies with so much in common, shared history, shared values, shared King.\" Earlier, the King was pictured grinning as he shook Mr Carney's hand in the 1844 Room of the royal residence. Footage from the meeting showed the King telling Mr Carney: \"Very good to see you. Congratulations.\" Mr Carney replied as they shook hands: \"Your Majesty. Lovely to see you...Thank you very much.\" He told the King pointing to his own lapel: \"Bit of a disaster today sir. My Order of Canada pin broke.\" Mr Carney added: \"Yes. It fell on the tarmac... which is proof that our founding people is the British,\" prompting a chuckle from the King. The monarch offered his pin before telling his visitor: \"It's a great treat to see you again\", with Mr Carney replying: \"Much to catch up on.\" Royal correspondent \"Very good to see you, congratulations\" were the King's opening remarks to Mark Carney in the 18th century-room at Buckingham Palace.  A very jovial start to the 45 seconds that the palace allowed to be filmed.  Short, yes, but it's actually quite rare that a TV camera is allowed in for the start of an audience - even that says a lot. A sign that it was important for all sides that this meeting was properly seen between Canada's monarch, King Charles as their head of state, and his new prime minister in that realm, at what is a difficult time.  The small talk, with Mark Carney explaining how his Order of Canada pin had broken and the King offering to give him his, was a preamble to no doubt more troubling discussions, with Carney saying there was \"much to catch up on\".  For 30 minutes the two men were then left alone to talk, as is common practice between the monarch and any of his prime ministers. What they talked about, we don't know. Last week, when the King met members of the Canadian Senate, we were told they discussed topics of great concern to all parties, both nationally and internationally.  You would expect that President Trump's remarks about turning Canada into the 51st state, and the ongoing war of words over trade, inevitably would have been on the list of topics for discussion this time. And just maybe how the King may be helpful.  King Charles is one man who hasn't been in Donald Trump's firing line, with the president publicly saying he respects him. During his swearing-in ceremony on Friday, Mr Carney noted the country was built on the bedrock of three peoples: French, British and Indigenous. He also said Canada is fundamentally different from America and will \"never, ever, in any way shape or form, be part of the United States\".  Mr Carney has said he won't sit down with Trump until the US is ready to have a more comprehensive discussion on trade. \"When the US is ready to have that we're ready to sit down,\" he said. He added Canada is not trying to organise a coordinated retaliation response among countries and that there is a limit to what Canada is prepared to do in retaliation given that the US economy is 10 times the size of Canada's. Mr Carney also noted the United States, France, the UK and Canada are members of NATO and it would be \"unthinkable\" for the US to annex Canada through military means. The new prime minister is trying to steer his country through a trade war brought by Mr Trump, who has slapped 25% tariffs on Canadian steel and aluminium and is threatening sweeping tariffs on all Canadian products from 2 April. Canada, which is the biggest foreign supplier of steel and aluminium to the US, last week announced 25% retaliatory tariffs on those metals along with computers, sports equipment and other products worth $20bn in total. Meanwhile, Sir Keir and Mr Carney also spoke about the war in Ukraine. Canada has been taking part in discussions around a coalition of countries which could contribute to a peacekeeping force in Ukraine. Canada took part in a virtual meeting of world leaders hosted by Sir Keir on Saturday, focused on the so-called \"coalition of the willing\", alongside Australia and New Zealand as well as European nations. The Canadian premier told Sir Keir: \"We're at a point in history where the world is being reordered, and your leadership, the leadership of the UK, I'll use the example... of Ukraine, what you've been able to do with President Macron to bring together a coalition of the willing at a crucial time, I think, will be decisive, must be decisive, in coming to a lasting solution there.\""
    },
    {
        "title": "Paedophile who spent 27 years on the run guilty of dozens of child sexual abuse offences",
        "description": "A British paedophile who spent 27 years on the run in Thailand after stealing another man's identity has been found guilty of 97 offences, including dozens of historical child sexual abuse offences.",
        "url": "https://news.sky.com/story/paedophile-who-spent-27-years-on-the-run-guilty-of-dozens-of-child-sexual-abuse-offences-13327060",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-richard-burrows-heathrow_6854113.jpg?20250317142119",
        "type": "UK",
        "Author": "Greg Milam",
        "Date Published": "2025-03-17 14:06:00",
        "Headline": "Richard Burrows spent 27 years on the run, but was arrested at Heathrow Airport on his return from Thailand on the eve of his 80th birthday.",
        "Content": "\n          Chief North of England correspondent\n              @GregMilamSky\n  A British paedophile who spent 27 years on the run in Thailand after stealing another man's identity has been found guilty of 97 offences, including dozens of historical child sexual abuse offences. Richard Burrows, a former boarding school housemaster and scout leader, spent decades living in an area he described as \"paradise\" after fleeing the UK when he was due to appear in court in 1997. He was arrested at Heathrow Airport on his return from Thailand on the eve of his 80th birthday last March. Burrows, who lived in the southern Thailand province of Phuket, told family he had come back to face his accusers and his maker - police say the truth was that he simply had run out of money. He had previously admitted dozens of offences dating from the mid-1960s to the mid-1990s. The jury at Chester Crown Court heard that Burrows systematically abused boys with whom he came into contact. Before his trial Burrows admitted 43 offences - including indecent assault of boys, making indecent images of children, possession of indecent images of children and four counts of possession of false identity documents with intent. He denied 54 others which jurors convicted him of on Monday. Those offences include indecent assault of boys, buggery, attempted buggery and indecency with a child. Mark Connor KC said: \"He obtained positions of trust and responsibility which he breached to satisfy himself sexually with the youngsters.\" Burrows has been remanded in custody and will be sentenced on Monday 7 April for a total of 97 offences. He had worked as a housemaster at a school for troubled teenagers in Cheshire in the 1960s. He was later involved with the scouts and amateur radio clubs in the Midlands Read more:Decades on the beach - Burrows' life in hiding Victim describes 'despicable, evil human being' James Harvey was 13 or 14 when he was befriended by Burrows through his involvement with the sea scouts. Burrows admitted indecently assaulting James in a caravan after visiting an RAF show. James has waived his right to anonymity as a victim of a sexual offence. He told Sky News: \"The reason I'm doing this is to at least put a face to the real children who from the age of 10, 12, 13, put their trust in this man. I want his name to be trashed in the world for everybody that ever knew him and thought that he was okay. \"I think he's pathetic in the true sense of the word. His impulses and emotions have driven everything that he's done probably throughout the whole of his life and have left him looking like a shambling, despicable, evil human being that could casually over 60 years do this to children and still wake up in the morning and find a way of justifying it. \"I think he's pathetic, I think he's weak. There is nothing about this man that deserves anything other than loathing.\" During his trial, Burrows admitted being a paedophile but denied the more serious allegations, describing them as \"degrading and disgusting\". The court heard that Burrows believed his actions had done no harm to the children. As he planned his return to the UK last year, he told his brother that \"not all paedophiles are the same\". \"I just think that's a disgusting comment to make,\" detective inspector Eli Atkinson of Cheshire Police told Sky News. \"What we see when we talk to the victims is that it absolutely did do harm. For the vast majority of them, that is their first sexual experience at the age of nine, ten, eleven, twelve, that affects a person for the rest of their life.\"  How paedophile's crimes spanned four decades The jury was told how Burrows, who is originally from Sutton Coldfield, systematically abused 26 young boys across Cheshire, the West Midlands and West Mercia between 1968 and 1995. The offences in Cheshire took place between 1969 and 1971 while he was working as a housemaster, looking after vulnerable children at Danesford Children's Home in Congleton. His victims in the West Midlands and West Mercia were abused between 1968 and 1995, the majority through local scout groups where Burrows worked as a leader. In each case, he befriended the victims by using his position of trust over them and their personal interests, such as radio communications or boating. After gaining their trust, and in many cases the trust of their families, Burrows then went on to sexually abuse the boys. While some of his victims attempted to speak out at the time, many simply did not feel that they would be believed. It was not until the 1990s that many of the victims had the confidence to come forward. Burrows was first arrested in April 1997 and charged with child sexual offences. When he failed to appear at Chester Crown Court that December, a warrant was issued for his arrest. Over the years, police made numerous televised appeals for help to track down Burrows on the BBC's Crimewatch programme. It prompted more accusers to come forward. But Burrows had left the UK. He obtained a passport using the name Peter Leslie Smith having cloned the identity of an unwell acquaintance. Read more from Sky News:Inside Syria's stunned coastal citiesPolice searching for missing woman launch murder probeConor McGregor to meet Trump Fears there could be more victims During a routine reappraisal of the case, police used facial recognition software to confirm that \"Smith\" was in fact Burrows, and that he was living openly in Thailand. When they became aware of his plans to return to the UK, police allowed Burrows to travel on his fake passport so he could be arrested as he touched down. Cheshire Police say they are not able to say whether Burrows might have offended during his time living abroad. DI Atkinson said it is possible there are other victims who have not come forward. \"There may well be. There's a lot of reasons why people have really difficult decisions to make as to whether they come forward in cases like this. \"It would not surprise me if, given the length of time that he offended over and the level of offending, if there were more people out there who were victims of him.\" James Harvey has questions over why Burrows was granted bail in 1997. He also wonders whether he could have done more to report him earlier. \"People listening to me now might think 'Oh, I'd behave differently' but we had no language, no framework, no understanding, no imagination that this same person had done to us, would go on and do something so much worse to somebody else. \"It is almost impossible for me to sit here and say I wish I had done that. There was no way that I could, literally. We lived in this kind of unbelievable ignorance and innocence that there were predators like this living in every single one of our institutions.\" Burrows has now been convicted. Some of his accusers died before seeing him finally face justice."
    },
    {
        "title": "Vandals damage Tesla cars in Belfast",
        "description": "Vandals have damaged around 20 Tesla vehicles at a dealership in Belfast, police have said.",
        "url": "https://news.sky.com/story/vandals-damage-tesla-cars-in-belfast-13331090",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tesla-belfast_6859923.jpg?20250317201406",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-17 19:25:00",
        "Headline": "Around 20 vehicles were targeted at a dealership, with wing mirrors knocked off, windows smashed and bodywork dented, police say.",
        "Content": "Vandals have damaged around 20 Tesla vehicles at a dealership in Belfast, police have said. The Police Service of Northern Ireland (PSNI) said the incident happened in the Boucher Road area in the south of the city on Sunday. Most of the cars had their wing mirrors broken, while some had their windows smashed and others sustained bodywork dents. Police did not mention a suspected motive for the vandalism in their statement - as they urged witnesses to come forward. The Tesla brand has become a target for demonstrations and vandalism in the US and elsewhere in recent weeks after its chief executive Elon Musk took a key role in Donald Trump's administration. The billionaire businessman and owner of X is a friend and supporter of Mr Trump and contributed millions of dollars to his re-election campaign. Musk, a vocal critic of big government, has been leading efforts to cut federal spending via the Department of Government Efficiency (DOGE), with plans for mass layoffs of federal workers.  Police in Oregon said \"more than a dozen\" shots were fired at a Tesla dealership last week - the second time the business had been targeted in a week. Four Cybertrucks were destroyed by fire in Seattle, but police have not said if it was arson. Damage to Tesla vehicles has also been reported in Massachusetts, Washington and South Carolina, police told ABC News said. In a bid to boost sales and support the brand, Mr Trump said he would buy one in front of the White House last week. Read more:What's gone wrong at Musk's Tesla?Musk's X hit by cyber attack Standing in front of several Teslas, the US president declared the red Model S \"beautiful\" and urged Americans to buy Tesla in solidarity with Musk, whom he called \"a great American\". It came after Tesla shares plunged by at least 15%, meaning the stock has lost more than half its value since its peak in December, after Mr Trump refused to rule out a recession in the US economy."
    },
    {
        "title": "Killer who shouted 'die die die' as he stabbed man jailed for life",
        "description": "A killer who shouted \"die die die!\" as he stabbed a man to death with two knives has been jailed for life.",
        "url": "https://news.sky.com/story/killer-who-shouted-die-die-die-as-he-stabbed-man-jailed-for-life-13331027",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-dellan-charles_6859866.jpg?20250317174722",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-17 17:08:00",
        "Headline": "Dellan Charles chased and murdered Sean O'Neill in a quiet residential street following an altercation between \"rival groups\" in west London, police said.",
        "Content": "A killer who shouted \"die die die!\" as he stabbed a man to death with two knives has been jailed for life. Dellan Charles, 23, chased and murdered Sean O'Neill on Reynolds Road in Hayes, west London, on the evening of Thursday 18 May 2023. Police have said the attack took place in \"broad daylight\" following an earlier altercation between \"rival groups\" on Reynolds Road. Charles later cornered Mr O'Neill on the \"quiet residential street\" before using two knives to stab him multiple times, the force added. During his trial at Kingston Crown Court, the jury was told how Charles shouted \"die die die\" while delivering the fatal blows. CCTV footage shows him calmly leaving the scene before fleeing the area by trespassing through leafy suburban gardens. Dellan had disposed of one of his knives at an address near to where the attack took place, the jury was told. He was arrested 10 months later in Coventry, West Midlands, on Wednesday 27 March 2024 following an \"extensive manhunt\", police said. Dellan was convicted of murder in December last year. He was told he will serve a minimum of 23 years at his sentencing at Kingston Crown Court today. Read more from Sky NewsPaedophile jailed after 27 years on the runInside Syria's stunned coastal citiesLetby lawyers call for inquiry to be suspended The jury was told Mr O'Neill was a funny, kind and sociable person and that many people have been affected by his death. In a statement previously provided by his family, they said: \"Sean will be remembered for his big heart, charming smile and fun-loving personality. He is incredibly loved by us all and we miss him every day.\" Detective Inspector Kevin Martin, who led the investigation, said: \"Myself and the team once again pay tribute to Sean's family who, throughout this distressing time, have shown real strength and togetherness. \"Heartbreakingly, nothing will ever bring Sean back, but today, the man responsible for taking him away from his much-loved family has been forced to face the reality of his malicious actions.\""
    },
    {
        "title": "'He doesn't speak for Ireland': Irish leaders critical of McGregor-Trump meeting",
        "description": "Mixed martial arts fighter Conor McGregor has met Donald Trump in the Oval Office after complaining about Ireland's \"illegal immigration racket\".",
        "url": "https://news.sky.com/story/conor-mcgregor-in-white-house-for-talks-on-irelands-illegal-immigration-racket-13330939",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-conor-mcgregor-donald-trump_6859911.jpg?20250317183553",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-17 14:10:00",
        "Headline": "The 36-year-old appeared in the White House briefing room and complained about immigration during a St. Patrick's Day visit to Washington DC.",
        "Content": " Mixed martial arts fighter Conor McGregor has met Donald Trump in the Oval Office after complaining about Ireland's \"illegal immigration racket\". The 36-year-old told Mr Trump that his work ethic was \"inspiring\", with the two men sharing jovial comments about the fighter's suit and a map featuring the Gulf of Mexico labelled as the Gulf of America. In comments made in the White House briefing room before the meeting during the St. Patrick's Day visit, he said he was visiting the White House to \"raise the issues the people of Ireland face\". \"What is going on in Ireland is a travesty,\" he said. \"Our government is the government of zero action with zero accountability.\" McGregor warned \"Ireland is at the cusp of potentially losing its Irishness\" due to the \"illegal immigration racket\". \"Ireland and America, we are siblings. We consider America our big sibling. So it's important for Ireland to be a peaceful, prosperous country for 40 million Irish Americans to have a place to visit, [to] come back to their home. \"So we wish for our relationship with the United States to continue, and we wish to be taken care of by the big bro. The United States should look after its little bro. And that's how we feel,\" McGregor said. \n                  Conor McGregor: Tesco among shops ditching alcohol linked to MMA star after rape case\n                 \n                  Conor McGregor speaks after losing civil rape case as feminist march held in Dublin\n                 \n                  Woman who accused Conor McGregor of rape wins civil assault case - and is awarded damages\n                 White House press secretary Karoline Leavitt, who appeared alongside McGregor in the briefing room, said: \"We couldn't think of a better guest to have with us on St. Patrick's Day.\" At a meeting with Irish Prime Minister Micheal Martin last week, Mr Trump said McGregor was his favourite Irish person partly because \"he's got the best tattoos I've ever seen\". But Mr Martin and deputy prime minister Simon Harris have been critical of today's Trump-McGregor meeting. In a post on X, Mr Martin said: \"McGregor's remarks are wrong, and do not reflect the spirit of St Patrick's Day, or the views of the people of Ireland.\" Meanwhile, Mr Harris said that McGregor was not in the US to represent Ireland and did not speak for the people of Ireland, and \"has no mandate to\". In exclusive comments made to Sky News' David Blevins about Mr Martin's comments, McGregor said: \"Shame on him for saying that, speaking down on an Irish man.\" He added: \"Every metric available to us has shown that the government of Ireland has failed the people of Ireland.\" Mr Trump is well known for his support of Ultimate Fighting Championship, which McGregor is best known for competing in, and attended bouts during the 2024 presidential campaign. Read more: The deepening ties that led to the controversial Tates flying to freedom in US McGregor is a controversial figure in Ireland after a woman who accused him of raping her won her civil case and was awarded more than £200,000 in damages. Tesco was among the retailers that stopped selling alcohol brands linked to McGregor after Nikita Hand was awarded €248,603 (£206,000) after a jury found McGregor assaulted her in a hotel in 2018. McGregor is appealing against the outcome of the civil case. McGregor also pleaded guilty to assaulting a man in a Dublin pub in 2019 and has been subject to several other allegations of assault and sexual assault. His social media posts were also linked to the 2023 Dublin riots. Irish police were reportedly investigating McGregor's posts for alleged incitement to hatred in relation to the riots. McGregor, nicknamed the Notorious, rose to worldwide prominence for winning several UFC championships."
    },
    {
        "title": "Sky News obtains first accounts of what happened inside Syrian cities shaken by bloody violence",
        "description": "No checkpoint is the same, some want paperwork, others wave you through after a brief look inside - but from Damascus to Latakia, there are a lot of checkpoints, and in one way or another, you are checked every time.",
        "url": "https://news.sky.com/story/sky-news-obtains-first-accounts-of-what-happened-inside-syrian-cities-shaken-by-bloody-violence-13330703",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-alawite-syria_6859250.jpg?20250317052743",
        "type": "World",
        "Author": "Stuart Ramsay",
        "Date Published": "2025-03-17 02:05:00",
        "Headline": "Sky News has been hearing from victims and survivors of revenge attacks in the Latakia region between fighters loyal to the deposed president Bashar al Assad and forces affiliated to Syria's new rulers.",
        "Content": "\n          Chief correspondent\n              @ramsaysky\n  No checkpoint is the same, some want paperwork, others wave you through after a brief look inside - but from Damascus to Latakia, there are a lot of checkpoints, and in one way or another, you are checked every time. It wasn't like this just a month or two ago, but it is now after the most violent few days the country has seen since Bashar al Assad was forced from power in December last year. We drove through cities like Jableh, on Syria's Mediterranean coast, almost unrecognisable now. The bustling streets, markets and shops are silent, apart from the sirens of passing General Security convoys - their armed soldiers packed on the back of pick-up trucks. The debris of battle is everywhere, buildings are burnt out and peppered with bullet holes, glass from smashed shopfront windows spills across the pavement and spent machine gun casings litter the streets. After three months of relatively peaceful times, things have dramatically changed here, all because of the events of 6, 7 and 8 March. A Thursday, Friday, and Saturday that could determine Syria's future. Driving out of Jableh and over a bridge, we pass through another checkpoint, then through a deserted village, home to a community of Syrian Alawites. Shops and homes are destroyed, soldiers guard the roads in and out. We are on our way to the Hmeimim air base, home to the Russian military in Syria. It's also now home to as many as 10,000 Alawites who are now camping in and around the base. They are seeking shelter and protection, watched on by Russian soldiers who remain inside. Some of the thousands are in tents or under makeshift cover, others are sleeping rough or in their cars. I first visited the airbase last December - then it consisted of a small cluster of shops and restaurants, established over years to service the Russian personnel. Now the shops are shuttered and the restaurants cleared of tables to allow the families to sleep. As I approached the gates of the base, I was surrounded by people pushing against each other, trying to get to me to tell me stories of being burnt out of their houses, or of family members killed in front of their eyes. A young woman pulled me aside. \"We need help, international help,\" she whispered. \"We need international peacekeepers; my house was on fire.\" The Alawites are a religious minority in Syria, originating from Shia Islam. The overthrown president Bashar al Assad belonged to the sect. They make up around 10% of Syria's population, which is majority Sunni, and mainly live in the country's coastal regions. During Assad's reign, the Alawites made up a large part of his support base and held top posts in the army and security agencies. Since his fall from power, many Alawites were fired from their jobs and some former soldiers who reconciled with the new authorities were killed. Civilians have now been targeted in revenge killings by Sunni Muslim militants loyal to the new government, who have blamed Assad's loyalists for attacks against the country's new security forces in recent weeks. The Alawites, along with Syria's other minority communities, including Kurds, Christians and Druze, have said they are concerned about revenge attacks and are not convinced by the new government's promise of an inclusive country. In the crowd, I met Adiba Shehaidi. She's sleeping rough outside the base after escaping her village, Ain al Arous. \"They attacked us, just like that, slaughtered us, our friends, our neighbours, our children, our relatives - our in-laws, all of them, were slaughtered. They stormed the houses, shooting…\" she recounted her story of escape. \"What can we say? To the world, what can we say? What was our crime?\" she cried. We were told that whole families had been killed with some buried in mass graves. Not far away from the base, in the village of Al Sanobar - we found one. A mass grave consisting of two trenches, dug under the cover of darkness by villagers. They buried 80 people here. Sticks had been placed in the earth to signal a body buried beneath. We are told a family of 17 are in one of the graves. Further into the village, we came across a group of men digging more graves. They told us they had found the bodies of their families, friends, and neighbours littered on the streets and in houses. So far, they have buried 223 people, all from this one village. On trucks, the bodies wrapped in blankets and plastic were brought to their final resting place near their homes. Under a blistering sun a simple ceremony is held, then side by side they are buried. These families have been devastated - their anguish obvious. Read more:Alawites take refuge from Syrian armyGovernment forces clash with Assad loyalistsSyria vows to investigate mass killings Convoys of government security forces are now constantly patrolling all the areas where the killings took place, and they are trying to encourage the Alawites to return to their villages, saying it is now safe. The head of General Security, Mustafa Kunefate, told me what happened here was unacceptable and must not happen again. He explained how Assad loyalists had attacked and killed soldiers, police officers, and civilians - filming it and posting it on social media. This, he said, led to \"undisciplined groups\" arriving to this part of Syria, acting \"outside of the Ministry of Defence's command\". \"Among these groups were some with a questionable intent, many arrived with no clear instructions, simply coming to break the siege on the Ministry of Defence personnel and police,\" Mr Kunefate told me. \"This resulted in chaos and a breakdown of discipline among the fighting groups that entered the coastal region.\" The scene of some of the worst fighting happened in the city of Jableh when the pro-Assad militia attacked. Much of the centre of town has been badly damaged in the fighting, and it is tense. General Security convoys constantly patrol the city, home to Sunni civilians who were murdered like their Alawite neighbours. Imad Bitar's father Talal died after his car was fired upon by Assad fighters. I met him in their family home where he told me he wants peace but believes it will only happen when Assad's fighters are captured. \"We must find a way to live together, our only demand now is for the remaining factions to leave Syria and for those responsible for the regime's crimes to face a formal trial. It's not about sectarian divisions, it's about justice.\" This has been a difficult time for the new government trying to unite Syria. The massacres of Alawites at the hands of militia puts President Ahmed al Sharaa's unity project in jeopardy. But if there is a positive from that dreadful weekend, it is that the government acknowledges the mistakes and is promising to bring those responsible to justice. The World with Yalda Hakim at 9pm on Sky News will feature a series of special reports on Syria from our chief correspondent Stuart Ramsay and special correspondent Alex Crawford. Watch their latest report inside Al-Hol camp, where thousands of families affiliated to the former Islamic State group are being held by Kurdish forces in northeast Syria."
    },
    {
        "title": "Canada's new Prime Minister Mark Carney meets King Charles and Sir Keir Starmer",
        "description": "Canada's new prime minister Mark Carney has met Sir Keir Starmer in Downing Street this evening, with the UK leader welcoming the relationship between the \"two sovereign allies\". ",
        "url": "https://news.sky.com/story/mark-carney-meets-king-as-he-looks-to-strengthen-eu-alliances-amid-us-rift-13330877",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-mark-carney-king-charles_6859841.jpg?20250317170609",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-17 12:09:00",
        "Headline": "The former Bank of England governor, who was sworn in as Canada's new leader last week, arrived in London from Paris where he met French President Emmanuel Macron.",
        "Content": "Canada's new prime minister Mark Carney has met Sir Keir Starmer in Downing Street this evening, with the UK leader welcoming the relationship between the \"two sovereign allies\".  The former Bank of England governor also met King Charles, who is Canada's head of state, at Buckingham Palace where Mr Carney told the monarch they had \"much to catch up on\". The visit to the UK comes as US President Donald Trump has been threatening Canada's sovereignty by repeatedly suggesting he would make it the 51st US state - something Mr Carney called \"disrespectful\" in a press conference this evening. Mr Carney, who was sworn in on Friday, succeeded Justin Trudeau as Canada's prime minister and leader of the Liberal Party. He had arrived in London from Paris, where he met French President Emmanuel Macron. He said it was important to strengthen ties with \"reliable allies\" in Europe at a critical time for relations between Canada and its bigger neighbour, the US. In the press conference, Mr Carney dismissed a question about allies not vocally supporting Canada as a sovereign nation, saying: \"We don't need another country to validate our sovereignty, we are sovereign.\" Sir Keir said it was \"fantastic\" to have Mr Carney in the UK so early in his tenure and that the relationship between the two countries \"has always been strong\". \"Two sovereign allies with so much in common, shared history, shared values, shared King.\" Earlier, the King was pictured grinning as he shook Mr Carney's hand in the 1844 Room of the royal residence. Footage from the meeting showed the King telling Mr Carney: \"Very good to see you. Congratulations.\" Mr Carney replied as they shook hands: \"Your Majesty. Lovely to see you...Thank you very much.\" He told the King pointing to his own lapel: \"Bit of a disaster today sir. My Order of Canada pin broke.\" Mr Carney added: \"Yes. It fell on the tarmac... which is proof that our founding people is the British,\" prompting a chuckle from the King. The monarch offered his pin before telling his visitor: \"It's a great treat to see you again\", with Mr Carney replying: \"Much to catch up on.\" Royal correspondent \"Very good to see you, congratulations\" were the King's opening remarks to Mark Carney in the 18th century-room at Buckingham Palace.  A very jovial start to the 45 seconds that the palace allowed to be filmed.  Short, yes, but it's actually quite rare that a TV camera is allowed in for the start of an audience - even that says a lot. A sign that it was important for all sides that this meeting was properly seen between Canada's monarch, King Charles as their head of state, and his new prime minister in that realm, at what is a difficult time.  The small talk, with Mark Carney explaining how his Order of Canada pin had broken and the King offering to give him his, was a preamble to no doubt more troubling discussions, with Carney saying there was \"much to catch up on\".  For 30 minutes the two men were then left alone to talk, as is common practice between the monarch and any of his prime ministers. What they talked about, we don't know. Last week, when the King met members of the Canadian Senate, we were told they discussed topics of great concern to all parties, both nationally and internationally.  You would expect that President Trump's remarks about turning Canada into the 51st state, and the ongoing war of words over trade, inevitably would have been on the list of topics for discussion this time. And just maybe how the King may be helpful.  King Charles is one man who hasn't been in Donald Trump's firing line, with the president publicly saying he respects him. During his swearing-in ceremony on Friday, Mr Carney noted the country was built on the bedrock of three peoples: French, British and Indigenous. He also said Canada is fundamentally different from America and will \"never, ever, in any way shape or form, be part of the United States\".  Mr Carney has said he won't sit down with Trump until the US is ready to have a more comprehensive discussion on trade. \"When the US is ready to have that we're ready to sit down,\" he said. He added Canada is not trying to organise a coordinated retaliation response among countries and that there is a limit to what Canada is prepared to do in retaliation given that the US economy is 10 times the size of Canada's. Mr Carney also noted the United States, France, the UK and Canada are members of NATO and it would be \"unthinkable\" for the US to annex Canada through military means. The new prime minister is trying to steer his country through a trade war brought by Mr Trump, who has slapped 25% tariffs on Canadian steel and aluminium and is threatening sweeping tariffs on all Canadian products from 2 April. Canada, which is the biggest foreign supplier of steel and aluminium to the US, last week announced 25% retaliatory tariffs on those metals along with computers, sports equipment and other products worth $20bn in total. Meanwhile, Sir Keir and Mr Carney also spoke about the war in Ukraine. Canada has been taking part in discussions around a coalition of countries which could contribute to a peacekeeping force in Ukraine. Canada took part in a virtual meeting of world leaders hosted by Sir Keir on Saturday, focused on the so-called \"coalition of the willing\", alongside Australia and New Zealand as well as European nations. The Canadian premier told Sir Keir: \"We're at a point in history where the world is being reordered, and your leadership, the leadership of the UK, I'll use the example... of Ukraine, what you've been able to do with President Macron to bring together a coalition of the willing at a crucial time, I think, will be decisive, must be decisive, in coming to a lasting solution there.\""
    },
    {
        "title": "Bulgarian football club Arda Kardzhali apologise after holding minute's silence for former player who is still alive",
        "description": "A Bulgarian football club have apologised for holding a minute's silence for a former player who is still alive.",
        "url": "https://news.sky.com/story/bulgarian-football-club-arda-kardzhali-apologise-after-holding-minutes-silence-for-former-player-who-is-still-alive-13331118",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-football-ball_6860009.jpg?20250317212346",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-17 20:44:00",
        "Headline": "When officials realised their mistake, they said they wished their former player \"many more years of good health\".",
        "Content": "A Bulgarian football club have apologised for holding a minute's silence for a former player who is still alive. Arda Kardzhali, which is located in the southern Bulgarian town of Kardzhali, and play in the country's top division, held the minute's silence in honour of Petko Ganchev before Sunday's game against Levski Sofia. Both teams lined up near the centre circle before kicking off in the 1-1 draw, bowing their heads to mourn Ganchev. But, before the match was over, Arda posted on their Facebook page saying they had received wrong information about Ganchev's death. The club said: \"The management of PFC Arda would like to express a huge apology to the former Arda player Petko Ganchev and his relatives after the club received wrong information about his death. \"We wish Petko Ganchev many more years of good health and to enjoy the success of Arda.\" The post appeared to have been deleted by Monday evening. Read more from Sky News:McGregor meets Donald TrumpKate enjoys a Guinness$50m for man hurt by hot tea The draw means Arda are fifth in the 16-team table and can still secure a place in European football next season. Levski stay second, but are 12 points behind leaders Ludogorets."
    },
    {
        "title": "North Macedonia: Windows smashed in pub belonging to owner of nightclub where fire killed 59 people",
        "description": "Windows of a pub believed to belong to the owner of the nightclub in North Macedonia where 59 people died in a fire on Sunday have been smashed. ",
        "url": "https://news.sky.com/story/north-macedonia-windows-smashed-in-pub-belonging-to-owner-of-nightclub-where-fire-killed-59-people-13331021",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-macedonia-kocani-pulse_6859354.jpg?20250317085941",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-17 16:45:00",
        "Headline": "Another 155 people were injured from burns, smoke inhalation and being trampled in the rush toward the nightclub's single exit. Clubgoers as young as 16 were among the casualties.",
        "Content": "Windows of a pub believed to belong to the owner of the nightclub in North Macedonia where 59 people died in a fire on Sunday have been smashed.  Eggs were thrown and municipality buildings were damaged as anger grew over Sunday's fire in the town of Kocani. Another 155 people were injured from burns, smoke inhalation and being trampled in the panicked rush towards Club Pulse's single exit. Clubgoers as young as 16 were among the casualties, and North Macedonia declared seven days of mourning. Videos showed pyrotechnics on the club's stage hitting the ceiling and igniting as a band played. Authorities are now investigating bribery allegations surrounding the fire in the club, which was crammed with young party-goers and at double its 250-person capacity. State prosecutor Ljupco Kocevski said a preliminary inspection of the club revealed several safety code violations, including a lack of emergency exits, an insufficient number of fire extinguishers and improper access for emergency vehicles. Interior minister Panche Toshkovski added that the club was operating without a proper licence. Bribes to authorities to skip licensing requirements and skirt safety regulations are common in North Macedonia.  Thousands of residents joined silent protests against corruption on Monday. The protesters' anger boiled over, with some toppling a van and smashing windows of a storefront - both allegedly belonging to one of the club owners. Kocani's mayor resigned on Monday over the disaster. North Macedonia's government also ordered a sweeping three-day inspection to be carried out at all nightclubs and cabarets across the country, starting on Monday. The country's president Gordana Davkova Siljanovska said in an address to the nation on Sunday night: \"We are all in shock, and I am shocked myself: as a mother, as a person, as a president.\" Officials said 10 people remain in police custody in Kocani, some 115 kilometres (72 miles) east of the capital, Skopje."
    },
    {
        "title": "British couple detained by Taliban 'moved to maximum security prison' as family raise health fears",
        "description": "A British couple detained by the Taliban have been moved to a maximum security prison in Kabul in what has been described by their children as an alarming update.",
        "url": "https://news.sky.com/story/british-couple-detained-by-taliban-moved-to-maximum-security-prison-as-family-raise-health-fears-13330789",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-peter-reynolds-barbie-reynolds_6837937.jpg?20250223175304",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-17 18:00:00",
        "Headline": "Peter Reynolds, 79, and his wife Barbie, 75, were detained by the Taliban's interior ministry on 1 February.",
        "Content": "A British couple detained by the Taliban have been moved to a maximum security prison in Kabul in what has been described by their children as an alarming update. Peter Reynolds, 79, and his wife Barbie, 75, were detained by the Taliban's interior ministry on 1 February. At the end of last month, the Taliban claimed the arrests happened because of a \"misunderstanding\" that the Reynolds had fake Afghan passports. The day before that, the BBC reported the Taliban as saying they would endeavour to release the couple \"as soon as possible\". But the Reynolds' four adult children have now said they have received news of their parents being split up while detained in a maximum security prison without any charges made against them. Mr Reynolds was said to be in \"urgent\" need of medical care. He has reportedly been taken to an undisclosed location and his wife has been told she can no longer see him. In a statement to Sky News, the family said Mr Reynolds' life was at risk as he was reportedly suffering from a chest infection, a double eye infection and serious digestive issues due to alleged poor nutrition. \"Our parents' detention is cruel and unjust,\" they said. \"Denying Dad urgent medical care violates basic human rights and contradicts the principles of mercy and compassion central to Islam, especially during Ramadan. \"We urge those in power to show goodwill and release them immediately.\" Read more from Sky News:Parts of UK will be hotter than Ibiza this week'Heroic' oil tanker crew praised after North Sea ship crash The couple were married in Kabul in 1970 and have lived in Afghanistan for the last 18 years - remaining after the Taliban toppled the Western-backed government in 2021. The couple run Rebuild, an organisation that provides education and training programmes for businesses, government agencies, educational organisations and nongovernmental groups."
    },
    {
        "title": "'Significant' number of countries to provide troops to Ukraine peacekeeping force",
        "description": "A \"significant number\" of countries will provide troops to a Ukraine peacekeeping force, Sir Keir Starmer's spokesman said.",
        "url": "https://news.sky.com/story/more-than-30-countries-sign-up-to-coalition-of-willing-as-pm-says-significant-force-backing-ukraine-13330899",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-downing-street-world-leaders_6859590.jpg?20250317132520",
        "type": "World",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-17 12:46:00",
        "Headline": "More countries have now joined the \"coalition of the willing\", a group of Western nations who are working to end the war in Ukraine. It was first mooted following a summit hosted by the prime minister earlier this month.",
        "Content": "\n          Political reporter\n              @alixculbertson\n A \"significant number\" of countries will provide troops to a Ukraine peacekeeping force, Sir Keir Starmer's spokesman said. On Saturday, leaders from 26 Western countries - plus two EU leaders and NATO's secretary general - gathered for a virtual call of the \"coalition of the willing\", hosted by Sir Keir after Volodymyr Zelenskyy accepted a 30-day interim ceasefire agreement. Politics latest: Farage welcomes defectors The prime minister said military chiefs would meet this Thursday to discuss the next \"operational phase\" in protecting Ukraine as part of a peacekeeping force - if a deal can be agreed with Russia. Speaking on Monday, Sir Keir's spokesman said they now expect \"more than 30\" countries to be involved in the coalition - but did not reveal which other countries had joined since Saturday. He added: \"The contribution capabilities will vary, but this will be a significant force, with a significant number of countries providing troops and a larger group contributing in other ways.\" The spokesman did not say which countries agreed to be part of a peacekeeping force, which Sir Keir and French leader Emmanuel Macron have confirmed the UK and France will be part of.  Could troops end up fighting? Russia has repeatedly said it would not accept soldiers from NATO countries being stationed in Ukraine. Asked if British troops fired on by Russia in Ukraine would be allowed to fire back, the spokesman said: \"It's worth remembering that Russia didn't ask Ukraine when it deployed troops. \"We've got operational planning meetings that they are going through.\" The spokesman also said he did not know if the US - notably absent from the coalition - will be joining the military chiefs' meeting on Thursday, but said the UK is having \"regular discussions with our American counterparts\". Both the UK and France are pushing for the US to provide security guarantees to prevent Russia from reneging on any peace deal with Ukraine. Read more:Who's in the coalition of the willing?Follow live updates from the Ukraine war  Trump and Putin to hold talks Last week, Russian President Vladimir Putin said he supports the truce brokered by the US in Saudi Arabia, but \"lots of questions\" remain over the proposals. Donald Trump said on Sunday night he will speak to Mr Putin on Tuesday about ending the war and negotiators have already discussed \"dividing up certain assets\", including land and power plants. He said a \"lot of work\" had been done over the weekend on a peace deal. The leaders involved in Saturday's call were from: Australia, Belgium, Bulgaria, Canada, Czech Republic, Denmark, Finland, France, Germany, Greece, Iceland, Italy, Latvia, Lithuania, Luxembourg, Netherlands, New Zealand, Norway, Poland, Portugal, Romania, Spain, Sweden, Turkey, Ukraine, and the UK. NATO Secretary General Mark Rutte, EU Commission President Ursula von der Leyen and EU Council President Antonio Costa also joined."
    },
    {
        "title": "Trump says he will talk to Putin on Tuesday as he pushes for end to Ukraine war",
        "description": "US President Donald Trump has said he will speak to Russian President Vladimir Putin on Tuesday, as he pushes to end the war in Ukraine.",
        "url": "https://news.sky.com/story/trump-says-he-will-talk-to-putin-on-tuesday-as-he-pushes-for-end-to-ukraine-war-13330781",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-air-force-one_6859274.jpg?20250317070119",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-17 09:09:00",
        "Headline": "Donald Trump was speaking to journalists on Air Force One as he made the trip from Florida to Washington.",
        "Content": " US President Donald Trump has said he will speak to Russian President Vladimir Putin on Tuesday, as he pushes to end the war in Ukraine. On Sunday, Mr Trump revealed plans for the upcoming conversation to reporters while flying from Florida to Washington on Air Force One. He said: \"We will see if we have something to announce, maybe by Tuesday. I will be speaking to President Putin on Tuesday. \"A lot of work's been done over the weekend. We want to see if we can bring that war to an end.\" European allies are wary of the US president's affinity for Mr Putin and his hardline stance towards Ukrainian President Volodymyr Zelenskyy, who ended up in a public row with Mr Trump and his vice president JD Vance when he visited the Oval Office last month. Mr Trump said land and power plants are part of the conversation around bringing the war to a close. He described it as \"dividing up certain assets\". 👉 Follow Trump 100 on your podcast app 👈 During his conversation with journalists, the president said he was pushing forward with his plans for import tariffs on 2 April despite recent disruption in the stock market and nervousness about the economic impact. \"April 2 is a liberating day for our country,\" he said. \"We're getting back some of the wealth that very, very foolish presidents gave away because they had no clue what they were doing.\" Read more from Sky News:Zelenskyy says there is a 'good chance' of ending war in UkraineTrump launches strikes over Red Sea ship attacks Mr Trump has occasionally changed course on some tariff plans, but he said he had no intention to do so when it comes to what he describes as \"reciprocal tariffs\". \"They charge us and we charge them,\" he said. \"Then in addition to that, on autos, on steel, on aluminium, we're going to have some additional tariffs.\""
    },
    {
        "title": "'He doesn't speak for Ireland': Irish leaders critical of McGregor-Trump meeting",
        "description": "Mixed martial arts fighter Conor McGregor has met Donald Trump in the Oval Office after complaining about Ireland's \"illegal immigration racket\".",
        "url": "https://news.sky.com/story/conor-mcgregor-in-white-house-for-talks-on-irelands-illegal-immigration-racket-13330939",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-conor-mcgregor-donald-trump_6859911.jpg?20250317183553",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-17 14:10:00",
        "Headline": "The 36-year-old appeared in the White House briefing room and complained about immigration during a St. Patrick's Day visit to Washington DC.",
        "Content": " Mixed martial arts fighter Conor McGregor has met Donald Trump in the Oval Office after complaining about Ireland's \"illegal immigration racket\". The 36-year-old told Mr Trump that his work ethic was \"inspiring\", with the two men sharing jovial comments about the fighter's suit and a map featuring the Gulf of Mexico labelled as the Gulf of America. In comments made in the White House briefing room before the meeting during the St. Patrick's Day visit, he said he was visiting the White House to \"raise the issues the people of Ireland face\". \"What is going on in Ireland is a travesty,\" he said. \"Our government is the government of zero action with zero accountability.\" McGregor warned \"Ireland is at the cusp of potentially losing its Irishness\" due to the \"illegal immigration racket\". \"Ireland and America, we are siblings. We consider America our big sibling. So it's important for Ireland to be a peaceful, prosperous country for 40 million Irish Americans to have a place to visit, [to] come back to their home. \"So we wish for our relationship with the United States to continue, and we wish to be taken care of by the big bro. The United States should look after its little bro. And that's how we feel,\" McGregor said. \n                  Conor McGregor: Tesco among shops ditching alcohol linked to MMA star after rape case\n                 \n                  Conor McGregor speaks after losing civil rape case as feminist march held in Dublin\n                 \n                  Woman who accused Conor McGregor of rape wins civil assault case - and is awarded damages\n                 White House press secretary Karoline Leavitt, who appeared alongside McGregor in the briefing room, said: \"We couldn't think of a better guest to have with us on St. Patrick's Day.\" At a meeting with Irish Prime Minister Micheal Martin last week, Mr Trump said McGregor was his favourite Irish person partly because \"he's got the best tattoos I've ever seen\". But Mr Martin and deputy prime minister Simon Harris have been critical of today's Trump-McGregor meeting. In a post on X, Mr Martin said: \"McGregor's remarks are wrong, and do not reflect the spirit of St Patrick's Day, or the views of the people of Ireland.\" Meanwhile, Mr Harris said that McGregor was not in the US to represent Ireland and did not speak for the people of Ireland, and \"has no mandate to\". In exclusive comments made to Sky News' David Blevins about Mr Martin's comments, McGregor said: \"Shame on him for saying that, speaking down on an Irish man.\" He added: \"Every metric available to us has shown that the government of Ireland has failed the people of Ireland.\" Mr Trump is well known for his support of Ultimate Fighting Championship, which McGregor is best known for competing in, and attended bouts during the 2024 presidential campaign. Read more: The deepening ties that led to the controversial Tates flying to freedom in US McGregor is a controversial figure in Ireland after a woman who accused him of raping her won her civil case and was awarded more than £200,000 in damages. Tesco was among the retailers that stopped selling alcohol brands linked to McGregor after Nikita Hand was awarded €248,603 (£206,000) after a jury found McGregor assaulted her in a hotel in 2018. McGregor is appealing against the outcome of the civil case. McGregor also pleaded guilty to assaulting a man in a Dublin pub in 2019 and has been subject to several other allegations of assault and sexual assault. His social media posts were also linked to the 2023 Dublin riots. Irish police were reportedly investigating McGregor's posts for alleged incitement to hatred in relation to the riots. McGregor, nicknamed the Notorious, rose to worldwide prominence for winning several UFC championships."
    },
    {
        "title": "US Trump administration deports hundreds of Venezuelans despite court order",
        "description": "Hundreds of alleged Venezuelan gang members have been deported by the White House to a supermax prison in El Salvador, even as a US judge blocked the removals.",
        "url": "https://news.sky.com/story/us-trump-administration-deports-hundreds-of-venezuelans-despite-court-order-13330755",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-el-salvador-prison_6859322.jpg?20250317083644",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-17 10:13:00",
        "Headline": "Asked about invoking presidential powers used in times of war, Donald Trump said: \"This is a time of war\".",
        "Content": " Hundreds of alleged Venezuelan gang members have been deported by the White House to a supermax prison in El Salvador, even as a US judge blocked the removals. US District Judge James E Boasberg issued an order on Saturday temporarily blocking the Trump administration deportations, but lawyers told him there were already two planes with immigrants in the air - one headed for El Salvador, the other for Honduras. Mr Boasberg verbally ordered the planes be turned around, but the directive was not included in his written order. White House press secretary Karoline Leavitt said on Sunday: \"The administration did not 'refuse to comply' with a court order. \"The order, which had no lawful basis, was issued after terrorist TdA (Tren de Aragua gang) aliens had already been removed from US territory.\" In a court filing Sunday, the Department of Justice, which has appealed Mr Boasberg's decision, said it would not use the Trump proclamation he blocked for further deportations if his decision is not overturned. President Donald Trump sidestepped a question over whether his administration violated a court order while speaking to reporters aboard Air Force One on Sunday evening. \n                  Ukraine war: 'We've never been closer to a peace deal' - Trump and Putin to hold talks on ending conflict\n                 \n                  Trump says he will talk to Putin on Tuesday as he pushes for end to Ukraine war\n                 \n                  Carney wastes no time tearing into Trump, but can he save Canada from becoming America's 51st state?\n                 But he added: \"I can tell you this. These were bad people.\" Asked about invoking presidential powers used in times of war, Mr Trump said: \"This is a time of war.\" He also described the influx of criminal migrants as \"an invasion\". \"Oopsie...Too late,\" Salvadoran President Nayib Bukele, who agreed to house about 300 immigrants for a year at a cost of $6m in his country's prisons, posted on X above an article about Mr Boasberg's ruling. The immigrants were deported after Mr Trump's declaration of the Alien Enemies Act of 1798, which has been used only three times in US history - during the War of 1812 and the First and Second World Wars. Read more from Sky News:Trump launches strikes over Red Sea ship attacksUS expels South African ambassador Tren de Aragua originated in an infamously lawless prison in the central state of Aragua and accompanied an exodus of millions of Venezuelans, the overwhelming majority of whom were seeking better living conditions after their nation's economy came undone during the past decade. The Trump administration has not identified the immigrants deported, provided any evidence they are in fact members of Tren de Aragua or that they committed any crimes in the US. It also sent two top members of the Salvadoran MS-13 gang to El Salvador who had been arrested in the US. 👉 Follow Trump 100 on your podcast app 👈 Video released by El Salvador's government showed the shackled men - who had their heads shaved - being transported to prison in a large convoy of buses guarded by police and military vehicles and at least one helicopter. The immigrants were taken to the notorious CECOT facility. The bar on deportations stands for up to 14 days and the immigrants will remain in federal custody during that time. Mr Boasberg has scheduled a hearing Friday to hear additional arguments in the case."
    },
    {
        "title": "US rock band Semisonic criticises White House for using their song in video of shackled deportee",
        "description": "US rock band Semisonic has criticised the White House for using their song Closing Time in a social media post that showed a shackled deportee. ",
        "url": "https://news.sky.com/story/us-rock-band-semisonic-criticises-white-house-for-using-their-song-in-video-of-shackled-deportee-13331137",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-deportations-el-salvador_6860053.jpg?20250317225252",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-17 21:54:00",
        "Headline": "The Trump administration shared the video two days after hundreds of alleged Venezuelan gang members were controversially deported by the White House to a supermax prison in El Salvador.",
        "Content": "US rock band Semisonic has criticised the White House for using their song Closing Time in a social media post that showed a shackled deportee.  The Trump administration shared the video on Monday two days after hundreds of alleged Venezuelan gang members were controversially deported by the White House to a supermax prison in El Salvador. The video, which also showed deportees boarding a plane, was captioned with the song's lyrics: \"You don't have to go home but you can't stay here.\" Semisonic said in a statement after the video was shared: \"We did not authorise or condone the White House's use of our song in any way. And no, they didn't ask. The song is about joy and possibilities and hope, and they have missed the point entirely.\" Asked about the video on Monday, White House press secretary Karoline Leavitt said \"our entire government clearly is leaning into the message of this president\". US District Judge James E Boasberg had issued an order temporarily blocking the deportations on Saturday, but lawyers told him there were already two planes with immigrants in the air - one headed for El Salvador, the other for Honduras. Ms Leavitt said on Sunday that the more than 200 people deported were members of the Tren de Aragua (TdA) gang - which originated in an infamously lawless prison in the central Venezuelan state of Aragua. \n                  Big benefits cuts are imminent - here's what to expect and why it could be just the start\n                 \n                  John 'Paddy' Hemingway: Last surviving Battle of Britain pilot dies aged 105\n                 \n                  Kemi Badenoch says UK target to reach net zero by 2050 'impossible'\n                 It came before Jorge Rodriguez, the president of Venezuela's National Assembly, said those who were deported were denied due process. Speaking at a press conference on Monday, Mr Rodriguez said the people deported were not known to have committed any crimes in the United States or El Salvador, and that Venezuela would do everything it can to have them returned home. It also emerged on Monday that the US Justice Department is seeking to remove Mr Boasberg as the judge presiding over the Venezuelan deportation case. The request to remove Mr Boasberg came just before a hearing in his Washington courtroom began on the matteron Monday evening. Band join exclusive club Semisonic join a long list of performers who have objected to Donald Trump using their songs, including Abba, Bruce Springsteen, Rihanna, Phil Collins, Pharrell, John Fogerty, Neil Young, Eddy Grant, Panic! at the Disco, R.E.M., Guns N' Roses, Celine Dion, Beyonce and Adele. Closing Time is from the band's 1998 album Feeling Strangely Fine, which peaked at number 43 on the Billboard 200 album chart. The song hit number four on Billboard's Adult Alternative Airplay chart and earned a Grammy nomination for best rock song."
    },
    {
        "title": "Man injured by hot tea from Starbucks awarded $50m in damages",
        "description": "A delivery driver who needed skin grafts after being burned when a hot tea from Starbucks spilled into his lap has been awarded $50m (&#163;38.6m) in damages.",
        "url": "https://news.sky.com/story/man-injured-by-hot-tea-from-starbucks-awarded-50m-in-damages-13330788",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-california-starbucks_6859414.jpg?20250317103538",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-17 09:19:00",
        "Headline": "Starbucks customer Michael Garcia claimed an employee did not wedge the scalding-hot tea firmly enough into a takeaway tray, leading to him sustaining serious burns.",
        "Content": " A delivery driver who needed skin grafts after being burned when a hot tea from Starbucks spilled into his lap has been awarded $50m (£38.6m) in damages. Michael Garcia suffered third-degree burns to his genitals, groin and inner thighs and has permanent and life-changing disfigurement after collecting the drink at a California drive-through, according to his legal team. His negligence lawsuit blamed the injuries on Starbucks, claiming an employee did not wedge the scalding-hot tea firmly enough into a takeaway tray. Video footage shows Mr Garcia being handed a tray of three drinks at the serving window in Los Angeles and appearing to struggle as he drives his vehicle away. A Los Angeles County jury found in favour of Mr Garcia after he launched legal action over the incident on 8 February 2020. He was working as a Postmates delivery driver at the time, according to Sky's US partner network NBC News. His lawyer Nick Rowley said his client's \"life has been forever changed\". \"This jury verdict is a critical step in holding Starbucks accountable for flagrant disregard for customer safety and failure to accept responsibility,\" he added. Starbucks said it sympathised with Mr Garcia, but plans to lodge an appeal. In a statement, the global coffeehouse chain said: \"We disagree with the jury's decision that we were at fault for this incident and believe the damages awarded to be excessive.\" The firm added it was \"committed to the highest safety standards\" in handling hot drinks. Read more from Sky News:British woman missing in Thailand after boat fireFirst image of Pope Francis since he fell ill US restaurants have faced lawsuits before over customer burns. In one famous 1990s case, a New Mexico jury awarded a woman nearly $3m (£2.3m) in damages for burns she suffered while trying to pry the lid off a cup of coffee at a McDonald's drive-through. A judge later reduced the award and the case was settled for an undisclosed sum under $600,000 (£463,600)."
    },
    {
        "title": "Trump 100, Day 57: Why is Trump acting like a 'mafia boss'?",
        "description": "<a href='https://podfollow.com/trump100/view'>👉 Follow Trump 100 on your podcast app 👈  </a>",
        "url": "https://news.sky.com/story/trump-100-day-57-why-is-trump-acting-like-a-mafia-boss-13330617",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-100-trump-podcast_6818183.jpg?20250228061116",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-17 00:01:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump 100 on your podcast app 👈   On Day 57 of Trump's presidency, US correspondent Mark Stone is joined by Gerard Baker, the Wall Street Journal's editor-at-large. After spending election night together on the Sky News set in November, the two compare notes on Trump's presidency to date and discuss whether Trump is misinterpreting or ignoring his mandate. Gerry shares what he believes Trump has done right, and what he's got \"completely wrong\" at the cost of America. Plus, they bet who will be the first casualty of the administration. If you've got a question you'd like James, Martha, and Mark to answer, you can email it to trump100@sky.uk"
    },
    {
        "title": "Thames Water avoids being taken into government ownership in coming days after unsuccessful court challenge",
        "description": "Thames Water has staved off effective government ownership after an unsuccessful legal challenge to its financial restructuring.",
        "url": "https://news.sky.com/story/thames-water-avoids-being-taken-into-government-ownership-in-coming-days-after-unsuccessful-court-challenge-13330730",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-demonstrators-protest_6818589.jpg?20250203132917",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-03-17 11:17:00",
        "Headline": "The dismissed appeal has been welcomed by Thames Water but met with frustration by public ownership campaigners. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Thames Water has staved off effective government ownership after an unsuccessful legal challenge to its financial restructuring. The Court of Appeal has ruled in favour of a £3bn loan intended to temporarily sort out its finances while the company raises more private investment, dismissing an appeal. The decision backs the High Court judgment of last month and means the UK's biggest water supplier is unlikely to be taken into special administration - a form of government control - in the coming days. Without the loan, Thames Water said it would run out of money on 24 March. The appeal was launched by Lib Dem MP Charlie Maynard and a small group of Thames Water creditors. Those creditors had objected to the loan as they faced being wiped out completely in the financial restructuring while Mr Maynard thought special administration would better serve customer interests. The company is now struggling under a £19bn debt pile. It was unable to secure more investment from existing shareholders over the high fines it faced from regulator Ofwat for rule breaches. \n                  Approval for higher bills and loading more debt begs the question: who is Thames Water serving anymore?\n                 \n                  Thames Water multi-billion pound debt lifeline approved by High Court\n                 \n                  What's happening with Thames Water, why's it in court and could it be nationalised?\n                 Monday's decision was met with dismay from campaigners and welcomed by Thames Water, which supplies about 25% of the UK population. Mixed reaction \"As a vital public utility serving a quarter of the population, the environment secretary should be charting a course to safer waters by putting Thames into special administration and public ownership,\" said Matthew Topham the lead campaigner for We Own It, which campaigns for public ownership of public services. \"Instead, Steve Reed has just flushed nearly £1bn of households' cash down the drain in the form of interest payments and professional fees by supporting this terrible deal to go ahead.\" According to government figures shared with Sky's Sam Coates the cost of nationalising Thames Water could top £11bn over five years, about £2.2bn a year.  Thames Water chief executive Chris Weston said \"We remain focused on putting Thames Water onto a more stable financial foundation as we seek a long-term solution to our financial resilience.\" \"Today's news demonstrates further progress.\" The first half of the £3bn will come through in \"the coming months\", he added. It's received proposals from businesses wanting to invest in the water utility and is now \"conducting a detailed assessment\" of each bid. Creditors providing the loan, so-called A-class creditors, said they \"hope this brings to an end the ongoing legal distractions\"."
    },
    {
        "title": "Tesco awards 5.2% pay rise but axes Sunday bonus",
        "description": "Tesco is to raise store worker pay by 5.2% over the next six months but strip away a 10% premium for working on a Sunday.",
        "url": "https://news.sky.com/story/tesco-awards-52-pay-rise-but-axes-sunday-bonus-13331056",
        "image_url": "https://e3.365dm.com/22/04/1920x1080/skynews-tesco-results_5738226.jpg?20250317194623",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-03-17 18:29:00",
        "Headline": "One of the country's largest employers invests £180m in shop worker pay as it stares down a £250m annual tax hike due to begin from April.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Tesco is to raise store worker pay by 5.2% over the next six months but strip away a 10% premium for working on a Sunday. The UK's biggest retailer said it was to stagger the increase, with the full amount taking effect from the end of August after an initial rise at the end of this month, following talks with the Usdaw union. It marks a £180m investment for Tesco and means its staff will remain comfortably over the new national living wage rate due to take effect on 1 April. Money latest: The 47 'best value' holiday destinations The first rise also coincides with the hike in employer National Insurance contributions announced in last October's budget. It is set to add £250m a year to Tesco's costs. The company employs more than 300,000 people in the UK. It revealed 400 job losses in January as part of efforts to \"simplify\" the business ahead of the tax change.  The new pay deal, while above the rate of inflation, will remove a 10% bonus enjoyed by staff when they work a shift on a Sunday. Tesco, which had already removed the perk for new starters, said those affected by the loss of pay would receive a one-off payment to cover the next 18 months as it phased out the premium. Tesco UK boss Matthew Barnes said: \"Our colleagues are our greatest asset, and this pay deal recognises the brilliant work they put in day-in, day-out to serve our customers. \"It also represents another significant investment in our colleague pay, which combined with our fantastic package of benefits, means Tesco continues to be a place to get on and thrive in a fulfilling and rewarding career.\" Read more from Sky News:Thames Water avoids imminent government ownershipOdey faces £1.8m fine and City ban for 'lack of integrity'Trump tariffs blamed for global growth downgrades Daniel Adams, Usdaw national officer, said of the agreement: \"It is a real achievement that Usdaw reps have been able to secure an above-inflation pay deal that builds on the negotiations of the last few years. \"Not only does it ensure a meaningful gap between the Tesco rates of pay and the national living wage in April, but it also means that in August, the basic rate of pay in Tesco will exceed the real living wage rate outside of London and meet it within the M25.\" From April, the National Living Wage for people aged 21 and over will rise from £11.44 per hour to £12.21 per hour. The National Minimum Wage for those aged 18 to 20 rises from £8.60 to £10.00 per hour."
    },
    {
        "title": "Reeves to hold talks with Revolut and Zilch bosses in latest finance summit",
        "description": "Rachel Reeves will meet leading fintech executives on Tuesday in the Treasury's latest effort to generate economic growth ideas from the private sector ahead of her spring statement.",
        "url": "https://news.sky.com/story/reeves-to-hold-talks-with-revolut-and-zilch-bosses-in-latest-finance-summit-13330972",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rachel-reeves-downing-street_6859362.jpg?20250317092502",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-17 15:08:00",
        "Headline": "The chancellor's latest private sector talks will also involve executives from Stripe and Wise as she seeks fresh ideas for boosting Britain's economy, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Rachel Reeves will meet leading fintech executives on Tuesday in the Treasury's latest effort to generate economic growth ideas from the private sector ahead of her spring statement. Sky News has learnt that bosses from Revolut, Stripe, Wise and Zilch will be among those attending the latest in a blizzard of roundtable events hosted by the chancellor. The summit at 11 Downing Street will come a day after Ms Reeves summoned regulators for fresh talks on abolishing red tape in a bid to drive growth. Money latest: The 47 'best value' holiday destinations Sources said the fintech executives had been asked to come \"armed with ideas about how to improve UK competitiveness\" with the economy having unexpectedly contracted in January. Tuesday's meeting will also be attended by Emma Reynolds, the economic secretary to the Treasury. The agenda will include discussing major growth opportunities for fintechs during the next decade, as well as challenges facing the sector. It will follow similar meetings with executives from retail and investment banks, as well as asset managers, as officials prepare the inaugural financial services growth and competitiveness strategy. That document is expected to be published in the coming months. Read more from Sky News:Thames Water avoids imminent government ownershipOdey faces £1.8m fine and City ban for 'lack of integrity'Trump tariffs blamed for global growth downgrades \"Growth is the number one mission in our Plan for Change in order to put more money into people's pockets,\" a Treasury source said on Monday. \"Fintech is the future of financial services, with huge potential to help people and businesses across the UK, and we will work hand-in-hand with the sector to drive its growth through the upcoming Financial Services Growth and Competitiveness Strategy.\""
    },
    {
        "title": "UK and global economic growth forecasts cut - as Trump tariffs blamed",
        "description": "Global economic growth has been downgraded by the Organisation for Economic Co-operation and Development (OECD) - as the impact of US President Donald Trump's tariffs becomes apparent.",
        "url": "https://news.sky.com/story/tariffs-to-blame-for-slowed-global-economic-growth-oecd-says-13330768",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-steel-tariff_6854127.jpg?20250312132256",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-03-17 08:23:00",
        "Headline": "There is more bad news for Britain's chancellor Rachel Reeves with the OECD forecasting major economies including the UK will have lower rates of GDP. Consumers will face \"much of the burden\" of higher tariffs, it says.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Global economic growth has been downgraded by the Organisation for Economic Co-operation and Development (OECD) - as the impact of US President Donald Trump's tariffs becomes apparent. Major economies including the UK will have lower rates of GDP - a measure of an economy's value and everything produced - due to the US's imposition of taxes on some goods it imports, the Paris-based OECD club of 38 rich countries said. The UK economy will grow only 1.4% this year, as opposed to the 1.7% previously anticipated. Next year, the figure will be 1.2%, lower than the 1.3% forecast before Mr Trump took office in January, according to the OECD interim economic outlook. Money blog: West End performer on what it's really like It's more unwelcome news for Chancellor Rachel Reeves after January GDP unexpectedly shrank. The government has repeatedly said growing the economy is its number one priority. In response to the OECD figures, Ms Reeves pointed out the UK is forecast to be \"Europe's fastest growing G7 economy over the coming years - second only to the US\". \"This report shows the world is changing, and increased global headwinds such as trade uncertainty are being felt across the board,\" said the chancellor.  Global GDP will slow, the OECD said, from 3.2% in 2024 to 3.1% in 2025 and 3% in 2026 due to the higher trade barriers caused by the tariffs and the policy uncertainty around their implementation. US growth has been revised downward to 2.2% in 2025 and 1.6% in 2026. Higher GDP of 2.4% and 3.1% had been expected for this year and next. While the Eurozone has not escaped the downgrades it is less impacted than first thought, the report said. \"European economies will experience fewer direct economic effects from the tariff measures incorporated in the baseline projections, but heightened geopolitical and policy uncertainty is still likely to restrain growth,\" it said. What's happening with tariffs? After some false starts, where levies were announced and paused last minute or not brought into effect at all, tariffs are now in effect on some goods coming from China. A 25% tariff on all steel and aluminium imports to the US came into effect earlier this month. Tariffs on Canada and Mexico were suspended until 2 April. The full effect of tariffs has also yet to be felt as EU retaliatory taxes on US goods are yet to take effect. In response, Mr Trump said he would impose a 200% tariff on EU alcohol - including wine and champagne. Read more:What are Donald Trump's tariffs - and how will they affect the UK? Consumers to be hit It's consumers who will pay the price for the additional taxes, the OECD said. \"Consumers face much of the burden of higher tariffs,\" it said, as it warned of a \"significant\" impact on living standards."
    },
    {
        "title": "Hedge fund manager Crispin Odey faces City ban and £1.8m fine for 'lack of integrity'",
        "description": "The hedge fund manager Crispin Odey is facing a &#163;1.8m fine and a ban from the financial services industry in the UK following a ruling by the City regulator.",
        "url": "https://news.sky.com/story/odey-faces-city-ban-and-16318m-fine-for-lack-of-integrity-13330875",
        "image_url": "https://e3.365dm.com/23/06/1920x1080/skynews-crispin-odey_6181848.jpg?20230608160405",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-03-17 12:05:00",
        "Headline": "The FCA ruling is provisional; as Mr Odey is due to challenge the FCA's findings at an Upper Tribunal hearing.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The hedge fund manager Crispin Odey is facing a £1.8m fine and a ban from the financial services industry in the UK following a ruling by the City regulator. The Financial Conduct Authority's (FCA) provisional decision followed an investigation into the 66-year old founder of now-defunct Odey Asset Management (OAM) amid newspaper allegations of historical workplace sexual misconduct. He strenuously denied the claims reported by the Financial Times (FT) in 2023, some of which extended to sexual assault. Money latest: The 47 'best value' holiday destinations OAM, which shot to public prominence after making more than £200m from bets against the UK economy over the Brexit vote of 2016, was broken up after a client flight and string of asset sales followed the emergence of the allegations. The company is now in the process of being wound down. The FCA said on Monday that the fine and proposed ban were provisional as Mr Odey planned to appeal the findings at the Upper Tribunal. \n                  Thames Water avoids being taken into government ownership in coming days after unsuccessful court challenge\n                 \n                  Tesco awards 5.2% pay rise but axes Sunday bonus\n                 \n                  Reeves to hold talks with Revolut and Zilch bosses in latest finance summit\n                 The watchdog said the penalties it sought to impose against Mr Odey reflected its finding of a \"lack of integrity\", mainly through repeated attempts \"to evade and obstruct efforts to hold him to account\". Its inquiry found that OAM could not deal effectively with complaints of inappropriate conduct towards female members of staff because he continually threatened and intervened in the process. \"The FCA considers that Mr Odey deliberately sought to frustrate OAM's disciplinary processes into his conduct to protect his own interests,\" the regulator's statement said. \"Mr Odey showed reckless disregard for OAM's governance, causing OAM to breach certain regulatory requirements. \"In addition, the FCA considers that Mr Odey's behaviour towards both OAM and the FCA lacked candour. Read more from Sky News:Thames Water avoids imminent government ownershipTrump tariffs blamed for global growth downgrades \"The FCA considers Mr Odey's conduct demonstrated that he is not a fit and proper person to perform any function related to regulated activities,\" its ruling concluded. Mr Odey, who is seeking £79m in damages through a libel action against the FT, has insisted he is the victim of a witch hunt. He was yet to comment on the FCA's provisional ruling."
    },
    {
        "title": "'A starting salary? There's no such thing': What it's really like being a West End performer",
        "description": "Each Monday, our Money team speaks to someone from a different profession to discover what it's really like. This week, we chat to Aaron Archer from Joseph And The Amazing Technicolor Dreamcoat and Mamma Mia! about life as a West End performer... ",
        "url": "https://news.sky.com/story/a-starting-salary-theres-no-such-thing-what-its-really-like-being-a-west-end-performer-13330823",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-aaron-archer-west-end_6859290.jpg?20250317072707",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-03-17 10:39:00",
        "Headline": "Dreaming of a career change? West End performer Aaron Archer talks about the best and worst parts of his job in this feature from the Money blog team that lifts the lid on what different professions are really like.",
        "Content": "Each Monday, our Money team speaks to someone from a different profession to discover what it's really like. This week, we chat to Aaron Archer from Joseph And The Amazing Technicolor Dreamcoat and Mamma Mia! about life as a West End performer...  There's no such thing as a starting salary in the performing arts... A job may be an equity contract with a union that sets out minimum salaries depending on the size of the theatre or the amount of work and many other varying factors. Or it could be a privately/commercially financed job, meaning the salary can vary hugely. All equity minimum figures can be found online but it can range between £600-900 roughly a week for an ensemble member in a West End show. Again, this figure can vary below or above this. The principals will earn a higher salary as well as people who cover other roles or have extra responsibilities such as being the dance captain. You don't necessarily have a stable income to rely on... Contracts can differ in length from just a few days to a year or more. Read all the latest Money news here Many performers have another job on the side... to supplement their income, as sometimes you can't solely rely on the earnings from performing. People might look down at a cruise ship contract... but these performers are extremely talented and earning money doing the job they love just the same as somebody in a show in the West End, with the cruise ship job paying more than a West End contract sometimes. A usual week consists of eight shows... but over busy periods extra shows can be added. With most shows being around two and half hours, as well as any additional rehearsals, we are working between 35-40 hours a week with one day off. \n                  Thames Water avoids being taken into government ownership in coming days after unsuccessful court challenge\n                 \n                  Tesco awards 5.2% pay rise but axes Sunday bonus\n                 \n                  Reeves to hold talks with Revolut and Zilch bosses in latest finance summit\n                 It's very hard to plan ahead... You never know what you're going to be doing or where you are going to be from one year to the next. I went from working on a cruise as a dancer travelling the world, to then the next year making my West End debut in Mamma Mia. The most important skill to do this job well is... to just be a nice person. Obviously your talent and hard work and dedication will be a huge factor in getting jobs but if you are a nice, friendly person then that will make you 10x more employable. My favourite part of my job is... knowing that six-year-old me would have never imagined I'd be doing this as my career and getting to meet so many amazing people. You meet amazing people at the stage door... who want to meet the cast members and sometimes get a picture or signature after the show. But stage door isn't compulsory and sometimes you do just want to get home to rest and you can be made to feel guilty if people are unhappy that they didn't get the chance to see you afterwards. Read more from this series:What it's really like to be a... bodyguardWhat it's really like to be a... zookeeperWhat it's really like to be a... driving instructor My mind has gone blank for split seconds... and there have been multiple occasions where in a scene carrying bagpipes the pipes have fallen off or broken on stage. I've just had to carry on while holding a snapped pipe in my hand, somehow managing to keep a straight face. Rejection is a regular thing to deal with... It's normal to get emotionally attached to opportunities that you have put so much time and effort into, after rounds and rounds of auditions for a job and waiting weeks to hear if you've booked the job or not. It is emotionally draining. For one role I had to fake tan twice a week... and another I had to wear a wetsuit and flippers on stage while dancing. Dealing with burnout from a very physically and mentally demanding schedule... can make it harder to have other commitments outside of work and seeing friends and family. Theatre is good value for money when you look at... how much work goes into what the audience members are seeing on the stage. The sheer volume of people that it takes to put on a show, from the production team to the backstage team, cast, creatives, wardrobe, wigs, makeup, sound, theatre front of house staff and many other teams of people that make it possible. I do think that some ticket prices for some shows have become not as easily accessible, but apps like TodayTiks are great for finding affordable tickets for various shows."
    },
    {
        "title": "Man injured by hot tea from Starbucks awarded $50m in damages",
        "description": "A delivery driver who needed skin grafts after being burned when a hot tea from Starbucks spilled into his lap has been awarded $50m (&#163;38.6m) in damages.",
        "url": "https://news.sky.com/story/man-injured-by-hot-tea-from-starbucks-awarded-50m-in-damages-13330788",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-california-starbucks_6859414.jpg?20250317103538",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-03-17 09:19:00",
        "Headline": "Starbucks customer Michael Garcia claimed an employee did not wedge the scalding-hot tea firmly enough into a takeaway tray, leading to him sustaining serious burns.",
        "Content": " A delivery driver who needed skin grafts after being burned when a hot tea from Starbucks spilled into his lap has been awarded $50m (£38.6m) in damages. Michael Garcia suffered third-degree burns to his genitals, groin and inner thighs and has permanent and life-changing disfigurement after collecting the drink at a California drive-through, according to his legal team. His negligence lawsuit blamed the injuries on Starbucks, claiming an employee did not wedge the scalding-hot tea firmly enough into a takeaway tray. Video footage shows Mr Garcia being handed a tray of three drinks at the serving window in Los Angeles and appearing to struggle as he drives his vehicle away. A Los Angeles County jury found in favour of Mr Garcia after he launched legal action over the incident on 8 February 2020. He was working as a Postmates delivery driver at the time, according to Sky's US partner network NBC News. His lawyer Nick Rowley said his client's \"life has been forever changed\". \"This jury verdict is a critical step in holding Starbucks accountable for flagrant disregard for customer safety and failure to accept responsibility,\" he added. Starbucks said it sympathised with Mr Garcia, but plans to lodge an appeal. In a statement, the global coffeehouse chain said: \"We disagree with the jury's decision that we were at fault for this incident and believe the damages awarded to be excessive.\" The firm added it was \"committed to the highest safety standards\" in handling hot drinks. Read more from Sky News:British woman missing in Thailand after boat fireFirst image of Pope Francis since he fell ill US restaurants have faced lawsuits before over customer burns. In one famous 1990s case, a New Mexico jury awarded a woman nearly $3m (£2.3m) in damages for burns she suffered while trying to pry the lid off a cup of coffee at a McDonald's drive-through. A judge later reduced the award and the case was settled for an undisclosed sum under $600,000 (£463,600)."
    },
    {
        "title": "Kemi Badenoch says UK target to reach net zero by 2050 'impossible'",
        "description": "Tory leader Kemi Badenoch has dismayed green Conservatives by declaring the UK's target to reach net zero by 2050 \"impossible\".",
        "url": "https://news.sky.com/story/kemi-badenoch-says-uk-target-to-reach-net-zero-by-2050-impossible-13331102",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-kemi-badenoch-conservative_6860006.jpg?20250317222212",
        "type": "Politics",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-03-17 20:02:00",
        "Headline": "The Conservative leader's remarks are criticised by a Tory environmental group which says she has made a mistake.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Tory leader Kemi Badenoch has dismayed green Conservatives by declaring the UK's target to reach net zero by 2050 \"impossible\". In a speech on Tuesday, the Conservative Party leader is expected to tell what she says is the \"unvarnished truth\" that the net zero goal cannot be achieved without \"a serious drop in our living standards or by bankrupting us\". Ms Badenoch will say she is not making a \"moral judgement\" on net zero or debating whether climate change exists. But, as she begins to renew party policy, she will say that current climate policies are \"largely failing\" to improve nature and \"driving up the cost of energy\". Politics latest: Follow live updates Net zero means cutting emissions of greenhouse gases, which cause climate change, to virtually zero, and absorbing the rest elsewhere. Scientists say the world must reach that point by 2050 to avoid even worse flooding, wildfires, and other damage - but that action is lagging behind. The UK has already cut its greenhouse gas emissions in half. The next half is expected to be more challenging as it requires changes to people's heating, cars and diet - things that often need upfront costs, but could save people money in the long run with the right government support, advisers have said. Ms Badenoch's plans take the Conservative Party to its most sceptical position on net zero yet - a target set in law by Tory Prime Minister Theresa May in 2019. And it comes at a time when Reform UK is questioning climate science and US President Donald Trump, leader of the second most polluting country in the world, is dismantling nature protections.  Ms Badenoch's \"policy renewal\" she is outlining on Tuesday will see shadow cabinet members set core priority questions as a move towards formulating new policy for the party. Sam Hall, of the Conservative Environment Network of 50 MPs, said it was \"a mistake\" for Ms Badenoch to have \"jumped the gun on her own policy review and decided net zero isn't possible by 2050\". He said the Tory leader was right to question Labour's climate plans, but that the target is driven \"not by optimism but by scientific reality; without it climate change impacts and costs will continue to worsen\". Abandoning the science would risk losing voter's support, he added. Climate reporter The UK public has long been supportive of government climate action – that's true across voters of different parties too. Labour capitalised on this in last year's general election and swooped to victory with a green mandate.\n\n Rishi Sunak's attempts to roll back some climate policies flopped, and polling by More In Common found Labour's arguments that clean power and climate action are the best way to tackle the cost of living cut through with people. For now, at least. The tide of climate scepticism has been rising since Sunak's days, with Reform UK questioning climate science altogether and Kemi Badenoch now calling the 2050 target \"impossible\" – though she did stress she doesn't want to dismantle it and that she does believe in climate change. And she's not wrong that it is going to be hard. Given the strong public support for climate action, it's not surprising Sunak's attempt to politicise the issue didn't work out for him.\n\n But now others following in his footsteps have been emboldened by US President Donald Trump. Their attacks are gathering speed - and they might start to take root.\n\n\n\n This may be an inflection point for goodwill towards climate action in the Conservative Party – which has a long legacy of supporting it – and more broadly in the UK. Labour cannot take public support for its net zero plans for granted at a time when political consensus on it is fracturing.\n\n And given the next stage of the country's climate action is about to get more disruptive for people, it is just when it needs this public support more than ever.\n\n Four in five Conservative voters in last year's general election and two thirds of Reform voters thought it was important that the government cared about tackling climate change, according to polling by More in Common. Shaun Spiers, executive director of thinktank Green Alliance, called it \"disappointing\" to see Ms Badenoch \"turn her back on cleaner, cheaper, homegrown energy\". \"It is even more disappointing to see the leader of the opposition take cues from climate deniers across the pond,\" he added, in a veiled swipe at President Trump. \"Net zero is not 'nice-to-have', it's an achievable, evidence-based target designed to protect the UK from the worst impacts of climate change.\" The UK's Climate Change Committee (CCC), which advises governments on how to reach net zero, said last month the goal is \"ambitious\" but \"deliverable\". But it also warned as Labour took office last summer that, at that time, just one third of the cuts to greenhouse gases needed to reach an interim 2030 target were covered by a \"credible plan\"."
    },
    {
        "title": "Big benefits cuts are imminent - here's what to expect and why it could be just the start",
        "description": "Those with \"milder mental health\" issues and \"lower-level physical conditions\" could see their disability benefits cut, as the government looks to shave &#163;6bn off the welfare bill.",
        "url": "https://news.sky.com/story/these-are-the-big-benefits-changes-you-should-expect-and-why-they-could-be-just-the-start-13331073",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-beth-rigby-rachel-reeves_6859956.jpg?20250317193442",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-03-17 19:06:00",
        "Headline": "With little more than a week to go until Rachel Reeves delivers the spring statement, the Treasury is looking for ways to plug a hole in the public finances. The welfare system is set for billions of pounds in cuts - but some in government think the changes don't go far enough.",
        "Content": "\n          Political editor\n              @BethRigby\n  Those with \"milder mental health\" issues and \"lower-level physical conditions\" could see their disability benefits cut, as the government looks to shave £6bn off the welfare bill. Liz Kendall, the work and pensions secretary, is expected to target sickness and disability benefit payments for savings on Tuesday, which comes ahead of the spring statement next Wednesday. Politics latest: Welfare reforms 'imminent' Her welfare reform green paper will arrive after Downing Street insisted there is a \"moral and an economic case for fixing our broken system\". Government figures argue the rising sickness and disability bill, which has ballooned since the pandemic, is unsustainable and will \"leave the welfare state losing legitimacy\" in the eyes of the wider public if not dealt with. The cuts come as the chancellor eyes a hole in the public finances on the back of lower than expected growth and rising borrowing costs, with the £9.9bn headroom she had at the budget in October now wiped out. Rachel Reeves' self-imposed fiscal rules mean day-to-day government spending must be covered by tax revenue by 2029-30, which leaves her needing billions of pounds in spending cuts (after ruling out further tax rises, her other option).  What changes should we expect? Ms Kendall is expected to target personal independence payments (PIP) - one of the main forms of disability benefits for those with long-term illnesses or disabilities - amid a spike in claimants. The PIP bill has grown from £13.7bn a year before the pandemic to £21.8bn in the current financial year, and is set to increase to £34.1bn by the end of the decade. The number of people claiming this disability benefit is projected to more than double from two million to 4.3 million. The work and pensions secretary will tell MPs that Labour will protect those who have a serious condition and can't work, and the government's rowed back from plans to freeze PIP payments after backlash from its backbench MPs. These payments are now expected to rise in line with inflation, but the eligibility criteria will be tightened to whittle back the number of people eligible to claim. One government figure told me it would result in some conditions, such as \"milder mental health\" or \"lower-level physical conditions\", being ineligible for PIP. But they stressed that those with more severe conditions and who are never going to be able to work would be protected and cared for. Read more:Which benefits could be cut?Why Labour MPs are so uncomfortable  The key principles driving reforms The changes are likely to draw criticism from some MPs, though one senior Labour source said they didn't think there would be any ministerial resignations over the benefit announcements. Another Labour figure told me they would be \"massively shocked\" if there were resignations. However, a number of Labour MPs have voiced their concerns, as has the Manchester mayor Andy Burnham. In a bid to assuage MPs, the work and pensions secretary is also expected to earmark £1bn of savings into employment support programmes as she frames the reforms around three clear principles. 👉 Tap here to listen to Electoral Dysfunction on your podcast app 👈 The first will be to prevent people from falling into long-term economic inactivity with a better support offer to get people back into work quickly. The second will be to change the incentive systems to move people away from welfare dependency. This could see Ms Kendall slash the highest level of incapacity benefit for working age people who have an illness or disability that limits their ability to work, while increasing the basic rate of support for those out of work (universal credit). This is because the lower level of unemployment benefit has led to more people claiming for additional incapacity and disability benefits, while disincentivising them to try to find work. The government will also announce a \"right to try\" scheme, allowing those on incapacity benefits to try returning to work without the risk of losing their benefits, as happens in the current system.  'I don't think they go far enough' But with one in 10 working age people claiming sickness benefits, and one in eight young people not in education, employment or training, the reforms on Tuesday could be just the start of bigger changes - and potentially bigger political battles. The cost of long-term sickness and disability benefits for working-age people has risen by about £20bn since the pandemic to about £48bn, and is forecast to hit almost £100bn by 2030. \"People are trapped on benefits and the bill is getting out of hand,\" said one government figure. \"We are currently spending more than three times the annual policing bill on these benefits. It's getting out of hand. \"I don't think the reforms go far enough, and I don't think people have clocked the size of the numbers going on here.\""
    },
    {
        "title": "Israel breaking international law over Gaza aid blockade, UK government says for first time",
        "description": "Israel is breaking international law by stopping aid into Gaza, the UK government has said for the first time.",
        "url": "https://news.sky.com/story/israel-breaking-international-law-over-gaza-aid-blockade-uk-government-says-for-first-time-13331023",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-gaza-food_6859287.jpg?20250317071933",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-03-17 17:07:00",
        "Headline": "The foreign secretary describes Israel's decision to stop all goods from entering the strip as \"unacceptable, hugely alarming and very worrying\" - in a significant strengthening of the UK's language.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  Israel is breaking international law by stopping aid into Gaza, the UK government has said for the first time. Foreign Secretary David Lammy said that while Israel \"quite rightly must defend its own security\", the ongoing blockade of goods and supplies to the strip was a \"breach of international law\". Appearing in the Commons, Mr Lammy was repeatedly asked about Israel's decision at the beginning of the month, which came about following disagreements with Hamas over ceasefire terms set out in January following 15 months of war sparked by the 7 October attack against Israel. Badenoch heckled at speech - politics latest updates Asked by Labour MP Rupa Huq what the \"consequences\" would be for Israel's \"provocative action\" during the holy month of Ramadan, the foreign secretary said for the first time that Israel was in breach of international law. \"Well, my honourable friend is right,\" he said. \"This is a breach of international law. \"Israel quite rightly must defend its own security but we find the lack of aid - it's now been 15 days since aid got into Gaza - unacceptable, hugely alarming and very worrying. \n                  Lammy and European foreign ministers back Egyptian plan for Gaza rebuild\n                 \n                  David Lammy promises £55m in support for Ukraine on visit to war-torn country\n                 \n                  Foreign secretary says people should 'follow the rules' in other countries after 18-year-old constituent jailed in Dubai\n                 \"We would urge Israel to get back to the amount of trucks that we were seeing going in, way beyond 600, so that Palestinians can get the necessary humanitarian support they need at this time.\" Israeli Prime Minister Benjamin Netanyahu made the decision to stop aid going into Gaza after Hamas rejected an Israeli request to extend the first phase of the Gaza ceasefire. The militant group said it would only release the remaining Israeli hostages under the terms of the already agreed-upon phased deal, and not as per the plan put forward by US Middle East envoy Steve Witkoff, which would see the first phase of the ceasefire deal continue through Ramadan and Passover, or until 20 April. The war between Israel and Hamas has left most of Gaza's population of over 2 million dependent on international aid. Approximately 600 aid trucks had been entering the strip every day since the ceasefire began in January. Israel claims that Hamas hijacks the trucks and \"turns aid into weapons\". The Israel foreign ministry has claimed there is \"no shortage of essential products in the strip whatsoever\". \"The only humanitarian suffering in Gaza is that of the Israeli hostages, who are being chained, starved, and held in Hamas tunnels.\" The UK government has previously stopped short of accusing Israel of breaking international law, saying only in a joint statement with French and German foreign ministers at the beginning of the month that the most recent aid blockade \"would risk violating international humanitarian law\". \"Humanitarian aid should never be contingent on a ceasefire or used as a political tool,\" they added. \"We reiterate that the civilians of Gaza who have suffered so much must be allowed to return to their homes and rebuild their lives.\" Last September the UK suspended arms sales to Israel on the grounds that, following a review of export licences for UK arms, there was a \"clear risk\" they might be used to commit \"a serious violation of international humanitarian law\". The suspension covered components that go into military aircraft that have been used in Gaza, including helicopters and drones, as well as items which facilitate ground targeting. But it did not include parts for multinational F-35 fighter jets - something that has concerned opposition MPs and human rights charities. Read more:Inside Syrian cities shaken by bloody violenceIsrael accused of 'genocidal acts' against Palestinians The move prompted a critical response from Mr Netanyahu, who said it was \"shameful\" and \"will not change Israel's determination to defeat Hamas, a genocidal terrorist organization that savagely murdered 1200 people on October 7, including 14 British citizens\". The war in Gaza began after Hamas militants carried out a cross-border raid into southern Israel on 7 October 2023, killing 1,200 people and capturing around 250 hostages, according to Israeli officials. Israel responded by launching an air and ground offensive in Gaza which has killed more than 48,000 Palestinians, say Gaza health officials. The Gaza health ministry does not distinguish between civilians and combatants in its count but said more than half of the fatalities were women and children."
    },
    {
        "title": "'Big test' for PM as ex-Labour MP Mike Amesbury steps down to trigger by-election",
        "description": "Mike Amesbury has officially stepped down as an MP after he was convicted of punching a man in the street.",
        "url": "https://news.sky.com/story/mike-amesbury-officially-steps-down-as-mp-after-being-convicted-of-punching-constituent-13330728",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-mike-amesbury-mp-cheshire_6841483.jpg?20250227152511",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-17 06:43:00",
        "Headline": "A by-election will be triggered in the seat of Runcorn and Helsby, in what Sky News' political correspondent Liz Bates said would be a \"big test\" for Sir Keir Starmer given the threat from Nigel Farage's Reform UK.",
        "Content": " Mike Amesbury has officially stepped down as an MP after he was convicted of punching a man in the street. Amesbury, who was suspended from the Labour Party, was jailed on 24 February. Politics latest: Welfare reforms 'imminent' He was sentenced to 10 weeks behind bars after he pleaded guilty to the assault by beating of 45-year-old Paul Fellows in Frodsham, Cheshire, in the early hours of 26 October. Following an appeal, his sentence was suspended for two years - so he does not have to serve it in prison. He announced his resignation as MP for Runcorn and Helsby in a social media post on Monday, describing the assault as a \"deeply regrettable incident\" for which he had \"rightly been punished\". \"I am sincerely sorry to Paul Fellows, my family, colleagues and constituents,\" he added. A by-election will now be triggered in Runcorn and Helsby, where constituents will vote to elect a new MP. By-election a 'big test' for PM It will be the first by-election since Sir Keir Starmer became prime minister, in what Sky News' political correspondent Liz Bates said would be a \"big test\" in a seat where Reform UK came second last year. \"Losing it would be an unmitigated disaster given the 14,000 majority achieved last time round,\" said Bates. Amesbury came first in Runcorn and Helsby with 22,358 votes at the 2024 general election - equating to 52.9% of the electorate. Reform UK came in second with 7,662 votes (18.1%) and the Tories in third with 6,756 votes (16%). Reform has yet to announce a candidate, but Karen Shore, the deputy leader of Cheshire West and Chester Council, will run for Labour. The Conservatives have opted for Sean Houlston, a membership services manager for the National Federation of Builders. Read more:How is a by-election triggered?Why Labour MPs are deeply uncomfortable When will the by-election be? Under parliamentary procedure, an MP cannot simply resign but must be disqualified from holding their seat. To do this, they must apply for a role in the paid office of the Crown, meaning they automatically lose their seat because working for the Crown is not seen as impartial. Titles include the crown steward and bailiff of the Chiltern Hundreds and the Crown Steward and Bailiff of the Manor of Northstead. Rachel Reeves has now appointed Amesbury to be steward and bailiff of the Three Hundreds of Chiltern, meaning the parliamentary seat is officially vacant. Once he does, the chief whip will put forward a motion to Lindsay Hoyle, the Commons speaker, to officially begin the process of disqualifying the MP - known as \"moving the writ\". The Speaker then puts the motion to MPs for a vote. If they agree, the writ passes through the Commons and ends up with the returning officer in the local constituency who oversees the by-election. The writ is typically issued within three months of the MP resigning from their seat and in doing so, the date of the by-election is fixed. It could potentially coincide with the local elections in May."
    },
    {
        "title": "Welfare system will be here 'for years to come' amid backlash over impending cuts",
        "description": "The welfare state will be there for those who need it \"now and for years to come\", the work and pensions secretary has said - as the government faces pressure from its own MPs over benefit changes.",
        "url": "https://news.sky.com/story/disability-benefits-freeze-will-not-go-ahead-after-labour-mp-backlash-13330803",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-welfare-benefits-health-disability_6859245.jpg?20250317023130",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-17 11:18:00",
        "Headline": "The government has made cutting the soaring welfare budget a key project, but it's sparked significant concerns among Labour MPs. Full details of the plans will be revealed on Tuesday - you can watch and follow live on Sky News.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  The welfare state will be there for those who need it \"now and for years to come\", the work and pensions secretary has said - as the government faces pressure from its own MPs over benefit changes. Liz Kendall acknowledged there has been \"lots of speculation\" about the government's plans to reform welfare, which are due to be announced on Tuesday following a delay because of concerns from Labour backbenchers. Politics latest: Welfare reforms 'imminent' Speaking in the House of Commons, Ms Kendall said she wanted to assure the public the announcements will \"ensure there is trust and fairness in the social security system\" - and that it will remain in place for those who need it. Earlier on Monday, Sky News revealed the government has chosen not to freeze the personal independence payment (PIP) next year following pressure from Labour MPs over the past week. Ministers had wanted to stop PIP (a payment of up to £9,000 a year for people with long-term physical and mental health conditions, and disabilities) rising with inflation as part of a drive to cut the welfare budget. The proposal had been set to save about £5bn, as Chancellor Rachel Reeves searches for savings. She has lost £9.9bn of fiscal headroom (the amount she could increase spending or cut taxes without breaking her fiscal rules) since the October budget due to a poor economy and geopolitical events. Read more:Which benefits could be cut?Why Labour MPs are so uncomfortable  What's the government's case? The government is expected to make qualifying for PIP more difficult when Ms Kendall reveals her plans on Tuesday. Sky News' deputy political editor Sam Coates, on the Politics At Sam And Anne's podcast, said the Treasury is also expected to abolish the Work Capability Assessment, which determines whether someone is fit or not to work and to then receive disability payments. The government has described the system as \"dysfunctional\", as those \"not fit for work\" do not receive employment support or further engagement after the assessment, which could lock them out of future work altogether. Sir Keir Starmer has made cutting the welfare budget a key project, as spending on sickness benefits soared to £65bn last year - a 25% increase since the year before the pandemic - and is expected to rise to £100bn before the next general election in 2029. The number of people in England and Wales claiming either sickness or disability benefit has gone from 2.8 million to about four million since 2019. Ms Kendall also revealed in the Commons the number of young people not working because of mental health conditions has risen by more than 25% in the last year, with the number considered \"economically inactive\" now reaching 270,000.  Unhappy Labour MPs Ms Kendall had been expected to announce welfare cut plans last week. But due to the scale of the backlash, the government took the unusual step of asking all 404 Labour MPs to attend \"welfare roundtables\" in Downing Street last week. Sky News' political correspondent Amanda Akass said Ms Kendall's Commons appearance offered no real answers to the \"serious concerns\" raised by MPs, though social security minister Stephen Timms insisted they would \"welcome\" many of the changes when they are announced. Treasury minister Emma Reynolds earlier played down the level of discontent over plans to freeze PIP, telling Sky News the roundtables were nothing more than \"everyday business\". She pointed out Labour created the welfare state in 1945, but said it needs to be \"more sustainable\"."
    },
    {
        "title": "Why is Labour sick of the benefit PIP?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/why-is-labour-sick-of-the-benefit-pip-13330921",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-pip-podcast_6859589.jpg?20250317132312",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-17 13:23:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈 The government is due to set out its plans to make cuts to the welfare system on Tuesday. One of the benefits targeted for £5bn worth of savings is the key disability benefit - Personal Independence Payments (PIP). Health Secretary Wes Streeting has told Sky News 1,000 people a day apply for PIP, but pressure from Labour's backbenchers could see plans to reform the benefit watered down. On today's Sky News Daily, Niall Paterson speaks to Paul Morrison, a benefits expert and policy adviser for the Methodist Church, on how PIP works and who is eligible. Political correspondent Liz Bates explains the challenges of reforming PIP. Podcast producer: Natalie Ktena & Rosie GillottEditor: Wendy Parker"
    },
    {
        "title": "'Significant' number of countries to provide troops to Ukraine peacekeeping force",
        "description": "A \"significant number\" of countries will provide troops to a Ukraine peacekeeping force, Sir Keir Starmer's spokesman said.",
        "url": "https://news.sky.com/story/more-than-30-countries-sign-up-to-coalition-of-willing-as-pm-says-significant-force-backing-ukraine-13330899",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-downing-street-world-leaders_6859590.jpg?20250317132520",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-17 12:46:00",
        "Headline": "More countries have now joined the \"coalition of the willing\", a group of Western nations who are working to end the war in Ukraine. It was first mooted following a summit hosted by the prime minister earlier this month.",
        "Content": "\n          Political reporter\n              @alixculbertson\n A \"significant number\" of countries will provide troops to a Ukraine peacekeeping force, Sir Keir Starmer's spokesman said. On Saturday, leaders from 26 Western countries - plus two EU leaders and NATO's secretary general - gathered for a virtual call of the \"coalition of the willing\", hosted by Sir Keir after Volodymyr Zelenskyy accepted a 30-day interim ceasefire agreement. Politics latest: Farage welcomes defectors The prime minister said military chiefs would meet this Thursday to discuss the next \"operational phase\" in protecting Ukraine as part of a peacekeeping force - if a deal can be agreed with Russia. Speaking on Monday, Sir Keir's spokesman said they now expect \"more than 30\" countries to be involved in the coalition - but did not reveal which other countries had joined since Saturday. He added: \"The contribution capabilities will vary, but this will be a significant force, with a significant number of countries providing troops and a larger group contributing in other ways.\" The spokesman did not say which countries agreed to be part of a peacekeeping force, which Sir Keir and French leader Emmanuel Macron have confirmed the UK and France will be part of.  Could troops end up fighting? Russia has repeatedly said it would not accept soldiers from NATO countries being stationed in Ukraine. Asked if British troops fired on by Russia in Ukraine would be allowed to fire back, the spokesman said: \"It's worth remembering that Russia didn't ask Ukraine when it deployed troops. \"We've got operational planning meetings that they are going through.\" The spokesman also said he did not know if the US - notably absent from the coalition - will be joining the military chiefs' meeting on Thursday, but said the UK is having \"regular discussions with our American counterparts\". Both the UK and France are pushing for the US to provide security guarantees to prevent Russia from reneging on any peace deal with Ukraine. Read more:Who's in the coalition of the willing?Follow live updates from the Ukraine war  Trump and Putin to hold talks Last week, Russian President Vladimir Putin said he supports the truce brokered by the US in Saudi Arabia, but \"lots of questions\" remain over the proposals. Donald Trump said on Sunday night he will speak to Mr Putin on Tuesday about ending the war and negotiators have already discussed \"dividing up certain assets\", including land and power plants. He said a \"lot of work\" had been done over the weekend on a peace deal. The leaders involved in Saturday's call were from: Australia, Belgium, Bulgaria, Canada, Czech Republic, Denmark, Finland, France, Germany, Greece, Iceland, Italy, Latvia, Lithuania, Luxembourg, Netherlands, New Zealand, Norway, Poland, Portugal, Romania, Spain, Sweden, Turkey, Ukraine, and the UK. NATO Secretary General Mark Rutte, EU Commission President Ursula von der Leyen and EU Council President Antonio Costa also joined."
    },
    {
        "title": "Canada's new Prime Minister Mark Carney meets King Charles and Sir Keir Starmer",
        "description": "Canada's new prime minister Mark Carney has met Sir Keir Starmer in Downing Street this evening, with the UK leader welcoming the relationship between the \"two sovereign allies\". ",
        "url": "https://news.sky.com/story/mark-carney-meets-king-as-he-looks-to-strengthen-eu-alliances-amid-us-rift-13330877",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-mark-carney-king-charles_6859841.jpg?20250317170609",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-17 12:09:00",
        "Headline": "The former Bank of England governor, who was sworn in as Canada's new leader last week, arrived in London from Paris where he met French President Emmanuel Macron.",
        "Content": "Canada's new prime minister Mark Carney has met Sir Keir Starmer in Downing Street this evening, with the UK leader welcoming the relationship between the \"two sovereign allies\".  The former Bank of England governor also met King Charles, who is Canada's head of state, at Buckingham Palace where Mr Carney told the monarch they had \"much to catch up on\". The visit to the UK comes as US President Donald Trump has been threatening Canada's sovereignty by repeatedly suggesting he would make it the 51st US state - something Mr Carney called \"disrespectful\" in a press conference this evening. Mr Carney, who was sworn in on Friday, succeeded Justin Trudeau as Canada's prime minister and leader of the Liberal Party. He had arrived in London from Paris, where he met French President Emmanuel Macron. He said it was important to strengthen ties with \"reliable allies\" in Europe at a critical time for relations between Canada and its bigger neighbour, the US. In the press conference, Mr Carney dismissed a question about allies not vocally supporting Canada as a sovereign nation, saying: \"We don't need another country to validate our sovereignty, we are sovereign.\" Sir Keir said it was \"fantastic\" to have Mr Carney in the UK so early in his tenure and that the relationship between the two countries \"has always been strong\". \"Two sovereign allies with so much in common, shared history, shared values, shared King.\" Earlier, the King was pictured grinning as he shook Mr Carney's hand in the 1844 Room of the royal residence. Footage from the meeting showed the King telling Mr Carney: \"Very good to see you. Congratulations.\" Mr Carney replied as they shook hands: \"Your Majesty. Lovely to see you...Thank you very much.\" He told the King pointing to his own lapel: \"Bit of a disaster today sir. My Order of Canada pin broke.\" Mr Carney added: \"Yes. It fell on the tarmac... which is proof that our founding people is the British,\" prompting a chuckle from the King. The monarch offered his pin before telling his visitor: \"It's a great treat to see you again\", with Mr Carney replying: \"Much to catch up on.\" Royal correspondent \"Very good to see you, congratulations\" were the King's opening remarks to Mark Carney in the 18th century-room at Buckingham Palace.  A very jovial start to the 45 seconds that the palace allowed to be filmed.  Short, yes, but it's actually quite rare that a TV camera is allowed in for the start of an audience - even that says a lot. A sign that it was important for all sides that this meeting was properly seen between Canada's monarch, King Charles as their head of state, and his new prime minister in that realm, at what is a difficult time.  The small talk, with Mark Carney explaining how his Order of Canada pin had broken and the King offering to give him his, was a preamble to no doubt more troubling discussions, with Carney saying there was \"much to catch up on\".  For 30 minutes the two men were then left alone to talk, as is common practice between the monarch and any of his prime ministers. What they talked about, we don't know. Last week, when the King met members of the Canadian Senate, we were told they discussed topics of great concern to all parties, both nationally and internationally.  You would expect that President Trump's remarks about turning Canada into the 51st state, and the ongoing war of words over trade, inevitably would have been on the list of topics for discussion this time. And just maybe how the King may be helpful.  King Charles is one man who hasn't been in Donald Trump's firing line, with the president publicly saying he respects him. During his swearing-in ceremony on Friday, Mr Carney noted the country was built on the bedrock of three peoples: French, British and Indigenous. He also said Canada is fundamentally different from America and will \"never, ever, in any way shape or form, be part of the United States\".  Mr Carney has said he won't sit down with Trump until the US is ready to have a more comprehensive discussion on trade. \"When the US is ready to have that we're ready to sit down,\" he said. He added Canada is not trying to organise a coordinated retaliation response among countries and that there is a limit to what Canada is prepared to do in retaliation given that the US economy is 10 times the size of Canada's. Mr Carney also noted the United States, France, the UK and Canada are members of NATO and it would be \"unthinkable\" for the US to annex Canada through military means. The new prime minister is trying to steer his country through a trade war brought by Mr Trump, who has slapped 25% tariffs on Canadian steel and aluminium and is threatening sweeping tariffs on all Canadian products from 2 April. Canada, which is the biggest foreign supplier of steel and aluminium to the US, last week announced 25% retaliatory tariffs on those metals along with computers, sports equipment and other products worth $20bn in total. Meanwhile, Sir Keir and Mr Carney also spoke about the war in Ukraine. Canada has been taking part in discussions around a coalition of countries which could contribute to a peacekeeping force in Ukraine. Canada took part in a virtual meeting of world leaders hosted by Sir Keir on Saturday, focused on the so-called \"coalition of the willing\", alongside Australia and New Zealand as well as European nations. The Canadian premier told Sir Keir: \"We're at a point in history where the world is being reordered, and your leadership, the leadership of the UK, I'll use the example... of Ukraine, what you've been able to do with President Macron to bring together a coalition of the willing at a crucial time, I think, will be decisive, must be decisive, in coming to a lasting solution there.\""
    },
    {
        "title": "Sky News and Politico join forces again with new Politics At Sam And Anne's podcast",
        "description": "The new Sky News and Politico podcast Politics At Sam And Anne's launches today, with Anne McElvoy replacing Jack Blanchard as Sam Coates's co-host.",
        "url": "https://news.sky.com/story/sky-news-and-politico-join-forces-again-with-new-politics-at-sam-and-annes-podcast-13328533",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250314163649",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-17 07:40:00",
        "Headline": "Sky News' Sam Coates and Politico's Anne McElvoy will be buddying up to co-host a political podcast bringing audiences everything they need to know about the day ahead in Westminster - in no more than 20 minutes. It replaces the award-winning Politics At Jack And Sam's.",
        "Content": "The new Sky News and Politico podcast Politics At Sam And Anne's launches today, with Anne McElvoy replacing Jack Blanchard as Sam Coates's co-host. The political podcast will be available from 7.30am Monday to Thursday and will see Coates, Sky News' deputy political editor, and McElvoy, Politico's executive editor, unpack everything there is to know about the day ahead in Westminster. Each instalment of the award-winning podcast will give audiences the latest insight into British politics in no more than 20 minutes. The podcast originally launched in September 2023 with Jack Blanchard - Politico's former UK editor, and now author of Politico's DC Playbook. 👉Listen to Politics At Sam And Anne's on your podcast app👈 McElvoy's arrival comes after a successful year for the podcast as it was recently recognised at the inaugural Political Podcast Awards and credited for its \"must-know political insight\". Coates, who won Presenter of the Year at the 2025 Political Podcast Awards, said: \"Having Anne on board as my new full-time co-host is hugely exciting. \"With her phenomenal multi-decade background in domestic and international affairs, Anne is best in class at dissecting how events around the world are shaping Westminster. \"By combining Politico's incredible depth and Sky's ability to cut through the noise, we are well placed to continue providing unrivalled analysis and the latest scoops to our informed Westminster audience.\" McElvoy said: \"Sam's boundless energy, deep cross-party knowledge and a shared delight in informed conversation on the topics and characters shaping politics make even our early morning recordings fun. \"Our mission remains delivering the unmissable first podcast of the day for and about Westminster. We will explore the news moments that matter, offer our own insights and spontaneous exchanges and preview events that shape our political world.\" David Rhodes, executive chairman of Sky News, said the podcast was \"the go-to source for people who work in Westminster and beyond\". He said: \"It provides an unparalleled service, giving a community of highly engaged listeners the full story, first each morning on what's happening in politics.\""
    },
    {
        "title": "Kemi Badenoch says UK target to reach net zero by 2050 'impossible'",
        "description": "Tory leader Kemi Badenoch has dismayed green Conservatives by declaring the UK's target to reach net zero by 2050 \"impossible\".",
        "url": "https://news.sky.com/story/kemi-badenoch-says-uk-target-to-reach-net-zero-by-2050-impossible-13331102",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-kemi-badenoch-conservative_6860006.jpg?20250317222212",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-03-17 20:02:00",
        "Headline": "The Conservative leader's remarks are criticised by a Tory environmental group which says she has made a mistake.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Tory leader Kemi Badenoch has dismayed green Conservatives by declaring the UK's target to reach net zero by 2050 \"impossible\". In a speech on Tuesday, the Conservative Party leader is expected to tell what she says is the \"unvarnished truth\" that the net zero goal cannot be achieved without \"a serious drop in our living standards or by bankrupting us\". Ms Badenoch will say she is not making a \"moral judgement\" on net zero or debating whether climate change exists. But, as she begins to renew party policy, she will say that current climate policies are \"largely failing\" to improve nature and \"driving up the cost of energy\". Politics latest: Follow live updates Net zero means cutting emissions of greenhouse gases, which cause climate change, to virtually zero, and absorbing the rest elsewhere. Scientists say the world must reach that point by 2050 to avoid even worse flooding, wildfires, and other damage - but that action is lagging behind. The UK has already cut its greenhouse gas emissions in half. The next half is expected to be more challenging as it requires changes to people's heating, cars and diet - things that often need upfront costs, but could save people money in the long run with the right government support, advisers have said. Ms Badenoch's plans take the Conservative Party to its most sceptical position on net zero yet - a target set in law by Tory Prime Minister Theresa May in 2019. And it comes at a time when Reform UK is questioning climate science and US President Donald Trump, leader of the second most polluting country in the world, is dismantling nature protections.  Ms Badenoch's \"policy renewal\" she is outlining on Tuesday will see shadow cabinet members set core priority questions as a move towards formulating new policy for the party. Sam Hall, of the Conservative Environment Network of 50 MPs, said it was \"a mistake\" for Ms Badenoch to have \"jumped the gun on her own policy review and decided net zero isn't possible by 2050\". He said the Tory leader was right to question Labour's climate plans, but that the target is driven \"not by optimism but by scientific reality; without it climate change impacts and costs will continue to worsen\". Abandoning the science would risk losing voter's support, he added. Climate reporter The UK public has long been supportive of government climate action – that's true across voters of different parties too. Labour capitalised on this in last year's general election and swooped to victory with a green mandate.\n\n Rishi Sunak's attempts to roll back some climate policies flopped, and polling by More In Common found Labour's arguments that clean power and climate action are the best way to tackle the cost of living cut through with people. For now, at least. The tide of climate scepticism has been rising since Sunak's days, with Reform UK questioning climate science altogether and Kemi Badenoch now calling the 2050 target \"impossible\" – though she did stress she doesn't want to dismantle it and that she does believe in climate change. And she's not wrong that it is going to be hard. Given the strong public support for climate action, it's not surprising Sunak's attempt to politicise the issue didn't work out for him.\n\n But now others following in his footsteps have been emboldened by US President Donald Trump. Their attacks are gathering speed - and they might start to take root.\n\n\n\n This may be an inflection point for goodwill towards climate action in the Conservative Party – which has a long legacy of supporting it – and more broadly in the UK. Labour cannot take public support for its net zero plans for granted at a time when political consensus on it is fracturing.\n\n And given the next stage of the country's climate action is about to get more disruptive for people, it is just when it needs this public support more than ever.\n\n Four in five Conservative voters in last year's general election and two thirds of Reform voters thought it was important that the government cared about tackling climate change, according to polling by More in Common. Shaun Spiers, executive director of thinktank Green Alliance, called it \"disappointing\" to see Ms Badenoch \"turn her back on cleaner, cheaper, homegrown energy\". \"It is even more disappointing to see the leader of the opposition take cues from climate deniers across the pond,\" he added, in a veiled swipe at President Trump. \"Net zero is not 'nice-to-have', it's an achievable, evidence-based target designed to protect the UK from the worst impacts of climate change.\" The UK's Climate Change Committee (CCC), which advises governments on how to reach net zero, said last month the goal is \"ambitious\" but \"deliverable\". But it also warned as Labour took office last summer that, at that time, just one third of the cuts to greenhouse gases needed to reach an interim 2030 target were covered by a \"credible plan\"."
    },
    {
        "title": "Fear seabirds might choke on tiny plastic pellets 'likely' to have come from North Sea crash",
        "description": "Wildlife charities have sounded the alarm about tiny plastic pellets washing up on English beaches.",
        "url": "https://news.sky.com/story/fear-seabirds-might-choke-on-tiny-plastic-pellets-likely-to-have-come-from-north-sea-crash-13331020",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-nurdles-oil-tanker-collision_6859836.png?20250317170211",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-03-17 16:43:00",
        "Headline": "Nurdles are tiny pellets used to make plastic products and while they are not toxic can result in the deaths of animals who eat them either through choking or starvation.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Wildlife charities have sounded the alarm about tiny plastic pellets washing up on English beaches. Nurdles are tiny pellets - around 1-5mm long - used to make plastic products. They are not toxic, but animals that eat them can choke or starve to death as they mistakenly believe their stomachs to be full of food. HM Coastguard has confirmed they have appeared along The Wash, a bay that runs along the Lincolnshire and Norfolk coast, and that they \"likely\" entered the water during last week's North Sea crash. Chief Coastguard Paddy O'Callaghan said: \"Yesterday (16 March) the RNLI advised the MCA of a sighting in waters just off The Wash of a sheen that we now know to be plastic nurdles. \"This was confirmed by aerial surveillance flights and other assets have subsequently been deployed. \"Some nurdles have now also been identified on the shore. \"Retrieval has started today. This is a developing situation and the Transport Secretary continues to be updated regularly.\" The pellets appear to have been burned or combined with burnt material, the Wildlife Trusts' conservation group said. They said four patches of nurdles have been identified, which although are \"relatively small\", are still a cause of \"concern for nature\". It said in a press release: \"The relevant authorities have now deployed vessels to try to net pollutants from the sea, and co-ordinated actions are underway to collect any that come ashore, such as those found at Holme Dune National Nature Reserve.\" Tammy Smalley, head of conservation at Lincolnshire Wildlife Trust, says: \"We're very concerned about the nurdles and burnt material that is adrift at sea as well as being washed up along The Wash and the Norfolk coast following the tanker collision last week. She added: \"At this time of the year there is also the risk that the birds (that have eaten nurdles) return to their nests and feed the nurdles to their chicks.\" Read more from Sky News:Inside Syria's stunned coastal citiesPolice searching for missing woman launch murder probeConor McGregor to meet Trump Although they are small, they are one of the largest sources of plastic pollution in the sea. \"Once they're released into the waves they're very hard to clear up,\" added Ms Smalley. The public has been asked not to pick them up if they find any, but to ring 999 and ask for HM Coastguard to report the location. Last week, a cargo vessel named the Solong crashed with a tanker named Stena Immaculate, which had been carrying 220,000 barrels of jet fuel in 16 segregated tanks. 👉 Listen to Sky News Daily on your podcast app 👈 A fire on the ship burned for three days after the incident and a salvage team has confirmed that 17,515 barrels of the 220,000 being carried have been lost, according to Crowley, the maritime company that operates the tanker. They added that only one tank was damaged thanks to the actions of the crew, who they praised as \"heroic\". On Monday, the company reiterated that message, sharing a picture of the crew and thanking them for their \"bravery and quick action\". One crew member from the Solong remains missing, presumed dead, following the crash. The ship's captain, Russian national Vladimir Motin, 59, appeared at Hull Magistrates' Court on Saturday morning charged with gross negligence manslaughter and was remanded in custody to appear at the Old Bailey on 14 April."
    },
    {
        "title": "Drag queen The Vivienne died after taking ketamine, family says",
        "description": "Drag queen James Lee Williams - known as \"The Vivienne\"- died after taking ketamine, their family has said.",
        "url": "https://news.sky.com/story/drag-queen-the-vivienne-died-after-taking-ketamine-family-says-13331059",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-the-vivienne-drag-race-uk_6792406.jpg?20250105223330",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-17 18:22:00",
        "Headline": "The drag star, whose real name is James Lee Williams, was found dead at their home in Cheshire on 5 January. ",
        "Content": "Drag queen James Lee Williams - known as \"The Vivienne\"- died after taking ketamine, their family has said. Williams, who won the first series of RuPaul's Drag Race UK in 2019 under their drag name, was found dead at the age of 32 at their home in Cheshire on 5 January. In a statement shared in an Instagram story today, Williams' manager Simon Jones said the \"family and I feel it is important to say how James tragically died\". Mr Jones continued: \"We hope that by us releasing this information, we can raise awareness about the dangers of ongoing ketamine usage and what it can do to your body. \"Ketamine usage is on the rise, particularly amongst young people, and I don't think the full dangers of the drug are being discussed.\" Mr Jones added that he and the family are working with mental health and addiction service Adferiad on a campaign to \"raise vital awareness and give information on how to get help if you are struggling with ketamine usage\". Williams reportedly died after suffering a cardiac arrest caused by ketamine - a general anaesthetic that is also used as a recreational drug, Donna Chaves, from Adferiad, said: \"We are incredibly grateful to James's family for choosing to support and work with us on this campaign. \"Their courage in sharing James's story will help raise vital awareness of the devastating impact substance use can have. We are seeing a worrying rise in the number of people using ketamine, often unaware of the serious risks it poses to their physical and mental health. \"Addiction can affect anyone, and too many people suffer in silence due to stigma and lack of understanding. \"By opening conversations and challenging misconceptions, we can help prevent further tragedies and support those in need to find hope and recovery.\" An inquest into the death of Williams was opened and adjourned at Cheshire Coroner's Court in Warrington last month. The TV personality, who grew up in Colwyn Bay, North Wales, before moving to Liverpool, came third in the 2023 edition of Dancing On Ice. The star performed as the Wicked Witch of the West in a UK and Ireland tour of The Wizard Of Oz musical and reprised the role in the West End at the Gillian Lynne Theatre last year. Read more from Sky News:Conor McGregor meets Donald Trump at White HousePrincess of Wales enjoys Guinness at St Patrick's Day event Man injured by hot tea awarded $50m in damages They were due back on stage this month as the Childcatcher in a tour of Chitty Chitty Bang Bang, a role they first played last year. Their funeral in Bodelwyddan, Denbighshire, North Wales, was attended by RuPaul's Drag Race UK contestants Tia Kofi and Baga Chipz, along with Steps singer Ian \"H\" Watkins, TV personality Kim Woodburn and Coronation Street actress Claire Sweeney. The government is seeking expert advice after illegal use of ketamine surged to record levels. In the year ending March 2023, an estimated 299,000 people aged 16 to 59 had reported use of the substance, which is controlled as class B, according to the Home Office. According to the UK national anti-drug advisory service Frank, ketamine reduces sensations in the body which can make users feel dream-like and detached, chilled, relaxed and happy, but also confused and nauseated. A full inquest into the death of The Vivienne was listed to take place on 30 June."
    },
    {
        "title": "US rock band Semisonic criticises White House for using their song in video of shackled deportee",
        "description": "US rock band Semisonic has criticised the White House for using their song Closing Time in a social media post that showed a shackled deportee. ",
        "url": "https://news.sky.com/story/us-rock-band-semisonic-criticises-white-house-for-using-their-song-in-video-of-shackled-deportee-13331137",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-deportations-el-salvador_6860053.jpg?20250317225252",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-17 21:54:00",
        "Headline": "The Trump administration shared the video two days after hundreds of alleged Venezuelan gang members were controversially deported by the White House to a supermax prison in El Salvador.",
        "Content": "US rock band Semisonic has criticised the White House for using their song Closing Time in a social media post that showed a shackled deportee.  The Trump administration shared the video on Monday two days after hundreds of alleged Venezuelan gang members were controversially deported by the White House to a supermax prison in El Salvador. The video, which also showed deportees boarding a plane, was captioned with the song's lyrics: \"You don't have to go home but you can't stay here.\" Semisonic said in a statement after the video was shared: \"We did not authorise or condone the White House's use of our song in any way. And no, they didn't ask. The song is about joy and possibilities and hope, and they have missed the point entirely.\" Asked about the video on Monday, White House press secretary Karoline Leavitt said \"our entire government clearly is leaning into the message of this president\". US District Judge James E Boasberg had issued an order temporarily blocking the deportations on Saturday, but lawyers told him there were already two planes with immigrants in the air - one headed for El Salvador, the other for Honduras. Ms Leavitt said on Sunday that the more than 200 people deported were members of the Tren de Aragua (TdA) gang - which originated in an infamously lawless prison in the central Venezuelan state of Aragua. \n                  Big benefits cuts are imminent - here's what to expect and why it could be just the start\n                 \n                  John 'Paddy' Hemingway: Last surviving Battle of Britain pilot dies aged 105\n                 \n                  Kemi Badenoch says UK target to reach net zero by 2050 'impossible'\n                 It came before Jorge Rodriguez, the president of Venezuela's National Assembly, said those who were deported were denied due process. Speaking at a press conference on Monday, Mr Rodriguez said the people deported were not known to have committed any crimes in the United States or El Salvador, and that Venezuela would do everything it can to have them returned home. It also emerged on Monday that the US Justice Department is seeking to remove Mr Boasberg as the judge presiding over the Venezuelan deportation case. The request to remove Mr Boasberg came just before a hearing in his Washington courtroom began on the matteron Monday evening. Band join exclusive club Semisonic join a long list of performers who have objected to Donald Trump using their songs, including Abba, Bruce Springsteen, Rihanna, Phil Collins, Pharrell, John Fogerty, Neil Young, Eddy Grant, Panic! at the Disco, R.E.M., Guns N' Roses, Celine Dion, Beyonce and Adele. Closing Time is from the band's 1998 album Feeling Strangely Fine, which peaked at number 43 on the Billboard 200 album chart. The song hit number four on Billboard's Adult Alternative Airplay chart and earned a Grammy nomination for best rock song."
    },
    {
        "title": "Blue Note Jazz Club boss says restrictive licensing laws are killing music after late licence refused",
        "description": "The boss of an iconic jazz bar says he's been left \"surprised\" and \"confused\" after his late licence application for a London site was turned down, making him question support for live music in the capital.",
        "url": "https://news.sky.com/story/blue-note-jazz-club-boss-says-restrictive-licensing-laws-are-killing-music-after-late-licence-refused-13328604",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-yussef-dayes-blue-note_6856382.jpg?20250314164320",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-03-17 00:01:00",
        "Headline": "The Blue Note Jazz Club has hosted stars including Stevie Wonder, Ezra Collective and Mary J Blige, and is well known in the jazz world. But the proposed London venue is currently dogged with both council and police objections.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n The boss of an iconic jazz bar says he's been left \"surprised\" and \"confused\" after his late licence application for a London site was turned down, making him question support for live music in the capital. Steven Bensusan - president of Blue Note Entertainment Group and son of the original Blue Note Cafe founder Danny Bensusan - told Sky News: \"If they're not giving us a late licence, I can't imagine how they would be supportive of other smaller venues, which are important for the ecosystem in general. \"For music to survive and continue to thrive and grow, you need the feeder venues. They need the smaller venues, and you need the venues like the Blue Note. It's important for the music.\" The planned venue at a former gym on St Martin's Lane, Covent Garden, had been set to become the bar's flagship European site. The club had applied to Westminster City Council to remain open until 1am serving alcohol. However, in February, the Met Police objected to the jazz club's application over fears it could cause an \"uptick in crime\". Responding to the refusal, Mr Bensusan said: \"In every city that we've ever opened the club they've rolled out the red carpet and really tried to go above and beyond and want us there because they realise that we're good for the economy. \n                  Illegal immigrant who came to UK on small boat helped smuggle thousands of others into Europe from London home\n                 \n                  Autistic teen says he was left feeling 'inhuman' after being rejected by NHS mental health services\n                 \n                  Stockwell shooting: Second person charged with murder after death of Lathaniel Burrell\n                 \"We generate a lot of jobs and we bring not just nightlife but a cultural moment to the city. I've never experienced this before.\" 'There seems to be a bigger problem' Many of the capital's nightlife venues have been struggling since the pandemic and Brexit, amid the cost of living crisis, rising rents and decreasing footfall. Mr Bensusan says the rejection of his late licence highlights a bigger issue: \"There seems to be a problem in general. A lot of music venues have closed over the years since COVID and they're not coming back. Many people believe it has to do with a lot of restrictive policies like this.\" While Mr Bensusan has flagged the \"more mature and respectful\" nature of the jazz audience, police concerns seem to be around guests falling prey to crime rather than perpetrating it. In their objection, the Met said jazz fans \"leaving the venue late at night\" could become a target for phone snatchers as well as illegal taxis who \"prey on vulnerable, intoxicated lone females\". Read more:Kate Nash: 'My bum is for sale - my artistic vision isn't'At least one UK grassroots music venue closing per week Local residents also urged councillors to limit the venue's closing time to 11pm, with one saying they feared \"inebriated\" club visitors, \"disorientated by their emergence into the cool night air\" would be \"immediately vulnerable to the gangs of criminals who already prey on similar groups of people in the Soho area\". Mr Bensusan says a proposed closing time of 11.30pm would be \"impossible\", and would not allow for musicians to play two sets per night. He said he was also \"a little confused\" as to why the Blue Note was denied a 1am licence while others in the area had a later licence. For comparison, Ronnie Scott's Jazz Club just down the road in Soho has a licence up to 3am. Mr Bensusan has now filed an appeal. A Westminster City Council Spokesperson told Sky News: \"We want to continue offering aspiring artists the opportunity to share their passion for music with others,\" but said it was important to \"strike a balance between supporting music venues and the needs of residents\". They said the council's decision had taken into account \"the genuine concerns from residents\" and they felt their decision was \"necessary and proportionate to uphold the licensing objectives\". The council says it is in ongoing discussions with the club about potential ways forward. A change.org petition set up by a jazz fan in support of the club has so far attracted over 2,500 signatures. Plans to nurture emerging talent The Blue Note site in London had proposed a 250-capacity main showroom \"featuring legendary artists\", plus a smaller 100-capacity room to showcase emerging artists. Mr Bensusan told Sky News: \"There are so many great UK artists that we want to help build. I think we can do that given the platform that we have, and our ability to tour some of the artists to markets where we are around the world.\" Many UK artists who have played in the Blue Note clubs over the years, including Ezra Collective, Jamie Cullum and Nubya Garcia, have since found international success. Mr Bensusan says he wants \"to help that continue to grow\". He goes on: \"Our goal is to focus on the best artists from around the world and give them the platform to play long runs. They're not just coming to the city for a concert and then leaving. Typically, our runs go between four and six nights a week, for two shows per night.\" The original Blue Note Jazz Cafe opened in 1981 in New York City, and now has nine sister venues around the world including in Tokyo, Shanghai and Milan. A new venue in LA will open this summer. The bigger nightlife picture A 2024 report from the Night Time Industries Association showed the UK night-time cultural economy was worth £33.3bn, down from £37.2bn in 2019. The association says that over the past four years, the UK has lost 37% of its clubs, which works out at a rate of around 10 clubs per month. And last year, City Hall was told by industry representatives that night venues were being pushed to the brink of closure due to issues including strict licensing laws. In response, London mayor Sadiq Khan has set up a dedicated \"nightlife taskforce\", made up of 11 independent industry professionals, to address issues facing the industry. They will be advised by bodies including the Met Police and Transport For London. In support of Blue Note's renewed application, the Music Venue Trust said: \"Having a new grassroots music venue in Westminster is extremely important both for a sense of community the venue brings to its local community and also the mental health benefits of being able to attend and enjoy grassroots music and arts. \"Through our engagement with West End Jazz Limited (Blue Note Jazz Club) we have viewed the proposals for the space which contain absolute commitments to grassroots live music programming.\" The next steps as to the future of the club should be known over the coming months."
    },
    {
        "title": "Bulgarian football club Arda Kardzhali apologise after holding minute's silence for former player who is still alive",
        "description": "A Bulgarian football club have apologised for holding a minute's silence for a former player who is still alive.",
        "url": "https://news.sky.com/story/bulgarian-football-club-arda-kardzhali-apologise-after-holding-minutes-silence-for-former-player-who-is-still-alive-13331118",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-football-ball_6860009.jpg?20250317212346",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-03-17 20:44:00",
        "Headline": "When officials realised their mistake, they said they wished their former player \"many more years of good health\".",
        "Content": "A Bulgarian football club have apologised for holding a minute's silence for a former player who is still alive. Arda Kardzhali, which is located in the southern Bulgarian town of Kardzhali, and play in the country's top division, held the minute's silence in honour of Petko Ganchev before Sunday's game against Levski Sofia. Both teams lined up near the centre circle before kicking off in the 1-1 draw, bowing their heads to mourn Ganchev. But, before the match was over, Arda posted on their Facebook page saying they had received wrong information about Ganchev's death. The club said: \"The management of PFC Arda would like to express a huge apology to the former Arda player Petko Ganchev and his relatives after the club received wrong information about his death. \"We wish Petko Ganchev many more years of good health and to enjoy the success of Arda.\" The post appeared to have been deleted by Monday evening. Read more from Sky News:McGregor meets Donald TrumpKate enjoys a Guinness$50m for man hurt by hot tea The draw means Arda are fifth in the 16-team table and can still secure a place in European football next season. Levski stay second, but are 12 points behind leaders Ludogorets."
    }
]