[
    {
        "title": "An Iranian attack on US military bases could draw the UK into the conflict",
        "description": "When I got to Chequers on Sunday morning the prime minister had clearly been up for most of the night and hitting the phones all morning with calls to fellow leaders in Europe and the Middle East as he and others scrambled to try to contain a very dangerous situation.&#160;",
        "url": "https://news.sky.com/story/an-iranian-attack-on-us-military-bases-could-draw-the-uk-into-the-conflict-13387191",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-keir-starmer_6948194.jpg?20250622195001",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-06-22 18:32:00",
        "Headline": "An attack on one NATO member is an attack on them all, meaning the British government may have no choice about potential involvement.",
        "Content": "\n          Political editor\n              @BethRigby\n  When I got to Chequers on Sunday morning the prime minister had clearly been up for most of the night and hitting the phones all morning with calls to fellow leaders in Europe and the Middle East as he and others scrambled to try to contain a very dangerous situation.  His primary message on Sunday was to try to reassure the public that the UK government was working to stabilise the region as best it could and press for a return to diplomacy. But what struck me in our short interview was not what he did say but what he didn't - what he couldn't - say about the US strikes. It was clear from his swerve on the question of whether the UK supported the strikes that the prime minister neither wanted to endorse US strikes nor overtly criticise President Trump. Instead, his was a form of words - repeated later in a joint statement of the E3 (the UK, Germany and France) to acknowledge the US strikes and reiterate where they can agree: the need to prevent Iran having a nuclear weapon. He also didn't want to engage in the very obvious observation that President Trump simply isn't listening to Sir Keir Starmer or other allies, who had been very publicly pressing for de-escalation all week, from the G7 summit in Canada to this weekend as European countries convened talks in Geneva with Iran.  It was only five days ago that the prime minister told me he didn't think a US attack was imminent when I asked him what was going on following President Trump's abrupt decision to quit the G7 early and convene his security council at the White House. When I asked him if he felt foolish or frustrated that Trump had done that and didn't seem to be listening, he told me it was a \"fast moving situation\" with a \"huge amount of discussions in the days since the G7\" and said he was intensely pressing his consistent position of de-escalation. What else really could he say? He has calculated that criticising Trump goes against UK interests and has no other option but to press for a diplomatic solution and work with other leaders to achieve that aim.  Before these strikes, Tehran was clear it would not enter negotiations until Israel stopped firing missiles into Iran - something Israel is still saying on Sunday evening it is not prepared to do. The US has been briefing that one of the reasons it took action was because it did not think the Iranians were taking the talks convened by the Europeans in Geneva seriously enough. It is hard now to see how these strikes will not serve but to deepen the conflict in the Middle East and the mood in government is bleak. Iran will probably conclude that continuing to strike only Israel in light of the US attacks - the first airstrikes ever by the US on Iran - is a response that will make the regime seem weak.  Read more:Iran may not have lost its ability to make a nuclear bombIran may decide that killing Americans is the best way to retaliate But escalation could draw the UK into a wider conflict it does not want. If Iran struck US assets, it could trigger article five of NATO (an attack on one is an attack on all) and draw the UK into military action. If Iran chose to attack the US via proxies, then UK bases and assets could be under threat. The prime minister was at pains to stress on Sunday that the UK had not been involved in these strikes. Meanwhile, the UK-controlled airbase on Diego Garcia was not used to launch the US attacks, with B-2 bombers deployed from Guam instead. There was no request to use the Diego Garcia base, the president moving unilaterally, underlining his disinterest in what the UK has to say. The world is waiting nervously to see how Iran might respond, as the PM moves more military assets to the region while simultaneously hitting the phones. The prime minister may be deeply opposed to this war, but stopping it is not in his gift."
    },
    {
        "title": "Even after US strikes, Iran may still have the ability to make a nuclear bomb",
        "description": "It would be sensible to wait until the dust has settled before judging whether the US strikes on Iran were, in Donald Trump's, words, \"a spectacular military success\".",
        "url": "https://news.sky.com/story/even-after-us-strikes-iran-may-still-have-the-ability-to-make-a-nuclear-bomb-13387019",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-natanz-iran-nuclear_6944270.jpg?20250617124916",
        "type": "Home",
        "Author": "Tom Clarke",
        "Date Published": "2025-06-22 10:02:00",
        "Headline": "US strikes could have halted Iran's ability to enrich the uranium needed to make a viable nuclear weapon. But that's not the same as preventing its ability to make a nuclear bomb.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  It would be sensible to wait until the dust has settled before judging whether the US strikes on Iran were, in Donald Trump's, words, \"a spectacular military success\". And when dropping bombs that weigh more than 13 tonnes each, there's going to be a lot of dust. The Pentagon says the operation against Iran's three largest nuclear facilities involved 125 military aircraft, warships and submarines, including the largest operational strike by B2 bombers in history. Follow latest: Iran considering 'all options' after US strikes The B-2s dropped 14 of America's most powerful GBU-57 \"bunker buster\" bombs on the Natanz uranium enrichment plant and Iran's most sophisticated nuclear facility at Fordow. The first time, according to the Pentagon, the weapons have been used in a military operation. The Fordow complex, buried deep in a mountain, was the only site not previously damaged by Israeli strikes over the last few days. The use of multiple GBU-57 bombs at Fordow is telling. Despite their size, it was known that one of them would be insufficient to penetrate 80+ metres of solid rock believed to shelter Iran's most sophisticated uranium enrichment technology deep within Fordow. Read more:Fordow: What we know about Iran's secretive 'nuclear mountain' What we know so far about US strikes on Iran's nuclear facilities Satellite images reveal three visible holes at two different strike points on the mountainside above the complex. The sites appear to be close to what may have been ventilation shafts - possibly chosen to maximise damage below and render the facility useless. Using several of the bombs in the same location is likely designed to allow each to penetrate further than the first before detonating. If nuclear facilities at Isfahan, Natanz and Fordow were destroyed - as the US claims - or even crippled, it would certainly halt Iran's ability to enrich the Uranium needed to make a viable nuclear weapon.  But that's not the same as preventing Iran's ability to make a nuclear bomb. To do that, they need \"weapons-grade\" uranium; the necessary metal-shaping, explosives and timing technology needed to trigger nuclear fission in the bomb; and a mechanism for delivering it. The facilities targeted in the US raid are dedicated to achieving the first objective. Taking naturally occurring uranium ore, which contains around 0.7% uranium 235 - the isotope needed for nuclear fission - and concentrating it. The centrifuges you hear about are the tools needed to enrich U-235 to the 90% purity needed for a compact \"implosion\"-type warhead that can be delivered by a missile.  And the reality is Iran's centrifuges have been spinning for a long time. United Nations nuclear inspectors warned in May that Iran had at least 408kg of uranium \"enriched\" to 60%. Getting to that level represents 90% of the time and effort to get to 90% U-235. And those 400kg would yield enough of that weapons-grade uranium to make nine nuclear weapons, the inspectors concluded. The second element is something Iran has also been working on for two decades.  Precisely shaping uranium metal and making shaped explosive charges to crush it in the right way to achieve \"criticality\", the spark for the sub-atomic chain reaction that releases the terrifying energy in a nuclear explosion. In its recent bombing campaign, Israel is thought to have targeted facilities where Iranian nuclear scientists were doing some of that work. Analysis on the US strikes:Trump's two big gambles as US enters war with IranFor Trump, the performative presidency just got real But unlike the industrial processes needed to enrich uranium, these later steps can be carried out in laboratory-sized facilities. Easier to pack up and move, and easier to hide from prying eyes. Given that it's understood Iran already moved enriched uranium out of Fordow ahead of the US strike, it's far from certain that Iran has, in fact, lost its ability to make a bomb. And while the strikes may have delayed the logistics, it's possible they've emboldened a threatened Iran to intensify its warhead-making capability if it does still have one. Making a more compact implosion-based warhead is not easy. There is debate among experts about how advanced Iran is along that road. But if it felt sufficiently motivated, it does have other, less sophisticated nuclear options. Even 60% enriched uranium, of which - remember - it has a lot, can be coaxed to criticality in a much larger, cruder nuclear device. This wouldn't pose as much threat to its enemies, as it would be too heavy to fit on even the best of Iran's long-range missiles. But it would, nonetheless, elevate Iran to the status of a nuclear power."
    },
    {
        "title": "Iran may decide that killing Americans is the best way to retaliate",
        "description": "The US president has given the Iranians a choice: negotiate or face devastating escalation.",
        "url": "https://news.sky.com/story/iran-may-decide-that-killing-americans-is-the-best-way-to-retaliate-13387086",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-beirut-ali-khamenei_6948064.jpg?20250622150032",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-06-22 13:33:00",
        "Headline": "Ayatollah Ali Khamenei has spent his life trying to roll back American power and influence in the Middle East. He is unlikely to negotiate with Washington now.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n The US president has given the Iranians a choice: negotiate or face devastating escalation. The next move is down to Iran's supreme leader, Ayatollah Ali Khamenei. He has spent his entire life trying to roll back American power and influence in the region. Expecting him to negotiate with the US now, with B-2 bombers held to his head, is a tall order. More likely, he will order some kind of retaliation - at least for now. He will want to deter Donald Trump from launching more attacks and may calculate that killing Americans is the best way of doing so.  The ayatollah knows that could drive a wedge between Trump and his MAGA supporters, who say America is getting drawn into yet another Middle Eastern war, risking US lives. There are plenty of US targets for Iran to aim at, with bases throughout the Middle East: in Qatar, Kuwait, Iraq, and Saudi Arabia. The Iranians could attack them directly with drones and missiles, or use proxies in the region, Iran-backed militias in Iraq, or the Houthis, based in Yemen. Iran could threaten shipping and the oil industry in the Persian Gulf. If the Gulf becomes a war zone, expect a big hit to the global economy and the price of oil to rocket. But all that would invite massive retaliation from the US. The Trump administration has spelt that out in no uncertain terms. America has sent an awesome amount of firepower to the region: three aircraft carrier groups bristling with fighter jets and submarines loaded with cruise missiles. More about Ali Khamenei:Listen: From accidental to absolute leader - who is Ayatollah Ali Khamenei?Ayatollah Ali Khamenei: Who is Iran's supreme leader  So the Iranians may instead go for the kind of asymmetric warfare they excel at. The UK could be in the firing line too. We could see Iranian terrorist attacks here in Britain. One way or another, this is almost certain to escalate, but could it widen and draw other countries into the conflict? Russia and Iran have a strategic partnership agreement, but it doesn't require Russia to come to Tehran's support. Iran is also China's closest ally in the Middle East, but Beijing is also likely to sit this one out and watch from the sidelines. Wars have unintended consequences, but there are strong reasons for other powers to avoid becoming involved in this one. Read more:What we know about US strikes on Iran's nuclear facilitiesIran may still have ability to make nuclear bomb Looking further ahead, there are two competing priorities to watch. For Iran's leadership, it is all about survival, to absorb the blows and live to fight another day, and eventually build the bomb if it can, to stop this ever happening to them again. And Israel is equally determined that will not happen. One method would be regime change in Iran, but its leadership is proving resilient so far, despite the mounting challenges it faces. Instead, Israel faces a long period of managing the threat posed by Iran. It will need to monitor the Iranians, watching for signs they are developing their missile programme, meddling in the region or reviving their nuclear project, and cut them down to size when necessary. That could mean years more of military action and could be hugely costly for Israel and its backers, the US taxpayers. In summary, Iran's leadership is in a very tight spot and is likely to lash out, but the future will not be a walk in the park for Israel, either, while there are big risks for America, too."
    },
    {
        "title": "Isfahan, Natanz and Fordow: What we know about Operation Midnight Hammer as US strikes Iran's nuclear facilities",
        "description": "Details are emerging about the US strikes against Iran's nuclear facilities.",
        "url": "https://news.sky.com/story/isfahan-natanz-and-fordow-what-we-know-about-the-us-strikes-on-irans-nuclear-facilities-13386916",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-operation-midnight-hammer_6948134.jpg?20250622172817",
        "type": "Home",
        "Author": "Michael Drummond",
        "Date Published": "2025-06-22 01:32:00",
        "Headline": "Details are emerging about the US strikes on three key nuclear sites inside Iran. Here's what we know so far.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n  Details are emerging about the US strikes against Iran's nuclear facilities. The US military has provided details about which sites have been hit and what military elements have been used, as President Donald Trump hailed the attack on social media. From the number of bunker buster bombs dropped to where they hit, here's what we know so far. Follow latest: US bombers strike three Iranian nuclear sites How did 'Operation Midnight Hammer' unfold? The US's most senior military official gave details of how the attack, named Operation Midnight Hammer, unfolded. General Dan Caine, chairman of the US joint chiefs of staff, said that at midnight on Friday, a large \"B-2 strike package of bombers\" launched from the US, flying east across the Atlantic. \n                  Bonus episode: Trump bombs Iran\n                 \n                  The Americans want the attack on Iran's nuclear sites to be a 'one-and-done'\n                 \n                  Iranian threat to UK could increase after US strikes, says cabinet minister\n                 To maintain the element of surprise, some other bombers flew west into the Pacific. During the 18-hour flight, the planes underwent multiple rounds of refuelling. As the seven B-2 bombers entered Iran, the US deployed \"several decoys\", according to Gen Caine, and a US submarine launched more than two dozen Tomahawk cruise missiles at the Isfahan nuclear site. At around 6.40pm EST on Saturday, the first B-2 bomber dropped two GBU 57 Massive Ordnance Penetrator weapons, known as bunker buster bombs, on Fordow. \"The remaining bombers then hit their targets,\" said Gen Caine, with 14 GBU-57s dropped in total. Bunker buster bombs are designed to explode twice. Once to breach the ground surface, and again, once the bomb has burrowed down to a certain depth.  Israel has bunker busters in its arsenal but does not have the much more powerful GBU-57, which can only be launched from the B-2 bomber and was believed to be the only bomb capable of breaching Fordow. This attack was the GBU-57s' first operational use. More than 75 weapons were used in total, including 14 30,000lb GBU-57 bunker buster bombs, and 125 aircraft took part. The New York Times reported a US official as saying a B-2 also dropped two of the GBU-57s on the Natanz nuclear site. The B-2s were all heading back towards the US by 7.05pm (EST), Gen Caine added, and he said the US military were not aware of any shots fired at the American jets by Iranian aircraft or air defences on the ground.  Which sites were hit? America says it has hit the three key locations in Iran's nuclear programme. They include Isfahan, the location of a significant research base, as well as uranium enrichment facilities at Natanz and Fordow. Read more: Fordow: What we know about Iran's secretive 'nuclear mountain' Natanz was believed to have been previously damaged in Israeli strikes after bombs disrupted power to the centrifuge hall, possibly destroying the machines indirectly. Details about the damage in the US strikes are not yet known, although Mr Trump said the three sites had been \"obliterated\". The US secretary of defence Pete Hegseth said the US had \"devastated the Iranian nuclear programme\". However, most of the highly enriched uranium at the Fordow nuclear facility was moved to an undisclosed location ahead of the attack, a senior Iranian source told the Reuters news agency. Personnel numbers were also reduced at the site, according to the report. Satellite images from Fordow show cargo trucks lining up at the entrance of the nuclear site in recent days. How has Iran responded so far? Iran's foreign minister Abbas Araghchi warned that the US strikes \"will have everlasting consequences\", adding that his country \"reserves all options\" to retaliate. \"The events this morning are outrageous and will have everlasting consequences,\" Mr Araghchi wrote on X. \"Each and every member of the UN must be alarmed over this extremely dangerous, lawless and criminal behaviour.\"  Iran has requested an emergency meeting of the UN Security Council to \"maintain international peace and condemn the US strikes\", according to state media. Read more:What happens next is largely in Iran's control Multiple places in Israel have been hit by Iranian missiles in response. Several explosions have been heard over Tel Aviv with Israeli media saying missiles have hit northern and central Israel, including in Haifa, Ness Ziona, Rishon LeZion and Tel Aviv.  Sixteen casualties were reported by the country's emergency services. Abbas Golroo, head of the Iranian parliament's foreign policy committee, also said in a statement on social media Iran could pull out of efforts to limit the spread of nuclear technology and weapons, called the Treaty on the Non-Proliferation of Nuclear Weapons (NPT). He cited Article 10 of the treaty, which states that an NPT member has \"the right to withdraw from the treaty if it decides that extraordinary events have jeopardised the supreme interests of its country\"."
    },
    {
        "title": "Five reasons why we may not see anything more than rhetoric from Russia after US attacks Iran",
        "description": "On the surface, at least, Moscow is fuming.",
        "url": "https://news.sky.com/story/five-reasons-why-we-may-not-see-anything-more-than-rhetoric-from-russia-after-us-attacks-iran-13387152",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-abbas-araghchi-sergei-lavrov_6948143.jpg?20250622174743",
        "type": "Home",
        "Author": "Ivor Bennett",
        "Date Published": "2025-06-22 16:24:00",
        "Headline": "Iran has been a vital ally to Moscow in recent years, selling it weapons for its war in Ukraine, and the two nations signed a strategic partnership deal in January. But the response to the US strikes so far from Moscow feels more show than substance.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n On the surface, at least, Moscow is fuming. Russia's foreign ministry said it \"strongly condemns\" the US airstrikes on Iran, which it labelled a \"dangerous escalation\". Dmitry Medvedev, the deputy chairman of Russia's powerful security council, accused Donald Trump of starting \"a new war\", and others have called for Moscow to step in. \"It's time for us to help Tehran,\" said Konstantin Malofeyev, a sanctioned Russian businessman who is close to Vladimir Putin. But this was to be expected. Israel-Iran live: 'Incredible success' of US strikes on Iran hailed by Hegseth Iran has been a vital ally in recent years, selling weapons to Russia for its war in Ukraine, and the two nations signed a strategic partnership deal in January. So a robust verbal riposte was predictable. \n                  Bonus episode: Trump bombs Iran\n                 \n                  The Americans want the attack on Iran's nuclear sites to be a 'one-and-done'\n                 \n                  Iranian threat to UK could increase after US strikes, says cabinet minister\n                 But the response so far feels more show than substance and if things don't escalate further, I doubt we'll see anything more than rhetoric from Russia.  There are several reasons why. Firstly, the strategic partnership deal doesn't contain a mutual defence clause. The pact does seek to deepen their defence cooperation, but neither country is obliged to provide military support to the other in the event of an attack. Secondly, if Moscow did want to join the conflict or even supply weapons to Tehran, it would be hard pushed to. Resources are focused on the war in Ukraine. Thirdly, Russia doesn't want to damage its warming relations with the US. Any kind of aid to Iran would likely jeopardise the tentative rapprochement. Fourthly, the Israel-Iran conflict is a helpful distraction from the Kremlin's war against Ukraine. With all eyes on the Middle East, any pressure there was from Washington on Moscow to reach a peace deal seems to have evaporated. Lastly, it's not Vladimir Putin who's spoken out, but the usual attack dogs.  Dmitry Medvedev, for example, is a senior figure but his fiery rhetoric is generally considered to be part of a Kremlin comms strategy rather than actual policy expression. Having said all that, though, Russia won't want the situation to escalate any further. Its regional influence took a battering when the Assad regime in Syria was toppled in December, and that influence would practically disappear if another Moscow-friendly regime in Iran were to fall. Read more:What we know about US strikes on Iran's nuclear facilitiesAnalysis: Has Iran lost its ability to make a nuclear bomb So for now, the Kremlin is frantically trying to find a diplomatic solution. Last week, Vladimir Putin held conversations with the leaders of Israel, Iran, America, China and the UAE, and those efforts continue on Monday when he'll meet Iran's foreign minister Abbas Araghchi in Moscow. If the reports are true - that the US forewarned Tehran of the bombings and signalled they'd be a one-off - there's a good chance Moscow had prior knowledge too. Either way, Vladimir Putin's aim here is to play peacemaker, and to turn the situation to his advantage. If he can persuade Mr Araghchi to limit Iran's response to a symbolic one, and to then return to the negotiating table with America, he will have Donald Trump in his debt. The obvious place he'd want that repaid is Ukraine, in the form of withdrawing US support."
    },
    {
        "title": "UK and NATO allies agree to boost spending on defence and related areas to 5% of GDP by 2035",
        "description": "The UK and its NATO allies have agreed to increase spending on defence and related areas to 5% of GDP by 2035, two diplomatic sources with knowledge of the deal have told Sky News.",
        "url": "https://news.sky.com/story/uk-and-nato-allies-agree-to-boost-spending-on-defence-and-related-areas-to-5-of-gdp-by-2035-13387196",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nato-uk_6948212.jpg?20250622202459",
        "type": "Home",
        "Author": "Katy Scholes, security and defence producer, and Deborah Haynes, security and defence editor",
        "Date Published": "2025-06-22 18:50:00",
        "Headline": "Ambassadors of all 32 alliance member states signed off on the new spending pledge ahead of a major summit of leaders, including Donald Trump, this week, they said.",
        "Content": "By Katy Scholes, security and defence producer, and Deborah Haynes, security and defence editor  The UK and its NATO allies have agreed to increase spending on defence and related areas to 5% of GDP by 2035, two diplomatic sources with knowledge of the deal have told Sky News. Ambassadors of all 32 alliance member states signed off on the new spending pledge ahead of a major summit of leaders, including Donald Trump, this week, they said. However, Spain's prime minister later signalled that his country - which has been resisting the push by allies to expand its already underperforming defence budget to such a level - did not need to comply. This could become a point of friction with the US president who has repeatedly warned that he would not defend a member state that is not in his eyes paying its fair share. The boost - up from a current goal of 2% of GDP - is as much about keeping the US president onside as it is about responding to what is regarded by the allies as a growing threat from Vladimir Putin and the challenge posed by China. The target will be formally rubber stamped when the heads of state and government meet in The Hague on Tuesday and Wednesday. The ambitious spending goal - secured following a huge amount of persuasion by Mark Rutte, the NATO secretary general - is broken down into 3.5% of GDP spent on pure defence and 1.5% of GDP spence on related areas, which can include infrastructure and cyber security. \n                  'Stability in Middle East is priority,' says Starmer - as world reacts to strikes\n                 \n                  UK weather: 'Fresher' conditions for much of country after hottest day of year so far\n                 \n                  Festival season is here, but does politics have a place on the stage?\n                 Spain remains a potential problem for alliance unity though. Pedro Sanchez, the Spanish prime minister, last week said he would not commit to the 5% figure. It prompted efforts to find a compromise in the wording of the agreement that will be endorsed at the summit, according to the Reuters news agency. It reported that the language around the spending pledge had been tweaked from \"we commit\" to \"allies commit\", allowing Madrid to say the commitment does not apply to all members. Mr Sanchez, speaking on Spanish television on Sunday evening, said Spain would not have to achieve the new target as it would only have to spent 2.1% of GDP to meet NATO's core military requirements. \"We fully respect the legitimate desire of other countries to increase their defence investment, but we are not going to do so,\" he said. Spain allocated a mere 1.24% of its GDP to defence last year - and is one of the lowest defence spenders in the alliance as a ratio of GDP. The UK, like Spain, had also dragged its feet with agreeing to the new funding goal. Unlike Madrid, though, London portrays itself as a leading member of the alliance. Officials inside the Ministry of Defence had been scratching their heads in bemusement at the lack of clarity from Sir Keir Starmer over future increases to the UK defence budget, given the obvious direction of travel for the majority of NATO allies. The 2035 timeframe is something the British side has specifically been pushing for as it would mean only being reached after the next parliament. The prime minister has said he has an ambition to increase UK defence spending to 3% of GDP from 2.3% by 2034. The new 5% spending goal is the kind of level of defence spending invested by NATO allies during the Cold War."
    },
    {
        "title": "Iranian nuclear sites sustained 'extremely severe damage' after US strikes, Pentagon says",
        "description": "Iranian nuclear sites sustained \"extremely severe damage and destruction\" in air strikes, the US has said - a stance mostly supported by the UN's nuclear watchdog.",
        "url": "https://news.sky.com/story/iranian-nuclear-sites-sustained-extremely-severe-damage-us-says-13387146",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-maxar-fordow-iran_6948029.jpg?20250622140852",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-22 16:19:00",
        "Headline": "The US defence secretary says an initial assessment suggests \"all of our precision munitions struck where we wanted them to strike and had the desired effect\" after American forces launched Operation Midnight Hammer, involving seven B-2 stealth jets dropping 14 bunker busting bombs.",
        "Content": "Iranian nuclear sites sustained \"extremely severe damage and destruction\" in air strikes, the US has said - a stance mostly supported by the UN's nuclear watchdog. General Dan Caine, chairman of America's joint chiefs of staff, told reporters that the destruction wrought by Operation Midnight Hammer will take \"some time\" to assess. But he added that \"initial battle damage assessments indicate that all three sites sustained extremely severe damage and destruction\". The sites are Fordow, Natanz and Isfahan. Fordow is a secretive nuclear facility buried about 80m below a mountain and one of two key uranium enrichment plants in Iran, along with Natanz. Isfahan features a large nuclear technology centre and enriched uranium is also stored there, diplomats say. At Fordow, satellite images taken after the attack show holes in the mountain in which the nuclear site was situated. Follow latest: US bombers strike three Iranian nuclear sites Images of Natanz, which is also suspected of having an underground facility, appear to show a new hole in a rocky area. Pete Hegseth, the US defence secretary, said the initial assessment was that \"all of our precision munitions struck where we wanted them to strike and had the desired effect\". \"Which means, especially in Fordow, which was the primary target here, we believe we achieved destruction of capabilities there,\" he added. America's attack brings the US into direct involvement in the war between Israel and Iran, which started on 13 June. It prompted threats of reprisals from Tehran, raising fears of a wider regional conflict. Rafael Grossi, head of the International Atomic Energy Agency (IAEA), said the facility at Natanz had been \"completely destroyed\", while its underground halls \"suffered a lot\" because of cuts to electricity as the result of Israeli attacks. He also told CNN that the Isfahan site had suffered \"very significant damage\". At Fordow, which is deep underground, he said it was difficult to know how much damage had been done. Satellite images appear to show major damage at Isfahan. Natanz was believed to have possibly already suffered extensive damage in Israel's strikes earlier this week. Fourteen bunker buster bombs were used in the attacks on Fordow and Natanz, and numerous Tomahawk cruise missiles were also used in the operation, which involved seven B-2 stealth bombers and was described by Donald Trump as \"very successful\". Read more:What we know about Operation Midnight Hammer as US strikes Iran's nuclear facilities However, a senior Iranian source told the Reuters news agency that most of the highly enriched uranium at Fordow was moved to an undisclosed location ahead of the attacks. Personnel numbers were said to have been cut, too. The IAEA said there had been \"no increase in off-site radiation levels\" after the strikes. Donald Trump said no further attacks were planned and he hoped diplomacy would take over.  Fears of a wider conflict Iran's foreign minister, Abbas Araghchi, warned that the US strikes \"will have everlasting consequences\", adding that his country \"reserves all options\" to retaliate. Mr Hegseth said the United States \"does not seek war\" but would \"act swiftly and decisively when our people, our partners, or our interests are threatened\". Iran has repeatedly denied it is seeking a nuclear weapon, and Mr Grossi said this month the IAEA had no proof of a \"systematic effort to move into a nuclear weapon\". However, the IAEA said last month that Iran had amassed 408.6kg of uranium enriched up to 60% - a short, technical step away from weapons-grade levels of 90%. Since the war broke out more than a week ago, Iranian authorities say more than 400 people have been killed since Israel's bombardment began, mostly civilians. Israel has taken out much of Iran's military leadership with attacks targeting air defences and military bases. Iran has been launching missiles back at Israel, and at least 24 people have been killed over the past nine days. US Senator Chris Murphy, posting on X after the US strikes, said he and other senators received a classified briefing last week indicating that Iran did not pose an immediate threat through its nuclear programme. \"Iran was not close to building a deliverable nuclear weapon,\" Senator Murphy said. \"The negotiations Israel scuttled with their strikes held the potential for success.\"  'Consultations' with Vladimir Putin The Iranian foreign minister told journalists on Sunday morning that he was flying to Moscow to have \"serious consultations\" with Vladimir Putin. He described Moscow as a \"friend of Iran\", adding: \"We always consult with each other.\" Read more:We may see nothing more than rhetoric from Russia Iran's Revolutionary Guard Corps (IRGC) said that \"invaders must now await responses that will bring regret\" after the US strikes. Gulf states like Bahrain, Saudi Arabia and Kuwait, all home to US military bases, are on high alert after the strikes, with Bahrain urging drivers to avoid main roads and Kuwait setting up shelters. The UK has also further increased \"force protection\" measures for its military bases and personnel in the Middle East to their highest level. Iran has requested an emergency meeting of the UN Security Council to \"maintain international peace and condemn the US strikes\", according to state media.  'Bold decision' Israeli Prime Minister Benjamin Netanyahu hailed the \"bold decision\" by Mr Trump, saying it would \"change history\". The IRGC said it had launched 40 missiles at Israel on Sunday morning, including its biggest ballistic missile, the Khorramshahr-4. Iranian missiles hit sites in northern and central Israel, including in Haifa, Ness Ziona, Rishon LeZion and Tel Aviv. The UK is preparing to fly British nationals out of Israel. Read more:Iran may not have lost its ability to make a nuclear bombIran may decide that killing Americans is the best way to retaliate Nuclear negotiations 'blown up' The UK's prime minister called on Iran to \"return to the negotiating table\" and reach \"a diplomatic solution to end this crisis\". \"Iran's nuclear programme is a grave threat to international security. Iran can never be allowed to develop a nuclear weapon and the US has taken action to alleviate that threat,\" said Sir Keir Starmer. However, Mr Araghchi said the US and Israel had \"blown up\" negotiations and asked: \"How can Iran return to something it never left, let alone blew up?\""
    },
    {
        "title": "Iran has little choice but to retaliate against US - as Russia faces urgent decision on how to back Tehran",
        "description": "Donald Trump's decision to attack Iran could trigger a wider regional or even global war, but much will hinge on how Russia and China - Tehran's most powerful allies - respond.",
        "url": "https://news.sky.com/story/iran-has-little-choice-but-to-retaliate-against-us-as-russia-faces-urgent-decision-on-how-to-back-tehran-13387090",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-putin-russia-iran_6948079.jpg?20250622160507",
        "type": "Home",
        "Author": "Deborah Haynes",
        "Date Published": "2025-06-22 13:27:00",
        "Headline": "Russia, China, Iran, and North Korea are regarded by Western allies as a new axis of authoritarian powers, increasingly aligned and supportive of each other.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  Donald Trump's decision to attack Iran could trigger a wider regional or even global war, but much will hinge on how Russia and China - Tehran's most powerful allies - respond. Abbas Araghchi, the Iranian foreign minister, said he will hold \"serious consultations\" with Vladimir Putin on Monday morning in Moscow. His country is also in contact with Beijing. Israel-Iran live: 'Incredible success' of US strikes on Iran hailed by Hegseth Russia, China, Iran, and North Korea are regarded by Western allies as a new axis of authoritarian powers, increasingly aligned and supportive of each other. Donald Trump, though, has broken ranks from his country's traditional democratic partners to forge a closer relationship with Mr Putin than any other US leader in recent years. How much that might affect the Kremlin's calculations, as Moscow weighs up how to respond to his actions in Iran, adds a new layer of unpredictability to the crisis. \n                  Bonus episode: Trump bombs Iran\n                 \n                  The Americans want the attack on Iran's nuclear sites to be a 'one-and-done'\n                 \n                  Iranian threat to UK could increase after US strikes, says cabinet minister\n                  Another limiting factor is the Russian military's physical capacity - should it wish - to bolster Iran with military support given its war in Ukraine. Unlike the NATO alliance, there is no formal agreement between Moscow, Beijing, Tehran, and Pyongyang to come to each other's assistance in a crisis. However, the weakening of one member of the quartet would impact on the vital national interests of the other three, making it mutually beneficial to help each other out - including with military force or at the very least by supplying weapons.  Iran has little choice but to retaliate directly against the United States after three of its main nuclear facilities were struck overnight. But its ability to launch ballistic missiles and drones has been severely degraded by waves of Israeli strikes since Prime Minister Benjamin Netanyahu went to war with Iran a week and a half ago. Read more:What we know about US strikes on Iran's nuclear facilitiesAnalysis: Has Iran lost its ability to make a nuclear bomb What are Iran's options? US bases, warships, and aircraft across the region are well within range of Iranian missiles and drones, but the Pentagon has significantly strengthened its air defences in anticipation of an Iranian counterattack. There are plenty of softer targets, though, such as American embassies or other diplomatic missions.  Iran could also choose to mine the Strait of Hormuz - a move that would have global ramifications by disrupting the flow of large amounts of oil and gas, as well as other trade. In addition, the military assets of American allies could be viewed as legitimate targets. The UK has said it played no part in the US attack. But Britain's Ministry of Defence has further increased \"force protection\" measures for its military bases and personnel in the Middle East to their highest level in the wake of the US strikes, it is understood.  What was hit in US attack? In an operation that has been in the planning for years, American B-2 stealth bombers dropped enormous bunker-busting bombs - the GBU-57 Massive Ordnance Penetrator - on the Fordow nuclear fuel enrichment plant, around 70 miles (110km) southwest of Tehran. It was built under a mountain - about 80 to 90 metres beneath the ground - to be beyond the reach of Israel's armed forces. Only the US Air Force carries munitions large enough to penetrate the rock, earth and concrete to inflict meaningful damage. Also targeted with the enormous munitions was Iran's main uranium enrichment facility at Natanz, 155 miles (250km) southeast of the Iranian capital. In addition, US submarines launched TLAM cruise missiles against a site outside the city of Isfahan, which is 260 miles (420km) south of Tehran. Near-bomb-grade nuclear fuel is thought to be stored here.  The International Atomic Energy Agency (IAEA), the UN's nuclear watchdog, however, said the six buildings at Isfahan that were hit contained little or no nuclear material. Mr Trump has said he ordered the attack to destroy Iran's ability to enrich uranium to a level that could be used to make a nuclear bomb. Tehran has always insisted its nuclear programme is purely for civilian purposes. Analysts warn, though, that it would be very difficult to stop the Iranian nuclear programme through military action alone and that such a move may spur Iran to accelerate efforts to make a bomb if it has managed to protect key components. The Russian foreign ministry on Sunday strongly condemned the American strikes against Iranian nuclear sites as a \"dangerous escalation\" that could further undermine \"regional and global security\". \"The risk of an escalation of conflict in the Middle East already beset by multiple crises, has increased significantly,\" it said in a statement. Last week, the Russian government warned the US against joining Israel's war in Iran, saying this \"would be an extremely dangerous step with truly unpredictable negative consequences\". The remarks came after Mr Putin held a call with his Chinese counterpart, Xi Jinping. It means the Russian government in particular - given Tehran's military support to Moscow in the Russian invasion of Ukraine - faces an urgent decision about how to support Ali Khamenei, Iran's supreme leader, whose very existence is under threat from Israel."
    },
    {
        "title": "'Stability in Middle East is priority,' says Starmer - as world reacts to strikes",
        "description": "Sir Keir Starmer has said stability in the Middle East is \"a priority\" following US strikes on Iran's nuclear facilities, as the world reacted to the attack.",
        "url": "https://news.sky.com/story/stability-in-middle-east-is-priority-says-starmer-as-he-calls-on-iran-to-return-to-negotiating-table-13386950",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-downing-street_6947814.jpg?20250622074237",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-22 06:32:00",
        "Headline": "The US struck three sites in Iran, with Donald Trump boasting the country's key nuclear sites were \"completely and fully obliterated\" in an address to the nation from the White House.",
        "Content": " Sir Keir Starmer has said stability in the Middle East is \"a priority\" following US strikes on Iran's nuclear facilities, as the world reacted to the attack. The prime minister also called on Iran to \"return to the negotiating table\" to \"reach a diplomatic solution to end this crisis\". He later told Sky News' political editor, Beth Rigby, that his focus was on \"de-escalating\", as there was a \"risk of escalation\" to the Middle East, and beyond. The US struck three sites in Iran early on Sunday morning, with Donald Trump boasting the country's key nuclear sites were \"completely and fully obliterated\" in an address to the nation from the White House. He warned there could be further strikes if Iran retaliates. Follow latest: Iran considering 'all options' after US strikes  In a statement, Sir Keir said: \"Iran's nuclear programme is a grave threat to international security. Iran can never be allowed to develop a nuclear weapon, and the US has taken action to alleviate that threat. \"The situation in the Middle East remains volatile and stability in the region is a priority. We call on Iran to return to the negotiating table and reach a diplomatic solution to end this crisis.\" He said the UK was not involved in the attack but was informed about them in advance. Later, speaking to Rigby, who was interviewing the prime minister on behalf of all broadcasters, he said: \"That's a risk to the region. \"It's a risk beyond the region, and that's why all our focus has been on de-escalating, getting people back around to negotiate what is a very real threat in relation to the nuclear programme.\" The prime minister will chair a meeting of the government's COBRA crisis committee on Sunday afternoon. Read more:What we know so far about US strikesWhat happens next is largely in Iran's control  Netanyahu praises Trump Israel's Prime Minister Benjamin Netanyahu praised Mr Trump for the strikes, saying: \"Your bold decision to target Iran's nuclear facilities with the awesome and righteous might of the United States will change history. \"History will record that President Trump acted to deny the world's most dangerous regime the world's most dangerous weapons.\"  UN secretary-general 'gravely alarmed' by US attack But UN secretary general Antonio Guterres said he was \"gravely alarmed by the use of force\" by the US against Iran. \"This is a dangerous escalation in a region already on the edge - and a direct threat to international peace and security. There is a growing risk that this conflict could rapidly get out of control - with catastrophic consequences for civilians, the region, and the world.\" European Union foreign policy chief Kaja Kallas urged all sides to step back and return to the negotiating table. \"Iran must not be allowed to develop a nuclear weapon,\" she said in a post on X. \"I urge all sides to step back, return to the negotiating table and prevent further escalation,\" she said, adding that EU foreign ministers will discuss the situation tomorrow. How the world reacted to the strikes World leaders reacted to the strikes with calls for diplomacy and de-escalation, with some fearing they could push the region towards a wider conflict. Russia's former president and current deputy chair of its security council, Dmitry Medvedev, said on the Telegram messaging app: \"Trump, who came in as a peacemaker president, has started a new war for the US.\" China strongly condemned the attack, with its foreign ministry saying the move seriously violates the UN charter and worsens tensions in the Middle East. It urged the parties involved to cease attacks as soon as possible and begin negotiations. German Chancellor Friedrich Merz urged Iran to enter immediate talks with the US and Israel to find a diplomatic solution to the conflict, a government spokesperson said. France urged all sides to show restraint, with its foreign minister Jean-Noel Barrot saying Paris is \"convinced that a lasting resolution to this issue requires a negotiated solution within the framework of the Non-Proliferation Treaty\". Italy's foreign minister Antonio Tajani said after the attack that his country's government hopes \"a de-escalation can begin and Iran can sit down at the negotiating table\". Cuba's President Miguel Diaz-Canel said on X: \"We strongly condemn the US bombing of Iran's nuclear facilities, which constitutes a dangerous escalation of the conflict in the Middle East. The aggression seriously violates the UN Charter and international law and plunges humanity into a crisis with irreversible consequences.\" Venezuela's foreign minister Yvan Gil said his country's government \"condemns US military aggression\" and \"demands an immediate cessation of hostilities\". NATO member Turkey said the strikes raised the risk of a regional conflict spreading globally, with the foreign ministry saying the spread of the conflict into a wider global war must not be allowed. The Iraqi government condemned the strikes, saying they create a grave threat to peace and security in the Middle East. Saudi Arabia expressed \"deep concern\" but stopped short of condemning the attack. Both Hamas in Gaza and the Houthis in Yemen - part of Iran's so-called Axis of Resistance - condemned the strikes, with the Houthis vowing to support Iran in its fight against \"the Zionist and American aggression\". Lebanon's Prime Minister Nawaf Salam said his country needs to stay away from any possible regional spillover from the conflict. Qatar said it \"regrets\" the escalating tensions and its foreign ministry urged all parties to show restraint and \"avoid escalation, which the peoples of the region, burdened by conflicts and their tragic humanitarian repercussions, cannot tolerate\". The United Arab Emirates called for an immediate halt to the escalation to \"avoid serious repercussions\" in the region, with its foreign ministry warning they could lead the region to \"new levels of instability\". Oman condemned the strikes, with a spokesperson for its foreign ministry warning they threaten \"to expand the scope of the conflict and constitute a serious violation of international law and the United Nations charter\". Pakistan condemned the strikes as a \"deeply disturbing\" escalation days after it nominated Mr Trump for the Nobel Peace Prize for his diplomatic intervention in the India-Pakistan crisis. Pope Leo appealed for peace during his Sunday Angelus prayer in St Peter's Square, calling for international diplomacy to \"silence the weapons\". Referring to the \"alarming\" situation in Iran, he urged every member of the international community to take up their moral responsibility to \"stop the tragedy of war before it becomes an irreparable abyss\". Maryam Rajavi, the head of Iranian opposition group National Council of Resistance of Iran, said from Paris: \"Now [Supreme Leader] Khamenei must go. The Iranian people welcome the end of the war and seek peace and freedom. \"Khamenei is responsible for an unpatriotic project that, in addition to costing countless lives, has cost the Iranian people at least $2trn (£1.5trn) - and now, it has all gone up in smoke.\""
    },
    {
        "title": "UK weather: 'Fresher' conditions for much of country after hottest day of year so far",
        "description": "Much of the UK had cooler temperatures on Sunday with \"fresher\" conditions - apart from the South East - after thunderstorms swept through parts of the country overnight.",
        "url": "https://news.sky.com/story/uk-weather-fresher-conditions-for-much-of-country-after-hottest-day-of-year-so-far-13387121",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-storm-clouds-weather_6948099.jpg?20250622164159",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-22 15:21:00",
        "Headline": "A yellow thunderstorm warning lasted until 3am for areas including northern England and southeast Scotland. Some parts had up to 25mm of rainfall in one hour.",
        "Content": "Much of the UK had cooler temperatures on Sunday with \"fresher\" conditions - apart from the South East - after thunderstorms swept through parts of the country overnight. A yellow thunderstorm warning issued by the Met Office lasted until 3am for areas including northern England and southeast Scotland. Some parts had up to 25mm of rainfall in one hour, the weather agency said. Berwick-upon-Tweed in Northumberland saw 31.1mm overnight and was among the locations that saw the wettest conditions. See the weather forecast in your area It comes after the UK had the hottest day of the year so far, with 33.2C (91.7F) recorded in Charlwood, Surrey, on Saturday.  Scores of rail passengers were evacuated after some services were halted following a fault on a train. \n                  Thousands watch summer solstice sunrise at Stonehenge - on the hottest day of year\n                 \n                  UK weather: Yellow warning for thunderstorms as heatwave intensifies\n                 \n                  UK weather: Amber heat health alert issued across England as hottest day of the year recorded\n                 Some parts of the country have experienced a heatwave over the past few days but temperatures are now closer to average for the time of year. However, Met Office meteorologist Marco Petagna said temperatures could hit 27C or 28C in the South East on England on Sunday. He added: \"Elsewhere, there's a fresher feel, quite breezy as well, so most places, high teens, low 20s for temperatures, and it stays quite showery tonight. \"Even the South East could get a few showers coming in from the west, so a mixture really of clear spells and showers tonight. \"It could turn a bit chilly in Scotland, down to 3 or 4 degrees in some rural spots, but for most places, temperatures, certainly towns and cities, generally holding up in double figures, but a fresher feel compared to what we've had recent nights.\" What's the forecast for Monday? The South East will see the most sunshine and highs of up to 25C on Monday, Mr Petagna said. In the other regions, temperatures will be around the high teens and low 20s, which is \"near-average\" for the time of year, he added. Conditions look \"changeable\" into next week, with \"most areas\" having rain at times, the forecaster said. \"It does become very warm again in the South East around the middle of the week, so we could see high 20s again around Tuesday, Wednesday in the South East. \"But at the same time as that heat builds again briefly in the south and South East, we could see further thundery downpours for a time as well,\" he said. What is a heatwave? An official heatwave is recorded when areas reach a certain temperature for three consecutive days, with thresholds varying from 25C to 28C in different parts of the UK."
    },
    {
        "title": "An Iranian attack on US military bases could draw the UK into the conflict",
        "description": "When I got to Chequers on Sunday morning the prime minister had clearly been up for most of the night and hitting the phones all morning with calls to fellow leaders in Europe and the Middle East as he and others scrambled to try to contain a very dangerous situation.&#160;",
        "url": "https://news.sky.com/story/an-iranian-attack-on-us-military-bases-could-draw-the-uk-into-the-conflict-13387191",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-keir-starmer_6948194.jpg?20250622195001",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-06-22 18:32:00",
        "Headline": "An attack on one NATO member is an attack on them all, meaning the British government may have no choice about potential involvement.",
        "Content": "\n          Political editor\n              @BethRigby\n  When I got to Chequers on Sunday morning the prime minister had clearly been up for most of the night and hitting the phones all morning with calls to fellow leaders in Europe and the Middle East as he and others scrambled to try to contain a very dangerous situation.  His primary message on Sunday was to try to reassure the public that the UK government was working to stabilise the region as best it could and press for a return to diplomacy. But what struck me in our short interview was not what he did say but what he didn't - what he couldn't - say about the US strikes. It was clear from his swerve on the question of whether the UK supported the strikes that the prime minister neither wanted to endorse US strikes nor overtly criticise President Trump. Instead, his was a form of words - repeated later in a joint statement of the E3 (the UK, Germany and France) to acknowledge the US strikes and reiterate where they can agree: the need to prevent Iran having a nuclear weapon. He also didn't want to engage in the very obvious observation that President Trump simply isn't listening to Sir Keir Starmer or other allies, who had been very publicly pressing for de-escalation all week, from the G7 summit in Canada to this weekend as European countries convened talks in Geneva with Iran.  It was only five days ago that the prime minister told me he didn't think a US attack was imminent when I asked him what was going on following President Trump's abrupt decision to quit the G7 early and convene his security council at the White House. When I asked him if he felt foolish or frustrated that Trump had done that and didn't seem to be listening, he told me it was a \"fast moving situation\" with a \"huge amount of discussions in the days since the G7\" and said he was intensely pressing his consistent position of de-escalation. What else really could he say? He has calculated that criticising Trump goes against UK interests and has no other option but to press for a diplomatic solution and work with other leaders to achieve that aim.  Before these strikes, Tehran was clear it would not enter negotiations until Israel stopped firing missiles into Iran - something Israel is still saying on Sunday evening it is not prepared to do. The US has been briefing that one of the reasons it took action was because it did not think the Iranians were taking the talks convened by the Europeans in Geneva seriously enough. It is hard now to see how these strikes will not serve but to deepen the conflict in the Middle East and the mood in government is bleak. Iran will probably conclude that continuing to strike only Israel in light of the US attacks - the first airstrikes ever by the US on Iran - is a response that will make the regime seem weak.  Read more:Iran may not have lost its ability to make a nuclear bombIran may decide that killing Americans is the best way to retaliate But escalation could draw the UK into a wider conflict it does not want. If Iran struck US assets, it could trigger article five of NATO (an attack on one is an attack on all) and draw the UK into military action. If Iran chose to attack the US via proxies, then UK bases and assets could be under threat. The prime minister was at pains to stress on Sunday that the UK had not been involved in these strikes. Meanwhile, the UK-controlled airbase on Diego Garcia was not used to launch the US attacks, with B-2 bombers deployed from Guam instead. There was no request to use the Diego Garcia base, the president moving unilaterally, underlining his disinterest in what the UK has to say. The world is waiting nervously to see how Iran might respond, as the PM moves more military assets to the region while simultaneously hitting the phones. The prime minister may be deeply opposed to this war, but stopping it is not in his gift."
    },
    {
        "title": "Seven charged after protest outside Iranian embassy in London",
        "description": "Seven men have been charged after two people were injured during a protest outside the Iranian embassy in west London.",
        "url": "https://news.sky.com/story/seven-charged-after-protest-outside-iranian-embassy-in-london-13387000",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-iranian-embassy-london_6946706.jpg?20250622113206",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-22 08:40:00",
        "Headline": "Police officers responded to reports of a fight in Knightsbridge on Friday, with two men being taken to hospital.",
        "Content": "Seven men have been charged after two people were injured during a protest outside the Iranian embassy in west London. The Metropolitan Police said officers responded to reports of a fight in Knightsbridge shortly after 9.50am on Friday. Two men involved in an altercation outside the embassy in Prince's Gate, which borders Hyde Park, were taken to hospital. The men, aged 37 and 39, sustained serious but not life-threatening injuries. Eight men were arrested in connection with the incident, including the injured 39-year-old. Read more:Iran responds after US strikes on nuclear sites'Stability in Middle East is priority,' says Starmer - as world reacts Seven of them were charged with causing grievous bodily harm with intent, a spokesperson for the force said. The men, who are all Iranian nationals, have been remanded into custody to appear at Westminster Magistrates' Court on Monday. Those charged are: Mohammad Nadiri, 30, of Islington; Pourrezaei Vahid, 41, of Cricklewood; Armin Hasanlov, 35, of Liverpool; Esmaeil Balouchy, 50, of Brentford; Saeed Hosseingholipoor, 34, of Mitcham; Farzin Suleimani, 31, of Birmingham; Aref Yazdan Parast, 31, of Isleworth. The Metropolitan Police previously said the incident is thought to have involved both \"pro and anti-Iranian\" government protesters. The force imposed conditions to stop protesters from gathering in the area until 1pm on Sunday."
    },
    {
        "title": "Iranian threat to UK could increase after US strikes, says cabinet minister",
        "description": "The threat to the UK from Iran is already at a \"significant level\" and could increase following the US strikes on Iranian nuclear sites, a cabinet minister has told Sky News.",
        "url": "https://news.sky.com/story/iranian-threat-to-uk-could-increase-after-us-strikes-says-cabinet-minister-13387193",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/4a94fe3aebd1667323da6eab53ef77a40441f00d862d5c76476d63b929778f52_6947864.jpg?20250622233033",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-22 18:38:00",
        "Headline": "Business Secretary Jonathan Reynolds tells Sky News it would be \"naive\" to think the threat will not escalate as Tehran could seek to retaliate against the US, Israel and their allies.",
        "Content": "The threat to the UK from Iran is already at a \"significant level\" and could increase following the US strikes on Iranian nuclear sites, a cabinet minister has told Sky News. Business Secretary Jonathan Reynolds said that \"not a week goes by\" without an Iranian cyberattack on the country's critical national infrastructure. Speaking on Sunday Morning with Trevor Phillips, Mr Reynolds said: \"There is Iranian activity on the streets of the UK, which is wholly unacceptable.\" And he said it would be \"naive\" to think the threat will not escalate as Tehran could seek to retaliate against the US, Israel and their allies. Follow latest: US bombers attack Iran Early on Sunday, the American military struck three sites as it joined Israel's effort to destroy Iran's nuclear programme. B-2 bombers dropped 14 bunker-busting GBU-57 Massive Ordnance Penetrators, each weighing 30,000lbs. Iran has maintained its programme is for peaceful purposes only. President Trump called the strikes \"a spectacular military success\" and claimed Iran's key nuclear enrichment facilities had been \"completely and totally obliterated.\" \n                  Bonus episode: Trump bombs Iran\n                 \n                  The Americans want the attack on Iran's nuclear sites to be a 'one-and-done'\n                 \n                  Iranian nuclear sites sustained 'extremely severe damage' after US strikes, Pentagon says\n                 He called on Iran not to retaliate, saying the government \"must now make peace. If they do not, future attacks would be far greater and a lot easier\". Mr Reynolds said Iran had a choice - \"Do they want to continue being an agent of instability in the region and the wider world? Where has that got them? Where has it got the Iranian people? \"There's a better course of action for Iran to take here, and I think they should consider that.\" Read more:What we know about US strikes on Iran's nuclear facilitiesAnalysis: Has Iran lost its ability to make a nuclear bomb Last October, MI5 chief Ken McCallum said authorities had stopped 20 state-backed plots hatched by Iran in the UK since 2022. And in December, the National Cyber Security Centre (NCSC) warned that Iran \"is developing its cyber capabilities and is willing to target the UK to fulfil its disruptive and destructive objectives\". In February 2023, a London-based Iranian news station said it was forced to shut its UK headquarters over alleged threats from Tehran and fears for the safety of its journalists. Iran International TV said it \"reluctantly\" closed its west London studios and moved the operation to its offices in Washington DC. The broadcaster said the move followed warnings from the Metropolitan Police that there were \"serious\" and \"grave\" concerns about \"hostile intentions of foreign states\". In December 2023, a Chechen-born man was sentenced to three years and six months in prison after being found guilty of spying on the London-based dissident Iranian TV station to help terror plotters. Magomed-Husejn Dovtaev, 31, was accused of conducting surveillance on the west London headquarters of Iran International as part of a plan by others to carry out a terror attack. He was found guilty of one charge of attempting to collect information useful for terrorism. Meanwhile a British-Iranian journalist, who was told by the Metropolitan Police to leave her UK home for her own safety last year after Iran International presenter Pouria Zeraati was stabbed in the leg in London, has warned of the \"dangers\" if the \"regime survives\". Sima Sabet, who also worked for the Persian-language television news channel, told Sky's Emma Birchley: \"What I want, and what I hope, is this Islamic Republic is gone, because the more this regime survives, the more danger to the world it would be, the more danger to international peace, and also… the more danger to the Iranian people.\" She added: \"There has to be a way that this transition is going to be peaceful. Iran cannot be bombed and then left on its own. So there must be an answer for it. \"There must be an international effort for us. So Iranian people can have a very smooth transition into democracy.\" Two men will face trial next year accused of attacking Mr Zeraati in Wimbledon in March 2024. The defendants are charged with wounding him with intent to cause grievous bodily harm and wounding. British Prime Minister Keir Starmer, French President Emmanuel Macron and German Chancellor Friedrich Merz have called on Iran's leaders to enter negotiations and \"not to take any further action that could destabilise the region\". Sir Keir urged Britons in Israel and Palestinian territories to make contact with the Foreign Office as it prepares for an evacuation flight early next week. Speaking to Sky News, the prime minister said: \"I urge all citizens to make contact with the Foreign Office so that we can facilitate whatever support is needed.\" The Israeli government said about 22,000 tourists are seeking to board evacuation flights but it is unclear how many of those are from the UK."
    },
    {
        "title": "Iranian nuclear sites sustained 'extremely severe damage' after US strikes, Pentagon says",
        "description": "Iranian nuclear sites sustained \"extremely severe damage and destruction\" in air strikes, the US has said - a stance mostly supported by the UN's nuclear watchdog.",
        "url": "https://news.sky.com/story/iranian-nuclear-sites-sustained-extremely-severe-damage-us-says-13387146",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-maxar-fordow-iran_6948029.jpg?20250622140852",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-22 16:19:00",
        "Headline": "The US defence secretary says an initial assessment suggests \"all of our precision munitions struck where we wanted them to strike and had the desired effect\" after American forces launched Operation Midnight Hammer, involving seven B-2 stealth jets dropping 14 bunker busting bombs.",
        "Content": "Iranian nuclear sites sustained \"extremely severe damage and destruction\" in air strikes, the US has said - a stance mostly supported by the UN's nuclear watchdog. General Dan Caine, chairman of America's joint chiefs of staff, told reporters that the destruction wrought by Operation Midnight Hammer will take \"some time\" to assess. But he added that \"initial battle damage assessments indicate that all three sites sustained extremely severe damage and destruction\". The sites are Fordow, Natanz and Isfahan. Fordow is a secretive nuclear facility buried about 80m below a mountain and one of two key uranium enrichment plants in Iran, along with Natanz. Isfahan features a large nuclear technology centre and enriched uranium is also stored there, diplomats say. At Fordow, satellite images taken after the attack show holes in the mountain in which the nuclear site was situated. Follow latest: US bombers strike three Iranian nuclear sites Images of Natanz, which is also suspected of having an underground facility, appear to show a new hole in a rocky area. Pete Hegseth, the US defence secretary, said the initial assessment was that \"all of our precision munitions struck where we wanted them to strike and had the desired effect\". \"Which means, especially in Fordow, which was the primary target here, we believe we achieved destruction of capabilities there,\" he added. America's attack brings the US into direct involvement in the war between Israel and Iran, which started on 13 June. It prompted threats of reprisals from Tehran, raising fears of a wider regional conflict. Rafael Grossi, head of the International Atomic Energy Agency (IAEA), said the facility at Natanz had been \"completely destroyed\", while its underground halls \"suffered a lot\" because of cuts to electricity as the result of Israeli attacks. He also told CNN that the Isfahan site had suffered \"very significant damage\". At Fordow, which is deep underground, he said it was difficult to know how much damage had been done. Satellite images appear to show major damage at Isfahan. Natanz was believed to have possibly already suffered extensive damage in Israel's strikes earlier this week. Fourteen bunker buster bombs were used in the attacks on Fordow and Natanz, and numerous Tomahawk cruise missiles were also used in the operation, which involved seven B-2 stealth bombers and was described by Donald Trump as \"very successful\". Read more:What we know about Operation Midnight Hammer as US strikes Iran's nuclear facilities However, a senior Iranian source told the Reuters news agency that most of the highly enriched uranium at Fordow was moved to an undisclosed location ahead of the attacks. Personnel numbers were said to have been cut, too. The IAEA said there had been \"no increase in off-site radiation levels\" after the strikes. Donald Trump said no further attacks were planned and he hoped diplomacy would take over.  Fears of a wider conflict Iran's foreign minister, Abbas Araghchi, warned that the US strikes \"will have everlasting consequences\", adding that his country \"reserves all options\" to retaliate. Mr Hegseth said the United States \"does not seek war\" but would \"act swiftly and decisively when our people, our partners, or our interests are threatened\". Iran has repeatedly denied it is seeking a nuclear weapon, and Mr Grossi said this month the IAEA had no proof of a \"systematic effort to move into a nuclear weapon\". However, the IAEA said last month that Iran had amassed 408.6kg of uranium enriched up to 60% - a short, technical step away from weapons-grade levels of 90%. Since the war broke out more than a week ago, Iranian authorities say more than 400 people have been killed since Israel's bombardment began, mostly civilians. Israel has taken out much of Iran's military leadership with attacks targeting air defences and military bases. Iran has been launching missiles back at Israel, and at least 24 people have been killed over the past nine days. US Senator Chris Murphy, posting on X after the US strikes, said he and other senators received a classified briefing last week indicating that Iran did not pose an immediate threat through its nuclear programme. \"Iran was not close to building a deliverable nuclear weapon,\" Senator Murphy said. \"The negotiations Israel scuttled with their strikes held the potential for success.\"  'Consultations' with Vladimir Putin The Iranian foreign minister told journalists on Sunday morning that he was flying to Moscow to have \"serious consultations\" with Vladimir Putin. He described Moscow as a \"friend of Iran\", adding: \"We always consult with each other.\" Read more:We may see nothing more than rhetoric from Russia Iran's Revolutionary Guard Corps (IRGC) said that \"invaders must now await responses that will bring regret\" after the US strikes. Gulf states like Bahrain, Saudi Arabia and Kuwait, all home to US military bases, are on high alert after the strikes, with Bahrain urging drivers to avoid main roads and Kuwait setting up shelters. The UK has also further increased \"force protection\" measures for its military bases and personnel in the Middle East to their highest level. Iran has requested an emergency meeting of the UN Security Council to \"maintain international peace and condemn the US strikes\", according to state media.  'Bold decision' Israeli Prime Minister Benjamin Netanyahu hailed the \"bold decision\" by Mr Trump, saying it would \"change history\". The IRGC said it had launched 40 missiles at Israel on Sunday morning, including its biggest ballistic missile, the Khorramshahr-4. Iranian missiles hit sites in northern and central Israel, including in Haifa, Ness Ziona, Rishon LeZion and Tel Aviv. The UK is preparing to fly British nationals out of Israel. Read more:Iran may not have lost its ability to make a nuclear bombIran may decide that killing Americans is the best way to retaliate Nuclear negotiations 'blown up' The UK's prime minister called on Iran to \"return to the negotiating table\" and reach \"a diplomatic solution to end this crisis\". \"Iran's nuclear programme is a grave threat to international security. Iran can never be allowed to develop a nuclear weapon and the US has taken action to alleviate that threat,\" said Sir Keir Starmer. However, Mr Araghchi said the US and Israel had \"blown up\" negotiations and asked: \"How can Iran return to something it never left, let alone blew up?\""
    },
    {
        "title": "Isfahan, Natanz and Fordow: What we know about Operation Midnight Hammer as US strikes Iran's nuclear facilities",
        "description": "Details are emerging about the US strikes against Iran's nuclear facilities.",
        "url": "https://news.sky.com/story/isfahan-natanz-and-fordow-what-we-know-about-the-us-strikes-on-irans-nuclear-facilities-13386916",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-operation-midnight-hammer_6948134.jpg?20250622172817",
        "type": "World",
        "Author": "Michael Drummond",
        "Date Published": "2025-06-22 01:32:00",
        "Headline": "Details are emerging about the US strikes on three key nuclear sites inside Iran. Here's what we know so far.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n  Details are emerging about the US strikes against Iran's nuclear facilities. The US military has provided details about which sites have been hit and what military elements have been used, as President Donald Trump hailed the attack on social media. From the number of bunker buster bombs dropped to where they hit, here's what we know so far. Follow latest: US bombers strike three Iranian nuclear sites How did 'Operation Midnight Hammer' unfold? The US's most senior military official gave details of how the attack, named Operation Midnight Hammer, unfolded. General Dan Caine, chairman of the US joint chiefs of staff, said that at midnight on Friday, a large \"B-2 strike package of bombers\" launched from the US, flying east across the Atlantic. \n                  Bonus episode: Trump bombs Iran\n                 \n                  The Americans want the attack on Iran's nuclear sites to be a 'one-and-done'\n                 \n                  Iranian threat to UK could increase after US strikes, says cabinet minister\n                 To maintain the element of surprise, some other bombers flew west into the Pacific. During the 18-hour flight, the planes underwent multiple rounds of refuelling. As the seven B-2 bombers entered Iran, the US deployed \"several decoys\", according to Gen Caine, and a US submarine launched more than two dozen Tomahawk cruise missiles at the Isfahan nuclear site. At around 6.40pm EST on Saturday, the first B-2 bomber dropped two GBU 57 Massive Ordnance Penetrator weapons, known as bunker buster bombs, on Fordow. \"The remaining bombers then hit their targets,\" said Gen Caine, with 14 GBU-57s dropped in total. Bunker buster bombs are designed to explode twice. Once to breach the ground surface, and again, once the bomb has burrowed down to a certain depth.  Israel has bunker busters in its arsenal but does not have the much more powerful GBU-57, which can only be launched from the B-2 bomber and was believed to be the only bomb capable of breaching Fordow. This attack was the GBU-57s' first operational use. More than 75 weapons were used in total, including 14 30,000lb GBU-57 bunker buster bombs, and 125 aircraft took part. The New York Times reported a US official as saying a B-2 also dropped two of the GBU-57s on the Natanz nuclear site. The B-2s were all heading back towards the US by 7.05pm (EST), Gen Caine added, and he said the US military were not aware of any shots fired at the American jets by Iranian aircraft or air defences on the ground.  Which sites were hit? America says it has hit the three key locations in Iran's nuclear programme. They include Isfahan, the location of a significant research base, as well as uranium enrichment facilities at Natanz and Fordow. Read more: Fordow: What we know about Iran's secretive 'nuclear mountain' Natanz was believed to have been previously damaged in Israeli strikes after bombs disrupted power to the centrifuge hall, possibly destroying the machines indirectly. Details about the damage in the US strikes are not yet known, although Mr Trump said the three sites had been \"obliterated\". The US secretary of defence Pete Hegseth said the US had \"devastated the Iranian nuclear programme\". However, most of the highly enriched uranium at the Fordow nuclear facility was moved to an undisclosed location ahead of the attack, a senior Iranian source told the Reuters news agency. Personnel numbers were also reduced at the site, according to the report. Satellite images from Fordow show cargo trucks lining up at the entrance of the nuclear site in recent days. How has Iran responded so far? Iran's foreign minister Abbas Araghchi warned that the US strikes \"will have everlasting consequences\", adding that his country \"reserves all options\" to retaliate. \"The events this morning are outrageous and will have everlasting consequences,\" Mr Araghchi wrote on X. \"Each and every member of the UN must be alarmed over this extremely dangerous, lawless and criminal behaviour.\"  Iran has requested an emergency meeting of the UN Security Council to \"maintain international peace and condemn the US strikes\", according to state media. Read more:What happens next is largely in Iran's control Multiple places in Israel have been hit by Iranian missiles in response. Several explosions have been heard over Tel Aviv with Israeli media saying missiles have hit northern and central Israel, including in Haifa, Ness Ziona, Rishon LeZion and Tel Aviv.  Sixteen casualties were reported by the country's emergency services. Abbas Golroo, head of the Iranian parliament's foreign policy committee, also said in a statement on social media Iran could pull out of efforts to limit the spread of nuclear technology and weapons, called the Treaty on the Non-Proliferation of Nuclear Weapons (NPT). He cited Article 10 of the treaty, which states that an NPT member has \"the right to withdraw from the treaty if it decides that extraordinary events have jeopardised the supreme interests of its country\"."
    },
    {
        "title": "Iran has little choice but to retaliate against US - as Russia faces urgent decision on how to back Tehran",
        "description": "Donald Trump's decision to attack Iran could trigger a wider regional or even global war, but much will hinge on how Russia and China - Tehran's most powerful allies - respond.",
        "url": "https://news.sky.com/story/iran-has-little-choice-but-to-retaliate-against-us-as-russia-faces-urgent-decision-on-how-to-back-tehran-13387090",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-putin-russia-iran_6948079.jpg?20250622160507",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2025-06-22 13:27:00",
        "Headline": "Russia, China, Iran, and North Korea are regarded by Western allies as a new axis of authoritarian powers, increasingly aligned and supportive of each other.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  Donald Trump's decision to attack Iran could trigger a wider regional or even global war, but much will hinge on how Russia and China - Tehran's most powerful allies - respond. Abbas Araghchi, the Iranian foreign minister, said he will hold \"serious consultations\" with Vladimir Putin on Monday morning in Moscow. His country is also in contact with Beijing. Israel-Iran live: 'Incredible success' of US strikes on Iran hailed by Hegseth Russia, China, Iran, and North Korea are regarded by Western allies as a new axis of authoritarian powers, increasingly aligned and supportive of each other. Donald Trump, though, has broken ranks from his country's traditional democratic partners to forge a closer relationship with Mr Putin than any other US leader in recent years. How much that might affect the Kremlin's calculations, as Moscow weighs up how to respond to his actions in Iran, adds a new layer of unpredictability to the crisis. \n                  Bonus episode: Trump bombs Iran\n                 \n                  The Americans want the attack on Iran's nuclear sites to be a 'one-and-done'\n                 \n                  Iranian threat to UK could increase after US strikes, says cabinet minister\n                  Another limiting factor is the Russian military's physical capacity - should it wish - to bolster Iran with military support given its war in Ukraine. Unlike the NATO alliance, there is no formal agreement between Moscow, Beijing, Tehran, and Pyongyang to come to each other's assistance in a crisis. However, the weakening of one member of the quartet would impact on the vital national interests of the other three, making it mutually beneficial to help each other out - including with military force or at the very least by supplying weapons.  Iran has little choice but to retaliate directly against the United States after three of its main nuclear facilities were struck overnight. But its ability to launch ballistic missiles and drones has been severely degraded by waves of Israeli strikes since Prime Minister Benjamin Netanyahu went to war with Iran a week and a half ago. Read more:What we know about US strikes on Iran's nuclear facilitiesAnalysis: Has Iran lost its ability to make a nuclear bomb What are Iran's options? US bases, warships, and aircraft across the region are well within range of Iranian missiles and drones, but the Pentagon has significantly strengthened its air defences in anticipation of an Iranian counterattack. There are plenty of softer targets, though, such as American embassies or other diplomatic missions.  Iran could also choose to mine the Strait of Hormuz - a move that would have global ramifications by disrupting the flow of large amounts of oil and gas, as well as other trade. In addition, the military assets of American allies could be viewed as legitimate targets. The UK has said it played no part in the US attack. But Britain's Ministry of Defence has further increased \"force protection\" measures for its military bases and personnel in the Middle East to their highest level in the wake of the US strikes, it is understood.  What was hit in US attack? In an operation that has been in the planning for years, American B-2 stealth bombers dropped enormous bunker-busting bombs - the GBU-57 Massive Ordnance Penetrator - on the Fordow nuclear fuel enrichment plant, around 70 miles (110km) southwest of Tehran. It was built under a mountain - about 80 to 90 metres beneath the ground - to be beyond the reach of Israel's armed forces. Only the US Air Force carries munitions large enough to penetrate the rock, earth and concrete to inflict meaningful damage. Also targeted with the enormous munitions was Iran's main uranium enrichment facility at Natanz, 155 miles (250km) southeast of the Iranian capital. In addition, US submarines launched TLAM cruise missiles against a site outside the city of Isfahan, which is 260 miles (420km) south of Tehran. Near-bomb-grade nuclear fuel is thought to be stored here.  The International Atomic Energy Agency (IAEA), the UN's nuclear watchdog, however, said the six buildings at Isfahan that were hit contained little or no nuclear material. Mr Trump has said he ordered the attack to destroy Iran's ability to enrich uranium to a level that could be used to make a nuclear bomb. Tehran has always insisted its nuclear programme is purely for civilian purposes. Analysts warn, though, that it would be very difficult to stop the Iranian nuclear programme through military action alone and that such a move may spur Iran to accelerate efforts to make a bomb if it has managed to protect key components. The Russian foreign ministry on Sunday strongly condemned the American strikes against Iranian nuclear sites as a \"dangerous escalation\" that could further undermine \"regional and global security\". \"The risk of an escalation of conflict in the Middle East already beset by multiple crises, has increased significantly,\" it said in a statement. Last week, the Russian government warned the US against joining Israel's war in Iran, saying this \"would be an extremely dangerous step with truly unpredictable negative consequences\". The remarks came after Mr Putin held a call with his Chinese counterpart, Xi Jinping. It means the Russian government in particular - given Tehran's military support to Moscow in the Russian invasion of Ukraine - faces an urgent decision about how to support Ali Khamenei, Iran's supreme leader, whose very existence is under threat from Israel."
    },
    {
        "title": "Bonus episode: Trump bombs Iran",
        "description": "<a href=' https://podfollow.com/the-world-with-richard-and-yalda'>👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈</a> ",
        "url": "https://news.sky.com/story/bonus-episode-trump-bombs-iran-13387226",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-the-world-vodcast_6915914.jpg?20250521204722",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-22 20:34:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈  In this bonus episode, Richard and Yalda get together and talk about President Trump's decision to strike three nuclear sites in Iran. Yalda is in Jerusalem and Richard is in Tel Aviv where both of them have been reporting all night long. Yalda reveals what her contacts are telling her about the extent of the damage done to the sites. They then ask, what could happen next? To get in touch or to share questions, email theworld@sky.uk"
    },
    {
        "title": "Iraq's delicate balancing act - where Iran-aligned militia have vowed to attack Americans",
        "description": "Iraq is no different to any other country in the region - anxiously waiting to see what happens next after America's multiple bomb strikes on Iran's nuclear facilities.",
        "url": "https://news.sky.com/story/iraqs-delicate-balancing-act-where-iran-aligned-militia-have-vowed-to-attack-americans-13387097",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-iraq-iran-us_6948096.jpg?20250622163558",
        "type": "World",
        "Author": "Stuart Ramsay",
        "Date Published": "2025-06-22 13:58:00",
        "Headline": "There are at least 2,500 American personnel stationed in Iraq, and the US has major interests here, as it does across the Middle East and Gulf states.",
        "Content": "\n          Chief correspondent\n              @ramsaysky\n  Iraq is no different to any other country in the region - anxiously waiting to see what happens next after America's multiple bomb strikes on Iran's nuclear facilities. Where it differs is that Iraq, caught bang in the middle of the war between Israel and Iran, and now the United States, has to juggle its relationships with both Tehran and Washington DC. The Shia Muslim-dominated government of Iraq is close to Iran, and Iran's influence on Iraq cannot be underestimated. Follow latest: US bombers strike three Iranian nuclear sites Shia militia groups in Iraq, while nominally answering to Baghdad, take much of their guidance from Tehran, so their positions must be taken into consideration by the Iraqi government. At the same time, Iraq needs the United States because it provides stability and support in the region, and the US military remains the most potent force in stopping terror organisations like Islamic State from rejuvenating themselves. There are at least 2,500 American personnel stationed in Iraq, and the US has major interests here, as it does across the Middle East and Gulf states. \n                  Bonus episode: Trump bombs Iran\n                 \n                  The Americans want the attack on Iran's nuclear sites to be a 'one-and-done'\n                 \n                  Iranian threat to UK could increase after US strikes, says cabinet minister\n                  That US presence itself poses problems - Iran has threatened to attack American interests and personnel across the region. Read more:I covered the 2003 Iraq war - here's my thoughts on US strikes on Iran The US bases and personnel, like its airbase in Erbil in northern Iraq, could easily be attacked and are well within the distance of Iran's short-range missiles.  Further, the home-based Iraqi Shia militias are already on record as saying they will attack bases and personnel if the United States were to join in Israel's war with Iran, which has now happened. Iraq is furious that its airspace has been used by Israel to attack Iran, but is powerless to do anything about it.  Equally, the Iraqi government's writ does not run far with the militias, who could act independently, embarrassing the government, or worse, leading to attacks within Iraq itself. Read more:What we know about the US strikes on Iran's nuclear facilitiesIran's secretive 'nuclear mountain' and its protectionAnalysis: If Israel breaks Iran it will end up owning the chaos In a press conference given by the US defence secretary and US chairman of the joint chiefs of staff, the message to Iran and its proxies here in Iraq and in Syria was that any attack on American assets would be \"a very bad idea\". They couldn't be clearer in their warning. President Trump, they pointed out, wants an end to the matter, but is more than prepared to carry out attacks on all hostile entities. If Iran follows its publicly announced course of action to retaliate not just against Israel, but against American interests, military personnel, and even civilians here in Iraq and the wider region, it runs the risk of a serious degradation of the country if America were to strike back. Given that Iraq must play this delicate balancing act between the two powers, ultimately, it doesn't want to be dragged into the conflict. What it wants - and needs - is for diplomacy to resume."
    },
    {
        "title": "Iran may decide that killing Americans is the best way to retaliate",
        "description": "The US president has given the Iranians a choice: negotiate or face devastating escalation.",
        "url": "https://news.sky.com/story/iran-may-decide-that-killing-americans-is-the-best-way-to-retaliate-13387086",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-beirut-ali-khamenei_6948064.jpg?20250622150032",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-06-22 13:33:00",
        "Headline": "Ayatollah Ali Khamenei has spent his life trying to roll back American power and influence in the Middle East. He is unlikely to negotiate with Washington now.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n The US president has given the Iranians a choice: negotiate or face devastating escalation. The next move is down to Iran's supreme leader, Ayatollah Ali Khamenei. He has spent his entire life trying to roll back American power and influence in the region. Expecting him to negotiate with the US now, with B-2 bombers held to his head, is a tall order. More likely, he will order some kind of retaliation - at least for now. He will want to deter Donald Trump from launching more attacks and may calculate that killing Americans is the best way of doing so.  The ayatollah knows that could drive a wedge between Trump and his MAGA supporters, who say America is getting drawn into yet another Middle Eastern war, risking US lives. There are plenty of US targets for Iran to aim at, with bases throughout the Middle East: in Qatar, Kuwait, Iraq, and Saudi Arabia. The Iranians could attack them directly with drones and missiles, or use proxies in the region, Iran-backed militias in Iraq, or the Houthis, based in Yemen. Iran could threaten shipping and the oil industry in the Persian Gulf. If the Gulf becomes a war zone, expect a big hit to the global economy and the price of oil to rocket. But all that would invite massive retaliation from the US. The Trump administration has spelt that out in no uncertain terms. America has sent an awesome amount of firepower to the region: three aircraft carrier groups bristling with fighter jets and submarines loaded with cruise missiles. More about Ali Khamenei:Listen: From accidental to absolute leader - who is Ayatollah Ali Khamenei?Ayatollah Ali Khamenei: Who is Iran's supreme leader  So the Iranians may instead go for the kind of asymmetric warfare they excel at. The UK could be in the firing line too. We could see Iranian terrorist attacks here in Britain. One way or another, this is almost certain to escalate, but could it widen and draw other countries into the conflict? Russia and Iran have a strategic partnership agreement, but it doesn't require Russia to come to Tehran's support. Iran is also China's closest ally in the Middle East, but Beijing is also likely to sit this one out and watch from the sidelines. Wars have unintended consequences, but there are strong reasons for other powers to avoid becoming involved in this one. Read more:What we know about US strikes on Iran's nuclear facilitiesIran may still have ability to make nuclear bomb Looking further ahead, there are two competing priorities to watch. For Iran's leadership, it is all about survival, to absorb the blows and live to fight another day, and eventually build the bomb if it can, to stop this ever happening to them again. And Israel is equally determined that will not happen. One method would be regime change in Iran, but its leadership is proving resilient so far, despite the mounting challenges it faces. Instead, Israel faces a long period of managing the threat posed by Iran. It will need to monitor the Iranians, watching for signs they are developing their missile programme, meddling in the region or reviving their nuclear project, and cut them down to size when necessary. That could mean years more of military action and could be hugely costly for Israel and its backers, the US taxpayers. In summary, Iran's leadership is in a very tight spot and is likely to lash out, but the future will not be a walk in the park for Israel, either, while there are big risks for America, too."
    },
    {
        "title": "Even after US strikes, Iran may still have the ability to make a nuclear bomb",
        "description": "It would be sensible to wait until the dust has settled before judging whether the US strikes on Iran were, in Donald Trump's, words, \"a spectacular military success\".",
        "url": "https://news.sky.com/story/even-after-us-strikes-iran-may-still-have-the-ability-to-make-a-nuclear-bomb-13387019",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-natanz-iran-nuclear_6944270.jpg?20250617124916",
        "type": "World",
        "Author": "Tom Clarke",
        "Date Published": "2025-06-22 10:02:00",
        "Headline": "US strikes could have halted Iran's ability to enrich the uranium needed to make a viable nuclear weapon. But that's not the same as preventing its ability to make a nuclear bomb.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  It would be sensible to wait until the dust has settled before judging whether the US strikes on Iran were, in Donald Trump's, words, \"a spectacular military success\". And when dropping bombs that weigh more than 13 tonnes each, there's going to be a lot of dust. The Pentagon says the operation against Iran's three largest nuclear facilities involved 125 military aircraft, warships and submarines, including the largest operational strike by B2 bombers in history. Follow latest: Iran considering 'all options' after US strikes The B-2s dropped 14 of America's most powerful GBU-57 \"bunker buster\" bombs on the Natanz uranium enrichment plant and Iran's most sophisticated nuclear facility at Fordow. The first time, according to the Pentagon, the weapons have been used in a military operation. The Fordow complex, buried deep in a mountain, was the only site not previously damaged by Israeli strikes over the last few days. The use of multiple GBU-57 bombs at Fordow is telling. Despite their size, it was known that one of them would be insufficient to penetrate 80+ metres of solid rock believed to shelter Iran's most sophisticated uranium enrichment technology deep within Fordow. Read more:Fordow: What we know about Iran's secretive 'nuclear mountain' What we know so far about US strikes on Iran's nuclear facilities Satellite images reveal three visible holes at two different strike points on the mountainside above the complex. The sites appear to be close to what may have been ventilation shafts - possibly chosen to maximise damage below and render the facility useless. Using several of the bombs in the same location is likely designed to allow each to penetrate further than the first before detonating. If nuclear facilities at Isfahan, Natanz and Fordow were destroyed - as the US claims - or even crippled, it would certainly halt Iran's ability to enrich the Uranium needed to make a viable nuclear weapon.  But that's not the same as preventing Iran's ability to make a nuclear bomb. To do that, they need \"weapons-grade\" uranium; the necessary metal-shaping, explosives and timing technology needed to trigger nuclear fission in the bomb; and a mechanism for delivering it. The facilities targeted in the US raid are dedicated to achieving the first objective. Taking naturally occurring uranium ore, which contains around 0.7% uranium 235 - the isotope needed for nuclear fission - and concentrating it. The centrifuges you hear about are the tools needed to enrich U-235 to the 90% purity needed for a compact \"implosion\"-type warhead that can be delivered by a missile.  And the reality is Iran's centrifuges have been spinning for a long time. United Nations nuclear inspectors warned in May that Iran had at least 408kg of uranium \"enriched\" to 60%. Getting to that level represents 90% of the time and effort to get to 90% U-235. And those 400kg would yield enough of that weapons-grade uranium to make nine nuclear weapons, the inspectors concluded. The second element is something Iran has also been working on for two decades.  Precisely shaping uranium metal and making shaped explosive charges to crush it in the right way to achieve \"criticality\", the spark for the sub-atomic chain reaction that releases the terrifying energy in a nuclear explosion. In its recent bombing campaign, Israel is thought to have targeted facilities where Iranian nuclear scientists were doing some of that work. Analysis on the US strikes:Trump's two big gambles as US enters war with IranFor Trump, the performative presidency just got real But unlike the industrial processes needed to enrich uranium, these later steps can be carried out in laboratory-sized facilities. Easier to pack up and move, and easier to hide from prying eyes. Given that it's understood Iran already moved enriched uranium out of Fordow ahead of the US strike, it's far from certain that Iran has, in fact, lost its ability to make a bomb. And while the strikes may have delayed the logistics, it's possible they've emboldened a threatened Iran to intensify its warhead-making capability if it does still have one. Making a more compact implosion-based warhead is not easy. There is debate among experts about how advanced Iran is along that road. But if it felt sufficiently motivated, it does have other, less sophisticated nuclear options. Even 60% enriched uranium, of which - remember - it has a lot, can be coaxed to criticality in a much larger, cruder nuclear device. This wouldn't pose as much threat to its enemies, as it would be too heavy to fit on even the best of Iran's long-range missiles. But it would, nonetheless, elevate Iran to the status of a nuclear power."
    },
    {
        "title": "What happens next after US strikes is largely in Iran's control - but there are no good choices",
        "description": "As the sun rises above Jerusalem this morning, Israelis will be waking to the news that America has joined their war and attacked Iran. It will be met with mixed feelings.",
        "url": "https://news.sky.com/story/what-happens-next-is-largely-in-irans-control-but-there-are-no-good-choices-13386928",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-ayatollah-ali-khamenei_6822040.jpg?20250207094834",
        "type": "World",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-06-22 03:59:00",
        "Headline": "While the new day brings a comfort in US military support there will also be deep trepidation that this war has entered a dangerous and potentially uncontrollable phase.",
        "Content": "\n          Middle East correspondent\n              @AliBunkallSKY\n  As the sun rises above Jerusalem this morning, Israelis will be waking to the news that America has joined their war and attacked Iran. It will be met with mixed feelings. While the new day brings a comfort in US military support there will also be deep trepidation that this war has entered a dangerous and potentially uncontrollable phase. Benjamin Netanyahu released a video statement praising the US president and saying peace comes through strength; Donald Trump addressed the American nation and warned Iran he would not hesitate to order further action if it retaliates. What happens next is largely in Iran's control. What they choose to do, will determine the future of this region. The question is now not whether they will respond, but how?  Iran has faced a humiliating pounding from Israeli jets over nine days and now suffered massive attacks on their celebrated nuclear facilities by a country they call \"The Great Satan\"; there will be a feeling of national humiliation and anger, and the government will need to show its people it remains strong. Developing a nuclear programme has taken many decades and comes at vast cost: billions and billions of dollars and heavy international sanctions. That all now lies in tatters. How does the government explain that to its people, many of whom have suffered at the expense of these grand ambitions and are opposed to the draconian leadership they live under? \n                  Bonus episode: Trump bombs Iran\n                 \n                  The Americans want the attack on Iran's nuclear sites to be a 'one-and-done'\n                 \n                  Iranian threat to UK could increase after US strikes, says cabinet minister\n                 Ayatollah Ali Khamenei is often described as the world's longest-serving dictator. He hasn't survived by being reckless but even though the US strikes weren't aimed at regime change, Khamanei's future is now more precarious than ever. The government rhetoric and state television channels will promise fire and victory, but the reality isn't simple. There will be voices close to the Supreme Leader, especially in the Revolutionary Guard, encouraging a strong response. The moderates will likely urge caution, wary of dragging the US into a wider, more sustained conflict that Iran couldn't win. 👉 Listen to Sky News Daily on your podcast app 👈 It's unclear how much more Iran can throw at Israel. Ballistic missiles have been fired at the country every day since the war began, but in decreasing numbers as Israel has systematically targeted launch sites and stockpiles. Iran's proxies, Hezbollah and Hamas, are severely degraded and the Assad regime in Syria is no more. This was all supposed to be the first line of defence, a deterrence against an Israel attack. That shield has collapsed. The Houthis remain defiant but their firepower is limited.  Read more:What we know about Iran's secretive 'nuclear mountain'Analysis: If Israel breaks Iran it will end up owning the chaos The US attacks were against Iran's nuclear sites, not senior Iranian officials. Strikes on US bases in the region would therefore be the most logical 'like-for-like' response. If they choose to widen the conflict, Iran could now target oil facilities in the Gulf or try to close off the globally important Strait of Hormuz. Either of those options would have international consequences.  Shia militia in Iraq could be hard to control if they decide to act unilaterally. Iraqi security forces have reportedly surrounded the US Embassy in Baghdad in anticipation of violence. There is a possibility Iran could do something smaller and symbolic as a way of saving face, having the final word and giving the region an off-ramp. That will be the hope in Washington. But even in that best-case scenario, it will surely have to be something more than a token response; Iran is reeling, severely weakened internally and externally. If they escalate, they risk a severe US response that could be a death blow. If they capitulate, the government faces major domestic dissent and reputational damage from which it might never recover. For the Supreme Leader this morning, there are no good choices."
    },
    {
        "title": "'Stability in Middle East is priority,' says Starmer - as world reacts to strikes",
        "description": "Sir Keir Starmer has said stability in the Middle East is \"a priority\" following US strikes on Iran's nuclear facilities, as the world reacted to the attack.",
        "url": "https://news.sky.com/story/stability-in-middle-east-is-priority-says-starmer-as-he-calls-on-iran-to-return-to-negotiating-table-13386950",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-downing-street_6947814.jpg?20250622074237",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-22 06:32:00",
        "Headline": "The US struck three sites in Iran, with Donald Trump boasting the country's key nuclear sites were \"completely and fully obliterated\" in an address to the nation from the White House.",
        "Content": " Sir Keir Starmer has said stability in the Middle East is \"a priority\" following US strikes on Iran's nuclear facilities, as the world reacted to the attack. The prime minister also called on Iran to \"return to the negotiating table\" to \"reach a diplomatic solution to end this crisis\". He later told Sky News' political editor, Beth Rigby, that his focus was on \"de-escalating\", as there was a \"risk of escalation\" to the Middle East, and beyond. The US struck three sites in Iran early on Sunday morning, with Donald Trump boasting the country's key nuclear sites were \"completely and fully obliterated\" in an address to the nation from the White House. He warned there could be further strikes if Iran retaliates. Follow latest: Iran considering 'all options' after US strikes  In a statement, Sir Keir said: \"Iran's nuclear programme is a grave threat to international security. Iran can never be allowed to develop a nuclear weapon, and the US has taken action to alleviate that threat. \"The situation in the Middle East remains volatile and stability in the region is a priority. We call on Iran to return to the negotiating table and reach a diplomatic solution to end this crisis.\" He said the UK was not involved in the attack but was informed about them in advance. Later, speaking to Rigby, who was interviewing the prime minister on behalf of all broadcasters, he said: \"That's a risk to the region. \"It's a risk beyond the region, and that's why all our focus has been on de-escalating, getting people back around to negotiate what is a very real threat in relation to the nuclear programme.\" The prime minister will chair a meeting of the government's COBRA crisis committee on Sunday afternoon. Read more:What we know so far about US strikesWhat happens next is largely in Iran's control  Netanyahu praises Trump Israel's Prime Minister Benjamin Netanyahu praised Mr Trump for the strikes, saying: \"Your bold decision to target Iran's nuclear facilities with the awesome and righteous might of the United States will change history. \"History will record that President Trump acted to deny the world's most dangerous regime the world's most dangerous weapons.\"  UN secretary-general 'gravely alarmed' by US attack But UN secretary general Antonio Guterres said he was \"gravely alarmed by the use of force\" by the US against Iran. \"This is a dangerous escalation in a region already on the edge - and a direct threat to international peace and security. There is a growing risk that this conflict could rapidly get out of control - with catastrophic consequences for civilians, the region, and the world.\" European Union foreign policy chief Kaja Kallas urged all sides to step back and return to the negotiating table. \"Iran must not be allowed to develop a nuclear weapon,\" she said in a post on X. \"I urge all sides to step back, return to the negotiating table and prevent further escalation,\" she said, adding that EU foreign ministers will discuss the situation tomorrow. How the world reacted to the strikes World leaders reacted to the strikes with calls for diplomacy and de-escalation, with some fearing they could push the region towards a wider conflict. Russia's former president and current deputy chair of its security council, Dmitry Medvedev, said on the Telegram messaging app: \"Trump, who came in as a peacemaker president, has started a new war for the US.\" China strongly condemned the attack, with its foreign ministry saying the move seriously violates the UN charter and worsens tensions in the Middle East. It urged the parties involved to cease attacks as soon as possible and begin negotiations. German Chancellor Friedrich Merz urged Iran to enter immediate talks with the US and Israel to find a diplomatic solution to the conflict, a government spokesperson said. France urged all sides to show restraint, with its foreign minister Jean-Noel Barrot saying Paris is \"convinced that a lasting resolution to this issue requires a negotiated solution within the framework of the Non-Proliferation Treaty\". Italy's foreign minister Antonio Tajani said after the attack that his country's government hopes \"a de-escalation can begin and Iran can sit down at the negotiating table\". Cuba's President Miguel Diaz-Canel said on X: \"We strongly condemn the US bombing of Iran's nuclear facilities, which constitutes a dangerous escalation of the conflict in the Middle East. The aggression seriously violates the UN Charter and international law and plunges humanity into a crisis with irreversible consequences.\" Venezuela's foreign minister Yvan Gil said his country's government \"condemns US military aggression\" and \"demands an immediate cessation of hostilities\". NATO member Turkey said the strikes raised the risk of a regional conflict spreading globally, with the foreign ministry saying the spread of the conflict into a wider global war must not be allowed. The Iraqi government condemned the strikes, saying they create a grave threat to peace and security in the Middle East. Saudi Arabia expressed \"deep concern\" but stopped short of condemning the attack. Both Hamas in Gaza and the Houthis in Yemen - part of Iran's so-called Axis of Resistance - condemned the strikes, with the Houthis vowing to support Iran in its fight against \"the Zionist and American aggression\". Lebanon's Prime Minister Nawaf Salam said his country needs to stay away from any possible regional spillover from the conflict. Qatar said it \"regrets\" the escalating tensions and its foreign ministry urged all parties to show restraint and \"avoid escalation, which the peoples of the region, burdened by conflicts and their tragic humanitarian repercussions, cannot tolerate\". The United Arab Emirates called for an immediate halt to the escalation to \"avoid serious repercussions\" in the region, with its foreign ministry warning they could lead the region to \"new levels of instability\". Oman condemned the strikes, with a spokesperson for its foreign ministry warning they threaten \"to expand the scope of the conflict and constitute a serious violation of international law and the United Nations charter\". Pakistan condemned the strikes as a \"deeply disturbing\" escalation days after it nominated Mr Trump for the Nobel Peace Prize for his diplomatic intervention in the India-Pakistan crisis. Pope Leo appealed for peace during his Sunday Angelus prayer in St Peter's Square, calling for international diplomacy to \"silence the weapons\". Referring to the \"alarming\" situation in Iran, he urged every member of the international community to take up their moral responsibility to \"stop the tragedy of war before it becomes an irreparable abyss\". Maryam Rajavi, the head of Iranian opposition group National Council of Resistance of Iran, said from Paris: \"Now [Supreme Leader] Khamenei must go. The Iranian people welcome the end of the war and seek peace and freedom. \"Khamenei is responsible for an unpatriotic project that, in addition to costing countless lives, has cost the Iranian people at least $2trn (£1.5trn) - and now, it has all gone up in smoke.\""
    },
    {
        "title": "Iranian nuclear sites sustained 'extremely severe damage' after US strikes, Pentagon says",
        "description": "Iranian nuclear sites sustained \"extremely severe damage and destruction\" in air strikes, the US has said - a stance mostly supported by the UN's nuclear watchdog.",
        "url": "https://news.sky.com/story/iranian-nuclear-sites-sustained-extremely-severe-damage-us-says-13387146",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-maxar-fordow-iran_6948029.jpg?20250622140852",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-22 16:19:00",
        "Headline": "The US defence secretary says an initial assessment suggests \"all of our precision munitions struck where we wanted them to strike and had the desired effect\" after American forces launched Operation Midnight Hammer, involving seven B-2 stealth jets dropping 14 bunker busting bombs.",
        "Content": "Iranian nuclear sites sustained \"extremely severe damage and destruction\" in air strikes, the US has said - a stance mostly supported by the UN's nuclear watchdog. General Dan Caine, chairman of America's joint chiefs of staff, told reporters that the destruction wrought by Operation Midnight Hammer will take \"some time\" to assess. But he added that \"initial battle damage assessments indicate that all three sites sustained extremely severe damage and destruction\". The sites are Fordow, Natanz and Isfahan. Fordow is a secretive nuclear facility buried about 80m below a mountain and one of two key uranium enrichment plants in Iran, along with Natanz. Isfahan features a large nuclear technology centre and enriched uranium is also stored there, diplomats say. At Fordow, satellite images taken after the attack show holes in the mountain in which the nuclear site was situated. Follow latest: US bombers strike three Iranian nuclear sites Images of Natanz, which is also suspected of having an underground facility, appear to show a new hole in a rocky area. Pete Hegseth, the US defence secretary, said the initial assessment was that \"all of our precision munitions struck where we wanted them to strike and had the desired effect\". \"Which means, especially in Fordow, which was the primary target here, we believe we achieved destruction of capabilities there,\" he added. America's attack brings the US into direct involvement in the war between Israel and Iran, which started on 13 June. It prompted threats of reprisals from Tehran, raising fears of a wider regional conflict. Rafael Grossi, head of the International Atomic Energy Agency (IAEA), said the facility at Natanz had been \"completely destroyed\", while its underground halls \"suffered a lot\" because of cuts to electricity as the result of Israeli attacks. He also told CNN that the Isfahan site had suffered \"very significant damage\". At Fordow, which is deep underground, he said it was difficult to know how much damage had been done. Satellite images appear to show major damage at Isfahan. Natanz was believed to have possibly already suffered extensive damage in Israel's strikes earlier this week. Fourteen bunker buster bombs were used in the attacks on Fordow and Natanz, and numerous Tomahawk cruise missiles were also used in the operation, which involved seven B-2 stealth bombers and was described by Donald Trump as \"very successful\". Read more:What we know about Operation Midnight Hammer as US strikes Iran's nuclear facilities However, a senior Iranian source told the Reuters news agency that most of the highly enriched uranium at Fordow was moved to an undisclosed location ahead of the attacks. Personnel numbers were said to have been cut, too. The IAEA said there had been \"no increase in off-site radiation levels\" after the strikes. Donald Trump said no further attacks were planned and he hoped diplomacy would take over.  Fears of a wider conflict Iran's foreign minister, Abbas Araghchi, warned that the US strikes \"will have everlasting consequences\", adding that his country \"reserves all options\" to retaliate. Mr Hegseth said the United States \"does not seek war\" but would \"act swiftly and decisively when our people, our partners, or our interests are threatened\". Iran has repeatedly denied it is seeking a nuclear weapon, and Mr Grossi said this month the IAEA had no proof of a \"systematic effort to move into a nuclear weapon\". However, the IAEA said last month that Iran had amassed 408.6kg of uranium enriched up to 60% - a short, technical step away from weapons-grade levels of 90%. Since the war broke out more than a week ago, Iranian authorities say more than 400 people have been killed since Israel's bombardment began, mostly civilians. Israel has taken out much of Iran's military leadership with attacks targeting air defences and military bases. Iran has been launching missiles back at Israel, and at least 24 people have been killed over the past nine days. US Senator Chris Murphy, posting on X after the US strikes, said he and other senators received a classified briefing last week indicating that Iran did not pose an immediate threat through its nuclear programme. \"Iran was not close to building a deliverable nuclear weapon,\" Senator Murphy said. \"The negotiations Israel scuttled with their strikes held the potential for success.\"  'Consultations' with Vladimir Putin The Iranian foreign minister told journalists on Sunday morning that he was flying to Moscow to have \"serious consultations\" with Vladimir Putin. He described Moscow as a \"friend of Iran\", adding: \"We always consult with each other.\" Read more:We may see nothing more than rhetoric from Russia Iran's Revolutionary Guard Corps (IRGC) said that \"invaders must now await responses that will bring regret\" after the US strikes. Gulf states like Bahrain, Saudi Arabia and Kuwait, all home to US military bases, are on high alert after the strikes, with Bahrain urging drivers to avoid main roads and Kuwait setting up shelters. The UK has also further increased \"force protection\" measures for its military bases and personnel in the Middle East to their highest level. Iran has requested an emergency meeting of the UN Security Council to \"maintain international peace and condemn the US strikes\", according to state media.  'Bold decision' Israeli Prime Minister Benjamin Netanyahu hailed the \"bold decision\" by Mr Trump, saying it would \"change history\". The IRGC said it had launched 40 missiles at Israel on Sunday morning, including its biggest ballistic missile, the Khorramshahr-4. Iranian missiles hit sites in northern and central Israel, including in Haifa, Ness Ziona, Rishon LeZion and Tel Aviv. The UK is preparing to fly British nationals out of Israel. Read more:Iran may not have lost its ability to make a nuclear bombIran may decide that killing Americans is the best way to retaliate Nuclear negotiations 'blown up' The UK's prime minister called on Iran to \"return to the negotiating table\" and reach \"a diplomatic solution to end this crisis\". \"Iran's nuclear programme is a grave threat to international security. Iran can never be allowed to develop a nuclear weapon and the US has taken action to alleviate that threat,\" said Sir Keir Starmer. However, Mr Araghchi said the US and Israel had \"blown up\" negotiations and asked: \"How can Iran return to something it never left, let alone blew up?\""
    },
    {
        "title": "The Americans want the attack on Iran's nuclear sites to be a 'one-and-done'",
        "description": "The Pentagon briefing was big on what happened but short on detail of what happens next.",
        "url": "https://news.sky.com/story/the-americans-want-the-attack-on-irans-nuclear-sites-to-be-a-one-and-done-13387200",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-pete-hegseth-us-defence-secreary_6948208.jpg?20250622202016",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2025-06-22 19:07:00",
        "Headline": "The US defence secretary says Iranian troops and civilians were not targeted - something to limit the Iranian response, perhaps. ",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n The Pentagon briefing was big on what happened but short on detail of what happens next. Neither defence secretary Pete Hegseth nor General Dan \"Raisin\" Caine, chair of the joint chiefs of staff, can answer that. Mr Hegseth called the bombing an \"incredible and overwhelming success\" with \"focused and clear\" instructions from President Trump. The focus now is on what follows and that's not so clear. The briefing laid out the details of the military deception plan behind Operation Midnight Hammer. B-2 stealth aircraft were flown west towards the Pacific on Saturday as a decoy, while the B-2s with bunker-busting bombs on board flew east towards Iran. Israel-Iran live: World continues to react to US attack on nuclear facilities  Mr Hegseth called it a plan that took months and weeks of positioning and came down, in the end, to \"precision, misdirection and operational security\". Gen Caine, Mr Trump's top military man, offered a measured assessment. While Mr Trump had spoken of Iran's nuclear sites being \"obliterated\", Gen Caine revised that downwards when he spoke of \"extremely severe damage\". Full battle damage assessment will reveal the complete picture - only then can the mission's success be measured in full, mindful that Iran had shifted at least some of its enriched uranium in the days before the strike. On the politics of it, Mr Hegseth said this wasn't about regime change in Iran. It might offer precious little reassurance to Tehran, particularly as he also said part of the operation was to defend Israel and the ongoing defence of Israel.  If the US is tethered to Israel's interests to the extent of an unprecedented attack on Iran, where does its influence end? Israeli Prime Minister Benjamin Netanyahu appeared almost giddy in response to the US attack. He is a PM strengthened by Mr Trump's spectacular response to his rhetoric around Iran. Suspicions weren't softened around Netanyahu's influence over Mr Trump when Mr Hegseth was asked about the basis for the attack. He has long lobbied the US president on Iran being close to building a nuclear bomb, contrary to American intelligence which indicates otherwise. Mr Hegseth was asked what was the new intelligence, was it American or from other countries? He avoided a direct answer, saying only that Mr Trump had looked at all the intelligence information and concluded Iran was a threat. There were a number of questions about what comes next, with an assortment of non-answers in response from Mr Hegseth.  Read more:Iran may not have lost its ability to make a nuclear bombIran may decide that killing Americans is the best way to retaliate A consistent line was that the US wanted Iran to negotiate peace, coupled with the threat of further aggression if it doesn't. The US defence secretary said Washington was in touch with Tehran privately and publicly, giving it every opportunity to come to the table, every opportunity for peace. He made the point that America hadn't targeted Iranian troops or civilians - clearly, a measure by the US to limit response and leave open a door. The Americans want this attack to have been a \"one-and-done\". The scenario it's left with, however, is an Iran talking of a diplomatic door closed and sending its foreign minister travelling to Moscow to meet Vladimir Putin. Iran is wounded, no doubt. Combined attacks have left it degraded and, without a network of support in the Middle East, its ability to strike back is limited. For now, if not necessarily forever. Donald Trump clearly enjoyed the sugar rush of military success but he will be wary of the come-down and all of its uncertainties. In circumstances with world implications, he won't be alone."
    },
    {
        "title": "Trump's two big gambles as US enters war with Iran",
        "description": "Donald Trump has rolled the dice. He is gambling on being correct about two key variables.",
        "url": "https://news.sky.com/story/trumps-two-big-gambles-as-us-enters-war-with-iran-13386981",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-trump-us-president_6947894.jpg?20250622095351",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-06-22 07:47:00",
        "Headline": "Donald Trump campaigned on a pledge not to involve America in far-away wars - and yet he has just dramatically inserted himself into a new one.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  Donald Trump has rolled the dice. He is gambling on being correct about two key variables. First, he is banking on being right that the Iranian nuclear sites struck by the US have really been \"completely and totally obliterated\", as he claimed. US military officials have frequently said destroying the whole nuclear apparatus would be very hard and the more likely outcome of air strikes would be to set the nuclear programme back. Follow latest: Iran considering 'all options' after US strikes The second gamble holds far more jeopardy. The president is betting Iran will not have the capability, or the guts, to hit any of the many US bases and diplomatic missions in the region or to meaningfully disrupt international shipping. His hope is the moderates in the Iranian regime will now recognise their own strategic defeat and will adopt a position of dialogue and de-escalation. Read more:Starmer calls on Iran to 'return to negotiating table'What we know so far about US strikes on Iran's nuclear facilities  The best-case scenario now would be a repeat of history: a repeat of a moment when Mr Trump, in his first term, got lucky. In December 2019 he made a decisive decision to order the assassination of the then-head of the Quds Force of the Revolutionary Guard, Qassem Soleimani. He had opted for a seismic retaliation in response to Iranian attacks on Americans in the region. In early January 2020, Iran's most senior military figure was killed in a drone strike in Baghdad. The region braced, and many predicted a huge Iranian counter-attack. But it didn't come. There were isolated attacks, but nothing sustained. Two weeks ago, Mr Trump's Middle East envoy Steve Witkoff warned an Israeli pre-emptive strike on Iran would prompt a massive Iranian retaliation. He predicted what he called a \"mass casualty event\" in Israel. That too has not materialised. The US president is said to have been surprised and impressed by Israel's defensive capabilities but also its offensive operations in Iran. He seems to be convinced enough the Iranian response in the days ahead will be limp. He cited the assassination of General Sulemani in his late-night address to the nation. He sees that as his success, a gamble that paid off.  If he is right again on both of his new gambles - that he has destroyed the nuclear facilities and that Iran does not hit back with any effectiveness - then, just maybe, this will be a game-changing moment. But if Iran manages even to hit one US base and kill some Americans, then the whole thing will spiral. He made one more gamble this weekend. He bet his own base of supporters will be with him on this. He is the president who campaigned on a pledge not to involve America in far-away wars, and yet he has just dramatically inserted himself into a new one. He now needs to show them he is right, that this was a one-off game-changing strike of American might - strength to bring peace, he'd say. In his short late-night address to the nation, he made a point of reminding America of Iran's malign behaviour over decades - their weapons killed and maimed many Americans, he told them. It was notable too that he was flanked by his vice-president, secretary of state and defence secretary. He doesn't want to own this gamble alone."
    },
    {
        "title": "'Stability in Middle East is priority,' says Starmer - as world reacts to strikes",
        "description": "Sir Keir Starmer has said stability in the Middle East is \"a priority\" following US strikes on Iran's nuclear facilities, as the world reacted to the attack.",
        "url": "https://news.sky.com/story/stability-in-middle-east-is-priority-says-starmer-as-he-calls-on-iran-to-return-to-negotiating-table-13386950",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-downing-street_6947814.jpg?20250622074237",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-22 06:32:00",
        "Headline": "The US struck three sites in Iran, with Donald Trump boasting the country's key nuclear sites were \"completely and fully obliterated\" in an address to the nation from the White House.",
        "Content": " Sir Keir Starmer has said stability in the Middle East is \"a priority\" following US strikes on Iran's nuclear facilities, as the world reacted to the attack. The prime minister also called on Iran to \"return to the negotiating table\" to \"reach a diplomatic solution to end this crisis\". He later told Sky News' political editor, Beth Rigby, that his focus was on \"de-escalating\", as there was a \"risk of escalation\" to the Middle East, and beyond. The US struck three sites in Iran early on Sunday morning, with Donald Trump boasting the country's key nuclear sites were \"completely and fully obliterated\" in an address to the nation from the White House. He warned there could be further strikes if Iran retaliates. Follow latest: Iran considering 'all options' after US strikes  In a statement, Sir Keir said: \"Iran's nuclear programme is a grave threat to international security. Iran can never be allowed to develop a nuclear weapon, and the US has taken action to alleviate that threat. \"The situation in the Middle East remains volatile and stability in the region is a priority. We call on Iran to return to the negotiating table and reach a diplomatic solution to end this crisis.\" He said the UK was not involved in the attack but was informed about them in advance. Later, speaking to Rigby, who was interviewing the prime minister on behalf of all broadcasters, he said: \"That's a risk to the region. \"It's a risk beyond the region, and that's why all our focus has been on de-escalating, getting people back around to negotiate what is a very real threat in relation to the nuclear programme.\" The prime minister will chair a meeting of the government's COBRA crisis committee on Sunday afternoon. Read more:What we know so far about US strikesWhat happens next is largely in Iran's control  Netanyahu praises Trump Israel's Prime Minister Benjamin Netanyahu praised Mr Trump for the strikes, saying: \"Your bold decision to target Iran's nuclear facilities with the awesome and righteous might of the United States will change history. \"History will record that President Trump acted to deny the world's most dangerous regime the world's most dangerous weapons.\"  UN secretary-general 'gravely alarmed' by US attack But UN secretary general Antonio Guterres said he was \"gravely alarmed by the use of force\" by the US against Iran. \"This is a dangerous escalation in a region already on the edge - and a direct threat to international peace and security. There is a growing risk that this conflict could rapidly get out of control - with catastrophic consequences for civilians, the region, and the world.\" European Union foreign policy chief Kaja Kallas urged all sides to step back and return to the negotiating table. \"Iran must not be allowed to develop a nuclear weapon,\" she said in a post on X. \"I urge all sides to step back, return to the negotiating table and prevent further escalation,\" she said, adding that EU foreign ministers will discuss the situation tomorrow. How the world reacted to the strikes World leaders reacted to the strikes with calls for diplomacy and de-escalation, with some fearing they could push the region towards a wider conflict. Russia's former president and current deputy chair of its security council, Dmitry Medvedev, said on the Telegram messaging app: \"Trump, who came in as a peacemaker president, has started a new war for the US.\" China strongly condemned the attack, with its foreign ministry saying the move seriously violates the UN charter and worsens tensions in the Middle East. It urged the parties involved to cease attacks as soon as possible and begin negotiations. German Chancellor Friedrich Merz urged Iran to enter immediate talks with the US and Israel to find a diplomatic solution to the conflict, a government spokesperson said. France urged all sides to show restraint, with its foreign minister Jean-Noel Barrot saying Paris is \"convinced that a lasting resolution to this issue requires a negotiated solution within the framework of the Non-Proliferation Treaty\". Italy's foreign minister Antonio Tajani said after the attack that his country's government hopes \"a de-escalation can begin and Iran can sit down at the negotiating table\". Cuba's President Miguel Diaz-Canel said on X: \"We strongly condemn the US bombing of Iran's nuclear facilities, which constitutes a dangerous escalation of the conflict in the Middle East. The aggression seriously violates the UN Charter and international law and plunges humanity into a crisis with irreversible consequences.\" Venezuela's foreign minister Yvan Gil said his country's government \"condemns US military aggression\" and \"demands an immediate cessation of hostilities\". NATO member Turkey said the strikes raised the risk of a regional conflict spreading globally, with the foreign ministry saying the spread of the conflict into a wider global war must not be allowed. The Iraqi government condemned the strikes, saying they create a grave threat to peace and security in the Middle East. Saudi Arabia expressed \"deep concern\" but stopped short of condemning the attack. Both Hamas in Gaza and the Houthis in Yemen - part of Iran's so-called Axis of Resistance - condemned the strikes, with the Houthis vowing to support Iran in its fight against \"the Zionist and American aggression\". Lebanon's Prime Minister Nawaf Salam said his country needs to stay away from any possible regional spillover from the conflict. Qatar said it \"regrets\" the escalating tensions and its foreign ministry urged all parties to show restraint and \"avoid escalation, which the peoples of the region, burdened by conflicts and their tragic humanitarian repercussions, cannot tolerate\". The United Arab Emirates called for an immediate halt to the escalation to \"avoid serious repercussions\" in the region, with its foreign ministry warning they could lead the region to \"new levels of instability\". Oman condemned the strikes, with a spokesperson for its foreign ministry warning they threaten \"to expand the scope of the conflict and constitute a serious violation of international law and the United Nations charter\". Pakistan condemned the strikes as a \"deeply disturbing\" escalation days after it nominated Mr Trump for the Nobel Peace Prize for his diplomatic intervention in the India-Pakistan crisis. Pope Leo appealed for peace during his Sunday Angelus prayer in St Peter's Square, calling for international diplomacy to \"silence the weapons\". Referring to the \"alarming\" situation in Iran, he urged every member of the international community to take up their moral responsibility to \"stop the tragedy of war before it becomes an irreparable abyss\". Maryam Rajavi, the head of Iranian opposition group National Council of Resistance of Iran, said from Paris: \"Now [Supreme Leader] Khamenei must go. The Iranian people welcome the end of the war and seek peace and freedom. \"Khamenei is responsible for an unpatriotic project that, in addition to costing countless lives, has cost the Iranian people at least $2trn (£1.5trn) - and now, it has all gone up in smoke.\""
    },
    {
        "title": "An Iranian attack on US military bases could draw the UK into the conflict",
        "description": "When I got to Chequers on Sunday morning the prime minister had clearly been up for most of the night and hitting the phones all morning with calls to fellow leaders in Europe and the Middle East as he and others scrambled to try to contain a very dangerous situation.&#160;",
        "url": "https://news.sky.com/story/an-iranian-attack-on-us-military-bases-could-draw-the-uk-into-the-conflict-13387191",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-keir-starmer_6948194.jpg?20250622195001",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-06-22 18:32:00",
        "Headline": "An attack on one NATO member is an attack on them all, meaning the British government may have no choice about potential involvement.",
        "Content": "\n          Political editor\n              @BethRigby\n  When I got to Chequers on Sunday morning the prime minister had clearly been up for most of the night and hitting the phones all morning with calls to fellow leaders in Europe and the Middle East as he and others scrambled to try to contain a very dangerous situation.  His primary message on Sunday was to try to reassure the public that the UK government was working to stabilise the region as best it could and press for a return to diplomacy. But what struck me in our short interview was not what he did say but what he didn't - what he couldn't - say about the US strikes. It was clear from his swerve on the question of whether the UK supported the strikes that the prime minister neither wanted to endorse US strikes nor overtly criticise President Trump. Instead, his was a form of words - repeated later in a joint statement of the E3 (the UK, Germany and France) to acknowledge the US strikes and reiterate where they can agree: the need to prevent Iran having a nuclear weapon. He also didn't want to engage in the very obvious observation that President Trump simply isn't listening to Sir Keir Starmer or other allies, who had been very publicly pressing for de-escalation all week, from the G7 summit in Canada to this weekend as European countries convened talks in Geneva with Iran.  It was only five days ago that the prime minister told me he didn't think a US attack was imminent when I asked him what was going on following President Trump's abrupt decision to quit the G7 early and convene his security council at the White House. When I asked him if he felt foolish or frustrated that Trump had done that and didn't seem to be listening, he told me it was a \"fast moving situation\" with a \"huge amount of discussions in the days since the G7\" and said he was intensely pressing his consistent position of de-escalation. What else really could he say? He has calculated that criticising Trump goes against UK interests and has no other option but to press for a diplomatic solution and work with other leaders to achieve that aim.  Before these strikes, Tehran was clear it would not enter negotiations until Israel stopped firing missiles into Iran - something Israel is still saying on Sunday evening it is not prepared to do. The US has been briefing that one of the reasons it took action was because it did not think the Iranians were taking the talks convened by the Europeans in Geneva seriously enough. It is hard now to see how these strikes will not serve but to deepen the conflict in the Middle East and the mood in government is bleak. Iran will probably conclude that continuing to strike only Israel in light of the US attacks - the first airstrikes ever by the US on Iran - is a response that will make the regime seem weak.  Read more:Iran may not have lost its ability to make a nuclear bombIran may decide that killing Americans is the best way to retaliate But escalation could draw the UK into a wider conflict it does not want. If Iran struck US assets, it could trigger article five of NATO (an attack on one is an attack on all) and draw the UK into military action. If Iran chose to attack the US via proxies, then UK bases and assets could be under threat. The prime minister was at pains to stress on Sunday that the UK had not been involved in these strikes. Meanwhile, the UK-controlled airbase on Diego Garcia was not used to launch the US attacks, with B-2 bombers deployed from Guam instead. There was no request to use the Diego Garcia base, the president moving unilaterally, underlining his disinterest in what the UK has to say. The world is waiting nervously to see how Iran might respond, as the PM moves more military assets to the region while simultaneously hitting the phones. The prime minister may be deeply opposed to this war, but stopping it is not in his gift."
    }
]