[
    {
        "title": "D-Day for Rayner? PM's adviser prepares pivotal verdict - as her lawyers deny giving tax advice",
        "description": "Sir Keir Starmer could be forced into a decision over Angela Rayner's future as early as today, as the prime minister's ethics adviser prepares his verdict on the Labour deputy's tax affairs.",
        "url": "https://news.sky.com/story/d-day-for-rayner-pms-adviser-prepares-pivotal-verdict-as-her-lawyers-deny-giving-tax-advice-13425261",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-starmer-rayner_7011553.jpg?20250905000247",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-04 22:40:00",
        "Headline": "Sir Laurie Magnus is conducting an investigation into whether Angela Rayner broke ministerial rules by failing to pay the correct amount of stamp duty on a new home, and his findings could be revealed as soon as today.",
        "Content": "Sir Keir Starmer could be forced into a decision over Angela Rayner's future as early as today, as the prime minister's ethics adviser prepares his verdict on the Labour deputy's tax affairs. Ms Rayner, who is also the housing secretary, has been under mounting pressure since she admitted not paying the correct amount of stamp duty on an £800,000 flat in Hove, East Sussex. She has argued the mistake was made as a result of incorrect advice from a conveyancer and two trust law experts, who told her she did not need to pay the higher rate reserved for second home purchases. Her case was thrust into doubt late on Thursday when the conveyancing firm - Verrico & Associates - said it did not provide advice and had been made \"scapegoats\" in the political row. Its managing director, Joanna Verrico, told The Daily Telegraph while it had acted for Ms Rayner when she bought the property, no tax or trust advice was provided. Any advice she may have received will form a key plank of an investigation by Sir Keir's independent ethics guru, Sir Laurie Magnus, who Ms Rayner referred herself to earlier this week. Downing Street has said the prime minister expects a \"quick\" verdict, and he has refused to rule out sacking his second-in-command. \"I will act on whatever the report is that's put in front of me,\" Sir Keir told the BBC on Thursday - and that report may well arrive on his desk today. Sir Laurie has concluded investigations into ex-ministers Nadhim Zahawi and Tulip Siddiq within days - and Sky's chief political correspondent Jon Craig reports he's due to go on holiday on Saturday. He is assessing whether Ms Rayner broke ministerial rules, which place an \"overarching duty on ministers to comply with the law\", \"behave in a way that upholds the highest standards of propriety\", and \"be as open as possible\" with the public. Conservative leader Kemi Badenoch has said Ms Rayner must go. In a statement following the intervention by Verrico & Associates, she said: \"This is yet more damning evidence that Angela Rayner has not been honest with the British public. \"She must resign or Keir Starmer must finally find the backbone to sack her.\" Read more:Key questions left unanswered in Angela Rayner tax rowVictim of misogyny' or 'freeloading' deputy prime minister? The row began when The Daily Telegraph first claimed Ms Rayner avoided £40,000 in stamp duty on the flat in Hove by removing her name from the deeds of another property in Greater Manchester. Ms Rayner said she sold her stake in her family home in Ashton-under-Lyne to a trust that was set up to provide for her teenage son, who has lifelong disabilities - meaning she did not technically own that home when she purchased the flat, and so was not subject to the higher rate of stamp duty that applies to second homes. She has described it as an \"honest mistake\", and tearfully revealed on Sky News' Electoral Dysfunction podcast she had already considered resigning. She said she realised what had happened after seeking fresh legal advice, having spent weeks dismissing questions about the tax claims.  Were Ms Rayner to depart, it would make for a difficult end to a week which began with Sir Keir confidently declaring \"phase two\" of his government was now under way. She is overseeing some of his key targets - notably building 1.5 million new homes this parliament, and a large expansion of workers' rights."
    },
    {
        "title": "Legendary fashion designer Giorgio Armani dies",
        "description": "Legendary fashion designer Giorgio Armani has died aged 91 - with the worlds of fashion and showbiz paying tribute to a \"giant\" and a \"master of his craft\".",
        "url": "https://news.sky.com/story/legendary-fashion-designer-giorgio-armani-dies-13424939",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-giorgio-armani-italy_7011167.jpg?20250904145742",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-04 13:13:00",
        "Headline": "Armani originally wanted to be a doctor but changed his mind after a part-time job as a window dresser in Milan exposed him to fashion for the first time.",
        "Content": " Legendary fashion designer Giorgio Armani has died aged 91 - with the worlds of fashion and showbiz paying tribute to a \"giant\" and a \"master of his craft\". The Italian billionaire died at home surrounded by his family on Thursday. \"With infinite sorrow, the Armani Group announces the passing of its creator, founder, and tireless driving force: Giorgio Armani,\" his fashion house said. Tributes flood in for Armani - as it happened \"Il Signor Armani, as he was always respectfully and admiringly called by employees and collaborators, passed away peacefully, surrounded by his loved ones. \"Indefatigable to the end, he worked until his final days, dedicating himself to the company, the collections, and the many ongoing and future projects.\" A funeral chamber will be set up at Milan's Armani Teatro for people to pay tribute between 9am and 6pm this weekend. Armani did not appear at his runway shows in Milan for the first time ever in June as he recovered from an unknown illness. Only a week ago, when he was interviewed by the Financial Times, he revealed he \"oversaw every aspect of the show remotely via video link\". \"My greatest weakness is that I am in control of everything,\" he told the newspaper. \"Everything you will see has been done under my direction and carries my approval.\" 'A symbol of the best of Italy' Italy's President Giorgia Meloni was among the first to pay tribute. \"Giorgio Armani leaves us at 91 years old,\" she wrote on X. \"With his elegance, sobriety, and creativity, he was able to bring lustre to Italian fashion and inspire the entire world. An icon, a tireless worker, a symbol of the best of Italy. Thank you for everything.\" Fellow fashion mogul Donatella Versace followed, saying: \"The world has lost a giant today. He made history and will be remembered forever.\" American designer Ralph Lauren said he \"always had the deepest respect and admiration\" for Armani. Dame Anna Wintour, who this year stepped down as head of American Vogue after 37 years, said the designer \"understood power and attitude and elegance as well as anyone ever has in fashion\". Julia Roberts, who famously wore Armani menswear to the Golden Globe awards in 1990, shared a picture of the pair together on Instagram with the caption: \"A true friend. A Legend.\" American model Cindy Crawford called him a \"master of his craft\" - while the Italian football world also offered its condolences. Juventus described him as a \"timeless icon of elegance and Italian style\". Inter Milan, who Armani supported, said he was \"an icon of our city, a fashion legend who, with his creativity and elegance, knew how to tell the story of Italianness around the world\". Legendary film director Martin Scorsese also paid tribute, heralding Armani as \"more than a clothing designer\". \"He was a real artist, and a great one - people use the term 'timeless' quite often, but in his case it happens to be true,\" said Scorsese. Armani contributed to the wardrobe design for the director's 1995 film Casino, creating suits for Robert De Niro's character, Ace Rothstein. The pair came together again for The Wolf of Wall Street (2013), where Armani this time suited up Leonardo DiCaprio.  'King Giorgio' Born in the small northern Italian town of Piacenza in July 1934, Armani originally wanted to be a doctor but changed his mind after a part-time job as a window dresser at a Milan store exposed him to fashion for the first time. As one of the most influential designers of the 20th century, he is often credited with spearheading red carpet fashion and was planning a major event during Milan Fashion Week this month to mark 50 years of his brand. He put Italian ready-to-wear style on the map in the late 1970s with his signature 'Armani suit' before adapting its classic style for women with the launch of the female 'power suit' in the 1980s. He also dressed Hollywood and music stars, including Julia Roberts, George Clooney, Cate Blanchett, and Lady Gaga. Read more:From Gere to Gaga: Armani's best celebrity looks Armani, or Re Giorgio (King Giorgio) as he was widely known, worked on more than 200 films, most notably earlier in his career on American Gigolo with Richard Gere in 1980. He was awarded both the French Legion of Honour and Italian Order of Merit for Labour for his contributions to the fashion industry. With an empire of more than £7.44bn at the time of his death, his work expanded beyond clothes to home furnishings, perfumes, books, flowers, bars, clubs, and restaurants. He also owned the basketball team EA7 Armani Milan, better known as Olympia Milano. Armani sparked controversy in 2015 for comments he made about fashion choices among gay men - and previously in 2009 when his company was forced to settle with the Italian tax authorities over its offshore subsidiaries."
    },
    {
        "title": "Revealed: Huge shortfall in NHS funding for weight-loss jab",
        "description": "So little money has been set aside by the NHS for the rollout of the Mounjaro weight-loss jab in GP surgeries that as few as one in five people with life-threatening obesity is likely to get treatment, new research shows.",
        "url": "https://news.sky.com/story/revealed160huge-shortfall-in-nhs-funding-for-weight-loss-jab-13424996",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mounjaro-weight-loss_6948297.jpg?20250623033923",
        "type": "Home",
        "Author": "Thomas Moore",
        "Date Published": "2025-09-04 14:32:00",
        "Headline": "New research reveals only one in five eligible patients may receive treatment as local NHS budgets fail to meet demand, sparking concerns over a postcode lottery and rationed care.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n So little money has been set aside by the NHS for the rollout of the Mounjaro weight-loss jab in GP surgeries that as few as one in five people with life-threatening obesity is likely to get treatment, new research shows. The NHS estimates that around 220,000 people living with obesity will be eligible for treatment through their GP over the next three years. But Freedom of Information requests by the British Medical Journal revealed that funding from NHS England has fallen well short of what is needed for the rollout. Just nine out of 40 Integrated Care Boards (ICBs) in England said they had enough funding to treat the 70% of eligible patients who are expected to come forward. Four ICBs - which plan health services in local areas - said NHS funding covered just 25% or fewer of their eligible patients. Coventry and Warwickshire ICB said funding would only stretch to treat 21% of its patients. The findings confirm an investigation by Sky News earlier this summer that access to Mounjaro is a postcode lottery for people living with obesity. Ellen Welch, Doctors' Association UK (DAUK) co-chair, told the BMJ: \"These figures confirm the fear that the rollout is not fit for purpose. \"There is a huge discrepancy between national messaging and what patients are actually being delivered on a local level.\" Read more from Sky News:How fake papers helped family get to BritainBank lobby chief warns Reeves over budget tax raid  Five ICBs admitted they are already considering further tightening the prescribing criteria or rationing the treatment beyond the plan agreed by the NHS. Any change would effectively move the goalposts for people who thought they qualified for NHS treatment. Birmingham and Solihull ICB received funding to cover just 52% of its eligible patients. It admitted: \"Difficult decisions are having to be made to ensure money is spent in the most effective and efficient way possible and for the greatest patient benefit.\" Dr Jonathan Hazlehurst, an obesity specialist and researcher at the University of Birmingham, said NHS England has only provided funding for just over 22,000 patients in the first year of the rollout. \"It shows that there's a lack of political will to fund this adequately,\" he told Sky News. \"NHS England says that obesity costs the NHS £11.4bn per annum as a pure NHS cost. \"Yet we can't even afford to properly fund the rollout of a life-changing drug in year one. That just doesn't make any sense.\" An NHS spokesperson said: \"The NHS is fully supporting the phased rollout of tirzepatide for eligible patients, having issued guidance in line with the NICE guidance, and provided funding to local ICBs to support patient care in March 2025. \"These represent brand-new services in primary care that are being established and scaled up over time, starting with those who are in the most need - and in the meantime, eligible patients can get weight loss support from a range of other services, including the NHS Digital Weight Management programme.\""
    },
    {
        "title": "Man whose arrest sparked Epping hotel protest found guilty of sexual assault of 14-year-old girl",
        "description": "A man whose arrest sparked a series of protests outside an Essex hotel housing asylum seekers, has been found guilty of sexual assault.",
        "url": "https://news.sky.com/story/man-whose-arrest-sparked-epping-hotel-protest-found-guilty-of-sexual-assault-13424933",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-epping-hadush-kebatu_7002838.jpg?20250904165341",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-04 12:58:00",
        "Headline": "Hadush Gerberslasie Kebatu was told by the judge that he should expect to go to prison, when he is sentenced later this month.",
        "Content": " A man whose arrest sparked a series of protests outside an Essex hotel housing asylum seekers, has been found guilty of sexual assault. The Bell Hotel in Epping became the focal point of demonstrations after Hadush Gerberslasie Kebatu was arrested, and later charged, on 13 July with the sexual assault of a 14-year-old girl. Ethiopian national Kebatu, 41, was alleged to have attempted to kiss the teenager, put his hand on her thigh and brushed her hair in July after she offered him pizza. An adult member of the public also accused Kebatu of trying to kiss her, putting his hand on her leg and telling her she was pretty, days after he arrived in the UK on a small boat. Kebatu, who was a \"teacher of sports\" in his home country, had denied two counts of sexual assault, one count of attempted sexual assault, one count of inciting a girl to engage in sexual activity, and one count of harassment without violence near the Bell Hotel. But at Chelmsford Magistrates' Court on Thursday, he was found guilty of all charges. District judge Christopher Williams took just 30 minutes to return the verdicts and his reasoning. The three-day trial heard Kebatu had also told two teenagers he wanted to \"have a baby with each of them\" - but Kebatu had previously told the trial he was \"not a wild animal\". Mr Williams said he was not persuaded there was \"any evidence to suggest the children fabricated any of the evidence they gave\". The defendant, wearing a grey tracksuit and sitting with a translator, gave no visible reaction as Mr Williams told him he was guilty. Kebatu is due to be sentenced at the same court on 23 September. The judge told the defendant that he should expect an \"immediate custodial sentence\". Essex Police Assistant Chief Constable Stuart Hooper paid tribute to the victims for ensuring the evidence put before the court was strong and true. \"It is because of their accounts of what happened, and the close co-operation with our Crown Prosecution Service colleagues, that we have been able to secure this conviction. \"We're acutely aware that this incident has attracted widespread public interest. \"We have always said that we treat and investigate every report made to us without fear or favour.\" 'It must never happen again' Conservative shadow Home Office minister Katie Lam said the guilty verdict showed the risks of allowing asylum seekers \"to roam around communities freely\". \"The crimes of this illegal migrant are shocking and heart-breaking and the victims have shown incredible bravery. \"This must never be allowed to happen again. Every illegal migrant should be detained immediately and swiftly deported.\" The incidents sparked protests and counter-protests outside the former Bell Hotel - as well as at hotels housing asylum seekers across the country. Rebecca Mundy, deputy chief crown prosecutor with CPS East of England, said: \"This was an incident which became a cause of deep concern for the local community. \"Our prosecutors worked carefully and impartially to bring this case to justice according to the law.\""
    },
    {
        "title": "The proxy war that will redefine public health in America",
        "description": "It is much more than a battle over vaccines in the United States.",
        "url": "https://news.sky.com/story/the-proxy-war-that-will-redefine-public-health-in-america-13425255",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-robert-kennedy_7011550.jpg?20250904234315",
        "type": "Home",
        "Author": "David Blevins",
        "Date Published": "2025-09-04 22:19:00",
        "Headline": "The US health secretary has been told children are now dying from measles for the first time in 20 years after he rolled back vaccine recommendations - a row that has taken centre stage in a wider battle over public health in the US.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  It is much more than a battle over vaccines in the United States. It has become a proxy war about trust, freedom, and the role of government in public health. The debate about childhood immunisations, once a matter of bipartisan consensus, is now a defining clash between federal government, state leadership and the medical community. At the centre of it is the federal government's sharp policy shift under US health secretary Robert F Kennedy Jr. He has rolled back vaccine recommendations and reshaped advisory committees with sceptics. States have responded along ideological lines - Florida planning to abolish all vaccine mandates; California, Oregon, and Washington forming a \"Health Alliance\" to safeguard them. The western states felt they had to act when the head of the agency tasked with disease prevention was sacked. 'You're putting Americans' health at risk' Susan Monarez had only been in the job for a month when Donald Trump told her she was no longer required. \"She didn't bend the knee, so you fired her,\" Democratic Senator Elizabeth Warren told Mr Kennedy during a heated committee hearing on Capitol Hill. \"You're putting American babies' health at risk, American seniors' health at risk, all Americans' health at risk, and you should resign,\" she added. Democratic Senator Raphael Warnock described the health secretary as \"a hazard to the health of the American people.\" \"For the first time, we're seeing deaths of children from measles. We haven't seen that in two decades. We're seeing that under your watch,\" he said. Mr Kennedy told the hearing America had done \"worse than any country in the world\" in terms of COVID deaths. \"…the people at CDC who oversaw the process, who put masks on our children, who closed our schools, are the people who will be leaving,\" he said. Read more US news:Farage met his match in Washington hearingHow Trump is vulnerable over Epstein  Jab mandates compared to 'slavery' Several senior figures at the Centers for Disease Control and Prevention have resigned since Susan Monarez was removed. The turmoil in public health has led to a fragmented system where Americans' access to vaccines and the rules governing them, largely depend on where they live. Likening vaccine mandates to \"slavery\", Florida's surgeon general Joseph Ladapo said the government had no right to dictate them. \"Your body is a gift from God. What you put into your body is because of your relationship with your body and your God,\" he said. It is a tug of war between collective responsibility or individual choice and one that will redefine public health in this nation."
    },
    {
        "title": "NHS surgeon jailed for fraud over amputation of own legs for 'sexual gratification' ",
        "description": "A surgeon, who for \"sexual gratification\" deliberately froze his lower legs, leading to them being amputated, has been jailed.",
        "url": "https://news.sky.com/story/nhs-surgeon-jailed-for-fraud-over-amputation-of-own-legs-for-sexual-gratification160-13425035",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-neil-hopper-surgeoun-amputations_7011344.jpg?20250904185958",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-04 16:07:00",
        "Headline": "Neil Hopper, 49, is jailed for 32 months for fraud linked to the amputation of his own lower legs and possession of extreme pornography involving genital mutilation.",
        "Content": "A surgeon, who for \"sexual gratification\" deliberately froze his lower legs, leading to them being amputated, has been jailed. Warning: This article contains details that some readers may find distressing. Neil Hopper, of St Erme, Truro, Cornwall, fraudulently claimed hundreds of thousands of pounds, saying the injuries were \"caused by sepsis\". The 49-year-old NHS vascular surgeon received total payouts of around £466,000 after making claims to two insurance companies. Truro Crown Court heard Hopper used dry ice to freeze his legs to the extent they were no longer viable, requiring amputation - which had long been an ambition of his and one he had a sexual interest in. After receiving the compensation, Hopper spent the money on \"luxury\", prosecutor Nicholas Lee said. He used £255,000 for building works at his home, had a £15,000 hot tub put in and spent £6,000 with a wood burner company. \n                  D-Day for Rayner? PM's adviser prepares pivotal verdict - as her lawyers deny giving tax advice\n                 \n                  Reform conference gets under way - as Farage returns from Trump meeting\n                 \n                  Everything you need to know about being a political party member\n                 Hopper also bought a £22,000 campervan, spent £13,000 on prosthetics and gave £52,000 to his wife. He pleaded guilty to two charges of fraud by false representation and three charges of possessing extreme pornographic images, relating to videos by a website called the EunuchMaker run by Marius Gustavson, which depicted genital mutilation. The judge James Adkin, the honorary recorder of Truro, jailed Hopper for 22 months for the fraud charges and a further 10 months for the extreme images charges. Hopper has not worked at the Royal Cornwall Hospitals NHS Trust since March 2023 and has been under an interim suspension from the medical register since December 2023. Mr Adkin said that in April 2019 Hopper deliberately froze his lower legs \"causing direct damage using dry ice following instructions given by Mr Gustavson\". \"You were admitted to hospital when you have the symptoms of sepsis well knowing what the medics will be looking out,\" he said. The judge said that after six weeks the medics decided his feet could not be saved and they amputated in May that year. \"You subsequently made fraudulent insurance claims to Aviva and Old Mutual Wealth, receiving a total of £466,000 fraudulently by representing that the injuries were organic, caused by sepsis, when you caused the injury seemingly at least in part for sexual gratification.\" Read more from Sky News:Man pleads not guilty after fans struck at Liverpool paradeHow fake papers helped family get to Britain Hopper was identified following investigations into Gustavson, who led an extreme body modification ring which carried out male castration, penis removal and other procedures on people as young as 16. The surgeon also exchanged thousands of messages with Gustavson about his own lower leg amputations and how he had done it, including asking how much dry ice he used. \"It is evident from the messages that Mr Hopper wished to become an amputee and it was always something he had dreamt of,\" Mr Lee said. Defence lawyer Andrew Langdon said his client had grown up in a rural village in Wales and felt he was \"in the wrong body\" from a young age. He said Hopper identified with body integrity identity disorder and those with a desire to amputate one or more healthy limbs. The Royal Cornwall Hospitals Trust said Hopper's colleagues had received support and counselling. \"While the details of the charges are shocking, it is important to stress that the convictions do not relate to Mr Hopper's professional conduct,\" a spokesperson said. They added that comprehensive clinical reviews of surgery carried out by Hopper had been carried out, including by an independent clinical expert who had reviewed decisions to operate. Gustavson, who netted more than £300,000 for 2017 and 2021 from his EunuchMaker website, was jailed for life with a minimum term of 22 years in prison at the Old Bailey last year."
    },
    {
        "title": "Nadine Dorries' defection might not be the boon Nigel Farage wants",
        "description": "Nadine Dorries has never forgiven the Conservative Party for ousting her hero Boris Johnson, on whom she continues to lavish praise.",
        "url": "https://news.sky.com/story/nadine-dorries-defection-an-act-of-revenge-on-the-tories-for-ousting-boris-johnson-13425172",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nadine-dorries-reform_7011464.jpg?20250904214209",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2025-09-04 20:17:00",
        "Headline": "Boris Johnson loyalist Ms Dorries, who resigned from the House of Commons in 2023, said she made the decision to join Reform because the Conservative Party was now \"dead\".",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Nadine Dorries has never forgiven the Conservative Party for ousting her hero Boris Johnson, on whom she continues to lavish praise. Now she's taken her revenge on the Tories by declaring her support for another charismatic political leader: Reform UK's Nigel Farage. Of course, the ex-MP dubbed \"Mad Nad\" by Labour MPs when she was in Parliament has one thing in common with her new party leader. They've both appeared on I'm a Celebrity... Get Me Out Of Here!, Dorries in 2012, without permission, for which she had the Conservative whip withdrawn. And Farage went into the jungle in 2023. So perhaps the pair can now fondly recall eating pigs' testicles, fish eyes, worms and crocodile anus. Or perhaps not. \"The Tory party is dead,\" she declared in the Daily Mail. \"Its members now need to think the unthinkable and look to the future.\" Dead? Like the dead parrot in the famous Monty Python sketch? \"No, it's not, it's resting,\" Tory loyalists will no doubt claim. Not entirely convincingly at present, however. \n                  Carrie Johnson admitted to hospital over 'severe dehydration'\n                 \n                  Ex-PM Boris Johnson and wife announce birth of their fourth child\n                 \n                  Boris Johnson hits out at Donald Trump's 'ghastly' comments to Ukraine President Volodymyr Zelenskyy\n                 But when Nadine Dorries talks about Conservatives thinking the unthinkable, is she advocating a pact with Reform UK or more defections? It's not clear. Another intriguing question: does the Dorries defection increase the possibility of Reform UK landing their biggest catch, the Tories' biggest beast in exile, Boris Johnson? Unlikely. Mr Johnson has said the best way for the Conservatives to counter Farage is to ignore him and not mention him. Sound advice for the Tories and Labour, many would say. Read more:Nadine Dorries becomes latest Tory to defect to Reform Dorries was so devoted to Boris that back in 2016 she sobbed at the news conference when he bottled it and announced he wouldn't stand in the leadership contest after David Cameron quit following his Brexit referendum humiliation. She never had any time for Cameron. In 2012 she denounced the then PM and his chancellor George Osborne as \"two arrogant posh boys who don't know the price of milk\". And when she quit the Commons she launched a \"posh boy\" attack on Rishi Sunak, claiming that as chancellor \"you flashed your gleaming smile in your Prada shoes and Savile Row suit\", delivered \"platitudes\" and spoke about \"how wonderful life was in California\". Though a controversial figure, she does have her fans and supporters, who claim that from a working-class background - like Angela Rayner, anyone? - she's achieved great successes inside and outside politics. Her novels are massively successful, for instance, and have earned her a lot of money. But she missed out on the peerage she claims Boris Johnson promised her. Boris Johnson? Broken promise? Never, surely. Yet in the years after he was ousted, Dorries has remained so devoted to her not-so-secret crush that she wrote a book entitled The Political Assassination Of Boris Johnson. It was full of elaborate conspiracy theories claiming a secret Tory cabal, including Michael Gove and Dominic Cummings brought down her hero. She even claimed Sunak plotted to bring down Johnson by conspiring with a \"frightening individual\" she codenamed Dr No, after the sinister Bond villain. So just how big a prize is Dorries' defection for Reform UK, then? Her I'm a Celebrity jaunt, her novels and her TV chat shows means she passes the famous test. For most of her political career, however, she was a maverick backbencher. It was Johnson who stunned MPs by appointing her to his cabinet as culture secretary. But by the time she quit as a Conservative MP in 2023, plunging the party into an unnecessary by-election which it duly lost, she was already an absentee MP. She hadn't spoken in the Commons for more than a year and had only voted six times in 12 months. Constituents claimed they hadn't seen her \"in years\". In her Mid Bedfordshire constituency in Johnson's 2019 election triumph she had a majority of almost 25,000. Yet in the by-election after she quit Labour won with a swing of more than 20%. In recent months, Dorries has written in her Daily Mail columns about losing three stone by taking the weight loss drug Mounjaro. But she says what's been difficult and agonising for the past 12 months is her decision to leave the Conservative Party after more than 30 years."
    },
    {
        "title": "Reform conference gets under way - as Farage returns from Trump meeting",
        "description": "Farage-led party conferences used to be relatively ramshackle affairs.",
        "url": "https://news.sky.com/story/back-with-a-bang-farage-returns-from-trump-meeting-as-reform-conference-gets-under-way-13424930",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nigel-farage-reform_7011556.jpg?20250905012850",
        "type": "Home",
        "Author": "Rob Powell",
        "Date Published": "2025-09-04 12:56:00",
        "Headline": "Reform's conference takes place on Friday and Saturday in Birmingham, with the cost of living crisis, immigration, and net zero all said to be on the agenda. Nigel Farage will attend fresh from a meeting with Donald Trump at the White House.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n Farage-led party conferences used to be relatively ramshackle affairs. The 2013 UKIP gathering saw then MEP Godfrey Bloom engulfed in a row after declaring that women never cleaned behind the fridge. He followed that up by accusing a group of female party activists of being \"sluts\". And all this took place at a panel event titled \"women in politics\". \"It used to be a case of 'let's go and see the strange people in the reservation',\" said Reform board member and long-time Farage aide Gawain Towler. \"It's chalk and cheese [compared to now], they were rallies of the faithful and this is a conference of a government in waiting,\" he added. While that pronouncement may be premature - and awkward moments of the Bloom-era ilk can never be ruled out - the party of 2025 is certainly a world away, in organisational terms, from the rag-tag operations of yesteryear. As such, this conference will look and feel far more like the annual events of Westminster's established parties.  There are fringe events - with former Tory cabinet ministers Michael Gove and Jacob Rees-Mogg making appearances. Think tanks, pollsters, and mainstream institutes will be in attendance, alongside multinational organisations like Japan Tobacco and TikTok. Property developer Thakeham homes have a full page advert in the conference programme, with the National Farmers Union and British Association for Shooting and Conservation appearing too. That said, one report in the Financial Times suggested other chief executives were still wary of attending in case their presence was seen as a sign of support for the often controversial party. Nevertheless, insiders expect 12,000 people to filed into the NEC across two days, with member tickets sold out but \"platinum\" passes still available for the princely sum of £2,500 - granting holders priority seating and a champagne breakfast with Nigel Farage. The leader himself will speak on Friday afternoon after landing Thursday morning back from Washington, where he had been giving evidence to Congress about freedom of speech as well as squeezing in a meeting with Donald Trump. Read more politics news:Could this be D-Day for Angela Rayner?  Who could be on the guest list? As for the visuals, one official declared simply \"there's always pyro, there are always sparklers\". A \"special guest\" will address the conference before the leader's speech as well, with Reform sources insisting that journalists would not be able to \"waterboard\" the name out of the party in advance. Speculation also abounds over surprise appearances more generally. Could there be any more Tory defectors after Nadine Dorries jumped ship? Or an intervention from across the Atlantic? The former race hate inmate turned self-styled freedom fighter Lucy Connolly is a name being whispered around newsrooms too.  What's on the agenda? As far as policy goes, many of the events focus on the bread and butter of the Reform pitch - migration, free speech, council waste, crime and net zero. But there are also panels on more niche and knotty topics such a high street regeneration, tourism and even car finance. The broader theme of the conference is also relatively restrained with an emphasis on \"the next step\" in its own evolution. Reform clearly wants to project a message to the nation that they are a party that has chiselled off the oddness in favour of a serious set of people and proposals that could genuinely work in government.  That moment is a long way off, though, and while Reform insists it is now presenting valid policies, big question marks still hang over the feasibility and affordability of much the party puts out. From deportation and asylum to nationalisation and benefits, the thread running through the offering seems to be less about any set ideology and more about what is popular with the millions of Britons who feel abandoned by the mainstream political system. In that way, the appeal of Nigel Farage is the same as it has always been. The decades-long rider of waves of public disenchantment, now trying to figure out how to turn the anger into action."
    },
    {
        "title": "Former Russian president warns Moscow may seize 'valuables of the British Crown'",
        "description": "Dmitry Medvedev has warned Moscow may seize \"valuables of the British Crown\" in revenge for the UK using frozen Russian assets to fund military support for Ukraine.",
        "url": "https://news.sky.com/story/former-russian-president-warns-moscow-may-seize-valuables-of-the-british-crown-13425103",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-dmitry-medvedev_7011424.jpg?20250904205814",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-04 18:20:00",
        "Headline": "The key ally of Vladimir Putin also referred to British Foreign Secretary David Lammy as \"the English idiot\" and said Russia could take more Ukrainian land.",
        "Content": "Dmitry Medvedev has warned Moscow may seize \"valuables of the British Crown\" in revenge for the UK using frozen Russian assets to fund military support for Ukraine. The former Russian president, a key ally of Vladimir Putin, issued the warning after Britain announced a package of around £1bn for Kyiv's war effort on Wednesday. UK Defence Secretary John Healey said the package was paid for by frozen Russian assets. In a message shared from his Telegram account, Mr Medvedev, who is deputy chairman of Russia's security council, said Moscow could seize British assets and take more Ukrainian territory in response to the move. He also referred to British Foreign Secretary David Lammy as \"the English idiot\". Mr Medvedev wrote: \"British thieves transferred Russian money to neo-Nazis. Consequences? Britain committed an offence.\" He added that Russia would respond to \"any illegal seizure of frozen Russian funds or profits\" by seizing the \"valuables of the British Crown\" including British property in Russia. \n                  D-Day for Rayner? PM's adviser prepares pivotal verdict - as her lawyers deny giving tax advice\n                 \n                  Reform conference gets under way - as Farage returns from Trump meeting\n                 \n                  Everything you need to know about being a political party member\n                 In response to Russian assets being frozen by the UK, Mr Medvedev wrote: \"Given that the money cannot be recovered in court for obvious reasons, our country has only one way to return the valuables: return it in kind. That is 'Ukrainian land' and other immovable and movable property located on it.\" The UK and other Western allies have been imposing sanctions on Moscow and seizing Russian assets since Mr Putin ordered his forces to invade Ukraine in February 2022. On Wednesday, Britain announced it was imposing sanctions on 11 individuals and entities it claims have been linked with Moscow's alleged attempts to forcibly deport and indoctrinate Ukrainian children. Trump says Europe must put pressure on China Meanwhile, US President Donald Trump joined a call at a summit of Ukraine's allies in Paris on Thursday. A White House official has said Mr Trump \"emphasised that Europe must stop purchasing Russian oil that is funding the war\". The official said Moscow received €1.1bn in fuel sales from the EU in one year and added: \"(Mr Trump) also emphasised that European leaders must place economic pressure on China for funding Russia's war efforts.\" It came after French President Emmanuel Macron said at the summit that 26 of Ukraine's allies have pledged to deploy troops as a \"reassurance force\" for the war-torn country once fighting ends in the conflict with Russia. Speaking after a meeting of the so-called \"coalition of the willing\" in Paris, Mr Macron said the countries had committed to deploying troops in Ukraine - or to maintaining a presence on land, at sea, or in the air - to help guarantee the country's security the day after a ceasefire or peace is achieved. Earlier on Thursday, Mr Macron and other European leaders met with Ukrainian President Volodymyr Zelenskyy and the the US envoy for peace talks, Steve Witkoff, to discuss ways of ensuring long-term military support and continued American backing for Ukraine once the conflict ends. Mr Zelenskyy's office said he had also held a closed-door meeting with Mr Witkoff. Mr Macron said at a news conference alongside Mr Zelenskyy that the reassurance force \"does not have the will or the objective of waging war against Russia\", but will aim \"to prevent any new major aggression and to involve the 26 states very clearly in the lasting security of Ukraine\". Although details of any US participation in the security guarantees remains unclear, both Mr Macron and Mr Zelenskyy said Washington had expressed willingness to be part of the plan, and the Ukrainian president said he was grateful for that. \"As for in what format, I am not yet ready to tell you in detail,\" Mr Zelenskyy added.  The Ukrainian president also said in Paris that he would \"especially like to thank President Trump for all his efforts to end this war and America's readiness to provide support for Ukraine from its side\". \"The planning work will be finalised with the United States,\" Mr Macron said. Prime Minister Sir Keir Starmer and Mr Macron, who lead the \"coalition of the willing\", previously insisted that any European \"reassurance\" force in Ukraine needed the backing of the United States. 'Two killed in Russian strike' In developments on the battlefield, Russia claimed on Thursday that its forces destroyed a launch site for Ukraine's long-range drones in the Chernihiv region. This has not been independently verified. Earlier on Thursday, Ukrainian officials said a Russian missile strike on a humanitarian demining mission near the city of Chernihiv had killed two people. Meanwhile, Ukraine has been targeting Russia's oil refining capacity, with the most recent strikes coming last weekend. Around 11% of Russia's refining capacity has been affected in total so far."
    },
    {
        "title": "Lisbon funicular crash claims 16 lives - all we know as foreign nationals confirmed among fatalities",
        "description": "Portuguese authorities have declared three days of mourning after Lisbon's iconic Gloria funicular crashed, killing 16 people and injuring 23.",
        "url": "https://news.sky.com/story/what-we-know-so-far-about-the-lisbon-funicular-crash-13424712",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/lisbon-funicular-crash_7010736.jpg?20250904071115",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-04 07:04:00",
        "Headline": "There have been reports that the crash happened as a result of a \"cable that came loose\", but officials have refused to be drawn on witness speculation.",
        "Content": " Portuguese authorities have declared three days of mourning after Lisbon's iconic Gloria funicular crashed, killing 16 people and injuring 23. One of the carriages on the railway derailed and crashed during evening rush hour on Wednesday. Emergency services arrived at the scene within minutes to rescue people from the wreckage. Foreign tourists were among the injured and the dead. Of the 16 fatalities, five were Portuguese, two Korean and one Swiss. The identities of the other eight have not been made public yet. Here is what we know so far. What happened? The Gloria funicular, a national monument hugely popular with tourists, was operating as usual between Restauradores Square in downtown Lisbon and the Bairro Alto neighbourhood on Wednesday evening. The journey is just 265m (870ft) and takes three minutes but operates up a steep hill, with two carriages travelling in opposite directions. At around 6pm, the top car reportedly hurtled down the hill before leaving the tracks and crashing into a building 30m (98ft) from the bottom of the line. According to the people who were in the bottom carriage, a few metres into their ascent, it started going backwards. When they saw the other car speeding towards them, they jumped through the windows to escape. Swiss tourist Rasha Abdul told Sky's Europe correspondent Alistair Bunkall her husband escaped first, allowing her to pass their three-year-old son to him before she got out and the top car crashed just metres from them. \"We were afraid it would crash with us - the fact that it crashed there [on the corner] rescued us,\" she said. \"When I went out, everything was dusty and blurry.\" What caused it to derail? It is not clear what caused the funicular to malfunction and derail. Portuguese Prime Minister Luis Montenegro said the public prosecutor's office has opened an investigation. The New York Times reported the Lisbon Firefighters Regiment saying it happened as a result of a \"cable that came loose\". But officials have refused to be drawn on witness speculation that the funicular's brakes were faulty. The leader of the Fectrans union claims workers had expressed concerns about problems with the railway's haulage cable tension that made braking difficult. According to Carris, the company that operates it, appropriate scheduled maintenance had been carried out. Engineer Dave Cooper told Sky News local investigators need to establish why the two carriages \"parted company\". \"The very fact that you can see both cars in the same news shot tells you there's something wrong because while one is at the bottom, the other should be at the top,\" the chairman of the British Standards Committee for Cableways told presenter Gareth Barlow. He said the two cars may have become detached because of a fault with the cables or the point they connect to the carriages. Describing what likely happened, he added: \"That top car has lost suspension. Then what appears to have happened is it comes careering down the hill and goes quite a distance to get to where it's got to. \"It comes to a bend and the rails want it to go around that bend but it careers away and strikes the building.\" The situation will have likely been made worse by the fact that the carriage was at full capacity - weighing up to 14 tonnes in total, Mr Cooper said. Who are the victims? On Thursday, Portugal's civil protection authority said 16 people died in the crash and 23 were injured. All of those killed were adults - eight women and seven men, it said. The details of a further victim who died of their injuries in hospital on Thursday morning have not been revealed. Originally, 17 people were reported dead but this was revised down on Thursday afternoon after officials identified they had duplicated the case of the victim who died in hospital. Only one of the dead has been named so far - Andre Marques - a brakeman who transport workers' union SITRA said died on Wednesday as a result of the crash. Five of the fatalities were Portuguese, two Korean and one Swiss. The identities of the other eight have not been made public yet. Local media is reporting that four of those killed worked for Portugal's biggest charity Misericordia de Lisboa Santa Casa, whose officers are near the funicular. Read more from Sky NewsPutin and Xi caught talking about organ transplantsFrance's government is on the brink of collapseWho is Kim Jong Un's sister? Those injured include 12 women and seven men between the ages of 25 and 65 and a three-year-old child, the Civil Protection authority said. The nationalities of 15 of the injured have been revealed and include three people from Portugal, two from Germany, one from Spain, one from South Korea, one from Cape Verde, one from Canada, one from Italy, one from France, one from Switzerland, and one from Morocco. According to CNN Portugal, the two from Germany were the three-year-old boy and his mother, who were both pulled from the wreckage. The UK's Foreign, Commonwealth and Development Office said it is \"aware of the incident\" and \"in touch with the local authorities\". \"We stand by to provide consular assistance if there are any affected British nationals,\" a spokesperson said in a statement. The funicular opened in 1885 as the second of its kind in the city.\n It was electrified in 1915 after having originally been powered by water counterweight. The Gloria, like the two other funiculars in Lisbon, was designed by the Portuguese engineer Raoul Mesnier de Ponsard. It is the best-known and most popular funicular in the city and is said to transport around three million people a year. The funicular connects downtown's Restauradores Square to the neighbourhood of Bairro Alto at the top of a hill in just three minutes. It departs every 12 minutes from both sides, starting at 7:15am. The last departure is at 11:55pm.\n The view from Bairro Alto is said by many to be the best in Lisbon. What have officials said so far? Lisbon's mayor, Mr Moedas, declared three days of mourning in the city, with Thursday also declared a day of national grief. Speaking at a news conference on Thursday, he said Lisbon \"needs answers\" and that people expect \"accountability and responsibility\". He said all funiculars in the city will remain closed until an investigation concludes. Portugal's Prime Minister Luis Montenegro paid tribute to the victims. \"Today is a day of pain. No words are sufficient to heal your loss and to fill the void that has been left behind by those who have departed,\" he said. The country's Institute of Forensic Medicine is working \"swiftly\" on autopsies so that the bodies of the victims can be returned to their families, Mr Montenegro added. He said that Portuguese authorities are in touch with the families of foreign nationals killed. The Pope sent his \"heartfelt condolences\" and \"spiritual closeness\" to those impacted by the crash, while UK Prime Minister Sir Keir Starmer said his thoughts were with the victims and their families. Ukrainian President Volodymyr Zelenskyy also said he was \"deeply saddened\" by the incident, and United Nations director-general Antonio Guterres said his \"full solidarity\" was with the people of Lisbon. President of the EU Commission Ursula von der Leyen posted on X: \"It is with sadness that I learned of the derailment of the famous 'Elevador da Gloria'. My condolences to the families of the victims.\" Portugal's defence minister Nuno Melo said: \"The accident in Lisbon with the Gloria elevator was a tragedy that caused strong commotion and consternation in Portugal and in the world... I express all my solidarity and offer heartfelt condolences to the families of the victims, wishing a speedy recovery to the injured.\""
    },
    {
        "title": "D-Day for Rayner? PM's adviser prepares pivotal verdict - as her lawyers deny giving tax advice",
        "description": "Sir Keir Starmer could be forced into a decision over Angela Rayner's future as early as today, as the prime minister's ethics adviser prepares his verdict on the Labour deputy's tax affairs.",
        "url": "https://news.sky.com/story/d-day-for-rayner-pms-adviser-prepares-pivotal-verdict-as-her-lawyers-deny-giving-tax-advice-13425261",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-starmer-rayner_7011553.jpg?20250905000247",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-04 22:40:00",
        "Headline": "Sir Laurie Magnus is conducting an investigation into whether Angela Rayner broke ministerial rules by failing to pay the correct amount of stamp duty on a new home, and his findings could be revealed as soon as today.",
        "Content": "Sir Keir Starmer could be forced into a decision over Angela Rayner's future as early as today, as the prime minister's ethics adviser prepares his verdict on the Labour deputy's tax affairs. Ms Rayner, who is also the housing secretary, has been under mounting pressure since she admitted not paying the correct amount of stamp duty on an £800,000 flat in Hove, East Sussex. She has argued the mistake was made as a result of incorrect advice from a conveyancer and two trust law experts, who told her she did not need to pay the higher rate reserved for second home purchases. Her case was thrust into doubt late on Thursday when the conveyancing firm - Verrico & Associates - said it did not provide advice and had been made \"scapegoats\" in the political row. Its managing director, Joanna Verrico, told The Daily Telegraph while it had acted for Ms Rayner when she bought the property, no tax or trust advice was provided. Any advice she may have received will form a key plank of an investigation by Sir Keir's independent ethics guru, Sir Laurie Magnus, who Ms Rayner referred herself to earlier this week. Downing Street has said the prime minister expects a \"quick\" verdict, and he has refused to rule out sacking his second-in-command. \"I will act on whatever the report is that's put in front of me,\" Sir Keir told the BBC on Thursday - and that report may well arrive on his desk today. Sir Laurie has concluded investigations into ex-ministers Nadhim Zahawi and Tulip Siddiq within days - and Sky's chief political correspondent Jon Craig reports he's due to go on holiday on Saturday. He is assessing whether Ms Rayner broke ministerial rules, which place an \"overarching duty on ministers to comply with the law\", \"behave in a way that upholds the highest standards of propriety\", and \"be as open as possible\" with the public. Conservative leader Kemi Badenoch has said Ms Rayner must go. In a statement following the intervention by Verrico & Associates, she said: \"This is yet more damning evidence that Angela Rayner has not been honest with the British public. \"She must resign or Keir Starmer must finally find the backbone to sack her.\" Read more:Key questions left unanswered in Angela Rayner tax rowVictim of misogyny' or 'freeloading' deputy prime minister? The row began when The Daily Telegraph first claimed Ms Rayner avoided £40,000 in stamp duty on the flat in Hove by removing her name from the deeds of another property in Greater Manchester. Ms Rayner said she sold her stake in her family home in Ashton-under-Lyne to a trust that was set up to provide for her teenage son, who has lifelong disabilities - meaning she did not technically own that home when she purchased the flat, and so was not subject to the higher rate of stamp duty that applies to second homes. She has described it as an \"honest mistake\", and tearfully revealed on Sky News' Electoral Dysfunction podcast she had already considered resigning. She said she realised what had happened after seeking fresh legal advice, having spent weeks dismissing questions about the tax claims.  Were Ms Rayner to depart, it would make for a difficult end to a week which began with Sir Keir confidently declaring \"phase two\" of his government was now under way. She is overseeing some of his key targets - notably building 1.5 million new homes this parliament, and a large expansion of workers' rights."
    },
    {
        "title": "Reform conference gets under way - as Farage returns from Trump meeting",
        "description": "Farage-led party conferences used to be relatively ramshackle affairs.",
        "url": "https://news.sky.com/story/back-with-a-bang-farage-returns-from-trump-meeting-as-reform-conference-gets-under-way-13424930",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nigel-farage-reform_7011556.jpg?20250905012850",
        "type": "UK",
        "Author": "Rob Powell",
        "Date Published": "2025-09-04 12:56:00",
        "Headline": "Reform's conference takes place on Friday and Saturday in Birmingham, with the cost of living crisis, immigration, and net zero all said to be on the agenda. Nigel Farage will attend fresh from a meeting with Donald Trump at the White House.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n Farage-led party conferences used to be relatively ramshackle affairs. The 2013 UKIP gathering saw then MEP Godfrey Bloom engulfed in a row after declaring that women never cleaned behind the fridge. He followed that up by accusing a group of female party activists of being \"sluts\". And all this took place at a panel event titled \"women in politics\". \"It used to be a case of 'let's go and see the strange people in the reservation',\" said Reform board member and long-time Farage aide Gawain Towler. \"It's chalk and cheese [compared to now], they were rallies of the faithful and this is a conference of a government in waiting,\" he added. While that pronouncement may be premature - and awkward moments of the Bloom-era ilk can never be ruled out - the party of 2025 is certainly a world away, in organisational terms, from the rag-tag operations of yesteryear. As such, this conference will look and feel far more like the annual events of Westminster's established parties.  There are fringe events - with former Tory cabinet ministers Michael Gove and Jacob Rees-Mogg making appearances. Think tanks, pollsters, and mainstream institutes will be in attendance, alongside multinational organisations like Japan Tobacco and TikTok. Property developer Thakeham homes have a full page advert in the conference programme, with the National Farmers Union and British Association for Shooting and Conservation appearing too. That said, one report in the Financial Times suggested other chief executives were still wary of attending in case their presence was seen as a sign of support for the often controversial party. Nevertheless, insiders expect 12,000 people to filed into the NEC across two days, with member tickets sold out but \"platinum\" passes still available for the princely sum of £2,500 - granting holders priority seating and a champagne breakfast with Nigel Farage. The leader himself will speak on Friday afternoon after landing Thursday morning back from Washington, where he had been giving evidence to Congress about freedom of speech as well as squeezing in a meeting with Donald Trump. Read more politics news:Could this be D-Day for Angela Rayner?  Who could be on the guest list? As for the visuals, one official declared simply \"there's always pyro, there are always sparklers\". A \"special guest\" will address the conference before the leader's speech as well, with Reform sources insisting that journalists would not be able to \"waterboard\" the name out of the party in advance. Speculation also abounds over surprise appearances more generally. Could there be any more Tory defectors after Nadine Dorries jumped ship? Or an intervention from across the Atlantic? The former race hate inmate turned self-styled freedom fighter Lucy Connolly is a name being whispered around newsrooms too.  What's on the agenda? As far as policy goes, many of the events focus on the bread and butter of the Reform pitch - migration, free speech, council waste, crime and net zero. But there are also panels on more niche and knotty topics such a high street regeneration, tourism and even car finance. The broader theme of the conference is also relatively restrained with an emphasis on \"the next step\" in its own evolution. Reform clearly wants to project a message to the nation that they are a party that has chiselled off the oddness in favour of a serious set of people and proposals that could genuinely work in government.  That moment is a long way off, though, and while Reform insists it is now presenting valid policies, big question marks still hang over the feasibility and affordability of much the party puts out. From deportation and asylum to nationalisation and benefits, the thread running through the offering seems to be less about any set ideology and more about what is popular with the millions of Britons who feel abandoned by the mainstream political system. In that way, the appeal of Nigel Farage is the same as it has always been. The decades-long rider of waves of public disenchantment, now trying to figure out how to turn the anger into action."
    },
    {
        "title": "Revealed: Huge shortfall in NHS funding for weight-loss jab",
        "description": "So little money has been set aside by the NHS for the rollout of the Mounjaro weight-loss jab in GP surgeries that as few as one in five people with life-threatening obesity is likely to get treatment, new research shows.",
        "url": "https://news.sky.com/story/revealed160huge-shortfall-in-nhs-funding-for-weight-loss-jab-13424996",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mounjaro-weight-loss_6948297.jpg?20250623033923",
        "type": "UK",
        "Author": "Thomas Moore",
        "Date Published": "2025-09-04 14:32:00",
        "Headline": "New research reveals only one in five eligible patients may receive treatment as local NHS budgets fail to meet demand, sparking concerns over a postcode lottery and rationed care.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n So little money has been set aside by the NHS for the rollout of the Mounjaro weight-loss jab in GP surgeries that as few as one in five people with life-threatening obesity is likely to get treatment, new research shows. The NHS estimates that around 220,000 people living with obesity will be eligible for treatment through their GP over the next three years. But Freedom of Information requests by the British Medical Journal revealed that funding from NHS England has fallen well short of what is needed for the rollout. Just nine out of 40 Integrated Care Boards (ICBs) in England said they had enough funding to treat the 70% of eligible patients who are expected to come forward. Four ICBs - which plan health services in local areas - said NHS funding covered just 25% or fewer of their eligible patients. Coventry and Warwickshire ICB said funding would only stretch to treat 21% of its patients. The findings confirm an investigation by Sky News earlier this summer that access to Mounjaro is a postcode lottery for people living with obesity. Ellen Welch, Doctors' Association UK (DAUK) co-chair, told the BMJ: \"These figures confirm the fear that the rollout is not fit for purpose. \"There is a huge discrepancy between national messaging and what patients are actually being delivered on a local level.\" Read more from Sky News:How fake papers helped family get to BritainBank lobby chief warns Reeves over budget tax raid  Five ICBs admitted they are already considering further tightening the prescribing criteria or rationing the treatment beyond the plan agreed by the NHS. Any change would effectively move the goalposts for people who thought they qualified for NHS treatment. Birmingham and Solihull ICB received funding to cover just 52% of its eligible patients. It admitted: \"Difficult decisions are having to be made to ensure money is spent in the most effective and efficient way possible and for the greatest patient benefit.\" Dr Jonathan Hazlehurst, an obesity specialist and researcher at the University of Birmingham, said NHS England has only provided funding for just over 22,000 patients in the first year of the rollout. \"It shows that there's a lack of political will to fund this adequately,\" he told Sky News. \"NHS England says that obesity costs the NHS £11.4bn per annum as a pure NHS cost. \"Yet we can't even afford to properly fund the rollout of a life-changing drug in year one. That just doesn't make any sense.\" An NHS spokesperson said: \"The NHS is fully supporting the phased rollout of tirzepatide for eligible patients, having issued guidance in line with the NICE guidance, and provided funding to local ICBs to support patient care in March 2025. \"These represent brand-new services in primary care that are being established and scaled up over time, starting with those who are in the most need - and in the meantime, eligible patients can get weight loss support from a range of other services, including the NHS Digital Weight Management programme.\""
    },
    {
        "title": "Man whose arrest sparked Epping hotel protest found guilty of sexual assault of 14-year-old girl",
        "description": "A man whose arrest sparked a series of protests outside an Essex hotel housing asylum seekers, has been found guilty of sexual assault.",
        "url": "https://news.sky.com/story/man-whose-arrest-sparked-epping-hotel-protest-found-guilty-of-sexual-assault-13424933",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-epping-hadush-kebatu_7002838.jpg?20250904165341",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-04 12:58:00",
        "Headline": "Hadush Gerberslasie Kebatu was told by the judge that he should expect to go to prison, when he is sentenced later this month.",
        "Content": " A man whose arrest sparked a series of protests outside an Essex hotel housing asylum seekers, has been found guilty of sexual assault. The Bell Hotel in Epping became the focal point of demonstrations after Hadush Gerberslasie Kebatu was arrested, and later charged, on 13 July with the sexual assault of a 14-year-old girl. Ethiopian national Kebatu, 41, was alleged to have attempted to kiss the teenager, put his hand on her thigh and brushed her hair in July after she offered him pizza. An adult member of the public also accused Kebatu of trying to kiss her, putting his hand on her leg and telling her she was pretty, days after he arrived in the UK on a small boat. Kebatu, who was a \"teacher of sports\" in his home country, had denied two counts of sexual assault, one count of attempted sexual assault, one count of inciting a girl to engage in sexual activity, and one count of harassment without violence near the Bell Hotel. But at Chelmsford Magistrates' Court on Thursday, he was found guilty of all charges. District judge Christopher Williams took just 30 minutes to return the verdicts and his reasoning. The three-day trial heard Kebatu had also told two teenagers he wanted to \"have a baby with each of them\" - but Kebatu had previously told the trial he was \"not a wild animal\". Mr Williams said he was not persuaded there was \"any evidence to suggest the children fabricated any of the evidence they gave\". The defendant, wearing a grey tracksuit and sitting with a translator, gave no visible reaction as Mr Williams told him he was guilty. Kebatu is due to be sentenced at the same court on 23 September. The judge told the defendant that he should expect an \"immediate custodial sentence\". Essex Police Assistant Chief Constable Stuart Hooper paid tribute to the victims for ensuring the evidence put before the court was strong and true. \"It is because of their accounts of what happened, and the close co-operation with our Crown Prosecution Service colleagues, that we have been able to secure this conviction. \"We're acutely aware that this incident has attracted widespread public interest. \"We have always said that we treat and investigate every report made to us without fear or favour.\" 'It must never happen again' Conservative shadow Home Office minister Katie Lam said the guilty verdict showed the risks of allowing asylum seekers \"to roam around communities freely\". \"The crimes of this illegal migrant are shocking and heart-breaking and the victims have shown incredible bravery. \"This must never be allowed to happen again. Every illegal migrant should be detained immediately and swiftly deported.\" The incidents sparked protests and counter-protests outside the former Bell Hotel - as well as at hotels housing asylum seekers across the country. Rebecca Mundy, deputy chief crown prosecutor with CPS East of England, said: \"This was an incident which became a cause of deep concern for the local community. \"Our prosecutors worked carefully and impartially to bring this case to justice according to the law.\""
    },
    {
        "title": "The wife of the heir has changed her hair - and some people need to calm down",
        "description": "How must it feel to live a life where a change in your hairdo over the summer becomes global news?",
        "url": "https://news.sky.com/story/the-wife-of-the-heir-has-changed-her-hair-and-some-people-need-to-calm-down-13425046",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-kate-middleton_7011292.jpg?20250904173345",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-09-04 16:15:00",
        "Headline": "The Princess of Wales has returned to work after the holidays - but it's her hairdo and not her new nature garden project which has been making headlines.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n How must it feel to live a life where a change in your hairdo over the summer becomes global news? Step forward the Princess of Wales back on her first job after the holidays, and cue the headlines, is she blonde or \"bronde\" (a popular hair colour that combines blonde and brunette shades)? I'm no Vidal Sassoon but I can tell you it's not quite as brown anymore. And it's a hairdo that performs spectacularly in the rain (I need her hair product!), as both the Prince William and Kate, and some poor unsuspecting schoolchildren, got caught out in a massive shower. Not exactly the connection with nature they were hoping for, as they were meant to be doing some pond-dipping outside the Natural History Museum looking at their new nature garden project, but the rain stopped all that and sent them indoors. From debates over a longer or shorter cut, or the appearance of \"bangs\" (that's a fringe if you didn't know), Kate has been here many times before. I remember there was once a two-page spread on her eyebrows. So this latest fuss won't come as a surprise, even though there is no doubt some audible eye-rolling behind palace walls. \n                  D-Day for Rayner? PM's adviser prepares pivotal verdict - as her lawyers deny giving tax advice\n                 \n                  Reform conference gets under way - as Farage returns from Trump meeting\n                 \n                  Everything you need to know about being a political party member\n                 \"Is there a message in the new hair?\" is one of the questions I've been asked. Read more:King jokes that his 'bits don't work so well'Queen 'fought off attacker with a shoe' In the past there have been suggestions that she's worn certain clothes to send subtle signals. The simple answer with this one is, ummm, no. But as we head into a new royal term, and after the turmoil of her illness last year, one thing it hopefully will signal is the start of us seeing more of the princess and her work over the coming months. And maybe we can all just calm down about the hair."
    },
    {
        "title": "Nadine Dorries' defection might not be the boon Nigel Farage wants",
        "description": "Nadine Dorries has never forgiven the Conservative Party for ousting her hero Boris Johnson, on whom she continues to lavish praise.",
        "url": "https://news.sky.com/story/nadine-dorries-defection-an-act-of-revenge-on-the-tories-for-ousting-boris-johnson-13425172",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nadine-dorries-reform_7011464.jpg?20250904214209",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-09-04 20:17:00",
        "Headline": "Boris Johnson loyalist Ms Dorries, who resigned from the House of Commons in 2023, said she made the decision to join Reform because the Conservative Party was now \"dead\".",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Nadine Dorries has never forgiven the Conservative Party for ousting her hero Boris Johnson, on whom she continues to lavish praise. Now she's taken her revenge on the Tories by declaring her support for another charismatic political leader: Reform UK's Nigel Farage. Of course, the ex-MP dubbed \"Mad Nad\" by Labour MPs when she was in Parliament has one thing in common with her new party leader. They've both appeared on I'm a Celebrity... Get Me Out Of Here!, Dorries in 2012, without permission, for which she had the Conservative whip withdrawn. And Farage went into the jungle in 2023. So perhaps the pair can now fondly recall eating pigs' testicles, fish eyes, worms and crocodile anus. Or perhaps not. \"The Tory party is dead,\" she declared in the Daily Mail. \"Its members now need to think the unthinkable and look to the future.\" Dead? Like the dead parrot in the famous Monty Python sketch? \"No, it's not, it's resting,\" Tory loyalists will no doubt claim. Not entirely convincingly at present, however. \n                  Carrie Johnson admitted to hospital over 'severe dehydration'\n                 \n                  Ex-PM Boris Johnson and wife announce birth of their fourth child\n                 \n                  Boris Johnson hits out at Donald Trump's 'ghastly' comments to Ukraine President Volodymyr Zelenskyy\n                 But when Nadine Dorries talks about Conservatives thinking the unthinkable, is she advocating a pact with Reform UK or more defections? It's not clear. Another intriguing question: does the Dorries defection increase the possibility of Reform UK landing their biggest catch, the Tories' biggest beast in exile, Boris Johnson? Unlikely. Mr Johnson has said the best way for the Conservatives to counter Farage is to ignore him and not mention him. Sound advice for the Tories and Labour, many would say. Read more:Nadine Dorries becomes latest Tory to defect to Reform Dorries was so devoted to Boris that back in 2016 she sobbed at the news conference when he bottled it and announced he wouldn't stand in the leadership contest after David Cameron quit following his Brexit referendum humiliation. She never had any time for Cameron. In 2012 she denounced the then PM and his chancellor George Osborne as \"two arrogant posh boys who don't know the price of milk\". And when she quit the Commons she launched a \"posh boy\" attack on Rishi Sunak, claiming that as chancellor \"you flashed your gleaming smile in your Prada shoes and Savile Row suit\", delivered \"platitudes\" and spoke about \"how wonderful life was in California\". Though a controversial figure, she does have her fans and supporters, who claim that from a working-class background - like Angela Rayner, anyone? - she's achieved great successes inside and outside politics. Her novels are massively successful, for instance, and have earned her a lot of money. But she missed out on the peerage she claims Boris Johnson promised her. Boris Johnson? Broken promise? Never, surely. Yet in the years after he was ousted, Dorries has remained so devoted to her not-so-secret crush that she wrote a book entitled The Political Assassination Of Boris Johnson. It was full of elaborate conspiracy theories claiming a secret Tory cabal, including Michael Gove and Dominic Cummings brought down her hero. She even claimed Sunak plotted to bring down Johnson by conspiring with a \"frightening individual\" she codenamed Dr No, after the sinister Bond villain. So just how big a prize is Dorries' defection for Reform UK, then? Her I'm a Celebrity jaunt, her novels and her TV chat shows means she passes the famous test. For most of her political career, however, she was a maverick backbencher. It was Johnson who stunned MPs by appointing her to his cabinet as culture secretary. But by the time she quit as a Conservative MP in 2023, plunging the party into an unnecessary by-election which it duly lost, she was already an absentee MP. She hadn't spoken in the Commons for more than a year and had only voted six times in 12 months. Constituents claimed they hadn't seen her \"in years\". In her Mid Bedfordshire constituency in Johnson's 2019 election triumph she had a majority of almost 25,000. Yet in the by-election after she quit Labour won with a swing of more than 20%. In recent months, Dorries has written in her Daily Mail columns about losing three stone by taking the weight loss drug Mounjaro. But she says what's been difficult and agonising for the past 12 months is her decision to leave the Conservative Party after more than 30 years."
    },
    {
        "title": "NHS surgeon jailed for fraud over amputation of own legs for 'sexual gratification' ",
        "description": "A surgeon, who for \"sexual gratification\" deliberately froze his lower legs, leading to them being amputated, has been jailed.",
        "url": "https://news.sky.com/story/nhs-surgeon-jailed-for-fraud-over-amputation-of-own-legs-for-sexual-gratification160-13425035",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-neil-hopper-surgeoun-amputations_7011344.jpg?20250904185958",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-04 16:07:00",
        "Headline": "Neil Hopper, 49, is jailed for 32 months for fraud linked to the amputation of his own lower legs and possession of extreme pornography involving genital mutilation.",
        "Content": "A surgeon, who for \"sexual gratification\" deliberately froze his lower legs, leading to them being amputated, has been jailed. Warning: This article contains details that some readers may find distressing. Neil Hopper, of St Erme, Truro, Cornwall, fraudulently claimed hundreds of thousands of pounds, saying the injuries were \"caused by sepsis\". The 49-year-old NHS vascular surgeon received total payouts of around £466,000 after making claims to two insurance companies. Truro Crown Court heard Hopper used dry ice to freeze his legs to the extent they were no longer viable, requiring amputation - which had long been an ambition of his and one he had a sexual interest in. After receiving the compensation, Hopper spent the money on \"luxury\", prosecutor Nicholas Lee said. He used £255,000 for building works at his home, had a £15,000 hot tub put in and spent £6,000 with a wood burner company. \n                  D-Day for Rayner? PM's adviser prepares pivotal verdict - as her lawyers deny giving tax advice\n                 \n                  Reform conference gets under way - as Farage returns from Trump meeting\n                 \n                  Everything you need to know about being a political party member\n                 Hopper also bought a £22,000 campervan, spent £13,000 on prosthetics and gave £52,000 to his wife. He pleaded guilty to two charges of fraud by false representation and three charges of possessing extreme pornographic images, relating to videos by a website called the EunuchMaker run by Marius Gustavson, which depicted genital mutilation. The judge James Adkin, the honorary recorder of Truro, jailed Hopper for 22 months for the fraud charges and a further 10 months for the extreme images charges. Hopper has not worked at the Royal Cornwall Hospitals NHS Trust since March 2023 and has been under an interim suspension from the medical register since December 2023. Mr Adkin said that in April 2019 Hopper deliberately froze his lower legs \"causing direct damage using dry ice following instructions given by Mr Gustavson\". \"You were admitted to hospital when you have the symptoms of sepsis well knowing what the medics will be looking out,\" he said. The judge said that after six weeks the medics decided his feet could not be saved and they amputated in May that year. \"You subsequently made fraudulent insurance claims to Aviva and Old Mutual Wealth, receiving a total of £466,000 fraudulently by representing that the injuries were organic, caused by sepsis, when you caused the injury seemingly at least in part for sexual gratification.\" Read more from Sky News:Man pleads not guilty after fans struck at Liverpool paradeHow fake papers helped family get to Britain Hopper was identified following investigations into Gustavson, who led an extreme body modification ring which carried out male castration, penis removal and other procedures on people as young as 16. The surgeon also exchanged thousands of messages with Gustavson about his own lower leg amputations and how he had done it, including asking how much dry ice he used. \"It is evident from the messages that Mr Hopper wished to become an amputee and it was always something he had dreamt of,\" Mr Lee said. Defence lawyer Andrew Langdon said his client had grown up in a rural village in Wales and felt he was \"in the wrong body\" from a young age. He said Hopper identified with body integrity identity disorder and those with a desire to amputate one or more healthy limbs. The Royal Cornwall Hospitals Trust said Hopper's colleagues had received support and counselling. \"While the details of the charges are shocking, it is important to stress that the convictions do not relate to Mr Hopper's professional conduct,\" a spokesperson said. They added that comprehensive clinical reviews of surgery carried out by Hopper had been carried out, including by an independent clinical expert who had reviewed decisions to operate. Gustavson, who netted more than £300,000 for 2017 and 2021 from his EunuchMaker website, was jailed for life with a minimum term of 22 years in prison at the Old Bailey last year."
    },
    {
        "title": "Daniel Levy steps down as executive chairman of Tottenham Hotspur",
        "description": "The executive chairman of Tottenham Hotspur, Daniel Levy, has stepped down after nearly 25 years in the role.",
        "url": "https://news.sky.com/story/daniel-levy-steps-down-as-executive-chairman-of-spurs-13425062",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-daniel-levy-spurs-tottenham-hotspur_7011321.jpg?20250904181019",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-04 16:53:00",
        "Headline": "Mr Levy transformed the club during his 25 years in the role, but was often a source of frustration for fans who blame him for failing to deliver the players capable of winning regular silverware.",
        "Content": "The executive chairman of Tottenham Hotspur, Daniel Levy, has stepped down after nearly 25 years in the role. A source close to the Lewis family trust which owns the majority stake in Spurs told Sky News that they want \"more wins more often\" in a \"new era\" for the club. Mr Levy, known for his tough negotiating style, was often a source of frustration for fans who blame him for failing to deliver the players capable of winning regular silverware. But he has also been responsible for transforming the club with a new stadium and a state-of-the-art training ground. Mr Levy is stepping down after playing an instrumental role in bringing in new head coach Thomas Frank following the departure of Ange Postecoglou - who was sacked despite winning the Europa League with the club last season. The victory over Manchester United ended Spurs' 17-year wait for a trophy and will likely be seen as the high point of Mr Levy's time as executive chairman. The win put Spurs in the lucrative Champions League for the seventh time under My Levy - however it also came during a season that Tottenham finished 17th in the Premier League on the back of a club-record of 22 defeats. \n                  D-Day for Rayner? PM's adviser prepares pivotal verdict - as her lawyers deny giving tax advice\n                 \n                  Reform conference gets under way - as Farage returns from Trump meeting\n                 \n                  Everything you need to know about being a political party member\n                 Mr Levy had previously brought in big name managers such as Jose Mourinho and Antonio Conte in failed attempts to bring long-awaited silverware. Before stepping down he was the longest-serving chairman in the Premier League after purchasing a stake in Spurs from Lord Alan Sugar in December 2000. Mr Levy said this evening: \"I am incredibly proud of the work I have done together with the executive team and all our employees. We have built this club into a global heavyweight competing at the highest level. \"More than that, we have built a community. I was lucky enough to work with some of the greatest people in this sport, from the team at Lilywhite House and Hotspur Way to all the players and managers over the years. \"I wish to thank all the fans that have supported me over the years. It hasn't always been an easy journey but significant progress has been made. I will continue to support this club passionately.\" Read more from Sky News:West Bank family describe daily harassmentProbe launched after plot to play sex noises during PMQs  Tottenham FC said in a statement: \"As part of its succession planning, the club has made a number of senior appointments in recent months. Vinai Venkatesham was hired as chief executive officer (CEO), with Thomas Frank as our new men's head coach and Martin Ho as women's head coach. \"Peter Charrington joined the board and will step into the newly created role of non-executive chairman.\" It added: \"There are no changes to the ownership or shareholder structure of the club.\" Mr Charrington said in a statement: \"I am very honoured to become non-executive chairman of this extraordinary club and, on behalf of the board, I would like to thank Daniel and his family for their commitment and loyalty to the club over so many years.\" A source close to the Lewis family trust which owns the majority stake in Tottenham Hotspur told Sky News: \"Generations of the Lewis family support this special football club and they want what the fans want - more wins more often. This is why you have seen recent changes, new leadership and a fresh approach. In Vinai, Thomas and Peter Charrington, they believe they are backing the right team to deliver on this. This is a new era.\" Spurs are ranked ninth on the Forbes soccer rich list with an estimated value of $3.3bn (£2.5bn)."
    },
    {
        "title": "Probe launched after phone plot to play 'sex noises' behind Starmer at PMQs uncovered",
        "description": "An investigation has been launched after security guards foiled a plot to embarrass the prime minister by playing \"sex noises\" from a phone hidden in the Commons.",
        "url": "https://news.sky.com/story/probe-launched-after-phone-plot-to-play-sex-noises-behind-starmer-at-pmqs-uncovered-13425020",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-pmqs-sir-keir-starmer_7011265.jpg?20250904170723",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-04 15:36:00",
        "Headline": "The plan to play sexually explicit noises behind the PM was foiled - but the alleged prank is being seen as a security breach.",
        "Content": "An investigation has been launched after security guards foiled a plot to embarrass the prime minister by playing \"sex noises\" from a phone hidden in the Commons. Parliamentary staff carrying out a routine sweep of the chamber ahead of PMQs uncovered the mobile phone, which had been taped to the underside of the Commons table, Sky News understands. It appears that the device had been set to play a sexually explicit recording if rung, and that the person behind the plot hoped to make this happen as Sir Keir Starmer faced off against Kemi Badenoch on Wednesday lunchtime. Politics latest - live updates But, a Commons source has told Sky News, that parliamentary security guards found the device before it could go off. The source explained that the phone had been attached to the underside of the table, near the front bench, with double-sided sticky tape, and that this had lost its grip, leading to the phone lying exposed on the floor. The phone later rang twice during PMQs with a \"sex noise\" ringtone, but it had already been removed from the chamber. \n                  D-Day for Rayner? PM's adviser prepares pivotal verdict - as her lawyers deny giving tax advice\n                 \n                  Reform conference gets under way - as Farage returns from Trump meeting\n                 \n                  Everything you need to know about being a political party member\n                  However, while the plot - believed to be a prank - was avoided, security staff do not know who was behind it or how the phone came to be there. It is being treated as a serious security breach, and it is understood that there is no clear footage of the phone being planted. A spokesperson for The Metropolitan Police said: \"At 10.25hrs on Wednesday, 3 September a mobile phone was found during a routine search of the House of Commons chamber by Met officers. \"Enquiries have led officers to believe that the phone was purposely placed in a location with the aim of causing disruption to business in the House. \"An investigation has been launched and enquiries are ongoing. We have updated the Speaker and Clerk of the House.\" A UK Parliament spokesperson said: \"Parliament is a public building and we facilitate the visits of thousands of people to the estate each week. \"The safety and security of everyone who works or visits here remains our top priority, and we have robust and proactive security measures in place - this includes ensuring that visitors and their belongings are security screened, along with monitoring and routine searches of areas that are open to the public. \"Whilst we cannot comment on the detail of our processes, we can confirm that a mobile phone was removed from the Commons Chamber on 3 September - demonstrating the effectiveness of the security measures we have in operation.\" Hundreds of parliamentary security staff were on strike over pay and conditions on Wednesday morning, meaning visitors were banned from the parliamentary estate. It is not the first time there have been breaches of parliamentary security in recent years. A group of semi-naked men and women glued themselves to the glass of the public gallery in the Commons in 2019, to protest about climate change. A dozen people were subsequently arrested. Responding to a request for comment, a parliamentary spokesperson said: \"The safety and security of all those who work in Parliament is our top priority, however we cannot comment on specific security measures.\""
    },
    {
        "title": "Lisbon funicular crash claims 16 lives - all we know as foreign nationals confirmed among fatalities",
        "description": "Portuguese authorities have declared three days of mourning after Lisbon's iconic Gloria funicular crashed, killing 16 people and injuring 23.",
        "url": "https://news.sky.com/story/what-we-know-so-far-about-the-lisbon-funicular-crash-13424712",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/lisbon-funicular-crash_7010736.jpg?20250904071115",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-04 07:04:00",
        "Headline": "There have been reports that the crash happened as a result of a \"cable that came loose\", but officials have refused to be drawn on witness speculation.",
        "Content": " Portuguese authorities have declared three days of mourning after Lisbon's iconic Gloria funicular crashed, killing 16 people and injuring 23. One of the carriages on the railway derailed and crashed during evening rush hour on Wednesday. Emergency services arrived at the scene within minutes to rescue people from the wreckage. Foreign tourists were among the injured and the dead. Of the 16 fatalities, five were Portuguese, two Korean and one Swiss. The identities of the other eight have not been made public yet. Here is what we know so far. What happened? The Gloria funicular, a national monument hugely popular with tourists, was operating as usual between Restauradores Square in downtown Lisbon and the Bairro Alto neighbourhood on Wednesday evening. The journey is just 265m (870ft) and takes three minutes but operates up a steep hill, with two carriages travelling in opposite directions. At around 6pm, the top car reportedly hurtled down the hill before leaving the tracks and crashing into a building 30m (98ft) from the bottom of the line. According to the people who were in the bottom carriage, a few metres into their ascent, it started going backwards. When they saw the other car speeding towards them, they jumped through the windows to escape. Swiss tourist Rasha Abdul told Sky's Europe correspondent Alistair Bunkall her husband escaped first, allowing her to pass their three-year-old son to him before she got out and the top car crashed just metres from them. \"We were afraid it would crash with us - the fact that it crashed there [on the corner] rescued us,\" she said. \"When I went out, everything was dusty and blurry.\" What caused it to derail? It is not clear what caused the funicular to malfunction and derail. Portuguese Prime Minister Luis Montenegro said the public prosecutor's office has opened an investigation. The New York Times reported the Lisbon Firefighters Regiment saying it happened as a result of a \"cable that came loose\". But officials have refused to be drawn on witness speculation that the funicular's brakes were faulty. The leader of the Fectrans union claims workers had expressed concerns about problems with the railway's haulage cable tension that made braking difficult. According to Carris, the company that operates it, appropriate scheduled maintenance had been carried out. Engineer Dave Cooper told Sky News local investigators need to establish why the two carriages \"parted company\". \"The very fact that you can see both cars in the same news shot tells you there's something wrong because while one is at the bottom, the other should be at the top,\" the chairman of the British Standards Committee for Cableways told presenter Gareth Barlow. He said the two cars may have become detached because of a fault with the cables or the point they connect to the carriages. Describing what likely happened, he added: \"That top car has lost suspension. Then what appears to have happened is it comes careering down the hill and goes quite a distance to get to where it's got to. \"It comes to a bend and the rails want it to go around that bend but it careers away and strikes the building.\" The situation will have likely been made worse by the fact that the carriage was at full capacity - weighing up to 14 tonnes in total, Mr Cooper said. Who are the victims? On Thursday, Portugal's civil protection authority said 16 people died in the crash and 23 were injured. All of those killed were adults - eight women and seven men, it said. The details of a further victim who died of their injuries in hospital on Thursday morning have not been revealed. Originally, 17 people were reported dead but this was revised down on Thursday afternoon after officials identified they had duplicated the case of the victim who died in hospital. Only one of the dead has been named so far - Andre Marques - a brakeman who transport workers' union SITRA said died on Wednesday as a result of the crash. Five of the fatalities were Portuguese, two Korean and one Swiss. The identities of the other eight have not been made public yet. Local media is reporting that four of those killed worked for Portugal's biggest charity Misericordia de Lisboa Santa Casa, whose officers are near the funicular. Read more from Sky NewsPutin and Xi caught talking about organ transplantsFrance's government is on the brink of collapseWho is Kim Jong Un's sister? Those injured include 12 women and seven men between the ages of 25 and 65 and a three-year-old child, the Civil Protection authority said. The nationalities of 15 of the injured have been revealed and include three people from Portugal, two from Germany, one from Spain, one from South Korea, one from Cape Verde, one from Canada, one from Italy, one from France, one from Switzerland, and one from Morocco. According to CNN Portugal, the two from Germany were the three-year-old boy and his mother, who were both pulled from the wreckage. The UK's Foreign, Commonwealth and Development Office said it is \"aware of the incident\" and \"in touch with the local authorities\". \"We stand by to provide consular assistance if there are any affected British nationals,\" a spokesperson said in a statement. The funicular opened in 1885 as the second of its kind in the city.\n It was electrified in 1915 after having originally been powered by water counterweight. The Gloria, like the two other funiculars in Lisbon, was designed by the Portuguese engineer Raoul Mesnier de Ponsard. It is the best-known and most popular funicular in the city and is said to transport around three million people a year. The funicular connects downtown's Restauradores Square to the neighbourhood of Bairro Alto at the top of a hill in just three minutes. It departs every 12 minutes from both sides, starting at 7:15am. The last departure is at 11:55pm.\n The view from Bairro Alto is said by many to be the best in Lisbon. What have officials said so far? Lisbon's mayor, Mr Moedas, declared three days of mourning in the city, with Thursday also declared a day of national grief. Speaking at a news conference on Thursday, he said Lisbon \"needs answers\" and that people expect \"accountability and responsibility\". He said all funiculars in the city will remain closed until an investigation concludes. Portugal's Prime Minister Luis Montenegro paid tribute to the victims. \"Today is a day of pain. No words are sufficient to heal your loss and to fill the void that has been left behind by those who have departed,\" he said. The country's Institute of Forensic Medicine is working \"swiftly\" on autopsies so that the bodies of the victims can be returned to their families, Mr Montenegro added. He said that Portuguese authorities are in touch with the families of foreign nationals killed. The Pope sent his \"heartfelt condolences\" and \"spiritual closeness\" to those impacted by the crash, while UK Prime Minister Sir Keir Starmer said his thoughts were with the victims and their families. Ukrainian President Volodymyr Zelenskyy also said he was \"deeply saddened\" by the incident, and United Nations director-general Antonio Guterres said his \"full solidarity\" was with the people of Lisbon. President of the EU Commission Ursula von der Leyen posted on X: \"It is with sadness that I learned of the derailment of the famous 'Elevador da Gloria'. My condolences to the families of the victims.\" Portugal's defence minister Nuno Melo said: \"The accident in Lisbon with the Gloria elevator was a tragedy that caused strong commotion and consternation in Portugal and in the world... I express all my solidarity and offer heartfelt condolences to the families of the victims, wishing a speedy recovery to the injured.\""
    },
    {
        "title": "Legendary fashion designer Giorgio Armani dies",
        "description": "Legendary fashion designer Giorgio Armani has died aged 91 - with the worlds of fashion and showbiz paying tribute to a \"giant\" and a \"master of his craft\".",
        "url": "https://news.sky.com/story/legendary-fashion-designer-giorgio-armani-dies-13424939",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-giorgio-armani-italy_7011167.jpg?20250904145742",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-04 13:13:00",
        "Headline": "Armani originally wanted to be a doctor but changed his mind after a part-time job as a window dresser in Milan exposed him to fashion for the first time.",
        "Content": " Legendary fashion designer Giorgio Armani has died aged 91 - with the worlds of fashion and showbiz paying tribute to a \"giant\" and a \"master of his craft\". The Italian billionaire died at home surrounded by his family on Thursday. \"With infinite sorrow, the Armani Group announces the passing of its creator, founder, and tireless driving force: Giorgio Armani,\" his fashion house said. Tributes flood in for Armani - as it happened \"Il Signor Armani, as he was always respectfully and admiringly called by employees and collaborators, passed away peacefully, surrounded by his loved ones. \"Indefatigable to the end, he worked until his final days, dedicating himself to the company, the collections, and the many ongoing and future projects.\" A funeral chamber will be set up at Milan's Armani Teatro for people to pay tribute between 9am and 6pm this weekend. Armani did not appear at his runway shows in Milan for the first time ever in June as he recovered from an unknown illness. Only a week ago, when he was interviewed by the Financial Times, he revealed he \"oversaw every aspect of the show remotely via video link\". \"My greatest weakness is that I am in control of everything,\" he told the newspaper. \"Everything you will see has been done under my direction and carries my approval.\" 'A symbol of the best of Italy' Italy's President Giorgia Meloni was among the first to pay tribute. \"Giorgio Armani leaves us at 91 years old,\" she wrote on X. \"With his elegance, sobriety, and creativity, he was able to bring lustre to Italian fashion and inspire the entire world. An icon, a tireless worker, a symbol of the best of Italy. Thank you for everything.\" Fellow fashion mogul Donatella Versace followed, saying: \"The world has lost a giant today. He made history and will be remembered forever.\" American designer Ralph Lauren said he \"always had the deepest respect and admiration\" for Armani. Dame Anna Wintour, who this year stepped down as head of American Vogue after 37 years, said the designer \"understood power and attitude and elegance as well as anyone ever has in fashion\". Julia Roberts, who famously wore Armani menswear to the Golden Globe awards in 1990, shared a picture of the pair together on Instagram with the caption: \"A true friend. A Legend.\" American model Cindy Crawford called him a \"master of his craft\" - while the Italian football world also offered its condolences. Juventus described him as a \"timeless icon of elegance and Italian style\". Inter Milan, who Armani supported, said he was \"an icon of our city, a fashion legend who, with his creativity and elegance, knew how to tell the story of Italianness around the world\". Legendary film director Martin Scorsese also paid tribute, heralding Armani as \"more than a clothing designer\". \"He was a real artist, and a great one - people use the term 'timeless' quite often, but in his case it happens to be true,\" said Scorsese. Armani contributed to the wardrobe design for the director's 1995 film Casino, creating suits for Robert De Niro's character, Ace Rothstein. The pair came together again for The Wolf of Wall Street (2013), where Armani this time suited up Leonardo DiCaprio.  'King Giorgio' Born in the small northern Italian town of Piacenza in July 1934, Armani originally wanted to be a doctor but changed his mind after a part-time job as a window dresser at a Milan store exposed him to fashion for the first time. As one of the most influential designers of the 20th century, he is often credited with spearheading red carpet fashion and was planning a major event during Milan Fashion Week this month to mark 50 years of his brand. He put Italian ready-to-wear style on the map in the late 1970s with his signature 'Armani suit' before adapting its classic style for women with the launch of the female 'power suit' in the 1980s. He also dressed Hollywood and music stars, including Julia Roberts, George Clooney, Cate Blanchett, and Lady Gaga. Read more:From Gere to Gaga: Armani's best celebrity looks Armani, or Re Giorgio (King Giorgio) as he was widely known, worked on more than 200 films, most notably earlier in his career on American Gigolo with Richard Gere in 1980. He was awarded both the French Legion of Honour and Italian Order of Merit for Labour for his contributions to the fashion industry. With an empire of more than £7.44bn at the time of his death, his work expanded beyond clothes to home furnishings, perfumes, books, flowers, bars, clubs, and restaurants. He also owned the basketball team EA7 Armani Milan, better known as Olympia Milano. Armani sparked controversy in 2015 for comments he made about fashion choices among gay men - and previously in 2009 when his company was forced to settle with the Italian tax authorities over its offshore subsidiaries."
    },
    {
        "title": "From Gere to Gaga: The best celebrity looks created by Giorgio Armani",
        "description": "Italian fashion designer Giorgio Armani, known for ready-to-wear fashion and staple suits, has died.",
        "url": "https://news.sky.com/story/from-gere-to-gaga-the-best-celebrity-looks-created-by-giorgio-armani-13424949",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-giorgio-armani-celebrities_7011253.jpg?20250904164413",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-04 13:26:00",
        "Headline": "Throughout his career, Giorgio Armani dressed many of the rich and famous in Hollywood. Here, we look-back at some of his most iconic designs, and who wore them.",
        "Content": "Italian fashion designer Giorgio Armani, known for ready-to-wear fashion and staple suits, has died. The 91-year-old started the fashion house in 1975 with his partner Sergio Galeotti, but it is the 1980 classic film American Gigolo that is credited with launching Armani's career. He designed the wardrobe for the film's star, Richard Gere, who was launched into the spotlight as America's new favourite heart throb, and Armani as one of the most popular designers. Over his career, he earned over 200 wardrobe credits. Giorgio Armani latest: Follow live updates As well as dressing actors on screen, red carpets were filled with Armani's tailored black tie outfits and evening gowns, with everyone from Jodie Foster, Beyonce and Diane Keaton wearing his designs. Here, we look at some of Armani's iconic looks created for both the big screen and the red carpet. Diane Keaton wore a custom double-breasted jacket to the 1978 Academy Awards, where she won Best Actress for her performance in Woody Allen's romantic comedy Annie Hall. Richard Gere stars in American Gigolo. The suits made by Armani were originally for John Travolta, who later dropped out of the film and was replaced by Gere. Grace Jones wore a man's wide-shouldered Armani blazer on the cover of the 1981 album Nightclubbing. Julia Roberts wore an oversized men's Armani suit at the 1990 Golden Globes. The look has become iconic in fashion history as the actress stepped away from wearing the conventional ballgown. Armani collaborated with Goodfellas director Martin Scorsese to create suits for Robert De Niro, Ray Liotta, Joe Pesci in the 1990 classic film. Jodie Foster wore an Armani suit at the 1992 Academy Awards, where she won Best Actress for The Silence Of The Lambs. When Tom Cruise tied the knot with actress Katie Holmes in 2006, it was Armani who was tasked with creating her wedding dress. Performing her hit song All The Single Ladies at the 2008 American Music Awards, Beyonce wore a custom Armani bodysuit. David and Victoria Beckham wore Armani at the 2008 Met Gala in New York. The theme was superheroes: fashion and fantasy and Armani co-chaired the gala that year. Lady Gaga wore a galactic-inspired dress at the 2010 Grammy Awards, which was part of Giorgio Armani Prive - the designer's haute couture collection. The outfit turned heads as it was unlike Armani's typical styles. Demi Moore wore a sculpted gold gown at this year's Golden Globes, where she won Best Performance by a Female Actor for her role in The Substance."
    },
    {
        "title": "Former Russian president warns Moscow may seize 'valuables of the British Crown'",
        "description": "Dmitry Medvedev has warned Moscow may seize \"valuables of the British Crown\" in revenge for the UK using frozen Russian assets to fund military support for Ukraine.",
        "url": "https://news.sky.com/story/former-russian-president-warns-moscow-may-seize-valuables-of-the-british-crown-13425103",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-dmitry-medvedev_7011424.jpg?20250904205814",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-04 18:20:00",
        "Headline": "The key ally of Vladimir Putin also referred to British Foreign Secretary David Lammy as \"the English idiot\" and said Russia could take more Ukrainian land.",
        "Content": "Dmitry Medvedev has warned Moscow may seize \"valuables of the British Crown\" in revenge for the UK using frozen Russian assets to fund military support for Ukraine. The former Russian president, a key ally of Vladimir Putin, issued the warning after Britain announced a package of around £1bn for Kyiv's war effort on Wednesday. UK Defence Secretary John Healey said the package was paid for by frozen Russian assets. In a message shared from his Telegram account, Mr Medvedev, who is deputy chairman of Russia's security council, said Moscow could seize British assets and take more Ukrainian territory in response to the move. He also referred to British Foreign Secretary David Lammy as \"the English idiot\". Mr Medvedev wrote: \"British thieves transferred Russian money to neo-Nazis. Consequences? Britain committed an offence.\" He added that Russia would respond to \"any illegal seizure of frozen Russian funds or profits\" by seizing the \"valuables of the British Crown\" including British property in Russia. \n                  D-Day for Rayner? PM's adviser prepares pivotal verdict - as her lawyers deny giving tax advice\n                 \n                  Reform conference gets under way - as Farage returns from Trump meeting\n                 \n                  Everything you need to know about being a political party member\n                 In response to Russian assets being frozen by the UK, Mr Medvedev wrote: \"Given that the money cannot be recovered in court for obvious reasons, our country has only one way to return the valuables: return it in kind. That is 'Ukrainian land' and other immovable and movable property located on it.\" The UK and other Western allies have been imposing sanctions on Moscow and seizing Russian assets since Mr Putin ordered his forces to invade Ukraine in February 2022. On Wednesday, Britain announced it was imposing sanctions on 11 individuals and entities it claims have been linked with Moscow's alleged attempts to forcibly deport and indoctrinate Ukrainian children. Trump says Europe must put pressure on China Meanwhile, US President Donald Trump joined a call at a summit of Ukraine's allies in Paris on Thursday. A White House official has said Mr Trump \"emphasised that Europe must stop purchasing Russian oil that is funding the war\". The official said Moscow received €1.1bn in fuel sales from the EU in one year and added: \"(Mr Trump) also emphasised that European leaders must place economic pressure on China for funding Russia's war efforts.\" It came after French President Emmanuel Macron said at the summit that 26 of Ukraine's allies have pledged to deploy troops as a \"reassurance force\" for the war-torn country once fighting ends in the conflict with Russia. Speaking after a meeting of the so-called \"coalition of the willing\" in Paris, Mr Macron said the countries had committed to deploying troops in Ukraine - or to maintaining a presence on land, at sea, or in the air - to help guarantee the country's security the day after a ceasefire or peace is achieved. Earlier on Thursday, Mr Macron and other European leaders met with Ukrainian President Volodymyr Zelenskyy and the the US envoy for peace talks, Steve Witkoff, to discuss ways of ensuring long-term military support and continued American backing for Ukraine once the conflict ends. Mr Zelenskyy's office said he had also held a closed-door meeting with Mr Witkoff. Mr Macron said at a news conference alongside Mr Zelenskyy that the reassurance force \"does not have the will or the objective of waging war against Russia\", but will aim \"to prevent any new major aggression and to involve the 26 states very clearly in the lasting security of Ukraine\". Although details of any US participation in the security guarantees remains unclear, both Mr Macron and Mr Zelenskyy said Washington had expressed willingness to be part of the plan, and the Ukrainian president said he was grateful for that. \"As for in what format, I am not yet ready to tell you in detail,\" Mr Zelenskyy added.  The Ukrainian president also said in Paris that he would \"especially like to thank President Trump for all his efforts to end this war and America's readiness to provide support for Ukraine from its side\". \"The planning work will be finalised with the United States,\" Mr Macron said. Prime Minister Sir Keir Starmer and Mr Macron, who lead the \"coalition of the willing\", previously insisted that any European \"reassurance\" force in Ukraine needed the backing of the United States. 'Two killed in Russian strike' In developments on the battlefield, Russia claimed on Thursday that its forces destroyed a launch site for Ukraine's long-range drones in the Chernihiv region. This has not been independently verified. Earlier on Thursday, Ukrainian officials said a Russian missile strike on a humanitarian demining mission near the city of Chernihiv had killed two people. Meanwhile, Ukraine has been targeting Russia's oil refining capacity, with the most recent strikes coming last weekend. Around 11% of Russia's refining capacity has been affected in total so far."
    },
    {
        "title": "Taliban reports sharp rise in death toll following earthquake in eastern Afghanistan, as aid agencies issue warning",
        "description": "The number of people killed following a deadly earthquake in eastern Afghanistan has risen sharply to 2,205, according to the Taliban government.",
        "url": "https://news.sky.com/story/taliban-reports-sharp-rise-in-death-toll-following-earthquake-in-eastern-afghanistan-as-aid-agencies-issue-warning-13424914",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-afghanistan-earthquake_7011100.jpg?20250904140129",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-04 12:21:00",
        "Headline": "Thousands of people have been left homeless, and humanitarian needs are \"vast and growing rapidly\", according to aid agencies.",
        "Content": "The number of people killed following a deadly earthquake in eastern Afghanistan has risen sharply to 2,205, according to the Taliban government. The increase, from more than 1,400 deaths reported on Tuesday, coincides with rescuers being hampered by harsh weather and rugged terrain, while aid agencies warned of dwindling resources. The 6.0 magnitude quake struck several provinces in a mountainous and remote area of the country near the Pakistan border, at around 11.47pm (8.17pm UK time) on Sunday. Afghanistan's deadliest earthquake in years levelled villages, destroying thousands of homes, and trapping people under rubble. At least 3,640 people have been injured.  The majority of casualties have been in Kunar, where many live in steep river valleys separated by high mountains. Taliban spokesman Hamdullah Fitrat said rescue and search efforts were continuing: \"Tents have been set up for people, and the delivery of first aid and emergency supplies is ongoing.\" More than 6,700 homes have been destroyed, authorities have said. \n                  Has China humiliated Trump?\n                 \n                  Moving Afghan nationals to UK forecast to cost more than £2bn\n                 \n                  Afghanistan earthquake: A catastrophe compounded by Trump's aid cuts\n                 But while officials have deployed helicopters and airdropped army commandos to help survivors, the rough terrain is hindering relief efforts. Aid workers have reported walking for hours to reach villages cut off by landslides and rockfall. Afghanistan was already struggling with the impact of climate change, particularly drought, a weak economy and the return of some two million Afghans from neighbouring countries. Sunday's earthquake is the third to devastate the country since the Taliban seized power in 2021. On Wednesday, the defence ministry said the Afghan air force moved more than 1,900 people in 155 flights over two days, and delivered 10,000kg of supplies across the region. The UK has pledged £1m in emergency funding to be split between humanitarian agencies instead of the Taliban government, which the UK does not recognise. Read more from Sky News:Women more at risk after quake6.1-magnitude quake hits TurkeyRelocating Afghans to cost over £2bn Humanitarian needs are \"vast and growing rapidly\", said the International Federation of Red Cross and Red CrescentSocieties. \"Up to 84,000 people are directly and indirectly affected, with thousands displaced,\" it added. In some of the worst-affected villages in Kunar province, two in three people had been killed or injured, while 98% of buildings were either destroyed or damaged by the tremors, according to an assessment by British-based charity Islamic Relief Worldwide. The Norwegian Refugee Council said it had fewer than 450 staff in Afghanistan, no emergency stock and an urgent need for funds. \"We have only $100,000 (£74,500) available to support emergency response efforts. This leaves an immediate funding gap of $1.9 million (£1.42m),\" said Maisam Shafiey, from the humanitarian organisation."
    },
    {
        "title": "'At night we don't sleep': West Bank family describe daily harassment by young Israeli settlers",
        "description": "The further we go, the rougher the terrain becomes, jolting the car as we drive along a mountain track strewn with rocks. ",
        "url": "https://news.sky.com/story/at-night-we-dont-sleep-west-bank-family-terrorised-by-young-israeli-settlers-13424645",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-parsons-west-bank_7010680.jpg?20250904024836",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-09-04 01:15:00",
        "Headline": "The settlements are widely considered illegal under international law, but the Israeli government is lending them ever more support and legitimacy.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  The further we go, the rougher the terrain becomes, jolting the car as we drive along a mountain track strewn with rocks.  And then we round a corner and there is a sleeping dog, a circle of chairs and two women smiling and beckoning us to follow them. This is Fatima and her mother-in-law, Fadda. They live in a makeshift camp perched on a rocky ledge. Behind their tent is a cave, in which there are chickens and a bed. In front of it is the path where we now stand, and then a precipice that looks down upon a ravine. They invite us into a tent to talk. Sweet tea is brought out, and so is the story of how their home was demolished, their car stolen, their peace destroyed and why they now have to hide their flock of sheep. But before all that, Fatima takes us out and points at a ridge behind their camp. We can see a small black structure, just visible against the dark rock. \"That is where they are,\" she says. \"The settlers come down from there.\" Every day, people come down to her home. Unwelcome visitors. \"We'd be baking bread, and they would come, lay out their mattresses and just sit there. When we told them to leave, they'd return with more settlers and an armed soldier.\" And the soldier, always, would be on the side of the settlers. \"At night we don't sleep,\" says Fadda, smiling through the pain. \"We stay awake waiting for the settlers. Four or five of them come in their cars each night, sometimes on motorcycles, right up to our doorstep to terrify the children. \"We sit through the night, afraid they'll set fire to our homes and belongings, trying to force us to flee with our kids.\" We see videos, shared widely on social media, of Fadda confronting a young settler who has come to menace the family. He stands right in front of her, staring her straight in the eyes, trying to push her forward. Fadda responds by standing her ground, smiling gently at him. \"This happens every single day,\" says Fatima. \"If we didn't stand up for ourselves, we would have left long ago. The problem is, they're children. \"They send the kids down on purpose to provoke us, to push us off our land. That's why we've had to build this resilience.\" Their tale of suffering is desperate. They tell me the family used to live in a house, which was demolished by the Israel military. An hour later we drive past its remains - a huge pile of twisted metal and rubble. Their car has been taken so they have to walk to distant shops under the baking sun. Mobile phones have been stolen along with computers and animals. Their flock of sheep is now kept in another place, hidden from sight. 'This is our land' \"The situation has become really bad,\" says Fatima. \"Not just for us, but for the whole West Bank.\" And yet the family is determined to stay. \"This is our land,\" say both women, almost in unison. The brutal truth is also that they have nowhere else to go. The West Bank is dotted with Israeli settlements, from top to bottom, some large and long-established, with thousands of residents and a sprawling infrastructure; some small and very new, with just a few caravans parked on a hilltop. All of them are based on the idea of extending the reach of the Israeli state by placing its people all over the West Bank, or at least turning a blind eye to them moving there. The fact that these settlements are, by widespread consent, illegal under international law has not stopped them from proliferating. Quite the opposite. Not only are they growing in number and size, but the Israeli government is lending them ever more support and legitimacy. Read more:Inside the conflict forcing Palestinians from their homesWest Bank: The city locked down by armed troops Now, the far-right finance minister, Bezalel Smotrich, has declared that it's time for Israel to annex more than 82% of the West Bank. His logic can be summed up like this: we're not safe with neighbours like this, and according to the Bible, it should be our land anyway. Not everyone will agree, and perhaps most outside Israel will strongly disagree, but Smotrich is, as always, unapologetic and unabashed. \"Beyond our Biblical, historical and moral right to the entire land of Israel, the political and security role of sovereignty is to ensure that a Palestinian Arab terror state is never established in our land,\" he said. \"Enemies should be fought, not provided with comfortable lives.\" The West Bank has, for decades, been a crucible for ever-growing mistrust and dislike. It has seen waves of terrible violence and chronic divisions. There is no sign of things improving, but plenty of suggestions that they are getting worse."
    },
    {
        "title": "Israeli bombardment pushes more Palestinians out of their homes",
        "description": "Israeli bombardment of Gaza City is pushing more Palestinians out of their homes, residents have said.",
        "url": "https://news.sky.com/story/israeli-bombardment-pushes-more-palestinians-out-of-their-homes-13424782",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-gaza-city-palestinians_7011074.jpg?20250904133742",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-04 09:08:00",
        "Headline": "A new wave of Israeli military air and ground strikes have destroyed homes and caused fires in tent encampments around Gaza City.",
        "Content": "Israeli bombardment of Gaza City is pushing more Palestinians out of their homes, residents have said. Gaza health authorities said Israeli fire had killed at least 28 people on Thursday, most of them in Gaza City, where Israeli forces have advanced through the outer suburbs and are now only a few miles from the centre. Israel launched its latest offensive in August with Prime Minister Benjamin Netanyahu saying it was designed to defeat Hamas militants in the city, but the campaign has prompted international criticism because of the dire humanitarian crisis in the area. It has also provoked unusual concerns within Israel, including accounts of tension over strategy between some military commanders and political leaders. A number of Israelis took part in nationwide demonstrations on Wednesday to protest against the call-up of 60,000 reservists for the expanded operation amid fears it could endanger hostages still held in Gaza. Residents said Israel bombarded Gaza City's Zeitoun, Sabra and Shejaia districts from ground and air. They said tanks pushed into the eastern part of the Sheikh Radwan district, situated northwest of the city centre, destroying houses and causing fires in tent encampments. There was no immediate Israeli comment on the reports, but its military has previously said it is operating on the outskirts of the city to dismantle militants' tunnels and locate weapons. Much of Gaza City was destroyed in the conflict's initial weeks in October-November 2023. About a million people lived there before the war. Hundreds of thousands are believed to have returned to live among the ruins, and since Israel ordered people out of other areas and launched offensives elsewhere. Israel has told civilians to leave Gaza City for their safety and, says 70,000 have done so, but Palestinian officials say less than half that number have left, and many thousands are still in the path of Israel's advance. Nelson Mandela's grandson has said Palestinians' lives under Israeli occupation are worse than anything Black South Africans experienced under apartheid, and he urged the global community to come to their aid. Mandla Mandela, 51, told Reuters news agency on Wednesday: \"Many of us that have visited the occupied territories in Palestine have only come back with one conclusion: that the Palestinians are experiencing a far worse form of apartheid than we ever experienced. \"We believe that the global community has to continue supporting the Palestinians, just as they stood side-by-side with us.\" Read more:'At night we don't sleep': The West Bank family facing harassmentInside the conflict forcing Palestinians from their homes  Meanwhile, the United Arab Emirates has warned any Israeli move to annex the occupied West Bank would be a \"red line\". The UAE was the driving force behind the 2020 Abraham Accords brokered by US President Donald Trump, in which it and three other Arab countries forged ties with Israel. Lana Nusseibeh, assistant minister for political affairs and envoy of the minister of foreign affairs of the UAE, told Reuters \"annexation in the West Bank would constitute a red line for the UAE\", as it would severely undermine \"the vision and spirit\" of the Abraham Accords and end the pursuit of regional integration."
    },
    {
        "title": "FIFA to use dynamic pricing for 2026 World Cup tickets - here's what you need to know",
        "description": "Tickets for next year's FIFA World Cup will use dynamic pricing, meaning fans will pay different prices according to demand.",
        "url": "https://news.sky.com/story/fifa-to-use-dynamic-pricing-for-2026-world-cup-tickets-heres-what-you-need-to-know-13424718",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-world-cup-2022-argentina_7011028.jpg?20250904124312",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-04 07:07:00",
        "Headline": "The first chance to get tickets for next year's World Cup in the US, Mexico and Canada is happening next month. Here's all you need to know.",
        "Content": "Tickets for next year's FIFA World Cup will use dynamic pricing, meaning fans will pay different prices according to demand. Those keen to go to the tournament, which is being hosted across the US, Mexico and Canada in 2026, will have their first chance to get a limited number of tickets next month. And with dynamic pricing, also known as surge pricing, involved, Heimo Schirgi, the World Cup's chief operating officer, has warned fans to \"get tickets as early as possible\". FIFA has already issued a warning to fans to be \"wary\" of unofficial websites purportedly selling tickets that aren't yet on the market, after Sky News discovered tickets already being sold for eye-watering prices by the platform Vivid Seats. Here's all you need to know. The tournament runs from 11 June to 19 July 2026 and will be played at 11 sites in the US, three in Mexico and two in Canada. A total of 48 countries will be involved and 104 games will be played overall. The host nations automatically qualify and will play all three of their group stage matches on home soil. Stadiums where games will be played include: United States:• Atlanta Stadium• Boston Stadium• Dallas Stadium• Houston Stadium• Kansas City Stadium• Los Angeles Stadium• Miami Stadium• New York New Jersey Stadium• Philadelphia Stadium•San Francisco Bay Area Stadium• Seattle Stadium Mexico:• Estadio Azteca Mexico City• Estadio Guadalajara• Estadio Monterrey Canada:• Toronto Stadium• BC Place Vancouver Stadium Tickets for the World Cup will be released in three phases, each with slightly different rules on who can buy the tickets and how. Phase one The first phase is a Visa Presale Draw for people with a valid, unexpired Visa debit card, credit card, or reloadable prepaid card enabled with 3D Secure. To be in the draw, individuals have to create a FIFA ID and submit an application form between 10 and 19 September. Registered individuals will be given a date and time to purchase tickets starting from 1 October, with tickets on a first-come, first-served basis. Falk Eller, FIFA's director of ticketing and hospitality, said there are approximately one million tickets available for the first Visa presale. Phase two The second phase, called an early ticket draw, is likely to run from 27 to 31 October, with time slots to purchase tickets made available to registered individuals from mid-November to early December. Phase three The third phase, called a random selection draw, will start after the final draw of teams on 5 December determines the World Cup schedule. FIFA said tickets will also become available closer to the tournament on a first-come, first-served basis. Hospitality tickets Hospitality tickets have been on sale since May for the eight matches at MetLife Stadium in East Rutherford, New Jersey, including the final on 19 July. These allow individuals access into VIP lounges, the option to hire private suites and exclusive \"platinum access\" tickets, which FIFA defines as an \"all-encompassing experience with full-service customisation\". American Airlines has also announced that members of its AAdvantage loyalty programme can redeem miles for World Cup tickets from 13 to 15 October. Three different types of tickets will be available during different phases of ticket sales. These include: • Single match tickets - includes one entry to any of the 104 matches in the tournament.• Venue-specific tickets - includes tickets to several matches scheduled at a particular stadium, except the opening match in each host country or any quarter, semi or final matches.• Team-specific tickets - includes tickets to each of a chosen team's three group stage matches. Single match tickets and team-specific tickets will be available in all sale phases, while venue-specific tickets will be available ahead of the final draw. Prices for group stage matches during the Visa presale will start at $60 (£44), with later stage matches, including the final, reaching up to $6,730 (£5,000), FIFA says. This is an increase from a range of $25 (£19) to $475 (£353) the last time the US hosted the tournament in 1994. For the 2022 tournament in Qatar, tickets cost the US dollar equivalent of $69 to $1,607. Prices for hospitality tickets are considerably more, ranging from $3,500 (£2,604) to $73,200 (£54,467) per person. FIFA said it plans to introduce an official resale platform later this year, allowing ticket holders to resell their tickets securely. Mr Eller, director of hospitality and ticketing at FIFA, said resale prices would not be capped, due to a need to compete with unofficial resale outlets and ensure a regulated environment. Dynamic pricing is commonly seen when purchasing plane or train tickets and hotel room rates during holiday seasons. But backlash over its use escalated when tickets for the Oasis Live '25 tour went on sale last August. Fans who had waited for hours in a virtual queue were left fuming to find out standard tickets, originally worth £148, were being sold at a dynamic pricing level of £355 on Ticketmaster. Criticism was so widespread that it led to the Sale of Tickets (Sporting and Cultural Events) Bill being put forward in the House of Commons, which, if passed, would require music and sports ticket sellers to tell fans the maximum prices at the start of the buying process by law.  Ticketmaster says the goal of dynamic pricing is to \"give fans fair and safe access to tickets true to market value\" and because it is based on demand, the price of tickets does not always increase. Dynamic pricing was used for this year's controversial Club World Cup, which also took place in the US, but it was a struggle to fill the mammoth state-side stadiums, including some which will be used for the World Cup. As a result, for the semi-final between London's Chelsea and Brazil's Fluminense, tickets were cut from $473.90 (£352) to $13.40 (£10). Similar dramatic drops were seen for both teams' quarter-final matches, where tickets went for as low as $11.15 (£8.30). For those outside the US, Canada or Mexico, securing tickets is not enough to guarantee you will be at World Cup games. People travelling to the US or Canada will need to secure visas in order to make it to the tournament. Most tourists do not need a visa to travel to Mexico. For example, if travelling from the UK to America, Britons will need an ESTA for visits under 90 days, or a B-2 visa for longer stays. From the UK to Canada, Britons will typically need an Electronic Travel Authorisation (eTA), which allows visits for up to six months. Read more from Sky News:The Hollywood drug network exposedGoogle ordered to make search engine changes FIFA has warned that any ticket holder who fails to obtain the necessary visa or travel authorisation, or is denied entry due to non-compliance with any requirements, will not be entitled to any form of compensation. Due to the time it takes for visas to be issued, fans are being encouraged to complete applications as soon as possible."
    },
    {
        "title": "The proxy war that will redefine public health in America",
        "description": "It is much more than a battle over vaccines in the United States.",
        "url": "https://news.sky.com/story/the-proxy-war-that-will-redefine-public-health-in-america-13425255",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-robert-kennedy_7011550.jpg?20250904234315",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-09-04 22:19:00",
        "Headline": "The US health secretary has been told children are now dying from measles for the first time in 20 years after he rolled back vaccine recommendations - a row that has taken centre stage in a wider battle over public health in the US.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  It is much more than a battle over vaccines in the United States. It has become a proxy war about trust, freedom, and the role of government in public health. The debate about childhood immunisations, once a matter of bipartisan consensus, is now a defining clash between federal government, state leadership and the medical community. At the centre of it is the federal government's sharp policy shift under US health secretary Robert F Kennedy Jr. He has rolled back vaccine recommendations and reshaped advisory committees with sceptics. States have responded along ideological lines - Florida planning to abolish all vaccine mandates; California, Oregon, and Washington forming a \"Health Alliance\" to safeguard them. The western states felt they had to act when the head of the agency tasked with disease prevention was sacked. 'You're putting Americans' health at risk' Susan Monarez had only been in the job for a month when Donald Trump told her she was no longer required. \"She didn't bend the knee, so you fired her,\" Democratic Senator Elizabeth Warren told Mr Kennedy during a heated committee hearing on Capitol Hill. \"You're putting American babies' health at risk, American seniors' health at risk, all Americans' health at risk, and you should resign,\" she added. Democratic Senator Raphael Warnock described the health secretary as \"a hazard to the health of the American people.\" \"For the first time, we're seeing deaths of children from measles. We haven't seen that in two decades. We're seeing that under your watch,\" he said. Mr Kennedy told the hearing America had done \"worse than any country in the world\" in terms of COVID deaths. \"…the people at CDC who oversaw the process, who put masks on our children, who closed our schools, are the people who will be leaving,\" he said. Read more US news:Farage met his match in Washington hearingHow Trump is vulnerable over Epstein  Jab mandates compared to 'slavery' Several senior figures at the Centers for Disease Control and Prevention have resigned since Susan Monarez was removed. The turmoil in public health has led to a fragmented system where Americans' access to vaccines and the rules governing them, largely depend on where they live. Likening vaccine mandates to \"slavery\", Florida's surgeon general Joseph Ladapo said the government had no right to dictate them. \"Your body is a gift from God. What you put into your body is because of your relationship with your body and your God,\" he said. It is a tug of war between collective responsibility or individual choice and one that will redefine public health in this nation."
    },
    {
        "title": "Epstein survivors take centre stage as files controversy continues to leave Trump vulnerable",
        "description": "For so long, the Epstein story has cast them in a cameo role.",
        "url": "https://news.sky.com/story/epstein-survivors-take-centre-stage-as-files-controversy-continues-to-leave-trump-vulnerable-13424640",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/acd422af7654e29089284e03055eee7fffe94b6f8fe14c2d2de0e840b605f93d_7010644.jpg?20250903231939",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2025-09-04 00:29:00",
        "Headline": "MAGA ultra-loyalist Marjorie Taylor Greene was among politicians who joined the women to call for complete disclosure of government files on the infamous paedophile.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n  For so long, the Epstein story has cast them in a cameo role. Everyday coverage of the scandal churns through the politics and process of it all, reducing their suffering to a passing reference. Not anymore. Not on a morning when they gathered on Capitol Hill, survivors of Epstein's abuse, strengthened by shared experience and a resolve to address it.  In a news conference that lasted over an hour, they brought an authenticity that only they could. There was vivid recollection of the abuse they endured and a certainty in the justice they seek. They had the safety of each other - adults now, with the horrors of youth at a distance, though never far away. It was an emotional gathering on Capitol Hill, attended by survivors, politicians and several hundred members of the public who turned up in support. Banners read \"Release the files\", \"Listen to the victims\" and \"Even your MAGA base demands Epstein files\". A startling spectacle That last statement isn't lost on Donald Trump. As if for emphasis, one of the speakers was the ultra-loyal House representative Marjorie Taylor Greene - they don't make them more MAGA. In a spectacle, startling to politics-watchers in this town, she stood side by side with Democrat congressmen to demand the Epstein files be released. It reflects a discontent spread through Donald Trump's support base. He is the man who once counted Jeffrey Epstein as a friend and who has said he'd release the files, only to reverse course. Read more:Partial release of Epstein files feeds cover-up claimsExplainer: Trump, Epstein and the MAGA controversy  Trump's vulnerability The Epstein files is the slow-burner that won't go out, a story that exposes Trump's vulnerability. Just how vulnerable can be measured on Congress, where politicians need only a couple of Republicans to back legislation demanding full publication. It bears the shape of a loyalty test to the president and the dynamics of that have changed with the survivors stepping forward. One by one, they presented a thunderous reminder of the people and the moral imperative at the heart of the Jeffrey Epstein saga. It's political, sure, but it's about much more - that, we saw on Capitol Hill."
    },
    {
        "title": "FIFA to use dynamic pricing for 2026 World Cup tickets - here's what you need to know",
        "description": "Tickets for next year's FIFA World Cup will use dynamic pricing, meaning fans will pay different prices according to demand.",
        "url": "https://news.sky.com/story/fifa-to-use-dynamic-pricing-for-2026-world-cup-tickets-heres-what-you-need-to-know-13424718",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-world-cup-2022-argentina_7011028.jpg?20250904124312",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-04 07:07:00",
        "Headline": "The first chance to get tickets for next year's World Cup in the US, Mexico and Canada is happening next month. Here's all you need to know.",
        "Content": "Tickets for next year's FIFA World Cup will use dynamic pricing, meaning fans will pay different prices according to demand. Those keen to go to the tournament, which is being hosted across the US, Mexico and Canada in 2026, will have their first chance to get a limited number of tickets next month. And with dynamic pricing, also known as surge pricing, involved, Heimo Schirgi, the World Cup's chief operating officer, has warned fans to \"get tickets as early as possible\". FIFA has already issued a warning to fans to be \"wary\" of unofficial websites purportedly selling tickets that aren't yet on the market, after Sky News discovered tickets already being sold for eye-watering prices by the platform Vivid Seats. Here's all you need to know. The tournament runs from 11 June to 19 July 2026 and will be played at 11 sites in the US, three in Mexico and two in Canada. A total of 48 countries will be involved and 104 games will be played overall. The host nations automatically qualify and will play all three of their group stage matches on home soil. Stadiums where games will be played include: United States:• Atlanta Stadium• Boston Stadium• Dallas Stadium• Houston Stadium• Kansas City Stadium• Los Angeles Stadium• Miami Stadium• New York New Jersey Stadium• Philadelphia Stadium•San Francisco Bay Area Stadium• Seattle Stadium Mexico:• Estadio Azteca Mexico City• Estadio Guadalajara• Estadio Monterrey Canada:• Toronto Stadium• BC Place Vancouver Stadium Tickets for the World Cup will be released in three phases, each with slightly different rules on who can buy the tickets and how. Phase one The first phase is a Visa Presale Draw for people with a valid, unexpired Visa debit card, credit card, or reloadable prepaid card enabled with 3D Secure. To be in the draw, individuals have to create a FIFA ID and submit an application form between 10 and 19 September. Registered individuals will be given a date and time to purchase tickets starting from 1 October, with tickets on a first-come, first-served basis. Falk Eller, FIFA's director of ticketing and hospitality, said there are approximately one million tickets available for the first Visa presale. Phase two The second phase, called an early ticket draw, is likely to run from 27 to 31 October, with time slots to purchase tickets made available to registered individuals from mid-November to early December. Phase three The third phase, called a random selection draw, will start after the final draw of teams on 5 December determines the World Cup schedule. FIFA said tickets will also become available closer to the tournament on a first-come, first-served basis. Hospitality tickets Hospitality tickets have been on sale since May for the eight matches at MetLife Stadium in East Rutherford, New Jersey, including the final on 19 July. These allow individuals access into VIP lounges, the option to hire private suites and exclusive \"platinum access\" tickets, which FIFA defines as an \"all-encompassing experience with full-service customisation\". American Airlines has also announced that members of its AAdvantage loyalty programme can redeem miles for World Cup tickets from 13 to 15 October. Three different types of tickets will be available during different phases of ticket sales. These include: • Single match tickets - includes one entry to any of the 104 matches in the tournament.• Venue-specific tickets - includes tickets to several matches scheduled at a particular stadium, except the opening match in each host country or any quarter, semi or final matches.• Team-specific tickets - includes tickets to each of a chosen team's three group stage matches. Single match tickets and team-specific tickets will be available in all sale phases, while venue-specific tickets will be available ahead of the final draw. Prices for group stage matches during the Visa presale will start at $60 (£44), with later stage matches, including the final, reaching up to $6,730 (£5,000), FIFA says. This is an increase from a range of $25 (£19) to $475 (£353) the last time the US hosted the tournament in 1994. For the 2022 tournament in Qatar, tickets cost the US dollar equivalent of $69 to $1,607. Prices for hospitality tickets are considerably more, ranging from $3,500 (£2,604) to $73,200 (£54,467) per person. FIFA said it plans to introduce an official resale platform later this year, allowing ticket holders to resell their tickets securely. Mr Eller, director of hospitality and ticketing at FIFA, said resale prices would not be capped, due to a need to compete with unofficial resale outlets and ensure a regulated environment. Dynamic pricing is commonly seen when purchasing plane or train tickets and hotel room rates during holiday seasons. But backlash over its use escalated when tickets for the Oasis Live '25 tour went on sale last August. Fans who had waited for hours in a virtual queue were left fuming to find out standard tickets, originally worth £148, were being sold at a dynamic pricing level of £355 on Ticketmaster. Criticism was so widespread that it led to the Sale of Tickets (Sporting and Cultural Events) Bill being put forward in the House of Commons, which, if passed, would require music and sports ticket sellers to tell fans the maximum prices at the start of the buying process by law.  Ticketmaster says the goal of dynamic pricing is to \"give fans fair and safe access to tickets true to market value\" and because it is based on demand, the price of tickets does not always increase. Dynamic pricing was used for this year's controversial Club World Cup, which also took place in the US, but it was a struggle to fill the mammoth state-side stadiums, including some which will be used for the World Cup. As a result, for the semi-final between London's Chelsea and Brazil's Fluminense, tickets were cut from $473.90 (£352) to $13.40 (£10). Similar dramatic drops were seen for both teams' quarter-final matches, where tickets went for as low as $11.15 (£8.30). For those outside the US, Canada or Mexico, securing tickets is not enough to guarantee you will be at World Cup games. People travelling to the US or Canada will need to secure visas in order to make it to the tournament. Most tourists do not need a visa to travel to Mexico. For example, if travelling from the UK to America, Britons will need an ESTA for visits under 90 days, or a B-2 visa for longer stays. From the UK to Canada, Britons will typically need an Electronic Travel Authorisation (eTA), which allows visits for up to six months. Read more from Sky News:The Hollywood drug network exposedGoogle ordered to make search engine changes FIFA has warned that any ticket holder who fails to obtain the necessary visa or travel authorisation, or is denied entry due to non-compliance with any requirements, will not be entitled to any form of compensation. Due to the time it takes for visas to be issued, fans are being encouraged to complete applications as soon as possible."
    },
    {
        "title": "Firms cut jobs at fastest pace since 2021, Bank of England data shows",
        "description": "Businesses have cut jobs at the fastest pace in almost four years, according to a closely-watched Bank of England survey which also paints a worrying picture for employment and wage growth ahead.",
        "url": "https://news.sky.com/story/firms-cut-jobs-at-fastest-pace-since-2021-bank-of-england-data-shows-13424911",
        "image_url": "https://e3.365dm.com/22/08/1920x1080/skynews-chef-hospitality-restaurant_5859384.jpg?20230115102309",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-09-04 12:15:00",
        "Headline": "The Bank's survey of finance chiefs also shows that the pace of wage growth is set to slow on the back of increased taxes facing employers since April.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Businesses have cut jobs at the fastest pace in almost four years, according to a closely-watched Bank of England survey which also paints a worrying picture for employment and wage growth ahead. Its Decision Maker Panel (DMP) data, taken from chief financial officers across 2,000 companies, showed employment levels over the three months to August were 0.5% lower than in the same period a year earlier. It amounted to the worst decline since autumn 2021 as firms grappled with the implementation of budget measures in the spring that raised their national insurance contributions and minimum wage levels, along with business rates for many. Money latest: Eight supermarkets ranked for price The start of April also witnessed the escalation in Donald Trump's global trade war which further damaged sentiment, especially among exporters to the United States. The survey showed no improvement in hiring intentions in the tough economy, with companies expecting to reduce employment levels by 0.5% over the coming year. That was the weakest outlook projection since October 2020. \n                  Rachel Reeves is celebrating the Bank of England's interest cut – but behind the scenes she has little to cheer \n                 \n                  Bank of England issues inflation warning but cuts interest rate to 4%\n                 \n                  Greater risk to UK economy following Trump's tariffs, says Bank of England\n                 At the same time, the panel also showed that participants planned to raise their own prices by 3.8% over the next 12 months. That is in line with the current rate of inflation. The news on wages was no better as the central forecast was for an average rise of 3.6% - down from the 4.6% seen over the past 12 months. If borne out, it would mean private sector wages rising below the rate of inflation - erasing household and business spending power. The Bank of England has been relying on data such as the DMP amid a lack of confidence in official employment figures produced by the Office for National Statistics due to low response rates.  Bank governor Andrew Bailey told a committee of MPs on Wednesday that he was now less sure over the pace of interest rate cuts ahead owing to stubborn inflation in the economy. The consumer prices index measure is expected to peak at 4% next month - double the Bank's target rate - from the current level. Higher interest rates only add to company costs and make them less likely to borrow for investment purposes. At the same time, employers are fearful that the coming budget, set for late November, may contain no relief.  Sky News revealed on Thursday how the head of the banking sector's main lobby group had written to the chancellor to warn that any additional levy on bank profits, as suggested by a think-tank last week, would only damage her search for growth. Rachel Reeves is believed to be facing a black hole in the public finances amounting to £20bn-£40bn. Tax rises are believed to be inevitable, given her commitment to fiscal rules concerning borrowing by the end of the parliament. Heightened costs associated with servicing such debts following recent bond sell-offs across Western economies have made more borrowing even less palatable.  Ms Reeves is expected to raise some form of wealth tax, while other speculation has included a shake-up of council tax. She has consistently committed not to target working people but the Bank of England data, and official ONS figures, would suggest that businesses have responded to 2024 budget measures by cutting jobs since April, with hospitality and retail among the worst hit. Commenting on the data, Rob Wood, chief UK economist at Pantheon Macroeconomics, said: \"The DMP survey shows stubborn wage and price pressures despite falling employment, continuing to suggest that structural economic changes and supply weakness are keeping inflation high. \"The MPC [monetary policy committee of the Bank of England] will have to be cautious, so we remain comfortable assuming no more rate cuts this year.\" \"That said, the increasing signs of labour market weakness suggest dovish risks,\" he concluded."
    },
    {
        "title": "More than a quarter of cars sold in August were electric vehicles - SMMT figures",
        "description": "A greater proportion of electric cars were sold last month than at any point this year, industry data shows. ",
        "url": "https://news.sky.com/story/more-than-a-quarter-of-cars-sold-in-august-were-electric-vehicles-smmt-figures-13424789",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-china-car_6873872.jpg?20250402134122",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-09-04 09:13:00",
        "Headline": "Not since late last year have electric cars seen such a high proportion of overall  sales, suggesting the industry could again meet its annual target. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n A greater proportion of electric cars were sold last month than at any point this year, industry data shows.  More than a quarter (26.5%) of cars sold in August were electric vehicles (EVs), according to figures from motor lobby group the Society for Motor Manufacturers and Traders (SMMT). It's the largest amount of sales since December 2024 and comes as the government introduced financial incentives to help drivers make the move to zero tailpipe emission cars. Money blog: KFC rival coming to UK The full suite of grants were not available during the month, however, with a further 35 models eligible for £1,500 off early in September. Throughout August more models became eligible for price reductions, meaning more consumers could be tempted to purchase an EV in September.  The increased percentage of EV sales came despite an overall 2% drop in buying, compared to a year earlier, in what is typically the quietest month for car purchases. \n                  Electric cars eligible for £3,750 government discount revealed\n                 \n                  Can Rachel make things cheaper?\n                 \n                  More bad news for Elon Musk as Tesla deliveries miss target again\n                 What are the rules? The numbers suggest the car industry could be on course to meet the government's zero-emission vehicle (ZEV) mandate, the thinktank Energy & Climate Intelligence Unit (ECIU) has said. It stipulates that new petrol and diesel cars may not be sold from 2030. Read more:Bank lobby chief warns Reeves over budget tax raidTax the rich to thwart Reform, TUC chief urges Labour Amid pressure from industry, the government altered the mandate in April to allow for hybrid vehicles, which are powered by both fuel and a battery, to be sold until 2035. Sales of new petrol and diesel vans are also permitted until 2035. Until then, 28% of cars sold must be electric this year, with the share rising to 33% in 2026, 38% in 2027 and 66% in 2029, the final year before the new combustion engine ban. Manufacturers face fines for not meeting the targets. Last year, the objective of making 22% of all car sales purely EVs was surpassed, with EVs comprising 24.3% of the total sold in 2024. Why? The increased portion of EV sales can be attributed to increased model choice and discounting, on top of the government reductions, the SMMT said. Savings from running an electric car are also enticing motorists, the ECIU said. \"Demand for used EVs is already surging because they can offer £1,600 a year in savings in owning and running costs.\" \"This matters for regular families as the pipeline of second-hand EVs is dependent on new car sales, which hit the used market after around three to four years."
    },
    {
        "title": "Bank lobby chief warns Reeves over budget tax raid",
        "description": "The head of Britain's main banking lobby group has warned the chancellor against a budget raid on the industry, arguing that it would undermine her aim of delivering sustainable economic growth.",
        "url": "https://news.sky.com/story/bank-lobby-chief-warns-reeves-over-budget-tax-raid-13424772",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rachel-reeves-politics_6985238.jpg?20250808003624",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-04 08:50:00",
        "Headline": "In a letter to the chancellor obtained by Sky News, the UK Finance boss David Postings said she risked undermining economic growth if she increased the tax burden on UK lenders.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The head of Britain's main banking lobby group has warned the chancellor against a budget raid on the industry, arguing that it would undermine her aim of delivering sustainable economic growth. In a letter to Rachel Reeves seen by Sky News, David Postings, the chief executive of UK Finance, said renewed speculation about increases to banks' tax burden risked undermining their international competitiveness. Mr Postings' letter was sent earlier this week, just days after shares in the largest UK banks - including Barclays, Lloyds Banking Group and NatWest Group - slid amid fears of a renewed tax raid on the sector. \"Both the financial services sector and the wider investor community have... strongly welcomed your clear emphasis - most recently through the Leeds Reforms - on ensuring that the UK's financial services sector has the right environment to be internationally competitive,\" he told the chancellor. \"As you said in launching those reforms, it is vital to deliver certainty for banks operating here and ensure that UK banks can compete internationally and drive economic growth. A report published last week by the Institute for Public Policy Research (IPPR) think-tank proposed that the chancellor use her November budget to impose an additional levy on bank profits - prompting an investor sell-off of shares in the main UK lenders. Anxiety about higher personal and corporate taxes has gained momentum in recent weeks because of the weak outlook for the public finances, with Ms Reeves needing to fill a multibillion pound black hole to ensure the government meets its own fiscal rules. Treasury insiders have sought to play down the prospects of such a move during private discussions with bank executives in recent days, but the timing of Mr Postings' letter underlines the heightened anxiety in the sector following the sharp recovery in its profitability in recent years. \"As many of our members have recently noted, efforts to boost the UK economy and foster a strong financial services sector would not be consistent with further tax rises on the sector, which already makes a substantial contribution to the public finances,\" Mr Postings wrote. \"The emphasis should be on continuing to implement an agenda of regulatory reform that allows for an appropriate adjustment in risk appetite.\" Read more from Sky News:Tax the rich to thwart Reform, PM told'Doubt' over future interest rate cuts Mr Postings denied that the recovery in bank profitability was unreasonable, saying: \"UK banks' net interest margins have only returned to historically more normal levels and are far from excessive.\" He added that the industry had made a record tax contribution of approximately £45bn last year. \"UK Finance analysis shows that the UK's total tax rate for model corporate and investment banks is already notably higher than other major financial centres such as Amsterdam, Frankfurt, Dublin, and New York,\" Mr Postings told Ms Reeves. \"This disparity is driven by the permanence of sector-specific taxes in the UK, unlike in other EU jurisdictions where comparable arrangements have been phased out.\" He added that a further tax on the banking industry \"would run counter to the government's aim of supporting the financial services sector and make the UK less competitive internationally, potentially driving capital and investment to other jurisdictions\". \"It would also risk undermining the sector's ability to drive growth, innovation, and productivity across the UK economy. \"A pro-growth, stable operating environment is the best way to deliver strong and sustainable tax revenues, retain talent and underpin investment across the economy.\" UK Finance declined to comment further on the letter when contacted by Sky News."
    },
    {
        "title": "Screen rights licensing giant sets bumper sale in motion",
        "description": "A company which collects royalties on behalf of Hollywood studios including The Walt Disney Company and Amazon-owned MGM is being put up for sale in an auction expected to fetch hundreds of millions of pounds.",
        "url": "https://news.sky.com/story/screen-rights-licensing-giant-sets-bumper-sale-in-motion-13424938",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-tv-screens-the-oval_7011132.jpg?20250904142815",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-04 13:14:00",
        "Headline": "The private equity backers of Motion Picture Licensing Company, which represents rights-holders including Disney and Marvel Studios, are working with bankers on a sale, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A company which collects royalties on behalf of Hollywood studios including The Walt Disney Company and Amazon-owned MGM is being put up for sale in an auction expected to fetch hundreds of millions of pounds. Sky News has learnt that Motion Picture Licensing Company (MPLC), which is backed by private equity investors, is working with bankers at Guggenheim Securities on a sale. A source close to one prospective bidder said they had been contacted to gauge their interest in a deal in recent days. Money latest: Eight supermarkets ranked for price MPLC, which describes itself as the leading global provider of audio-visual public performance licences, streamlines the process for companies and other organisations which want to legally display content in public places such as offices, transport hubs or pubs. The company issues a permit known as a blanket licence, encompassing thousands of content-owners, meaning licensees can be certain they are complying with copyright laws. Among the other rights-holders it represents are Marvel Studios, CNN, Dreamworks and NBCUniversal, which - like Sky News - is ultimately owned by New York-listed Comcast. \n                  Firms cut jobs at fastest pace since 2021, Bank of England data shows\n                 \n                  More than a quarter of cars sold in August were electric vehicles - SMMT figures\n                 \n                  Bank lobby chief warns Reeves over budget tax raid\n                 MPLC has been part-owned by Tenzing, a private equity firm, since 2019. Read more:Bank lobby chief warns Reeves over budget tax raidTax the rich to thwart Reform, TUC chief urges Labour Prospective bidders said they anticipated that a sale would be lucrative for its existing shareholders, with a valuation of several hundred million pounds. The company was founded in 2004, and is based in Sussex. Tenzing declined to comment."
    },
    {
        "title": "Cheap Eats: 'It's just bizarre' - top chef vents about two things customers do in 2025",
        "description": "Every week, our <a href=\"https://news.sky.com/story/money-latest-interest-rate-cut-decision-bank-of-england-consumer-personal-finance-blog-sky-news-deals-13040934\" target=\"_blank\">Money</a> team interviews top chefs from around the UK, hearing about their cheap food hacks, views on the industry and more. Today, in our final regular interview (we'll still run the feature occasionally), we speak to renowned chef&#160;Mark Poynton, from&#160;Ancient Shepherds&#160;in Cambridge...",
        "url": "https://news.sky.com/story/cheap-east-its-just-bizarre-top-chef-vents-about-two-things-customers-do-in-2025-13424721",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-money-blog-cheap-eats_7010728.jpg?20250904065142",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-04 07:20:00",
        "Headline": "The Sky News Money blog team interviews chefs for our Cheap Eats feature. This week, we get tips on the best restaurant to blow the budget at, and why certain fads can make life difficult for chefs.",
        "Content": "Every week, our Money team interviews top chefs from around the UK, hearing about their cheap food hacks, views on the industry and more. Today, in our final regular interview (we'll still run the feature occasionally), we speak to renowned chef Mark Poynton, from Ancient Shepherds in Cambridge... My favourite budget recipe is... cheese and onion soup. Check out the latest updates from our Money team Method Margins are being squeezed... Without good landlords and good business sense, it is difficult. Four-day weeks do help, and set holidays too, but all these things do cost and you can't make people do 70+ hours in four days which can happen in some places still. I am trying my best in my businesses and will continue to do so. If I was PM for the day, I would help hospitality by… reducing VAT, but I don't wholly agree with that just for hospitality. I think the VAT threshold across the board should be the same for all businesses but raised to £1m, so small businesses everywhere stand a chance. The one UK restaurant worth blowing your budget on is... Moor Hall (north of Liverpool). Make a night of it and stay and have breakfast, too. Mark Birchall is an amazing chef and everything that place serves is the ultimate in hospitality and what we should all strive to be like. \n                  Cheap Eats: Top chef shares one thing diners should never do\n                 \n                  'Genuinely elite': Top chef raves about supermarket sandwich - but has very different view of QR codes\n                 \n                  Cheap Eats: Fortnum and Mason's pastry guru reveals supermarket dessert he loves\n                 I hate it when customers... fake allergies because of some stupid fad diet from social media, making a restaurant's life hell. I once had one angry person call me because I wasn't open for his wedding anniversary... on a Monday, and we have never opened Mondays. He had taken the liberty to turn up without trying to book or call to make a booking - just presuming we were open. He was showing off to his wife that he had a table in the restaurant and made himself look stupid. Reviewing culture is just bizarre, people think because they don't like something (and not liking something is different to something being wrong), they can publicly shame a business. Sadly, we now live in a world where people are scared to speak to people in person but are happy to sit behind a keyboard and belittle! More Cheap Eats:Top chef shares one thing diners should never do 'Genuinely elite': Top chef raves about supermarket sandwichFortnum and Mason's pastry guru reveals supermarket dessert he loves We have an amazing street food burger van... and shop in Cambridge called Steak & Honour run by husband and wife Leo and Charley, and I always have the One For Ella 180g pure beef patty, American cheese, their own amazing burger sauce and bacon. Heaven! My order at my favourite cheap eat is... chorizo crumble Neapolitan pizza at Scott's All Day, Cambridge. People can enquire where their food is after 20 minutes... If cooking a nice piece of fish or similar, it takes time and patience, and you wouldn't want your prime ingredients pre-cooked and reheated. Ring if you know you are going to be late... The more time you can give, the better, in my opinion."
    },
    {
        "title": "Harrods to remove sculptures depicting Fayed as an Egyptian pharaoh",
        "description": "Harrods is to remove sculptures of Mohamed al Fayed who is accused of raping and sexually assaulting dozens of women.",
        "url": "https://news.sky.com/story/harrods-to-remove-sculptures-depicting-fayed-as-an-egyptian-pharaoh-13424700",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-mohamed-al-fayed-mohamed-al-fayed_7010772.jpg?20250904075956",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-04 06:23:00",
        "Headline": "London store submits planning application to renovate a detailed Egyptian-themed hall and five-floor escalator which features busts of former owner.",
        "Content": "Harrods is to remove sculptures of Mohamed al Fayed who is accused of raping and sexually assaulting dozens of women. The famous store in Knightsbridge, west London, has submitted a planning application to renovate a detailed Egyptian-themed hall and replace a five-floor escalator which features busts depicting former owner Fayed as a pharaoh. The application acknowledges \"the Egyptian Escalator explicitly celebrates Mr al Fayed, including sixteen huge sculptures of his face\", adding that they represent \"a visual reminder of his misdeeds\". It adds: \"Obituaries, while referring to his extraordinary business career, characterised him as a liar, a fantasist and an aggressive sexual predator. \"This is not 'contested heritage' in the sense that there is some historical issue at stake; it is the continuing public celebration of a man whose victims are still alive.\" In an update in August, the Metropolitan Police said 146 people had come forward to report a crime as part of their investigation into the former Harrods boss, who died in 2023 aged 94. Harrods told Sky News it has submitted plans to make changes to the interior of the Grade II* listed building. \"Having heard feedback from survivors, we have been working to expedite the proposed redevelopment project of the Egyptian escalators, and a planning and listed building consent application has now been submitted,\" it said in a statement. \"Any proposed changes in store require considered plans, lengthy assessments, and close work with a number of relevant authorities.\" Read more from Sky News:Fayed: Never far from controversyProbe into handling of Fayed reportsHarrods challenges legal fees Fayed sold Harrods to Qatar Holdings in 2010 and his other main asset in the UK, Fulham FC, was offloaded in 2013 to the US businessman Shahid Khan. In June, Sky News reported that Harrods is preparing to take legal action against the estate of its former owner, as the multimillion-pound legal bill for compensating his sexual abuse victims continues to escalate. More than 100 survivors of alleged sexual abuse by Fayed have entered Harrods' redress scheme, the department store said in July. The Metropolitan Police is conducting an investigation into how it handled historical allegations of offending by Fayed. It will also look into any potential facilitators and enablers, and whether any misconduct or corruption occurred. It is looking at individuals surrounding Fayed who could have enabled him to commit crimes which are claimed to have spanned decades between 1977 and 2014."
    },
    {
        "title": "D-Day for Rayner? PM's adviser prepares pivotal verdict - as her lawyers deny giving tax advice",
        "description": "Sir Keir Starmer could be forced into a decision over Angela Rayner's future as early as today, as the prime minister's ethics adviser prepares his verdict on the Labour deputy's tax affairs.",
        "url": "https://news.sky.com/story/d-day-for-rayner-pms-adviser-prepares-pivotal-verdict-as-her-lawyers-deny-giving-tax-advice-13425261",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-starmer-rayner_7011553.jpg?20250905000247",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-04 22:40:00",
        "Headline": "Sir Laurie Magnus is conducting an investigation into whether Angela Rayner broke ministerial rules by failing to pay the correct amount of stamp duty on a new home, and his findings could be revealed as soon as today.",
        "Content": "Sir Keir Starmer could be forced into a decision over Angela Rayner's future as early as today, as the prime minister's ethics adviser prepares his verdict on the Labour deputy's tax affairs. Ms Rayner, who is also the housing secretary, has been under mounting pressure since she admitted not paying the correct amount of stamp duty on an £800,000 flat in Hove, East Sussex. She has argued the mistake was made as a result of incorrect advice from a conveyancer and two trust law experts, who told her she did not need to pay the higher rate reserved for second home purchases. Her case was thrust into doubt late on Thursday when the conveyancing firm - Verrico & Associates - said it did not provide advice and had been made \"scapegoats\" in the political row. Its managing director, Joanna Verrico, told The Daily Telegraph while it had acted for Ms Rayner when she bought the property, no tax or trust advice was provided. Any advice she may have received will form a key plank of an investigation by Sir Keir's independent ethics guru, Sir Laurie Magnus, who Ms Rayner referred herself to earlier this week. Downing Street has said the prime minister expects a \"quick\" verdict, and he has refused to rule out sacking his second-in-command. \"I will act on whatever the report is that's put in front of me,\" Sir Keir told the BBC on Thursday - and that report may well arrive on his desk today. Sir Laurie has concluded investigations into ex-ministers Nadhim Zahawi and Tulip Siddiq within days - and Sky's chief political correspondent Jon Craig reports he's due to go on holiday on Saturday. He is assessing whether Ms Rayner broke ministerial rules, which place an \"overarching duty on ministers to comply with the law\", \"behave in a way that upholds the highest standards of propriety\", and \"be as open as possible\" with the public. Conservative leader Kemi Badenoch has said Ms Rayner must go. In a statement following the intervention by Verrico & Associates, she said: \"This is yet more damning evidence that Angela Rayner has not been honest with the British public. \"She must resign or Keir Starmer must finally find the backbone to sack her.\" Read more:Key questions left unanswered in Angela Rayner tax rowVictim of misogyny' or 'freeloading' deputy prime minister? The row began when The Daily Telegraph first claimed Ms Rayner avoided £40,000 in stamp duty on the flat in Hove by removing her name from the deeds of another property in Greater Manchester. Ms Rayner said she sold her stake in her family home in Ashton-under-Lyne to a trust that was set up to provide for her teenage son, who has lifelong disabilities - meaning she did not technically own that home when she purchased the flat, and so was not subject to the higher rate of stamp duty that applies to second homes. She has described it as an \"honest mistake\", and tearfully revealed on Sky News' Electoral Dysfunction podcast she had already considered resigning. She said she realised what had happened after seeking fresh legal advice, having spent weeks dismissing questions about the tax claims.  Were Ms Rayner to depart, it would make for a difficult end to a week which began with Sir Keir confidently declaring \"phase two\" of his government was now under way. She is overseeing some of his key targets - notably building 1.5 million new homes this parliament, and a large expansion of workers' rights."
    },
    {
        "title": "Reform conference gets under way - as Farage returns from Trump meeting",
        "description": "Farage-led party conferences used to be relatively ramshackle affairs.",
        "url": "https://news.sky.com/story/back-with-a-bang-farage-returns-from-trump-meeting-as-reform-conference-gets-under-way-13424930",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nigel-farage-reform_7011556.jpg?20250905012850",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-09-04 12:56:00",
        "Headline": "Reform's conference takes place on Friday and Saturday in Birmingham, with the cost of living crisis, immigration, and net zero all said to be on the agenda. Nigel Farage will attend fresh from a meeting with Donald Trump at the White House.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n Farage-led party conferences used to be relatively ramshackle affairs. The 2013 UKIP gathering saw then MEP Godfrey Bloom engulfed in a row after declaring that women never cleaned behind the fridge. He followed that up by accusing a group of female party activists of being \"sluts\". And all this took place at a panel event titled \"women in politics\". \"It used to be a case of 'let's go and see the strange people in the reservation',\" said Reform board member and long-time Farage aide Gawain Towler. \"It's chalk and cheese [compared to now], they were rallies of the faithful and this is a conference of a government in waiting,\" he added. While that pronouncement may be premature - and awkward moments of the Bloom-era ilk can never be ruled out - the party of 2025 is certainly a world away, in organisational terms, from the rag-tag operations of yesteryear. As such, this conference will look and feel far more like the annual events of Westminster's established parties.  There are fringe events - with former Tory cabinet ministers Michael Gove and Jacob Rees-Mogg making appearances. Think tanks, pollsters, and mainstream institutes will be in attendance, alongside multinational organisations like Japan Tobacco and TikTok. Property developer Thakeham homes have a full page advert in the conference programme, with the National Farmers Union and British Association for Shooting and Conservation appearing too. That said, one report in the Financial Times suggested other chief executives were still wary of attending in case their presence was seen as a sign of support for the often controversial party. Nevertheless, insiders expect 12,000 people to filed into the NEC across two days, with member tickets sold out but \"platinum\" passes still available for the princely sum of £2,500 - granting holders priority seating and a champagne breakfast with Nigel Farage. The leader himself will speak on Friday afternoon after landing Thursday morning back from Washington, where he had been giving evidence to Congress about freedom of speech as well as squeezing in a meeting with Donald Trump. Read more politics news:Could this be D-Day for Angela Rayner?  Who could be on the guest list? As for the visuals, one official declared simply \"there's always pyro, there are always sparklers\". A \"special guest\" will address the conference before the leader's speech as well, with Reform sources insisting that journalists would not be able to \"waterboard\" the name out of the party in advance. Speculation also abounds over surprise appearances more generally. Could there be any more Tory defectors after Nadine Dorries jumped ship? Or an intervention from across the Atlantic? The former race hate inmate turned self-styled freedom fighter Lucy Connolly is a name being whispered around newsrooms too.  What's on the agenda? As far as policy goes, many of the events focus on the bread and butter of the Reform pitch - migration, free speech, council waste, crime and net zero. But there are also panels on more niche and knotty topics such a high street regeneration, tourism and even car finance. The broader theme of the conference is also relatively restrained with an emphasis on \"the next step\" in its own evolution. Reform clearly wants to project a message to the nation that they are a party that has chiselled off the oddness in favour of a serious set of people and proposals that could genuinely work in government.  That moment is a long way off, though, and while Reform insists it is now presenting valid policies, big question marks still hang over the feasibility and affordability of much the party puts out. From deportation and asylum to nationalisation and benefits, the thread running through the offering seems to be less about any set ideology and more about what is popular with the millions of Britons who feel abandoned by the mainstream political system. In that way, the appeal of Nigel Farage is the same as it has always been. The decades-long rider of waves of public disenchantment, now trying to figure out how to turn the anger into action."
    },
    {
        "title": "Nadine Dorries' defection might not be the boon Nigel Farage wants",
        "description": "Nadine Dorries has never forgiven the Conservative Party for ousting her hero Boris Johnson, on whom she continues to lavish praise.",
        "url": "https://news.sky.com/story/nadine-dorries-defection-an-act-of-revenge-on-the-tories-for-ousting-boris-johnson-13425172",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nadine-dorries-reform_7011464.jpg?20250904214209",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-09-04 20:17:00",
        "Headline": "Boris Johnson loyalist Ms Dorries, who resigned from the House of Commons in 2023, said she made the decision to join Reform because the Conservative Party was now \"dead\".",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Nadine Dorries has never forgiven the Conservative Party for ousting her hero Boris Johnson, on whom she continues to lavish praise. Now she's taken her revenge on the Tories by declaring her support for another charismatic political leader: Reform UK's Nigel Farage. Of course, the ex-MP dubbed \"Mad Nad\" by Labour MPs when she was in Parliament has one thing in common with her new party leader. They've both appeared on I'm a Celebrity... Get Me Out Of Here!, Dorries in 2012, without permission, for which she had the Conservative whip withdrawn. And Farage went into the jungle in 2023. So perhaps the pair can now fondly recall eating pigs' testicles, fish eyes, worms and crocodile anus. Or perhaps not. \"The Tory party is dead,\" she declared in the Daily Mail. \"Its members now need to think the unthinkable and look to the future.\" Dead? Like the dead parrot in the famous Monty Python sketch? \"No, it's not, it's resting,\" Tory loyalists will no doubt claim. Not entirely convincingly at present, however. \n                  Carrie Johnson admitted to hospital over 'severe dehydration'\n                 \n                  Ex-PM Boris Johnson and wife announce birth of their fourth child\n                 \n                  Boris Johnson hits out at Donald Trump's 'ghastly' comments to Ukraine President Volodymyr Zelenskyy\n                 But when Nadine Dorries talks about Conservatives thinking the unthinkable, is she advocating a pact with Reform UK or more defections? It's not clear. Another intriguing question: does the Dorries defection increase the possibility of Reform UK landing their biggest catch, the Tories' biggest beast in exile, Boris Johnson? Unlikely. Mr Johnson has said the best way for the Conservatives to counter Farage is to ignore him and not mention him. Sound advice for the Tories and Labour, many would say. Read more:Nadine Dorries becomes latest Tory to defect to Reform Dorries was so devoted to Boris that back in 2016 she sobbed at the news conference when he bottled it and announced he wouldn't stand in the leadership contest after David Cameron quit following his Brexit referendum humiliation. She never had any time for Cameron. In 2012 she denounced the then PM and his chancellor George Osborne as \"two arrogant posh boys who don't know the price of milk\". And when she quit the Commons she launched a \"posh boy\" attack on Rishi Sunak, claiming that as chancellor \"you flashed your gleaming smile in your Prada shoes and Savile Row suit\", delivered \"platitudes\" and spoke about \"how wonderful life was in California\". Though a controversial figure, she does have her fans and supporters, who claim that from a working-class background - like Angela Rayner, anyone? - she's achieved great successes inside and outside politics. Her novels are massively successful, for instance, and have earned her a lot of money. But she missed out on the peerage she claims Boris Johnson promised her. Boris Johnson? Broken promise? Never, surely. Yet in the years after he was ousted, Dorries has remained so devoted to her not-so-secret crush that she wrote a book entitled The Political Assassination Of Boris Johnson. It was full of elaborate conspiracy theories claiming a secret Tory cabal, including Michael Gove and Dominic Cummings brought down her hero. She even claimed Sunak plotted to bring down Johnson by conspiring with a \"frightening individual\" she codenamed Dr No, after the sinister Bond villain. So just how big a prize is Dorries' defection for Reform UK, then? Her I'm a Celebrity jaunt, her novels and her TV chat shows means she passes the famous test. For most of her political career, however, she was a maverick backbencher. It was Johnson who stunned MPs by appointing her to his cabinet as culture secretary. But by the time she quit as a Conservative MP in 2023, plunging the party into an unnecessary by-election which it duly lost, she was already an absentee MP. She hadn't spoken in the Commons for more than a year and had only voted six times in 12 months. Constituents claimed they hadn't seen her \"in years\". In her Mid Bedfordshire constituency in Johnson's 2019 election triumph she had a majority of almost 25,000. Yet in the by-election after she quit Labour won with a swing of more than 20%. In recent months, Dorries has written in her Daily Mail columns about losing three stone by taking the weight loss drug Mounjaro. But she says what's been difficult and agonising for the past 12 months is her decision to leave the Conservative Party after more than 30 years."
    },
    {
        "title": "Tories repeat calls for Rayner to resign after lawyers claim they did not provide tax advice",
        "description": "The Conservatives have repeated calls for Angela Rayner to resign after a legal firm she used said it did not provide her with tax advice in a row over underpaid stamp duty.",
        "url": "https://news.sky.com/story/tories-repeat-calls-for-rayner-to-resign-after-lawyers-claim-they-did-not-provide-tax-advice-13425080",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-angela-rayner-downing-street_7009017.jpg?20250902094055",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-09-04 17:35:00",
        "Headline": "Lawyers for the housing secretary issues statement saying they never provided her with tax advice - and claim they have been made \"scapegoats\".",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  The Conservatives have repeated calls for Angela Rayner to resign after a legal firm she used said it did not provide her with tax advice in a row over underpaid stamp duty. Party leader Kemi Badenoch said more \"damning evidence\" had come to light regarding the deputy leader's tax affairs, which is now subject to an investigation by the prime minister's independent ethics adviser Sir Laurie Magnus. Politics latest: Former Tory minister Nadine Dorries defects to Reform The Daily Telegraph reported that Verrico & Associates, a conveyancing firm that handled the purchase of her £800,000 flat in Hove, East Sussex, did not in fact give tax or trust advice to Ms Rayner - and that they believed they had been made \"scapegoats\" in the political row. Joanna Verrico, the managing director, told The Telegraph: \"We acted for Ms Rayner when she purchased the flat in Hove. We did not and never have given tax or trust advice. It's something we always refer our clients to an accountant or tax expert for. \"The stamp duty for the Hove flat was calculated using HMRC's own online calculator, based on the figures and the information provided by Ms Rayner. That's what we used, and it told us we had to pay £30,000 based on the information provided to us. We believe that we did everything correctly and in good faith. Everything was exactly as it should be. \"We probably are being made scapegoats for all this, and I have got the arrows stuck in my back to show it. We are not an inexperienced firm, but we're not qualified to give advice on trust and tax matters and we advise clients to seek expert advice on these.\" \n                  D-Day for Rayner? PM's adviser prepares pivotal verdict - as her lawyers deny giving tax advice\n                 \n                  Fate of 'Red Queen' Rayner in hands of 'quango king' baronet\n                 \n                  Angela Rayner a 'massive hypocrite', says ex-Scottish Tory leader Ruth Davidson\n                 Sky News has approached representatives for Ms Rayner for comment as well Verrico & Associates. The deputy prime minister, who is also the housing secretary, has been under scrutiny after the newspaper claimed she avoided £40,000 in stamp duty on the flat in Hove by removing her name from the deeds of another property in Greater Manchester. Ms Rayner said she sold her stake in her family home in Ashton-under-Lyne to a trust that was set up to provide for her teenage son, who has lifelong disabilities - meaning she did not technically own that home when she purchased the one in Hove, and so was not subject to the higher rate of stamp duty that applies to second homes.  On Tuesday Sir Keir Starmer's deputy claimed she made an honest mistake owing to her \"complex\" living situation and that lawyers initially advised her she only owed the basic rate of stamp duty for the Hove property. In an interview with Sky News' Electoral Dysfunction podcast, Ms Rayner became tearful as she claimed she received incorrect tax advice and spoke to her family about \"packing it all in\". However, following subsequent media reports, Ms Rayner sought further legal advice on Monday this week which advised her that the higher rate of stamp duty was in fact due on her East Sussex flat. The deputy prime minister has claimed she made an honest mistake as lawyers initially advised her she only owed the basic rate of stamp duty when she bought a flat in Hove in May. Read more:Key questions left unanswered in Angela Rayner tax rowVictim of misogyny' or 'freeloading' deputy prime minister? On the statement from Verrico & Associates, Ms Badenoch said: \"This is yet more damning evidence that Angela Rayner has not been honest with the British public. \"From the start we've had nothing but excuses, deflections and lies. Enough is enough. \"How many final straws can there be for Angela Rayner? She must resign or Keir Starmer must finally find the backbone to sack her.\" Sir Keir Starmer has so far said he would not be drawn on Ms Rayner's political future, but said he would \"of course\" act on the findings of Sir Laurie who will look into whether she broke ministerial rules. In an interview with the BBC, Sir Keir said: \"There's a clear procedure. I strengthened that procedure. I am expecting a result pretty quickly. \"I do want it to be comprehensive … and then of course I will act on whatever the report is that's put in front of me.\""
    },
    {
        "title": "Probe launched after phone plot to play 'sex noises' behind Starmer at PMQs uncovered",
        "description": "An investigation has been launched after security guards foiled a plot to embarrass the prime minister by playing \"sex noises\" from a phone hidden in the Commons.",
        "url": "https://news.sky.com/story/probe-launched-after-phone-plot-to-play-sex-noises-behind-starmer-at-pmqs-uncovered-13425020",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-pmqs-sir-keir-starmer_7011265.jpg?20250904170723",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-04 15:36:00",
        "Headline": "The plan to play sexually explicit noises behind the PM was foiled - but the alleged prank is being seen as a security breach.",
        "Content": "An investigation has been launched after security guards foiled a plot to embarrass the prime minister by playing \"sex noises\" from a phone hidden in the Commons. Parliamentary staff carrying out a routine sweep of the chamber ahead of PMQs uncovered the mobile phone, which had been taped to the underside of the Commons table, Sky News understands. It appears that the device had been set to play a sexually explicit recording if rung, and that the person behind the plot hoped to make this happen as Sir Keir Starmer faced off against Kemi Badenoch on Wednesday lunchtime. Politics latest - live updates But, a Commons source has told Sky News, that parliamentary security guards found the device before it could go off. The source explained that the phone had been attached to the underside of the table, near the front bench, with double-sided sticky tape, and that this had lost its grip, leading to the phone lying exposed on the floor. The phone later rang twice during PMQs with a \"sex noise\" ringtone, but it had already been removed from the chamber. \n                  D-Day for Rayner? PM's adviser prepares pivotal verdict - as her lawyers deny giving tax advice\n                 \n                  Reform conference gets under way - as Farage returns from Trump meeting\n                 \n                  Everything you need to know about being a political party member\n                  However, while the plot - believed to be a prank - was avoided, security staff do not know who was behind it or how the phone came to be there. It is being treated as a serious security breach, and it is understood that there is no clear footage of the phone being planted. A spokesperson for The Metropolitan Police said: \"At 10.25hrs on Wednesday, 3 September a mobile phone was found during a routine search of the House of Commons chamber by Met officers. \"Enquiries have led officers to believe that the phone was purposely placed in a location with the aim of causing disruption to business in the House. \"An investigation has been launched and enquiries are ongoing. We have updated the Speaker and Clerk of the House.\" A UK Parliament spokesperson said: \"Parliament is a public building and we facilitate the visits of thousands of people to the estate each week. \"The safety and security of everyone who works or visits here remains our top priority, and we have robust and proactive security measures in place - this includes ensuring that visitors and their belongings are security screened, along with monitoring and routine searches of areas that are open to the public. \"Whilst we cannot comment on the detail of our processes, we can confirm that a mobile phone was removed from the Commons Chamber on 3 September - demonstrating the effectiveness of the security measures we have in operation.\" Hundreds of parliamentary security staff were on strike over pay and conditions on Wednesday morning, meaning visitors were banned from the parliamentary estate. It is not the first time there have been breaches of parliamentary security in recent years. A group of semi-naked men and women glued themselves to the glass of the public gallery in the Commons in 2019, to protest about climate change. A dozen people were subsequently arrested. Responding to a request for comment, a parliamentary spokesperson said: \"The safety and security of all those who work in Parliament is our top priority, however we cannot comment on specific security measures.\""
    },
    {
        "title": "Fate of 'Red Queen' Rayner in hands of 'quango king' baronet",
        "description": "The backgrounds of Angela Rayner and Sir Laurie Magnus - the sleaze watchdog who holds her fate in his hands - couldn't be more different.",
        "url": "https://news.sky.com/story/fate-of-red-queen-rayner-in-hands-of-quango-king-baronet-13424998",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sir-laurie-magnus-starmer_7011212.jpg?20250904160541",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-09-04 14:43:00",
        "Headline": "Angela Rayner has admitted she \"did not pay the appropriate stamp duty\" on a property she bought in Hove. Sir Laurie Magnus could determine her political fate.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n The backgrounds of Angela Rayner and Sir Laurie Magnus - the sleaze watchdog who holds her fate in his hands - couldn't be more different. Labour's \"Red Queen\" is a working-class council house girl who got pregnant at 16. He's an old Etonian \"quango king\", a City grandee and a pillar of the establishment. He's so posh he wasn't awarded his knighthood in the usual way by the Monarch after being nominated by 10 Downing Street. He's a baronet whose title is hereditary. But though Sir Laurie's a proper toff, he's no pushover and he doesn't waste time. In 2023 his investigation into former Tory minister Nadhim Zahawi's tax affairs took just six days. Sir Laurie concluded that Mr Zahawi's conduct had fallen below what was expected from a minister. So the then PM Rishi Sunak sacked him for a \"serious breach of the ministerial code\". This year, Labour minister Tulip Siddiq quit after Sir Laurie said she should have been more alert to \"potential reputational risks\" of ties to her aunt in an anti-corruption investigation in Bangladesh. That inquiry took eight days, so might Sir Laurie's Angela Rayner probe take about a week? Perhaps, though it has been suggested he's due to go on holiday on Saturday. So could his report come before then? \n                  D-Day for Rayner? PM's adviser prepares pivotal verdict - as her lawyers deny giving tax advice\n                 \n                  Tories repeat calls for Rayner to resign after lawyers claim they did not provide tax advice\n                 \n                  Angela Rayner a 'massive hypocrite', says ex-Scottish Tory leader Ruth Davidson\n                 Sir Laurie was appointed by Mr Sunak more than eight weeks after he became PM. At the time, there were claims that he was struggling to find a candidate. That was because the two previous holders of the post, veteran mandarin Sir Alex Allan and former Royal courtier Sir Christopher Geidt, both quit after disagreements with Boris Johnson. Sir Alex quit in 2020 after finding former home secretary Priti Patel guilty of bullying. But then Mr Johnson declared that she had not breached the ministerial code.  Sir Christopher, a former private secretary to the Queen, quit in June 2022 after concluding Mr Johnson may have broken ministerial rules over party-gate. So Mr Sunak turned to Sir Laurie, a former merchant banker who served on half a dozen quangos and whose long business career involved links with disgraced retail tycoon Sir Philip Green and the late tycoon Robert Maxwell. Read more:Rayner admits she should have paid more stamp dutyRayner came out fighting in Sky interviewRayner's tax affairs statement in full There was immediately controversy because Mr Sunak refused to give Sir Laurie the power to launch his own investigations into allegations or ministerial wrong-doing. That changed when Sir Keir Starmer became PM last year. But before then, Sir Laurie couldn't launch his own inquiry into the conduct of Dominic Raab over bullying allegations or Suella Braverman over claims of leaking and ignoring legal advice over asylum.  The role of independent adviser on ministerial standards, to give Sir Laurie his official title, was created by Tony Blair in 2006. Ministers can refer themselves for investigation, as Tulip Siddiq and Angela Rayner both did. Why was Sir Laurie chosen? A senior Square Mile insider told Sky News: \"Laurie Magnus is very much a member of the City's great and the good.\" Sir Laurence Henry Philip Magnus, 3rd Baronet is the third in a baronetcy that dates back to 1917, when it was awarded to an ancestor who represented London University in the House of Commons. His quango CV includes the chairmanship of Historic England, a former trustee of the conservation charity the Landmark Trust, ex-chair of the National Trust, membership of the Culture Recovery Fund, a trustee of English Heritage Trust and deputy chair of the All Churches Trust.  As Historic England boss, Sir Laurie entered the row over the tearing down of the statue of slave trader Edward Colston in Bristol, claiming such statues should not be removed but have \"counter-memorials\" placed alongside them. Besides his quango roles, Sir Laurie remains a major figure in the City, as a senior adviser at investment banking group Evercore and chairing two FTSE 250 listed investment trusts. Which means that the class divide between the old Etonian City grandee and the former shop steward and champion of workers' rights whose fate is in his hands couldn't be greater."
    },
    {
        "title": "Boris Johnson ally Nadine Dorries latest Tory to defect to Reform UK",
        "description": "Former Conservative culture secretary&#160;Nadine&#160;Dorries has become the latest high-profile defection to Reform UK.",
        "url": "https://news.sky.com/story/boris-johnson-ally-nadine-dorries-latest-tory-to-defect-to-reform-uk-13425120",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nadine-dorries_7011352.jpg?20250904191042",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-04 19:00:00",
        "Headline": "Former culture secretary says the Conservatives are \"dead\" and only Nigel Farage has \"the knowledge and the will to deliver\".",
        "Content": " Former Conservative culture secretary Nadine Dorries has become the latest high-profile defection to Reform UK. Boris Johnson loyalist Ms Dorries, who resigned from the House of Commons in 2023, said she made the decision because her former party was now \"dead\". Politics latest: Home Office bid to delay Epping hotel case rejected, says council Writing in the Daily Mail, she said: \"The time for action is now and I believe that the only politician who has the answers, the knowledge and the will to deliver is Nigel Farage.\" She went on to say it was \"time for change\" and \"time make Britain great again\". \"My decision to leave the party I've served for more than 30 years is possibly the most difficult I've ever had to make, and it has taken me 12 agonising months to reach.\" Analysis: An act of revenge for Johnson's demise The move will bolster Reform UK as it prepares to host its conference in Birmingham on Friday and Saturday. Ms Dorries follows Sir Jake Berry, a former Tory Party chairman, in joining Mr Farage's party. Tom Pursglove, a former Conservative minister, said he is was surprised to see the defection. He told Sophy Ridge on the Politics Hub: \"Nadine has been quite unhappy for a long period of time. Obviously she left parliament before the end of the term, so this doesn't really surprise me. \"I hate seeing Conservative colleagues leaving the Conservative fold. It pains me when I see someone I respect and admire and actually I would consider Nadine to be a friend.\" He added: \"That doesn't change now because she's in another party - but I hate seeing this, it's terrible.\" A Conservative Party spokesperson said: \"We wish Nadine well.\" A Labour Party spokesperson added: \"Nadine Dorries says the Tory Party is dead - as one of the people who helped to kill it, she should know. Read more:Angela Rayner's future is out of her controlReform to hold vote on transgender prisoners at party conference \"She backed Boris Johnson through thick and thin despite the partying in Downing Street during the pandemic while people couldn't see their loved ones. And now she wants to help unleash the same chaos the Tories inflicted on Britain by joining Nigel Farage's Reform.\" They added: \"Nadine Dorries has gone on quite a political journey - from being the minister who introduced the Online Safety Bill to joining a party that wants to scrap it without having any idea how to replace its protections for children and adults. \"It's a perfect illustration of how incoherent Reform are - all anger, no answers, with contradictions building by the day.\" A Liberal Democrat source said: \"We don't know who to feel more sorry for, Kemi Badenoch or Nigel Farage.\""
    },
    {
        "title": "Revealed: Huge shortfall in NHS funding for weight-loss jab",
        "description": "So little money has been set aside by the NHS for the rollout of the Mounjaro weight-loss jab in GP surgeries that as few as one in five people with life-threatening obesity is likely to get treatment, new research shows.",
        "url": "https://news.sky.com/story/revealed160huge-shortfall-in-nhs-funding-for-weight-loss-jab-13424996",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mounjaro-weight-loss_6948297.jpg?20250623033923",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-09-04 14:32:00",
        "Headline": "New research reveals only one in five eligible patients may receive treatment as local NHS budgets fail to meet demand, sparking concerns over a postcode lottery and rationed care.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n So little money has been set aside by the NHS for the rollout of the Mounjaro weight-loss jab in GP surgeries that as few as one in five people with life-threatening obesity is likely to get treatment, new research shows. The NHS estimates that around 220,000 people living with obesity will be eligible for treatment through their GP over the next three years. But Freedom of Information requests by the British Medical Journal revealed that funding from NHS England has fallen well short of what is needed for the rollout. Just nine out of 40 Integrated Care Boards (ICBs) in England said they had enough funding to treat the 70% of eligible patients who are expected to come forward. Four ICBs - which plan health services in local areas - said NHS funding covered just 25% or fewer of their eligible patients. Coventry and Warwickshire ICB said funding would only stretch to treat 21% of its patients. The findings confirm an investigation by Sky News earlier this summer that access to Mounjaro is a postcode lottery for people living with obesity. Ellen Welch, Doctors' Association UK (DAUK) co-chair, told the BMJ: \"These figures confirm the fear that the rollout is not fit for purpose. \"There is a huge discrepancy between national messaging and what patients are actually being delivered on a local level.\" Read more from Sky News:How fake papers helped family get to BritainBank lobby chief warns Reeves over budget tax raid  Five ICBs admitted they are already considering further tightening the prescribing criteria or rationing the treatment beyond the plan agreed by the NHS. Any change would effectively move the goalposts for people who thought they qualified for NHS treatment. Birmingham and Solihull ICB received funding to cover just 52% of its eligible patients. It admitted: \"Difficult decisions are having to be made to ensure money is spent in the most effective and efficient way possible and for the greatest patient benefit.\" Dr Jonathan Hazlehurst, an obesity specialist and researcher at the University of Birmingham, said NHS England has only provided funding for just over 22,000 patients in the first year of the rollout. \"It shows that there's a lack of political will to fund this adequately,\" he told Sky News. \"NHS England says that obesity costs the NHS £11.4bn per annum as a pure NHS cost. \"Yet we can't even afford to properly fund the rollout of a life-changing drug in year one. That just doesn't make any sense.\" An NHS spokesperson said: \"The NHS is fully supporting the phased rollout of tirzepatide for eligible patients, having issued guidance in line with the NICE guidance, and provided funding to local ICBs to support patient care in March 2025. \"These represent brand-new services in primary care that are being established and scaled up over time, starting with those who are in the most need - and in the meantime, eligible patients can get weight loss support from a range of other services, including the NHS Digital Weight Management programme.\""
    },
    {
        "title": "Fake celebrity chatbots among those sending harmful content to children 'every five minutes'",
        "description": "Chatbots pretending to be Star Wars characters, actors, comedians and teachers on one of the world's most popular chatbot sites are sending harmful content to children every five minutes, according to a new report.",
        "url": "https://news.sky.com/story/fake-celebrity-chatbots-among-those-sending-harmful-content-to-children-every-five-minutes-13424865",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-character-ai-chatbot_7011005.jpg?20250904122527",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-09-04 11:00:00",
        "Headline": "In one example, a bot pretending to be Rey from Star Wars coached a 13-year-old in how to hide her antidepressants so her parents thought she'd taken them.",
        "Content": "\n          Science and technology reporter\n       Chatbots pretending to be Star Wars characters, actors, comedians and teachers on one of the world's most popular chatbot sites are sending harmful content to children every five minutes, according to a new report. Two charities are now calling for under-18s to be banned from Character.ai. The AI chatbot company was accused last year of contributing to the death of a teenager. Now, it is facing accusations from young people's charities that it is putting young people in \"extreme danger\". \"Parents need to understand that when their kids use Character.ai chatbots, they are in extreme danger of being exposed to sexual grooming, exploitation, emotional manipulation, and other acute harm,\" said Shelby Knox, director of online safety campaigns at ParentsTogether Action. \"Parents should not need to worry that when they let their children use a widely available app, their kids are going to be exposed to danger an average of every five minutes. \"When Character.ai claims they've worked hard to keep kids safe on their platform, they are lying or they have failed.\"  During 50 hours of testing using accounts registered to children ages 13-17, researchers from ParentsTogether and Heat Initiative identified 669 sexual, manipulative, violent, and racist interactions between the child accounts and Character.ai chatbots. \n                  The BTO Kid: 'I spent months in a coma - AI has given me a musical voice'\n                 \n                  'Game-changing' AI stethoscopes could detect heart conditions in seconds\n                 \n                  Nvidia: Tech bubble seems safe so long as AI demand remains high\n                 That's an average of one harmful interaction every five minutes. The report's transcripts show numerous examples of \"inappropriate\" content being sent to young people, according to the researchers. Read more from Sky News:Rayner admits stamp duty errorMurdered teen's mum wants smartphone banShein investigates after likeness of Luigi Mangione used to model shirt In one example, a 34-year-old teacher bot confessed romantic feelings alone in his office to a researcher posing as a 12-year-old. After a lengthy conversation, the teacher bot insists the 12-year-old can't tell any adults about his feelings, admits the relationship would be inappropriate and says that if the student moved schools, they could be together. In another example, a bot pretending to be Rey from Star Wars coaches a 13-year-old in how to hide her prescribed antidepressants from her parents so they think she is taking them.  In another, a bot pretending to be US comedian Sam Hyde repeatedly calls a transgender teen \"it\" while helping a 15-year-old plan to humiliate them. \"Basically,\" the bot said, \"trying to think of a way you could use its recorded voice to make it sound like it's saying things it clearly isn't, or that is might be afraid to be heard saying.\" Bots mimicking actor Timothy Chalomet, singer Chappell Roan and American footballer Patrick Mahomes were also found to send harmful content to children. Character.ai bots are mainly user-generated and the company says there are more than 10 million characters on its platform. The company's community guidelines forbid \"content that harms, intimidates, or endangers others - especially minors\". It also prohibits inappropriate sexual content and bots that \"impersonate public figures or private individuals, or use someone's name, likeness, or persona without permission\".  Character.ai's head of trust and safety Jerry Ruoti told Sky News: \"Neither Heat Initiative nor Parents Together consulted with us or asked for a conversation to discuss their findings, so we can't comment directly on how their tests were designed. \"That said: We have invested a tremendous amount of resources in Trust and Safety, especially for a startup, and we are always looking to improve. We are reviewing the report now and we will take action to adjust our controls if that's appropriate based on what the report found. \"This is part of an always-on process for us of evolving our safety practices and seeking to make them stronger and stronger over time. In the past year, for example, we've rolled out many substantive safety features, including an entirely new under-18 experience and a Parental Insights feature. \"We're also constantly testing ways to stay ahead of how users try to circumvent the safeguards we have in place. \"We already partner with external safety experts on this work, and we aim to establish more and deeper partnerships going forward. \"It's also important to clarify something that the report ignores: The user-created Characters on our site are intended for entertainment. People use our platform for creative fan fiction and fictional roleplay. \"And we have prominent disclaimers in every chat to remind users that a Character is not a real person and that everything a Character says should be treated as fiction.\" Last year, a bereaved mother began legal action against Character.ai over the death of her 14-year-old son. Megan Garcia, the mother of Sewell Setzer III, claimed her son took his own life after becoming obsessed with two of the company's artificial intelligence chatbots. \"A dangerous AI chatbot app marketed to children abused and preyed on my son, manipulating him into taking his own life,\" said Ms Garcia at the time. A Character.ai spokesperson said it employs safety features on its platform to protect minors, including measures to prevent \"conversations about self-harm\"."
    },
    {
        "title": "Legendary fashion designer Giorgio Armani dies",
        "description": "Legendary fashion designer Giorgio Armani has died aged 91 - with the worlds of fashion and showbiz paying tribute to a \"giant\" and a \"master of his craft\".",
        "url": "https://news.sky.com/story/legendary-fashion-designer-giorgio-armani-dies-13424939",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-giorgio-armani-italy_7011167.jpg?20250904145742",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-04 13:13:00",
        "Headline": "Armani originally wanted to be a doctor but changed his mind after a part-time job as a window dresser in Milan exposed him to fashion for the first time.",
        "Content": " Legendary fashion designer Giorgio Armani has died aged 91 - with the worlds of fashion and showbiz paying tribute to a \"giant\" and a \"master of his craft\". The Italian billionaire died at home surrounded by his family on Thursday. \"With infinite sorrow, the Armani Group announces the passing of its creator, founder, and tireless driving force: Giorgio Armani,\" his fashion house said. Tributes flood in for Armani - as it happened \"Il Signor Armani, as he was always respectfully and admiringly called by employees and collaborators, passed away peacefully, surrounded by his loved ones. \"Indefatigable to the end, he worked until his final days, dedicating himself to the company, the collections, and the many ongoing and future projects.\" A funeral chamber will be set up at Milan's Armani Teatro for people to pay tribute between 9am and 6pm this weekend. Armani did not appear at his runway shows in Milan for the first time ever in June as he recovered from an unknown illness. Only a week ago, when he was interviewed by the Financial Times, he revealed he \"oversaw every aspect of the show remotely via video link\". \"My greatest weakness is that I am in control of everything,\" he told the newspaper. \"Everything you will see has been done under my direction and carries my approval.\" 'A symbol of the best of Italy' Italy's President Giorgia Meloni was among the first to pay tribute. \"Giorgio Armani leaves us at 91 years old,\" she wrote on X. \"With his elegance, sobriety, and creativity, he was able to bring lustre to Italian fashion and inspire the entire world. An icon, a tireless worker, a symbol of the best of Italy. Thank you for everything.\" Fellow fashion mogul Donatella Versace followed, saying: \"The world has lost a giant today. He made history and will be remembered forever.\" American designer Ralph Lauren said he \"always had the deepest respect and admiration\" for Armani. Dame Anna Wintour, who this year stepped down as head of American Vogue after 37 years, said the designer \"understood power and attitude and elegance as well as anyone ever has in fashion\". Julia Roberts, who famously wore Armani menswear to the Golden Globe awards in 1990, shared a picture of the pair together on Instagram with the caption: \"A true friend. A Legend.\" American model Cindy Crawford called him a \"master of his craft\" - while the Italian football world also offered its condolences. Juventus described him as a \"timeless icon of elegance and Italian style\". Inter Milan, who Armani supported, said he was \"an icon of our city, a fashion legend who, with his creativity and elegance, knew how to tell the story of Italianness around the world\". Legendary film director Martin Scorsese also paid tribute, heralding Armani as \"more than a clothing designer\". \"He was a real artist, and a great one - people use the term 'timeless' quite often, but in his case it happens to be true,\" said Scorsese. Armani contributed to the wardrobe design for the director's 1995 film Casino, creating suits for Robert De Niro's character, Ace Rothstein. The pair came together again for The Wolf of Wall Street (2013), where Armani this time suited up Leonardo DiCaprio.  'King Giorgio' Born in the small northern Italian town of Piacenza in July 1934, Armani originally wanted to be a doctor but changed his mind after a part-time job as a window dresser at a Milan store exposed him to fashion for the first time. As one of the most influential designers of the 20th century, he is often credited with spearheading red carpet fashion and was planning a major event during Milan Fashion Week this month to mark 50 years of his brand. He put Italian ready-to-wear style on the map in the late 1970s with his signature 'Armani suit' before adapting its classic style for women with the launch of the female 'power suit' in the 1980s. He also dressed Hollywood and music stars, including Julia Roberts, George Clooney, Cate Blanchett, and Lady Gaga. Read more:From Gere to Gaga: Armani's best celebrity looks Armani, or Re Giorgio (King Giorgio) as he was widely known, worked on more than 200 films, most notably earlier in his career on American Gigolo with Richard Gere in 1980. He was awarded both the French Legion of Honour and Italian Order of Merit for Labour for his contributions to the fashion industry. With an empire of more than £7.44bn at the time of his death, his work expanded beyond clothes to home furnishings, perfumes, books, flowers, bars, clubs, and restaurants. He also owned the basketball team EA7 Armani Milan, better known as Olympia Milano. Armani sparked controversy in 2015 for comments he made about fashion choices among gay men - and previously in 2009 when his company was forced to settle with the Italian tax authorities over its offshore subsidiaries."
    },
    {
        "title": "From Gere to Gaga: The best celebrity looks created by Giorgio Armani",
        "description": "Italian fashion designer Giorgio Armani, known for ready-to-wear fashion and staple suits, has died.",
        "url": "https://news.sky.com/story/from-gere-to-gaga-the-best-celebrity-looks-created-by-giorgio-armani-13424949",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-giorgio-armani-celebrities_7011253.jpg?20250904164413",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-04 13:26:00",
        "Headline": "Throughout his career, Giorgio Armani dressed many of the rich and famous in Hollywood. Here, we look-back at some of his most iconic designs, and who wore them.",
        "Content": "Italian fashion designer Giorgio Armani, known for ready-to-wear fashion and staple suits, has died. The 91-year-old started the fashion house in 1975 with his partner Sergio Galeotti, but it is the 1980 classic film American Gigolo that is credited with launching Armani's career. He designed the wardrobe for the film's star, Richard Gere, who was launched into the spotlight as America's new favourite heart throb, and Armani as one of the most popular designers. Over his career, he earned over 200 wardrobe credits. Giorgio Armani latest: Follow live updates As well as dressing actors on screen, red carpets were filled with Armani's tailored black tie outfits and evening gowns, with everyone from Jodie Foster, Beyonce and Diane Keaton wearing his designs. Here, we look at some of Armani's iconic looks created for both the big screen and the red carpet. Diane Keaton wore a custom double-breasted jacket to the 1978 Academy Awards, where she won Best Actress for her performance in Woody Allen's romantic comedy Annie Hall. Richard Gere stars in American Gigolo. The suits made by Armani were originally for John Travolta, who later dropped out of the film and was replaced by Gere. Grace Jones wore a man's wide-shouldered Armani blazer on the cover of the 1981 album Nightclubbing. Julia Roberts wore an oversized men's Armani suit at the 1990 Golden Globes. The look has become iconic in fashion history as the actress stepped away from wearing the conventional ballgown. Armani collaborated with Goodfellas director Martin Scorsese to create suits for Robert De Niro, Ray Liotta, Joe Pesci in the 1990 classic film. Jodie Foster wore an Armani suit at the 1992 Academy Awards, where she won Best Actress for The Silence Of The Lambs. When Tom Cruise tied the knot with actress Katie Holmes in 2006, it was Armani who was tasked with creating her wedding dress. Performing her hit song All The Single Ladies at the 2008 American Music Awards, Beyonce wore a custom Armani bodysuit. David and Victoria Beckham wore Armani at the 2008 Met Gala in New York. The theme was superheroes: fashion and fantasy and Armani co-chaired the gala that year. Lady Gaga wore a galactic-inspired dress at the 2010 Grammy Awards, which was part of Giorgio Armani Prive - the designer's haute couture collection. The outfit turned heads as it was unlike Armani's typical styles. Demi Moore wore a sculpted gold gown at this year's Golden Globes, where she won Best Performance by a Female Actor for her role in The Substance."
    },
    {
        "title": "Morrissey puts his business interests in The Smiths up for sale - and hits out at former bandmates",
        "description": "Morrissey has announced he is putting the entirety of his business interests in The Smiths up for sale \"to any interested party/investor\".",
        "url": "https://news.sky.com/story/morrissey-puts-his-business-interests-in-the-smiths-up-for-sale-and-hits-out-at-former-bandmates-13424982",
        "image_url": "https://e3.365dm.com/21/04/1920x1080/skynews-glastonbury-morrissey_5348646.jpg?20250904152318",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-09-04 14:15:00",
        "Headline": "Singer said he was \"burnt out\" and wanted to \"live disassociated from those who wish me nothing but ill-will and destruction\".",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Morrissey has announced he is putting the entirety of his business interests in The Smiths up for sale \"to any interested party/investor\". The 66-year-old musician, whose full name is Steven Patrick Morrissey, posted on social media and his website, Morrissey Solo, titling the post \"A Soul for Sale,\" telling fans he \"has no choice\". The deal includes the band's name and artwork (which he created), as well as his share of merchandising rights, lyrical and musical compositions, synchronisation, recordings and publishing contractual rights. The musician said he was \"burnt out\" by his former bandmates Johnny Marr, Mike Joyce and the late Andy Rourke, and had \"had enough of malicious associations\". He went on: \"With my entire life, I have paid my rightful dues to these songs and these images. I would now like to live disassociated from those who wish me nothing but ill-will and destruction, and this is the only resolution.\" Morrissey went on in his statement: \"The songs are me - they are no one else - but they bring with them business communications that go to excessive lengths to create as much dread and spite year after year.\" The Smiths split up in 1987 after just five years together, but they remain one of the most influential bands of the decade. \n                  Unlike Oasis, Morrissey says The Smiths will not reunite for worldwide tour after bandmate turns down offer\n                 \n                  Morrissey asks Johnny Marr to 'just leave me out of it' and stop talking about him in interviews\n                 \n                  Morrissey's manager criticises The Simpsons' portrayal of star as 'hurtful and racist'\n                 Morrissey concluded his statement, saying: \"I must now protect myself, especially my health.\" Last year, he sought \"medical supervision for physical exhaustion,\" and cancelled shows in the US. Morrissey asked any \"serious investors\" to make contact, and supplied an email address. Morrissey and Marr have previously traded blows over shares of the rights to the Smiths, with Marr denying acquiring full rights to the Smiths' trademark \"without consultation\". Marr has previously said he declined lucrative offers for the Smiths to re-form, telling Sky News in 2016 that Morrissey's apparently pro-Nigel Farage views would be \"a slight drawback\" to any possible reunion. Joyce recently announced he will be publishing a tell-all memoir, The Drums, this November. Morrissey has been facing difficulties with the release of his 14th solo album, Bonfire of Teenagers, which leads with a song he has been performing since 2022 about the 2017 terrorist attack on an Ariana Grande concert in Manchester that killed 22 people. He was also dropped by his former label BMG in November 2020, and later parted ways with his new label Capitol Records. He has since said \"every major label in London\" had refused the album, calling it his \"masterpiece\". Sky News has contacted representatives for Marr and Joyce for comment."
    }
]