[
    {
        "title": "What we learned from the latest release of Epstein files",
        "description": "A trove of newly released Epstein files include emails that appear to involve Andrew Mountbatten-Windsor, while another suggests Donald Trump travelled on the billionaire's private jet \"many more times than previously has been reported\".",
        "url": "https://news.sky.com/story/what-we-learned-from-the-latest-release-of-epstein-files-13487073",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jeffrey-epstein-oversightdems_7114380.jpg?20251223152143",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-23 15:19:00",
        "Headline": "The US Department of Justice released at least 11,000 more files on Tuesday that appear to include messages involving Andrew Mountbatten-Windsor.",
        "Content": "A trove of newly released Epstein files include emails that appear to involve Andrew Mountbatten-Windsor, while another suggests Donald Trump travelled on the billionaire's private jet \"many more times than previously has been reported\". The US Department of Justice released at least 11,000 more files on Tuesday. It went on to claim that some of them \"contain untrue and sensationalist claims\" about President Trump. Here are some of the latest news lines from this release of Epstein files. Being named in these papers does not suggest wrongdoing.  Who is 'The Invisible Man'? Among the documents released is an email sent to Ghislaine Maxwell that speaks about \"the girls\" being \"completely shattered\" at a Royal Family summer camp at Balmoral. It is dated 16 August 2001 and sent by a person referred to only as \"The Invisible Man\", but whom Sky News is reporting appears to be the former prince, Andrew. We have come to that conclusion from reviewing the email address used, which is assigned to the Duke of York in Epstein's contacts book and the chain of correspondence. In the correspondence, \"The Invisible Man\" asks Maxwell: \"How's LA? Have you found me some new inappropriate friends?\" Andrew Mountbatten-Windsor has previously denied any allegations against him. The Peru trip Another email appears to show Maxwell arranging \"two-legged sight seeing\" for \"The Invisible Man\" during a trip to Peru. She appears to forward to \"The Invisible Man\" part of a conversation between herself and another person. The email says: \"I just gave Andrew your telephone no. He is interested in seeing the Nazca lines. He can ride but it is not his favorite sport ie pass on the horses.\" \"Some sight seeing some 2 legged sight seeing (read intelligent pretty fun and from good families) and he will be very happy. I know I can rely on you to show him a wonderful time and will only introduce him to friends that you can trust,\" Maxwell said. The context of the email is unclear and there is no suggestion of any wrongdoing. Trump on Epstein's jet? The latest bunch of files also includes an email from an unidentified prosecutor dated 7 January, 2020, in which President Trump is mentioned. The email accuses him of travelling on Epstein's private jet \"many more times than previously has been reported\". It adds that President Trump \"is listed as a passenger on at least eight flights between 1993 and 1996, including at least four flights on which Maxwell was also present\". The email's sender and receiver have been redacted. However, at the bottom of the email it says assistant US attorney, Southern District of New York. The name has also been redacted. President Trump has denied any wrongdoing in relation to his relationship with Epstein, and being on any of Epstein's flights does not indicate any wrongdoing. Read more:Trump defends 'big boy' Clinton after Epstein files releaseWhy Andrew photo in Epstein files is awkward for Royal Family Limousine driver report about Trump One of the documents in the release shows a report made to the FBI that was recorded on 27 October 2020. It includes an unverified claim by a limousine driver that he overheard the US president discussing \"abusing some girl\" in 1995. The driver also mentions Trump said \"Jeffrey\" while on the phone during a journey to Dallas Fort Worth Airport in Texas. A significant part of the statement, along with the driver's identity, has been redacted. The US justice department has said that some of the documents in the latest Epstein files release \"contain untrue and sensationalist claims made against President Trump that were submitted to the FBI right before the 2020 election\". \"To be clear: the claims are unfounded and false, and if they had a shred of credibility, they certainly would have been weaponized against President Trump already,\" it said. Postcard mentions 'our president' Also among the documents is a postcard that claims to have been sent by Jeffrey Epstein, but has been refuted by the justice department. In it, the sender tells the recipient: \"Our president also shares our love of young, nubile girls.\" It's not clear who \"our president\" refers to and the context of the postcard is also unclear. The US justice department initially said it was \"looking into the validity\" of the postcard but later said on X that the \"FBI has confirmed\" the postcard is \"FAKE\". It cited reasons including a claim that the writing does not appear to match Epstein's and another that the letter was postmarked three days after his death. Row over unreleased documents It is believed that many files relating to Epstein are yet to be made public. There has been anger at the justice department's slow release of the files, with politicians threatening to launch legal action against Attorney General Pam Bondi. The deadline for the release of all the documents has passed. \"The DOJ needs to quit ⁠protecting the rich, powerful, and politically connected,\" Republican congressman Thomas Massie said."
    },
    {
        "title": "Epstein survivor speaks of moment she met Andrew on private island",
        "description": "A survivor of Jeffrey Epstein has spoken of the moment she met Andrew Mountbatten-Windsor on the disgraced financier's private island.",
        "url": "https://news.sky.com/story/epstein-survivor-speaks-of-moment-she-met-andrew-on-private-island-13487135",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-lisa-phillips-epstein_7118574.png?20251223213306",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-23 20:05:00",
        "Headline": "Speaking to US correspondent James Matthews, Lisa Phillips says revealing the true extent of Epstein's abuses is important for the protection of future generations.",
        "Content": "A survivor of Jeffrey Epstein has spoken of the moment she met Andrew Mountbatten-Windsor on the disgraced financier's private island. Lisa Phillips says that revealing the true extent of Epstein's abuses is important for the protection of future generations. Andrew Mountbatten-Windsor has previously denied any allegations against him. Speaking to US correspondent James Matthews on the day a new tranche of documents was released, she said she believes the \"really important stuff\" wasn't released.  She recalled meeting Epstein in 2000 when she was working as a fashion model. Ms Phillips said she was working on an island near Saint Thomas in the Caribbean and went over to Epstein's island for a day, and met Epstein himself at dinner that evening. \n                  What we learned from the latest release of Epstein files\n                 \n                  Epstein files latest: 'Invisible Man' thought to be Andrew asks Ghislaine Maxwell if she's found him 'inappropriate friends' in 2001 email\n                 \n                  Trump 'hated' to see Bill Clinton photos in Epstein files\n                 \"It took a few hours of him speaking to me one-on-one at the table, basically asking me a lot of questions about my life and my relationship with my family and my ambitions.\" She said Epstein was \"very big\" on her goals and became excited when he heard she had lived in Oxford, England, as a child. \"He asked me if I wanted to meet a prince, and I said yes.\" Epstein files latest: New batch of documents released Ms Phillips explained that a man walked up and was introduced to her, and that he spoke to some people there and then said goodbye. \"It was very brief,\" she said, adding that only years later did she realise that this was the former prince, Andrew. She was asked about an email in the recently released files that appears to show Andrew Mountbatten-Windsor asking Ghislaine Maxwell about \"inappropriate friends\". \"That is a very revealing email, isn't it?\" Ms Phillips said. \"It's very creepy, disturbing, and I mean, that's why she's in jail, right?\" The context of the email is unclear, and there is no suggestion of any wrongdoing. Andrew Mountbatten-Windsor has previously denied any allegations against him and Sky News has contacted Andrew's representatives for comment on the latest release. Asked about the impact being in Epstein's orbit has had on her life, Ms Phillips said: \"It hasn't felt good to know that so much of my past that I worked hard for was really just smoke and mirrors and part of a bigger web.\" On the delays in releasing the files, she claimed \"the really important stuff wasn't released\". She also spoke about her and other survivors' ongoing fight for justice. \"We're still doing our research, and we will still be bringing whatever we find to the proper authorities. And we're not going to give up.\""
    },
    {
        "title": "Details of King Charles's Christmas message revealed - as he chooses to deliver it away from palace",
        "description": "A photograph has been released by Buckingham Palace showing the King delivering his Christmas message again outside of traditional palace walls.",
        "url": "https://news.sky.com/story/king-charles-will-deliver-christmas-message-from-outside-palace-walls-once-again-13487122",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-king-charles-charles_7118488.jpg?20251223183226",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-12-23 22:00:00",
        "Headline": "The King has decided to record this year's broadcast from the Lady Chapel inside Westminster Abbey, Buckingham Palace reveals.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n A photograph has been released by Buckingham Palace showing the King delivering his Christmas message again outside of traditional palace walls. This year the annual address was filmed in the Lady Chapel inside Westminster Abbey, the second time the monarch has recorded it away from a royal residence. The palace has revealed the abbey was chosen for the setting this year to reflect a major theme of the message, pilgrimage.   The full details of what he says are always kept secret until it is broadcast at 3pm on Christmas Day. The message is always seen as a deeply personal one from the monarch, as a rare speech delivered by the King without advice from, or consultation with, the government. Westminster Abbey was seen as a perfect location to reflect the theme of pilgrimage with pilgrims visiting every year to remember the legacy of Edward the Confessor, whose shrine lies at the heart of the abbey. Around the walls of the Lady Chapel are 95 statues of saints dating from the building of the chapel in the 16th century. The abbey, as the site of the King's own coronation and that of every monarch since 1066, also has royal significance. The Henry VII Lady Chapel is the burial place of 15 Kings and Queens including Elizabeth I, Mary I and Mary Queen of Scots. Below the central aisle is the Hanoverian vault where George II and members of his family are buried. The Stuart vault is in the south aisle where Charles II, William III and Mary II, and Queen Anne lie buried. Read more:William and Kate reveal Christmas card featuring family photoKing reveals cancer treatment will be reduced in the new year It is understood the King takes a particular interest in where the message is filmed each year, favouring different locations outside of royal palaces over the past two years. In the photograph, taken during filming, you can also see brightly lit Christmas trees used for another royal event in December. They were still inside the abbey following the filming of the Princess of Wales's Together at Christmas carol service, which will be broadcast on Christmas Eve."
    },
    {
        "title": "'Catastrophic' explosion at US nursing home",
        "description": "Two people have died and others are missing after an explosion at a nursing home in the US.",
        "url": "https://news.sky.com/story/explosion-at-us-nursing-home-with-deaths-reported-and-people-missing-13487179",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nursing-home-explosion_7118661.jpg?20251224003559",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-23 23:18:00",
        "Headline": "The blast at the nursing home in Bristol Township outside Philadelphia was caused by a suspected gas leak. ",
        "Content": "Two people have died and others are missing after an explosion at a nursing home in the US. Black smoke was seen rising from the nursing Home in Bristol Township, outside Philadelphia, just after 2pm local time on Tuesday after a suspected gas leak. Pennsylvania Governor Josh Shapiro confirmed two people had died and \"some number of individuals\" remain missing. A rescue operation is under way to try to locate those trapped in the building. Images of the scene showed parts of the front of the building had completely collapsed and most of the windows were shattered. \"It is a sad and tragic evening here in Bucks County,\" Mr Shapiro said during a news conference. \"An explosion occurred just a few hours ago... we believe preliminarily that it was a gas leak, the explosion was really quite catastrophic.\" Bristol Township fire chief Kevin Dippolito said parts of the first floor of the building had collapsed into the basement of the building. He said many people were pulled out of the building by emergency services, but \"specialised equipment\" has been brought in to search the debris for missing people. \"We are still in rescue mode,\" he said, adding: \"We have not transitioned into recovery mode.\" A local disaster emergency was declared by Bristol Township manager, Randee J Mazur, who said the explosion had caused \"significant structural collapse\" and there was risk of further collapse. He said the declaration would remain in place for seven days. An investigation to confirm the cause of the explosion is ongoing, but it occurred at the same time crews from the local gas company, PECO, said it had responded to reports of a gas odour. 'Loud kaboom' Willie Tye, who lives close to the home, said he was watching TV when he heard a \"loud kaboom\". He said he went to look and saw \"fire everywhere\" and people escaping the building. Read more from Sky News:What we learned from latest Epstein files releaseDetails of King's Christmas message revealed The 174-bed nursing home, about 20 miles northeast of Philadelphia, is called Bristol Health & Rehab Centre but had been known until recently as Silver Lake Healthcare Centre. The home's owner, Saber Healthcare Group, said it was working with local emergency services."
    },
    {
        "title": "Starmer makes cost-of-living promise in Christmas message",
        "description": "The prime minister has acknowledged Britons' cost-of-living struggles in his Christmas message - and vowed that helping with the issue is his \"priority\".",
        "url": "https://news.sky.com/story/starmer-makes-cost-of-living-promise-in-christmas-message-13487047",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sir-keir-starmer-christmas-message_7118352.png?20251223144729",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-23 13:56:00",
        "Headline": "The prime minister's message comes at the end of a difficult year for his government, with economic growth stuttering and criticism over tax rises in the budget.",
        "Content": "The prime minister has acknowledged Britons' cost-of-living struggles in his Christmas message - and vowed that helping with the issue is his \"priority\". Sir Keir Starmer also urged members of the public to \"each do our bit\" and \"reach out\" to friends, relatives and neighbours during the festive period. His message comes at the end of a difficult year for his government, with economic growth stuttering and Chancellor Rachel Reeves facing criticism over tax rises in the budget. In a message recorded inside 10 Downing Street, Sir Keir said: \"I know many across Britain are still struggling with the cost of living. Helping with that is my priority. \"But at this time of the year, which celebrates love and abundance, loss or hardship can feel even more acute. \"So call around to a neighbour. Check in on a friend or a relative who you haven't heard from for a while. Reach out. It can make a huge difference. \"That is what Christmas is about.\" The prime minister thanked NHS workers along with members of the military and the emergency services who will be on duty on Christmas Day. \"Just as so many put their feet up, some truly special people will be pulling on their uniforms and heading out to work,\" he said. \"Our NHS staff emergency services and the brave men and women of our armed forces, all playing their part, doing their bit to care for the nation and to keep us safe. \"Many volunteers will be out there as well. Serving food. Reaching out to help those lonely or in need. \"So on behalf of the whole country, I want to say a big thank you. \"As a nation, we should raise a glass to you this Christmas. But more than that, we should each do our bit as well.\" Read more from Sky News:How does your Christmas compare to rest of UK? Take our quizThe famous faces we said goodbye to this year Conservative leader Kemi Badenoch used her Christmas message to talk about \"Christian values\" and thanked \"everyone who has supported me during my first year as leader of the opposition\". \"It's been the biggest challenge of my life,\" she said. \"But it's also been a wonderful year. I can't wait to get back to work next year to create a better United Kingdom.\" Liberal Democrat leader Sir Ed Davey spoke about the Christmas tree in London's Trafalgar Square - an annual gift from Norway to thank the UK for its support during the Second World War - in his message. While saying the tree may \"look a little underwhelming\" on first glance, the Liberal Democrat leader said it was a reminder of \"friendship and loyalty\". He added: \"It makes me think about people standing together in tough times - whether against the Nazis in the 1940s, or right now in Ukraine. \"And yeah, it might not be perfect, but this tree in Trafalgar Square makes me think about families and friends looking out for one another right here at home. \"I can't think of a better symbol of the Christmas spirit of generosity, love and hope. Of light in the darkness.\""
    },
    {
        "title": "Libya's military chief and four others killed in plane crash over Turkey",
        "description": "The military chief of Libya has been killed alongside four others in a plane crash in Turkey.",
        "url": "https://news.sky.com/story/libyas-military-chief-and-four-others-killed-in-plane-crash-over-turkey-13487149",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-muhammad-al-haddad_7118614.jpg?20251223222845",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-23 20:52:00",
        "Headline": "Muhammad al Haddad was among five Libyan officials killed in the plane crash, Libya's prime minister says.",
        "Content": "The military chief of Libya has been killed alongside four others in a plane crash in Turkey. Wreckage has been found after a small private jet carrying General Muhammad Ali Ahmad al Haddad crashed near Ankara, the Turkish government said. In a statement, Libyan Prime Minister Abdul-Hamid Dbeibeh said the loss of Haddad, chief of staff of the Libyan army, was a \"great loss to the homeland\".   He said General Haddad's adviser, Mohammed al Asawi Diab, was also killed, along with General Al-Fitouri Ghraibil - chief of staff of Libya's ground forces, General Mahmoud al Qatawi - director of the Military Industrialization Organisation, and military photographer Mohammed Omar Ahmed Mahjoub. Posting on X, Mr Dbeibeh wrote: \"This tragic and painful incident occurred during their return from an official trip from the Turkish city of Ankara. \"This grave affliction is a great loss to the homeland, to the military institution, and to all the sons of the people, as we have lost men who served their country with sincerity and dedication, and who were an example of discipline, responsibility, and national commitment. \"Our deepest condolences and sincere solace to the families of those we have lost, and to their comrades in the armed forces.\" General Haddad had ‌met with Turkish defence minister Yasar Guler and Turkish counterpart Selcuk Bayraktaroglu, ⁠along with other Turkish military commanders, Turkey's defence ministry said. His Falcon 50-type jet took off from Esenboga airport in the capital, Ankara, at 8.30pm, according to the Turkish interior minister Ali Yerlikaya. Shortly after, the plane issued an emergency landing signal near Haymana, south of the city, before communication was lost. Read more:East Libya: Europe's smuggling frontline'This is Europe's problem': The migrants stuck in Libyan detention General Haddad, the top military commander in western Libya, was crucial to ongoing UN-backed efforts to unify the country's military, which has split. Libya itself is split, with rival administrations in the east and west, after the nation descended into anarchy following the fall of Muammar Gaddafi's regime in 2011. Mr Dbeibeh runs the internationally-recognised Tripoli-based government in the west, while former Gaddafi commander Khalifa Haftar runs a military dictatorship in the east."
    },
    {
        "title": "Comedian Russell Brand charged with further counts of rape and sexual assault",
        "description": "Russell Brand has been charged with further counts of rape and sexual assault, police have said.",
        "url": "https://news.sky.com/story/comedian-russell-brand-charged-with-further-counts-of-rape-and-sexual-assault-13487096",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-russell-brand-police_7118452.jpg?20251223165856",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-23 16:37:00",
        "Headline": "The comedian and actor is due to appear at Westminster Magistrates' Court on 20 January 2026 in relation to the two additional charges.",
        "Content": "Russell Brand has been charged with further counts of rape and sexual assault, police have said. They relate to two further women and are in addition to the charges issued to the comedian and actor in April, which involved four women. He had been previously charged with two counts of rape, one count of indecent assault and two counts of sexual assault. Brand has pleaded not guilty to the earlier charges. He is due to appear at Westminster Magistrates' Court on 20 January 2026 in relation to the two additional charges. His trial is scheduled to begin at Southwark Crown Court on 16 June 2026 in relation to the five original charges. Detective Chief Inspector Tariq Farooqi from the Metropolitan Police, who is leading the investigation, issued an appeal for witnesses. \n                  Details of King Charles's Christmas message revealed - as he chooses to deliver it away from palace\n                 \n                  Starmer makes cost-of-living promise in Christmas message\n                 \n                  Wednesday's national newspaper front pages\n                 He said: \"The women who have made reports, including those connected to the two new charges, continue to receive support from specially trained officers. \"The Met's investigation remains ongoing, and detectives urge anyone affected by this case, or anyone with information, to come forward and speak with police. \"Support is also available through the independent charity Rape Crisis by contacting the 24/7 Rape and Sexual Abuse Support Line.\" Brand, 50, rose to prominence as a comedian in the mid-2000s, before finding success in Hollywood with the 2008 film Forgetting Sarah Marshall and its 2010 spin-off, Get Him To The Greek."
    },
    {
        "title": "Farmers celebrate Sir Keir Starmer's Christmas U-turn on inheritance tax",
        "description": "In a massive Christmas U-turn by Sir Keir Starmer, the government has announced a huge climbdown on inheritance tax on farmers.",
        "url": "https://news.sky.com/story/farmers-celebrate-sir-keir-starmers-christmas-u-turn-on-inheritance-tax-13487023",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-tractors-farmers-protest_7111890.jpg?20251218110406",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2025-12-23 12:50:00",
        "Headline": "The government has significantly increased the threshold at which farms will be subject to inheritance tax, which the Tories say is a \"huge U-turn\".",
        "Content": "\n          Chief political correspondent\n              @joncraig\n In a massive Christmas U-turn by Sir Keir Starmer, the government has announced a huge climbdown on inheritance tax on farmers. The tax relief on family farms handed down between families is to increase from £1m to £2.5m, meaning only farms worth more than £5m will pay. The climbdown, overturning bitterly unpopular proposals in Rachel Reeves's budget last year, follows a personal intervention by the prime minister. The National Farmers Union (NFU) president Tom Bradshaw revealed the government backed down after he had two \"very constructive meetings\" with the PM. Responding to the climbdown, Mr Bradshaw - who led a high-profile campaign which included tractors blocking Whitehall - said it would come as a huge relief. Tory leader Kemi Badenoch claimed it was a \"huge U-turn\" by the government and a big win for her party's campaign against Labour's \"family farms tax\". But the shadow environment secretary Victoria Atkins claimed it was only a partial U-turn on the \"vindictive family farm tax\" and was too late for some farmers. Businesses and lives had been lost, she said. Announcing the climbdown, Environment Secretary Emma Reynolds said: \"We have listened closely to farmers across the country, and we are making changes today to protect more ordinary family farms. \"We are increasing the individual threshold from £1m to £2.5m which means couples with estates of up to £5m will now pay no inheritance tax on their estates. \"It's only right that larger estates contribute more, while we back the farms and trading businesses that are the backbone of Britain's rural communities.\" The U-turn was given a warm welcome by the NFU, which has led the relentless protests in Westminster and around the UK. Mr Bradshaw said Tuesday's announcement would \"greatly\" reduce that tax burden for many family farms He said: \"Changes to Agricultural Property Relief (APR) and Business Property Relief (BPR) announced in last year's budget came as a huge shock to the farming community. \"Until that moment, the best tax planning advice was to hold on to your farm until death and pass it on to the next generation who could continue to run a viable farming, food-producing business. \"The original changes to APR and BPR, contained within the Finance Bill, resulted in a pernicious and cruel tax, trapping the most elderly and vulnerable people and their families in the eye of the storm. The NFU and its members have stood strong for what we believed in. \"I am thankful common sense has prevailed and government has listened.\" The climbdown also follows a mini-rebellion in the Commons in early December in a vote on the inheritance tax proposal, when around 30 Labour MPs representing rural areas abstained and one, Markus Campbell-Savours, voted against and had the Labour whip withdrawn. 'A big win for the Conservatives against a cruel and immoral tax' Ms Badenoch, who has campaigned against the tax during several farm visits, said: \"This is a huge U-turn by the government and a big win for the Conservative Party's campaign against Labour's family farm tax. \"The family farm tax is cruel, immoral and will not raise any money because farmers will stop farming. It would have pushed farms to the brink, damaged our food supply, and hurt the people who work long hours to feed the country. \"This fight isn't finished. Other family businesses are still affected by Labour's tax raid, and we will keep pushing until the tax is lifted from them too. But today is an important win, and proof that standing up for what's fair, even when the odds are against us can make a real difference.\" Tim Farron, the Liberal Democrats spokesperson, urged the government to scrap the \"unfair tax in full\" as \"many family farms will still find themselves financially crippled and barely making the minimum wage\". Reform UK deputy leader Richard Tice said: \"This cynical climbdown - whilst better than nothing - does little to address the year of anxiety that farmers have faced in planning to protect their livelihoods. \"With British agriculture hanging by a thread, the government must go further and abolish this callous farms tax.\""
    },
    {
        "title": "Philip Young appears in Swindon court charged with 56 sexual offences against ex-wife - as five others also charged",
        "description": "A man has appeared in court charged with drugging and raping his ex-wife over a 13-year period.",
        "url": "https://news.sky.com/story/man-appears-in-court-charged-with-56-sexual-offences-against-ex-wife-as-five-other-men-also-charged-13486926",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-swindon-sex-case-philip-young_7118194.jpg?20251223105327",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-23 10:12:00",
        "Headline": "The other accused men, aged between 31 and 61, appeared in the same court later and were released on bail.",
        "Content": "A man has appeared in court charged with drugging and raping his ex-wife over a 13-year period. Philip Young, 49, formerly of Swindon, has been charged with 56 offences, including multiple counts of rape, against Joanne Young. He is also charged with administering a substance to allow sexual activity, as well as voyeurism, possession of indecent images of children and possession of extreme images. Young appeared at Swindon Magistrates' Court this morning and spoke only to confirm his name and address. He declined to enter a plea and was remanded in custody until the next hearing at Swindon Crown Court on 23 January. The alleged offences took place between 2010 and 2023. Five other men have also been charged with sexual offences against Ms Young. The 48-year-old has waived her legal right to anonymity. The full list of charges against Philip Young are: The other men appeared at the same court later on and were released on conditional bail. They are: Norman Macksoni, 47, of Sharnbrook, Bedfordshire. He is a black British national and has been charged with one count of rape and possession of extreme images. Dean Hamilton, 47, of no fixed abode. He is a white British national and has been charged with one count of rape and sexual assault by penetration and two counts of sexual touching. Conner Sanderson Doyle, 31, of Swindon. He is a white British national and has been charged with sexual assault by penetration and sexual touching Richard Wilkins, 61, of Swindon. He is a white British national and has been charged with one count of rape and sexual touching Mohammed Hassan, 37, of Swindon. He is a British Asian and has been charged with sexual touching. "
    },
    {
        "title": "Details of King Charles's Christmas message revealed - as he chooses to deliver it away from palace",
        "description": "A photograph has been released by Buckingham Palace showing the King delivering his Christmas message again outside of traditional palace walls.",
        "url": "https://news.sky.com/story/king-charles-will-deliver-christmas-message-from-outside-palace-walls-once-again-13487122",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-king-charles-charles_7118488.jpg?20251223183226",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-12-23 22:00:00",
        "Headline": "The King has decided to record this year's broadcast from the Lady Chapel inside Westminster Abbey, Buckingham Palace reveals.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n A photograph has been released by Buckingham Palace showing the King delivering his Christmas message again outside of traditional palace walls. This year the annual address was filmed in the Lady Chapel inside Westminster Abbey, the second time the monarch has recorded it away from a royal residence. The palace has revealed the abbey was chosen for the setting this year to reflect a major theme of the message, pilgrimage.   The full details of what he says are always kept secret until it is broadcast at 3pm on Christmas Day. The message is always seen as a deeply personal one from the monarch, as a rare speech delivered by the King without advice from, or consultation with, the government. Westminster Abbey was seen as a perfect location to reflect the theme of pilgrimage with pilgrims visiting every year to remember the legacy of Edward the Confessor, whose shrine lies at the heart of the abbey. Around the walls of the Lady Chapel are 95 statues of saints dating from the building of the chapel in the 16th century. The abbey, as the site of the King's own coronation and that of every monarch since 1066, also has royal significance. The Henry VII Lady Chapel is the burial place of 15 Kings and Queens including Elizabeth I, Mary I and Mary Queen of Scots. Below the central aisle is the Hanoverian vault where George II and members of his family are buried. The Stuart vault is in the south aisle where Charles II, William III and Mary II, and Queen Anne lie buried. Read more:William and Kate reveal Christmas card featuring family photoKing reveals cancer treatment will be reduced in the new year It is understood the King takes a particular interest in where the message is filmed each year, favouring different locations outside of royal palaces over the past two years. In the photograph, taken during filming, you can also see brightly lit Christmas trees used for another royal event in December. They were still inside the abbey following the filming of the Princess of Wales's Together at Christmas carol service, which will be broadcast on Christmas Eve."
    },
    {
        "title": "Starmer makes cost-of-living promise in Christmas message",
        "description": "The prime minister has acknowledged Britons' cost-of-living struggles in his Christmas message - and vowed that helping with the issue is his \"priority\".",
        "url": "https://news.sky.com/story/starmer-makes-cost-of-living-promise-in-christmas-message-13487047",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sir-keir-starmer-christmas-message_7118352.png?20251223144729",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-23 13:56:00",
        "Headline": "The prime minister's message comes at the end of a difficult year for his government, with economic growth stuttering and criticism over tax rises in the budget.",
        "Content": "The prime minister has acknowledged Britons' cost-of-living struggles in his Christmas message - and vowed that helping with the issue is his \"priority\". Sir Keir Starmer also urged members of the public to \"each do our bit\" and \"reach out\" to friends, relatives and neighbours during the festive period. His message comes at the end of a difficult year for his government, with economic growth stuttering and Chancellor Rachel Reeves facing criticism over tax rises in the budget. In a message recorded inside 10 Downing Street, Sir Keir said: \"I know many across Britain are still struggling with the cost of living. Helping with that is my priority. \"But at this time of the year, which celebrates love and abundance, loss or hardship can feel even more acute. \"So call around to a neighbour. Check in on a friend or a relative who you haven't heard from for a while. Reach out. It can make a huge difference. \"That is what Christmas is about.\" The prime minister thanked NHS workers along with members of the military and the emergency services who will be on duty on Christmas Day. \"Just as so many put their feet up, some truly special people will be pulling on their uniforms and heading out to work,\" he said. \"Our NHS staff emergency services and the brave men and women of our armed forces, all playing their part, doing their bit to care for the nation and to keep us safe. \"Many volunteers will be out there as well. Serving food. Reaching out to help those lonely or in need. \"So on behalf of the whole country, I want to say a big thank you. \"As a nation, we should raise a glass to you this Christmas. But more than that, we should each do our bit as well.\" Read more from Sky News:How does your Christmas compare to rest of UK? Take our quizThe famous faces we said goodbye to this year Conservative leader Kemi Badenoch used her Christmas message to talk about \"Christian values\" and thanked \"everyone who has supported me during my first year as leader of the opposition\". \"It's been the biggest challenge of my life,\" she said. \"But it's also been a wonderful year. I can't wait to get back to work next year to create a better United Kingdom.\" Liberal Democrat leader Sir Ed Davey spoke about the Christmas tree in London's Trafalgar Square - an annual gift from Norway to thank the UK for its support during the Second World War - in his message. While saying the tree may \"look a little underwhelming\" on first glance, the Liberal Democrat leader said it was a reminder of \"friendship and loyalty\". He added: \"It makes me think about people standing together in tough times - whether against the Nazis in the 1940s, or right now in Ukraine. \"And yeah, it might not be perfect, but this tree in Trafalgar Square makes me think about families and friends looking out for one another right here at home. \"I can't think of a better symbol of the Christmas spirit of generosity, love and hope. Of light in the darkness.\""
    },
    {
        "title": "Comedian Russell Brand charged with further counts of rape and sexual assault",
        "description": "Russell Brand has been charged with further counts of rape and sexual assault, police have said.",
        "url": "https://news.sky.com/story/comedian-russell-brand-charged-with-further-counts-of-rape-and-sexual-assault-13487096",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-russell-brand-police_7118452.jpg?20251223165856",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-23 16:37:00",
        "Headline": "The comedian and actor is due to appear at Westminster Magistrates' Court on 20 January 2026 in relation to the two additional charges.",
        "Content": "Russell Brand has been charged with further counts of rape and sexual assault, police have said. They relate to two further women and are in addition to the charges issued to the comedian and actor in April, which involved four women. He had been previously charged with two counts of rape, one count of indecent assault and two counts of sexual assault. Brand has pleaded not guilty to the earlier charges. He is due to appear at Westminster Magistrates' Court on 20 January 2026 in relation to the two additional charges. His trial is scheduled to begin at Southwark Crown Court on 16 June 2026 in relation to the five original charges. Detective Chief Inspector Tariq Farooqi from the Metropolitan Police, who is leading the investigation, issued an appeal for witnesses. \n                  Details of King Charles's Christmas message revealed - as he chooses to deliver it away from palace\n                 \n                  Starmer makes cost-of-living promise in Christmas message\n                 \n                  Wednesday's national newspaper front pages\n                 He said: \"The women who have made reports, including those connected to the two new charges, continue to receive support from specially trained officers. \"The Met's investigation remains ongoing, and detectives urge anyone affected by this case, or anyone with information, to come forward and speak with police. \"Support is also available through the independent charity Rape Crisis by contacting the 24/7 Rape and Sexual Abuse Support Line.\" Brand, 50, rose to prominence as a comedian in the mid-2000s, before finding success in Hollywood with the 2008 film Forgetting Sarah Marshall and its 2010 spin-off, Get Him To The Greek."
    },
    {
        "title": "Farmers celebrate Sir Keir Starmer's Christmas U-turn on inheritance tax",
        "description": "In a massive Christmas U-turn by Sir Keir Starmer, the government has announced a huge climbdown on inheritance tax on farmers.",
        "url": "https://news.sky.com/story/farmers-celebrate-sir-keir-starmers-christmas-u-turn-on-inheritance-tax-13487023",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-tractors-farmers-protest_7111890.jpg?20251218110406",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-12-23 12:50:00",
        "Headline": "The government has significantly increased the threshold at which farms will be subject to inheritance tax, which the Tories say is a \"huge U-turn\".",
        "Content": "\n          Chief political correspondent\n              @joncraig\n In a massive Christmas U-turn by Sir Keir Starmer, the government has announced a huge climbdown on inheritance tax on farmers. The tax relief on family farms handed down between families is to increase from £1m to £2.5m, meaning only farms worth more than £5m will pay. The climbdown, overturning bitterly unpopular proposals in Rachel Reeves's budget last year, follows a personal intervention by the prime minister. The National Farmers Union (NFU) president Tom Bradshaw revealed the government backed down after he had two \"very constructive meetings\" with the PM. Responding to the climbdown, Mr Bradshaw - who led a high-profile campaign which included tractors blocking Whitehall - said it would come as a huge relief. Tory leader Kemi Badenoch claimed it was a \"huge U-turn\" by the government and a big win for her party's campaign against Labour's \"family farms tax\". But the shadow environment secretary Victoria Atkins claimed it was only a partial U-turn on the \"vindictive family farm tax\" and was too late for some farmers. Businesses and lives had been lost, she said. Announcing the climbdown, Environment Secretary Emma Reynolds said: \"We have listened closely to farmers across the country, and we are making changes today to protect more ordinary family farms. \"We are increasing the individual threshold from £1m to £2.5m which means couples with estates of up to £5m will now pay no inheritance tax on their estates. \"It's only right that larger estates contribute more, while we back the farms and trading businesses that are the backbone of Britain's rural communities.\" The U-turn was given a warm welcome by the NFU, which has led the relentless protests in Westminster and around the UK. Mr Bradshaw said Tuesday's announcement would \"greatly\" reduce that tax burden for many family farms He said: \"Changes to Agricultural Property Relief (APR) and Business Property Relief (BPR) announced in last year's budget came as a huge shock to the farming community. \"Until that moment, the best tax planning advice was to hold on to your farm until death and pass it on to the next generation who could continue to run a viable farming, food-producing business. \"The original changes to APR and BPR, contained within the Finance Bill, resulted in a pernicious and cruel tax, trapping the most elderly and vulnerable people and their families in the eye of the storm. The NFU and its members have stood strong for what we believed in. \"I am thankful common sense has prevailed and government has listened.\" The climbdown also follows a mini-rebellion in the Commons in early December in a vote on the inheritance tax proposal, when around 30 Labour MPs representing rural areas abstained and one, Markus Campbell-Savours, voted against and had the Labour whip withdrawn. 'A big win for the Conservatives against a cruel and immoral tax' Ms Badenoch, who has campaigned against the tax during several farm visits, said: \"This is a huge U-turn by the government and a big win for the Conservative Party's campaign against Labour's family farm tax. \"The family farm tax is cruel, immoral and will not raise any money because farmers will stop farming. It would have pushed farms to the brink, damaged our food supply, and hurt the people who work long hours to feed the country. \"This fight isn't finished. Other family businesses are still affected by Labour's tax raid, and we will keep pushing until the tax is lifted from them too. But today is an important win, and proof that standing up for what's fair, even when the odds are against us can make a real difference.\" Tim Farron, the Liberal Democrats spokesperson, urged the government to scrap the \"unfair tax in full\" as \"many family farms will still find themselves financially crippled and barely making the minimum wage\". Reform UK deputy leader Richard Tice said: \"This cynical climbdown - whilst better than nothing - does little to address the year of anxiety that farmers have faced in planning to protect their livelihoods. \"With British agriculture hanging by a thread, the government must go further and abolish this callous farms tax.\""
    },
    {
        "title": "Philip Young appears in Swindon court charged with 56 sexual offences against ex-wife - as five others also charged",
        "description": "A man has appeared in court charged with drugging and raping his ex-wife over a 13-year period.",
        "url": "https://news.sky.com/story/man-appears-in-court-charged-with-56-sexual-offences-against-ex-wife-as-five-other-men-also-charged-13486926",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-swindon-sex-case-philip-young_7118194.jpg?20251223105327",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-23 10:12:00",
        "Headline": "The other accused men, aged between 31 and 61, appeared in the same court later and were released on bail.",
        "Content": "A man has appeared in court charged with drugging and raping his ex-wife over a 13-year period. Philip Young, 49, formerly of Swindon, has been charged with 56 offences, including multiple counts of rape, against Joanne Young. He is also charged with administering a substance to allow sexual activity, as well as voyeurism, possession of indecent images of children and possession of extreme images. Young appeared at Swindon Magistrates' Court this morning and spoke only to confirm his name and address. He declined to enter a plea and was remanded in custody until the next hearing at Swindon Crown Court on 23 January. The alleged offences took place between 2010 and 2023. Five other men have also been charged with sexual offences against Ms Young. The 48-year-old has waived her legal right to anonymity. The full list of charges against Philip Young are: The other men appeared at the same court later on and were released on conditional bail. They are: Norman Macksoni, 47, of Sharnbrook, Bedfordshire. He is a black British national and has been charged with one count of rape and possession of extreme images. Dean Hamilton, 47, of no fixed abode. He is a white British national and has been charged with one count of rape and sexual assault by penetration and two counts of sexual touching. Conner Sanderson Doyle, 31, of Swindon. He is a white British national and has been charged with sexual assault by penetration and sexual touching Richard Wilkins, 61, of Swindon. He is a white British national and has been charged with one count of rape and sexual touching Mohammed Hassan, 37, of Swindon. He is a British Asian and has been charged with sexual touching. "
    },
    {
        "title": "Cricket bosses investigate video appearing to show England player Ben Duckett drunk during Ashes tour",
        "description": "Cricket bosses are investigating a video appearing to show Ben Duckett drunk and slurring his words during the Ashes tour.",
        "url": "https://news.sky.com/story/cricket-bosses-investigate-video-appearing-to-show-england-player-ben-duckett-drunk-during-ashes-tour-13487056",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-duckett-ashes_7118350.jpg?20251223144430",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-23 14:36:00",
        "Headline": "The ECB says players are \"often under intense levels of scrutiny\" and it has \"established processes\" to deal with allegations of poor behaviour.",
        "Content": "Cricket bosses are investigating a video appearing to show Ben Duckett drunk and slurring his words during the Ashes tour. The England player is seen speaking to a group who ask him if he knows how to get home, to which he replies: \"No.\" It has not been established exactly when and where it was filmed, but one of the people in the video says \"we're losing two-nil\" - suggesting it was in between the second and third Tests. England have been widely criticised for their preparation and performances in Australia after losing the series in just 11 days after three straight defeats.  The team were allowed to go on a pre-planned break in the town of Noosa before the third Test. However, members of the squad were reported to be taking part in regular prolonged drinking sessions in the town during their time off. \n                  The Ashes: England coach Brendon McCullum admits to error on tourists' preparation after Australia seal victory\n                 \n                  The Ashes: Zak Crawley says Harry Brook's third Test dismissal would not be criticised by anyone in England camp\n                 \n                  The Ashes: England suffer late collapse at hands of Nathan Lyon as Australia set tourists Test-record target  in Adelaide\n                 The video of Duckett, 31, has been widely shared on X and the England and Wales Cricket Board said it was \"establishing the facts\". In response, an ECB spokesperson told Sky Sports News: \"We are aware of content circulating on social media. \"We have high expectations for behaviour, accepting that players are often under intense levels of scrutiny, with established processes that we follow when conduct falls below expectations. We also support players that need assistance. \"We will not comment further at this stage while we establish the facts.\" England managing director Rob Key had earlier said excessive alcohol consumption was not \"something that I'd expect to see at any stage\" and promised to look into the claims. \"I have no issue with the Noosa trip if it was to get away and just throw your phone away, down tools, go on the beach, all of that stuff,\" said Key. \"If it goes into where they're drinking lots and it's a stag do, all of that type of stuff, that's completely unacceptable. I'm not a drinker, I think a drinking culture doesn't help anyone in any stretch whatsoever.\" The fourth of the five Ashes Tests starts on Christmas Day in Melbourne, where England fans will be hoping the team can put in a much improved showing and avoid the prospect of a series whitewash."
    },
    {
        "title": "High street banking giants vie for £2.5bn wealth manager Evelyn ",
        "description": "Two of Britain&#8217;s biggest high street banks are embroiled in a &#163;2.5bn takeover battle for Evelyn Partners, the wealth management group.",
        "url": "https://news.sky.com/story/high-street-banking-giants-vie-for-16325bn-wealth-manager-evelyn160-13487136",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-evelyn-finance_7118534.jpg?20251223203949",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-23 20:03:00",
        "Headline": "Barclays and NatWest are both through to the second round of an auction of Evelyn Partners, which manages nearly £64bn in assets, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Two of Britain’s biggest high street banks are embroiled in a £2.5bn takeover battle for Evelyn Partners, the wealth management group. Sky News has learnt that Barclays and NatWest Group were among the bidders notified last week that they were through to the second round of the Evelyn auction. Royal Bank of Canada is also said to be in the frame to buy Evelyn, while a number of private equity firms have also tabled offers for the business. Lloyds Banking Group is understood to have explored an offer for Evelyn, although it was unclear on Tuesday whether it remained interested. For Barclays and NatWest, an acquisition of Evelyn would bolster an area of their businesses where both already have a strong presence - the latter through its Coutts division. Paul Thwaite, NatWest's chief executive, has been clear that the bank will consider acquisitions where they are sensibly priced and strategically attractive following its return this year to full private sector ownership. According to results published in August, Evelyn had assets under management of £64.6bn at the end of June, reflecting growing demand across the wealth management sector. \n                  Reeves's budget tax rises 'a pub destroyer', say landlords\n                 \n                  FTSE-100 events group Informa kicks off hunt for new chairman\n                 \n                  Britons are less well off than they were in 2019 - and these figures show it\n                 Canaccord Genuity's wealth arm is also on the block and could fetch a price of over £1bn. Evelyn is owned by the private equity firms Permira and Warburg Pincus, having merged their respective firms Tilney and Smith & Williamson in 2020. Last year, Evelyn's professional services arm was sold to the buyout firm Apax Partners. The current auction is being handled by bankers at Evercore. Barclays and NatWest declined to comment."
    },
    {
        "title": "Two-year-old killed in motorway collision - as five others in hospital with serious injuries",
        "description": "A two-year-old boy has died, and five others have been seriously injured after their broken-down car was hit by another vehicle on the A1 motorway. ",
        "url": "https://news.sky.com/story/two-year-old-killed-in-motorway-collision-as-five-others-in-hospital-with-serious-injuries-13486927",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-a1-northbound-stibbington-junction_7118192.jpg?20251223105110",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-23 06:14:00",
        "Headline": "A 64-year-old man, the driver of the Volkswagen, has been arrested on suspicion of causing death by dangerous driving and been released on bail until 20 March.",
        "Content": "A two-year-old boy has died, and five others have been seriously injured after their broken-down car was hit by another vehicle on the A1 motorway.  The collision occurred on Saturday at about 6.20pm when a Toyota Auris was struck by a Volkswagen Touran in a live lane of the A1 northbound, just past the Stibbington junction. The boy from London was one of six passengers who were in the Toyota. The five other passengers from London were taken to Peterborough City Hospital with serious injuries. A 64-year-old man, the driver of the Volkswagen, has been arrested on suspicion of causing death by dangerous driving and has been released on bail until 20 March. He suffered minor injuries. Cambridgeshire Police are investigating the incident and appealing for witnesses and dashcam footage. \n                  Details of King Charles's Christmas message revealed - as he chooses to deliver it away from palace\n                 \n                  Starmer makes cost-of-living promise in Christmas message\n                 \n                  Comedian Russell Brand charged with further counts of rape and sexual assault\n                 Sgt David McIlwhan said: \"Our thoughts are with the parents and family of this young child who has tragically lost his life in this collision. The family is being supported by specialist family liaison officers. \"I would appeal for anyone who witnessed the collision or has dashcam footage but was unable to stop at the scene, to get in touch.\" This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "What we learned from the latest release of Epstein files",
        "description": "A trove of newly released Epstein files include emails that appear to involve Andrew Mountbatten-Windsor, while another suggests Donald Trump travelled on the billionaire's private jet \"many more times than previously has been reported\".",
        "url": "https://news.sky.com/story/what-we-learned-from-the-latest-release-of-epstein-files-13487073",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jeffrey-epstein-oversightdems_7114380.jpg?20251223152143",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-23 15:19:00",
        "Headline": "The US Department of Justice released at least 11,000 more files on Tuesday that appear to include messages involving Andrew Mountbatten-Windsor.",
        "Content": "A trove of newly released Epstein files include emails that appear to involve Andrew Mountbatten-Windsor, while another suggests Donald Trump travelled on the billionaire's private jet \"many more times than previously has been reported\". The US Department of Justice released at least 11,000 more files on Tuesday. It went on to claim that some of them \"contain untrue and sensationalist claims\" about President Trump. Here are some of the latest news lines from this release of Epstein files. Being named in these papers does not suggest wrongdoing.  Who is 'The Invisible Man'? Among the documents released is an email sent to Ghislaine Maxwell that speaks about \"the girls\" being \"completely shattered\" at a Royal Family summer camp at Balmoral. It is dated 16 August 2001 and sent by a person referred to only as \"The Invisible Man\", but whom Sky News is reporting appears to be the former prince, Andrew. We have come to that conclusion from reviewing the email address used, which is assigned to the Duke of York in Epstein's contacts book and the chain of correspondence. In the correspondence, \"The Invisible Man\" asks Maxwell: \"How's LA? Have you found me some new inappropriate friends?\" Andrew Mountbatten-Windsor has previously denied any allegations against him. The Peru trip Another email appears to show Maxwell arranging \"two-legged sight seeing\" for \"The Invisible Man\" during a trip to Peru. She appears to forward to \"The Invisible Man\" part of a conversation between herself and another person. The email says: \"I just gave Andrew your telephone no. He is interested in seeing the Nazca lines. He can ride but it is not his favorite sport ie pass on the horses.\" \"Some sight seeing some 2 legged sight seeing (read intelligent pretty fun and from good families) and he will be very happy. I know I can rely on you to show him a wonderful time and will only introduce him to friends that you can trust,\" Maxwell said. The context of the email is unclear and there is no suggestion of any wrongdoing. Trump on Epstein's jet? The latest bunch of files also includes an email from an unidentified prosecutor dated 7 January, 2020, in which President Trump is mentioned. The email accuses him of travelling on Epstein's private jet \"many more times than previously has been reported\". It adds that President Trump \"is listed as a passenger on at least eight flights between 1993 and 1996, including at least four flights on which Maxwell was also present\". The email's sender and receiver have been redacted. However, at the bottom of the email it says assistant US attorney, Southern District of New York. The name has also been redacted. President Trump has denied any wrongdoing in relation to his relationship with Epstein, and being on any of Epstein's flights does not indicate any wrongdoing. Read more:Trump defends 'big boy' Clinton after Epstein files releaseWhy Andrew photo in Epstein files is awkward for Royal Family Limousine driver report about Trump One of the documents in the release shows a report made to the FBI that was recorded on 27 October 2020. It includes an unverified claim by a limousine driver that he overheard the US president discussing \"abusing some girl\" in 1995. The driver also mentions Trump said \"Jeffrey\" while on the phone during a journey to Dallas Fort Worth Airport in Texas. A significant part of the statement, along with the driver's identity, has been redacted. The US justice department has said that some of the documents in the latest Epstein files release \"contain untrue and sensationalist claims made against President Trump that were submitted to the FBI right before the 2020 election\". \"To be clear: the claims are unfounded and false, and if they had a shred of credibility, they certainly would have been weaponized against President Trump already,\" it said. Postcard mentions 'our president' Also among the documents is a postcard that claims to have been sent by Jeffrey Epstein, but has been refuted by the justice department. In it, the sender tells the recipient: \"Our president also shares our love of young, nubile girls.\" It's not clear who \"our president\" refers to and the context of the postcard is also unclear. The US justice department initially said it was \"looking into the validity\" of the postcard but later said on X that the \"FBI has confirmed\" the postcard is \"FAKE\". It cited reasons including a claim that the writing does not appear to match Epstein's and another that the letter was postmarked three days after his death. Row over unreleased documents It is believed that many files relating to Epstein are yet to be made public. There has been anger at the justice department's slow release of the files, with politicians threatening to launch legal action against Attorney General Pam Bondi. The deadline for the release of all the documents has passed. \"The DOJ needs to quit ⁠protecting the rich, powerful, and politically connected,\" Republican congressman Thomas Massie said."
    },
    {
        "title": "Libya's military chief and four others killed in plane crash over Turkey",
        "description": "The military chief of Libya has been killed alongside four others in a plane crash in Turkey.",
        "url": "https://news.sky.com/story/libyas-military-chief-and-four-others-killed-in-plane-crash-over-turkey-13487149",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-muhammad-al-haddad_7118614.jpg?20251223222845",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-23 20:52:00",
        "Headline": "Muhammad al Haddad was among five Libyan officials killed in the plane crash, Libya's prime minister says.",
        "Content": "The military chief of Libya has been killed alongside four others in a plane crash in Turkey. Wreckage has been found after a small private jet carrying General Muhammad Ali Ahmad al Haddad crashed near Ankara, the Turkish government said. In a statement, Libyan Prime Minister Abdul-Hamid Dbeibeh said the loss of Haddad, chief of staff of the Libyan army, was a \"great loss to the homeland\".   He said General Haddad's adviser, Mohammed al Asawi Diab, was also killed, along with General Al-Fitouri Ghraibil - chief of staff of Libya's ground forces, General Mahmoud al Qatawi - director of the Military Industrialization Organisation, and military photographer Mohammed Omar Ahmed Mahjoub. Posting on X, Mr Dbeibeh wrote: \"This tragic and painful incident occurred during their return from an official trip from the Turkish city of Ankara. \"This grave affliction is a great loss to the homeland, to the military institution, and to all the sons of the people, as we have lost men who served their country with sincerity and dedication, and who were an example of discipline, responsibility, and national commitment. \"Our deepest condolences and sincere solace to the families of those we have lost, and to their comrades in the armed forces.\" General Haddad had ‌met with Turkish defence minister Yasar Guler and Turkish counterpart Selcuk Bayraktaroglu, ⁠along with other Turkish military commanders, Turkey's defence ministry said. His Falcon 50-type jet took off from Esenboga airport in the capital, Ankara, at 8.30pm, according to the Turkish interior minister Ali Yerlikaya. Shortly after, the plane issued an emergency landing signal near Haymana, south of the city, before communication was lost. Read more:East Libya: Europe's smuggling frontline'This is Europe's problem': The migrants stuck in Libyan detention General Haddad, the top military commander in western Libya, was crucial to ongoing UN-backed efforts to unify the country's military, which has split. Libya itself is split, with rival administrations in the east and west, after the nation descended into anarchy following the fall of Muammar Gaddafi's regime in 2011. Mr Dbeibeh runs the internationally-recognised Tripoli-based government in the west, while former Gaddafi commander Khalifa Haftar runs a military dictatorship in the east."
    },
    {
        "title": "Russia launches major deadly missile and drone attack on Ukraine",
        "description": "Russia launched a major overnight missile and drone attack on Ukraine that killed at least three people - including a four-year-old child.",
        "url": "https://news.sky.com/story/russia-launches-major-deadly-missile-and-drone-attack-on-ukraine-13486997",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-kyiv-ukraine-russia-war-invasion_7118105.jpg?20251223075558",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-23 11:12:00",
        "Headline": "NATO fighter jets are scrambled after Russian airstrikes near Ukraine's western border with Poland.",
        "Content": "Russia launched a major overnight missile and drone attack on Ukraine that killed at least three people - including a four-year-old child. Officials say Russia fired more than 650 drones and three dozen missiles in an assault that began during the night and stretched into daylight hours Tuesday. Ukrainian President Volodymyr Zelenskyy said the barrage struck homes and the power grid in 13 regions across Ukraine, causing widespread outages in bitter temperatures. It comes a day after he described recent progress towards a peace deal as \"quite solid\". The bombardment demonstrated Russian President Vladimir Putin's intention of pursuing the invasion of Ukraine, Mr Zelenskyy said in an online post. Ukrainian and European officials have said Putin is not sincerely engaging with US-led peace efforts. The attack \"is an extremely clear signal of Russian priorities,\" Mr Zelenskyy said. \n                  What we learned from the latest release of Epstein files\n                 \n                  Trump 'hated' to see Bill Clinton photos in Epstein files\n                 \n                  Donald Trump unveils plan for 'Trump Class' battleships\n                 \"A strike before Christmas, when people want to be with their families, at home, in safety. A strike, in fact, in the midst of negotiations that are being conducted to end this war. Putin cannot accept the fact that we must stop killing.\" US President Donald Trump has for months been pressing for a peace agreement, but the negotiations have become entangled in the very different demands from Moscow and Kyiv. US envoy Steve Witkoff described talks in Florida with Ukrainian and European representatives as \"productive and constructive\". Trump was less effusive on Monday, saying, \"The talks are going along.\" Initial reports from Ukrainian emergency services said the child died in Ukraine's northwestern Zhytomyr region, while a drone killed a woman in the Kyiv region, and another civilian death was recorded in the western Khmelnytskyi region, according to Mr Zelenskyy. Russia launched 635 drones of various types and 38 missiles, Ukraine's air force said. Air defences stopped 587 drones and 34 missiles, it said. Read moreRussian general killed by car bomb and Moscow blames UkrainePutin didn't sound like he will alter his course anytime soon Polish and allied fighter jets were deployed after the Russian airstrikes towards western Ukraine, near Poland's border. \"Fighter jets were scrambled, and ground-based air-defence and radar reconnaissance systems were put on heightened readiness,\" the operational command of Poland's armed forces said. It was the ninth large-scale Russian attack on Ukraine's energy system this year and left multiple regions in the west without power, while emergency power outages were in place across the country, acting Energy Minister Artem Nekraso said. Work to restore power would begin as soon as the security situation permitted, he said. Ukraine's largest private energy supplier, DTEK, said the attack targeted thermal power stations in what it said was the seventh major strike on the company's facilities since October. DTEK's thermal power plants have been hit more than 220 times since Russia's full-scale invasion began in February 2022. Those attacks have killed four workers and wounded 59. Authorities in the western regions of Rivne, Ternopil and Lviv, as well as the northern Sumy region, reported damage to energy infrastructure or power outages after the attack. In the southern Odesa region, Russia struck energy, port, transport, industrial and residential infrastructure, according to regional head Oleh Kiper. A merchant ship and over 120 homes were damaged, he said."
    },
    {
        "title": "Bondi policeman injured in mass shooting wakes from coma",
        "description": "A police officer injured in the Bondi terror attack has woken from a coma.",
        "url": "https://news.sky.com/story/bondi-policeman-injured-in-mass-shooting-wakes-from-coma-13487062",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-scott-dyson-bondi-police_7118373.jpg?20251223151042",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-23 14:58:00",
        "Headline": "PC Scott Dyson had been in a medically-induced coma and undergoing surgery \"almost daily\" but is now awake, his family said.",
        "Content": "A police officer injured in the Bondi terror attack has woken from a coma. Scott Dyson was one of two officers wounded when gunmen opened fire on a crowd at Sydney's Archer Park on 14 December. The alleged perpetrators of the attack, which killed 15 people and injured dozens more, were Sajid Akram, 50 - killed by police at the scene - and his 24 year-old son Naveed who was charged with 59 offences. In a statement, the family of PC Dyson said he had been in a medically-induced coma and undergone surgery \"almost daily\". \"Our family would like to share that Scott has been getting stronger each day, and today, he was woken up for the first time,\" they said. \"There is still a long way to go in his recovery, but this is a positive sign. \"We would like to thank the public for the support, messages and well wishes shown to Scott and our family during this difficult time.\" \n                  Bondi Beach shooting suspect trained with father before attack, police say\n                 \n                  Australian PM booed at Bondi Beach vigil a week after deadly terror attack\n                 \n                  'What they've seen, few people have ever seen': Lifeguards honour Bondi Beach victims\n                 Also injured was probationary constable Jack Hibbert, who was just four months into the job when he was shot in the head and shoulder. He has now been discharged from hospital, his family said. Read more:'Utter panic and chaos': Site of celebration now a memorialTimeline of Bondi Beach shooting: How the attack unfolded \"While he is home, he is still recovering and will need space, support, and continued positive thoughts during this time,\" they said in a statement. \"As a family, we couldn't ask for anything more - having our Jack home, especially for Christmas, truly feels like a miracle.\" Health bosses said on Tuesday that 12 patients remained in hospital receiving care in the aftermath of the attack. Four are in a critical but stable condition. Naveed Akram was transferred from hospital to prison on Monday. His charges include 40 counts of attempted murder, discharging a firearm intending to cause grievous bodily harm, a public display of a prohibited terrorist organisation symbol, and placing an explosive in or near a building with intent to cause harm."
    },
    {
        "title": "'Catastrophic' explosion at US nursing home",
        "description": "Two people have died and others are missing after an explosion at a nursing home in the US.",
        "url": "https://news.sky.com/story/explosion-at-us-nursing-home-with-deaths-reported-and-people-missing-13487179",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nursing-home-explosion_7118661.jpg?20251224003559",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-23 23:18:00",
        "Headline": "The blast at the nursing home in Bristol Township outside Philadelphia was caused by a suspected gas leak. ",
        "Content": "Two people have died and others are missing after an explosion at a nursing home in the US. Black smoke was seen rising from the nursing Home in Bristol Township, outside Philadelphia, just after 2pm local time on Tuesday after a suspected gas leak. Pennsylvania Governor Josh Shapiro confirmed two people had died and \"some number of individuals\" remain missing. A rescue operation is under way to try to locate those trapped in the building. Images of the scene showed parts of the front of the building had completely collapsed and most of the windows were shattered. \"It is a sad and tragic evening here in Bucks County,\" Mr Shapiro said during a news conference. \"An explosion occurred just a few hours ago... we believe preliminarily that it was a gas leak, the explosion was really quite catastrophic.\" Bristol Township fire chief Kevin Dippolito said parts of the first floor of the building had collapsed into the basement of the building. He said many people were pulled out of the building by emergency services, but \"specialised equipment\" has been brought in to search the debris for missing people. \"We are still in rescue mode,\" he said, adding: \"We have not transitioned into recovery mode.\" A local disaster emergency was declared by Bristol Township manager, Randee J Mazur, who said the explosion had caused \"significant structural collapse\" and there was risk of further collapse. He said the declaration would remain in place for seven days. An investigation to confirm the cause of the explosion is ongoing, but it occurred at the same time crews from the local gas company, PECO, said it had responded to reports of a gas odour. 'Loud kaboom' Willie Tye, who lives close to the home, said he was watching TV when he heard a \"loud kaboom\". He said he went to look and saw \"fire everywhere\" and people escaping the building. Read more from Sky News:What we learned from latest Epstein files releaseDetails of King's Christmas message revealed The 174-bed nursing home, about 20 miles northeast of Philadelphia, is called Bristol Health & Rehab Centre but had been known until recently as Silver Lake Healthcare Centre. The home's owner, Saber Healthcare Group, said it was working with local emergency services."
    },
    {
        "title": "What we learned from the latest release of Epstein files",
        "description": "A trove of newly released Epstein files include emails that appear to involve Andrew Mountbatten-Windsor, while another suggests Donald Trump travelled on the billionaire's private jet \"many more times than previously has been reported\".",
        "url": "https://news.sky.com/story/what-we-learned-from-the-latest-release-of-epstein-files-13487073",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jeffrey-epstein-oversightdems_7114380.jpg?20251223152143",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-23 15:19:00",
        "Headline": "The US Department of Justice released at least 11,000 more files on Tuesday that appear to include messages involving Andrew Mountbatten-Windsor.",
        "Content": "A trove of newly released Epstein files include emails that appear to involve Andrew Mountbatten-Windsor, while another suggests Donald Trump travelled on the billionaire's private jet \"many more times than previously has been reported\". The US Department of Justice released at least 11,000 more files on Tuesday. It went on to claim that some of them \"contain untrue and sensationalist claims\" about President Trump. Here are some of the latest news lines from this release of Epstein files. Being named in these papers does not suggest wrongdoing.  Who is 'The Invisible Man'? Among the documents released is an email sent to Ghislaine Maxwell that speaks about \"the girls\" being \"completely shattered\" at a Royal Family summer camp at Balmoral. It is dated 16 August 2001 and sent by a person referred to only as \"The Invisible Man\", but whom Sky News is reporting appears to be the former prince, Andrew. We have come to that conclusion from reviewing the email address used, which is assigned to the Duke of York in Epstein's contacts book and the chain of correspondence. In the correspondence, \"The Invisible Man\" asks Maxwell: \"How's LA? Have you found me some new inappropriate friends?\" Andrew Mountbatten-Windsor has previously denied any allegations against him. The Peru trip Another email appears to show Maxwell arranging \"two-legged sight seeing\" for \"The Invisible Man\" during a trip to Peru. She appears to forward to \"The Invisible Man\" part of a conversation between herself and another person. The email says: \"I just gave Andrew your telephone no. He is interested in seeing the Nazca lines. He can ride but it is not his favorite sport ie pass on the horses.\" \"Some sight seeing some 2 legged sight seeing (read intelligent pretty fun and from good families) and he will be very happy. I know I can rely on you to show him a wonderful time and will only introduce him to friends that you can trust,\" Maxwell said. The context of the email is unclear and there is no suggestion of any wrongdoing. Trump on Epstein's jet? The latest bunch of files also includes an email from an unidentified prosecutor dated 7 January, 2020, in which President Trump is mentioned. The email accuses him of travelling on Epstein's private jet \"many more times than previously has been reported\". It adds that President Trump \"is listed as a passenger on at least eight flights between 1993 and 1996, including at least four flights on which Maxwell was also present\". The email's sender and receiver have been redacted. However, at the bottom of the email it says assistant US attorney, Southern District of New York. The name has also been redacted. President Trump has denied any wrongdoing in relation to his relationship with Epstein, and being on any of Epstein's flights does not indicate any wrongdoing. Read more:Trump defends 'big boy' Clinton after Epstein files releaseWhy Andrew photo in Epstein files is awkward for Royal Family Limousine driver report about Trump One of the documents in the release shows a report made to the FBI that was recorded on 27 October 2020. It includes an unverified claim by a limousine driver that he overheard the US president discussing \"abusing some girl\" in 1995. The driver also mentions Trump said \"Jeffrey\" while on the phone during a journey to Dallas Fort Worth Airport in Texas. A significant part of the statement, along with the driver's identity, has been redacted. The US justice department has said that some of the documents in the latest Epstein files release \"contain untrue and sensationalist claims made against President Trump that were submitted to the FBI right before the 2020 election\". \"To be clear: the claims are unfounded and false, and if they had a shred of credibility, they certainly would have been weaponized against President Trump already,\" it said. Postcard mentions 'our president' Also among the documents is a postcard that claims to have been sent by Jeffrey Epstein, but has been refuted by the justice department. In it, the sender tells the recipient: \"Our president also shares our love of young, nubile girls.\" It's not clear who \"our president\" refers to and the context of the postcard is also unclear. The US justice department initially said it was \"looking into the validity\" of the postcard but later said on X that the \"FBI has confirmed\" the postcard is \"FAKE\". It cited reasons including a claim that the writing does not appear to match Epstein's and another that the letter was postmarked three days after his death. Row over unreleased documents It is believed that many files relating to Epstein are yet to be made public. There has been anger at the justice department's slow release of the files, with politicians threatening to launch legal action against Attorney General Pam Bondi. The deadline for the release of all the documents has passed. \"The DOJ needs to quit ⁠protecting the rich, powerful, and politically connected,\" Republican congressman Thomas Massie said."
    },
    {
        "title": "Trump 'hated' to see Bill Clinton photos in Epstein files",
        "description": "Donald Trump has said he \"hated\" to see photos of Bill Clinton in the newly released Epstein files.",
        "url": "https://news.sky.com/story/trump-hated-to-see-bill-clinton-photos-in-epstein-files-13486923",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-bill-clinton-ghislaine_7115396.jpg?20251219215420",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-23 03:24:00",
        "Headline": "In his first engagement in front of the media since the release of the latest Epstein files, Donald Trump was asked about Bill Clinton's appearance in several photos.",
        "Content": "Donald Trump has said he \"hated\" to see photos of Bill Clinton in the newly released Epstein files. The former US president was in numerous images that were released by the US Department of Justice among thousands of documents related to the late paedophile financier Jeffrey Epstein. In his first engagement in front of the media since the release of the latest files, Mr Trump was asked about the images of Mr Clinton. \"I think it's terrible,\" Mr Trump said, adding: \"I like Bill Clinton... and I hate to see photos come out of him. \"I've always gotten along with Bill Clinton. I've been nice to him, he's been nice to me. I hate to see photos come out of him, but this is what the Democrats, mostly Democrats and a couple of bad Republicans, are asking for. \"So they are giving photos of me to. Everybody was friendly with this guy [Epstein], either friendly or not friendly. \"He was all over Palm Beach and other places... and Bill Clinton was a friend of his, but everybody was.\" He added: \"Bill Clinton's a big boy. He can handle it, but you probably have pictures being exposed of other people that innocently met Jeffrey Epstein years ago.\" The US president claimed the release of the files \"is a way of trying to deflect from the tremendous success that the Republican Party has\". Clinton calls for release of 'any remaining materials' In a statement on Monday, Angel Urena, a spokesman for Mr Clinton, called for Mr Trump to \"release any remaining materials referring to mentioning or containing a photograph of Bill Clinton\". The spokesman said the materials released so far \"makes it clear someone or something is being protected\" but said Mr Clinton doesn't need such protection. \"Refusal to do so will confirm the widespread suspicion the Department of Justice's actions to date are not about transparency, but about insinuation - using selective releases to imply wrongdoing about individuals who have already been repeatedly cleared by the very same Department of Justice, over many years under presidents and attorney generals of both parties,\" the spokesperson added. The context around the photos, that were released hours before a legal deadline in the US following the passing of the Epstein Files Transparency Act, is unknown. Read more:Why Andrew photo is deeply awkward for Royal FamilyUS president announces new 'Trump Class' warships The same release only features one picture with Mr Trump's name in it. Mr Clinton has denied any wrongdoing in connection to Epstein and says he regrets meeting him. Backlash over release of files It comes as other Democrats and Republicans have grown angry over the length of time it is taking the US Department of Justice to release all files in the Epstein case. Several victims of Epstein told Sky News that the incomplete release left them feeling shocked, outraged and disappointed. Republican representative Thomas Massie and Democratic representative Ro Khanna said they are working together on an effort to secure the release of more files, and if necessary would seek contempt of Congress charges against Attorney General ​Pam Bondi. Senate Democratic Leader Chuck Schumer also introduced legislation that would instruct Majority Leader John Thune, a Republican, to undertake \"appropriate\" legal steps to gain Congress access to all ‍the documents covered by legislation that was passed by Congress and signed into law by Mr Trump. It was not clear whether his effort might advance in the Senate when it returns on 5 January."
    },
    {
        "title": "Epstein survivor speaks of moment she met Andrew on private island",
        "description": "A survivor of Jeffrey Epstein has spoken of the moment she met Andrew Mountbatten-Windsor on the disgraced financier's private island.",
        "url": "https://news.sky.com/story/epstein-survivor-speaks-of-moment-she-met-andrew-on-private-island-13487135",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-lisa-phillips-epstein_7118574.png?20251223213306",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-23 20:05:00",
        "Headline": "Speaking to US correspondent James Matthews, Lisa Phillips says revealing the true extent of Epstein's abuses is important for the protection of future generations.",
        "Content": "A survivor of Jeffrey Epstein has spoken of the moment she met Andrew Mountbatten-Windsor on the disgraced financier's private island. Lisa Phillips says that revealing the true extent of Epstein's abuses is important for the protection of future generations. Andrew Mountbatten-Windsor has previously denied any allegations against him. Speaking to US correspondent James Matthews on the day a new tranche of documents was released, she said she believes the \"really important stuff\" wasn't released.  She recalled meeting Epstein in 2000 when she was working as a fashion model. Ms Phillips said she was working on an island near Saint Thomas in the Caribbean and went over to Epstein's island for a day, and met Epstein himself at dinner that evening. \n                  What we learned from the latest release of Epstein files\n                 \n                  Epstein files latest: 'Invisible Man' thought to be Andrew asks Ghislaine Maxwell if she's found him 'inappropriate friends' in 2001 email\n                 \n                  Trump 'hated' to see Bill Clinton photos in Epstein files\n                 \"It took a few hours of him speaking to me one-on-one at the table, basically asking me a lot of questions about my life and my relationship with my family and my ambitions.\" She said Epstein was \"very big\" on her goals and became excited when he heard she had lived in Oxford, England, as a child. \"He asked me if I wanted to meet a prince, and I said yes.\" Epstein files latest: New batch of documents released Ms Phillips explained that a man walked up and was introduced to her, and that he spoke to some people there and then said goodbye. \"It was very brief,\" she said, adding that only years later did she realise that this was the former prince, Andrew. She was asked about an email in the recently released files that appears to show Andrew Mountbatten-Windsor asking Ghislaine Maxwell about \"inappropriate friends\". \"That is a very revealing email, isn't it?\" Ms Phillips said. \"It's very creepy, disturbing, and I mean, that's why she's in jail, right?\" The context of the email is unclear, and there is no suggestion of any wrongdoing. Andrew Mountbatten-Windsor has previously denied any allegations against him and Sky News has contacted Andrew's representatives for comment on the latest release. Asked about the impact being in Epstein's orbit has had on her life, Ms Phillips said: \"It hasn't felt good to know that so much of my past that I worked hard for was really just smoke and mirrors and part of a bigger web.\" On the delays in releasing the files, she claimed \"the really important stuff wasn't released\". She also spoke about her and other survivors' ongoing fight for justice. \"We're still doing our research, and we will still be bringing whatever we find to the proper authorities. And we're not going to give up.\""
    },
    {
        "title": "High street banking giants vie for £2.5bn wealth manager Evelyn ",
        "description": "Two of Britain&#8217;s biggest high street banks are embroiled in a &#163;2.5bn takeover battle for Evelyn Partners, the wealth management group.",
        "url": "https://news.sky.com/story/high-street-banking-giants-vie-for-16325bn-wealth-manager-evelyn160-13487136",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-evelyn-finance_7118534.jpg?20251223203949",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-23 20:03:00",
        "Headline": "Barclays and NatWest are both through to the second round of an auction of Evelyn Partners, which manages nearly £64bn in assets, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Two of Britain’s biggest high street banks are embroiled in a £2.5bn takeover battle for Evelyn Partners, the wealth management group. Sky News has learnt that Barclays and NatWest Group were among the bidders notified last week that they were through to the second round of the Evelyn auction. Royal Bank of Canada is also said to be in the frame to buy Evelyn, while a number of private equity firms have also tabled offers for the business. Lloyds Banking Group is understood to have explored an offer for Evelyn, although it was unclear on Tuesday whether it remained interested. For Barclays and NatWest, an acquisition of Evelyn would bolster an area of their businesses where both already have a strong presence - the latter through its Coutts division. Paul Thwaite, NatWest's chief executive, has been clear that the bank will consider acquisitions where they are sensibly priced and strategically attractive following its return this year to full private sector ownership. According to results published in August, Evelyn had assets under management of £64.6bn at the end of June, reflecting growing demand across the wealth management sector. \n                  Reeves's budget tax rises 'a pub destroyer', say landlords\n                 \n                  FTSE-100 events group Informa kicks off hunt for new chairman\n                 \n                  Britons are less well off than they were in 2019 - and these figures show it\n                 Canaccord Genuity's wealth arm is also on the block and could fetch a price of over £1bn. Evelyn is owned by the private equity firms Permira and Warburg Pincus, having merged their respective firms Tilney and Smith & Williamson in 2020. Last year, Evelyn's professional services arm was sold to the buyout firm Apax Partners. The current auction is being handled by bankers at Evercore. Barclays and NatWest declined to comment."
    },
    {
        "title": "Starmer makes cost-of-living promise in Christmas message",
        "description": "The prime minister has acknowledged Britons' cost-of-living struggles in his Christmas message - and vowed that helping with the issue is his \"priority\".",
        "url": "https://news.sky.com/story/starmer-makes-cost-of-living-promise-in-christmas-message-13487047",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sir-keir-starmer-christmas-message_7118352.png?20251223144729",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-23 13:56:00",
        "Headline": "The prime minister's message comes at the end of a difficult year for his government, with economic growth stuttering and criticism over tax rises in the budget.",
        "Content": "The prime minister has acknowledged Britons' cost-of-living struggles in his Christmas message - and vowed that helping with the issue is his \"priority\". Sir Keir Starmer also urged members of the public to \"each do our bit\" and \"reach out\" to friends, relatives and neighbours during the festive period. His message comes at the end of a difficult year for his government, with economic growth stuttering and Chancellor Rachel Reeves facing criticism over tax rises in the budget. In a message recorded inside 10 Downing Street, Sir Keir said: \"I know many across Britain are still struggling with the cost of living. Helping with that is my priority. \"But at this time of the year, which celebrates love and abundance, loss or hardship can feel even more acute. \"So call around to a neighbour. Check in on a friend or a relative who you haven't heard from for a while. Reach out. It can make a huge difference. \"That is what Christmas is about.\" The prime minister thanked NHS workers along with members of the military and the emergency services who will be on duty on Christmas Day. \"Just as so many put their feet up, some truly special people will be pulling on their uniforms and heading out to work,\" he said. \"Our NHS staff emergency services and the brave men and women of our armed forces, all playing their part, doing their bit to care for the nation and to keep us safe. \"Many volunteers will be out there as well. Serving food. Reaching out to help those lonely or in need. \"So on behalf of the whole country, I want to say a big thank you. \"As a nation, we should raise a glass to you this Christmas. But more than that, we should each do our bit as well.\" Read more from Sky News:How does your Christmas compare to rest of UK? Take our quizThe famous faces we said goodbye to this year Conservative leader Kemi Badenoch used her Christmas message to talk about \"Christian values\" and thanked \"everyone who has supported me during my first year as leader of the opposition\". \"It's been the biggest challenge of my life,\" she said. \"But it's also been a wonderful year. I can't wait to get back to work next year to create a better United Kingdom.\" Liberal Democrat leader Sir Ed Davey spoke about the Christmas tree in London's Trafalgar Square - an annual gift from Norway to thank the UK for its support during the Second World War - in his message. While saying the tree may \"look a little underwhelming\" on first glance, the Liberal Democrat leader said it was a reminder of \"friendship and loyalty\". He added: \"It makes me think about people standing together in tough times - whether against the Nazis in the 1940s, or right now in Ukraine. \"And yeah, it might not be perfect, but this tree in Trafalgar Square makes me think about families and friends looking out for one another right here at home. \"I can't think of a better symbol of the Christmas spirit of generosity, love and hope. Of light in the darkness.\""
    },
    {
        "title": "Farmers celebrate Sir Keir Starmer's Christmas U-turn on inheritance tax",
        "description": "In a massive Christmas U-turn by Sir Keir Starmer, the government has announced a huge climbdown on inheritance tax on farmers.",
        "url": "https://news.sky.com/story/farmers-celebrate-sir-keir-starmers-christmas-u-turn-on-inheritance-tax-13487023",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-tractors-farmers-protest_7111890.jpg?20251218110406",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-12-23 12:50:00",
        "Headline": "The government has significantly increased the threshold at which farms will be subject to inheritance tax, which the Tories say is a \"huge U-turn\".",
        "Content": "\n          Chief political correspondent\n              @joncraig\n In a massive Christmas U-turn by Sir Keir Starmer, the government has announced a huge climbdown on inheritance tax on farmers. The tax relief on family farms handed down between families is to increase from £1m to £2.5m, meaning only farms worth more than £5m will pay. The climbdown, overturning bitterly unpopular proposals in Rachel Reeves's budget last year, follows a personal intervention by the prime minister. The National Farmers Union (NFU) president Tom Bradshaw revealed the government backed down after he had two \"very constructive meetings\" with the PM. Responding to the climbdown, Mr Bradshaw - who led a high-profile campaign which included tractors blocking Whitehall - said it would come as a huge relief. Tory leader Kemi Badenoch claimed it was a \"huge U-turn\" by the government and a big win for her party's campaign against Labour's \"family farms tax\". But the shadow environment secretary Victoria Atkins claimed it was only a partial U-turn on the \"vindictive family farm tax\" and was too late for some farmers. Businesses and lives had been lost, she said. Announcing the climbdown, Environment Secretary Emma Reynolds said: \"We have listened closely to farmers across the country, and we are making changes today to protect more ordinary family farms. \"We are increasing the individual threshold from £1m to £2.5m which means couples with estates of up to £5m will now pay no inheritance tax on their estates. \"It's only right that larger estates contribute more, while we back the farms and trading businesses that are the backbone of Britain's rural communities.\" The U-turn was given a warm welcome by the NFU, which has led the relentless protests in Westminster and around the UK. Mr Bradshaw said Tuesday's announcement would \"greatly\" reduce that tax burden for many family farms He said: \"Changes to Agricultural Property Relief (APR) and Business Property Relief (BPR) announced in last year's budget came as a huge shock to the farming community. \"Until that moment, the best tax planning advice was to hold on to your farm until death and pass it on to the next generation who could continue to run a viable farming, food-producing business. \"The original changes to APR and BPR, contained within the Finance Bill, resulted in a pernicious and cruel tax, trapping the most elderly and vulnerable people and their families in the eye of the storm. The NFU and its members have stood strong for what we believed in. \"I am thankful common sense has prevailed and government has listened.\" The climbdown also follows a mini-rebellion in the Commons in early December in a vote on the inheritance tax proposal, when around 30 Labour MPs representing rural areas abstained and one, Markus Campbell-Savours, voted against and had the Labour whip withdrawn. 'A big win for the Conservatives against a cruel and immoral tax' Ms Badenoch, who has campaigned against the tax during several farm visits, said: \"This is a huge U-turn by the government and a big win for the Conservative Party's campaign against Labour's family farm tax. \"The family farm tax is cruel, immoral and will not raise any money because farmers will stop farming. It would have pushed farms to the brink, damaged our food supply, and hurt the people who work long hours to feed the country. \"This fight isn't finished. Other family businesses are still affected by Labour's tax raid, and we will keep pushing until the tax is lifted from them too. But today is an important win, and proof that standing up for what's fair, even when the odds are against us can make a real difference.\" Tim Farron, the Liberal Democrats spokesperson, urged the government to scrap the \"unfair tax in full\" as \"many family farms will still find themselves financially crippled and barely making the minimum wage\". Reform UK deputy leader Richard Tice said: \"This cynical climbdown - whilst better than nothing - does little to address the year of anxiety that farmers have faced in planning to protect their livelihoods. \"With British agriculture hanging by a thread, the government must go further and abolish this callous farms tax.\""
    },
    {
        "title": "Half of voters think Starmer will be replaced as prime minister by end of 2026, poll suggests",
        "description": "Half of people think Sir Keir Starmer will be replaced as prime minister by the end of 2026, according to an exclusive YouGov poll for Sky News",
        "url": "https://news.sky.com/story/half-of-voters-think-starmer-will-be-replaced-as-prime-minister-by-end-of-2026-poll-suggests-13486956",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-prime_7079697.jpg?20251111230605",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-23 11:16:00",
        "Headline": "Speculation has been building that the prime minister will face a challenge in the coming months - and many voters think it's only a matter of time before Labour move to oust Sir Keir.",
        "Content": "Half of people think Sir Keir Starmer will be replaced as prime minister by the end of 2026, according to an exclusive YouGov poll for Sky News It comes as unease continues on the Labour benches about the party's position in the polls, with some significant figures rumoured to be plotting a move if May's local elections go badly. Health Secretary Wes Streeting, Greater Manchester mayor Andy Burnham, Home Secretary Shabana Mahmood, former deputy leader Angela Rayner have all been mooted as potential challengers. Labour Party chair Anna Turley told Sky News at the weekend that Sir Keir would \"absolutely\" still be prime minister next Christmas - but many voters disagree. Thirty-one per cent think the prime minister will \"probably\" be replaced by this time next year, while 19% say he will \"definitely\" be out of Number 10. Only 35% of people surveyed believe he has a chance of still being leader. There was also a harsh assessment of the government's handling of the economy, with 71% telling the YouGov/Sky News poll the economy had got worse over the last 12 months and only 7% saying things had improved. \n                  Starmer makes cost-of-living promise in Christmas message\n                 \n                  Farmers celebrate Sir Keir Starmer's Christmas U-turn on inheritance tax\n                 \n                  Sir Keir Starmer will 'absolutely' still be PM next Christmas, insists Labour chair\n                 The 2,041 people - surveyed between 21 and 22 December - also gave a fairly downbeat view of their own finances. Just 15% think their money situation will improve over the next year, 40% believe it will get worse, while 39% are expecting it to stay about the same. 👉 Tap here to follow Electoral Dysfunction wherever you get your podcasts 👈 However, it appears pessimism has subsided slightly compared with the direct aftermath of November's much-anticipated budget. A month ago, 56% said they expected their financial situation to get worse and 75% said the government was managing the economy badly. Read more from Sky News:Reeves's budget tax rises 'a pub destroyer'Britons 'less well off than they were in 2019' Labour remain second in the polls but are up two percentage points on last week and now sit at 20%, a separate YouGov survey of more than 2,200 people suggests. Reform UK still lead the way when it comes to people's voting intention - but Nigel Farage's party is down from 28% to 25% week on week. The Tories are narrowly in third on 19% (up from 17%), the Liberal Democrats on 15% (up from 14%) as are the Greens (down from 17% last week)."
    },
    {
        "title": "Non-crime hate incidents should be scrapped, police leaders say",
        "description": "Non-crime hate incidents should be scrapped and replaced with a \"common sense\" system, police leaders are set to recommend.",
        "url": "https://news.sky.com/story/non-crime-hate-incidents-should-be-scrapped-police-leaders-say-13486922",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-police-merseyside-liverpool_7100769.jpg?20251204113449",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-23 02:44:00",
        "Headline": "Non-crime hate incidents are perceived to be motivated by hostility or prejudice but do not meet the threshold of a criminal offence.",
        "Content": "Non-crime hate incidents should be scrapped and replaced with a \"common sense\" system, police leaders are set to recommend. The scheme would mean only the most serious incidents are recorded as anti-social behaviour. The recommendation is part of a review by leaders at the National Police Chiefs' Council (NPCC) and College of Policing, which is set to be published next month and given to Home Secretary Shabana Mahmood. Non-crime hate incidents are perceived to be motivated by hostility or prejudice towards certain characteristics, such as race or gender, but do not meet the threshold of a criminal offence. Rather than logging hate incidents on a crime database, the plan would treat them as intelligence reports, with officers given a \"common sense\" checklist. The checklist is intended to ensure officers target only serious anti-social behaviour, such as antisemitism, Lord Herbert of South Downs, chairman of the College of Policing, told The Telegraph. He said that non-crime hate incidents would \"go as a concept\", with the system, which dates back to 1999, no longer \"fit for purpose\". Read more from Sky News:Britons are less well off than in 2019Reeves's budget tax rises 'a pub destroyer', say landlords The NPCC review was announced after the Metropolitan Police said in October that it would no longer investigate non-crime hate incidents. Britain's biggest police force made the announcement after revealing Father Ted creator Graham Linehan will face no further action after he was arrested at Heathrow Airport on suspicion of inciting violence over three posts he made on X about transgender issues."
    },
    {
        "title": "2025 on track to be UK's warmest year on record, says Met Office",
        "description": "The UK could be set to have had its warmest year on record, according to forecasters.",
        "url": "https://news.sky.com/story/2025-on-track-to-be-uks-warmest-year-on-record-says-met-office-13486920",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-weather-lake_7118053.jpg?20251223012333",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-12-23 00:19:00",
        "Headline": "The average annual temperature is tracking at 10.05C - ahead of the previous record of 10.03C set in 2022 - with a climate scientist describing the finding as \"devastating and utterly unsurprising\".",
        "Content": "The UK could be set to have had its warmest year on record, according to forecasters. The Met Office says 2025 is on track to become one of the UK's warmest years, possibly surpassing 2022. The average annual temperature is tracking at 10.05C - ahead of the previous record of 10.03C set in 2022. A forecasted cold spell over Christmas means the final figure is not yet confirmed. If it is confirmed, 2025 will be only the second year in observational records where the UK's annual mean temperature has topped 10C. Four of the last five years will then appear in the top five warmest years since records began in 1884. All of the top 10 warmest years will have occurred in the last two decades. A new record has been previously set for the UK annual mean temperature five times this century - in 2002, 2003, 2006, 2014 and 2022. 'Extraordinary times' Mike Kendon, a senior Met Office scientist, said it was \"more likely than not\" this year would be confirmed as the UK's warmest ever. \"In terms of our climate, we are living in extraordinary times. The changes we are seeing are unprecedented in observational records back to the 19th century,\" said Mr Kendon. Read more from Sky News:Major city may have to evacuate as water is running outClimate activists dye Venice canal green Professor of climate science Friederike Otto called the findings \"devastating and utterly unsurprising\". He added: \"10C might not sound very warm, but it is an average and means much higher temperatures in the summer, high temperatures that would have never been possible are now common and that is not good news.\" Climate minister Katie White warned people to \"sit up and listen\" and said climate change was \"reshaping everyday life\". \"Four heatwaves in one summer, record wildfires in the Highlands, flash flood warnings from Cornwall to Inverness. This is not normal,\" said Ms White. She added: \"The good news is we know what works, listening to the science, backing British innovators, and getting on with solutions that cut emissions and build a cleaner, safer future.\""
    },
    {
        "title": "Jail for burglars who used Grindr dating app to dupe victims",
        "description": "Two burglars who used the Grindr dating app to trick victims into letting them into their homes have been jailed.",
        "url": "https://news.sky.com/story/jail-for-burglars-who-used-grindr-dating-app-to-dupe-victims-13487037",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-rahmat-khan-mohammadi_7118277.jpg?20251223130453",
        "type": "Technology",
        "Author": "Bethany Minelle, news reporter",
        "Date Published": "2025-12-23 13:18:00",
        "Headline": "One victim was led into park late at night and encouraged to undress before his phone was taken. He called the theft \"invasive and degrading\".",
        "Content": "By Bethany Minelle, news reporter  Two burglars who used the Grindr dating app to trick victims into letting them into their homes have been jailed. Rahmat Khan Mohammadi, 23, and Mohammed Bilal Hotak, 27, would arrange to meet victims at their London properties, and persuade them to provide their phone passwords by asking to play music on YouTube. The Afghan refugees then stole the devices and left before making online or contactless payments, as well as occasionally transferring funds to themselves. Mohammadi targeted 11 victims in his five-month crime spree between 24 October 2024 and 24 March 2025. Hotak offended multiple times between 24 October 2024 and 23 December 2024. Mohammadi was jailed for five years and Hotak for three and a half years at Isleworth Crown Court on Monday. Sentencing both men, Judge Adenike Balogun said: \"I have taken note of the psychological trauma as well as the inconvenience caused to the victims, and the distress that all of them have expressed at allowing you into their homes - into their private space - only to be violated.\" Prosecutor David Patience had alleged that the men were targeted because of their sexuality and the offences could in effect been seen as hate crimes. The judge said: \"I've considered that matter very carefully and it seems to me that the presumed sexual orientation of the victims presented an opportunity for you to commit the crime, and in that respect I do find that the victims... were targeted because of their perceived vulnerability.\" However, she said they were not picked because the two men held \"hostility\" towards the victims' sexuality. Rather, it was because they knew that Grindr - an app used for gay introductions - was \"an opportunity to gain easy access into the homes of the victims\". She added: \"I suspect you were - and I put no higher than that - banking on the victims not reporting the crime.\" Frequently using a Grindr profile with no photo, they would send one of someone else if an image was requested by a potential victim. For several meet-ups Mohammadi would ask to bring a friend which would be Hotak. Once inside, they would ask the victim to turn on music, usually on YouTube because the phone could not be locked while a video was playing. Distraction tactics to encourage the victim to leave the room included taking a shower before sex, making a drink and showing one of them where the toilet was. John Kearney, defending Hotak, told the court that the men chose Grindr because \"there is no comeback\". He said: \"The application itself has enabled completely anonymous people to be invited as complete strangers into the homes of the victims\". One victim spoke about the \"severe psychological trauma\" of being targeted, and the impact of losing photos of deceased family members stored on his phone. He said: \"The suspects used Grindr, a gay dating app, as a hunting ground.\" Another victim described being led into \"a dark wet park late at night,\" and encouraged to undress before his phone was taken from him. He called the theft \"invasive and degrading,\" and says he remains afraid to date people he has met online. A jury found Mohammadi, of Weald Lane in Harrow, north-west London, guilty of 10 counts of burgling a dwelling, nine of fraud by false representation and one of theft. Hotak, of Richmond Road in Hackney, east London, was convicted of five counts of burgling a dwelling, five of fraud by false representation and one of theft. Mohammadi was acquitted of a further 10 charges and Hotak of 13. Superintendent Owen Renowden, the Metropolitan Police's hate crime lead, called their crimes \"callous, calculated, pre-planned\". \"Their actions had a devastating impact on their victims,\" he said. \"Nobody should be made to feel unsafe in their own homes and they will have to live with the trauma these men have caused them.\""
    },
    {
        "title": "Comedian Russell Brand charged with further counts of rape and sexual assault",
        "description": "Russell Brand has been charged with further counts of rape and sexual assault, police have said.",
        "url": "https://news.sky.com/story/comedian-russell-brand-charged-with-further-counts-of-rape-and-sexual-assault-13487096",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-russell-brand-police_7118452.jpg?20251223165856",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-23 16:37:00",
        "Headline": "The comedian and actor is due to appear at Westminster Magistrates' Court on 20 January 2026 in relation to the two additional charges.",
        "Content": "Russell Brand has been charged with further counts of rape and sexual assault, police have said. They relate to two further women and are in addition to the charges issued to the comedian and actor in April, which involved four women. He had been previously charged with two counts of rape, one count of indecent assault and two counts of sexual assault. Brand has pleaded not guilty to the earlier charges. He is due to appear at Westminster Magistrates' Court on 20 January 2026 in relation to the two additional charges. His trial is scheduled to begin at Southwark Crown Court on 16 June 2026 in relation to the five original charges. Detective Chief Inspector Tariq Farooqi from the Metropolitan Police, who is leading the investigation, issued an appeal for witnesses. \n                  Details of King Charles's Christmas message revealed - as he chooses to deliver it away from palace\n                 \n                  Starmer makes cost-of-living promise in Christmas message\n                 \n                  Wednesday's national newspaper front pages\n                 He said: \"The women who have made reports, including those connected to the two new charges, continue to receive support from specially trained officers. \"The Met's investigation remains ongoing, and detectives urge anyone affected by this case, or anyone with information, to come forward and speak with police. \"Support is also available through the independent charity Rape Crisis by contacting the 24/7 Rape and Sexual Abuse Support Line.\" Brand, 50, rose to prominence as a comedian in the mid-2000s, before finding success in Hollywood with the 2008 film Forgetting Sarah Marshall and its 2010 spin-off, Get Him To The Greek."
    },
    {
        "title": "Bob Vylan rapper will not be prosecuted over 'death to the IDF' chant",
        "description": "The rapper in punk duo Bob Vylan will not face further action over his \"death death to the IDF\" chants at Glastonbury Festival, police have said.  ",
        "url": "https://news.sky.com/story/bob-vylan-rapper-will-not-be-prosecuted-over-death-to-the-idf-chant-13487102",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bob-vylan-glastonbury_6952843.jpg?20250629125300",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-23 16:42:00",
        "Headline": "Police say there is \"insufficient\" evidence for \"a realistic prospect of conviction\" over the performance at this year's Glastonbury Festival.",
        "Content": "The rapper in punk duo Bob Vylan will not face further action over his \"death death to the IDF\" chants at Glastonbury Festival, police have said.   Rapper Bobby Vylan, real name is Pascal Robinson-Foster led crowds on the festival's West Holts Stage in the chants about the Israel Defence Forces during the group's performance in June. Avon and Somerset Police said a criminal investigation was under way shortly afterwards, with a senior detective appointed to lead the investigation. But in a statement released on Tuesday, the force said: \"We have concluded, after reviewing all the evidence, that it does not meet the criminal threshold outlined by the CPS for any person to be prosecuted. \"No further action will be taken on the basis there is insufficient evidence for there to be a realistic prospect of conviction.\" The force said it conducted a voluntary interview with a man in his mid-30s in November over the incident, adding he was informed of the outcome earlier on Tuesday. Read more:Bob Vylan sue broadcaster over 'antisemitic' claimBob Vylan on IDF chant: 'I'd do it again tomorrow.' Police said: \"The comments made on Saturday June 28 drew widespread anger, proving that words have real-world consequences. \"We believe it is right this matter was comprehensively investigated, every potential criminal offence was thoroughly considered and we sought all the advice we could to ensure we made an informed decision.\" The news comes after the Metropolitcan Police said they would close their own investigation into a London performance, following advice from the Crown Prosecution Service (CPS)."
    },
    {
        "title": "Reginald D Hunter: Summons against comic by Campaign Against Antisemitism quashed for seeking to have him 'cancelled'",
        "description": "A judge has quashed a summons against comedian Reginald D Hunter, brought privately by Campaign Against Antisemitism, ruling it \"abusive\" and intended to get the comedian \"cancelled\".",
        "url": "https://news.sky.com/story/reginald-d-hunter-summons-against-comic-by-campaign-against-antisemitism-quashed-for-seeking-to-have-him-cancelled-13487040",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-reginald-d-hunter-comedian_6657298.jpg?20240816155007",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-12-23 13:32:00",
        "Headline": "The judge said the CAA \"misled\" him over comments Hunter made to Heidi Bachram on X, and failed to inform him of a previous compliance probe.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n A judge has quashed a summons against comedian Reginald D Hunter, brought privately by Campaign Against Antisemitism, ruling it \"abusive\" and intended to get the comedian \"cancelled\". The 56-year-old US comic had been accused of three counts of sending an offensive communication on three different occasions - 24 August, 10 September and 11 September last year - to Heidi Bachram on X. District Judge Michael Snow quashed the summons on Tuesday at Westminster Magistrates' Court following an application by the defence. He ruled the Campaign Against Antisemitism (CAA) charity's motive in seeking to prosecute Hunter was \"to have him cancelled\", and the prosecution was \"abusive\". The CAA describes itself as a volunteer-led charity, \"dedicated to exposing and countering antisemitism through education and zero-tolerance enforcement of the law\". In his ruling, Judge Snow said: \"The CAA have demonstrated by the misleading and partial way in which it summarised its application and its wilful, repeated, failure to meet its disclosure obligations, that its true and sole motive in seeking to prosecute Reginald Hunter is to have him cancelled. \"I have no doubt that the prosecution is abusive. \n                  Details of King Charles's Christmas message revealed - as he chooses to deliver it away from palace\n                 \n                  Starmer makes cost-of-living promise in Christmas message\n                 \n                  Comedian Russell Brand charged with further counts of rape and sexual assault\n                 \"My view of the conduct of the CAA is consistent with them as an organisation which is not 'playing it straight' but is seeking to use the criminal justice system, in this case for improper reasons.\" 'Inadequate' summary and failure to flag compliance probe Judge Snow said the summary of Ms Bachram's tweeting in the application case summary was \"wholly inadequate\". He added: \"It did not reveal the extent of her tweets directed against Reginald Hunter in the period immediately preceding the complaints (her tweets were sent between 15 August and 11 September 2024). \"The summary misled me into believing that his comments were addressed to her involvement with the Jewish faith as opposed to his response to attempts that were being made to have him 'cancelled'.\" The judge said the CAA had failed to inform him of a compliance investigation by the Charity Commission into the CAA in November 2024. CAA accused of 'weaponising' the court Hunter's lawyer Rebecca Chalkley KC told the hearing on Tuesday that \"very little was disclosed\" to the judge and the \"lack of candour\" meant the summons should be quashed. Ms Chalkley said: \"It calls into question the whole juridical process as judges before issuing summonses need to have everything in front of them.\" The lawyer told the judge: \"You were led to believe in papers in front of you that the CAA was no more than a charity, that it had no history - as since demonstrated as a vexatious litigant - no complaints, no criticism in parliament, no investigations by the Charity Commission.\" The lawyer added: \"The CAA are weaponising and using the courts for their own political agenda and not just in this case.\" The CAA's prosecutor Donal Lawler told the hearing that the charity had complied with its duty of candour. Hunter regularly tours the UK and has appeared on comedy panel shows Never Mind The Buzzcocks, Have I Got News For You and 8 Out Of 10 Cats. A crowdfunding campaign he launched to help him cover his legal fees raised over £58,000 in less than six months."
    }
]