[
    {
        "title": "Some of Putin's most potent weapons are hiding in plain sight - in the English Channel",
        "description": "In the English Channel, less than two hours by fishing boat from Dover, some of the most potent weapons in Russia's war on Ukraine are hiding in plain sight.",
        "url": "https://news.sky.com/story/some-of-putins-most-potent-weapons-are-hiding-in-plain-sight-in-the-english-channel-13511518",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-kousai-shadow-fleet_7174046.jpg?20260224190840",
        "type": "Home",
        "Author": "Paul Kelso",
        "Date Published": "2026-02-24 12:56:00",
        "Headline": "As tankers carrying hundreds of millions of dollars worth of Russian oil pass through British waters, a Sky News expert warns we are heading for \"militarised confrontation at sea\".",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n In the English Channel, less than two hours by fishing boat from Dover, some of the most potent weapons in Russia's war on Ukraine are hiding in plain sight. On a misty February morning midway between Britain and France, we watch tankers carrying Russian oil worth around $100m (£74.1m) cruise past in defiance of Western sanctions, embargoes, and price caps. Dozens of these vessels pass through the Channel every month, part of a \"shadow fleet\" of up to 800 vessels that have kept the oil revenues that fund the war on Ukraine flowing. This week, the UK government announced fresh sanctions against the Russian oil trade but the evidence of a day on the water is that the shadow fleet operates with apparent impunity, right under the nose of Kyiv's allies. Russian tankers a 'routine sight' Our skipper, Matt Coker, usually takes sea fishing parties out on the Portia, but we were after a bigger catch; three vessels in the shadow fleet carrying oil from Russia's Baltic ports. He says they are a routine sight in the world's busiest shipping lane: \"When you see these Russian ships and these oil tankers, you know, it's a regular occurrence. To be honest, no one really takes any notice.\" We had tracked the tankers - the Rigel, the Hyperion and the Kousai - from the Gulf of Finland, where they had been loaded with oil at Russian Baltic ports, to intercept them as they passed the narrowest point of the Dover Straits. Up close in a rising swell, the scale of the vessels is unavoidable, and each one tells a story about both the impact and the limits of Western action. The Rigel, a Suezmax-class tanker, is more than 270 metres long and fills the near horizon as it emerges from the mist. With a capacity of one million barrels, its cargo of oil, loaded a week earlier at Primorsk, is worth around $55m (£40.7m). It is sailing under a Cameroon flag, owned and managed by a company in the Seychelles, and sanctioned by the EU, UK and Canada, among others. That prevents it from using port facilities in any of the sanctioning countries, but not from heading to its next known stop, Port Said at the head of the Suez Canal. We cannot know where its oil will be unloaded, but since the invasion of Ukraine, the bulk of Russian oil has been sold to China and India, at a significant discount. Next to appear is the Hyperion, sanctioned by the UK, EU and US, and sailing under a Russian flag with its name marked on the bow in Cyrillic. The flag switching tactic As recently as December, it was sailing under a Sierra Leone flag when, after making a delivery to Venezuela, it switched flags and evaded the US naval blockade in the Caribbean. Switching flags is a routine tactic in the shadow fleet, opaque ownership is common, and insurance cover is often unclear, a serious concern given many of the vessels are ageing and poorly maintained. The US has taken direct military action against tankers in the shadow fleet linked to Venezuela, with at least seven seized since last year, the most recently in the Indian Ocean on Tuesday. French paramilitaries also seized a vessel in the Mediterranean last month, but despite the almost daily passage of shadow tankers through the Channel, direct British interventions so far have focused on insurance. As we watch the passage of our third sanctioned tanker, the Kousai, we overhear a message from the coastguard to its captain on the open VHF radio channel, demanding proof of insurance. The captain is asked to email documentation to a government email address within 24 hours. We do not hear the Kousai's response, and in a matter of minutes, it too has passed. A reaction to sanctions Sanctions against Russia's oil industry have had an impact, reducing the value of Russian oil if not the volumes that it moves. The growth of the shadow fleet itself is a market response to tightening sanctions. With the majority of western-controlled tankers and associated marine services beyond Russia's reach, it turned to an ad-hoc, opaque collection of older vessels to move oil, often covertly. \"Over 60% of Russian crude is being exported on the shadow fleet,\" says Pamela Munger, head of European market analysis for energy analysts Vortexa. \"You have more vessels that need to be in the chain. Let's say a sanctioned vessel loads Russian crude and let's say it's on its way to China. \"It could make up to five, six, seven ship-to-ship transfers along the way in order to disguise the origin of the crude and move it on to… Non-sanctioned vessels, which it will eventually discharge into its end buyer.\" Data from the Centre for Research on Energy and Clean Air shows that the number of vessels in the shadow fleet grew following sanctions but the volume of oil being moved remained constant, even as hundreds of vessels were sanctioned directly. Impact on the oil market Prices have fallen, however, with Russian oil now competing with Iranian and Venezuelan crude in the \"distressed\" sanctioned oil market, cutting Kremlin revenues as a result. \"Russia has had to discount those crude oil cargoes in a very big way,\" says David Fyfe, chief economist at commodity price specialists Argus Media. \"In 2021, Urals, the primary export grade of Russian crude, was pricing two to three dollars below North Sea Brent. As we speak in February, Urals is loading in the Baltic ports at $27 below North Sea Brent.\" That price gap has cut Russia's oil revenues by around 25% year-on-year and by up to 50% in January alone, an economic impact the Kremlin cannot ignore. \"I think they'll take a fairly sizeable hit, particularly in revenues this year, and I'd expect, at the very least, something like a half-a-million barrel per day hit on volumes,\" says Mr Fyfe. Are we heading for a military confrontation? The squeeze could tighten further, with pressure for a more robust response from European nations, including the UK. Under maritime law, all vessels have the right of innocent passage as long as they are sailing under a legitimate flag, and many countries have continued to do business with Russia since the invasion of Ukraine. The UK government is understood to have examined the legal grounds for detaining Russian tankers, including under the Sanctions and Money Laundering Act. \"I think there must come a point at which Britain and its allies, the Dutch, and the Danes and the Norwegians and the seagoing nations of Northern Europe, they will get much tougher with these Russian ships, even if they're escorted,\" says Professor Michael Clarke, Sky News security and defence analyst. \"When that happens, I think we're heading probably sometime this year for some sort of militarised confrontation at sea.\" A Ministry of Defence spokesperson said it has requested insurance documents from more than 600 vessels, and that \"deterring, disrupting and degrading the Russian shadow fleet is a priority\". The owners of the Rigel, the Hyperion and the Kousai have been contacted for comment."
    },
    {
        "title": "Trump's plan for Iran isn't working - he has three options",
        "description": "As the world awaits possible US military action against Iran, has Donald Trump boxed himself into a corner with only himself to blame?",
        "url": "https://news.sky.com/story/trumps-plan-for-iran-isnt-working-he-has-three-options-13511592",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-iran-trump_7174262.jpg?20260224223747",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2026-02-24 15:48:00",
        "Headline": "Tehran seems content to call Donald Trump's bluff, and so far putting a gun to the regime's head hasn't gone to plan. What could he do now?",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n As the world awaits possible US military action against Iran, has Donald Trump boxed himself into a corner with only himself to blame? There is a massive amount of American firepower now in the region, and its commander-in-chief has issued Tehran with multiple warnings: Make a deal or else. But what if they don't? The president's plan appears to have been to use the US Navy to force the Iranians to accept his terms with a gun to their head, but it's not working out. His chief negotiator, Steve Witkoff, has admitted as much. \"He's curious\", he said of Trump, \"as to why they haven't capitulated, why under this sort of pressure with the amount of naval power that we have over there, why they haven't come to us.\" So what now? The president \"understands that he's got plenty of alternatives\", claims Witkoff, but does he? Option one One option could be calibrated strikes. Whack Iran once and see if that makes its government more amenable. Experts say that could prove a massive miscalculation. The Iranian government is in a tight spot, no doubt, but it may try to ride out the storm if it's just a series of strikes. Option two Or the president could authorise attacking Iran with full force. But that's problematic too. Observers warn that for all the military muscle mustered in the region, there is still not enough to sustain an extended air campaign. In leaks infuriating the president, his own commanders at the Pentagon have been warning as much. Two carrier strike groups and all the warplanes sent to bases to bolster them could bombard Iran for a week, at most two, it is thought. That would be painful for the Iranians, but they could try to hunker down and tough that out, too. And they would strike back with their formidable arsenal of ballistic missiles. Option three Attacking Iran comes with considerable jeopardy for the president. But so does walking away. For all his bellicose rhetoric, the \"TACO president\"i could chicken out and send his aircraft carriers back to base. Read more from Sky News:How Iran may be preparing for US strikeIs Tehran ready to strike a deal? But having built up so much firepower, doing nothing would look weak and have consequences: for America's standing and the president's own political fortunes at a time when his approval ratings are cratering. Talks in Geneva scheduled for Thursday offer an off-ramp. Iran has another chance to \"capitulate\", as Witkoff puts it. But they are past masters at brinkmanship and calling their enemies' bluff. If they do so, has the US president thought this all through, or has he cooked his own goose?"
    },
    {
        "title": "European leaders came together in solidarity on Ukraine war fourth anniversary - but peace seems a long way off",
        "description": "Watching President Zelenskyy and first lady Olena Zelenska in the centre of Kyiv lead a minute's silence to honour the tens of thousands of soldiers who have died on the fourth anniversary of the Ukraine war was a sobering moment.&#160;",
        "url": "https://news.sky.com/story/european-leaders-came-together-in-solidarity-on-ukraine-war-fourth-anniversary-but-peace-seems-a-long-way-off-13511729",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-ukraine-lviv_7173479.jpg?20260224083346",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2026-02-24 21:34:00",
        "Headline": "Beth Rigby joined Foreign Secretary Yvette Cooper in Kyiv on the fourth anniversary of Russia's invasion of Ukraine.",
        "Content": "\n          Political editor\n              @BethRigby\n Watching President Zelenskyy and first lady Olena Zelenska in the centre of Kyiv lead a minute's silence to honour the tens of thousands of soldiers who have died on the fourth anniversary of the Ukraine war was a sobering moment.  European prime ministers and dignitaries had come to Maidan Square in Kyiv as an act of solidarity and remembrance as they set candles in front of the sea of crosses, photos, and flags that now adorn this makeshift memorial for those killed in this conflict. But equally, there is an acknowledgement from those gathered that when it comes to this war, there is no end in sight: the leaders who arrived in Ukraine to mark this anniversary expect to be coming back next year, too. For Yvette Cooper, the foreign secretary, the trip was a moment to focus not just on sanctions, weapon supplies and territory, but to try to highlight the war Vladimir Putin is waging against women and children in Ukraine as he wages a \"war on Ukrainian culture\". \"I think one of the things that's been clearly happening, the way that so many children have been stolen, the ways in which, in the temporarily occupied territories, they are trying to change the education system, trying to choke out the Ukrainian language,\" she said. \"It's an attempt really, not just about territory, but to have a war on Ukrainian families, to have war on Ukraine history and culture and identity.\" But even as she arrived in Ukraine, issues at home plaguing the government and her foreign office brief were dominating the agenda, with the former US ambassador that she sacked, Peter Mandelson, arrested and taken in for hours of questioning by the police as Ms Cooper took an overnight train to Ukraine. The foreign secretary, who sacked the ambassador just days into her job in September, reiterated her position that Lord Mandelson \"should never have been appointed\" and, in a rare flash of emotion, told me that \"vile\" emails were exchanged between Lord Mandelson and paedophile financier Jeffrey Epstein. In one of the emails released by the US Department of Justice, Epstein replies to Lord Mandelson asking how being free from jail felt, by saying \"she feels fresh, firm and creamy\". Lord Mandelson replied by calling Epstein a \"naughty boy\". \"That's just vile,\" she told me. \"It makes me feel so angry.\" \"I've been really clear, Peter Mandelson should never have been appointed as ambassador to the US and I think some of what has been so, so deeply frustrating about all of this is that really at the heart of all of these should be the victims of Epstein, they're women and children who faced the most horrendous criminal exploitation trafficking and that really should be the focus. \"As you know, when I was home secretary, I made it a mission for the government to halve violence against women and girls over the next 10 years. \"That's a strategy now that the prime minister has championed. And now, as foreign secretary, I am making tackling violence against women and girls something that is an international theme for us as well.\" Putin's 'genocidal intent' On that issue, Ms Cooper used her time in Ukraine to meet female victims of Russian aggression and sexual violence and the \"voices for children\" charity with Olena Zelenska to highlight the plight of thousands of children stolen from their Ukrainian families by Russia. Yevgen Zakharov, a civil rights activist working at the Civil Liberties Centre, told the foreign secretary on her visit there that Putin \"wants to eliminate Ukrainian identity\". \"This is his crazy idea, a genocidal intent is there,\" he said. Throughout these visits, we heard stories of women in Russian-occupied territory being beaten, sexually abused, falsely imprisoned and sent to Labour camps. Elena Jagapova spoke of how she was taped to a chair, beaten until bloodied, sexually abused and sent to a labour camp. Another, Julia, told us of how her children - then 10 and 17 - were abducted by the Russians, and her 19-month battle to get them back. Ms Zelenska says more than 20,000 Ukrainian children have been stolen by the Russians as part of their campaign to eradicate Ukrainian culture, through repressing the language, forcing indoctrination and trying to brainwash children. \"We heard stories not just of torture, but also of this attempt to really destroy Ukrainian culture and identity as well,\" said Ms Cooper. \"That's why it's so important that we provide support for Ukrainian families, support for Ukrainian services but, also, make sure that you could have the kind of special tribunal, the kind of court processes, international court processes, that can pursue exactly those questions and can make sure that there is some justice and accountability.\" No end in sight… The UK has made it clear to Ukraine that it will play a part in helping set up war crime courts when this conflict finally ends, in echoes of Britain's role in the Nuremberg trials that punctuated the Second World War. But when that moment comes is hard to see. Those who gathered in Ukraine on Tuesday did so with a weariness that has come to characterise an attritional war in which Russia isn't winning, but neither is it defeated, as Europe and the US give enough support for Ukraine to fight on, without the firepower - or sanctions against Russia - for it to truly succeed. Mr Zelenskyy warned on the eve of the fourth anniversary that Putin had already started World War Three and Ukraine was the outpost, the frontline pushing Putin back. Ms Cooper doesn't want to use that language, but she does acknowledge that Russian aggression is here to stay, and allies must support Ukraine for however long it takes. To that end, the UK introduced another sanctions package on Tuesday, and is pushing the US and Europe about a maritime services ban to make it much harder for Russia's shadow fleet to transport Russian oil. The frustration is that the US, in trying to pursue peace talks - and reportedly in favour of Russian demand that Ukraine cede the 20% of the Donbas territory not under Russian occupation as part of any truce, is reluctant to squeeze Russia economically right now. …but a glimmer of hope So this war grinds on. For the Ukrainians and allies, one glimmer of hope is that Russia is now losing more men that it can mobilise on the battlefield. Ukraine hopes that if it can increase the casualty rate to 50,000 Russians a month, then Putin might be forced to consider conscription, which could prove politically difficult and begin to stall his momentum. That Russia has sacrificed an estimated 500,000 lives in order to gain less than one per cent of Ukraine's territory tells of the attritional war in which these two sides are locked - and with the horrific loss of life. In the meantime, Britain and Europe will try to put more pressure on the US to bring in more aggressive sanctions against Russia, to financially starve Putin's war machine. But for all the signs of solidarity on Tuesday, there is little to show in the way of concrete steps to peace. Ukraine hopes for a game changer in the coming months, but is reconciled to more anniversaries like today."
    },
    {
        "title": "Mandelson's lawyers say his arrest due to 'baseless' flight risk claim",
        "description": "Peter Mandelson's lawyers have said claims he was arrested because he was a flight risk are \"baseless\".",
        "url": "https://news.sky.com/story/mandelsons-lawyers-say-his-arrest-due-to-baseless-flight-risk-claim-13511718",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/9c8b9074f05e9dcbf8a97edc95fd55e3d833336d968b7f58e3973276bccde47e_7173025.jpg?20260223171028",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-24 20:52:00",
        "Headline": "Sky News understands police detained the peer because they had been told he was preparing to flee the UK for the British Virgin Islands.",
        "Content": "Peter Mandelson's lawyers have said claims he was arrested because he was a flight risk are \"baseless\". The former Labour peer was detained on Monday under suspicion of misconduct in public office, and released later the same evening. Sky News understands the Metropolitan Police arrested him because they had been told he was preparing to flee the UK for the British Virgin Islands. They had originally planned to interview Mandelson, 72, under caution, without arrest in a fortnight's time. It is understood that going through devices obtained from searching his two homes in Camden, north London, and Wiltshire, was proving very time-consuming. But after police conducted a series of interviews about the flight risk claims they decided they needed to arrest him this week. Mandelson has denied any wrongdoing. Mishcon de Rey, lawyers for the former British ambassador to the US, said: \"Peter Mandelson was arrested yesterday despite an agreement with the police that he would attend an interview next month on a voluntary basis. \n                  Mandelson's 'vile' Epstein emails make me 'angry', Foreign Secretary Yvette Cooper says\n                 \n                  Mandelson arrested as Trump attacks Supreme Court \n                 \n                  Mandelson's assistant sent Epstein government speech before it was delivered\n                 \"The arrest was prompted by a baseless suggestion that he was planning to leave the country and take up permanent residence abroad. \"There is absolutely no truth whatsoever in any such suggestion. \"We have asked the MPS for the evidence relied upon to justify the arrest. Peter Mandelson's overriding priority is to cooperate with the police investigation, as he has done throughout this process, and to clear his name.\" Lord Mandelson was bailed in the early hours of Tuesday morning after about eight hours of questioning. It is not clear if he had to surrender his passport, but that is usually a condition of bail in such cases. Read more: Mandelson's 'vile' Epstein emails make me 'angry', foreign sec says He was sacked as ambassador in September after details emerged about his continued contact with disgraced paedophile Jeffrey Epstein. Mandelson then resigned from the House of Lords in early February amid growing public and political scrutiny after the US Department of Justice's latest publication of Epstein files last month."
    },
    {
        "title": "Welcome to the fly-tipping capital of England, where locals are 'embarrassed' to live",
        "description": "It's hard to believe the London Borough of Brent was once covered in even more rubbish than it is now.&#160;",
        "url": "https://news.sky.com/story/welcome-to-the-fly-tipping-capital-of-england-where-locals-are-embarrassed-to-live-13511693",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-fly-tipping-brent_7174075.jpg?20260224200629",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2026-02-24 19:46:00",
        "Headline": "Sky News has spent time with a squad of enforcement officers tasked with tracking down fly-tippers. It's a game of cat and mouse as they walk the streets of Brent, London, looking for clues.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n It's hard to believe the London Borough of Brent was once covered in even more rubbish than it is now.  Although the gleaming arch of Wembley Stadium is sometimes just a few steps away, its residential streets are a patchwork of filth. Whether it's a sea of bottles right by the very sign for the recycling centre, a hollowed-out sofa sagging against a brick wall or a TV just feet from (but not in) the communal dustbin, Brent is covered in, well, crap. \"It's like a dump,\" says Robert Hall, who has lived there all the 60-odd years of his life. His neighbourhood has become an obstacle course of dumped cars, rubbish, and mattresses. It might sound like he's exaggerating, but on my 20-minute walk over from Wembley Park Tube, I see a fridge, TV, pet cage and countless bags of rubbish. \"It's an eyesore. I'm embarrassed to have people visit,\" he adds. And it's just as well, because it turns out his friends have told him they don't like coming to see him any more anyway. An unenviable crown  Brent recently earned the unenviable title of fly-tipping capital of England, after recording 35,000 incidents in a single year. It's a stain Brent Council is slowly managing to scrub away, thanks to its zealous squad of enforcement officers tasked with tracking down the culprits. \"It's important to take pride in what you do,\" says Anca Pricop, enforcement patrol supervisor at Brent Council. \"It might not seem a very nice job, but it is satisfying when you catch people.\" Following the paper trail  \"We're little detectives,\" she says, having donned two layers of gloves and attacked a pile of black bin bags with gusto. All make-up, high ponytail and painted silver nails, she brings remarkable glamour to a decidedly grimy job. Elbows-deep in someone else's filth, she starts to piece together 1sq cm of torn-up pieces of paper. \"You can clearly see there was a delivery label inside.\" But to her dismay, no smoking gun this time. The household went to \"a lot of trouble just to rip [the label] and for us not to be able to find [the address]\". Her luck shifts a few streets away, where a mound of household waste is spilling out of a phone box. Anca combs through the papers inside. Bingo: a box of medicine with a prescription label still intact. \"We have a name,\" she says. Earlier that week her team seized a van they'd caught fly-tipping by tracing the rubbish back to the vehicle. She says many people don't realise the onus is on them to check whether the people offering to take away their waste for a good fee actually have a licence to do so. \"More often than not it will get dumped - on the same street sometimes.\" If caught by Anca, the households will get slapped with a fine. A national 'epidemic' Thanks to the inspections like this, plus new \"community skips\", Brent Council says it's getting a grip on fly-tipping, inching its way down the league table. But nationally, the figures have barely budged from around the one million incidents a year mark. New statistics for 2024-2025, due later on Wednesday, are predicted to show that the tide of rubbish is nowhere near receding. Read more from Sky News:Sky correspondent's car attackedSwapping Wall Street for the frontline The figures are also thought to be only the tip of the iceberg, as they exclude cases on private land like farms and National Trust estates. The data also shows how few cases result in fines or prosecutions. Campaigners at Clean Up Britain accuse local and central governments of failing to enforce the law, or to show that fly-tippers will be caught. It wants stronger enforcement and maximum fines of £20,000. The government says it is \"determined to stop\" criminals and is \"giving authorities the tools they need to fight back\". A spokesperson told Sky News \"councils have the power to crush their vans - leaving waste criminals with nowhere left to hide\". Fast-forward a few days from Brent, and we are filming at a recycling facility in Wokingham, where the van seized by Brent Council will be crushed. That’s the image the councils and government want you to see: perpetrators caught and published. But for now, for most cases, that is far from the truth."
    },
    {
        "title": "Best and worst NHS trusts for cancer treatment revealed",
        "description": "Almost all NHS trusts are missing a major cancer target - with some of the worst performers seeing only about half of patients on time, data shows.",
        "url": "https://news.sky.com/story/best-and-worst-nhs-trusts-for-cancer-treatment-revealed-13511572",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-hospital-nhs_7173868.jpg?20260224161218",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-24 14:46:00",
        "Headline": "Just three of 119 acute trusts with comparable data met or exceeded the 85% target last year, new analysis of NHS England figures shows. ",
        "Content": "Almost all NHS trusts are missing a major cancer target - with some of the worst performers seeing only about half of patients on time, data shows. Figures analysed by the Press Association (PA) for 2025 show a wide variation among trusts in England, with some patients experiencing waits of more than 104 days. The NHS has a long-standing target for 85% of patients to wait no longer than 62 days from their cancer referral being received to beginning treatment. It has failed to do so at a national level since 2014. The government has also set an interim target of March 2026 for this figure to reach 75%. The new analysis of NHS England figures shows just three of 119 acute trusts with comparable data met or exceeded the 85% target last year, while only around a quarter reached above 75%. The three that did meet the 85% target in 2025 were: Calderdale and Huddersfield (89.2% of patients), Homerton Healthcare (85.8%), and Maidstone and Tunbridge Wells (85.7%). Percentage of patients in 2025 who began their first treatment for cancer within 62 days of an urgent referral; and (in brackets) percentage in 2024 who began their first treatment within 62 days, according to PA's analysis of data published by NHS England.  Calderdale and Huddersfield 89.2% (89.4%)\n\n Homerton Healthcare 85.8% (79.7%) Maidstone and Tunbridge Wells 85.7% (85.4%)\n\n East and North Hertfordshire 84.95% (85.2%) Ashford and St Peter's Hospitals 83.6% (83.4%) Guy's and St Thomas' 55.1% (47.7%)\n Queen Elizabeth Hospital, King's Lynn 54.2% \n Hull University Teaching Hospitals 53.1% (54.8%) Sheffield Teaching Hospitals 50.1% (50.7%) Mid and South Essex 45.4% (47.0%) Across England, 69.1% of patients (239,038 out of 345,847) started cancer treatment within 62 days last year, a slight increase from 67.7% (221,380 out of 327,221) in 2024, but short of the target. Some 65 of the 119 trusts saw a year-on-year rise in the percentage of patients seen within 62 days, while 54 saw a drop. Four trusts topped 85% in 2024 compared with three in 2025, with Calderdale and Huddersfield ranking highest in the list in both years. Read more from Sky News:Broadband rule means reader owed £2,000Dual nationals could be denied UK entry An NHS spokesman said: \"The NHS is seeing and treating record numbers of patients for cancer, with more than three quarters of people receiving a diagnosis or all clear within four weeks, but there are still too many people experiencing unacceptably long waits for their first treatment. \"Our landmark National Cancer Plan sets out a clear roadmap to ensuring we are meeting all three cancer standards to see and treat patients on time over the next three years, with further improvements to make care more personalised and significantly improve survival.\" Waits of more than 104 days PA analysis also shows that in a handful of trusts, at least one in seven patients who started cancer treatment in December 2025 had been waiting more than 104 days since an urgent referral. At University Hospitals of Leicester, 13.7% of patients starting treatment in December had waited this long, as well as 14.5% of patients at Queen Elizabeth Hospital King's Lynn, 14.9% at Sheffield Teaching Hospitals and 15.5% at Guy's and St Thomas'. The proportion was as high as one in six patients at Hull University Teaching Hospitals (16.5%) and Mid and South Essex (17.0%). Trusts looking to 'turn this around' Kirsten Major, chief executive of Sheffield Teaching Hospitals, said: \"We previously had some of the best cancer waiting times, so we are concerned about the drop in performance and the impact on our patients. \"This is one of our top three priorities and as such, we have already taken actions to turn this around, including additional clinics and diagnostic capacity and changes to improve and speed up the care that we provide.\" She said the trust is \"now seeing a consistent improvement in cancer waiting times each month\". A spokeswoman for Guy's & St Thomas' said \"improving how quickly people can access our services is a key priority for the trust\", adding: \"While we have made progress in the past year, we recognise that further improvement is required, and we are ambitious about how quickly we can do this.\""
    },
    {
        "title": "'We decided to stand up to a bully,' says Ukrainian who swapped Wall Street for the frontline",
        "description": "A medic who gave up a promising  Wall Street career on to serve on the frontlines in Ukraine has told Sky News it was the \"easiest decision she ever made\".",
        "url": "https://news.sky.com/story/we-decided-to-stand-up-to-a-bully-says-ukrainian-who-swapped-wall-street-for-the-frontline-13511695",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-viktoriia-honcharuk_7174091.jpg?20260224201451",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-24 19:49:00",
        "Headline": "Viktoriia Honcharuk was \"living the American dream\". But when Russia invaded in 2022 she decided return home as a warzone medic, despite her fear of blood and needles.",
        "Content": "A medic who gave up a promising  Wall Street career on to serve on the frontlines in Ukraine has told Sky News it was the \"easiest decision she ever made\". Viktoriia Honcharuk said she was \"living the American dream\" with a fledgling career in investment banking when Russia launched its full-scale invasion of Ukraine in February 2022 But seeing how her homeland resisted the advance of Putin's \"special military operation\", she was inspired to return home and take up a medical role on the frontline - despite her fear of blood and needles. Speaking to The World with Yalda Hakim, she said: \"Everything was quite good in my life, but then Russia attacked my country. My mum, my dad, my sister... they all joined the resistance as soon as they could. \"They said, look, we're not going to go anywhere... we're going to fight for our home, our town. And that was very admirable - that inspired me a lot. \"After a couple of months helping from far away, I said, well, I cannot also stand back. I cannot watch Russia, the biggest country in the world, attacking my country.\" Despite the misgivings of her friends in the US and even her own mother, Victoria made the decision to return home, and called her sister with some questions. \"She was like, why are you asking this? \"And I'm thinking: I'm ready to go back to Ukraine and I want to join the army, and it's going to be, I think, something in medicine. \"And she just took like five seconds. She said, 'okay, I'll put you in touch with the right people'.\" She added: \"A lot of people think it was a difficult decision to leave a good career, good life, and go back to Ukraine and go to the frontlines. \"But looking back... I think that is the easiest decision I ever made.\" After a \"couple of days of training\" Victoria was deployed to the frontlines, but she would not only be helping her countrymen. \"I was afraid of blood and needles before the invasion,\" she admitted. \"But, at that point I just realised this is something that needs to be done.\" Among the thousands of people she's treated, are Russian prisoners of war. She said: \"It's something that we have to do, right? I don't get to choose who I have to work with. \"We're following the Geneva Convention. We have to treat prisoners of war, Russians.\" She added: \"You get to speak with them... and understand that Russia is not going to stop where what they're doing right now. \"They are ready to go further and they are preparing for something bigger.\" Read more:Ukraine conflict: How Russia is marking four years of warUK and Ukraine respond to Moscow's 'absurd' nuclear bomb claim Viktoriia, who has now been painted by British artist Max Denison-Pender, believes it is the actions of ordinary Ukrainians that have staved off Russian domination. She said: \"If we were all to say 'this is not my war', I think Russia would be pushing through the rest of Europe at this point. \"But just because of this, like men and women in Ukraine have decided to stand up to a bully and join the resistance.\""
    },
    {
        "title": "Police failed to arrest Nottingham triple killer on warrant months before attacks, inquiry hears",
        "description": "Police failed to execute a warrant to arrest a violent schizophrenic before he went on to kill three people in Nottingham, an inquiry has heard.",
        "url": "https://news.sky.com/story/police-failed-to-arrest-nottingham-triple-killer-on-warrant-months-before-attacks-inquiry-hears-13511713",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-grace-kumar-barnaby-webber_6553532.jpg?20240514090950",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-24 20:47:00",
        "Headline": "The arrest warrant was issued more than nine months before the killings in September 2022, after Valdo Calocane did not attend a hearing at Nottingham Magistrates Court after being accused of assaulting an emergency worker.",
        "Content": "Police failed to execute a warrant to arrest a violent schizophrenic before he went on to kill three people in Nottingham, an inquiry has heard. Valdo Calocane killed University of Nottingham students Barnaby Webber and Grace O'Malley-Kumar, both 19, as well as 65-year-old caretaker Ian Coates, and attempted to kill three more people in the June 2023 attacks. The arrest warrant was issued more than nine months before the killings in September 2022, after Calocane did not attend a hearing at Nottingham Magistrates' Court over accusations of assaulting an emergency worker. He went on to assault two colleagues at a factory in Kegworth, Leicestershire, a month before the attacks, but was not arrested by Leicestershire Police at that time. In an opening statement on behalf of the relatives of those killed in the attacks, Tim Moloney KC said any attempt by police to claim arresting Calocane would not have made a difference would be \"cowardly, highly offensive and insulting\". \"If the police do say that executing a warrant for his arrest would have made no difference, then the people of Nottinghamshire and Leicestershire have a lot to worry about in relation to who is keeping them safe,\" he added. John Beggs KC, representing Nottinghamshire Police in the inquiry, said the force should have executed the warrant in a \"timely manner\" but \"they failed to do so at all\". Mr Beggs added: \"The temporary deputy chief constable [Rob] Griffin described that failure in his statement as, I quote, a serious, systemic, operational failure on the part of Nottinghamshire Police. \"He recognised the seriousness of what happened, or rather, what didn't happen, and the distress it caused. He offered, and we repeat, an unreserved apology to the families of the deceased and the survivors.\" Mr Beggs asked the chair of the inquiry to consider whether it is realistic Calocane would have been prosecuted, convicted and imprisoned at that time while he was suffering with mental illness. Read more:Nottingham attack survivor demands 'someone take the blame'Killer allowed to avoid vital medication because of 'fear of needles' Mr Beggs said Nottinghamshire Police believe the force \"did their reasonable best\" to manage 10-11 incidents with Calocane before the killings, which were \"mostly responding to relatively low-level complaints of antisocial behaviour\". He said the incidents, one of which saw Calocane put a university flatmate into a headlock and caused a woman to jump out of her window, were not \"in any way unusual or remarkable for the police to have to deal with\". He said paranoid schizophrenia is not a condition police officers are trained to manage and added: \"Society's answers to these public safety risks, posed by some paranoid schizophrenics, lie principally not with the police, but with the NHS and other clinical services, where judicious use of the mental health legislation may be required.\" Hugh Davies KC, representing two Leicestershire Police officers who attended the incident at the warehouse weeks before the fatal stabbings, said an officer did not view records of Calocane's previous encounters with police, but if she had done so \"she would have been able to discover that VC [Valdo Calocane] had an outstanding warrant for his arrest\". Mr Davies added: \"The officers have accepted these shortcomings candidly. On behalf of Leicestershire Police, the chief constable apologises for these shortcomings.\" Calocane admitted manslaughter by diminished responsibility and attempted murder and was sentenced to an indefinite hospital order in January 2024. The inquiry will hear evidence until June this year and the chair will produce a report and provide recommendations in 2027."
    },
    {
        "title": "Some of Putin's most potent weapons are hiding in plain sight - in the English Channel",
        "description": "In the English Channel, less than two hours by fishing boat from Dover, some of the most potent weapons in Russia's war on Ukraine are hiding in plain sight.",
        "url": "https://news.sky.com/story/some-of-putins-most-potent-weapons-are-hiding-in-plain-sight-in-the-english-channel-13511518",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-kousai-shadow-fleet_7174046.jpg?20260224190840",
        "type": "UK",
        "Author": "Paul Kelso",
        "Date Published": "2026-02-24 12:56:00",
        "Headline": "As tankers carrying hundreds of millions of dollars worth of Russian oil pass through British waters, a Sky News expert warns we are heading for \"militarised confrontation at sea\".",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n In the English Channel, less than two hours by fishing boat from Dover, some of the most potent weapons in Russia's war on Ukraine are hiding in plain sight. On a misty February morning midway between Britain and France, we watch tankers carrying Russian oil worth around $100m (£74.1m) cruise past in defiance of Western sanctions, embargoes, and price caps. Dozens of these vessels pass through the Channel every month, part of a \"shadow fleet\" of up to 800 vessels that have kept the oil revenues that fund the war on Ukraine flowing. This week, the UK government announced fresh sanctions against the Russian oil trade but the evidence of a day on the water is that the shadow fleet operates with apparent impunity, right under the nose of Kyiv's allies. Russian tankers a 'routine sight' Our skipper, Matt Coker, usually takes sea fishing parties out on the Portia, but we were after a bigger catch; three vessels in the shadow fleet carrying oil from Russia's Baltic ports. He says they are a routine sight in the world's busiest shipping lane: \"When you see these Russian ships and these oil tankers, you know, it's a regular occurrence. To be honest, no one really takes any notice.\" We had tracked the tankers - the Rigel, the Hyperion and the Kousai - from the Gulf of Finland, where they had been loaded with oil at Russian Baltic ports, to intercept them as they passed the narrowest point of the Dover Straits. Up close in a rising swell, the scale of the vessels is unavoidable, and each one tells a story about both the impact and the limits of Western action. The Rigel, a Suezmax-class tanker, is more than 270 metres long and fills the near horizon as it emerges from the mist. With a capacity of one million barrels, its cargo of oil, loaded a week earlier at Primorsk, is worth around $55m (£40.7m). It is sailing under a Cameroon flag, owned and managed by a company in the Seychelles, and sanctioned by the EU, UK and Canada, among others. That prevents it from using port facilities in any of the sanctioning countries, but not from heading to its next known stop, Port Said at the head of the Suez Canal. We cannot know where its oil will be unloaded, but since the invasion of Ukraine, the bulk of Russian oil has been sold to China and India, at a significant discount. Next to appear is the Hyperion, sanctioned by the UK, EU and US, and sailing under a Russian flag with its name marked on the bow in Cyrillic. The flag switching tactic As recently as December, it was sailing under a Sierra Leone flag when, after making a delivery to Venezuela, it switched flags and evaded the US naval blockade in the Caribbean. Switching flags is a routine tactic in the shadow fleet, opaque ownership is common, and insurance cover is often unclear, a serious concern given many of the vessels are ageing and poorly maintained. The US has taken direct military action against tankers in the shadow fleet linked to Venezuela, with at least seven seized since last year, the most recently in the Indian Ocean on Tuesday. French paramilitaries also seized a vessel in the Mediterranean last month, but despite the almost daily passage of shadow tankers through the Channel, direct British interventions so far have focused on insurance. As we watch the passage of our third sanctioned tanker, the Kousai, we overhear a message from the coastguard to its captain on the open VHF radio channel, demanding proof of insurance. The captain is asked to email documentation to a government email address within 24 hours. We do not hear the Kousai's response, and in a matter of minutes, it too has passed. A reaction to sanctions Sanctions against Russia's oil industry have had an impact, reducing the value of Russian oil if not the volumes that it moves. The growth of the shadow fleet itself is a market response to tightening sanctions. With the majority of western-controlled tankers and associated marine services beyond Russia's reach, it turned to an ad-hoc, opaque collection of older vessels to move oil, often covertly. \"Over 60% of Russian crude is being exported on the shadow fleet,\" says Pamela Munger, head of European market analysis for energy analysts Vortexa. \"You have more vessels that need to be in the chain. Let's say a sanctioned vessel loads Russian crude and let's say it's on its way to China. \"It could make up to five, six, seven ship-to-ship transfers along the way in order to disguise the origin of the crude and move it on to… Non-sanctioned vessels, which it will eventually discharge into its end buyer.\" Data from the Centre for Research on Energy and Clean Air shows that the number of vessels in the shadow fleet grew following sanctions but the volume of oil being moved remained constant, even as hundreds of vessels were sanctioned directly. Impact on the oil market Prices have fallen, however, with Russian oil now competing with Iranian and Venezuelan crude in the \"distressed\" sanctioned oil market, cutting Kremlin revenues as a result. \"Russia has had to discount those crude oil cargoes in a very big way,\" says David Fyfe, chief economist at commodity price specialists Argus Media. \"In 2021, Urals, the primary export grade of Russian crude, was pricing two to three dollars below North Sea Brent. As we speak in February, Urals is loading in the Baltic ports at $27 below North Sea Brent.\" That price gap has cut Russia's oil revenues by around 25% year-on-year and by up to 50% in January alone, an economic impact the Kremlin cannot ignore. \"I think they'll take a fairly sizeable hit, particularly in revenues this year, and I'd expect, at the very least, something like a half-a-million barrel per day hit on volumes,\" says Mr Fyfe. Are we heading for a military confrontation? The squeeze could tighten further, with pressure for a more robust response from European nations, including the UK. Under maritime law, all vessels have the right of innocent passage as long as they are sailing under a legitimate flag, and many countries have continued to do business with Russia since the invasion of Ukraine. The UK government is understood to have examined the legal grounds for detaining Russian tankers, including under the Sanctions and Money Laundering Act. \"I think there must come a point at which Britain and its allies, the Dutch, and the Danes and the Norwegians and the seagoing nations of Northern Europe, they will get much tougher with these Russian ships, even if they're escorted,\" says Professor Michael Clarke, Sky News security and defence analyst. \"When that happens, I think we're heading probably sometime this year for some sort of militarised confrontation at sea.\" A Ministry of Defence spokesperson said it has requested insurance documents from more than 600 vessels, and that \"deterring, disrupting and degrading the Russian shadow fleet is a priority\". The owners of the Rigel, the Hyperion and the Kousai have been contacted for comment."
    },
    {
        "title": "Welcome to the fly-tipping capital of England, where locals are 'embarrassed' to live",
        "description": "It's hard to believe the London Borough of Brent was once covered in even more rubbish than it is now.&#160;",
        "url": "https://news.sky.com/story/welcome-to-the-fly-tipping-capital-of-england-where-locals-are-embarrassed-to-live-13511693",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-fly-tipping-brent_7174075.jpg?20260224200629",
        "type": "UK",
        "Author": "Victoria Seabrook",
        "Date Published": "2026-02-24 19:46:00",
        "Headline": "Sky News has spent time with a squad of enforcement officers tasked with tracking down fly-tippers. It's a game of cat and mouse as they walk the streets of Brent, London, looking for clues.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n It's hard to believe the London Borough of Brent was once covered in even more rubbish than it is now.  Although the gleaming arch of Wembley Stadium is sometimes just a few steps away, its residential streets are a patchwork of filth. Whether it's a sea of bottles right by the very sign for the recycling centre, a hollowed-out sofa sagging against a brick wall or a TV just feet from (but not in) the communal dustbin, Brent is covered in, well, crap. \"It's like a dump,\" says Robert Hall, who has lived there all the 60-odd years of his life. His neighbourhood has become an obstacle course of dumped cars, rubbish, and mattresses. It might sound like he's exaggerating, but on my 20-minute walk over from Wembley Park Tube, I see a fridge, TV, pet cage and countless bags of rubbish. \"It's an eyesore. I'm embarrassed to have people visit,\" he adds. And it's just as well, because it turns out his friends have told him they don't like coming to see him any more anyway. An unenviable crown  Brent recently earned the unenviable title of fly-tipping capital of England, after recording 35,000 incidents in a single year. It's a stain Brent Council is slowly managing to scrub away, thanks to its zealous squad of enforcement officers tasked with tracking down the culprits. \"It's important to take pride in what you do,\" says Anca Pricop, enforcement patrol supervisor at Brent Council. \"It might not seem a very nice job, but it is satisfying when you catch people.\" Following the paper trail  \"We're little detectives,\" she says, having donned two layers of gloves and attacked a pile of black bin bags with gusto. All make-up, high ponytail and painted silver nails, she brings remarkable glamour to a decidedly grimy job. Elbows-deep in someone else's filth, she starts to piece together 1sq cm of torn-up pieces of paper. \"You can clearly see there was a delivery label inside.\" But to her dismay, no smoking gun this time. The household went to \"a lot of trouble just to rip [the label] and for us not to be able to find [the address]\". Her luck shifts a few streets away, where a mound of household waste is spilling out of a phone box. Anca combs through the papers inside. Bingo: a box of medicine with a prescription label still intact. \"We have a name,\" she says. Earlier that week her team seized a van they'd caught fly-tipping by tracing the rubbish back to the vehicle. She says many people don't realise the onus is on them to check whether the people offering to take away their waste for a good fee actually have a licence to do so. \"More often than not it will get dumped - on the same street sometimes.\" If caught by Anca, the households will get slapped with a fine. A national 'epidemic' Thanks to the inspections like this, plus new \"community skips\", Brent Council says it's getting a grip on fly-tipping, inching its way down the league table. But nationally, the figures have barely budged from around the one million incidents a year mark. New statistics for 2024-2025, due later on Wednesday, are predicted to show that the tide of rubbish is nowhere near receding. Read more from Sky News:Sky correspondent's car attackedSwapping Wall Street for the frontline The figures are also thought to be only the tip of the iceberg, as they exclude cases on private land like farms and National Trust estates. The data also shows how few cases result in fines or prosecutions. Campaigners at Clean Up Britain accuse local and central governments of failing to enforce the law, or to show that fly-tippers will be caught. It wants stronger enforcement and maximum fines of £20,000. The government says it is \"determined to stop\" criminals and is \"giving authorities the tools they need to fight back\". A spokesperson told Sky News \"councils have the power to crush their vans - leaving waste criminals with nowhere left to hide\". Fast-forward a few days from Brent, and we are filming at a recycling facility in Wokingham, where the van seized by Brent Council will be crushed. That’s the image the councils and government want you to see: perpetrators caught and published. But for now, for most cases, that is far from the truth."
    },
    {
        "title": "Best and worst NHS trusts for cancer treatment revealed",
        "description": "Almost all NHS trusts are missing a major cancer target - with some of the worst performers seeing only about half of patients on time, data shows.",
        "url": "https://news.sky.com/story/best-and-worst-nhs-trusts-for-cancer-treatment-revealed-13511572",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-hospital-nhs_7173868.jpg?20260224161218",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-24 14:46:00",
        "Headline": "Just three of 119 acute trusts with comparable data met or exceeded the 85% target last year, new analysis of NHS England figures shows. ",
        "Content": "Almost all NHS trusts are missing a major cancer target - with some of the worst performers seeing only about half of patients on time, data shows. Figures analysed by the Press Association (PA) for 2025 show a wide variation among trusts in England, with some patients experiencing waits of more than 104 days. The NHS has a long-standing target for 85% of patients to wait no longer than 62 days from their cancer referral being received to beginning treatment. It has failed to do so at a national level since 2014. The government has also set an interim target of March 2026 for this figure to reach 75%. The new analysis of NHS England figures shows just three of 119 acute trusts with comparable data met or exceeded the 85% target last year, while only around a quarter reached above 75%. The three that did meet the 85% target in 2025 were: Calderdale and Huddersfield (89.2% of patients), Homerton Healthcare (85.8%), and Maidstone and Tunbridge Wells (85.7%). Percentage of patients in 2025 who began their first treatment for cancer within 62 days of an urgent referral; and (in brackets) percentage in 2024 who began their first treatment within 62 days, according to PA's analysis of data published by NHS England.  Calderdale and Huddersfield 89.2% (89.4%)\n\n Homerton Healthcare 85.8% (79.7%) Maidstone and Tunbridge Wells 85.7% (85.4%)\n\n East and North Hertfordshire 84.95% (85.2%) Ashford and St Peter's Hospitals 83.6% (83.4%) Guy's and St Thomas' 55.1% (47.7%)\n Queen Elizabeth Hospital, King's Lynn 54.2% \n Hull University Teaching Hospitals 53.1% (54.8%) Sheffield Teaching Hospitals 50.1% (50.7%) Mid and South Essex 45.4% (47.0%) Across England, 69.1% of patients (239,038 out of 345,847) started cancer treatment within 62 days last year, a slight increase from 67.7% (221,380 out of 327,221) in 2024, but short of the target. Some 65 of the 119 trusts saw a year-on-year rise in the percentage of patients seen within 62 days, while 54 saw a drop. Four trusts topped 85% in 2024 compared with three in 2025, with Calderdale and Huddersfield ranking highest in the list in both years. Read more from Sky News:Broadband rule means reader owed £2,000Dual nationals could be denied UK entry An NHS spokesman said: \"The NHS is seeing and treating record numbers of patients for cancer, with more than three quarters of people receiving a diagnosis or all clear within four weeks, but there are still too many people experiencing unacceptably long waits for their first treatment. \"Our landmark National Cancer Plan sets out a clear roadmap to ensuring we are meeting all three cancer standards to see and treat patients on time over the next three years, with further improvements to make care more personalised and significantly improve survival.\" Waits of more than 104 days PA analysis also shows that in a handful of trusts, at least one in seven patients who started cancer treatment in December 2025 had been waiting more than 104 days since an urgent referral. At University Hospitals of Leicester, 13.7% of patients starting treatment in December had waited this long, as well as 14.5% of patients at Queen Elizabeth Hospital King's Lynn, 14.9% at Sheffield Teaching Hospitals and 15.5% at Guy's and St Thomas'. The proportion was as high as one in six patients at Hull University Teaching Hospitals (16.5%) and Mid and South Essex (17.0%). Trusts looking to 'turn this around' Kirsten Major, chief executive of Sheffield Teaching Hospitals, said: \"We previously had some of the best cancer waiting times, so we are concerned about the drop in performance and the impact on our patients. \"This is one of our top three priorities and as such, we have already taken actions to turn this around, including additional clinics and diagnostic capacity and changes to improve and speed up the care that we provide.\" She said the trust is \"now seeing a consistent improvement in cancer waiting times each month\". A spokeswoman for Guy's & St Thomas' said \"improving how quickly people can access our services is a key priority for the trust\", adding: \"While we have made progress in the past year, we recognise that further improvement is required, and we are ambitious about how quickly we can do this.\""
    },
    {
        "title": "Mandelson's lawyers say his arrest due to 'baseless' flight risk claim",
        "description": "Peter Mandelson's lawyers have said claims he was arrested because he was a flight risk are \"baseless\".",
        "url": "https://news.sky.com/story/mandelsons-lawyers-say-his-arrest-due-to-baseless-flight-risk-claim-13511718",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/9c8b9074f05e9dcbf8a97edc95fd55e3d833336d968b7f58e3973276bccde47e_7173025.jpg?20260223171028",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-24 20:52:00",
        "Headline": "Sky News understands police detained the peer because they had been told he was preparing to flee the UK for the British Virgin Islands.",
        "Content": "Peter Mandelson's lawyers have said claims he was arrested because he was a flight risk are \"baseless\". The former Labour peer was detained on Monday under suspicion of misconduct in public office, and released later the same evening. Sky News understands the Metropolitan Police arrested him because they had been told he was preparing to flee the UK for the British Virgin Islands. They had originally planned to interview Mandelson, 72, under caution, without arrest in a fortnight's time. It is understood that going through devices obtained from searching his two homes in Camden, north London, and Wiltshire, was proving very time-consuming. But after police conducted a series of interviews about the flight risk claims they decided they needed to arrest him this week. Mandelson has denied any wrongdoing. Mishcon de Rey, lawyers for the former British ambassador to the US, said: \"Peter Mandelson was arrested yesterday despite an agreement with the police that he would attend an interview next month on a voluntary basis. \n                  Mandelson's 'vile' Epstein emails make me 'angry', Foreign Secretary Yvette Cooper says\n                 \n                  Mandelson arrested as Trump attacks Supreme Court \n                 \n                  Mandelson's assistant sent Epstein government speech before it was delivered\n                 \"The arrest was prompted by a baseless suggestion that he was planning to leave the country and take up permanent residence abroad. \"There is absolutely no truth whatsoever in any such suggestion. \"We have asked the MPS for the evidence relied upon to justify the arrest. Peter Mandelson's overriding priority is to cooperate with the police investigation, as he has done throughout this process, and to clear his name.\" Lord Mandelson was bailed in the early hours of Tuesday morning after about eight hours of questioning. It is not clear if he had to surrender his passport, but that is usually a condition of bail in such cases. Read more: Mandelson's 'vile' Epstein emails make me 'angry', foreign sec says He was sacked as ambassador in September after details emerged about his continued contact with disgraced paedophile Jeffrey Epstein. Mandelson then resigned from the House of Lords in early February amid growing public and political scrutiny after the US Department of Justice's latest publication of Epstein files last month."
    },
    {
        "title": "Police failed to arrest Nottingham triple killer on warrant months before attacks, inquiry hears",
        "description": "Police failed to execute a warrant to arrest a violent schizophrenic before he went on to kill three people in Nottingham, an inquiry has heard.",
        "url": "https://news.sky.com/story/police-failed-to-arrest-nottingham-triple-killer-on-warrant-months-before-attacks-inquiry-hears-13511713",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-grace-kumar-barnaby-webber_6553532.jpg?20240514090950",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-24 20:47:00",
        "Headline": "The arrest warrant was issued more than nine months before the killings in September 2022, after Valdo Calocane did not attend a hearing at Nottingham Magistrates Court after being accused of assaulting an emergency worker.",
        "Content": "Police failed to execute a warrant to arrest a violent schizophrenic before he went on to kill three people in Nottingham, an inquiry has heard. Valdo Calocane killed University of Nottingham students Barnaby Webber and Grace O'Malley-Kumar, both 19, as well as 65-year-old caretaker Ian Coates, and attempted to kill three more people in the June 2023 attacks. The arrest warrant was issued more than nine months before the killings in September 2022, after Calocane did not attend a hearing at Nottingham Magistrates' Court over accusations of assaulting an emergency worker. He went on to assault two colleagues at a factory in Kegworth, Leicestershire, a month before the attacks, but was not arrested by Leicestershire Police at that time. In an opening statement on behalf of the relatives of those killed in the attacks, Tim Moloney KC said any attempt by police to claim arresting Calocane would not have made a difference would be \"cowardly, highly offensive and insulting\". \"If the police do say that executing a warrant for his arrest would have made no difference, then the people of Nottinghamshire and Leicestershire have a lot to worry about in relation to who is keeping them safe,\" he added. John Beggs KC, representing Nottinghamshire Police in the inquiry, said the force should have executed the warrant in a \"timely manner\" but \"they failed to do so at all\". Mr Beggs added: \"The temporary deputy chief constable [Rob] Griffin described that failure in his statement as, I quote, a serious, systemic, operational failure on the part of Nottinghamshire Police. \"He recognised the seriousness of what happened, or rather, what didn't happen, and the distress it caused. He offered, and we repeat, an unreserved apology to the families of the deceased and the survivors.\" Mr Beggs asked the chair of the inquiry to consider whether it is realistic Calocane would have been prosecuted, convicted and imprisoned at that time while he was suffering with mental illness. Read more:Nottingham attack survivor demands 'someone take the blame'Killer allowed to avoid vital medication because of 'fear of needles' Mr Beggs said Nottinghamshire Police believe the force \"did their reasonable best\" to manage 10-11 incidents with Calocane before the killings, which were \"mostly responding to relatively low-level complaints of antisocial behaviour\". He said the incidents, one of which saw Calocane put a university flatmate into a headlock and caused a woman to jump out of her window, were not \"in any way unusual or remarkable for the police to have to deal with\". He said paranoid schizophrenia is not a condition police officers are trained to manage and added: \"Society's answers to these public safety risks, posed by some paranoid schizophrenics, lie principally not with the police, but with the NHS and other clinical services, where judicious use of the mental health legislation may be required.\" Hugh Davies KC, representing two Leicestershire Police officers who attended the incident at the warehouse weeks before the fatal stabbings, said an officer did not view records of Calocane's previous encounters with police, but if she had done so \"she would have been able to discover that VC [Valdo Calocane] had an outstanding warrant for his arrest\". Mr Davies added: \"The officers have accepted these shortcomings candidly. On behalf of Leicestershire Police, the chief constable apologises for these shortcomings.\" Calocane admitted manslaughter by diminished responsibility and attempted murder and was sentenced to an indefinite hospital order in January 2024. The inquiry will hear evidence until June this year and the chair will produce a report and provide recommendations in 2027."
    },
    {
        "title": "European leaders came together in solidarity on Ukraine war fourth anniversary - but peace seems a long way off",
        "description": "Watching President Zelenskyy and first lady Olena Zelenska in the centre of Kyiv lead a minute's silence to honour the tens of thousands of soldiers who have died on the fourth anniversary of the Ukraine war was a sobering moment.&#160;",
        "url": "https://news.sky.com/story/european-leaders-came-together-in-solidarity-on-ukraine-war-fourth-anniversary-but-peace-seems-a-long-way-off-13511729",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-ukraine-lviv_7173479.jpg?20260224083346",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2026-02-24 21:34:00",
        "Headline": "Beth Rigby joined Foreign Secretary Yvette Cooper in Kyiv on the fourth anniversary of Russia's invasion of Ukraine.",
        "Content": "\n          Political editor\n              @BethRigby\n Watching President Zelenskyy and first lady Olena Zelenska in the centre of Kyiv lead a minute's silence to honour the tens of thousands of soldiers who have died on the fourth anniversary of the Ukraine war was a sobering moment.  European prime ministers and dignitaries had come to Maidan Square in Kyiv as an act of solidarity and remembrance as they set candles in front of the sea of crosses, photos, and flags that now adorn this makeshift memorial for those killed in this conflict. But equally, there is an acknowledgement from those gathered that when it comes to this war, there is no end in sight: the leaders who arrived in Ukraine to mark this anniversary expect to be coming back next year, too. For Yvette Cooper, the foreign secretary, the trip was a moment to focus not just on sanctions, weapon supplies and territory, but to try to highlight the war Vladimir Putin is waging against women and children in Ukraine as he wages a \"war on Ukrainian culture\". \"I think one of the things that's been clearly happening, the way that so many children have been stolen, the ways in which, in the temporarily occupied territories, they are trying to change the education system, trying to choke out the Ukrainian language,\" she said. \"It's an attempt really, not just about territory, but to have a war on Ukrainian families, to have war on Ukraine history and culture and identity.\" But even as she arrived in Ukraine, issues at home plaguing the government and her foreign office brief were dominating the agenda, with the former US ambassador that she sacked, Peter Mandelson, arrested and taken in for hours of questioning by the police as Ms Cooper took an overnight train to Ukraine. The foreign secretary, who sacked the ambassador just days into her job in September, reiterated her position that Lord Mandelson \"should never have been appointed\" and, in a rare flash of emotion, told me that \"vile\" emails were exchanged between Lord Mandelson and paedophile financier Jeffrey Epstein. In one of the emails released by the US Department of Justice, Epstein replies to Lord Mandelson asking how being free from jail felt, by saying \"she feels fresh, firm and creamy\". Lord Mandelson replied by calling Epstein a \"naughty boy\". \"That's just vile,\" she told me. \"It makes me feel so angry.\" \"I've been really clear, Peter Mandelson should never have been appointed as ambassador to the US and I think some of what has been so, so deeply frustrating about all of this is that really at the heart of all of these should be the victims of Epstein, they're women and children who faced the most horrendous criminal exploitation trafficking and that really should be the focus. \"As you know, when I was home secretary, I made it a mission for the government to halve violence against women and girls over the next 10 years. \"That's a strategy now that the prime minister has championed. And now, as foreign secretary, I am making tackling violence against women and girls something that is an international theme for us as well.\" Putin's 'genocidal intent' On that issue, Ms Cooper used her time in Ukraine to meet female victims of Russian aggression and sexual violence and the \"voices for children\" charity with Olena Zelenska to highlight the plight of thousands of children stolen from their Ukrainian families by Russia. Yevgen Zakharov, a civil rights activist working at the Civil Liberties Centre, told the foreign secretary on her visit there that Putin \"wants to eliminate Ukrainian identity\". \"This is his crazy idea, a genocidal intent is there,\" he said. Throughout these visits, we heard stories of women in Russian-occupied territory being beaten, sexually abused, falsely imprisoned and sent to Labour camps. Elena Jagapova spoke of how she was taped to a chair, beaten until bloodied, sexually abused and sent to a labour camp. Another, Julia, told us of how her children - then 10 and 17 - were abducted by the Russians, and her 19-month battle to get them back. Ms Zelenska says more than 20,000 Ukrainian children have been stolen by the Russians as part of their campaign to eradicate Ukrainian culture, through repressing the language, forcing indoctrination and trying to brainwash children. \"We heard stories not just of torture, but also of this attempt to really destroy Ukrainian culture and identity as well,\" said Ms Cooper. \"That's why it's so important that we provide support for Ukrainian families, support for Ukrainian services but, also, make sure that you could have the kind of special tribunal, the kind of court processes, international court processes, that can pursue exactly those questions and can make sure that there is some justice and accountability.\" No end in sight… The UK has made it clear to Ukraine that it will play a part in helping set up war crime courts when this conflict finally ends, in echoes of Britain's role in the Nuremberg trials that punctuated the Second World War. But when that moment comes is hard to see. Those who gathered in Ukraine on Tuesday did so with a weariness that has come to characterise an attritional war in which Russia isn't winning, but neither is it defeated, as Europe and the US give enough support for Ukraine to fight on, without the firepower - or sanctions against Russia - for it to truly succeed. Mr Zelenskyy warned on the eve of the fourth anniversary that Putin had already started World War Three and Ukraine was the outpost, the frontline pushing Putin back. Ms Cooper doesn't want to use that language, but she does acknowledge that Russian aggression is here to stay, and allies must support Ukraine for however long it takes. To that end, the UK introduced another sanctions package on Tuesday, and is pushing the US and Europe about a maritime services ban to make it much harder for Russia's shadow fleet to transport Russian oil. The frustration is that the US, in trying to pursue peace talks - and reportedly in favour of Russian demand that Ukraine cede the 20% of the Donbas territory not under Russian occupation as part of any truce, is reluctant to squeeze Russia economically right now. …but a glimmer of hope So this war grinds on. For the Ukrainians and allies, one glimmer of hope is that Russia is now losing more men that it can mobilise on the battlefield. Ukraine hopes that if it can increase the casualty rate to 50,000 Russians a month, then Putin might be forced to consider conscription, which could prove politically difficult and begin to stall his momentum. That Russia has sacrificed an estimated 500,000 lives in order to gain less than one per cent of Ukraine's territory tells of the attritional war in which these two sides are locked - and with the horrific loss of life. In the meantime, Britain and Europe will try to put more pressure on the US to bring in more aggressive sanctions against Russia, to financially starve Putin's war machine. But for all the signs of solidarity on Tuesday, there is little to show in the way of concrete steps to peace. Ukraine hopes for a game changer in the coming months, but is reconciled to more anniversaries like today."
    },
    {
        "title": "British cousins charged with attempted murder over Venice Valentine's Day stabbing",
        "description": "Two British cousins have been arrested and charged with attempted murder over a stabbing on Valentine's Day in Venice.",
        "url": "https://news.sky.com/story/british-cousins-charged-with-attempted-murder-over-venice-valentines-day-stabbing-13511662",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-venice-polizia-di-stato_7173997.png?20260224181737",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-24 18:00:00",
        "Headline": "The suspects, aged 19 and 21, are alleged to have stabbed a 22-year-old local man in the neck in a cocktail bar, police say.",
        "Content": "Two British cousins have been arrested and charged with attempted murder over a stabbing on Valentine's Day in Venice. Italian police said the men, aged 19 and 21, had been charged with stabbing a 22-year-old local man in the neck on the even of 14 February at a bar in the city's historic centre. The victim reportedly come close to bleeding to death, after the incident outside La Bussola Cocktail Lar near the Rialto Bridge. Police say they think it was sparked by a \"trivial disagreements\". They believe the knife may have been thrown into the water, with state police diving units searching the Grand Canal in Venice's centre to find the alleged weapon. The 19-year-old is alleged to be the perpetrator and the 21-year-old the suspected accomplice, Italy's Polizia Di Stato said in a statement. \"Officers from the Venice Flying Squad, coordinated by the local prosecutor's office, arrested two British nationals, aged 19 and 21,\" the police said. \"They are believed to be responsible for the attempted murder of a 22-year-old man, which occurred on Valentine's Day in the historic centre.\" \n                  'Britain's youngest female double murderer' approved for open prison move\n                 \n                  Charles Bronson: Britain's 'most notorious prisoner' pledges to 'expose unlawful sentence' ahead of parole hearing\n                 \n                  Man jailed after starving dogs to death at 'rehoming' centre in Essex\n                 They added: \"According to investigations, the motive appears to be trivial disagreements between young people, which escalated into violence over trivial matters\". Read more from Sky News:Briton among 19 dead in Nepal bus crashCall for probe into virus that killed 72 tigers in Thailand The police said the two men had been in Italy on holiday since the end of January, with return tickets booked. The arrests came after a search lasting more than a week. Police say the cousins were found in an apartment that belonged to an Italian relative of one of the men, in Venice city centre. The operation to locate them was supported by wiretaps, electronic surveillance, the monitoring of social media profiles and the exchange of information with British authorities."
    },
    {
        "title": "Some of Putin's most potent weapons are hiding in plain sight - in the English Channel",
        "description": "In the English Channel, less than two hours by fishing boat from Dover, some of the most potent weapons in Russia's war on Ukraine are hiding in plain sight.",
        "url": "https://news.sky.com/story/some-of-putins-most-potent-weapons-are-hiding-in-plain-sight-in-the-english-channel-13511518",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-kousai-shadow-fleet_7174046.jpg?20260224190840",
        "type": "World",
        "Author": "Paul Kelso",
        "Date Published": "2026-02-24 12:56:00",
        "Headline": "As tankers carrying hundreds of millions of dollars worth of Russian oil pass through British waters, a Sky News expert warns we are heading for \"militarised confrontation at sea\".",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n In the English Channel, less than two hours by fishing boat from Dover, some of the most potent weapons in Russia's war on Ukraine are hiding in plain sight. On a misty February morning midway between Britain and France, we watch tankers carrying Russian oil worth around $100m (£74.1m) cruise past in defiance of Western sanctions, embargoes, and price caps. Dozens of these vessels pass through the Channel every month, part of a \"shadow fleet\" of up to 800 vessels that have kept the oil revenues that fund the war on Ukraine flowing. This week, the UK government announced fresh sanctions against the Russian oil trade but the evidence of a day on the water is that the shadow fleet operates with apparent impunity, right under the nose of Kyiv's allies. Russian tankers a 'routine sight' Our skipper, Matt Coker, usually takes sea fishing parties out on the Portia, but we were after a bigger catch; three vessels in the shadow fleet carrying oil from Russia's Baltic ports. He says they are a routine sight in the world's busiest shipping lane: \"When you see these Russian ships and these oil tankers, you know, it's a regular occurrence. To be honest, no one really takes any notice.\" We had tracked the tankers - the Rigel, the Hyperion and the Kousai - from the Gulf of Finland, where they had been loaded with oil at Russian Baltic ports, to intercept them as they passed the narrowest point of the Dover Straits. Up close in a rising swell, the scale of the vessels is unavoidable, and each one tells a story about both the impact and the limits of Western action. The Rigel, a Suezmax-class tanker, is more than 270 metres long and fills the near horizon as it emerges from the mist. With a capacity of one million barrels, its cargo of oil, loaded a week earlier at Primorsk, is worth around $55m (£40.7m). It is sailing under a Cameroon flag, owned and managed by a company in the Seychelles, and sanctioned by the EU, UK and Canada, among others. That prevents it from using port facilities in any of the sanctioning countries, but not from heading to its next known stop, Port Said at the head of the Suez Canal. We cannot know where its oil will be unloaded, but since the invasion of Ukraine, the bulk of Russian oil has been sold to China and India, at a significant discount. Next to appear is the Hyperion, sanctioned by the UK, EU and US, and sailing under a Russian flag with its name marked on the bow in Cyrillic. The flag switching tactic As recently as December, it was sailing under a Sierra Leone flag when, after making a delivery to Venezuela, it switched flags and evaded the US naval blockade in the Caribbean. Switching flags is a routine tactic in the shadow fleet, opaque ownership is common, and insurance cover is often unclear, a serious concern given many of the vessels are ageing and poorly maintained. The US has taken direct military action against tankers in the shadow fleet linked to Venezuela, with at least seven seized since last year, the most recently in the Indian Ocean on Tuesday. French paramilitaries also seized a vessel in the Mediterranean last month, but despite the almost daily passage of shadow tankers through the Channel, direct British interventions so far have focused on insurance. As we watch the passage of our third sanctioned tanker, the Kousai, we overhear a message from the coastguard to its captain on the open VHF radio channel, demanding proof of insurance. The captain is asked to email documentation to a government email address within 24 hours. We do not hear the Kousai's response, and in a matter of minutes, it too has passed. A reaction to sanctions Sanctions against Russia's oil industry have had an impact, reducing the value of Russian oil if not the volumes that it moves. The growth of the shadow fleet itself is a market response to tightening sanctions. With the majority of western-controlled tankers and associated marine services beyond Russia's reach, it turned to an ad-hoc, opaque collection of older vessels to move oil, often covertly. \"Over 60% of Russian crude is being exported on the shadow fleet,\" says Pamela Munger, head of European market analysis for energy analysts Vortexa. \"You have more vessels that need to be in the chain. Let's say a sanctioned vessel loads Russian crude and let's say it's on its way to China. \"It could make up to five, six, seven ship-to-ship transfers along the way in order to disguise the origin of the crude and move it on to… Non-sanctioned vessels, which it will eventually discharge into its end buyer.\" Data from the Centre for Research on Energy and Clean Air shows that the number of vessels in the shadow fleet grew following sanctions but the volume of oil being moved remained constant, even as hundreds of vessels were sanctioned directly. Impact on the oil market Prices have fallen, however, with Russian oil now competing with Iranian and Venezuelan crude in the \"distressed\" sanctioned oil market, cutting Kremlin revenues as a result. \"Russia has had to discount those crude oil cargoes in a very big way,\" says David Fyfe, chief economist at commodity price specialists Argus Media. \"In 2021, Urals, the primary export grade of Russian crude, was pricing two to three dollars below North Sea Brent. As we speak in February, Urals is loading in the Baltic ports at $27 below North Sea Brent.\" That price gap has cut Russia's oil revenues by around 25% year-on-year and by up to 50% in January alone, an economic impact the Kremlin cannot ignore. \"I think they'll take a fairly sizeable hit, particularly in revenues this year, and I'd expect, at the very least, something like a half-a-million barrel per day hit on volumes,\" says Mr Fyfe. Are we heading for a military confrontation? The squeeze could tighten further, with pressure for a more robust response from European nations, including the UK. Under maritime law, all vessels have the right of innocent passage as long as they are sailing under a legitimate flag, and many countries have continued to do business with Russia since the invasion of Ukraine. The UK government is understood to have examined the legal grounds for detaining Russian tankers, including under the Sanctions and Money Laundering Act. \"I think there must come a point at which Britain and its allies, the Dutch, and the Danes and the Norwegians and the seagoing nations of Northern Europe, they will get much tougher with these Russian ships, even if they're escorted,\" says Professor Michael Clarke, Sky News security and defence analyst. \"When that happens, I think we're heading probably sometime this year for some sort of militarised confrontation at sea.\" A Ministry of Defence spokesperson said it has requested insurance documents from more than 600 vessels, and that \"deterring, disrupting and degrading the Russian shadow fleet is a priority\". The owners of the Rigel, the Hyperion and the Kousai have been contacted for comment."
    },
    {
        "title": "Trump's plan for Iran isn't working - he has three options",
        "description": "As the world awaits possible US military action against Iran, has Donald Trump boxed himself into a corner with only himself to blame?",
        "url": "https://news.sky.com/story/trumps-plan-for-iran-isnt-working-he-has-three-options-13511592",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-iran-trump_7174262.jpg?20260224223747",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2026-02-24 15:48:00",
        "Headline": "Tehran seems content to call Donald Trump's bluff, and so far putting a gun to the regime's head hasn't gone to plan. What could he do now?",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n As the world awaits possible US military action against Iran, has Donald Trump boxed himself into a corner with only himself to blame? There is a massive amount of American firepower now in the region, and its commander-in-chief has issued Tehran with multiple warnings: Make a deal or else. But what if they don't? The president's plan appears to have been to use the US Navy to force the Iranians to accept his terms with a gun to their head, but it's not working out. His chief negotiator, Steve Witkoff, has admitted as much. \"He's curious\", he said of Trump, \"as to why they haven't capitulated, why under this sort of pressure with the amount of naval power that we have over there, why they haven't come to us.\" So what now? The president \"understands that he's got plenty of alternatives\", claims Witkoff, but does he? Option one One option could be calibrated strikes. Whack Iran once and see if that makes its government more amenable. Experts say that could prove a massive miscalculation. The Iranian government is in a tight spot, no doubt, but it may try to ride out the storm if it's just a series of strikes. Option two Or the president could authorise attacking Iran with full force. But that's problematic too. Observers warn that for all the military muscle mustered in the region, there is still not enough to sustain an extended air campaign. In leaks infuriating the president, his own commanders at the Pentagon have been warning as much. Two carrier strike groups and all the warplanes sent to bases to bolster them could bombard Iran for a week, at most two, it is thought. That would be painful for the Iranians, but they could try to hunker down and tough that out, too. And they would strike back with their formidable arsenal of ballistic missiles. Option three Attacking Iran comes with considerable jeopardy for the president. But so does walking away. For all his bellicose rhetoric, the \"TACO president\"i could chicken out and send his aircraft carriers back to base. Read more from Sky News:How Iran may be preparing for US strikeIs Tehran ready to strike a deal? But having built up so much firepower, doing nothing would look weak and have consequences: for America's standing and the president's own political fortunes at a time when his approval ratings are cratering. Talks in Geneva scheduled for Thursday offer an off-ramp. Iran has another chance to \"capitulate\", as Witkoff puts it. But they are past masters at brinkmanship and calling their enemies' bluff. If they do so, has the US president thought this all through, or has he cooked his own goose?"
    },
    {
        "title": "'Not a Palestinian in sight': Inside Gaza after the ceasefire ",
        "description": "<a href=' https://podfollow.com/the-world-with-richard-and-yalda'>👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈</a>",
        "url": "https://news.sky.com/story/not-a-palestinian-in-sight-inside-gaza-after-the-ceasefire-13511727",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-yalda-hakim-the-world_7085303.jpg?20251118182005",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-24 21:18:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 What is Gaza like four months on from the ceasefire? Is Hamas still operating? Why won't Israeli troops withdraw completely? And what about the Palestinians who have been forced to leave their homes?  Richard has been taken into Gaza by the IDF, which is still the only way that international journalists are allowed into the Strip. He is shown a Hamas tunnel which the IDF says was used until recently. He also paints Yalda a picture of the complete destruction that he saw. The two also reflect on the war in Ukraine, four years on from Russia's full-scale invasion. Yalda's interview with the iconic American filmmaker, Ken Burns, will be available on Thursday, 26 February. You can also watch the podcast on our YouTube channel here. Do you have a question for Richard and Yalda? Write to them at theworld@sky.uk"
    },
    {
        "title": "'We decided to stand up to a bully,' says Ukrainian who swapped Wall Street for the frontline",
        "description": "A medic who gave up a promising  Wall Street career on to serve on the frontlines in Ukraine has told Sky News it was the \"easiest decision she ever made\".",
        "url": "https://news.sky.com/story/we-decided-to-stand-up-to-a-bully-says-ukrainian-who-swapped-wall-street-for-the-frontline-13511695",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-viktoriia-honcharuk_7174091.jpg?20260224201451",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-24 19:49:00",
        "Headline": "Viktoriia Honcharuk was \"living the American dream\". But when Russia invaded in 2022 she decided return home as a warzone medic, despite her fear of blood and needles.",
        "Content": "A medic who gave up a promising  Wall Street career on to serve on the frontlines in Ukraine has told Sky News it was the \"easiest decision she ever made\". Viktoriia Honcharuk said she was \"living the American dream\" with a fledgling career in investment banking when Russia launched its full-scale invasion of Ukraine in February 2022 But seeing how her homeland resisted the advance of Putin's \"special military operation\", she was inspired to return home and take up a medical role on the frontline - despite her fear of blood and needles. Speaking to The World with Yalda Hakim, she said: \"Everything was quite good in my life, but then Russia attacked my country. My mum, my dad, my sister... they all joined the resistance as soon as they could. \"They said, look, we're not going to go anywhere... we're going to fight for our home, our town. And that was very admirable - that inspired me a lot. \"After a couple of months helping from far away, I said, well, I cannot also stand back. I cannot watch Russia, the biggest country in the world, attacking my country.\" Despite the misgivings of her friends in the US and even her own mother, Victoria made the decision to return home, and called her sister with some questions. \"She was like, why are you asking this? \"And I'm thinking: I'm ready to go back to Ukraine and I want to join the army, and it's going to be, I think, something in medicine. \"And she just took like five seconds. She said, 'okay, I'll put you in touch with the right people'.\" She added: \"A lot of people think it was a difficult decision to leave a good career, good life, and go back to Ukraine and go to the frontlines. \"But looking back... I think that is the easiest decision I ever made.\" After a \"couple of days of training\" Victoria was deployed to the frontlines, but she would not only be helping her countrymen. \"I was afraid of blood and needles before the invasion,\" she admitted. \"But, at that point I just realised this is something that needs to be done.\" Among the thousands of people she's treated, are Russian prisoners of war. She said: \"It's something that we have to do, right? I don't get to choose who I have to work with. \"We're following the Geneva Convention. We have to treat prisoners of war, Russians.\" She added: \"You get to speak with them... and understand that Russia is not going to stop where what they're doing right now. \"They are ready to go further and they are preparing for something bigger.\" Read more:Ukraine conflict: How Russia is marking four years of warUK and Ukraine respond to Moscow's 'absurd' nuclear bomb claim Viktoriia, who has now been painted by British artist Max Denison-Pender, believes it is the actions of ordinary Ukrainians that have staved off Russian domination. She said: \"If we were all to say 'this is not my war', I think Russia would be pushing through the rest of Europe at this point. \"But just because of this, like men and women in Ukraine have decided to stand up to a bully and join the resistance.\""
    },
    {
        "title": "Call for investigation into virus that killed 72 tigers in Thailand ",
        "description": "The deaths of 72 tigers in two tourist parks in Thailand were caused by a virus that should not be a public health concern, officials have said. ",
        "url": "https://news.sky.com/story/call-for-investigation-into-virus-that-killed-72-tigers-in-thailand-13511583",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-tiger-thailand-deaths_7173820.jpg?20260224172018",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-24 15:17:00",
        "Headline": "Officials say the deaths of the animals in two tourist parks were caused by a virus not known to affect humans. But a vet is warning the origin of the infection remains unclear.",
        "Content": "The deaths of 72 tigers in two tourist parks in Thailand were caused by a virus that should not be a public health concern, officials have said.  The tigers died at parks in Mae Taeng and Mae Rim in Chiang Mai province in north Thailand between 8 to 18 February. Their deaths had sparked fears of an outbreak of bird flu, amid a resurgence of the virus in Asia. Authorities say it was not responsible, and that the tigers were killed by a virus not known to affect humans. On Friday, the Chiang Mai regional livestock office had said autopsies of the animals found genetic material of canine distemper virus, or CDV, and traces of bacterial infection. But Visit Arsaithamkul, a veterinarian who took part in the tiger analysis, expressed concern that the origins of the infections remained unclear without further investigation. In a Facebook post, he said that he suspected that as the two parks were located just 18 miles apart, the cause of infection could be food the tigers were fed that came from the same source. He declined to elaborate when contacted by The Associated Press. \n                  Thirty dead swans found amid 'suspected avian flu outbreak'\n                 \n                  H5N1 strain of bird flu has potential to become pandemic, says UK expert\n                 \n                  Bird flu tops list of viruses likely to cause another pandemic - so authorities are on high alert\n                 No-one has shown any symptoms so far, but authorities are continuing to monitor the health of people who had recently come into contact with the animals. \"There has not been an animal-to-human infection case,\" public health minister Pattana Promphat said at a news conference at Government House in Bangkok. Monthien Khanasawat, director-general of the Public Health Ministry's Disease Control Department, said: \"If we detect any sick persons, we will prepare for a nationwide monitoring measure. \"This will include contact tracing and treatment as necessary.\" Both parks, run under the name of Tiger Kingdom, remain closed. The operators did not immediately respond when contacted for comment. Bird flu has been resurgent in parts of Asia in recent years, and Thai authorities have been on alert. Thailand saw 17 deaths out of 25 infected patients from poultry-caused influenza between 2004 to 2007, according to the Public Health Ministry. CDV, which is infectious to both dogs and felines, can cause stronger symptoms in cats and tigers and can be transmitted through bodily fluids and air. Read more from Sky News:Thirty dead swans found amid 'suspected avian flu outbreak'Baby born from dead donor womb transplant Thai authorities said that tigers in confined environments could be particularly vulnerable to the viral infection, especially when compounded by stress and inbreeding conditions. The remains of the tigers were cremated and buried, officials said. The carcasses were disinfected, photographed and discarded to prevent any further use, Livestock Development Department director-general Somchuan Rattanamangklanan said. The first animal-to-human transmission of bird flu was discovered in Hong Kong in 1997 before a pandemic brokeout in Asia in 2003. Mr Monthien urged Thais to be careful around their consumption of poultry after a man in a neighbouring country, which he didn't name, was found infected with bird flu."
    },
    {
        "title": "British cousins charged with attempted murder over Venice Valentine's Day stabbing",
        "description": "Two British cousins have been arrested and charged with attempted murder over a stabbing on Valentine's Day in Venice.",
        "url": "https://news.sky.com/story/british-cousins-charged-with-attempted-murder-over-venice-valentines-day-stabbing-13511662",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-venice-polizia-di-stato_7173997.png?20260224181737",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-24 18:00:00",
        "Headline": "The suspects, aged 19 and 21, are alleged to have stabbed a 22-year-old local man in the neck in a cocktail bar, police say.",
        "Content": "Two British cousins have been arrested and charged with attempted murder over a stabbing on Valentine's Day in Venice. Italian police said the men, aged 19 and 21, had been charged with stabbing a 22-year-old local man in the neck on the even of 14 February at a bar in the city's historic centre. The victim reportedly come close to bleeding to death, after the incident outside La Bussola Cocktail Lar near the Rialto Bridge. Police say they think it was sparked by a \"trivial disagreements\". They believe the knife may have been thrown into the water, with state police diving units searching the Grand Canal in Venice's centre to find the alleged weapon. The 19-year-old is alleged to be the perpetrator and the 21-year-old the suspected accomplice, Italy's Polizia Di Stato said in a statement. \"Officers from the Venice Flying Squad, coordinated by the local prosecutor's office, arrested two British nationals, aged 19 and 21,\" the police said. \"They are believed to be responsible for the attempted murder of a 22-year-old man, which occurred on Valentine's Day in the historic centre.\" \n                  'Britain's youngest female double murderer' approved for open prison move\n                 \n                  Charles Bronson: Britain's 'most notorious prisoner' pledges to 'expose unlawful sentence' ahead of parole hearing\n                 \n                  Man jailed after starving dogs to death at 'rehoming' centre in Essex\n                 They added: \"According to investigations, the motive appears to be trivial disagreements between young people, which escalated into violence over trivial matters\". Read more from Sky News:Briton among 19 dead in Nepal bus crashCall for probe into virus that killed 72 tigers in Thailand The police said the two men had been in Italy on holiday since the end of January, with return tickets booked. The arrests came after a search lasting more than a week. Police say the cousins were found in an apartment that belonged to an Italian relative of one of the men, in Venice city centre. The operation to locate them was supported by wiretaps, electronic surveillance, the monitoring of social media profiles and the exchange of information with British authorities."
    },
    {
        "title": "European leaders came together in solidarity on Ukraine war fourth anniversary - but peace seems a long way off",
        "description": "Watching President Zelenskyy and first lady Olena Zelenska in the centre of Kyiv lead a minute's silence to honour the tens of thousands of soldiers who have died on the fourth anniversary of the Ukraine war was a sobering moment.&#160;",
        "url": "https://news.sky.com/story/european-leaders-came-together-in-solidarity-on-ukraine-war-fourth-anniversary-but-peace-seems-a-long-way-off-13511729",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-ukraine-lviv_7173479.jpg?20260224083346",
        "type": "World",
        "Author": "Beth Rigby",
        "Date Published": "2026-02-24 21:34:00",
        "Headline": "Beth Rigby joined Foreign Secretary Yvette Cooper in Kyiv on the fourth anniversary of Russia's invasion of Ukraine.",
        "Content": "\n          Political editor\n              @BethRigby\n Watching President Zelenskyy and first lady Olena Zelenska in the centre of Kyiv lead a minute's silence to honour the tens of thousands of soldiers who have died on the fourth anniversary of the Ukraine war was a sobering moment.  European prime ministers and dignitaries had come to Maidan Square in Kyiv as an act of solidarity and remembrance as they set candles in front of the sea of crosses, photos, and flags that now adorn this makeshift memorial for those killed in this conflict. But equally, there is an acknowledgement from those gathered that when it comes to this war, there is no end in sight: the leaders who arrived in Ukraine to mark this anniversary expect to be coming back next year, too. For Yvette Cooper, the foreign secretary, the trip was a moment to focus not just on sanctions, weapon supplies and territory, but to try to highlight the war Vladimir Putin is waging against women and children in Ukraine as he wages a \"war on Ukrainian culture\". \"I think one of the things that's been clearly happening, the way that so many children have been stolen, the ways in which, in the temporarily occupied territories, they are trying to change the education system, trying to choke out the Ukrainian language,\" she said. \"It's an attempt really, not just about territory, but to have a war on Ukrainian families, to have war on Ukraine history and culture and identity.\" But even as she arrived in Ukraine, issues at home plaguing the government and her foreign office brief were dominating the agenda, with the former US ambassador that she sacked, Peter Mandelson, arrested and taken in for hours of questioning by the police as Ms Cooper took an overnight train to Ukraine. The foreign secretary, who sacked the ambassador just days into her job in September, reiterated her position that Lord Mandelson \"should never have been appointed\" and, in a rare flash of emotion, told me that \"vile\" emails were exchanged between Lord Mandelson and paedophile financier Jeffrey Epstein. In one of the emails released by the US Department of Justice, Epstein replies to Lord Mandelson asking how being free from jail felt, by saying \"she feels fresh, firm and creamy\". Lord Mandelson replied by calling Epstein a \"naughty boy\". \"That's just vile,\" she told me. \"It makes me feel so angry.\" \"I've been really clear, Peter Mandelson should never have been appointed as ambassador to the US and I think some of what has been so, so deeply frustrating about all of this is that really at the heart of all of these should be the victims of Epstein, they're women and children who faced the most horrendous criminal exploitation trafficking and that really should be the focus. \"As you know, when I was home secretary, I made it a mission for the government to halve violence against women and girls over the next 10 years. \"That's a strategy now that the prime minister has championed. And now, as foreign secretary, I am making tackling violence against women and girls something that is an international theme for us as well.\" Putin's 'genocidal intent' On that issue, Ms Cooper used her time in Ukraine to meet female victims of Russian aggression and sexual violence and the \"voices for children\" charity with Olena Zelenska to highlight the plight of thousands of children stolen from their Ukrainian families by Russia. Yevgen Zakharov, a civil rights activist working at the Civil Liberties Centre, told the foreign secretary on her visit there that Putin \"wants to eliminate Ukrainian identity\". \"This is his crazy idea, a genocidal intent is there,\" he said. Throughout these visits, we heard stories of women in Russian-occupied territory being beaten, sexually abused, falsely imprisoned and sent to Labour camps. Elena Jagapova spoke of how she was taped to a chair, beaten until bloodied, sexually abused and sent to a labour camp. Another, Julia, told us of how her children - then 10 and 17 - were abducted by the Russians, and her 19-month battle to get them back. Ms Zelenska says more than 20,000 Ukrainian children have been stolen by the Russians as part of their campaign to eradicate Ukrainian culture, through repressing the language, forcing indoctrination and trying to brainwash children. \"We heard stories not just of torture, but also of this attempt to really destroy Ukrainian culture and identity as well,\" said Ms Cooper. \"That's why it's so important that we provide support for Ukrainian families, support for Ukrainian services but, also, make sure that you could have the kind of special tribunal, the kind of court processes, international court processes, that can pursue exactly those questions and can make sure that there is some justice and accountability.\" No end in sight… The UK has made it clear to Ukraine that it will play a part in helping set up war crime courts when this conflict finally ends, in echoes of Britain's role in the Nuremberg trials that punctuated the Second World War. But when that moment comes is hard to see. Those who gathered in Ukraine on Tuesday did so with a weariness that has come to characterise an attritional war in which Russia isn't winning, but neither is it defeated, as Europe and the US give enough support for Ukraine to fight on, without the firepower - or sanctions against Russia - for it to truly succeed. Mr Zelenskyy warned on the eve of the fourth anniversary that Putin had already started World War Three and Ukraine was the outpost, the frontline pushing Putin back. Ms Cooper doesn't want to use that language, but she does acknowledge that Russian aggression is here to stay, and allies must support Ukraine for however long it takes. To that end, the UK introduced another sanctions package on Tuesday, and is pushing the US and Europe about a maritime services ban to make it much harder for Russia's shadow fleet to transport Russian oil. The frustration is that the US, in trying to pursue peace talks - and reportedly in favour of Russian demand that Ukraine cede the 20% of the Donbas territory not under Russian occupation as part of any truce, is reluctant to squeeze Russia economically right now. …but a glimmer of hope So this war grinds on. For the Ukrainians and allies, one glimmer of hope is that Russia is now losing more men that it can mobilise on the battlefield. Ukraine hopes that if it can increase the casualty rate to 50,000 Russians a month, then Putin might be forced to consider conscription, which could prove politically difficult and begin to stall his momentum. That Russia has sacrificed an estimated 500,000 lives in order to gain less than one per cent of Ukraine's territory tells of the attritional war in which these two sides are locked - and with the horrific loss of life. In the meantime, Britain and Europe will try to put more pressure on the US to bring in more aggressive sanctions against Russia, to financially starve Putin's war machine. But for all the signs of solidarity on Tuesday, there is little to show in the way of concrete steps to peace. Ukraine hopes for a game changer in the coming months, but is reconciled to more anniversaries like today."
    },
    {
        "title": "Trump's plan for Iran isn't working - he has three options",
        "description": "As the world awaits possible US military action against Iran, has Donald Trump boxed himself into a corner with only himself to blame?",
        "url": "https://news.sky.com/story/trumps-plan-for-iran-isnt-working-he-has-three-options-13511592",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-iran-trump_7174262.jpg?20260224223747",
        "type": "US",
        "Author": "Dominic Waghorn",
        "Date Published": "2026-02-24 15:48:00",
        "Headline": "Tehran seems content to call Donald Trump's bluff, and so far putting a gun to the regime's head hasn't gone to plan. What could he do now?",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n As the world awaits possible US military action against Iran, has Donald Trump boxed himself into a corner with only himself to blame? There is a massive amount of American firepower now in the region, and its commander-in-chief has issued Tehran with multiple warnings: Make a deal or else. But what if they don't? The president's plan appears to have been to use the US Navy to force the Iranians to accept his terms with a gun to their head, but it's not working out. His chief negotiator, Steve Witkoff, has admitted as much. \"He's curious\", he said of Trump, \"as to why they haven't capitulated, why under this sort of pressure with the amount of naval power that we have over there, why they haven't come to us.\" So what now? The president \"understands that he's got plenty of alternatives\", claims Witkoff, but does he? Option one One option could be calibrated strikes. Whack Iran once and see if that makes its government more amenable. Experts say that could prove a massive miscalculation. The Iranian government is in a tight spot, no doubt, but it may try to ride out the storm if it's just a series of strikes. Option two Or the president could authorise attacking Iran with full force. But that's problematic too. Observers warn that for all the military muscle mustered in the region, there is still not enough to sustain an extended air campaign. In leaks infuriating the president, his own commanders at the Pentagon have been warning as much. Two carrier strike groups and all the warplanes sent to bases to bolster them could bombard Iran for a week, at most two, it is thought. That would be painful for the Iranians, but they could try to hunker down and tough that out, too. And they would strike back with their formidable arsenal of ballistic missiles. Option three Attacking Iran comes with considerable jeopardy for the president. But so does walking away. For all his bellicose rhetoric, the \"TACO president\"i could chicken out and send his aircraft carriers back to base. Read more from Sky News:How Iran may be preparing for US strikeIs Tehran ready to strike a deal? But having built up so much firepower, doing nothing would look weak and have consequences: for America's standing and the president's own political fortunes at a time when his approval ratings are cratering. Talks in Geneva scheduled for Thursday offer an off-ramp. Iran has another chance to \"capitulate\", as Witkoff puts it. But they are past masters at brinkmanship and calling their enemies' bluff. If they do so, has the US president thought this all through, or has he cooked his own goose?"
    },
    {
        "title": "Family of Nancy Guthrie offer $1m reward for her recovery",
        "description": "The family of missing 84-year-old Nancy Guthrie have offered $1m for her recovery.",
        "url": "https://news.sky.com/story/family-of-nancy-guthrie-offer-1m-reward-for-her-recovery-13511563",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-nancy-guthrie-savannah-guthrie_7166789.jpg?20260216193605",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-24 14:15:00",
        "Headline": "NBC Today show co-host Savannah Guthrie said on Instagram that the family \"still believe that she can come home, hope against hope\", more than three weeks after the 84-year-old was reported missing.",
        "Content": "The family of missing 84-year-old Nancy Guthrie have offered $1m for her recovery. NBC Today show co-host Savannah Guthrie said on Instagram that \"someone knows how to find our mom and bring her home\" on Tuesday, and urged people to keep Ms Guthrie in their thoughts. The 84-year-old went missing more than three weeks ago after she failed to appear at church on 1 February. She was last seen at her home in Tucson, Arizona, on the evening of 31 January. Authorities believe she was kidnapped, or otherwise taken against her will. The TV presenter, who co-anchors the morning programme on Sky's US partner network, said in the video: \"Please keep praying without ceasing. We still believe. We still believe in a miracle. \"We still believe that she can come home, hope against hope, as my sister says. We are blowing on the embers of hope. \"We also know that she may be lost. She may already be gone.\" \n                  FBI releases new details about suspect in Nancy Guthrie disappearance - and increases reward for information\n                 \n                  Ransom deadline for US star's missing mother passes after desperate video appeal\n                 \n                  Nancy Guthrie: Authorities searching for 'kidnapped' mum of TV host investigating 'vehicle of interest'\n                 The Instagram post says that the family offers its reward on terms consistent with the FBI's criteria for payment of its reward in this case. The bureau is separately offering a $100,000 reward for any information that leads to Ms Guthrie or to an arrest. In a post on X, the FBI's office in Phoenix said anyone with \"firsthand knowledge\" of the missing woman's whereabouts should contact its tip line. Read more from Sky News:Sky correspondent's car hit by 'sleeper' drone in RussiaFilmmaker quits as BAFTA judge over handling of racist slur Several hundred people are working on the investigation into Ms Guthrie's whereabouts, the Pima County Sheriff's Department has said, and more than 20,000 tips have been received. Authorities have not yet identified a suspect in the case, and said this month that her family are not being investigated. Pima County Sheriff Chris Nanos said: \"To suggest otherwise is not only wrong, it is cruel. The Guthrie family are victims plain and simple.\" The FBI had previously released doorbell camera images and videos of an armed and masked man outside Ms Guthrie's house on the morning she disappeared. Two law enforcement sources told Sky News' US partner NBC News on Monday that one of the images shared was captured earlier, which the sheriff's office denies."
    },
    {
        "title": "Man convicted of first-degree murder to be second person executed in Florida this year",
        "description": "A man convicted of killing a shop owner during a robbery is set to become the second person to be executed in Florida this year.",
        "url": "https://news.sky.com/story/man-who-killed-shop-owner-to-become-second-person-executed-in-florida-this-year-13511555",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-melvin-trotter-department-of-corrections_7173769.jpg?20260224141656",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-24 14:00:00",
        "Headline": "Melvin Trotter, now 65, was found guilty of first-degree murder after a shop owner was strangled and stabbed in the late 1980s.",
        "Content": "A man convicted of killing a shop owner during a robbery is set to become the second person to be executed in Florida this year. Melvin Trotter, now 65, was initially convicted of first-degree murder after strangling and stabbing Virgie Langford at her store in Palmetto in 1986. He was given the death penalty in 1987 - but the Florida Supreme Court found the trial court had made an error and ordered a new sentencing. Trotter was again sentenced to death in 1993 and is now scheduled to receive a three-drug lethal injection at Florida State Prison at 6pm local time (11pm UK time) today. His lawyers have been appealing against the execution, arguing that the state's corrections officials had mismanaged death penalty protocols and that his age should exempt him from being executed. Florida's Supreme Court has denied the appeals but Trotter's final bid to have his sentence commuted was still pending at the US Supreme Court with just hours to go. A truck driver found Ms Langford alive after the attack and she was able to describe her assailant before dying in hospital, court records stated. As well as recalling Trotter's physical appearance, Ms Langford said her attacker had a Tropicana employee badge with \"Melvin\" on it. Court records said police later found a T-shirt with Ms Langford's blood type on it at Trotter's home, and the man's handprint on a meat cooler at the store. It comes after a man convicted of killing a travelling salesperson became the first person executed in Florida this year. Ronald Palmer Heath, 64, was found guilty of first-degree murder and other charges following the 1989 killing of Michael Sheridan, who he and his brother had met at a bar. Read more:Director's son pleads not guilty to murdering parentsFamily of Nancy Guthrie offer $1m for her recovery Two more Florida executions have already been scheduled for next month. The state's governor, Ron DeSantis, oversaw a record-breaking number of executions in 2025. A total of 19 people received the lethal injection in the state - more than in any other single year since the US reinstated the death penalty in 1976. The previous record was eight."
    },
    {
        "title": "France's row with US ambassador Charles Kushner heats up after meeting no-show",
        "description": "A row between Emmanuel Macron's government and the US ambassador to Paris has deepened after the American envoy ignored a summons to meet the French foreign minister.",
        "url": "https://news.sky.com/story/frances-row-with-us-ambassador-charles-kushner-heats-up-after-meeting-no-show-13511425",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-kushner-charles_7173545.jpg?20260224095250",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-24 09:23:00",
        "Headline": "Paris blocks envoy Charles Kushner - Jared's father - access to government officials after he missed meeting with the French foreign minister.",
        "Content": "A row between Emmanuel Macron's government and the US ambassador to Paris has deepened after the American envoy ignored a summons to meet the French foreign minister. Charles Kushner - the father of Donald Trump's son-in-law, Jared Kushner - had been told to meet Jean-Noel Barrot on Monday evening to explain his recent comments about the killing of a far-right activist in Lyon. Instead, Mr Kushner said he had a prior engagement and sent a deputy. An indignant Mr Barrot described the no-show as a \"surprise\", adding: \"It will, naturally, affect his capacity to exercise his mission in our country.\" The minister also said the US ambassador will not have access to members of the French government until he complies. His ministry accused Kushner of an \"apparent failure to grasp the basic requirements of the ambassadorial mission\". The row began after US comments in social media posts about the death of student Quentin Deranque, 23, who was beaten during a clash between far-right and far-left groups earlier this month. Following the death, the US state department's counterterrorism bureau posted on X that \"reports, corroborated by the French Minister of the Interior, that Quentin Deranque was killed by left-wing militants, should concern us all\". It added that \"violent radical leftism is on the rise and its role in Quentin Deranque's death demonstrates the threat it poses to public safety\". The US Embassy in Paris posted the same statement in French. Paris responded by saying it rejected any attempts to use the incident \"for political ends\". Mr Barrot insisted France \"must have an explanation\" of the comments from Mr Kushner, adding: \"We don't accept that foreign countries can come and interfere, invite themselves, into the national political debate.\" Read more:Queen meets Gisele PelicotUS official condemned over Israel remarks On Saturday, some 3,000 people joined a march in memory of Mr Deranque, 23, whose killing has highlighted deep political tensions in France. Mr Kushner was previously summoned by French officials last August after his letter alleging the country did not do enough to combat antisemitism. He did not show up and French officials met with a representative instead. The 71-year-old businessman was controversially named US ambassador to France by Donald Trump last year. In 2020, he was pardoned by Mr Trump after pleading guilty to tax evasion and making illegal campaign donations years earlier. The US president had known Mr Kushner from real estate circles and their children, Ivanka and Jared, married in 2019."
    },
    {
        "title": "Some of Putin's most potent weapons are hiding in plain sight - in the English Channel",
        "description": "In the English Channel, less than two hours by fishing boat from Dover, some of the most potent weapons in Russia's war on Ukraine are hiding in plain sight.",
        "url": "https://news.sky.com/story/some-of-putins-most-potent-weapons-are-hiding-in-plain-sight-in-the-english-channel-13511518",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-kousai-shadow-fleet_7174046.jpg?20260224190840",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2026-02-24 12:56:00",
        "Headline": "As tankers carrying hundreds of millions of dollars worth of Russian oil pass through British waters, a Sky News expert warns we are heading for \"militarised confrontation at sea\".",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n In the English Channel, less than two hours by fishing boat from Dover, some of the most potent weapons in Russia's war on Ukraine are hiding in plain sight. On a misty February morning midway between Britain and France, we watch tankers carrying Russian oil worth around $100m (£74.1m) cruise past in defiance of Western sanctions, embargoes, and price caps. Dozens of these vessels pass through the Channel every month, part of a \"shadow fleet\" of up to 800 vessels that have kept the oil revenues that fund the war on Ukraine flowing. This week, the UK government announced fresh sanctions against the Russian oil trade but the evidence of a day on the water is that the shadow fleet operates with apparent impunity, right under the nose of Kyiv's allies. Russian tankers a 'routine sight' Our skipper, Matt Coker, usually takes sea fishing parties out on the Portia, but we were after a bigger catch; three vessels in the shadow fleet carrying oil from Russia's Baltic ports. He says they are a routine sight in the world's busiest shipping lane: \"When you see these Russian ships and these oil tankers, you know, it's a regular occurrence. To be honest, no one really takes any notice.\" We had tracked the tankers - the Rigel, the Hyperion and the Kousai - from the Gulf of Finland, where they had been loaded with oil at Russian Baltic ports, to intercept them as they passed the narrowest point of the Dover Straits. Up close in a rising swell, the scale of the vessels is unavoidable, and each one tells a story about both the impact and the limits of Western action. The Rigel, a Suezmax-class tanker, is more than 270 metres long and fills the near horizon as it emerges from the mist. With a capacity of one million barrels, its cargo of oil, loaded a week earlier at Primorsk, is worth around $55m (£40.7m). It is sailing under a Cameroon flag, owned and managed by a company in the Seychelles, and sanctioned by the EU, UK and Canada, among others. That prevents it from using port facilities in any of the sanctioning countries, but not from heading to its next known stop, Port Said at the head of the Suez Canal. We cannot know where its oil will be unloaded, but since the invasion of Ukraine, the bulk of Russian oil has been sold to China and India, at a significant discount. Next to appear is the Hyperion, sanctioned by the UK, EU and US, and sailing under a Russian flag with its name marked on the bow in Cyrillic. The flag switching tactic As recently as December, it was sailing under a Sierra Leone flag when, after making a delivery to Venezuela, it switched flags and evaded the US naval blockade in the Caribbean. Switching flags is a routine tactic in the shadow fleet, opaque ownership is common, and insurance cover is often unclear, a serious concern given many of the vessels are ageing and poorly maintained. The US has taken direct military action against tankers in the shadow fleet linked to Venezuela, with at least seven seized since last year, the most recently in the Indian Ocean on Tuesday. French paramilitaries also seized a vessel in the Mediterranean last month, but despite the almost daily passage of shadow tankers through the Channel, direct British interventions so far have focused on insurance. As we watch the passage of our third sanctioned tanker, the Kousai, we overhear a message from the coastguard to its captain on the open VHF radio channel, demanding proof of insurance. The captain is asked to email documentation to a government email address within 24 hours. We do not hear the Kousai's response, and in a matter of minutes, it too has passed. A reaction to sanctions Sanctions against Russia's oil industry have had an impact, reducing the value of Russian oil if not the volumes that it moves. The growth of the shadow fleet itself is a market response to tightening sanctions. With the majority of western-controlled tankers and associated marine services beyond Russia's reach, it turned to an ad-hoc, opaque collection of older vessels to move oil, often covertly. \"Over 60% of Russian crude is being exported on the shadow fleet,\" says Pamela Munger, head of European market analysis for energy analysts Vortexa. \"You have more vessels that need to be in the chain. Let's say a sanctioned vessel loads Russian crude and let's say it's on its way to China. \"It could make up to five, six, seven ship-to-ship transfers along the way in order to disguise the origin of the crude and move it on to… Non-sanctioned vessels, which it will eventually discharge into its end buyer.\" Data from the Centre for Research on Energy and Clean Air shows that the number of vessels in the shadow fleet grew following sanctions but the volume of oil being moved remained constant, even as hundreds of vessels were sanctioned directly. Impact on the oil market Prices have fallen, however, with Russian oil now competing with Iranian and Venezuelan crude in the \"distressed\" sanctioned oil market, cutting Kremlin revenues as a result. \"Russia has had to discount those crude oil cargoes in a very big way,\" says David Fyfe, chief economist at commodity price specialists Argus Media. \"In 2021, Urals, the primary export grade of Russian crude, was pricing two to three dollars below North Sea Brent. As we speak in February, Urals is loading in the Baltic ports at $27 below North Sea Brent.\" That price gap has cut Russia's oil revenues by around 25% year-on-year and by up to 50% in January alone, an economic impact the Kremlin cannot ignore. \"I think they'll take a fairly sizeable hit, particularly in revenues this year, and I'd expect, at the very least, something like a half-a-million barrel per day hit on volumes,\" says Mr Fyfe. Are we heading for a military confrontation? The squeeze could tighten further, with pressure for a more robust response from European nations, including the UK. Under maritime law, all vessels have the right of innocent passage as long as they are sailing under a legitimate flag, and many countries have continued to do business with Russia since the invasion of Ukraine. The UK government is understood to have examined the legal grounds for detaining Russian tankers, including under the Sanctions and Money Laundering Act. \"I think there must come a point at which Britain and its allies, the Dutch, and the Danes and the Norwegians and the seagoing nations of Northern Europe, they will get much tougher with these Russian ships, even if they're escorted,\" says Professor Michael Clarke, Sky News security and defence analyst. \"When that happens, I think we're heading probably sometime this year for some sort of militarised confrontation at sea.\" A Ministry of Defence spokesperson said it has requested insurance documents from more than 600 vessels, and that \"deterring, disrupting and degrading the Russian shadow fleet is a priority\". The owners of the Rigel, the Hyperion and the Kousai have been contacted for comment."
    },
    {
        "title": "Reddit fined more than £14m over children's privacy failures",
        "description": "Reddit has been fined more than &#163;14m by the Information Commissioner's Office for failing to keep children safe.",
        "url": "https://news.sky.com/story/reddit-fined-16314m-by-information-commisioners-office-over-age-verification-checks-13511472",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-social-apps_7099757.jpg?20260224122230",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-02-24 11:40:00",
        "Headline": "The record fine came after an investigation by the data protection watchdog which found the US company used children's information unlawfully.",
        "Content": "Reddit has been fined more than £14m by the Information Commissioner's Office for failing to keep children safe. It is the largest fine ever handed out by the information watchdog over children's privacy issues. An investigation by the data protection watchdog found the US company used children's information unlawfully. A statement from the ICO said Reddit's failings included not checking the age of users accessing its platform, putting youngsters at risk. It said Reddit failed to: • Apply any robust age assurance mechanism and therefore did not have a lawful basis for processing the personal information of children under the age of 13. • Carry out a data protection impact assessment (DPIA) to assess and mitigate risks to children before January 2025. \n                  Welcome to the fly-tipping capital of England, where locals are 'embarrassed' to live\n                 \n                  'Simply a miracle': Baby boy born from dead donor womb transplant in UK first\n                 \n                  Police still using AI tool despite inaccurate evidence in Israeli football fan ban\n                 John Edwards, UK Information Commissioner, said: \"It's concerning that a company the size of Reddit failed in its legal duty to protect the personal information of UK children. \"Children under 13 had their personal information collected and used in ways they could not understand, consent to or control. That left them potentially exposed to content they should not have seen. This is unacceptable and has resulted in today's fine. \"Let me be clear. Companies operating online services likely to be accessed by children have a responsibility to protect those children by ensuring they're not exposed to risks through the way their data is used. To do this, they need to be confident they know the age of their users and have appropriate, effective age assurance measures in place. \"Reddit failed to meet these expectations. They must do better and we are continuing to consider the age assurance controls now implemented by the platform. \"Relying on users to declare their age themselves is not enough when children may be at risk and we are focusing now on companies that are primarily using this method. I therefore strongly encourage industry to take note, reflect on their practices and urgently make any necessary improvements to their platforms.\" Read more from Sky News:Porn company handed record £1.3m fine by OfcomWill the 'tobacco trials' come back to haunt tech giants?Universal vaccine for cold, flu, COVID and allergies 'a step closer' Reddit told Sky News it intends to appeal the ICO's decision. \"Reddit doesn't require users to share information about their identities, regardless of age, because we are deeply committed to their privacy and safety,\" said a Reddit spokesperson. \"The ICO's insistence that we collect more private information on every UK user is counterintuitive and at odds with our strong belief in our users' online privacy and safety.\" Earlier this month, Imgur owner MediaLab was handed a £250,000 fine for similar issues. In 2023, TikTok ended up with a £12.7m fine after negotiating the ICO down from a £27m penalty. This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Mandelson's lawyers say his arrest due to 'baseless' flight risk claim",
        "description": "Peter Mandelson's lawyers have said claims he was arrested because he was a flight risk are \"baseless\".",
        "url": "https://news.sky.com/story/mandelsons-lawyers-say-his-arrest-due-to-baseless-flight-risk-claim-13511718",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/9c8b9074f05e9dcbf8a97edc95fd55e3d833336d968b7f58e3973276bccde47e_7173025.jpg?20260223171028",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-24 20:52:00",
        "Headline": "Sky News understands police detained the peer because they had been told he was preparing to flee the UK for the British Virgin Islands.",
        "Content": "Peter Mandelson's lawyers have said claims he was arrested because he was a flight risk are \"baseless\". The former Labour peer was detained on Monday under suspicion of misconduct in public office, and released later the same evening. Sky News understands the Metropolitan Police arrested him because they had been told he was preparing to flee the UK for the British Virgin Islands. They had originally planned to interview Mandelson, 72, under caution, without arrest in a fortnight's time. It is understood that going through devices obtained from searching his two homes in Camden, north London, and Wiltshire, was proving very time-consuming. But after police conducted a series of interviews about the flight risk claims they decided they needed to arrest him this week. Mandelson has denied any wrongdoing. Mishcon de Rey, lawyers for the former British ambassador to the US, said: \"Peter Mandelson was arrested yesterday despite an agreement with the police that he would attend an interview next month on a voluntary basis. \n                  Mandelson's 'vile' Epstein emails make me 'angry', Foreign Secretary Yvette Cooper says\n                 \n                  Mandelson arrested as Trump attacks Supreme Court \n                 \n                  Mandelson's assistant sent Epstein government speech before it was delivered\n                 \"The arrest was prompted by a baseless suggestion that he was planning to leave the country and take up permanent residence abroad. \"There is absolutely no truth whatsoever in any such suggestion. \"We have asked the MPS for the evidence relied upon to justify the arrest. Peter Mandelson's overriding priority is to cooperate with the police investigation, as he has done throughout this process, and to clear his name.\" Lord Mandelson was bailed in the early hours of Tuesday morning after about eight hours of questioning. It is not clear if he had to surrender his passport, but that is usually a condition of bail in such cases. Read more: Mandelson's 'vile' Epstein emails make me 'angry', foreign sec says He was sacked as ambassador in September after details emerged about his continued contact with disgraced paedophile Jeffrey Epstein. Mandelson then resigned from the House of Lords in early February amid growing public and political scrutiny after the US Department of Justice's latest publication of Epstein files last month."
    },
    {
        "title": "Mandelson's 'vile' Epstein emails make me 'angry', Foreign Secretary Yvette Cooper says",
        "description": "Foreign Secretary Yvette Cooper has said Lord Mandelson's emails to Jeffrey Epstein were vile and make her angry.",
        "url": "https://news.sky.com/story/mandelsons-vile-epstein-emails-make-me-angry-foreign-secretary-yvette-cooper-says-13511431",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-peter-mandelson-epstein_7173196.jpg?20260223193024",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-24 09:34:00",
        "Headline": "The foreign secretary made the comments in an interview with Sky News, the day after Lord Mandelson was taken into custody by the Metropolitan Police.",
        "Content": "Foreign Secretary Yvette Cooper has said Lord Mandelson's emails to Jeffrey Epstein were vile and make her angry. Speaking to Sky News' political editor Beth Rigby in Ukraine, Ms Cooper said the former Labour peer should \"never have been appointed\" as the UK's ambassador to the US. He was sacked in September after it emerged he had continued contact with financier Epstein after his conviction for paedophilia. Politics live - follow latest Lord Mandelson was arrested on Monday on suspicion of misconduct in public office regarding his time as business secretary in the 2000s, and was questioned by Metropolitan Police detectives for eight hours before being released on bail just after 1am on Tuesday morning. Police had previously searched the peer's two homes in Wiltshire and in Camden, north London. He has previously denied any wrongdoing. \n                  Mandelson's lawyers say his arrest due to 'baseless' flight risk claim\n                 \n                  Mandelson arrested as Trump attacks Supreme Court \n                 \n                  Mandelson's assistant sent Epstein government speech before it was delivered\n                 One of the emails released by the US Department of Justice reveals Epstein replying to Lord Mandelson asking how being free from jail felt, by saying \"she feels fresh, firm and creamy\", with the peer then calling him a \"naughty boy\". Ms Cooper told Beth Rigby the emails are \"just vile\" and said \"it just makes me so angry\". She added: \"I removed Peter Mandelson from being the ambassador to the US in my first week as foreign secretary. \"I've made my view clear, as has the prime minister, he should never have been appointed as the ambassador to the US.\" Ms Cooper was made foreign secretary six days before Lord Mandelson was sacked on 11 September 2025. Sky News captured the moment Lord Mandelson was seen leaving a police station in London, and he was photographed arriving back in Camden at about 2am. The former Labour minister has been accused of passing sensitive information to Epstein during his time as business secretary from 2008 to 2010, when Gordon Brown was prime minister. His arrest came four days after the King's brother, Andrew Mountbatten-Windsor, was also arrested on suspicion of misconduct in public office over his links to Epstein. He was released the same day and remains under investigation. Lord Mandelson, 72, was sacked as the UK ambassador to the US in September 2025 over his links to Epstein, a role he had only taken up in February, having been appointed by Sir Keir Starmer the previous year. Downing Street said he was dismissed after new information emerged about the extent of his relationship with the billionaire. He had featured in documents published by a US Congress committee, and politicians in Washington have since urged him to answer questions as part of their own investigation into Epstein. Lord Mandelson resigned from the House of Lords in early February amid growing public and political scrutiny after the US Department of Justice's latest publication of the Epstein files last month."
    },
    {
        "title": "European leaders came together in solidarity on Ukraine war fourth anniversary - but peace seems a long way off",
        "description": "Watching President Zelenskyy and first lady Olena Zelenska in the centre of Kyiv lead a minute's silence to honour the tens of thousands of soldiers who have died on the fourth anniversary of the Ukraine war was a sobering moment.&#160;",
        "url": "https://news.sky.com/story/european-leaders-came-together-in-solidarity-on-ukraine-war-fourth-anniversary-but-peace-seems-a-long-way-off-13511729",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-ukraine-lviv_7173479.jpg?20260224083346",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2026-02-24 21:34:00",
        "Headline": "Beth Rigby joined Foreign Secretary Yvette Cooper in Kyiv on the fourth anniversary of Russia's invasion of Ukraine.",
        "Content": "\n          Political editor\n              @BethRigby\n Watching President Zelenskyy and first lady Olena Zelenska in the centre of Kyiv lead a minute's silence to honour the tens of thousands of soldiers who have died on the fourth anniversary of the Ukraine war was a sobering moment.  European prime ministers and dignitaries had come to Maidan Square in Kyiv as an act of solidarity and remembrance as they set candles in front of the sea of crosses, photos, and flags that now adorn this makeshift memorial for those killed in this conflict. But equally, there is an acknowledgement from those gathered that when it comes to this war, there is no end in sight: the leaders who arrived in Ukraine to mark this anniversary expect to be coming back next year, too. For Yvette Cooper, the foreign secretary, the trip was a moment to focus not just on sanctions, weapon supplies and territory, but to try to highlight the war Vladimir Putin is waging against women and children in Ukraine as he wages a \"war on Ukrainian culture\". \"I think one of the things that's been clearly happening, the way that so many children have been stolen, the ways in which, in the temporarily occupied territories, they are trying to change the education system, trying to choke out the Ukrainian language,\" she said. \"It's an attempt really, not just about territory, but to have a war on Ukrainian families, to have war on Ukraine history and culture and identity.\" But even as she arrived in Ukraine, issues at home plaguing the government and her foreign office brief were dominating the agenda, with the former US ambassador that she sacked, Peter Mandelson, arrested and taken in for hours of questioning by the police as Ms Cooper took an overnight train to Ukraine. The foreign secretary, who sacked the ambassador just days into her job in September, reiterated her position that Lord Mandelson \"should never have been appointed\" and, in a rare flash of emotion, told me that \"vile\" emails were exchanged between Lord Mandelson and paedophile financier Jeffrey Epstein. In one of the emails released by the US Department of Justice, Epstein replies to Lord Mandelson asking how being free from jail felt, by saying \"she feels fresh, firm and creamy\". Lord Mandelson replied by calling Epstein a \"naughty boy\". \"That's just vile,\" she told me. \"It makes me feel so angry.\" \"I've been really clear, Peter Mandelson should never have been appointed as ambassador to the US and I think some of what has been so, so deeply frustrating about all of this is that really at the heart of all of these should be the victims of Epstein, they're women and children who faced the most horrendous criminal exploitation trafficking and that really should be the focus. \"As you know, when I was home secretary, I made it a mission for the government to halve violence against women and girls over the next 10 years. \"That's a strategy now that the prime minister has championed. And now, as foreign secretary, I am making tackling violence against women and girls something that is an international theme for us as well.\" Putin's 'genocidal intent' On that issue, Ms Cooper used her time in Ukraine to meet female victims of Russian aggression and sexual violence and the \"voices for children\" charity with Olena Zelenska to highlight the plight of thousands of children stolen from their Ukrainian families by Russia. Yevgen Zakharov, a civil rights activist working at the Civil Liberties Centre, told the foreign secretary on her visit there that Putin \"wants to eliminate Ukrainian identity\". \"This is his crazy idea, a genocidal intent is there,\" he said. Throughout these visits, we heard stories of women in Russian-occupied territory being beaten, sexually abused, falsely imprisoned and sent to Labour camps. Elena Jagapova spoke of how she was taped to a chair, beaten until bloodied, sexually abused and sent to a labour camp. Another, Julia, told us of how her children - then 10 and 17 - were abducted by the Russians, and her 19-month battle to get them back. Ms Zelenska says more than 20,000 Ukrainian children have been stolen by the Russians as part of their campaign to eradicate Ukrainian culture, through repressing the language, forcing indoctrination and trying to brainwash children. \"We heard stories not just of torture, but also of this attempt to really destroy Ukrainian culture and identity as well,\" said Ms Cooper. \"That's why it's so important that we provide support for Ukrainian families, support for Ukrainian services but, also, make sure that you could have the kind of special tribunal, the kind of court processes, international court processes, that can pursue exactly those questions and can make sure that there is some justice and accountability.\" No end in sight… The UK has made it clear to Ukraine that it will play a part in helping set up war crime courts when this conflict finally ends, in echoes of Britain's role in the Nuremberg trials that punctuated the Second World War. But when that moment comes is hard to see. Those who gathered in Ukraine on Tuesday did so with a weariness that has come to characterise an attritional war in which Russia isn't winning, but neither is it defeated, as Europe and the US give enough support for Ukraine to fight on, without the firepower - or sanctions against Russia - for it to truly succeed. Mr Zelenskyy warned on the eve of the fourth anniversary that Putin had already started World War Three and Ukraine was the outpost, the frontline pushing Putin back. Ms Cooper doesn't want to use that language, but she does acknowledge that Russian aggression is here to stay, and allies must support Ukraine for however long it takes. To that end, the UK introduced another sanctions package on Tuesday, and is pushing the US and Europe about a maritime services ban to make it much harder for Russia's shadow fleet to transport Russian oil. The frustration is that the US, in trying to pursue peace talks - and reportedly in favour of Russian demand that Ukraine cede the 20% of the Donbas territory not under Russian occupation as part of any truce, is reluctant to squeeze Russia economically right now. …but a glimmer of hope So this war grinds on. For the Ukrainians and allies, one glimmer of hope is that Russia is now losing more men that it can mobilise on the battlefield. Ukraine hopes that if it can increase the casualty rate to 50,000 Russians a month, then Putin might be forced to consider conscription, which could prove politically difficult and begin to stall his momentum. That Russia has sacrificed an estimated 500,000 lives in order to gain less than one per cent of Ukraine's territory tells of the attritional war in which these two sides are locked - and with the horrific loss of life. In the meantime, Britain and Europe will try to put more pressure on the US to bring in more aggressive sanctions against Russia, to financially starve Putin's war machine. But for all the signs of solidarity on Tuesday, there is little to show in the way of concrete steps to peace. Ukraine hopes for a game changer in the coming months, but is reconciled to more anniversaries like today."
    },
    {
        "title": "Magistrates and judges to use more AI, says Lammy - as jury trials reduced",
        "description": "Justice Secretary David Lammy wants to see more AI-assisted magistrates as he doubles down on his plans to reduce the number of jury trials.",
        "url": "https://news.sky.com/story/magistrates-and-judges-to-use-more-ai-says-lammy-as-jury-trials-reduced-13511577",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lammy-david-microsoft_7173817.jpg?20260224151519",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2026-02-24 15:08:00",
        "Headline": "Deputy Prime Minister David Lammy has confirmed he wants to see more AI being used by courts, as he confirms fewer jury trials will be taking place. The Law Society has warned that decisions \"with serious consequences\" for peoples lives \"must be made by humans\".",
        "Content": "\n          Political reporter\n              @TimJ_B\n Justice Secretary David Lammy wants to see more AI-assisted magistrates as he doubles down on his plans to reduce the number of jury trials. Speaking from a Microsoft AI event in London, Mr Lammy, who is also the deputy prime minister, confirmed members of the judiciary had been using the tools, and he now wanted \"to see more AI\". Mr Lammy said as part of the initiative, the government would ramp up investment in its \"justice AI\" project. Politics latest: MPs debating release of Andrew trade envoy files He also reiterated his commitment to reducing the number of jury trials being held in England and Wales in a bid to reduce the courts backlog, as well as his recent announcement committing to increase the number of court sitting days. It comes following Sky News uncovering that at least 21 police forces have continued using Microsoft's Copilot tool, despite hallucinations contributing to the banning of Maccabi Tel Aviv fans from a game against Aston Villa - something Mr Lammy previously criticised. Mr Lammy said trials in the probation system with AI had helped record meetings between offenders and officers, saving 25,000 hours of time by helping transcribe more than 150,000 meetings. \n                  Murderer who killed schoolboy will not move to open prison after raps 'boasting' about his crime\n                 \n                  I'm ashamed of Sir Keir Starmer, says rebel MP - as row over justice reforms escalates\n                 \n                  JD Vance agrees sexualised AI deepfakes 'entirely unacceptable,' Lammy says\n                 \"We're testing transcription in the courts and tribunals based on the same technology,\" Mr Lammy said. \"And in the immigration and asylum chamber, some judges are using it to help formulate notes and write remarks. \"We're also piloting AI for legal advisers and district judges in the magistrates' courts to speed up case progression by transcribing material, and summarising their judgments. \"I want to see more AI initiatives like this, so we're going to invest more in our in-house justice AI unit.\" Read more:Why you shouldn't use an AI generated passwordTech firms face UK block over abusive images Richard Atkinson, a solicitor and former head of the Law Society, said: \"We support modernising the justice system and adopting new technology, provided it enhances access to justice, is reliable and ensures fairness. \"AI is not, however, a silver bullet to improve the justice system. It might help to ease some administrative pressures, but it is not a replacement for much-needed investment in the court estate and additional court staff. \"Where liberty and reputation are at stake, the government must take particular care to safeguard people's rights and ensure fair processes. All decisions, especially those with serious consequences to people's lives, must be made by humans.\" Defending his proposed changes to the justice system, Mr Lammy referenced how Margaret Thatcher had changed where cases like taking a vehicle without consent were heard, and the fact crown courts were only created in the early 1970s. On jury trials, Mr Lammy said: \"It does not change the fundamental right to a fair trial, which remains absolute. \"But there's no automatic right to a trial by jury. \"And in the current system, only 3% in fact of criminal cases currently go before a jury. \"The vast majority of cases are already heard fairly by magistrates without a jury. \"And following our changes, around three quarters of trials in the crown court will still be heard by a jury, including the majority of youth cases serious enough to go to the Crown.\" 👉Listen to Politics At Sam And Anne's on your podcast app👈 Darren Hardman, the chief executive of Microsoft in the UK, said the Ministry of Justice was \"one of the fastest-growing adopters of agentic AI\". Agentic AI is the technology that can take instructions in normal English, and then use a computer to carry out new tasks, like creating documents or talking to other software. Mr Hardman added: \"Whilst we've already delivered impactful outcomes together, the potential for future transformation across the department is incredibly exciting and a privilege to partner on.\""
    },
    {
        "title": "Welcome to the fly-tipping capital of England, where locals are 'embarrassed' to live",
        "description": "It's hard to believe the London Borough of Brent was once covered in even more rubbish than it is now.&#160;",
        "url": "https://news.sky.com/story/welcome-to-the-fly-tipping-capital-of-england-where-locals-are-embarrassed-to-live-13511693",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-fly-tipping-brent_7174075.jpg?20260224200629",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2026-02-24 19:46:00",
        "Headline": "Sky News has spent time with a squad of enforcement officers tasked with tracking down fly-tippers. It's a game of cat and mouse as they walk the streets of Brent, London, looking for clues.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n It's hard to believe the London Borough of Brent was once covered in even more rubbish than it is now.  Although the gleaming arch of Wembley Stadium is sometimes just a few steps away, its residential streets are a patchwork of filth. Whether it's a sea of bottles right by the very sign for the recycling centre, a hollowed-out sofa sagging against a brick wall or a TV just feet from (but not in) the communal dustbin, Brent is covered in, well, crap. \"It's like a dump,\" says Robert Hall, who has lived there all the 60-odd years of his life. His neighbourhood has become an obstacle course of dumped cars, rubbish, and mattresses. It might sound like he's exaggerating, but on my 20-minute walk over from Wembley Park Tube, I see a fridge, TV, pet cage and countless bags of rubbish. \"It's an eyesore. I'm embarrassed to have people visit,\" he adds. And it's just as well, because it turns out his friends have told him they don't like coming to see him any more anyway. An unenviable crown  Brent recently earned the unenviable title of fly-tipping capital of England, after recording 35,000 incidents in a single year. It's a stain Brent Council is slowly managing to scrub away, thanks to its zealous squad of enforcement officers tasked with tracking down the culprits. \"It's important to take pride in what you do,\" says Anca Pricop, enforcement patrol supervisor at Brent Council. \"It might not seem a very nice job, but it is satisfying when you catch people.\" Following the paper trail  \"We're little detectives,\" she says, having donned two layers of gloves and attacked a pile of black bin bags with gusto. All make-up, high ponytail and painted silver nails, she brings remarkable glamour to a decidedly grimy job. Elbows-deep in someone else's filth, she starts to piece together 1sq cm of torn-up pieces of paper. \"You can clearly see there was a delivery label inside.\" But to her dismay, no smoking gun this time. The household went to \"a lot of trouble just to rip [the label] and for us not to be able to find [the address]\". Her luck shifts a few streets away, where a mound of household waste is spilling out of a phone box. Anca combs through the papers inside. Bingo: a box of medicine with a prescription label still intact. \"We have a name,\" she says. Earlier that week her team seized a van they'd caught fly-tipping by tracing the rubbish back to the vehicle. She says many people don't realise the onus is on them to check whether the people offering to take away their waste for a good fee actually have a licence to do so. \"More often than not it will get dumped - on the same street sometimes.\" If caught by Anca, the households will get slapped with a fine. A national 'epidemic' Thanks to the inspections like this, plus new \"community skips\", Brent Council says it's getting a grip on fly-tipping, inching its way down the league table. But nationally, the figures have barely budged from around the one million incidents a year mark. New statistics for 2024-2025, due later on Wednesday, are predicted to show that the tide of rubbish is nowhere near receding. Read more from Sky News:Sky correspondent's car attackedSwapping Wall Street for the frontline The figures are also thought to be only the tip of the iceberg, as they exclude cases on private land like farms and National Trust estates. The data also shows how few cases result in fines or prosecutions. Campaigners at Clean Up Britain accuse local and central governments of failing to enforce the law, or to show that fly-tippers will be caught. It wants stronger enforcement and maximum fines of £20,000. The government says it is \"determined to stop\" criminals and is \"giving authorities the tools they need to fight back\". A spokesperson told Sky News \"councils have the power to crush their vans - leaving waste criminals with nowhere left to hide\". Fast-forward a few days from Brent, and we are filming at a recycling facility in Wokingham, where the van seized by Brent Council will be crushed. That’s the image the councils and government want you to see: perpetrators caught and published. But for now, for most cases, that is far from the truth."
    },
    {
        "title": "Reddit fined more than £14m over children's privacy failures",
        "description": "Reddit has been fined more than &#163;14m by the Information Commissioner's Office for failing to keep children safe.",
        "url": "https://news.sky.com/story/reddit-fined-16314m-by-information-commisioners-office-over-age-verification-checks-13511472",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-social-apps_7099757.jpg?20260224122230",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-24 11:40:00",
        "Headline": "The record fine came after an investigation by the data protection watchdog which found the US company used children's information unlawfully.",
        "Content": "Reddit has been fined more than £14m by the Information Commissioner's Office for failing to keep children safe. It is the largest fine ever handed out by the information watchdog over children's privacy issues. An investigation by the data protection watchdog found the US company used children's information unlawfully. A statement from the ICO said Reddit's failings included not checking the age of users accessing its platform, putting youngsters at risk. It said Reddit failed to: • Apply any robust age assurance mechanism and therefore did not have a lawful basis for processing the personal information of children under the age of 13. • Carry out a data protection impact assessment (DPIA) to assess and mitigate risks to children before January 2025. \n                  Welcome to the fly-tipping capital of England, where locals are 'embarrassed' to live\n                 \n                  'Simply a miracle': Baby boy born from dead donor womb transplant in UK first\n                 \n                  Police still using AI tool despite inaccurate evidence in Israeli football fan ban\n                 John Edwards, UK Information Commissioner, said: \"It's concerning that a company the size of Reddit failed in its legal duty to protect the personal information of UK children. \"Children under 13 had their personal information collected and used in ways they could not understand, consent to or control. That left them potentially exposed to content they should not have seen. This is unacceptable and has resulted in today's fine. \"Let me be clear. Companies operating online services likely to be accessed by children have a responsibility to protect those children by ensuring they're not exposed to risks through the way their data is used. To do this, they need to be confident they know the age of their users and have appropriate, effective age assurance measures in place. \"Reddit failed to meet these expectations. They must do better and we are continuing to consider the age assurance controls now implemented by the platform. \"Relying on users to declare their age themselves is not enough when children may be at risk and we are focusing now on companies that are primarily using this method. I therefore strongly encourage industry to take note, reflect on their practices and urgently make any necessary improvements to their platforms.\" Read more from Sky News:Porn company handed record £1.3m fine by OfcomWill the 'tobacco trials' come back to haunt tech giants?Universal vaccine for cold, flu, COVID and allergies 'a step closer' Reddit told Sky News it intends to appeal the ICO's decision. \"Reddit doesn't require users to share information about their identities, regardless of age, because we are deeply committed to their privacy and safety,\" said a Reddit spokesperson. \"The ICO's insistence that we collect more private information on every UK user is counterintuitive and at odds with our strong belief in our users' online privacy and safety.\" Earlier this month, Imgur owner MediaLab was handed a £250,000 fine for similar issues. In 2023, TikTok ended up with a £12.7m fine after negotiating the ICO down from a £27m penalty. This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "'Simply a miracle': Baby boy born from dead donor womb transplant in UK first",
        "description": "A baby boy has become the first child in Britain to be born to a mother with a womb transplanted from a deceased donor.  ",
        "url": "https://news.sky.com/story/simply-a-miracle-baby-boy-born-from-dead-donor-womb-transplant-in-uk-first-13511093",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-baby-womb-transplant_7173389.jpg?20260224054910",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-24 00:01:00",
        "Headline": "Hugo Powell was delivered by caesarean section in London after his mother underwent transplant surgery in 2024. She said she was the \"happiest I've ever been in my life\".",
        "Content": "A baby boy has become the first child in Britain to be born to a mother with a womb transplanted from a deceased donor.   Hugo Powell was delivered by caesarean section in December, weighing 6lb 13oz (3.1kg), at the Queen Charlotte's and Chelsea Hospital, part of Imperial College Healthcare NHS Trust, in London. Only two other such cases have been reported elsewhere in Europe, while a baby was born from a womb transplanted from a living donor for the first time in the UK last year. Hugo's mother, Grace Bell, an IT programme manager, was born with Mayer-Rokitansky-Kuster-Hauser (MRKH), a rare condition characterised by an underdeveloped or missing womb. \"It's simply a miracle. I never, ever thought that this would be possible,\" Ms Bell said. \"I'm the happiest I've ever been in my life.\" She added: \"When I was 16, I was told that this would never be possible.\" Hugo's father, Steve Powell, works in finance, and the couple, aged in their 30s, live in southern England. Ms Bell said she remembered holding Mr Powell's hand during the birth, and trying to peep over the curtain before Hugo was placed in her arms. Reflecting on the birth, Mr Powell said: \"When he came over the curtain, it was just sort of overwhelming emotions. I felt like I wanted to cry, but couldn't. \"From where we started - first meeting - to where we are today, with Hugo, is nothing short of a miracle after everything we've been through. \"It just felt quite unreal at the time, because this has been a long journey for us both.\" Speaking on Mornings with Ridge and Frost, Ms Bell said: \"About 16 years ago, I was diagnosed with MRKH. It was a tough journey. I must admit, a very sad journey.\" But she added: \"I remember the story of the first womb transplant in Sweden, many years ago now, and following that story intently. \"I still can't believe that I'm here today and I've gone through this. It's just amazing.\" 'The biggest gift' Ms Bell, who broke down in tears when she recalled discovering she was pregnant, said she thinks of her womb donor every day and hopes her family \"find some peace in knowing their daughter gave me the biggest gift, the gift of life\". \"There are no words to say thank you enough to my donor and her family,\" she said. \"Their kindness and selflessness to a complete stranger is the reason I have been able to fulfil my lifelong dream of being a mum. \"I hope they know that my child will always know of their incredible gift, and the miracle that brought him into this world.\" Read more science and technology news:Houston, NASA's next moon mission has a problemHow tampon could detect early signs of cancer Five other organs from the donor were transplanted into four people, saving the lives of others. The donor's parents said: \"Losing our daughter has shattered our world in ways we can barely put into words. \"Yet even in this unimaginable pain, we've found a small measure of solace in knowing that her final act, her choice, was one of pure generosity.\" After being told as a teenager that she had no womb, Ms Bell said she remembers \"going into the hospital toilets and uncontrollably crying\". She told Mr Powell about her diagnosis \"straight away\" when they met. The couple had decided to pursue surrogacy before they became involved in the womb transplant programme. - How do people become womb donors? Potential living donors must first undergo extensive counselling to ensure there is no coercion and that they understand the risks. For deceased donors, the womb is not covered by the normal consent for organ donation. Instead, their families may be approached by the womb transplant research programme to see if they are interested in agreeing to take part. - Is there a shortage of donor wombs? Womb Transplant UK is running two programmes, one involving living donors and another with organs from women who have died. The living donor programme in the UK has so far focused on women with relatives who are willing to consent to a donation.  But the team believes that in the future, the programme could expand to include friends or altruistic donors. Transplants from deceased donors only occur when the families of those who have died are asked specifically if they wish to donate a womb. - Did the NHS pay for the womb transplant? No. Each womb transplant costs about £30,000 and is fully funded by the charity Womb Transplant UK, including payment to the NHS for theatre time and the patient's stay in a ward. The operations are only carried out at times when the NHS is not using an operating theatre, so they do not impact NHS waiting lists. Surgeons and medical staff involved in the transplant have not been paid for their time. Once a patient becomes pregnant through self-funded IVF, the NHS takes over their care, as with any other pregnancy. - Will there be more transplants in the UK? Yes. So far, surgeons have carried out five womb transplants in the UK - two involving a living donor and three using a deceased donor. Two babies have been born - one using a womb from a live donor and the other, as reported here, from a deceased donor. Experts believe a maximum of 20 to 30 womb transplants a year could be carried out in the UK in the future. Hugo's name honours charity chief The couple decided to give Hugo the middle name Richard, after Professor Richard Smith, clinical lead of the charity Womb Transplant UK. Hugo was also given the middle name Norman, after Ms Bell's grandfather. Professor Smith, who was present at the birth, said holding baby Hugo and hearing he would be given his name \"brought a tear to my eye\". \"That did make me cry, straight up. It's been quite emotional, very emotional,\" he said. Ms Bell underwent the seven-hour womb transplant in 2024, before beginning fertility treatment several months later. The couple may decide to have a second baby, after which surgeons will remove the transplanted womb. If the transplanted organ is not removed, Ms Bell would have to stay on immunosuppressant drugs. Wombs from deceased donors are not covered by the normal consent for organ donation, nor by joining the donor register and their families must give specific permission after they have agreed to donate other organs. It is estimated about 25 to 30 babies have been born from deceased womb donations globally. Looking back on the process with Ms Bell at his side Mr Powell called her an \"inspiration\". He said: \"The story, particularly for women, gives them hope in the same circumstances as Grace, with MRKH. \"For my part, it's more just been the emotional support. We are in it together - and making sure Grace didn't feel alone in this whole process.\" Mr Powell added: \"I appreciate she's the one that had gone through the transplant, put a body on the line and got to the point of where we are today.\""
    },
    {
        "title": "BBC says second racist slur was edited out of ceremony, as filmmaker quits as BAFTA judge",
        "description": "The BBC has confirmed that a second racist slur was edited out of the BAFTA ceremony broadcast, but admitted the first was missed and \"aired in error\".",
        "url": "https://news.sky.com/story/filmmaker-jonte-richardson-quits-as-bafta-judge-over-handling-of-racist-slur-at-awards-ceremony-13511468",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-michael-b-jordan-delroy-lindo_7172936.jpg?20260223150015",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2026-02-24 11:39:00",
        "Headline": "The slurs took place towards the start of Sunday night's BAFTA ceremony - the result of an involuntary tic caused by Tourette's - and one went on to be broadcast and streamed on iPlayer.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n The BBC has confirmed that a second racist slur was edited out of the BAFTA ceremony broadcast, but admitted the first was missed and \"aired in error\". Tourette's campaigner John Davidson, who was attending the awards ceremony after inspiring the film, I Swear, which dramatises his life with severe Tourette syndrome, has said he's \"deeply mortified\" his involuntary tics caused him to yell out. He shouted a racial slur while two black actors, Michael B Jordan and Delroy Lindo, were on stage presenting the first award of the night. An email sent to all BBC staff on Tuesday from chief content officer Kate Phillips, and seen by Sky News, apologised for the mistake, and confirmed another racial slur had been removed from the broadcast. Ms Phillips wrote: \"The edit team removed another racial slur from the broadcast. This one was aired in error and we would never have knowingly allowed this to be broadcast. We take full responsibility for what happened.\" She ended the memo by apologising for \"the distress caused\". The ceremony, which had been edited down from three hours to two after taking place on Sunday night, was broadcast with the offending moment intact, and remained available to watch on BBC iPlayer for over 12 hours. \n                  Tourette's campaigner 'deeply mortified' after racial slur at BAFTAs\n                 \n                  Robert Aramayo: The Hull actor who's taken the BAFTAs by storm\n                 \n                  BBC removes BAFTAs from iPlayer and apologises after racial slur yelled during show\n                 Other moments, including director Akinola Davies Jr call to \"free Palestine,\" and filmmaker Paul Thomas Anderson's use of the word \"p***\" were edited out. The broadcaster subsequently took the recording down to edit out the slur. On Tuesday, Labour MP Dawn Butler wrote to the BBC, calling for an \"urgent explanation\" of what happened, saying the N-word \"should never have been aired\" and calling its broadcast \"painful and unforgivable\". Meanwhile, filmmaker Jonte Richardson said he was stepping down as a BAFTA emerging talent judge on Monday, over the organisation's handling of the incident. He said BAFTA has \"repeatedly failed\" to safeguard the black community. In a statement shared online, filmmaker Richardson said he would no longer serve on the emerging talent judging panel due to the organisation's handling of \"the unfortunate Tourette's N-Word incident\". Calling it \"utterly unforgivable,\" the producer and director went on: \"I cannot and will not contribute my time, energy and expertise to an organisation that has repeatedly failed to safeguard the dignity of its Black guests, members and the Black creative community. \"This is particularly unfortunate given that this year's cohort boasts some incredible Black talent, especially one of my favourite shows of 2025 Just Act Normal.\" In subsequent posts, Richardson has made clear he is not pitting black and disabled communities against each other and acknowledges both groups have been negatively impacted by the failure to edit out the racist slur. In a statement released on Monday night, BAFTA apologised for the incident and said it takes \"full responsibility\" for putting its guests in a \"difficult situation\". They apologised \"unreservedly\" to Sinners stars Jordan and Lindo, and \"to all those impacted,\" adding: \"We would like to thank Michael and Delroy for their incredible dignity and professionalism.\" The statement continued: \"We take full responsibility for putting our guests in a very difficult situation and we apologise to all. \"We will learn from this and keep inclusion at the core of all we do, maintaining our belief in film and storytelling as a critical conduit for compassion and empathy.\" Earlier on Monday, the BBC apologised for failing to remove the slur, saying in a statement: \"Some viewers may have heard strong and offensive language during the Bafta Film Awards. \"This arose from involuntary verbal tics associated with Tourette syndrome, and as explained during the ceremony, it was not intentional. \"We apologise that this was not edited out prior to broadcast and it will now be removed from the version on BBC iPlayer.\" The host, Alan Cumming, subsequently acknowledged the interruption and explained again about Tourette's. Richardson has worked in both the UK and the US on projects including Channel 4's Bluefinch and award-winning productions for BET and HBO. He became a BAFTA member in 2011. In a statement to the Press Association, Davidson said he chose to leave the auditorium early as he was \"aware of the distress my tics were causing\". He was made an MBE in 2019 for his efforts to increase understanding of Tourette syndrome, having helped countless families deal with the condition. What is Tourette's? According to the NHS, Tourette syndrome is a condition that causes you to make sudden, repetitive sounds or movements - called tics. There is no cure for the condition, but it can be managed through treatment. Tics can be triggered by stress, excitement or tiredness. The US Centres for Disease Control and Prevention adds that only around one in 10 people with the condition suffer from coprolalia, where a tic is the excessive or uncontrollable use of inappropriate language. It comes after British newcomer Robert Aramayo won best actor at the BAFTAs, beating Timothee Chalamet and Leonardo DiCaprio, with his performance in I Swear. The film tells Davidson's real-life story, based on his 2025 memoir of the same name. Sky News has contacted BAFTA for comment."
    },
    {
        "title": "Government confirms broadcast‑style regulation for Netflix, Disney+ and more",
        "description": "The UK's biggest video-on-demand services will have to follow the same rules on content and accessibility as traditional broadcasters, under new legislation being implemented.",
        "url": "https://news.sky.com/story/streaming-services-like-netflix-to-be-subject-to-same-regulation-as-broadcasters-in-uk-13511559",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-netflix-logo_6822335.jpg?20250207150804",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-24 14:14:00",
        "Headline": "Until now, only licensed TV channels had to comply with Ofcom's broadcasting code and accessibility requirements - and some popular streaming services in the UK were not regulated at all.",
        "Content": "The UK's biggest video-on-demand services will have to follow the same rules on content and accessibility as traditional broadcasters, under new legislation being implemented. Streaming giants including Netflix, Amazon Prime Video and Disney+, and catch-up services like ITV X and Channel 4, are being brought under enhanced regulation by Ofcom. This means they'll have to follow the media watchdog's rules around impartial news reporting, and harmful and offensive content. The legislation will impact streaming services with more than 500,000 UK users, giving Ofcom the power to accept viewer complaints and investigate streaming platforms, as it currently does with broadcast television. This will also apply to the public service broadcaster (PSB) video-on-demand (VoD) services, such as ITVX and Channel 4. VoD services provided by the BBC, such as BBC iPlayer, will continue to be regulated under the Broadcasting Code via the BBC Framework Agreement, for now, but will later be brought under the VoD standards code. Until now, only licensed television channels have had to comply with Ofcom's broadcasting code and accessibility requirements, such as subtitles, meaning that many of the UK's most popular streaming services were not regulated to the same standard. Some were not regulated in the UK at all. \n                  Melania's non-documentary might end up a box office flop - but she won't mind\n                 \n                  Amazon to cut 16,000 jobs globally to streamline operations\n                 \n                  Best and worst parcel delivery companies revealed\n                 Under the new rules, any video-on-demand platform with more than half a million users will automatically be designated a \"Tier 1\" service, bringing them under a new VoD standards code, which will be similar to the Broadcasting Code followed by traditional broadcasters such as the BBC, ITV and Sky News. The new legislation aims to ensure that news is reported accurately and impartially and audiences - particularly children - are protected against \"harmful or offensive\" material. Audiences will be able to complain to Ofcom and, if it considers there has been a breach of the code, it will have the power to take action. Culture Secretary Lisa Nandy said: \"We know that the way audiences watch TV has fundamentally changed. \"Millions now choose to watch content on video-on-demand platforms alongside or, in the case of many young people, instead of traditional TV. \"The Media Act introduced vital updates to our regulatory framework which this government is committed to implementing. \"By bringing the most popular video-on-demand services under enhanced regulation by Ofcom, we are strengthening protections for audiences, creating a level playing field for industry and supporting our vibrant media sector that continues to innovate and drive growth across the UK.\" A public consultation will follow to establish the video-on-demand standards code, giving the public and streamers the chance to put forward their views on what should be included. The standards code will come into effect one year after it is published by Ofcom The move comes as increasing numbers of viewers are abandoning traditional television for on-demand streaming platforms. Two-thirds of households subscribe to at least one of Netflix, Amazon Prime Video or Disney+, with 85% of people using an on-demand service each month, compared with 67% who watch live TV, according to Ofcom's 2025 Media Nations report. Earlier this month, Sky announced it would be bringing Disney+, Netflix, Hayu and HBO Max together under one subscription for the first time."
    }
]