[
    {
        "title": "VE Day: Veterans to join King for tea party as Keir Starmer praises 'selfless dedication'",
        "description": "Veterans are set to join the King for a VE Day tea party today as the prime minister has paid tribute to the \"selfless dedication\" of the war generation.",
        "url": "https://news.sky.com/story/ve-day-veterans-to-join-king-for-tea-party-as-keir-starmer-praises-selfless-dedication-13362063",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-royal-family-buckingham-palace_6906755.jpg?20250505011823",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-04 23:42:00",
        "Headline": "A military procession and flypast are among the events lined up for today - the start of a four-day celebration on the 80th anniversary of the end of the Second World War in Europe.",
        "Content": " Veterans are set to join the King for a VE Day tea party today as the prime minister has paid tribute to the \"selfless dedication\" of the war generation. Among them will be a 99-year-old who took part in the D-Day landings and a 100-year-old woman who worked in the Special Operations Executive, known as Churchill's Secret Army. Director general of the Royal British Legion, Mark Atkinson, said the charity was \"proud\" to be taking a place \"at the heart of these national celebrations and commemorations\" on the 80th anniversary of the end of the Second World War. He said it would be \"one of our last opportunities as a nation to pay tribute to those veterans still with us today\". Evacuees from World War Two and veterans who were still in active conflict after VE Day are among the other guests set to attend the tea party, which will take place in the presence of the King and other members of the Royal Family. At 12pm, the Royal Family will observe a military procession, followed by a flypast. It will be the first major VE Day anniversary without any of the royals who stood on the balcony of Buckingham Palace on the day victory in Europe was declared, after the death of the late Queen Elizabeth II in 2022. \n                  VE Day: WWII codebreaker recalls chance encounter with Churchill as he took part in 'deliberate ruse'\n                 \n                  WWII Mosquito pilot who carried out 50 bombing raids across Germany shares memories of VE Day\n                 \n                  Royal Family 'fully focused' on VE Day, palace aide says after Prince Harry's interview\n                 'Not just for Britain' The celebrations come as Prime Minister Sir Keir Starmer praised veterans for their \"selfless dedication\" and thanked them for a \"debt that can never fully be repaid\" in an open letter ahead of VE Day. He said the stories which will be heard this week from those who fought in the Second World War would be a reminder that the victory \"was not just for Britain\" but was also \"a victory for good against the assembled forces of hatred, tyranny and evil\". Sir Keir said the WW2 veterans \"represent the best of who we are\" and that without their service \"the freedom, peace and joy that these celebrations embody, would not be possible\".  Personnel from NATO allies the US, France and Germany will be among those taking part in the procession in London. The commemorations will begin with the words of Sir Winston Churchill's 1945 victory speech, spoken by actor Timothy Spall. Thousands of people are expected to line the streets of the capital to witness the celebrations.  Read more:What's happening to mark the 80th anniversary of VE Day?When and where to watch VE Day flypastAugmented reality brings to life the stories of VE Day 80 years on On the anniversary itself on Thursday, marking exactly 80 years since the Allies formally accepted Germany's surrender, a service of commemoration will be held at Westminster Abbey, to include a national two minutes' silence. Pubs across England and Wales, which usually close at 11pm, will also stay open for an extra two hours to allow punters more time to celebrate."
    },
    {
        "title": "Netanyahu vows to retaliate against Houthis and Iran after missile attack",
        "description": "Israeli Prime Minister Benjamin Netanyahu has vowed to retaliate against the Houthis and their Iranian \"masters\" after the group launched a missile attack on the country's main international airport.",
        "url": "https://news.sky.com/story/netanyahu-vows-to-retaliate-against-houthis-and-iran-after-missile-attack-13361736",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-israel-ben-gurion-houthis_6906294.jpg?20250504173405",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-04 16:26:00",
        "Headline": "The missile impact left a plume of smoke and briefly halted flights and commuter traffic at the airport. Some international carriers have cancelled flights to and from Tel Aviv for several days.",
        "Content": " Israeli Prime Minister Benjamin Netanyahu has vowed to retaliate against the Houthis and their Iranian \"masters\" after the group launched a missile attack on the country's main international airport. A missile fired by the group from Yemen landed near Ben Gurion Airport, causing panic among passengers in the terminal building. \"Attacks by the Houthis emanate from Iran,\" Mr Netanyahu wrote on X. \"Israel will respond to the Houthi attack against our main airport AND, at a time and place of our choosing, to their Iranian terror masters.\" The missile impact left a plume of smoke and briefly halted flights and commuter traffic at the airport. Some international carriers have cancelled flights to and from Tel Aviv for several days. Four people were lightly wounded, paramedic service Magen David Adom said. Air raid sirens went off across Israel and footage showed passengers yelling and rushing for cover. The attack came hours before senior Israeli cabinet ministers were set to vote on whether to intensify the country's military operations in the Gaza Strip, and as the army began calling up thousands of reserves in anticipation of a wider operation in the enclave. \n                  Terror arrests came in context of raised warnings about Iran, with ongoing chaos in its own backyard\n                 \n                  Fast and furious: 100 days of Trump\n                 \n                  Number killed in Iran explosion rises to 65 after Tehran denied blast was 'linked to fuel for missiles'\n                 Houthi military spokesperson Brigadier General Yahya Saree said the group fired a hypersonic ballistic missile at the airport. Iran's defence minister later told a state TV broadcaster that if the country was attacked by the US or Israel, it would target their bases, interests and forces where necessary. Israel's military said several attempts to intercept the missile were unsuccessful. Air, road and rail traffic were halted after the attack, police said, though it resumed around an hour later. In a statement on their Telegram channel, the Israel Defence Forces (IDF) said that the initial inquiry into the fallen missile found the likely cause was a \"technical issue with the interceptor launched toward the missile\". Furthermore, the IDF's assessment found \"no malfunction\" in the detection procedure, interception systems or Homefront Command alert mechanisms. The Houthi group said in a statement that, in response to what it described as an \"escalation\" of Israeli operations in Gaza, it would now \"impose a comprehensive air blockade\" on Israel, specifically targeting airports including Ben Gurion Airport. The group called on international airlines to cancel all flights to Israeli airports to \"preserve the safety of their aircraft and their customers\". Yemen's Houthis have been firing missiles at Israel since its war with Hamas in Gaza began on 7 October 2023, and while most have been intercepted, some have penetrated the country's missile defence systems and caused damage. Israel has previously struck the group in Yemen in retaliation and the US and UK have also launched strikes after the Houthis began attacking international shipping, saying it was in solidarity with Palestinians over Israel's war with Hamas."
    },
    {
        "title": "Fourteen children arrested on suspicion of manslaughter over Gateshead fire released on bail",
        "description": "All 14 children arrested on suspicion of manslaughter after a boy died in a fire have been released on police bail, officers said.",
        "url": "https://news.sky.com/story/fourteen-children-arrested-on-suspicion-of-manslaughter-over-gateshead-fire-released-on-bail-13361896",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gateshead-fire-fairfield_6905518.jpg?20250503213548",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-04 18:43:00",
        "Headline": "Layton Carr, 14, was found dead near the site of a fire at Fairfield industrial park in the Bill Quay area of Gateshead on Friday.",
        "Content": "All 14 children arrested on suspicion of manslaughter after a boy died in a fire have been released on police bail, officers said. Layton Carr, 14, was found dead near the site of a fire at Fairfield industrial park in the Bill Quay area of Gateshead on Friday. Northumbria Police said on Saturday that they had arrested 11 boys and three girls in connection with the incident. In an update on Sunday, a Northumbria Police spokesman said: \"All those arrested have since been released on police bail pending further inquiries.\"  Firefighters raced to the industrial site shortly after 8pm on Friday, putting out the blaze a short time later. Police then issued an appeal for Carr, who was believed to be in the area at that time. In a statement on Saturday, the force said that \"sadly, following searches, a body believed to be that of 14-year-old Layton Carr was located deceased inside the building\". \n                  Pictured: Boy killed in Gateshead industrial estate fire - 14 children arrested on suspicion of manslaughter\n                 \n                  Fourteen children arrested on suspicion of manslaughter after industrial fire in Gateshead\n                 \n                  'Sensitive military documents' found in Newcastle street\n                 David Thompson, headteacher of Hebburn Comprehensive School, where Layton was a pupil, said the school community was \"heartbroken\". Mr Thompson described him as a \"valued and much-loved member of Year 9\" and said he would be \"greatly missed by everyone\". He added that the school's \"sincere condolences\" were with Layton's family and that the community would \"rally together to support one another through this tragedy\". A fundraising page on GoFundMe has been set up to help Layton's mother pay for funeral costs. Organiser Stephanie Simpson said: \"The last thing Georgia needs to stress trying to pay for a funeral for her Boy Any donations will help thank you.\" One tribute in a Facebook post read: \"Can't believe I'm writing this my nephew RIP Layton 💔 forever 14 you'll be a massive miss, thinking of my sister and 2 beautiful nieces right now.\" Detective Chief Inspector Louise Jenkins, of Northumbria Police, also said: \"This is an extremely tragic incident where a boy has sadly lost his life.\" She added that the force's \"thoughts are with Layton's family as they begin to attempt to process the loss of their loved one\". They are working to establish \"the full circumstances surrounding the incident\" and officers will be in the area to \"offer reassurance to the public\", she added. A cordon remains in place at the site while police carry out enquiries."
    },
    {
        "title": "Royal Family 'fully focused' on VE Day, palace aide says after Prince Harry's interview",
        "description": "The Royal Family are \"fully focused\" on this week's VE Day events and celebrating the \"selfless devotion, duty and service\" of the wartime generation, despite Prince Harry's shock interview.",
        "url": "https://news.sky.com/story/royal-family-fully-focused-on-ve-day-palace-aide-says-after-prince-harrys-interview-13361777",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-king-charles-the-king_6906353.jpg?20250504180416",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-05-04 16:57:00",
        "Headline": "A palace aide said that \"The King, Queen and other members of The Royal Family are much looking forward to all the week's VE Day events\".",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  The Royal Family are \"fully focused\" on this week's VE Day events and celebrating the \"selfless devotion, duty and service\" of the wartime generation, despite Prince Harry's shock interview. Speaking ahead of Monday's events in central London, a palace aide said: \"The King, Queen and other members of The Royal Family are much looking forward to all the week's VE Day events, when they will unite with the rest of the nation and those across the Commonwealth and wider world in celebrating, commemorating and giving thanks to the wartime generation whose selfless devotion duty and service should stand as an enduring example to us all - and must never be forgotten.\" It's understood that the family are keen that out of respect for the surviving veterans, nothing will \"detract or distract\" from celebrating the precious victory and the brave souls who contributed to it. On Monday, the King and Queen will be joined by the Prince and Princess of Wales and other members of the family for a parade and fly past centred around Buckingham Palace. They will also join Sir Keir Starmer and World War Two veterans on a platform on the Queen Victoria Memorial in front of the palace. Read more:What are the four-day celebrations to mark VE Day?What VE Day was really like - 80 years on In a shock interview on Friday, Prince Harry opened up about still being estranged from his family, saying his father will not speak to him but that he still has hopes for reconciliation. \n                  Meghan posts new photo of Prince Harry with children after royal backlash\n                 \n                  Harry's intention may have been to extend the most public olive branch, but it could cause more hurt\n                 \n                  Prince Harry says loss of security protection makes it 'impossible' to bring Meghan and children to UK\n                 The duke told BBC News: \"Life is precious. I don't know how much longer my father has, he won't speak to me because of this security stuff. It would be nice to reconcile.\"  Ailsa Anderson, a former press secretary to the late Queen, told Sky News on Friday that Buckingham Palace would be \"raising their eyes heavenwards\" in reaction to the interview. \"Prince Harry is saying 'I don't know how long my father has' - that's going to cause real concern and more speculation in the media and the wider public about what his diagnosis is, which is incredibly unhelpful going forward,\" she told Sky's Sophy Ridge. Meanwhile, the Duchess of Sussex earlier posted a photo of Prince Harry and their children in an apparent show of solidarity. The black and white image, which was not accompanied by a message on Meghan's Instagram account, showed Harry, from behind, walking with Princess Lilibet on his shoulders and Prince Archie holding his hand as they made their way through a garden."
    },
    {
        "title": "Infected blood scandal: Victims 'scared they won't live to see compensation'",
        "description": "People who were given infected blood while receiving NHS care are \"scared they won't live to see compensation\", according to campaigners.",
        "url": "https://news.sky.com/story/infected-blood-scandal-victims-scared-they-wont-live-to-see-compensation-13361996",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-nhs-infected-blood_6906611.jpg?20250504220401",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-04 23:01:00",
        "Headline": "The inquiry into the scandal is set to reopen later this week amid concerns about delays to compensation, despite a commitment of £11.8bn in last year's budget.",
        "Content": "People who were given infected blood while receiving NHS care are \"scared they won't live to see compensation\", according to campaigners. The Infected Blood Inquiry is set to reopen later this week to examine the \"timeliness and adequacy\" of the government's response to compensation. Gary Webster, who was infected with HIV and hepatitis C when he attended Lord Mayor's Treloar's School in Hampshire in 1970s and 1980s said he felt things had \"gone downhill\" since the inquiry published its report last May. Mr Webster told the PA news agency that progress was \"too slow\" and there seemed to be \"a random system\" to choose who receives compensation. \"We fought for so many years to get to this stage… and now they're saying they hope to pay all the infected by the end of 2027 and they hope to pay the affected by the end of 2029,\" he said. \"Well, there's two people dying a week - you only have to do the sums yourself to work out that's a lot of people that aren't going to get paid, aren't going to get the justice and will die not knowing what happened.\" \"I think people are scared now that they're not going to survive until they get compensation,\" Mr Webster added. \n                  Ten victims of infected blood scandal to receive total of around £13m, Cabinet Office says\n                 \n                  Families of infected blood scandal victims call for changes to compensation scheme\n                 \n                  Infected blood victims 'livid' with 'paltry' compensation offer\n                 Another former pupil of the school who was infected with hepatitis C, Glenn Wilkinson, last year told Sky News that the compensation offer was \"paltry\". The Haemophilia Society said the scandal had \"ruined\" people's lives, with compensation delays having \"added to their suffering\". The Hepatitis C Trust said it hoped reopening the inquiry would \"bring about a step change in the government's attitude to the people impacted by this terrible scandal\".  Between the 1970s and early 1990s, more than 30,000 people in the UK were infected with HIV and hepatitis C while receiving NHS care. Some 3,000 people have died after they were given contaminated blood and blood products, while survivors live with lifelong implications. 'Restless for progress' In last October's Budget, Chancellor Rachel Reeves committed £11.8bn to compensate victims of the infected blood scandal. The compensation scheme is administered by the Infected Blood Compensation Authority (IBCA), which as of 24 April, has invited 475 people to make a claim and made 77 payments totalling more than £78m, according to its figures. Campaigners will give evidence during the inquiry's latest hearings, as well as Cabinet Office minister Nick Thomas-Symonds, who said last month that he was \"restless for progress\" in handing out compensation. Sir Brian Langstaff, the inquiry's chairman, has said the victims and families of those affected have been left distressed and powerless by the government's approach and that both those infected and affected \"do not have time on their side\". Read more from Sky News:When and where to watch VE Day flypast routeMeghan posts new photo of Prince Harry after backlash An IBCA spokesperson said its priority was \"paying as many people as soon as possible\" and that it was using what it had learned \"to increase the number of claims each week\". A government spokesperson said it was \"fully committed to cooperating with the inquiry\" and was working to deliver \"one of the most comprehensive compensation schemes in modern history\"."
    },
    {
        "title": "Recovery of sunken Bayesian superyacht begins off coast of Italy",
        "description": "Marine experts have started the recovery of a superyacht from the seabed off the Italian coast.",
        "url": "https://news.sky.com/story/recovery-of-sunken-bayesian-superyacht-begins-off-coast-of-italy-13362010",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-italy-bayesian-superyacht_6906658.jpg?20250504230851",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-04 21:30:00",
        "Headline": "The yacht sank near Sicily last August, killing tech tycoon Mike Lynch and five others, including his 18-year-old daughter Hannah.",
        "Content": "Marine experts have started the recovery of a superyacht from the seabed off the Italian coast. The British-flagged Bayesian sank near Sicily last summer, killing tech business tycoon Mike Lynch, his daughter and five others. The recovery will be carried out by two floating cranes - Hebo Lift 2 and Hebo Lift 10. The latter is one of the most powerful maritime cranes in Europe and arrived from Rotterdam at the port of Termini Imerese in Sicily on Saturday. Operations are being supervised by the Italian coast guard, who are also ensuring the safety of personnel working on the recovery. The recovery effort is expected to last somewhere between 20 and 25 days, before investigators start examining the wreckage. The captain and two crew members are under investigation in connection with the sinking on 19 August last year. \n                  What it was like seeing the open coffin of Pope Francis\n                 \n                  Pope Francis's final moments reveal how quickly he deteriorated before death\n                 \n                  A pope of firsts, Francis was an outspoken champion of the deprived - but left some feeling betrayed\n                 The superyacht, which was 183ft long and weighed 473 tonnes, sank after what appears to have been a sudden powerful burst of wind from a thunderstorm. Coast guard captain Nicola Silvestri said the yacht's 246ft aluminium mast, the second tallest in the world, will be cut to allow the hull to be brought to the surface more easily. In addition to 59-year-old Mr Lynch and his 18-year-old daughter Hannah, chairman of investment banking company Morgan Stanley International Jonathan Bloomer and his wife Judy, lawyer Chris Morvillo and wife Neda, and the ship's cook Recaldo Thomas died in the incident. In the initial rescue phase, 15 of the 22 people were taken to safety, one body was recovered, and six others were reported missing. The bodies of the six reported missing were found during a significant search effort, which continued until 23 August. Read more from Sky News:Woman missing for more than 60 years found 'alive and well'Meghan posts new photo of Prince Harry amid backlash At a pre-inquest review into the deaths of Mr Lynch, Miss Lynch and Mr and Mrs Bloomer last month, the Marine Accident Investigation Branch (MAIB) said it hoped to publish its interim report in the coming weeks. Its principal investigator, Simon Graves, told the hearing the organisation was \"relatively early\" in its investigation, with its final report due to follow in a matter of \"months, not weeks\"."
    },
    {
        "title": "Police foil bomb plot targeting Lady Gaga's biggest-ever show on Copacabana beach",
        "description": "Brazilian police say they foiled a bomb attack planned for a Lady Gaga concert on Rio de Janeiro's Copacabana beach that attracted an estimated 2.1 million people.",
        "url": "https://news.sky.com/story/police-foil-bomb-plot-targeting-lady-gagas-biggest-ever-show-on-copacabana-beach-13361275",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-lady-gaga-copacabana-beach_6905650.jpg?20250504034928",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-04 01:21:00",
        "Headline": "The plot was orchestrated by a group promoting hate speech and the radicalisation of teenagers, police said, with the recruiters identifying themselves as Gaga's fans, known as \"Little Monsters\".",
        "Content": " Brazilian police say they foiled a bomb attack planned for a Lady Gaga concert on Rio de Janeiro's Copacabana beach that attracted an estimated 2.1 million people. The plot was orchestrated by a group promoting hate speech and the radicalisation of teenagers, including self-harm and violent content as a form of social belonging, according to the Civil Police of Rio de Janeiro, which worked in coordination with the country's justice ministry. \"The suspects were recruiting participants, including minors, to carry out coordinated attacks using improvised explosives and Molotov cocktails,\" the force said. The justice ministry said the recruiters identified themselves as Gaga's fans, known as \"Little Monsters\". It said Operation Fake Monster was based on a report by the ministry's cyber operations lab following a tip-off from Rio state police intelligence, which uncovered digital cells encouraging violent behaviour among teenagers using coded language and extremist symbolism. Authorities carried out over a dozen search and seizure warrants, and a man described as the group's leader was arrested in the southern state of Rio Grande do Sul for illegal possession of a firearm, and a teenager was detained in Rio de Janeiro for storing child abuse images. In a statement, a spokesperson for Lady Gaga said: \"We learned about this alleged threat via media reports this morning. \"Prior to and during the show, there were no known safety concerns, nor any communication from the police or authorities to Lady Gaga regarding any potential risks. \"Her team worked closely with law enforcement throughout the planning and execution of the concert and all parties were confident in the safety measures in place.\" Gaga's biggest ever show Some 500,000 tourists travelled to watch the concert, which was paid for by the city in an attempt to boost the struggling economy. Saturday night's two-hour show, which marked Gaga's biggest ever, marked the first time she had played in Brazil since 2012, having cancelled an appearance at the Rock in Rio festival in 2017 over health issues. Gaga, who released her seventh studio album, Mayhem, in March, opened with a dramatic, operatic edition of her 2011 track Bloody Mary, before launching into Abracadabra, a recent track. \"Brazil! I missed you. I missed you so much,\" she exclaimed, before launching into Poker Face, one of her biggest hits. The American pop star drew in a similar crowd to Madonna's in May last year, who performed at the same beach, which is transformed into an enormous dance floor for the shows. Addressing the crowd in English and through a Portuguese translator, Gaga became emotional as she said: \"I'm so honoured to be here with you tonight. \"Tonight we're making history, but no one makes history alone. Without all of you, the incredible people of Brazil, I wouldn't have this moment. Thank you for making history with me. \"The people of Brazil are the reason I get to shine today. But of all the things I can thank you for, the one I most am grateful for is this: that you waited for me. You waited more than 10 years for me.\" She said it took so long to come back because she was \"healing\" and \"getting stronger\". The pop sensation cancelled many of her shows in 2017 and 2018 due to her fibromyalgia condition, which can cause pain and fatigue. It is estimated Gaga's show will have injected around 600 million reais (£79.9m) into the economy, nearly 30% more than Madonna's show. Read more:John Lithgow on JK Rowling's trans stance backlashWhy are the band Kneecap controversial? The large-scale free shows are set to continue annually until at least 2028, always taking place in May, which is considered the economy's \"low season\", according to the city's government. A hefty security plan was in place, including the presence of 3,300 military and 1,500 police officers, along with 400 military firefighters. 'A dream come true' The city has been swarmed with Gaga fans since her arrival on Tuesday, with some even keeping vigil outside of the hotel she has been staying at. Many arrived at the beach at the crack of dawn on Saturday to secure good spots on the beach, despite the show not starting until 9.45pm. Ana Lara Folador, who attended with her sister, said it was \"a dream come true\", and that Gaga had \"really shaped a part of my personality, as a person and an artist\". Ingrid Serrano, a 30-year-old engineer who made a cross-continent trip from Colombia to Brazil to attend the show, turned up in a T-shirt featuring Lady Gaga's outlandish costumes over the years. \"I've been a 100% fan of Lady Gaga my whole life,\" she said, adding the 39-year-old megastar represented \"total freedom of expression - being who one wants without shame\". Matheus Silvestroni, 25, an aspiring DJ and a Gaga fan since the age of 12, endured an eight-hour bus ride from Sao Paulo for the show. He said it was Gaga who had inspired him to embrace his sexuality and pursue his dream of becoming an artist. \"I was bullied because I was a fat, gay kid, so I was an easy target,\" he said. \"Gaga was very important because she sent a message that everything was okay with me, I wasn't a freak, because I was 'Born This Way'.\" Rio is known for holding massive open-air concerts, with Rod Stewart holding a Guinness World Record for the four million-strong crowd he drew to Copacabana beach in 1994."
    },
    {
        "title": "Football bodies could be forced to pay towards brain injury care costs of ex-players",
        "description": "Football bodies could be forced to pay towards the care costs of ex-players who have been diagnosed with brain conditions, under proposals set to be considered by MPs.",
        "url": "https://news.sky.com/story/football-bodies-could-be-forced-to-pay-towards-brain-injury-care-costs-of-ex-players-13362050",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-football-istock_6906738.jpg?20250505002018",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-04 23:01:00",
        "Headline": "Campaigners say existing support for former players diagnosed with brain conditions, such as dementia, is not fit for purpose.",
        "Content": "Football bodies could be forced to pay towards the care costs of ex-players who have been diagnosed with brain conditions, under proposals set to be considered by MPs. Campaigners are drafting amendments to the Football Governance Bill, which would treat conditions caused by heading balls as an \"industrial injuries issue\". The proposals seek to require the football industry to provide the necessary financial support. Campaigners say existing support is not fit for purpose, including the Brain Health Fund which was set up with an initial £1m by the Professional Footballers' Association (PFA), supported by the Premier League. But the Premier League said the fund has supported 121 families with at-home adaptations and care home fees. From England's 1966 World Cup-winning team, both Jack and Bobby Charlton died with dementia, as did Martin Peters, Ray Wilson and Nobby Stiles. Ex-players, including former Liverpool defender Neil Ruddock, went to parliament last week to lobby MPs. \n                  Bristol Rovers legend taking legal action against FA over brain condition says he has just years to live\n                 \n                  Simple blood test that could detect dementia at early stage begins trial in NHS clinics\n                 \n                  Former Manchester United defender David May shares dementia fears\n                 Ruddock told Sky News he had joined campaigners \"for the families who've gone through hell\". \"A professional footballer, greatest job in the world, but no one knew the dangers, and that's scary,\" he said. \"Every time someone heads a ball it's got to be dangerous to you. You know, I used to head 100 balls a day in training. I didn't realise that might affect my future.\" A study co-funded by the PFA and the Football Association (FA) in 2019 found footballers were three and a half times more likely to die of a neurodegenerative disease than members of the public of the same age. 'In denial' Among those calling on football authorities to contribute towards the care costs of ex-players who have gone on to develop conditions such as Alzheimer's and dementia is Labour MP Chris Evans. Mr Evans, who represents Caerphilly in South Wales, hopes to amend the Bill to establish a care and financial support scheme for ex-footballers and told a recent event in parliament that affected ex-players \"deserve to be compensated\". Greater Manchester Mayor Andy Burnham, who helped to draft the amendment, said the game was \"in denial about the whole thing\". Mr Burnham called for it to be seen as \"an industrial injuries issue in the same way with mining\". In January, David Beckham lent his support to calls for greater support for footballers affected by dementia. One of the amendments says that \"the industry rather than the public should bear the financial burden\". Read more from Sky News:Woman missing for more than 60 years found 'alive and well'Meghan posts new photo of Prince Harry amid backlash A spokesperson for the FA said it was taking a \"leading role in reviewing and improving the safety of our game\" and that it had \"already taken many proactive steps to review and address potential risk factors\". An English Football League spokesperson said it was \"working closely with other football bodies\" to ensure both professional and grassroots football are \"as safe as it can be\". The PFA and Premier League declined to comment."
    },
    {
        "title": "Eight arrests in connection with two separate terrorism investigations",
        "description": "Eight men have been arrested by the Metropolitan Police in two unconnected but \"significant\" terrorism investigations.",
        "url": "https://news.sky.com/story/eight-men-arrested-in-connection-with-suspected-terrorist-plot-13361274",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-cheadle-hulme-greater-manchester_6905852.jpg?20250504131249",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-04 00:14:00",
        "Headline": "Counter-terror police arrested five men in one investigation and a further three in another. Both operations concerned Iranian nationals, though were not connected to each other, police said.",
        "Content": " Eight men have been arrested by the Metropolitan Police in two unconnected but \"significant\" terrorism investigations. In one operation on Saturday, counter-terror officers arrested five men - four of whom are Iranian nationals - as they swooped in on various locations around the country. All are in police custody. The Met said the arrests related to a \"suspected plot to target a specific premises\". In an update shortly after midnight, the force said: \"Officers have been in contact with the affected site to make them aware and provide relevant advice and support, but for operational reasons, we are not able to provide further information at this time.\" Commander Dominic Murphy, head of the Met's Counter Terrorism Command, said: \"Counter-terrorism policing, supported by police and colleagues from across the country, have conducted arrests in two really significant operations, both of which have been designed to keep the public safe from threats. \"There are several hundred officers and staff working on this investigation, and we will work very hard to ensure we understand the threats to the wider public.\" He refused to say if the plot was related to Israel, but described it as \"certainly significant\" and said \"it is unusual for us to conduct this scale of activity\".  He also asked the public to \"avoid speculation and some of the things that are being posted online\". MI5 director general Ken McCallum said in October that the intelligence agency had responded to 20 \"potentially lethal\" Iran-backed plots since 2022. He warned of the risk of an \"increase or broadening of Iranian state aggression in the UK\". Read more: Terror arrests came in context of raised warnings about Iran Children 'petrified' by armed police Rochdale resident Kyle Warren, who witnessed one of the arrests at a neighbouring house, said his children had been playing in the garden when they came running into the house, saying a man in a mask had told them to go inside. \"Obviously, I was a bit worried,\" Mr Warren told Sky News' Lisa Dowd, and so he went into the garden to investigate. \"As we've come out, we just heard a massive bang, seen loads of police everywhere with guns, shouting at us to get inside the house.\" From upstairs in his house, he then heard \"loads of shouting in the house\" and saw a man being pulled out of the back of the house, \"dragged down the side entry and thrown into all the bushes and then handcuffed\". There were about 20 to 30 officers with guns, he believes. \"It's just shocking, really. You don't expect it on your doorstep.\" His daughters were \"petrified... I don't think they've ever seen a gun, so to see 20 masked men with guns running round was quite scary for them\". Mr Warren, who only moved into his house a year ago, said he had \"never really seen anyone going in or out\" of the house and actually thought it was empty. Arrests and searches around the country The Met added officers were carrying out searches at a number of addresses in the Greater Manchester, London and Swindon areas in connection with the investigation. It said those detained were: • A 29-year-old man arrested in the Swindon area• A 46-year-old man arrested in west London• A 29-year-old man arrested in the Stockport area• A 40-year-old man arrested in the Rochdale area• A man whose age was not confirmed arrested in the Manchester area. Terror arrests in separate investigation Police also arrested three further Iranian nationals in London on Saturday as part of another, unrelated counter-terror investigation. The suspects were detained under section 27 of the National Security Act 2023, which allows police to arrest those suspected of being \"involved in foreign power threat activity\". Read more from Sky News:Pictured: Boy killed in fire - 14 children arrestedLady Gaga puts on biggest-ever show for free Home Secretary Yvette Cooper said: \"These were two major operations that reflect some of the biggest counter state threat and counter terrorism operations that we have seen in recent years. \"This reflects the complexity of the kinds of challenges to our national security that we continue to face.\" Earlier, she thanked police and security services in a statement, and called the incidents \"serious events that demonstrate the ongoing requirement to adapt our response to national security threats\". Last year, the government placed the whole of the Iranian state - including its intelligence services - on the enhanced tier of the new foreign influence registration scheme. It means anyone asked by Iran to carry out actions for the state must declare it, or face prison time."
    },
    {
        "title": "VE Day: Veterans to join King for tea party as Keir Starmer praises 'selfless dedication'",
        "description": "Veterans are set to join the King for a VE Day tea party today as the prime minister has paid tribute to the \"selfless dedication\" of the war generation.",
        "url": "https://news.sky.com/story/ve-day-veterans-to-join-king-for-tea-party-as-keir-starmer-praises-selfless-dedication-13362063",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-royal-family-buckingham-palace_6906755.jpg?20250505011823",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-04 23:42:00",
        "Headline": "A military procession and flypast are among the events lined up for today - the start of a four-day celebration on the 80th anniversary of the end of the Second World War in Europe.",
        "Content": " Veterans are set to join the King for a VE Day tea party today as the prime minister has paid tribute to the \"selfless dedication\" of the war generation. Among them will be a 99-year-old who took part in the D-Day landings and a 100-year-old woman who worked in the Special Operations Executive, known as Churchill's Secret Army. Director general of the Royal British Legion, Mark Atkinson, said the charity was \"proud\" to be taking a place \"at the heart of these national celebrations and commemorations\" on the 80th anniversary of the end of the Second World War. He said it would be \"one of our last opportunities as a nation to pay tribute to those veterans still with us today\". Evacuees from World War Two and veterans who were still in active conflict after VE Day are among the other guests set to attend the tea party, which will take place in the presence of the King and other members of the Royal Family. At 12pm, the Royal Family will observe a military procession, followed by a flypast. It will be the first major VE Day anniversary without any of the royals who stood on the balcony of Buckingham Palace on the day victory in Europe was declared, after the death of the late Queen Elizabeth II in 2022. \n                  VE Day: WWII codebreaker recalls chance encounter with Churchill as he took part in 'deliberate ruse'\n                 \n                  WWII Mosquito pilot who carried out 50 bombing raids across Germany shares memories of VE Day\n                 \n                  Royal Family 'fully focused' on VE Day, palace aide says after Prince Harry's interview\n                 'Not just for Britain' The celebrations come as Prime Minister Sir Keir Starmer praised veterans for their \"selfless dedication\" and thanked them for a \"debt that can never fully be repaid\" in an open letter ahead of VE Day. He said the stories which will be heard this week from those who fought in the Second World War would be a reminder that the victory \"was not just for Britain\" but was also \"a victory for good against the assembled forces of hatred, tyranny and evil\". Sir Keir said the WW2 veterans \"represent the best of who we are\" and that without their service \"the freedom, peace and joy that these celebrations embody, would not be possible\".  Personnel from NATO allies the US, France and Germany will be among those taking part in the procession in London. The commemorations will begin with the words of Sir Winston Churchill's 1945 victory speech, spoken by actor Timothy Spall. Thousands of people are expected to line the streets of the capital to witness the celebrations.  Read more:What's happening to mark the 80th anniversary of VE Day?When and where to watch VE Day flypastAugmented reality brings to life the stories of VE Day 80 years on On the anniversary itself on Thursday, marking exactly 80 years since the Allies formally accepted Germany's surrender, a service of commemoration will be held at Westminster Abbey, to include a national two minutes' silence. Pubs across England and Wales, which usually close at 11pm, will also stay open for an extra two hours to allow punters more time to celebrate."
    },
    {
        "title": "Eight arrests in connection with two separate terrorism investigations",
        "description": "Eight men have been arrested by the Metropolitan Police in two unconnected but \"significant\" terrorism investigations.",
        "url": "https://news.sky.com/story/eight-men-arrested-in-connection-with-suspected-terrorist-plot-13361274",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-cheadle-hulme-greater-manchester_6905852.jpg?20250504131249",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-04 00:14:00",
        "Headline": "Counter-terror police arrested five men in one investigation and a further three in another. Both operations concerned Iranian nationals, though were not connected to each other, police said.",
        "Content": " Eight men have been arrested by the Metropolitan Police in two unconnected but \"significant\" terrorism investigations. In one operation on Saturday, counter-terror officers arrested five men - four of whom are Iranian nationals - as they swooped in on various locations around the country. All are in police custody. The Met said the arrests related to a \"suspected plot to target a specific premises\". In an update shortly after midnight, the force said: \"Officers have been in contact with the affected site to make them aware and provide relevant advice and support, but for operational reasons, we are not able to provide further information at this time.\" Commander Dominic Murphy, head of the Met's Counter Terrorism Command, said: \"Counter-terrorism policing, supported by police and colleagues from across the country, have conducted arrests in two really significant operations, both of which have been designed to keep the public safe from threats. \"There are several hundred officers and staff working on this investigation, and we will work very hard to ensure we understand the threats to the wider public.\" He refused to say if the plot was related to Israel, but described it as \"certainly significant\" and said \"it is unusual for us to conduct this scale of activity\".  He also asked the public to \"avoid speculation and some of the things that are being posted online\". MI5 director general Ken McCallum said in October that the intelligence agency had responded to 20 \"potentially lethal\" Iran-backed plots since 2022. He warned of the risk of an \"increase or broadening of Iranian state aggression in the UK\". Read more: Terror arrests came in context of raised warnings about Iran Children 'petrified' by armed police Rochdale resident Kyle Warren, who witnessed one of the arrests at a neighbouring house, said his children had been playing in the garden when they came running into the house, saying a man in a mask had told them to go inside. \"Obviously, I was a bit worried,\" Mr Warren told Sky News' Lisa Dowd, and so he went into the garden to investigate. \"As we've come out, we just heard a massive bang, seen loads of police everywhere with guns, shouting at us to get inside the house.\" From upstairs in his house, he then heard \"loads of shouting in the house\" and saw a man being pulled out of the back of the house, \"dragged down the side entry and thrown into all the bushes and then handcuffed\". There were about 20 to 30 officers with guns, he believes. \"It's just shocking, really. You don't expect it on your doorstep.\" His daughters were \"petrified... I don't think they've ever seen a gun, so to see 20 masked men with guns running round was quite scary for them\". Mr Warren, who only moved into his house a year ago, said he had \"never really seen anyone going in or out\" of the house and actually thought it was empty. Arrests and searches around the country The Met added officers were carrying out searches at a number of addresses in the Greater Manchester, London and Swindon areas in connection with the investigation. It said those detained were: • A 29-year-old man arrested in the Swindon area• A 46-year-old man arrested in west London• A 29-year-old man arrested in the Stockport area• A 40-year-old man arrested in the Rochdale area• A man whose age was not confirmed arrested in the Manchester area. Terror arrests in separate investigation Police also arrested three further Iranian nationals in London on Saturday as part of another, unrelated counter-terror investigation. The suspects were detained under section 27 of the National Security Act 2023, which allows police to arrest those suspected of being \"involved in foreign power threat activity\". Read more from Sky News:Pictured: Boy killed in fire - 14 children arrestedLady Gaga puts on biggest-ever show for free Home Secretary Yvette Cooper said: \"These were two major operations that reflect some of the biggest counter state threat and counter terrorism operations that we have seen in recent years. \"This reflects the complexity of the kinds of challenges to our national security that we continue to face.\" Earlier, she thanked police and security services in a statement, and called the incidents \"serious events that demonstrate the ongoing requirement to adapt our response to national security threats\". Last year, the government placed the whole of the Iranian state - including its intelligence services - on the enhanced tier of the new foreign influence registration scheme. It means anyone asked by Iran to carry out actions for the state must declare it, or face prison time."
    },
    {
        "title": "Terror arrests came in context of raised warnings about Iran, with ongoing chaos in its own backyard",
        "description": "These are two separate and unrelated investigations by counter-terror officers. ",
        "url": "https://news.sky.com/story/terror-arrests-came-in-context-of-raised-warnings-about-iran-with-ongoing-chaos-in-its-own-backyard-13361523",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-rochdale-police_6905737.jpg?20250504101848",
        "type": "UK",
        "Author": "Tom Cheshire",
        "Date Published": "2025-05-04 13:46:00",
        "Headline": "Eight men - including seven Iranians - have been arrested by the Metropolitan Police in two unconnected terrorism investigations. All are in police custody.",
        "Content": "\n          Data and forensics correspondent\n              @chesh\n  These are two separate and unrelated investigations by counter-terror officers.  But the common thread is nationality - seven out of the eight people arrested are Iranian. And that comes in the context of increased warnings from government and the security services about Iranian activity on British soil.  Last year, the director general of MI5, Ken McCallum, said his organisation and police had responded to 20 Iran-backed plots presenting potentially lethal threats to British citizens and UK residents since January 2022. He linked that increase to the ongoing situation in Iran's own backyard. \"As events unfold in the Middle East, we will give our fullest attention to the risk of an increase in - or a broadening of - Iranian state aggression in the UK,\" he said. The implication is that even as Iran grapples with a rapidly changing situation in its own region, having seen its proxies, Hezbollah in Lebanon and Hamas in Gaza, decimated and itself coming under Israeli attack, it may seek avenues further abroad. \n                  Netanyahu vows to retaliate against Houthis and Iran after missile attack\n                 \n                  Fast and furious: 100 days of Trump\n                 \n                  Number killed in Iran explosion rises to 65 after Tehran denied blast was 'linked to fuel for missiles'\n                 The government reiterated this warning only a few weeks ago, with security minister Dan Jarvis addressing parliament. \"The threat from Iran sits in a wider context of the growing, diversifying and evolving threat that the UK faces from malign activity by a number of states,\" Jarvis said. \"The threat from states has become increasingly interconnected in nature, blurring the lines between: domestic and international; online and offline; and states and their proxies. \"Turning specifically to Iran, the regime has become increasingly emboldened, asserting itself more aggressively to advance their objectives and undermine ours.\" Read more:Anybody working for Iran in UK must register or face jail, government announces As part of that address, Jarvis highlighted the National Security Act 2023, which \"criminalises assisting a foreign intelligence service\", among other things. So it was notable that this was the act used in one of this weekend's investigations. The suspects were detained under section 27 of the same act, which allows police to arrest those suspected of being \"involved in foreign power threat activity\". Those powers are apparently being put to use."
    },
    {
        "title": "Fourteen children arrested on suspicion of manslaughter over Gateshead fire released on bail",
        "description": "All 14 children arrested on suspicion of manslaughter after a boy died in a fire have been released on police bail, officers said.",
        "url": "https://news.sky.com/story/fourteen-children-arrested-on-suspicion-of-manslaughter-over-gateshead-fire-released-on-bail-13361896",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gateshead-fire-fairfield_6905518.jpg?20250503213548",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-04 18:43:00",
        "Headline": "Layton Carr, 14, was found dead near the site of a fire at Fairfield industrial park in the Bill Quay area of Gateshead on Friday.",
        "Content": "All 14 children arrested on suspicion of manslaughter after a boy died in a fire have been released on police bail, officers said. Layton Carr, 14, was found dead near the site of a fire at Fairfield industrial park in the Bill Quay area of Gateshead on Friday. Northumbria Police said on Saturday that they had arrested 11 boys and three girls in connection with the incident. In an update on Sunday, a Northumbria Police spokesman said: \"All those arrested have since been released on police bail pending further inquiries.\"  Firefighters raced to the industrial site shortly after 8pm on Friday, putting out the blaze a short time later. Police then issued an appeal for Carr, who was believed to be in the area at that time. In a statement on Saturday, the force said that \"sadly, following searches, a body believed to be that of 14-year-old Layton Carr was located deceased inside the building\". \n                  Pictured: Boy killed in Gateshead industrial estate fire - 14 children arrested on suspicion of manslaughter\n                 \n                  Fourteen children arrested on suspicion of manslaughter after industrial fire in Gateshead\n                 \n                  'Sensitive military documents' found in Newcastle street\n                 David Thompson, headteacher of Hebburn Comprehensive School, where Layton was a pupil, said the school community was \"heartbroken\". Mr Thompson described him as a \"valued and much-loved member of Year 9\" and said he would be \"greatly missed by everyone\". He added that the school's \"sincere condolences\" were with Layton's family and that the community would \"rally together to support one another through this tragedy\". A fundraising page on GoFundMe has been set up to help Layton's mother pay for funeral costs. Organiser Stephanie Simpson said: \"The last thing Georgia needs to stress trying to pay for a funeral for her Boy Any donations will help thank you.\" One tribute in a Facebook post read: \"Can't believe I'm writing this my nephew RIP Layton 💔 forever 14 you'll be a massive miss, thinking of my sister and 2 beautiful nieces right now.\" Detective Chief Inspector Louise Jenkins, of Northumbria Police, also said: \"This is an extremely tragic incident where a boy has sadly lost his life.\" She added that the force's \"thoughts are with Layton's family as they begin to attempt to process the loss of their loved one\". They are working to establish \"the full circumstances surrounding the incident\" and officers will be in the area to \"offer reassurance to the public\", she added. A cordon remains in place at the site while police carry out enquiries."
    },
    {
        "title": "Infected blood scandal: Victims 'scared they won't live to see compensation'",
        "description": "People who were given infected blood while receiving NHS care are \"scared they won't live to see compensation\", according to campaigners.",
        "url": "https://news.sky.com/story/infected-blood-scandal-victims-scared-they-wont-live-to-see-compensation-13361996",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-nhs-infected-blood_6906611.jpg?20250504220401",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-04 23:01:00",
        "Headline": "The inquiry into the scandal is set to reopen later this week amid concerns about delays to compensation, despite a commitment of £11.8bn in last year's budget.",
        "Content": "People who were given infected blood while receiving NHS care are \"scared they won't live to see compensation\", according to campaigners. The Infected Blood Inquiry is set to reopen later this week to examine the \"timeliness and adequacy\" of the government's response to compensation. Gary Webster, who was infected with HIV and hepatitis C when he attended Lord Mayor's Treloar's School in Hampshire in 1970s and 1980s said he felt things had \"gone downhill\" since the inquiry published its report last May. Mr Webster told the PA news agency that progress was \"too slow\" and there seemed to be \"a random system\" to choose who receives compensation. \"We fought for so many years to get to this stage… and now they're saying they hope to pay all the infected by the end of 2027 and they hope to pay the affected by the end of 2029,\" he said. \"Well, there's two people dying a week - you only have to do the sums yourself to work out that's a lot of people that aren't going to get paid, aren't going to get the justice and will die not knowing what happened.\" \"I think people are scared now that they're not going to survive until they get compensation,\" Mr Webster added. \n                  Ten victims of infected blood scandal to receive total of around £13m, Cabinet Office says\n                 \n                  Families of infected blood scandal victims call for changes to compensation scheme\n                 \n                  Infected blood victims 'livid' with 'paltry' compensation offer\n                 Another former pupil of the school who was infected with hepatitis C, Glenn Wilkinson, last year told Sky News that the compensation offer was \"paltry\". The Haemophilia Society said the scandal had \"ruined\" people's lives, with compensation delays having \"added to their suffering\". The Hepatitis C Trust said it hoped reopening the inquiry would \"bring about a step change in the government's attitude to the people impacted by this terrible scandal\".  Between the 1970s and early 1990s, more than 30,000 people in the UK were infected with HIV and hepatitis C while receiving NHS care. Some 3,000 people have died after they were given contaminated blood and blood products, while survivors live with lifelong implications. 'Restless for progress' In last October's Budget, Chancellor Rachel Reeves committed £11.8bn to compensate victims of the infected blood scandal. The compensation scheme is administered by the Infected Blood Compensation Authority (IBCA), which as of 24 April, has invited 475 people to make a claim and made 77 payments totalling more than £78m, according to its figures. Campaigners will give evidence during the inquiry's latest hearings, as well as Cabinet Office minister Nick Thomas-Symonds, who said last month that he was \"restless for progress\" in handing out compensation. Sir Brian Langstaff, the inquiry's chairman, has said the victims and families of those affected have been left distressed and powerless by the government's approach and that both those infected and affected \"do not have time on their side\". Read more from Sky News:When and where to watch VE Day flypast routeMeghan posts new photo of Prince Harry after backlash An IBCA spokesperson said its priority was \"paying as many people as soon as possible\" and that it was using what it had learned \"to increase the number of claims each week\". A government spokesperson said it was \"fully committed to cooperating with the inquiry\" and was working to deliver \"one of the most comprehensive compensation schemes in modern history\"."
    },
    {
        "title": "Football bodies could be forced to pay towards brain injury care costs of ex-players",
        "description": "Football bodies could be forced to pay towards the care costs of ex-players who have been diagnosed with brain conditions, under proposals set to be considered by MPs.",
        "url": "https://news.sky.com/story/football-bodies-could-be-forced-to-pay-towards-brain-injury-care-costs-of-ex-players-13362050",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-football-istock_6906738.jpg?20250505002018",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-04 23:01:00",
        "Headline": "Campaigners say existing support for former players diagnosed with brain conditions, such as dementia, is not fit for purpose.",
        "Content": "Football bodies could be forced to pay towards the care costs of ex-players who have been diagnosed with brain conditions, under proposals set to be considered by MPs. Campaigners are drafting amendments to the Football Governance Bill, which would treat conditions caused by heading balls as an \"industrial injuries issue\". The proposals seek to require the football industry to provide the necessary financial support. Campaigners say existing support is not fit for purpose, including the Brain Health Fund which was set up with an initial £1m by the Professional Footballers' Association (PFA), supported by the Premier League. But the Premier League said the fund has supported 121 families with at-home adaptations and care home fees. From England's 1966 World Cup-winning team, both Jack and Bobby Charlton died with dementia, as did Martin Peters, Ray Wilson and Nobby Stiles. Ex-players, including former Liverpool defender Neil Ruddock, went to parliament last week to lobby MPs. \n                  Bristol Rovers legend taking legal action against FA over brain condition says he has just years to live\n                 \n                  Simple blood test that could detect dementia at early stage begins trial in NHS clinics\n                 \n                  Former Manchester United defender David May shares dementia fears\n                 Ruddock told Sky News he had joined campaigners \"for the families who've gone through hell\". \"A professional footballer, greatest job in the world, but no one knew the dangers, and that's scary,\" he said. \"Every time someone heads a ball it's got to be dangerous to you. You know, I used to head 100 balls a day in training. I didn't realise that might affect my future.\" A study co-funded by the PFA and the Football Association (FA) in 2019 found footballers were three and a half times more likely to die of a neurodegenerative disease than members of the public of the same age. 'In denial' Among those calling on football authorities to contribute towards the care costs of ex-players who have gone on to develop conditions such as Alzheimer's and dementia is Labour MP Chris Evans. Mr Evans, who represents Caerphilly in South Wales, hopes to amend the Bill to establish a care and financial support scheme for ex-footballers and told a recent event in parliament that affected ex-players \"deserve to be compensated\". Greater Manchester Mayor Andy Burnham, who helped to draft the amendment, said the game was \"in denial about the whole thing\". Mr Burnham called for it to be seen as \"an industrial injuries issue in the same way with mining\". In January, David Beckham lent his support to calls for greater support for footballers affected by dementia. One of the amendments says that \"the industry rather than the public should bear the financial burden\". Read more from Sky News:Woman missing for more than 60 years found 'alive and well'Meghan posts new photo of Prince Harry amid backlash A spokesperson for the FA said it was taking a \"leading role in reviewing and improving the safety of our game\" and that it had \"already taken many proactive steps to review and address potential risk factors\". An English Football League spokesperson said it was \"working closely with other football bodies\" to ensure both professional and grassroots football are \"as safe as it can be\". The PFA and Premier League declined to comment."
    },
    {
        "title": "M&S 'had no plan' for cyber attacks, insider claims, with 'staff left sleeping in the office amid paranoia and chaos'",
        "description": "A M&S insider has told Sky News it could be \"months\" before the retailer fully recovers from an ongoing, severe cyber attack - and that the company had no plan for such an incident.",
        "url": "https://news.sky.com/story/ms-had-no-plan-for-cyber-attacks-insider-claims-with-staff-left-sleeping-in-the-office-amid-paranoia-and-chaos-13361359",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-marks-and-spencer-oxford-street_6905825.jpg?20250504125252",
        "type": "UK",
        "Author": "Tom Cheshire",
        "Date Published": "2025-05-04 09:49:00",
        "Headline": "A source describes chaotic scenes - as hackers continue to hold the High Street company to ransom.",
        "Content": "\n          Data and forensics correspondent\n              @chesh\n A M&S insider has told Sky News it could be \"months\" before the retailer fully recovers from an ongoing, severe cyber attack - and that the company had no plan for such an incident. Hackers have been holding the High Street brand to ransom for more than a week now, forcing it to suspend online orders and halt recruitment. An employee at M&S's head office, who spoke to Sky News on condition of anonymity, said that last week had been \"just pure chaos\". \"We didn't have any business continuity plan [for this], we didn't have a cyber attack plan,\" the source said. \"In general, it's lots of stress. People have not been sleeping, people have spent their weekends working, people sleeping in the office - just reactive response.\" They told Sky News it would be \"a few months\" before the disruption ended. \"The idea is to have some services go back online bit by bit. Not do the whole shebang, but allow the people in the store and to allow people online to have services.\" Read more: Who are notorious Scattered Spider hackers?  In the meantime, they said that staff were being forced to work on personal devices in an ad-hoc manner, with internal advice constantly changing. \"We're kind of figuring it out as we go,\" they said. \"We're not even allowed to use our work devices, so we're having to use our personal devices, all sorts of things. \"It's just impossible to work because anything about the incident, we're not allowed to talk about on Teams, which is our usual way of chatting… So we have to use WhatsApp to talk to each other.\" They said there is a \"sense of paranoia and therefore not everyone knows everything, because we don't know who has been compromised. They are still trying to figure things out.\" That paranoia exists because employees are still not sure whether hackers are inside the M&S system, the source said. \"It's possible, that's a possibility,\" they said. \"I don't know that, and it hasn't been said. But it's a possibility and you want to be careful.\" 👉 Listen to Sky News Daily on your podcast app 👈 M&S told shoppers on Friday it was \"really sorry\" it hasn't been able to \"offer you the service you expect\". \"We are working day and night to manage the current cyber incident and get things back to normal for you as quickly as possible,\" M&S chief executive Stuart Machin said in a statement to customers. An M&S spokesperson added: \"M&S has robust business continuity plans and processes in place for managing incidents, led by an experienced team.\" Sky News also understands that the executive team exercised a cyber incident last year. Harrods and the Co-op Group have also been targeted by hackers in recent days. Attacks should be 'wake-up call' Cabinet Office minister Pat McFadden will this week tell \"every business in the UK\" that these attacks should be a \"wake-up call\". Mr McFadden is expected to tell the CyberUK conference in Manchester: \"In a world where the cybercriminals targeting us are relentless in their pursuit of profit - with attempts being made every hour of every day - companies must treat cybersecurity as an absolute priority.\" He will say: \"We've watched in real time the disruption these attacks have caused, including to working families going about their everyday lives. \"It serves as a powerful reminder that just as you would never leave your car or your house unlocked on your way to work, we have to treat our digital shop fronts the same way.\""
    },
    {
        "title": "Royal Family 'fully focused' on VE Day, palace aide says after Prince Harry's interview",
        "description": "The Royal Family are \"fully focused\" on this week's VE Day events and celebrating the \"selfless devotion, duty and service\" of the wartime generation, despite Prince Harry's shock interview.",
        "url": "https://news.sky.com/story/royal-family-fully-focused-on-ve-day-palace-aide-says-after-prince-harrys-interview-13361777",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-king-charles-the-king_6906353.jpg?20250504180416",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-05-04 16:57:00",
        "Headline": "A palace aide said that \"The King, Queen and other members of The Royal Family are much looking forward to all the week's VE Day events\".",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  The Royal Family are \"fully focused\" on this week's VE Day events and celebrating the \"selfless devotion, duty and service\" of the wartime generation, despite Prince Harry's shock interview. Speaking ahead of Monday's events in central London, a palace aide said: \"The King, Queen and other members of The Royal Family are much looking forward to all the week's VE Day events, when they will unite with the rest of the nation and those across the Commonwealth and wider world in celebrating, commemorating and giving thanks to the wartime generation whose selfless devotion duty and service should stand as an enduring example to us all - and must never be forgotten.\" It's understood that the family are keen that out of respect for the surviving veterans, nothing will \"detract or distract\" from celebrating the precious victory and the brave souls who contributed to it. On Monday, the King and Queen will be joined by the Prince and Princess of Wales and other members of the family for a parade and fly past centred around Buckingham Palace. They will also join Sir Keir Starmer and World War Two veterans on a platform on the Queen Victoria Memorial in front of the palace. Read more:What are the four-day celebrations to mark VE Day?What VE Day was really like - 80 years on In a shock interview on Friday, Prince Harry opened up about still being estranged from his family, saying his father will not speak to him but that he still has hopes for reconciliation. \n                  Meghan posts new photo of Prince Harry with children after royal backlash\n                 \n                  Harry's intention may have been to extend the most public olive branch, but it could cause more hurt\n                 \n                  Prince Harry says loss of security protection makes it 'impossible' to bring Meghan and children to UK\n                 The duke told BBC News: \"Life is precious. I don't know how much longer my father has, he won't speak to me because of this security stuff. It would be nice to reconcile.\"  Ailsa Anderson, a former press secretary to the late Queen, told Sky News on Friday that Buckingham Palace would be \"raising their eyes heavenwards\" in reaction to the interview. \"Prince Harry is saying 'I don't know how long my father has' - that's going to cause real concern and more speculation in the media and the wider public about what his diagnosis is, which is incredibly unhelpful going forward,\" she told Sky's Sophy Ridge. Meanwhile, the Duchess of Sussex earlier posted a photo of Prince Harry and their children in an apparent show of solidarity. The black and white image, which was not accompanied by a message on Meghan's Instagram account, showed Harry, from behind, walking with Princess Lilibet on his shoulders and Prince Archie holding his hand as they made their way through a garden."
    },
    {
        "title": "VE Day: WWII codebreaker recalls chance encounter with Churchill as he took part in 'deliberate ruse'",
        "description": "Sitting down with Second World War veteran Pat Owtram, she offers me a glass of water, a cup of tea, or a sherry.",
        "url": "https://news.sky.com/story/ve-day-wwii-codebreaker-recalls-chance-encounter-with-churchill-as-he-took-part-in-deliberate-ruse-13360060",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-pat-owtram-ve-day_6904277.jpg?20250503085521",
        "type": "UK",
        "Author": "Sarah-Jane Mee",
        "Date Published": "2025-05-04 23:01:00",
        "Headline": "Pat Owtram, who had learnt German from refugees taken in by her family, spent the Second World War using those skills to translate enemy submarine communications, and once bumped into Britain's wartime prime minister while reading a library book.",
        "Content": "\n          Lead UK news presenter\n              @skysarahjane\n  Sitting down with Second World War veteran Pat Owtram, she offers me a glass of water, a cup of tea, or a sherry. At 101, Pat has the kind of spirit you have come to admire in the veterans we are lucky to still have - resilience, stoicism and a healthy dose of good humour. Pat opens up her well-worn photo album and recounts her remarkable story. At just 18 years old, Pat, like so many young women, desperately wanted to join the war effort and 'do their bit'. Pat found herself heading to Liverpool for an interview to join the Women's Royal Naval Service, known as Wrens, and was snapped up on account of her German-speaking skills. Her family in Lancashire had taken in refugees from occupied Austria and evenings spent chatting by the fire in German and English had given her a vital skill for the British government. \"I could listen to the German naval ships talking because they tended to talk coming in and out of the Baltic into the North Sea. I heard a good deal of radio traffic from the enemy side.\" \n                  VE Day: Veterans to join King for tea party as Keir Starmer praises 'selfless dedication'\n                 \n                  WWII Mosquito pilot who carried out 50 bombing raids across Germany shares memories of VE Day\n                 \n                  Royal Family 'fully focused' on VE Day, palace aide says after Prince Harry's interview\n                 Pat started working along the British coast at small listening stations, transcribing conversations between German submarines and, crucially, writing down secret coded messages - now known as the Enigma code, to send to Bletchley Park. Pat found herself in Kent at Abbot's Cliff in Dover, the listening station in a large white house perched on a hill, well within shelling range. To this day, Pat says she is amazed it was not a target. The closest Pat came to danger was actually from an over-enthusiastic colleague. \"She came in carrying a bomb, saying 'look what I found!' We told her to go away!\" In between the night watches and the hours of transcribing, there were moments of calm too. Pat and her fellow Wrens started a tap-dancing club and a library - and it was during a well-earned break reading a library book on a cliff overlooking the Channel that Pat witnessed a significant moment. \"A little file of people was coming up the path and it was Winston Churchill. He stood on our cliff looking across at Calais. It was carefully planned as he knew it would be reported back to the Germans. And, of course, the invasion was going to be way down west. It was a deliberate ruse.\" The rest, as they say, is history, D-Day creating a path to victory for the Allies with VE Day coming 11 months later. Read more:VE Day 2025: Four days of celebrationsVE Day flypast route: How to watchAugmented reality brings to life the stories of VE DayA moment of joy: VE Day in pictures Pat remembers exactly where she was on that historic but bittersweet day for her family. \"We had a half-day off and instinctively headed for the palace. Lots of people were shouting 'We want the King!' and they did come out on the balcony and everybody cheered, there was a great feeling of celebration. \"VE Day meant a great deal, but VJ Day was more important to my family because my father had been taken prisoner in the Far East. We had a few more months to wait until he came home.\" Pat's sister Jean was also a codebreaker using her language skills in Egyptian and Italian as a cipher officer with the Special Operations Executive, nicknamed 'Churchill's Secret Army'. Jean sadly passed away last year and was stationed abroad on VE Day, but she wrote to her sister with the words \"My double darling Patsy, isn't this just so wonderful and overwhelming?\". It is Jean and her family that Pat will be remembering today."
    },
    {
        "title": "WWII Mosquito pilot who carried out 50 bombing raids across Germany shares memories of VE Day",
        "description": "Colin Bell is a regular at the RAF Club in London where he pops in for a G&T and a chat with other members in the Churchill Bar.",
        "url": "https://news.sky.com/story/wwii-mosquito-pilot-who-carried-out-50-bombing-raids-shares-memories-of-ve-day-13359202",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-ve-day-ww2-veteran_6902603.jpg?20250501131408",
        "type": "UK",
        "Author": "Jonathan Samuels",
        "Date Published": "2025-05-04 23:01:00",
        "Headline": "Colin Bell joined the RAF aged just 19 and was part of 608 Squadron (Pathfinder Group) in Norfolk. He flew a Mosquito bomber and carried out 50 bombing raids over Germany.",
        "Content": "\n          Presenter\n              @jonathansamuels\n  Colin Bell is a regular at the RAF Club in London where he pops in for a G&T and a chat with other members in the Churchill Bar. Smartly dressed, and walking without a stick, it is a week before he turns 104 and he has a twinkle in his eye. Congratulating him on his upcoming birthday, I ask him what he puts his longevity down to. \"It's a combination of exercise, alcohol, and the love of good women; with the odd bad one thrown in!\" He has an infectious laugh. Colin joined the RAF aged just 19, and after his flying training joined 608 Squadron (Pathfinder Group) based at Downham Market in Norfolk. He flew a Mosquito bomber and carried out 50 bombing raids over Germany, 13 of them over Berlin. \"It was rather a hairy business,\" he tells me. \"The Germans had perfected, to a very fine art, the ability to shoot down enemy aircraft.\" \n                  Sir Keir Starmer hails new British 'StormShroud' drones coming into operation\n                 \n                  New UK fighter jet could be axed in defence review\n                 \n                  Urgent review as D-Day parachute jump scaled back due to lack of RAF aircraft\n                 He recalls one incident when a shell exploded under the aircraft, cutting power to both engines. Eventually Colin and his navigator Doug Redmond limped home. The following day an engineer inspected the bomber, before giving Colin a memento of the raid. Colin recalls: \"He handed me two slivers of shrapnel, each about 4 or 5 inches long, and I said 'where did you find them?'. He said, 'well, they were in the parachute you were sitting on!', which made me thoughtful.\" We talk about the VE Day 80th anniversary and Colin recalls being at an airbase in North Bay Canada when the news broke, early in the morning. \"I was woken by all this palaver, people shouting and firing pistols… I said to one of the guys, 'what the hell's going on?' And he said 'I think they are celebrating the end of the war, the end of the war in Europe'. \"And I said, 'well that's nice, now let's get back to sleep!'\" Inevitably conversation turns to the conflicts of today. He worries about defence spending, NATO, and hesitating to confront aggression decisively. \"Bear in mind that I've seen all this happen before, from the time that I was a teenager living, as Churchill put it, in the wilderness years and a time when appeasement was rife. \"The situation is different now, but the dangers are the same.\" He has a message too for the current generation: \"People talk too much about their rights and not enough about their duties,\" he tells me. Read more:WWII codebreaker recalls chance encounter with ChurchillAugmented reality brings to life the stories of VE DayFour days of VE Day celebrationsVE Day flypast route: How to watchPub hours extended for 80th celebrations Opposite the RAF club in Green Park is the RAF Bomber Command Memorial, commemorating the young crews who embarked on missions during the Second World War. I ask Colin what goes through his mind as we gaze up at the impressive sculpture. \"Sadness,\" he simply says. \"So many brave young men lost their lives fighting the war against an enemy that should never have been. \"You must understand that what we were doing at the time was a battle for survival, and that's what we were concentrating on. And it's not just a matter of the people. \"Some people feel gratitude for what we did, but really we had no option. We just had to make sure that we won the war. And thank God we did.\""
    },
    {
        "title": "Netanyahu vows to retaliate against Houthis and Iran after missile attack",
        "description": "Israeli Prime Minister Benjamin Netanyahu has vowed to retaliate against the Houthis and their Iranian \"masters\" after the group launched a missile attack on the country's main international airport.",
        "url": "https://news.sky.com/story/netanyahu-vows-to-retaliate-against-houthis-and-iran-after-missile-attack-13361736",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-israel-ben-gurion-houthis_6906294.jpg?20250504173405",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-04 16:26:00",
        "Headline": "The missile impact left a plume of smoke and briefly halted flights and commuter traffic at the airport. Some international carriers have cancelled flights to and from Tel Aviv for several days.",
        "Content": " Israeli Prime Minister Benjamin Netanyahu has vowed to retaliate against the Houthis and their Iranian \"masters\" after the group launched a missile attack on the country's main international airport. A missile fired by the group from Yemen landed near Ben Gurion Airport, causing panic among passengers in the terminal building. \"Attacks by the Houthis emanate from Iran,\" Mr Netanyahu wrote on X. \"Israel will respond to the Houthi attack against our main airport AND, at a time and place of our choosing, to their Iranian terror masters.\" The missile impact left a plume of smoke and briefly halted flights and commuter traffic at the airport. Some international carriers have cancelled flights to and from Tel Aviv for several days. Four people were lightly wounded, paramedic service Magen David Adom said. Air raid sirens went off across Israel and footage showed passengers yelling and rushing for cover. The attack came hours before senior Israeli cabinet ministers were set to vote on whether to intensify the country's military operations in the Gaza Strip, and as the army began calling up thousands of reserves in anticipation of a wider operation in the enclave. \n                  Terror arrests came in context of raised warnings about Iran, with ongoing chaos in its own backyard\n                 \n                  Fast and furious: 100 days of Trump\n                 \n                  Number killed in Iran explosion rises to 65 after Tehran denied blast was 'linked to fuel for missiles'\n                 Houthi military spokesperson Brigadier General Yahya Saree said the group fired a hypersonic ballistic missile at the airport. Iran's defence minister later told a state TV broadcaster that if the country was attacked by the US or Israel, it would target their bases, interests and forces where necessary. Israel's military said several attempts to intercept the missile were unsuccessful. Air, road and rail traffic were halted after the attack, police said, though it resumed around an hour later. In a statement on their Telegram channel, the Israel Defence Forces (IDF) said that the initial inquiry into the fallen missile found the likely cause was a \"technical issue with the interceptor launched toward the missile\". Furthermore, the IDF's assessment found \"no malfunction\" in the detection procedure, interception systems or Homefront Command alert mechanisms. The Houthi group said in a statement that, in response to what it described as an \"escalation\" of Israeli operations in Gaza, it would now \"impose a comprehensive air blockade\" on Israel, specifically targeting airports including Ben Gurion Airport. The group called on international airlines to cancel all flights to Israeli airports to \"preserve the safety of their aircraft and their customers\". Yemen's Houthis have been firing missiles at Israel since its war with Hamas in Gaza began on 7 October 2023, and while most have been intercepted, some have penetrated the country's missile defence systems and caused damage. Israel has previously struck the group in Yemen in retaliation and the US and UK have also launched strikes after the Houthis began attacking international shipping, saying it was in solidarity with Palestinians over Israel's war with Hamas."
    },
    {
        "title": "Police foil bomb plot targeting Lady Gaga's biggest-ever show on Copacabana beach",
        "description": "Brazilian police say they foiled a bomb attack planned for a Lady Gaga concert on Rio de Janeiro's Copacabana beach that attracted an estimated 2.1 million people.",
        "url": "https://news.sky.com/story/police-foil-bomb-plot-targeting-lady-gagas-biggest-ever-show-on-copacabana-beach-13361275",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-lady-gaga-copacabana-beach_6905650.jpg?20250504034928",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-04 01:21:00",
        "Headline": "The plot was orchestrated by a group promoting hate speech and the radicalisation of teenagers, police said, with the recruiters identifying themselves as Gaga's fans, known as \"Little Monsters\".",
        "Content": " Brazilian police say they foiled a bomb attack planned for a Lady Gaga concert on Rio de Janeiro's Copacabana beach that attracted an estimated 2.1 million people. The plot was orchestrated by a group promoting hate speech and the radicalisation of teenagers, including self-harm and violent content as a form of social belonging, according to the Civil Police of Rio de Janeiro, which worked in coordination with the country's justice ministry. \"The suspects were recruiting participants, including minors, to carry out coordinated attacks using improvised explosives and Molotov cocktails,\" the force said. The justice ministry said the recruiters identified themselves as Gaga's fans, known as \"Little Monsters\". It said Operation Fake Monster was based on a report by the ministry's cyber operations lab following a tip-off from Rio state police intelligence, which uncovered digital cells encouraging violent behaviour among teenagers using coded language and extremist symbolism. Authorities carried out over a dozen search and seizure warrants, and a man described as the group's leader was arrested in the southern state of Rio Grande do Sul for illegal possession of a firearm, and a teenager was detained in Rio de Janeiro for storing child abuse images. In a statement, a spokesperson for Lady Gaga said: \"We learned about this alleged threat via media reports this morning. \"Prior to and during the show, there were no known safety concerns, nor any communication from the police or authorities to Lady Gaga regarding any potential risks. \"Her team worked closely with law enforcement throughout the planning and execution of the concert and all parties were confident in the safety measures in place.\" Gaga's biggest ever show Some 500,000 tourists travelled to watch the concert, which was paid for by the city in an attempt to boost the struggling economy. Saturday night's two-hour show, which marked Gaga's biggest ever, marked the first time she had played in Brazil since 2012, having cancelled an appearance at the Rock in Rio festival in 2017 over health issues. Gaga, who released her seventh studio album, Mayhem, in March, opened with a dramatic, operatic edition of her 2011 track Bloody Mary, before launching into Abracadabra, a recent track. \"Brazil! I missed you. I missed you so much,\" she exclaimed, before launching into Poker Face, one of her biggest hits. The American pop star drew in a similar crowd to Madonna's in May last year, who performed at the same beach, which is transformed into an enormous dance floor for the shows. Addressing the crowd in English and through a Portuguese translator, Gaga became emotional as she said: \"I'm so honoured to be here with you tonight. \"Tonight we're making history, but no one makes history alone. Without all of you, the incredible people of Brazil, I wouldn't have this moment. Thank you for making history with me. \"The people of Brazil are the reason I get to shine today. But of all the things I can thank you for, the one I most am grateful for is this: that you waited for me. You waited more than 10 years for me.\" She said it took so long to come back because she was \"healing\" and \"getting stronger\". The pop sensation cancelled many of her shows in 2017 and 2018 due to her fibromyalgia condition, which can cause pain and fatigue. It is estimated Gaga's show will have injected around 600 million reais (£79.9m) into the economy, nearly 30% more than Madonna's show. Read more:John Lithgow on JK Rowling's trans stance backlashWhy are the band Kneecap controversial? The large-scale free shows are set to continue annually until at least 2028, always taking place in May, which is considered the economy's \"low season\", according to the city's government. A hefty security plan was in place, including the presence of 3,300 military and 1,500 police officers, along with 400 military firefighters. 'A dream come true' The city has been swarmed with Gaga fans since her arrival on Tuesday, with some even keeping vigil outside of the hotel she has been staying at. Many arrived at the beach at the crack of dawn on Saturday to secure good spots on the beach, despite the show not starting until 9.45pm. Ana Lara Folador, who attended with her sister, said it was \"a dream come true\", and that Gaga had \"really shaped a part of my personality, as a person and an artist\". Ingrid Serrano, a 30-year-old engineer who made a cross-continent trip from Colombia to Brazil to attend the show, turned up in a T-shirt featuring Lady Gaga's outlandish costumes over the years. \"I've been a 100% fan of Lady Gaga my whole life,\" she said, adding the 39-year-old megastar represented \"total freedom of expression - being who one wants without shame\". Matheus Silvestroni, 25, an aspiring DJ and a Gaga fan since the age of 12, endured an eight-hour bus ride from Sao Paulo for the show. He said it was Gaga who had inspired him to embrace his sexuality and pursue his dream of becoming an artist. \"I was bullied because I was a fat, gay kid, so I was an easy target,\" he said. \"Gaga was very important because she sent a message that everything was okay with me, I wasn't a freak, because I was 'Born This Way'.\" Rio is known for holding massive open-air concerts, with Rod Stewart holding a Guinness World Record for the four million-strong crowd he drew to Copacabana beach in 1994."
    },
    {
        "title": "Recovery of sunken Bayesian superyacht begins off coast of Italy",
        "description": "Marine experts have started the recovery of a superyacht from the seabed off the Italian coast.",
        "url": "https://news.sky.com/story/recovery-of-sunken-bayesian-superyacht-begins-off-coast-of-italy-13362010",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-italy-bayesian-superyacht_6906658.jpg?20250504230851",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-04 21:30:00",
        "Headline": "The yacht sank near Sicily last August, killing tech tycoon Mike Lynch and five others, including his 18-year-old daughter Hannah.",
        "Content": "Marine experts have started the recovery of a superyacht from the seabed off the Italian coast. The British-flagged Bayesian sank near Sicily last summer, killing tech business tycoon Mike Lynch, his daughter and five others. The recovery will be carried out by two floating cranes - Hebo Lift 2 and Hebo Lift 10. The latter is one of the most powerful maritime cranes in Europe and arrived from Rotterdam at the port of Termini Imerese in Sicily on Saturday. Operations are being supervised by the Italian coast guard, who are also ensuring the safety of personnel working on the recovery. The recovery effort is expected to last somewhere between 20 and 25 days, before investigators start examining the wreckage. The captain and two crew members are under investigation in connection with the sinking on 19 August last year. \n                  What it was like seeing the open coffin of Pope Francis\n                 \n                  Pope Francis's final moments reveal how quickly he deteriorated before death\n                 \n                  A pope of firsts, Francis was an outspoken champion of the deprived - but left some feeling betrayed\n                 The superyacht, which was 183ft long and weighed 473 tonnes, sank after what appears to have been a sudden powerful burst of wind from a thunderstorm. Coast guard captain Nicola Silvestri said the yacht's 246ft aluminium mast, the second tallest in the world, will be cut to allow the hull to be brought to the surface more easily. In addition to 59-year-old Mr Lynch and his 18-year-old daughter Hannah, chairman of investment banking company Morgan Stanley International Jonathan Bloomer and his wife Judy, lawyer Chris Morvillo and wife Neda, and the ship's cook Recaldo Thomas died in the incident. In the initial rescue phase, 15 of the 22 people were taken to safety, one body was recovered, and six others were reported missing. The bodies of the six reported missing were found during a significant search effort, which continued until 23 August. Read more from Sky News:Woman missing for more than 60 years found 'alive and well'Meghan posts new photo of Prince Harry amid backlash At a pre-inquest review into the deaths of Mr Lynch, Miss Lynch and Mr and Mrs Bloomer last month, the Marine Accident Investigation Branch (MAIB) said it hoped to publish its interim report in the coming weeks. Its principal investigator, Simon Graves, told the hearing the organisation was \"relatively early\" in its investigation, with its final report due to follow in a matter of \"months, not weeks\"."
    },
    {
        "title": "Woman missing for more than 60 years found 'alive and well'",
        "description": "A woman in the US who has been missing since 1962 has been found \"alive and well\", authorities have said.",
        "url": "https://news.sky.com/story/woman-missing-for-more-than-60-years-found-alive-and-well-13361368",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-audrey-backeberg-missing_6905773.jpg?20250504122129",
        "type": "US",
        "Author": "Samuel Osborne",
        "Date Published": "2025-05-04 10:00:00",
        "Headline": "Audrey Backeberg left her home in Reedsburg, Wisconsin, in July 1962 when she was 20 years old. Investigators pursued numerous leads over the years but the case eventually went cold, until a reassessment of cold cases earlier this year.",
        "Content": "\n          News reporter\n              @samuelosborne93\n A woman in the US who has been missing since 1962 has been found \"alive and well\", authorities have said. Audrey Backeberg left her home in Reedsburg, Wisconsin, in July that year when she was 20 years old, Sauk County Sheriff's Office said. Investigators pursued numerous leads over the years but the case eventually went cold. However, during a review of cold cases earlier this year, a detective reassessed all the case files and evidence, and re-interviewed several witnesses - and found Ms Backeberg. The 82-year-old was \"alive and well\" - living outside of the state of Wisconsin, the sheriff's office said. Ms Backeberg was married and had two children when she disappeared on 7 July 1962, according to the Wisconsin Missing Persons Advocacy organisation. She left her home to pick up her salary but never returned, causing her husband to ask family members where she was. Shortly afterwards their 14-year-old babysitter claimed she and Ms Backeberg had hitchhiked to Wisconsin's capital city Madison and then caught a bus to Indianapolis, Indiana. The teenager said when she arrived she became nervous and wanted to go home, while Ms Backeberg refused to return and was last seen walking near a bus stop. Ms Backeberg's marriage was troubled and there were allegations of abuse, the Wisconsin Missing Persons Advocacy organisation said, with a criminal complaint having been filed days before she went missing. Her relatives insisted she would never abandon her children, the organisation added, and her husband passed a polygraph test and maintained his innocence. Read more from Sky News:Five survive 36 hours surrounded by alligators after plane crashChild sex abuse victims will no longer get compensationStreeting denies Labour 'mistakes' and 'unpopular' policies 'We talked for 45 minutes' - detective Detective Isaac Hanson, who found Ms Backeberg, said her sister's Ancestry.com account was vital in helping him locate her address. \"That was pretty key in locating death records, census reports, all kinds of data,\" he told local news station WISN. \"So I called the local sheriff's department, said, 'Hey, there's this lady living at this address. Do you guys have somebody, you can just go pop in?' \"Ten minutes later, she called me, and we talked for 45 minutes.\" 'She sounded happy' Mr Hanson said Ms Backeberg may have left home due to marital issues, but it was unclear why she had stayed away for so long. He said he had promised to keep their conversation private. \"I think she just was removed and, you know, moved on from things and kind of did her own thing and led her life,\" he said. \"She sounded happy. Confident in her decision. No regrets.\" Sauk County Sheriff's Office said Ms Backeberg made the choice to leave and her disappearance \"was not the result of any criminal activity or foul play\"."
    },
    {
        "title": "WH Smith buyer 'faces 12-month ban' on mass shop closures",
        "description": "The new owner of WH Smith's high street chain has effectively been barred from launching a wave of mass store closures for at least 12 months amid plans for rapid restructurings at two other retailers it owns.",
        "url": "https://news.sky.com/story/wh-smith-buyer-faces-12-month-ban-on-mass-shop-closures-13361601",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-wh-smith-manchester_6906131.jpg?20250504155837",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-04 14:47:00",
        "Headline": "The London-listed retail group would have the right to terminate a services agreement with Modella Capital if it launched mass shop closures within 12 months of buying WH Smith’s high street arm, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The new owner of WH Smith's high street chain has effectively been barred from launching a wave of mass store closures for at least 12 months amid plans for rapid restructurings at two other retailers it owns. Sky News has learnt that WH Smith would have the right to cancel a year-long transitional services agreement (TSA) put in place with Modella Capital - which struck a deal to acquire the business in March - if it launched a company voluntary arrangement (CVA) before the first anniversary of the transaction's completion. The clause in the TSA, which enables Modella Capital to continue using WH Smith's systems after it takes ownership, is significant, according to retail insiders. WH Smith agreed to sell its 480 high street shops to Modella in a £76m deal, ending 233 years of high street history. Modella plans to rebrand the chain under the name TG Jones after it takes control. In recent weeks, Sky News has revealed plans drawn up by Modella to launch CVAs at both Hobbycraft and The Original Factory Shop, which it has owned for nine and three months respectively. Both of those restructuring processes have put significant numbers of stores at risk, and industry executives say that, over time, a sizeable part of the WH Smith high street estate could also be at risk. \n                  Hovis and Kingsmill-owners in talks about historic bread merger\n                 \n                  Struggling Aston Martin steers into fresh pay controversy\n                 \n                  Money blog: 'I'm a brain surgeon - here's what we earn (I don't think it's good) and easy ways to keep your mind healthy'\n                 A spokesman for Modella said: \"We have a number of exciting plans for the future of TGJones. \"A CVA is not on the agenda, as it is a solvent business.\" WH Smith, which will become a pure-play travel retailer once the Modella deal completes, declined to comment further ahead of the completion of the sale."
    },
    {
        "title": "Wes Streeting denies Labour has made 'mistakes' with 'unpopular' policies despite poor local election results",
        "description": "Health Secretary Wes Streeting has defended \"unpopular\" policies such as the cut to the winter fuel allowance despite Labour's poor performance at the local elections.",
        "url": "https://news.sky.com/story/wes-streeting-denies-labour-has-made-mistakes-with-unpopular-policies-despite-poor-local-election-results-13361313",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/699741ec20debb1d1dfea5e89426ca1c7a4543d6b57dbe91e016ceb1c644d245_6905698.jpg?20250504091408",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-04 07:22:00",
        "Headline": "The health secretary defends policies such as the cut to winter fuel payment and the national insurance hike and says: \"Change takes time.\"",
        "Content": " Health Secretary Wes Streeting has defended \"unpopular\" policies such as the cut to the winter fuel allowance despite Labour's poor performance at the local elections. Mr Streeting denied the government had made any mistakes when asked whether the policy was partly to blame for the party losing 189 council seats less than a year since the General Election. Since coming into government last July, Labour has enacted a number of policies that were not in its manifesto. These include means-testing winter fuel payments for pensioners, increasing employers' national insurance contributions and slashing £5bn from the welfare bill. Asked what mistakes his government had made so far that had led to its drubbing at the ballot box, Mr Streeting told Sunday Morning with Trevor Phillips: \"Well, we will make plenty of mistakes.\" Politics latest: Lucy Powell 'right' to apologise for grooming gangs comments Pressed again on whether he believed \"mistakes\" had been made, the health secretary replied: \"No. When we made those choices, we knew they would be unpopular. And we knew that they would be opposed. \"The reason we made those choices is because we genuinely believe they're the right choices to get the country out of the massive hole it was left in. And right across the board. Whether it's the NHS, whether it's schools, whether it's prisons, whether it's our defence and security, whether it's crime and policing, there were enormous challenges facing this country when we came in. \"And we've had to make big and sometimes unpopular decisions so that we can face those challenges and deal with them. People might thank us if we just kind of go for the easy but we want to make the right choices.\" Some Labour MPs have urged the government to change direction, with one telling Sky News the cut to winter fuel was a \"catastrophic error\" that must be \"remedied\" if the party is to see any improvement in public opinion. Others have warned that in courting Reform voters, the party risks fracturing its coalition of voters on the left who may be tempted by the Liberal Democrats and Green Party. However, in the aftermath of the local elections, Sir Keir Starmer suggested the poor results meant he needed to go \"further and faster\" in delivering his existing agenda.  The real victor to emerge from Thursday's local elections was Reform UK, which won control of 10 councils and picked up 677 council seats largely at the expense of the Conservatives in the south. However, Reform also won the Runcorn by-election from Labour by just six votes, as well as control of Doncaster Council from Labour - the only local authority it had control of in this set of elections - in a significant win for Nigel Farage and his party. The Reform UK leader declared that two-party politics was now \"finished\" and that his party was now the official \"opposition\" to Labour. Asked whether the results meant that Labour would now treat Reform as \"your most serious opposition\", Mr Streeting said: \" I certainly do treat them as a serious opposition force.\" \"As I say, I don't know whether it will be Reform or the Conservatives that emerge as the main threat,\" he added. \"I don't have a horse in that race, but like alien versus predator, I don't really want either one to win.\" Read more:Reform's mission to 'remoralise' young peopleReform has put the two traditional parties on notice  Tory Party chairman Nigel Huddleston said Reform UK was not just a protest party and that Mr Farage was \"a force in British politics\". He told Trevor Phillips: \"But the one thing about Nigel Farage is, and we're seeing this again and again and again, he is a populist. \"He is increasingly saying everything that anybody wants to hear. He's trying to be all things to all men.\" \"We are establishing ourselves as a credible alternative government based on sound conservative principles and values and our values and our principles, and therefore our policies, will define the future of our party,\" he added."
    },
    {
        "title": "It is 'feasible' Nigel Farage could be the next prime minister, says Kemi Badenoch",
        "description": "Kemi Badenoch has admitted it is \"feasible\" that Nigel Farage could become the next prime minister.",
        "url": "https://news.sky.com/story/it-is-feasible-nigel-farage-could-be-the-next-prime-minister-says-kemi-badenoch-13361348",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kemi-badenoch-tories_6900952.jpg?20250429191213",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-04 09:07:00",
        "Headline": "The Tory leader says Reform UK is \"expressing the feeling of frustration\" in the country - but adds it is her job to \"come up with answers and solutions\".",
        "Content": " Kemi Badenoch has admitted it is \"feasible\" that Nigel Farage could become the next prime minister. The Tory leader told the BBC's Sunday With Laura Kuenssberg programme Mr Farage's party was \"expressing the feeling of frustration that a lot of people around the country are feeling\" - but added it was her job to \"come up with answers and solutions\". Asked if it was feasible that Mr Farage could be the next prime minister, she cited how Australian Prime Minister Anthony Albanese had won re-election this weekend. \"As I said, anything is feasible,\" she said. \"Anthony Albanese: people were writing him off. He has just won a landslide, but my job is to make sure that he [Farage] does not become prime minister because he does not have the answers to the problems the country is facing.\" Politics latest: Lucy Powell 'right' to apologise for grooming gangs comments  Asked what Mr Farage was doing right, Ms Badenoch said: \"He is expressing the feeling of frustration that a lot of people around the country are feeling. \"But he also doesn't have a record in government like the two main parties do. Now he's going to be running some councils. We'll see how that goes.\" Mr Farage was the undoubted winner of Thursday's local elections, in which 23 councils were up for grabs. His party picked up 677 council seats and took control of 10 councils. By contrast, the Conservatives lost 677 council seats as well as control of 18 councils in what was their worst local elections performance on record. Mr Farage said the outcome spelt the end of two-party politics and that his party was now the official \"opposition\" to Labour - with the Tories having been rendered a \"waste of space\". Read more:Reform has put the two traditional parties on notice'I get it': Starmer responds after losing Runcorn by-election Ms Badenoch said she believed the vote for Mr Farage on Thursday was partly down to \"protest\" but added: \"That doesn't mean we sit back. We are going to come out fighting. \"We are going to come out with the policies that people want to see, but what we are not going to do is rush out and tell the public things that are not true just so we can win votes. \"This is not about winning elections; this is about fixing our country. Yes, of course, you need to win elections to do that, but you also need a credible plan.\"  Conservative co-chairman Nigel Huddleston sought to play down the threat from Reform UK, telling Sky News: \"When they're in a position of delivering things, that's when the shine comes off.\" He told Sunday Morning with Trevor Phillips: \"The one thing about Nigel Farage is, and we're seeing this again and again and again, he is a populist. \"He is increasingly saying everything that anybody wants to hear. He's trying to be all things to all men.\" \"We are establishing ourselves as a credible alternative government based on sound conservative principles and values and our values and our principles, and therefore our policies, will define the future of our party,\" he added. Asked whether the results meant that Labour would now treat Reform as \"your most serious opposition\", Health Secretary Wes Streeting told Trevor Phillips: \" I certainly do treat them as a serious opposition force.\" \"As I say, I don't know whether it will be Reform or the Conservatives that emerge as the main threat,\" he added. \"I don't have a horse in that race, but like alien versus predator, I don't really want either one to win.\""
    },
    {
        "title": "Infected blood scandal: Victims 'scared they won't live to see compensation'",
        "description": "People who were given infected blood while receiving NHS care are \"scared they won't live to see compensation\", according to campaigners.",
        "url": "https://news.sky.com/story/infected-blood-scandal-victims-scared-they-wont-live-to-see-compensation-13361996",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-nhs-infected-blood_6906611.jpg?20250504220401",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-04 23:01:00",
        "Headline": "The inquiry into the scandal is set to reopen later this week amid concerns about delays to compensation, despite a commitment of £11.8bn in last year's budget.",
        "Content": "People who were given infected blood while receiving NHS care are \"scared they won't live to see compensation\", according to campaigners. The Infected Blood Inquiry is set to reopen later this week to examine the \"timeliness and adequacy\" of the government's response to compensation. Gary Webster, who was infected with HIV and hepatitis C when he attended Lord Mayor's Treloar's School in Hampshire in 1970s and 1980s said he felt things had \"gone downhill\" since the inquiry published its report last May. Mr Webster told the PA news agency that progress was \"too slow\" and there seemed to be \"a random system\" to choose who receives compensation. \"We fought for so many years to get to this stage… and now they're saying they hope to pay all the infected by the end of 2027 and they hope to pay the affected by the end of 2029,\" he said. \"Well, there's two people dying a week - you only have to do the sums yourself to work out that's a lot of people that aren't going to get paid, aren't going to get the justice and will die not knowing what happened.\" \"I think people are scared now that they're not going to survive until they get compensation,\" Mr Webster added. \n                  Ten victims of infected blood scandal to receive total of around £13m, Cabinet Office says\n                 \n                  Families of infected blood scandal victims call for changes to compensation scheme\n                 \n                  Infected blood victims 'livid' with 'paltry' compensation offer\n                 Another former pupil of the school who was infected with hepatitis C, Glenn Wilkinson, last year told Sky News that the compensation offer was \"paltry\". The Haemophilia Society said the scandal had \"ruined\" people's lives, with compensation delays having \"added to their suffering\". The Hepatitis C Trust said it hoped reopening the inquiry would \"bring about a step change in the government's attitude to the people impacted by this terrible scandal\".  Between the 1970s and early 1990s, more than 30,000 people in the UK were infected with HIV and hepatitis C while receiving NHS care. Some 3,000 people have died after they were given contaminated blood and blood products, while survivors live with lifelong implications. 'Restless for progress' In last October's Budget, Chancellor Rachel Reeves committed £11.8bn to compensate victims of the infected blood scandal. The compensation scheme is administered by the Infected Blood Compensation Authority (IBCA), which as of 24 April, has invited 475 people to make a claim and made 77 payments totalling more than £78m, according to its figures. Campaigners will give evidence during the inquiry's latest hearings, as well as Cabinet Office minister Nick Thomas-Symonds, who said last month that he was \"restless for progress\" in handing out compensation. Sir Brian Langstaff, the inquiry's chairman, has said the victims and families of those affected have been left distressed and powerless by the government's approach and that both those infected and affected \"do not have time on their side\". Read more from Sky News:When and where to watch VE Day flypast routeMeghan posts new photo of Prince Harry after backlash An IBCA spokesperson said its priority was \"paying as many people as soon as possible\" and that it was using what it had learned \"to increase the number of claims each week\". A government spokesperson said it was \"fully committed to cooperating with the inquiry\" and was working to deliver \"one of the most comprehensive compensation schemes in modern history\"."
    },
    {
        "title": "Football bodies could be forced to pay towards brain injury care costs of ex-players",
        "description": "Football bodies could be forced to pay towards the care costs of ex-players who have been diagnosed with brain conditions, under proposals set to be considered by MPs.",
        "url": "https://news.sky.com/story/football-bodies-could-be-forced-to-pay-towards-brain-injury-care-costs-of-ex-players-13362050",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-football-istock_6906738.jpg?20250505002018",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-04 23:01:00",
        "Headline": "Campaigners say existing support for former players diagnosed with brain conditions, such as dementia, is not fit for purpose.",
        "Content": "Football bodies could be forced to pay towards the care costs of ex-players who have been diagnosed with brain conditions, under proposals set to be considered by MPs. Campaigners are drafting amendments to the Football Governance Bill, which would treat conditions caused by heading balls as an \"industrial injuries issue\". The proposals seek to require the football industry to provide the necessary financial support. Campaigners say existing support is not fit for purpose, including the Brain Health Fund which was set up with an initial £1m by the Professional Footballers' Association (PFA), supported by the Premier League. But the Premier League said the fund has supported 121 families with at-home adaptations and care home fees. From England's 1966 World Cup-winning team, both Jack and Bobby Charlton died with dementia, as did Martin Peters, Ray Wilson and Nobby Stiles. Ex-players, including former Liverpool defender Neil Ruddock, went to parliament last week to lobby MPs. \n                  Bristol Rovers legend taking legal action against FA over brain condition says he has just years to live\n                 \n                  Simple blood test that could detect dementia at early stage begins trial in NHS clinics\n                 \n                  Former Manchester United defender David May shares dementia fears\n                 Ruddock told Sky News he had joined campaigners \"for the families who've gone through hell\". \"A professional footballer, greatest job in the world, but no one knew the dangers, and that's scary,\" he said. \"Every time someone heads a ball it's got to be dangerous to you. You know, I used to head 100 balls a day in training. I didn't realise that might affect my future.\" A study co-funded by the PFA and the Football Association (FA) in 2019 found footballers were three and a half times more likely to die of a neurodegenerative disease than members of the public of the same age. 'In denial' Among those calling on football authorities to contribute towards the care costs of ex-players who have gone on to develop conditions such as Alzheimer's and dementia is Labour MP Chris Evans. Mr Evans, who represents Caerphilly in South Wales, hopes to amend the Bill to establish a care and financial support scheme for ex-footballers and told a recent event in parliament that affected ex-players \"deserve to be compensated\". Greater Manchester Mayor Andy Burnham, who helped to draft the amendment, said the game was \"in denial about the whole thing\". Mr Burnham called for it to be seen as \"an industrial injuries issue in the same way with mining\". In January, David Beckham lent his support to calls for greater support for footballers affected by dementia. One of the amendments says that \"the industry rather than the public should bear the financial burden\". Read more from Sky News:Woman missing for more than 60 years found 'alive and well'Meghan posts new photo of Prince Harry amid backlash A spokesperson for the FA said it was taking a \"leading role in reviewing and improving the safety of our game\" and that it had \"already taken many proactive steps to review and address potential risk factors\". An English Football League spokesperson said it was \"working closely with other football bodies\" to ensure both professional and grassroots football are \"as safe as it can be\". The PFA and Premier League declined to comment."
    },
    {
        "title": "M&S 'had no plan' for cyber attacks, insider claims, with 'staff left sleeping in the office amid paranoia and chaos'",
        "description": "A M&S insider has told Sky News it could be \"months\" before the retailer fully recovers from an ongoing, severe cyber attack - and that the company had no plan for such an incident.",
        "url": "https://news.sky.com/story/ms-had-no-plan-for-cyber-attacks-insider-claims-with-staff-left-sleeping-in-the-office-amid-paranoia-and-chaos-13361359",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-marks-and-spencer-oxford-street_6905825.jpg?20250504125252",
        "type": "Technology",
        "Author": "Tom Cheshire",
        "Date Published": "2025-05-04 09:49:00",
        "Headline": "A source describes chaotic scenes - as hackers continue to hold the High Street company to ransom.",
        "Content": "\n          Data and forensics correspondent\n              @chesh\n A M&S insider has told Sky News it could be \"months\" before the retailer fully recovers from an ongoing, severe cyber attack - and that the company had no plan for such an incident. Hackers have been holding the High Street brand to ransom for more than a week now, forcing it to suspend online orders and halt recruitment. An employee at M&S's head office, who spoke to Sky News on condition of anonymity, said that last week had been \"just pure chaos\". \"We didn't have any business continuity plan [for this], we didn't have a cyber attack plan,\" the source said. \"In general, it's lots of stress. People have not been sleeping, people have spent their weekends working, people sleeping in the office - just reactive response.\" They told Sky News it would be \"a few months\" before the disruption ended. \"The idea is to have some services go back online bit by bit. Not do the whole shebang, but allow the people in the store and to allow people online to have services.\" Read more: Who are notorious Scattered Spider hackers?  In the meantime, they said that staff were being forced to work on personal devices in an ad-hoc manner, with internal advice constantly changing. \"We're kind of figuring it out as we go,\" they said. \"We're not even allowed to use our work devices, so we're having to use our personal devices, all sorts of things. \"It's just impossible to work because anything about the incident, we're not allowed to talk about on Teams, which is our usual way of chatting… So we have to use WhatsApp to talk to each other.\" They said there is a \"sense of paranoia and therefore not everyone knows everything, because we don't know who has been compromised. They are still trying to figure things out.\" That paranoia exists because employees are still not sure whether hackers are inside the M&S system, the source said. \"It's possible, that's a possibility,\" they said. \"I don't know that, and it hasn't been said. But it's a possibility and you want to be careful.\" 👉 Listen to Sky News Daily on your podcast app 👈 M&S told shoppers on Friday it was \"really sorry\" it hasn't been able to \"offer you the service you expect\". \"We are working day and night to manage the current cyber incident and get things back to normal for you as quickly as possible,\" M&S chief executive Stuart Machin said in a statement to customers. An M&S spokesperson added: \"M&S has robust business continuity plans and processes in place for managing incidents, led by an experienced team.\" Sky News also understands that the executive team exercised a cyber incident last year. Harrods and the Co-op Group have also been targeted by hackers in recent days. Attacks should be 'wake-up call' Cabinet Office minister Pat McFadden will this week tell \"every business in the UK\" that these attacks should be a \"wake-up call\". Mr McFadden is expected to tell the CyberUK conference in Manchester: \"In a world where the cybercriminals targeting us are relentless in their pursuit of profit - with attempts being made every hour of every day - companies must treat cybersecurity as an absolute priority.\" He will say: \"We've watched in real time the disruption these attacks have caused, including to working families going about their everyday lives. \"It serves as a powerful reminder that just as you would never leave your car or your house unlocked on your way to work, we have to treat our digital shop fronts the same way.\""
    },
    {
        "title": "New tech promises faster diagnosis for millions of cancer patients",
        "description": "Millions of cancer patients are set to benefit from faster diagnosis as their analogue NHS records are gathered in one place in a new digital platform.",
        "url": "https://news.sky.com/story/new-tech-promises-faster-diagnosis-for-millions-of-cancer-patients-13361399",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-doctor-patient-anonymous_6905778.jpg?20250504122619",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-04 11:26:00",
        "Headline": "By bringing cancer patients' data into one central digital system, clinicians will no longer be reliant on \"archaic pen-and-paper systems\".",
        "Content": "Millions of cancer patients are set to benefit from faster diagnosis as their analogue NHS records are gathered in one place in a new digital platform. Cancer 360, a new tool to be rolled out across the service soon, brings cancer patients' data into one central system, so clinicians can prioritise those most in need and see patients quicker, the Department for Health and Social Care (DHSC) said. The £26bn technology upgrade will benefit millions of patients in the next five to 10 years by transferring existing analogue systems and the data they hold into a digital one. It means staff will no longer have to gather important information about each cancer patient from different spreadsheets, emails and records. Technology Secretary Peter Kyle said relying on \"archaic pen-and-paper systems\" meant vital appointments could hinge on \"whether a post-it note lost its stick or a piece of paper went missing\". That, he said, could \"put lives at risk\". The new technology will \"cut waiting times and save lives, delivering on our plan for change\", he added. It is understood that trusts will not have to use the tool, but any failing to meet the cancer treatment target - including that 85% of patients start their treatment within 62 days of referral - may be asked to consider whether it could help. As well as helping patients get a faster diagnosis, the DHSC said Cancer 360 will also help cut treatment delays and thus boost survival rates. Dr Vin Diwakar, NHS national clinical transformation director, said Cancer 360 gives clinicians a \"comprehensive view of patient pathways\" and, as it goes nationwide, will deliver \"meaningful improvements in both treatment times and patient experience\". The technology helped one of the trusts where it was piloted meet the faster diagnosis standard that three-quarters of patients should receive a diagnosis or ruling out of cancer within 28 days of referral. Read more:Cancer blood test to be trialledNew hope for breast cancer patientsBrothers saved by spit test Suraiya Abdi, consultant obstetrician and gynaecologist at Chelsea and Westminster Foundation Trust, said Cancer 360 has helped staff \"safely carry our patients through their cancer pathway\". Amongst the improvements they have enjoyed, the medic said it \"has reduced the amount of admin time spent by our cancer team\" as well as lifting \"performance, team spirit and most importantly patient experience\"."
    },
    {
        "title": "Police foil bomb plot targeting Lady Gaga's biggest-ever show on Copacabana beach",
        "description": "Brazilian police say they foiled a bomb attack planned for a Lady Gaga concert on Rio de Janeiro's Copacabana beach that attracted an estimated 2.1 million people.",
        "url": "https://news.sky.com/story/police-foil-bomb-plot-targeting-lady-gagas-biggest-ever-show-on-copacabana-beach-13361275",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-lady-gaga-copacabana-beach_6905650.jpg?20250504034928",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-04 01:21:00",
        "Headline": "The plot was orchestrated by a group promoting hate speech and the radicalisation of teenagers, police said, with the recruiters identifying themselves as Gaga's fans, known as \"Little Monsters\".",
        "Content": " Brazilian police say they foiled a bomb attack planned for a Lady Gaga concert on Rio de Janeiro's Copacabana beach that attracted an estimated 2.1 million people. The plot was orchestrated by a group promoting hate speech and the radicalisation of teenagers, including self-harm and violent content as a form of social belonging, according to the Civil Police of Rio de Janeiro, which worked in coordination with the country's justice ministry. \"The suspects were recruiting participants, including minors, to carry out coordinated attacks using improvised explosives and Molotov cocktails,\" the force said. The justice ministry said the recruiters identified themselves as Gaga's fans, known as \"Little Monsters\". It said Operation Fake Monster was based on a report by the ministry's cyber operations lab following a tip-off from Rio state police intelligence, which uncovered digital cells encouraging violent behaviour among teenagers using coded language and extremist symbolism. Authorities carried out over a dozen search and seizure warrants, and a man described as the group's leader was arrested in the southern state of Rio Grande do Sul for illegal possession of a firearm, and a teenager was detained in Rio de Janeiro for storing child abuse images. In a statement, a spokesperson for Lady Gaga said: \"We learned about this alleged threat via media reports this morning. \"Prior to and during the show, there were no known safety concerns, nor any communication from the police or authorities to Lady Gaga regarding any potential risks. \"Her team worked closely with law enforcement throughout the planning and execution of the concert and all parties were confident in the safety measures in place.\" Gaga's biggest ever show Some 500,000 tourists travelled to watch the concert, which was paid for by the city in an attempt to boost the struggling economy. Saturday night's two-hour show, which marked Gaga's biggest ever, marked the first time she had played in Brazil since 2012, having cancelled an appearance at the Rock in Rio festival in 2017 over health issues. Gaga, who released her seventh studio album, Mayhem, in March, opened with a dramatic, operatic edition of her 2011 track Bloody Mary, before launching into Abracadabra, a recent track. \"Brazil! I missed you. I missed you so much,\" she exclaimed, before launching into Poker Face, one of her biggest hits. The American pop star drew in a similar crowd to Madonna's in May last year, who performed at the same beach, which is transformed into an enormous dance floor for the shows. Addressing the crowd in English and through a Portuguese translator, Gaga became emotional as she said: \"I'm so honoured to be here with you tonight. \"Tonight we're making history, but no one makes history alone. Without all of you, the incredible people of Brazil, I wouldn't have this moment. Thank you for making history with me. \"The people of Brazil are the reason I get to shine today. But of all the things I can thank you for, the one I most am grateful for is this: that you waited for me. You waited more than 10 years for me.\" She said it took so long to come back because she was \"healing\" and \"getting stronger\". The pop sensation cancelled many of her shows in 2017 and 2018 due to her fibromyalgia condition, which can cause pain and fatigue. It is estimated Gaga's show will have injected around 600 million reais (£79.9m) into the economy, nearly 30% more than Madonna's show. Read more:John Lithgow on JK Rowling's trans stance backlashWhy are the band Kneecap controversial? The large-scale free shows are set to continue annually until at least 2028, always taking place in May, which is considered the economy's \"low season\", according to the city's government. A hefty security plan was in place, including the presence of 3,300 military and 1,500 police officers, along with 400 military firefighters. 'A dream come true' The city has been swarmed with Gaga fans since her arrival on Tuesday, with some even keeping vigil outside of the hotel she has been staying at. Many arrived at the beach at the crack of dawn on Saturday to secure good spots on the beach, despite the show not starting until 9.45pm. Ana Lara Folador, who attended with her sister, said it was \"a dream come true\", and that Gaga had \"really shaped a part of my personality, as a person and an artist\". Ingrid Serrano, a 30-year-old engineer who made a cross-continent trip from Colombia to Brazil to attend the show, turned up in a T-shirt featuring Lady Gaga's outlandish costumes over the years. \"I've been a 100% fan of Lady Gaga my whole life,\" she said, adding the 39-year-old megastar represented \"total freedom of expression - being who one wants without shame\". Matheus Silvestroni, 25, an aspiring DJ and a Gaga fan since the age of 12, endured an eight-hour bus ride from Sao Paulo for the show. He said it was Gaga who had inspired him to embrace his sexuality and pursue his dream of becoming an artist. \"I was bullied because I was a fat, gay kid, so I was an easy target,\" he said. \"Gaga was very important because she sent a message that everything was okay with me, I wasn't a freak, because I was 'Born This Way'.\" Rio is known for holding massive open-air concerts, with Rod Stewart holding a Guinness World Record for the four million-strong crowd he drew to Copacabana beach in 1994."
    }
]