[
    {
        "title": "At least 26 killed as tornadoes and dust storms rip through parts of US",
        "description": "At least 26 people are reported to have died in powerful storms across the United States.",
        "url": "https://news.sky.com/story/at-least-26-killed-as-tornadoes-and-dust-storms-rip-through-parts-of-us-13329033",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-missouri-storm-bridgeton_6858082.jpg?20250316004528",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-15 12:07:00",
        "Headline": "Missouri recorded 12 fatalities, with deaths also recorded in Arkansas and Texas after tornadoes ripped apart homes and brought down trees. The massive weather system has also produced deadly dust storms, wildfires and hail the size of baseballs.",
        "Content": "At least 26 people are reported to have died in powerful storms across the United States. The number of fatalities increased after eight people died in a highway pile-up caused by a dust storm in Sherman County, Kansas on Friday. At least 50 vehicles were involved. Car crashes during a dust storm also killed three people in Amarillo, Texas. Authorities in Missouri say 12 people died after tornadoes struck the state, with another three deaths reported in Arkansas. Around 108 million people remain under widespread wind, flash flooding and wildfire alerts in central and southern US states. Hundreds of thousands of households are also without power. Tornado warnings are in place in parts of Illinois, Missouri, Arkansas, Mississippi, Indiana, and Kentucky as a massive storm system moves across the country. Many areas across southern states are, or will soon be, dealing with widespread flash flooding, the National Weather Service warned. It added that the flooding could turn deadly. In Butler County, Missouri, on the border with Arkansas, local coroner Jim Akers said the man and his wife were sleeping when the tornado struck. Rescuers were able to pull the woman from the debris - but could not save the man whose mobile home was ripped apart. \"It was unrecognisable as a home. Just a debris field,\" he said, describing the scene. \"The floor was upside down. We were walking on walls.\" Large vehicles were also pictured overturned across the state. Arkansas governor Sarah Huckabee Sanders warned the recovery could take months after surveying damage from an EF3 tornado in Cave City, in the north of the state. A storm ranked as EF3, on a scale of one to five, requires wind speeds of between 136-165mph (218-265kph). Hail the size of baseballs \"It's hard to look at this level of devastation and not be heartbroken,\" she said. \"It's a whole other world when you see it up close and personal.\" Winds gusting up to 80mph (130kph) were predicted from the Canadian border to Texas, threatening blizzard conditions in colder northern areas and wildfire risk in warmer, drier places to the south. Hail was also a hazard, some the size of baseballs were reported in Christian County, the US weather service said. Fatal pile-ups during dust storms In the Texas city of Amarillo, three people were killed in car crashes caused by a dust storm on Friday, according to the state's public safety department. One of the deaths happened after three lorries collided with four other vehicles in Palmer County, Bovina's fire chief Cesar Marquez said. Another occurred after a pile-up of an estimated 38 cars. \"It's the worst I've ever seen,\" public safety department sergeant Cindy Barkley said, calling the near-zero visibility a nightmare. \"We couldn't tell that they were all together until the dust kind of settled.\" Evacuations were ordered in some Oklahoma communities as more than 130 fires were reported across the state. Nearly 300 homes were damaged or destroyed, said governor Kevin Stitt. Read more from Sky News:Trump launches strikes against HouthisUS expels SA ambassadorThe big unknowns after Starmer's summit Three deaths happened due to storm damage in Independence County, Arkansas on Friday night, with a further 29 people injured across eight different counties, authorities said. More than 260,000 households are without power in midwestern and southern states, according to the monitoring website PowerOutage.us. The Storm Prediction Center at the National Weather Service issued an update on Sunday, warning of a moderate risk of severe thunderstorms. The warning covers an area from the extreme southeastern part of Mississippi, across much of Alabama, into western Georgia and the western Florida panhandle."
    },
    {
        "title": "Donald Trump launches strikes against Yemen's Houthis over Red Sea ship attacks",
        "description": "US President Donald Trump has launched strikes against the Houthis in Yemen. ",
        "url": "https://news.sky.com/story/donald-trump-launches-strikes-against-yemens-houthis-13329695",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-yemen-houthis_6857893.jpg?20250315192111",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-15 18:44:00",
        "Headline": "At least nine civilians have been killed, according to the health ministry run by the Iran-backed group. ",
        "Content": "US President Donald Trump has launched strikes against the Houthis in Yemen.  In a post on his Truth Social platform, he also warned Iran the country's support for the group must \"end immediately\". The Iran-backed Houthis reported a series of explosions in Yemen's capital Sanaa on Saturday evening.   The Houthi-run health ministry said in a post on X that at least nine civilians have been killed and nine others injured. Images shared online show plumes of black smoke over the area of the city's airport complex, which includes a sprawling military facility. Mr Trump said the strikes were over the group's attacks against ships in the Red Sea. \"Your time is up, and your attacks must stop, starting today. If they don't, hell will rain down upon you like nothing you have ever seen before,\" he said. The president said Iran would be held \"fully accountable\" for the actions of its proxy, adding: \"And we won't be nice about it!\" The strikes come days after the Houthis said they would resume attacks on Israeli vessels sailing in waters off Yemen in response to Israel's blockade on Gaza, although there have been no Houthi attacks reported since then. Earlier this month, Israel halted all aid coming into Gaza and warned of \"additional consequences\" for Hamas if their fragile ceasefire is not extended as negotiations continue over starting a second phase. \"The Houthi attack on American vessels will not be tolerated. We will use overwhelming lethal force until we have achieved our objective,\" Mr Trump wrote. \"These relentless assaults have cost the US and World Economy many BILLIONS of Dollars while, at the same time, putting innocent lives at risk.\" The Houthis launched more than 100 attacks targeting shipping from November 2023, saying they were in solidarity with Palestinians over Israel's war with Hamas in Gaza. The US, Israel and Britain have previously hit Houthi-held areas in Yemen. According to a US official, the operation - the first strike on the Houthis under the second Trump administration - was conducted solely by the US. Read more from Sky News:At least 17 dead in US stormsUS expels South African ambassador The Houthi media office said the strikes hit \"a residential neighbourhood\" in Sanaa's northern district of Shouab. Sanaa residents said at least four airstrikes hit the Eastern Geraf neighbourhood in the district, terrifying women and children in the area. \"The explosions were very strong,\" said Abdallah al Alffi. \"It was like an earthquake.\" Similar missile strikes against the Houthis were done multiple times by Joe Biden's administration in response to frequent attacks by the Houthis against commercial and military vessels in the region."
    },
    {
        "title": "The two big unknowns left up in the air after Starmer's 'coalition of the willing' Ukraine summit",
        "description": "There was one clear, united message from today's virtual meeting of leaders - that they rejected Vladimir Putin's \"yes, but\" approach to a ceasefire.",
        "url": "https://news.sky.com/story/the-two-big-unknowns-left-up-in-the-air-after-starmers-coalition-of-the-willing-ukraine-summit-13329413",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-keir-starmer-downing-street_6856351.jpg?20250314154910",
        "type": "Home",
        "Author": "Sam Coates",
        "Date Published": "2025-03-15 16:41:00",
        "Headline": "Leaders want Russia to mirror Ukraine's ceasefire pledge - but don't trust Vladimir Putin to uphold promises on peace.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  There was one clear, united message from today's virtual meeting of leaders - that they rejected Vladimir Putin's \"yes, but\" approach to a ceasefire. The \"coalition of the willing\" - the 27 leaders, plus NATO and the EU led by Sir Keir Starmer and Emmanuel Macron - want the Russian president to mirror Ukraine's pledge for a 30-day pause in fighting, in order to hammer out a sustainable peace deal. Sir Keir made that very clear, and suggested the attendees at the meeting were behind this approach. Ukraine war latest: Putin's ceasefire conditions 'not good enough'  The prime minister said: \"Volodymyr [Zelenskyy] has committed to a 30-day unconditional ceasefire, but Mr Putin is trying to delay, saying there must be a painstaking study before a ceasefire can take place. \"Well, the world needs action, not a study, not empty words and conditions. So my message is very clear. Sooner or later, Putin will have to come to the table.\" There are two reasons for this challenge - an immediate end to fighting is a goal in itself, but many of those in today's call, including Sir Keir, do not trust Mr Putin to uphold promises on peace and are trying to convince US President Donald Trump to be more clear-eyed about the Russian approach. Challenging the Russian leader to follow the US request for a ceasefire and watching him refuse is designed to send a message to the White House as well as the Kremlin. There were, however, bigger unknowns left hanging. Read more from Sky News:Russian captain of North Sea crash ship appears in courtAt least 17 dead in US storms One of which was the clear signal from Sir Keir that he is still relying on a US security guarantee in order to bring on board a \"coalition of the willing\" who might be able to provide troops to Ukraine. There are, however, many that don't think that that US security guarantee is coming in any substantial way, based on the noises coming out of the US. That is a big problem for the PM, as government sources tell me that the scope and the remit of any potential peacekeeping force is determined by what protection the US might be able to provide. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 The second issue that is being sidestepped by Sir Keir is what any peace keeping might be able to do in practice. UK troops, like those of any NATO country, cannot engage directly with Russia in combat for fear of triggering a much bigger conflagration. So if not that, then what is their purpose - a question repeatedly asked by experts like the former national security adviser Lord Ricketts. I put exactly this to the PM, but did not get an answer. He suggested that we were a long way away from getting an an answer, even though military chiefs also appear to be meeting to \"operationalise\" plans on Thursday. How can they operationalise a plan that does not, and currently cannot, have a remit? Today Sir Keir heralded the participation of Canada, Australia and New Zealand on the call, as part of the effort. But if the remit of the coalition of the willing isn't clear, how can it truly be effective?"
    },
    {
        "title": "France win Six Nations with victory over Scotland in Paris",
        "description": "France have won the Six Nations after beating Scotland 35-16 in Paris.",
        "url": "https://news.sky.com/story/france-win-six-nations-with-victory-over-scotland-in-paris-13329671",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-six-nations-france_6858018.jpg?20250315222015",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-15 18:19:00",
        "Headline": "England finished second after thrashing Wales, while last year's champions Ireland ended up in third place.",
        "Content": "France have won the Six Nations after beating Scotland 35-16 in Paris. England pushed the championship battle to the final game after earlier destroying Wales with a record 68-14 win in Cardiff. But Les Bleus sealed victory in front of a home crowd in a packed Stade de France to lift their first title since 2022 and only their second since 2010. Scotland briefly threatened to spoil the party and were unlucky to go into halftime 16-13 behind after a Tom Jordan try was disallowed.  The match remained tight until France threw on their forward replacements and Scotland's defence tired under the onslaught. Yoram Moefana grabbed the bonus-point securing fourth try and the celebrations in Paris began. France had bounced back emphatically from their defeat away to England on matchday two to crush Ireland and Italy and put themselves in pole position entering the final day. The hosts only needed a win against Scotland, with both England and Ireland also in with a chance, but only if other results went their way. Read more from Sky News:Meet the penguins of the FalklandsAt least 17 dead in US storms Last year's champions Ireland kept their hopes of retaining the title alive with an unconvincing 22-17 bonus-point win over Italy in the early game in Rome. A week on from having their Grand Slam dream crushed by a 42-27 drubbing in Dublin at the hands of France, Ireland moved top of the table ahead of the other matches. But they needed both of their championship rivals to slip up, and England's 10-try demolition of Wales pushed Ireland back into second place, while France's win meant they finished the competition in third. The Prince of Wales, who is the patron of the Welsh Rugby Union and his wife the Princess of Wales, the patron of the Rugby Football Union, cheered on opposing sides from the stands. England's emphatic bonus-point victory still left them relying on Scotland to beat the favourites to finish in the top spot. Winless Wales were condemned to a second successive wooden spoon and 17th Test defeat on the bounce - a record for a tier one nation in the professional era."
    },
    {
        "title": "Nine Palestinians killed, including three journalists, in Israeli airstrike, Gaza health ministry says",
        "description": "An Israeli airstrike in Gaza has killed at least nine Palestinians, including three local journalists, the territory's health ministry has said.",
        "url": "https://news.sky.com/story/nine-palestinians-killed-including-three-journalists-in-israeli-airstrike-gaza-health-ministry-says-13329524",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-palestinians-israeli_6857665.jpg?20250315174621",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-15 17:14:00",
        "Headline": "An NGO says six volunteers were \"deliberately targeted\" and killed while on their way to deliver aid. The Israeli military says it struck two individuals who it identified as \"terrorists\" and later struck several other suspects.",
        "Content": "An Israeli airstrike in Gaza has killed at least nine Palestinians, including three local journalists, the territory's health ministry has said. The strike hit a car, with casualties inside and outside the vehicle, and several people were critically injured, according to officials in the Gaza Strip. Six volunteers from the Al Khair Foundation were \"deliberately targeted\" and killed while on their way to deliver aid in the northern town of Beit Lahia, said the UK-based international non-governmental organisation (NGO). Among the six were the three journalists - Mahmoud al Sarraj, Mahmoud Isleem, and Bilal Abu Matar - who were recording humanitarian relief efforts for those affected by the war in Gaza, the foundation said.  The other three victims have been named as Bilal Akeela, Mohammad al Ghafir, and Hazem Gharib. The foundation said: \"The first strike injured one team member, prompting them to move away, but a drone followed them and struck their vehicle directly with a second strike, killing them all.\" What has Israel's military said? In a statement, the Israeli military said it had struck two individuals who it identified as \"terrorists\" operating a drone that it said posed a threat to forces in Beit Lahiya. The military later struck several other suspects who it said had collected the drone equipment and entered a vehicle. The military did not say how it had established that the individuals it had struck were \"terrorists\" or provide details about the threat that the drone had posed to its troops. Gaza official denies army's claims  Salama Marouf, the head of the Hamas-run Gaza government media office, denied the Israeli army's allegations. \"The team was made of civilians and worked in an area near a shelter on a mission sponsored by a charity. They didn't exist in a prohibited area and didn't pose any danger of any kind to the occupation army,\" Marouf said in a statement.  Saturday's incident underscores the fragility of the 19 January ceasefire agreement that halted large-scale fighting in the Gaza Strip. Palestinian health officials say dozens of people have been killed by Israeli fire despite the truce. The airstrike coincided with a visit to Egypt's capital Cairo by Hamas's exiled Gaza chief, Khalil al Hayya, for further truce talks aimed at resolving disputes with Israel. Read more:Israel accused of 'genocidal acts' against Palestinians in UN reportPalestinian officials say Israel kills eight in Gaza and five in West Bank The militant group has accused Israel of attempting to renege on the ceasefire agreement, putting the number of Palestinians killed since 19 January, it says, at 150. Hamas urged mediators to compel Israel to move ahead with the implementation of the phased ceasefire deal, blaming Israel's Prime Minister Benjamin Netanyahu for the current impasse. What next for ceasefire deal? The temporary first phase, where Hamas released dozens of Israeli hostages in return for around 1,500 Palestinian prisoners being freed from Israeli jails, expired on 2 March. But Israel says it wants to extend the first phase, a proposal backed by US envoy Steve Witkoff. Hamas says it will only resume freeing hostages under the second phase. Israel has rejected opening the second phase of talks, which would require it to negotiate over a permanent end to the war, which is Hamas's main demand. The war began when Hamas militants carried out a cross-border raid into southern Israel on 7 October 2023, killing 1,200 people and capturing around 250 hostages, according to Israeli officials. Israel responded by launching an air and ground offensive in Gaza which has killed more than 48,000 Palestinians, say Gaza health officials. The Gaza health ministry does not distinguish between civilians and combatants in its count but said more than half of the fatalities were women and children."
    },
    {
        "title": "US expels South African ambassador for being 'race-baiting politician'",
        "description": "The United States has expelled South Africa's ambassador for being a \"race-baiting politician who hates America\".",
        "url": "https://news.sky.com/story/us-expels-south-african-ambassador-for-being-race-baiting-politician-13328948",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-ebrahim-rasool-south-africa_6856924.jpg?20250315075042",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-15 07:22:00",
        "Headline": "Relations between the US and South Africa have been strained since Donald Trump re-entered the White House in January.",
        "Content": "The United States has expelled South Africa's ambassador for being a \"race-baiting politician who hates America\". Secretary of state Marco Rubio posted on X late on Friday to say Ebrahim Rasool is \"no longer welcome in our great country\" because he \"hates America and @POTUS [President of the United States]\". \"We have nothing to discuss with him and so he is considered PERSONA NON GRATA,\" Mr Rubio said. Relations between the US and South Africa have been strained since Donald Trump re-entered the White House in January. The second-time president cut the country's financial aid and has criticised both its land policy, aimed at evening out racial disparities, and its genocide case against Israel at the International Criminal Court (ICC). Mr Trump, without any supporting evidence, has claimed \"South Africa is confiscating land\" and that \"certain classes of people\" are being treated \"very badly\" there. Elon Musk, his close ally and head of newly created Department of Government Efficiency (DOGE), has said white South Africans have fallen victim to \"racist ownership laws\". The new legislation, passed in January, makes it easier for the government to expropriate land in the public interest. The expulsion comes after Mr Rasool addressed a webinar in which he said Mr Trump is leading a \"white supremacist\" movement in America. Mr Rubio posted a news report on the webinar alongside his announcement. Read more from Sky NewsUK city hit by bin strikeGang jailed for kidnapping music producerInfluencer snatches baby wombat US-South Africa relations at 'lowest point' Mr Rasool began his second post as US ambassador in January, having served in Washington previously between 2010 and 2015. The office for South Africa's president Cyril Ramaphosa described the US decision as \"regrettable\", adding that it remains committed to a \"mutually beneficial relationship with the country\". Mr Rasool has been excluded from meetings with key State Department officials - and members of Mr Trump's administration, according to news website Semafor. His pro-Palestinian views and criticism of Israel appear to have been the reason, the website claimed, citing an anonymous South African diplomat. Former US ambassador to South Africa Patrick Gaspard told Reuters that ties between the two nations have reached their \"lowest point\". \"There's too much at stake to not work towards the repair of this partnership,\" he said."
    },
    {
        "title": "An abundance of marine life - but the wildlife of the Falkland Islands is more vulnerable than most",
        "description": "You can hear them before you see them. And smell them.",
        "url": "https://news.sky.com/story/why-wildlife-in-the-falkland-islands-is-more-vulnerable-than-most-13328568",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-penguins-clarke_6856330.png?20250314153234",
        "type": "Home",
        "Author": "Tom Clarke",
        "Date Published": "2025-03-15 00:01:00",
        "Headline": "Conservation and research here is almost entirely reliant on grant funding from the UK government through a scheme for British Overseas Territories called Darwin Plus.\nBut the future of the scheme is in doubt as budgets for overseas development and conservation are threatened.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  You can hear them before you see them. And smell them. At this time of year - the South Atlantic summer - the penguins of the Falkland Islands mob together in rookeries on these isolated beaches to raise their fluffy chicks. And we're surrounded by them. The beach at Volunteer Point on the northeast tip of the Falklands is home to its largest colony of king penguins. Up to a metre tall, they stand squabbling in a defensive huddle around their chicks. But there are others too, burrowing magellanic penguins and red-billed, yellow-footed gentoo. Across the 740 islands that make up the Falklands there are five different species and around a million of them in total. \n                  What we learnt flying over the world's largest iceberg A23a - and why it's not long for this world\n                 \n                  Trump government attempts to rip up 31 environmental protections and reviews damage of greenhouse gases\n                 \n                  The furious rise of climate whiplash\n                 To prevent disturbance, and the spread of bird flu, visitors are asked to keep six metres from the birds. But the rule doesn't apply in reverse. Turn your back for a minute or two and a curious or territorial penguin will waddle right up, giving you a side-eye like a three foot yob in a colourful wetsuit. The penguins are just some of the most visible and accessible marine life on these islands. There are sealions, fur seals, even a few of the world's largest, the elephant seal. Seabirds like albatross, petrels and only recently large numbers of whales are returning. They were rarely seen here since their wholesale slaughter in the 19th and 20th centuries. An abundance of life that's in stark contrast to the windswept peat bog and rough grassland interior of the Falklands. And a revelation to many visitors who arrive thinking the islands are remarkable only for the remoteness and a brutal conflict more than four decades ago. But seeing the best of the island's wildlife isn't easy. To get to Volunteer Point, it is a three-hour drive from the capital Port Stanley, two hours of which is off road. Read more from Sky News:The town bracing for UK's biggest council tax riseWhat we learnt flying over the world's largest iceberg At one point even our well equipped 4X4 and experienced driver were no match for the boggy terrain that swallowed our vehicle's wheels up to the axles. Like everywhere, the wildlife of the Falklands is vulnerable to climate change. But here, it's more vulnerable than most. The Falklands is some of the first ice-free land between Antarctica and the rest of the world and many species here are at the northerly limit of their range, that is expected to move further south as the planet warms. Already, numbers of rockhopper penguins are declining on the islands and that's thought to be due to their main food source, shrimp-like krill, moving further south to cooler waters. The Falklands are receiving less rainfall, which has led to its peat soils drying out. That, combined with centuries of overgrazing by sheep, is causing soil being blown away by strong South Atlantic winds. \"On some of the land that we're working on we're seeing around nine football pitches worth of soil blowing away each year,\" says Esther Bertram, chief executive of Falklands Conservation. The drying climate has led to wildfires too. Recent fires burned crucial wildlife habitats. \"We had albatrosses sitting on their nests literally burning alive,\" says Ms Bertram. Conservation groups and researchers on the islands have been working to study the changing ecosystem and restore crucial habitats, including replanting native tussock grass to help retain the soil crucial for burrowing penguins and petrels. But even that work is in jeopardy. Conservation and research here is almost entirely reliant on grant funding from the UK government through a scheme for British Overseas Territories called Darwin Plus. However, the future of the scheme is in doubt as budgets for overseas development and conservation are threatened. Defra, which administers the scheme, was unable to confirm whether the Darwin Plus scheme will continue beyond 2025. With 8,000 miles of ocean between the Falklands and the financial dilemmas of Westminster, the value of their unique wildlife is easily overlooked."
    },
    {
        "title": "Western military chiefs set to meet to discuss 'operational phase' of Ukraine peace deal",
        "description": "Military chiefs from around the world will meet next week to discuss the \"operational phase\" of protecting Ukraine as part of a peacekeeping force, Sir Keir Starmer has announced.",
        "url": "https://news.sky.com/story/western-military-chiefs-set-to-meet-to-discuss-operational-phase-of-ukraine-peace-deal-13329053",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-keir-starmer-downing-street_6857073.jpg?20250315150044",
        "type": "Home",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-15 12:41:00",
        "Headline": "The \"coalition of the willing\" met on Saturday to discuss what should happen next with Ukraine as peace talks continue.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Military chiefs from around the world will meet next week to discuss the \"operational phase\" of protecting Ukraine as part of a peacekeeping force, Sir Keir Starmer has announced. The prime minister hosted a virtual meeting of the \"coalition of the willing\" on Saturday, which involved leaders of 26 nations, including Ukraine, plus the EU and NATO, to discuss ending the war in Ukraine. Speaking after the 90-minute meeting, Sir Keir revealed military chiefs from the group of Western nations would meet on Thursday as they move \"into an operational phase\". He said they would draw up plans to help secure Ukraine \"on the land, at sea and in the sky\" if a peace deal can be agreed with Russia. Ukraine war latest: We must be prepared to defend peace deal The day before, Ukraine President Volodymyr Zelenskyy accepted a proposal for a 30-day interim ceasefire as Russia agreed to an end to fighting, however, President Vladimir Putin said \"lots of questions\" remain over the proposals. Notably absent from Saturday's call was US President Donald Trump, but Sir Keir reiterated any peace deal requires a US backstop. \n                  The two big unknowns left up in the air after Starmer's 'coalition of the willing' Ukraine summit\n                 \n                  Starmer to host virtual meeting of 'coalition of the willing' - and demand 'concrete commitments' on Ukraine\n                 \n                  'We need to get a grip' on welfare, chancellor says - as controversial cuts widely expected\n                 He said the UK is talking to the US \"on a daily basis\" and there is a \"collective resolve\" to end the war, which has been shown by the \"momentum we're building up now\" by the many allied countries being \"on the same page\" both politically and militarily. He said Thursday's meeting of military chiefs \"is very much an operational planning meeting\". The PM added the \"coalition of the willing\" had increased in size since leaders met for the first time just under two weeks ago at Lancaster House in London. Italian Prime Minister Georgia Meloni was the most notable addition after reports she would \"shun\" the meeting because she is \"not convinced\" by the Anglo-French plan to send European peacekeepers to Ukraine. Read more:Zelenskyy says 'good chance' of ending war in Ukraine'A classic power play' - Trump's fixer made to wait eight hours to meet Putin PM dodges what rules of engagement would be Answering a question from Sky News' deputy political editor Sam Coates on what the rules of engagement would be for troops on the ground as part of a peacekeeping process, Sir Keir said the meeting will set that out. He said he has already indicated he wants the UK \"to play a leading role\" in the provision of troops and air power, while other countries will have different capabilities. But, he said a peace deal needs to be achieved first, which requires more pressure on Russia. \"If there's going to be lasting peace, there's going to have to be security arrangements,\" the PM said, noting that Putin has previously broken a peace deal with Ukraine. 'World needs action, not a study' Sir Keir also said on the call that the gathering of leaders rejected Mr Putin's \"yes, but\" approach, in reference to the Russian president saying he would agree to a ceasefire but there must be a \"study\" into how that would look. The prime minister said: \"The world needs action, not a study, not empty words and conditions. So my message is very clear. Sooner or later, Putin will have to come to the table. \"So this is the moment that the guns fall silent, that the barbaric attacks on Ukraine once and for all stop and agree to a ceasefire now.\" The PM revealed seizing Russian assets was discussed in the meeting but said it was \"a complicated question\". Political correspondent While Sir Keir Starmer's coalition of willing world leaders weren't standing literally shoulder to shoulder at this morning’s meeting, their united presence still sent a powerful message of support to the Ukrainians after another tumultuous week. It was clearly important to make a united statement of conviction that the Ukrainians are the \"party of peace\", willing to sign up to a ceasefire without conditions, and the Russians, therefore the de facto party of war, delaying a ceasefire and continuing with their \"barbaric attacks\". But what of the \"concrete commitments\" Sir Keir said he wanted to secure from the meeting?\n While the PM said new commitments had been made, he gave no specific details beyond insisting the coalition would be moving into an \"operational military planning\" phase, with a meeting of military leaders to be held in the UK.\n He had no detailed answer to Sky News' deputy political editor Sam Coates' question about what power any troops deployed as part of the coalition of the willing would actually have to police any deal, arguing he was willing for UK forces to play a leading role but that operational capabilities will be discussed on Thursday.\n Today's messages were directed at both Russia and the US. Starmer insisted Russia would be forced to the table sooner or later - by the increased military support given to the Ukrainians and through the threat of greater economic sanctions. The long-held hope of seizing frozen Russian assets was also discussed, he said.\n And as for his audience in the White House, the PM was demonstrating again that Europe and its allies have been listening to his calls to do more to shoulder the burden of defending Ukraine - and themselves.\n But his argument that no peace deal can be secure and lasting without American security guarantees is unchanged. He reiterated all this needs to be done \"in conjunction with the United States\" and said his team are in daily talks with Washington.\n For all the political power assembled online today, the absence of the US is as striking as ever. Despite that, progress continues. Zelenskyy accuses Putin of lying to everyone President Zelenskyy revealed he addressed the meeting and told them the path to peace \"must begin unconditionally\" and if Russia does not want to do that \"then strong pressure must be applied until they do\". He said the 30-day ceasefire proposal from the Americans negotiating in Saudi Arabia with the Russians has been on the table since Tuesday but accused Mr Putin of \"lying to everyone\" about the situation on the ground and about how a ceasefire is \"supposedly too complicated\". The Ukrainian leader pleaded with the West to \"define a clear position on security guarantees\" and for European nations to invest in defence so the continent has \"its arsenals and the capability to produce the most advanced weapons\", and to strengthen air defence. Mr Zelenskyy suggested another coalition of the willing meeting will be held in a week's time. Who is part of the 'coalition of the willing'? The leaders involved in Saturday's call were from: Australia, Belgium, Bulgaria, Canada, Czech Republic, Denmark, Finland, France, Germany, Greece, Iceland, Italy, Latvia, Lithuania, Luxembourg, Netherlands, New Zealand, Norway, Poland, Portugal, Romania, Spain, Sweden, Turkey, Ukraine and the UK. NATO Secretary General Mark Rutte, EU Commission President Ursula von der Leyen and EU Council President Antonio Costa also joined."
    },
    {
        "title": "Autistic teen says he was left feeling 'inhuman' after being rejected by NHS mental health services",
        "description": "Damien Dalmayne, 17, is autistic. He also battles mental health issues that have left him unable to get out of bed and contemplating harming himself.",
        "url": "https://news.sky.com/story/children-being-rejected-by-nhs-mental-health-services-if-theyre-autistic-parents-say-13322027",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-emma-damien-dalmayne_6847167.jpg?20250305150319",
        "type": "UK",
        "Author": "Becky Cotterill",
        "Date Published": "2025-03-15 00:01:00",
        "Headline": "Damien, who contemplated suicide due to his experiences, says he believes NHS services think autistic people can't engage effectively with therapy.",
        "Content": "\n          News correspondent\n              @RLCotterill\n  Damien Dalmayne, 17, is autistic. He also battles mental health issues that have left him unable to get out of bed and contemplating harming himself. Warning: This story contains references to suicide \"There were thoughts of me doing stuff to myself. I never did but there were stages where it would get pretty hard and it really did get to that point that I was really considering it,\" Damien says. His depression spiralled during the COVID lockdowns and when he was 15 he was referred to his local NHS mental health team in Greenwich. The paediatrician who made the referral recommended that Damien be seen \"urgently\". But Child and Adolescent Mental Health Services (CAMHS) rejected the referral, instead referring Damien and his family to a local social services team. Damien believes he was rejected because of his autism diagnosis. \n                  Girl, 10, cuts off 13 inches of hair to make wig for cancer patient\n                 \n                  'You start to believe you're ill': Fight to free autistic people from hospitals - as govt misses crucial target\n                 \n                  NHS cannot meet 'avalanche' of demand for autism and ADHD services, warns thinktank\n                 \"They [CAMHS] think they can't help people with special needs. They think 'that's just a terminal illness' even though it's not,\" says Damien. In its rejection letter, Greenwich CAMHS agreed Damien \"experiences emotional difficulties\". But, noting his autism diagnosis, it suggested he see the area's Children with Disabilities Team, rather than a specialist mental health service. Crucially, his mother, Emma Dalmayne, says this meant they were unable to access specialist services like therapy to help Damien. Autism and mental health 'seen as separate issues' Ms Dalmayne says a confused social worker called her after Damien's referral was redirected to their team. \"They said 'why have we been called?' I said 'I don't know'.\" \"CAMHS see autism and mental health as separate for some reason,\" says Ms Dalmayne. \"If you're not well you go to a doctor, you get help. But no, if you're mentally ill and autistic and go to a doctor, you're not getting anything. You're told 'well we can't see you because you have a neurological difference'.\" The NHS trust responsible for Greenwich CAMHS said it is unable to comment on individual cases but stressed it does accept referrals for autistic children who have a \"severe and enduring mental health need\". However, it said children may be referred to other services \"where referrals do not meet the threshold for CAMHS\". CAMHS are run by different health trusts throughout the UK. Ms Dalmayne says she has spoken to other parents with autistic children who have had similar experiences. She says she knows one mother who is scared to tell her local CAMHS that her son has been diagnosed as autistic because she worries they will stop his care. \"It's not an inclusive world. We don't feel included at all,\" says Ms Dalmayne, who is also autistic. Damien believes NHS services don't think autistic people can engage effectively with therapy. \"It's not like just talking to a wall. They [autistic children] will end up listening and if they can they will end up talking.\" He says his experience with CAMHS left him feeling \"inhuman\". Damien ended up using his disability benefits to pay for private therapy. \"If I had waited probably six months [longer to get therapy], I probably wouldn't be here. They [CAMHS] really put my health at risk,\" he says. Read more:Mum says son's mental health 'severely impacted' by pornInside 'mental health bank' helping children in 'crisis''Significant' rise in children admitted to acute hospital wards for mental health issues Oxleas NHS Foundation Trust, which administers Greenwich CAMHS, said: \"Currently, just over 16% of our CAMHS caseload includes children and young people with both an autism diagnosis and a severe and enduring mental health need. This does not include children and young people either waiting for or currently being assessed by an autism diagnostic service alongside CAMHS. \"Should individual circumstances change, re-referrals can be made. CAMHS is just one part of a much larger collection of services delivering emotional health and wellbeing support and services to children and young people.\" People with autism more likely to experience mental health issues Sky News tried to get a clearer picture of autistic children's access to CAMHS across the UK, but when we requested data from health trusts, the majority did not disclose the number of referrals and rejections for autistic children. We did learn of the serious pressure facing services nationally, with data showing total referrals to CAMHS had risen by 60% between 2018 and 2023. Rejections from CAMHS were up by 30% across the same period. While it's difficult to get a sense of the number of autistic children accessing CAMHS, autistic people are more likely to experience mental health problems than people who aren't autistic. Sky News spoke to one CAMHS nurse anonymously - we aren't identifying the health trust she works for. She said nationally it's a mixed picture in terms of the level of care autistic children receive. \"We [CAMHS] certainly don't do enough for children that have been diagnosed with autism in terms of their post-diagnostic support.\" She says she has witnessed preconceptions about autism among staff that can lead to autistic children not getting the care they need. Skills 'aren't consistent' across health service \"Some people [working in CAMHS], sometimes might tend to say 'well it's [their issues are] because of their autism' as opposed to thinking well actually they might be autistic but they can also have a mental health difficulty that can be supported,\" says the nurse. \"A child that has autism and mental health needs, that's not going to be solved by social services, they need mental health support.\" She says skills aren't \"consistent\" across the health service and that autistic children can be at a disadvantage if their behaviour means more traditional forms of talking therapy aren't appropriate. The nurse continues: \"I've known it happen where people say 'oh this person is not engaging' so they get discharged. \"Sometimes therapy is not always helpful, then it's about different, more holistic ways to support children and support behavioural changes. \"I do think there's a need to increase skills within CAMHS absolutely. [Staff] recruitment and retention has been difficult across the board.\" Ms Dalmayne is campaigning for better access to CAMHS for autistic children, her biggest fear is that autistic children and adults are hurting, and even killing themselves, if they can't access mental health support. \"It makes me feel we've got to do everything we can to change it,\" she says. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "The two big unknowns left up in the air after Starmer's 'coalition of the willing' Ukraine summit",
        "description": "There was one clear, united message from today's virtual meeting of leaders - that they rejected Vladimir Putin's \"yes, but\" approach to a ceasefire.",
        "url": "https://news.sky.com/story/the-two-big-unknowns-left-up-in-the-air-after-starmers-coalition-of-the-willing-ukraine-summit-13329413",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-keir-starmer-downing-street_6856351.jpg?20250314154910",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-03-15 16:41:00",
        "Headline": "Leaders want Russia to mirror Ukraine's ceasefire pledge - but don't trust Vladimir Putin to uphold promises on peace.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  There was one clear, united message from today's virtual meeting of leaders - that they rejected Vladimir Putin's \"yes, but\" approach to a ceasefire. The \"coalition of the willing\" - the 27 leaders, plus NATO and the EU led by Sir Keir Starmer and Emmanuel Macron - want the Russian president to mirror Ukraine's pledge for a 30-day pause in fighting, in order to hammer out a sustainable peace deal. Sir Keir made that very clear, and suggested the attendees at the meeting were behind this approach. Ukraine war latest: Putin's ceasefire conditions 'not good enough'  The prime minister said: \"Volodymyr [Zelenskyy] has committed to a 30-day unconditional ceasefire, but Mr Putin is trying to delay, saying there must be a painstaking study before a ceasefire can take place. \"Well, the world needs action, not a study, not empty words and conditions. So my message is very clear. Sooner or later, Putin will have to come to the table.\" There are two reasons for this challenge - an immediate end to fighting is a goal in itself, but many of those in today's call, including Sir Keir, do not trust Mr Putin to uphold promises on peace and are trying to convince US President Donald Trump to be more clear-eyed about the Russian approach. Challenging the Russian leader to follow the US request for a ceasefire and watching him refuse is designed to send a message to the White House as well as the Kremlin. There were, however, bigger unknowns left hanging. Read more from Sky News:Russian captain of North Sea crash ship appears in courtAt least 17 dead in US storms One of which was the clear signal from Sir Keir that he is still relying on a US security guarantee in order to bring on board a \"coalition of the willing\" who might be able to provide troops to Ukraine. There are, however, many that don't think that that US security guarantee is coming in any substantial way, based on the noises coming out of the US. That is a big problem for the PM, as government sources tell me that the scope and the remit of any potential peacekeeping force is determined by what protection the US might be able to provide. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 The second issue that is being sidestepped by Sir Keir is what any peace keeping might be able to do in practice. UK troops, like those of any NATO country, cannot engage directly with Russia in combat for fear of triggering a much bigger conflagration. So if not that, then what is their purpose - a question repeatedly asked by experts like the former national security adviser Lord Ricketts. I put exactly this to the PM, but did not get an answer. He suggested that we were a long way away from getting an an answer, even though military chiefs also appear to be meeting to \"operationalise\" plans on Thursday. How can they operationalise a plan that does not, and currently cannot, have a remit? Today Sir Keir heralded the participation of Canada, Australia and New Zealand on the call, as part of the effort. But if the remit of the coalition of the willing isn't clear, how can it truly be effective?"
    },
    {
        "title": "Russian captain of ship in North Sea crash appears in court",
        "description": "The Russian captain of a ship involved in the North Sea crash has appeared in court.",
        "url": "https://news.sky.com/story/russian-captain-of-ship-in-north-sea-crash-appears-in-court-13328993",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-solong-container-ship_6853935.jpg?20250312092801",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-15 10:08:00",
        "Headline": "On Monday, the US oil tanker the Stena Immaculate and the Portuguese-flagged Solong collided in the North Sea off the coast of Yorkshire. One crew member remains missing and is thought to have died - a Filipino national named as Mark Angelo Pernia.",
        "Content": "The Russian captain of a ship involved in the North Sea crash has appeared in court. Vladimir Motin, of Primorsky, St Petersburg, was remanded into custody after appearing at Hull Magistrates' Court on Saturday. The 59-year-old has been charged with gross negligence manslaughter. In a glass-front dock for the 35-minute long hearing, Motin heard how the Solong collided with the stationary US-flagged oil tanker, the Stena Immaculate, on Monday, off the coast of Yorkshire. There was no application made for bail and no pleas were entered. Motin, with the help of a translator, only spoke to confirm his name, date of birth and that he did not have an address in the UK. He will appear at the Old Bailey on 14 April. One member of the Solong crew is lost at sea, thought to be dead. He has been named by the Crown Prosecution Service as 38-year-old Filipino national Mark Angelo Pernia. After the collision, there was an explosion on the forward deck of the Solong, where Mr Pernia was working. His fellow crew members tried to find him before evacuating, but were not able to do so. The crash took place about 13 miles off the Yorkshire coast and saw dozens of people forced to abandon the vessels as they caught fire. A large search and rescue operation was launched and successfully brought 36 people from both ships back ashore. The Portuguese-flagged Solong had been sailing from Grangemouth, in Scotland, to Rotterdam, in the Netherlands, at the time of the collision. It was initially feared to be carrying sodium cyanide, but the German owner Ernst Russ said four containers on the vessel had previously been carrying the chemical. Read more from Sky News:Five charged over mum's fatal shootingAt least five dead after road collapsesTrump's fixer waited eight hours to meet Putin The Stena Immaculate is still at anchor at the same point where the collision happened. Meanwhile, the Solong drifted south of this location, but both vessels were said to be \"stable\", with salvors having boarded to assess the damage. The Stena Immaculate had been carrying 220,000 barrels of jet fuel in 16 segregated tanks - at least one of which was \"ruptured\" during the collision, US shipping firm Crowley, who operates the ship, said. But it said the jet fuel spill was having a \"limited\" impact. Most of it had burned off, and there were no signs of further leaks from either ship. Investigations are still ongoing, currently led by the Marine Accident Investigations Branch, to establish the cause of the collision. The coastguard is also continuing to monitor the ships in case they release more pollution."
    },
    {
        "title": "France win Six Nations with victory over Scotland in Paris",
        "description": "France have won the Six Nations after beating Scotland 35-16 in Paris.",
        "url": "https://news.sky.com/story/france-win-six-nations-with-victory-over-scotland-in-paris-13329671",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-six-nations-france_6858018.jpg?20250315222015",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-15 18:19:00",
        "Headline": "England finished second after thrashing Wales, while last year's champions Ireland ended up in third place.",
        "Content": "France have won the Six Nations after beating Scotland 35-16 in Paris. England pushed the championship battle to the final game after earlier destroying Wales with a record 68-14 win in Cardiff. But Les Bleus sealed victory in front of a home crowd in a packed Stade de France to lift their first title since 2022 and only their second since 2010. Scotland briefly threatened to spoil the party and were unlucky to go into halftime 16-13 behind after a Tom Jordan try was disallowed.  The match remained tight until France threw on their forward replacements and Scotland's defence tired under the onslaught. Yoram Moefana grabbed the bonus-point securing fourth try and the celebrations in Paris began. France had bounced back emphatically from their defeat away to England on matchday two to crush Ireland and Italy and put themselves in pole position entering the final day. The hosts only needed a win against Scotland, with both England and Ireland also in with a chance, but only if other results went their way. Read more from Sky News:Meet the penguins of the FalklandsAt least 17 dead in US storms Last year's champions Ireland kept their hopes of retaining the title alive with an unconvincing 22-17 bonus-point win over Italy in the early game in Rome. A week on from having their Grand Slam dream crushed by a 42-27 drubbing in Dublin at the hands of France, Ireland moved top of the table ahead of the other matches. But they needed both of their championship rivals to slip up, and England's 10-try demolition of Wales pushed Ireland back into second place, while France's win meant they finished the competition in third. The Prince of Wales, who is the patron of the Welsh Rugby Union and his wife the Princess of Wales, the patron of the Rugby Football Union, cheered on opposing sides from the stands. England's emphatic bonus-point victory still left them relying on Scotland to beat the favourites to finish in the top spot. Winless Wales were condemned to a second successive wooden spoon and 17th Test defeat on the bounce - a record for a tier one nation in the professional era."
    },
    {
        "title": "Rats and other rodents posing 'huge' public health risk amid Birmingham bin strikes",
        "description": "Rats and other rodents are posing a \"huge\" public health risk amid the ongoing bin strikes in Birmingham, a pest control expert has warned.",
        "url": "https://news.sky.com/story/rats-and-other-rodents-posing-huge-public-health-risk-amid-birmingham-bin-strikes-13328936",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-birmingham-refuse-collection_6853181.jpg?20250311151227",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-15 06:36:00",
        "Headline": "Waste workers in Birmingham went on strike on Tuesday in a row over jobs and pay. Unite warned disruption could last into the summer and the city council countered saying it had made a \"fair and reasonable offer\".",
        "Content": "Rats and other rodents are posing a \"huge\" public health risk amid the ongoing bin strikes in Birmingham, a pest control expert has warned. The rodents are said to be flourishing on the \"banquet\" of rotting food left out for them. On Tuesday, nearly 400 council bin workers in the Midlands city began indefinite strike action as part of a row over jobs and pay. Unite, the union, said the city council could end the dispute \"by agreeing to pay a decent rate of pay\". Birmingham City Council said it had made a \"fair and reasonable offer\" to the workers and claimed the \"escalation\" of industrial action would mean greater disruption for residents. Grahame Turner, technical manager at the National Pest Technicians Association (NPTA), said: \"This is a huge public health danger, and what we're seeing in Birmingham is incredibly concerning. \"Pests like rats, mice and even squirrels are on the lookout for easy meals at this time of year, and easily accessible waste is an open invitation. \n                  Birmingham bin strike sees rubbish piled on streets as workers walk off job indefinitely\n                 \n                  Driver killed 'showboating' e-bike rider to 'teach him a lesson'\n                 \n                  Boy, 12, stabbed to death in Birmingham named - after 14-year-old arrested on suspicion of murder\n                 \"Rotting food is an absolute banquet to them, and Birmingham is already extremely vulnerable due to previous strikes and infestation levels of rodents that are observed within urban areas.\" He went on that once rodents find overflowing bins, they may explore other parts of the location too, such as nearby houses, seeking warmth and shelter. \"Rodents aren't just a nuisance - they can pose serious health risks to you and your family. Rats and mice are known to carry diseases such as leptospirosis, hantavirus, and salmonella, which can spread through their droppings, urine, and even by contaminating food supplies,\" he added. Alongside that, they can cause \"serious structural damage\" by chewing through electrical wiring, insulation and even causing damage to plumbing. In light of the strikes, Mr Turner said if residents could take any actions to minimise encouraging rodents, they should. This could take the form of storing uncollected rubbish in sealed boxes or bins, or transporting the waste themselves to a local recycling centre or tip. Disruption could run into the summer Unite has warned that disruption to waste collection could run into the summer after workers voted in favour of extending their strike due to the council's use of temporary labour to \"undermine\" the industrial action. The union warned its members face pay cuts after the scrapping of waste collection and recycling officer roles, despite them already having accepted voluntary cuts after the council declared bankruptcy. Earlier this week, the council said 90 waste collection crews out of a total of 200 were still out collecting rubbish. Read more from Sky News:Meet the penguins of the FalklandsChance of ending war quickly, says ZelenskyyUS influencer snatched baby wombat It asked residents to continue to put waste out as usual and said staff affected in the removal of the two roles had been given the opportunity to move to alternative roles, take voluntary redundancy or train as drivers."
    },
    {
        "title": "Western military chiefs set to meet to discuss 'operational phase' of Ukraine peace deal",
        "description": "Military chiefs from around the world will meet next week to discuss the \"operational phase\" of protecting Ukraine as part of a peacekeeping force, Sir Keir Starmer has announced.",
        "url": "https://news.sky.com/story/western-military-chiefs-set-to-meet-to-discuss-operational-phase-of-ukraine-peace-deal-13329053",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-keir-starmer-downing-street_6857073.jpg?20250315150044",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-15 12:41:00",
        "Headline": "The \"coalition of the willing\" met on Saturday to discuss what should happen next with Ukraine as peace talks continue.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Military chiefs from around the world will meet next week to discuss the \"operational phase\" of protecting Ukraine as part of a peacekeeping force, Sir Keir Starmer has announced. The prime minister hosted a virtual meeting of the \"coalition of the willing\" on Saturday, which involved leaders of 26 nations, including Ukraine, plus the EU and NATO, to discuss ending the war in Ukraine. Speaking after the 90-minute meeting, Sir Keir revealed military chiefs from the group of Western nations would meet on Thursday as they move \"into an operational phase\". He said they would draw up plans to help secure Ukraine \"on the land, at sea and in the sky\" if a peace deal can be agreed with Russia. Ukraine war latest: We must be prepared to defend peace deal The day before, Ukraine President Volodymyr Zelenskyy accepted a proposal for a 30-day interim ceasefire as Russia agreed to an end to fighting, however, President Vladimir Putin said \"lots of questions\" remain over the proposals. Notably absent from Saturday's call was US President Donald Trump, but Sir Keir reiterated any peace deal requires a US backstop. \n                  The two big unknowns left up in the air after Starmer's 'coalition of the willing' Ukraine summit\n                 \n                  Starmer to host virtual meeting of 'coalition of the willing' - and demand 'concrete commitments' on Ukraine\n                 \n                  'We need to get a grip' on welfare, chancellor says - as controversial cuts widely expected\n                 He said the UK is talking to the US \"on a daily basis\" and there is a \"collective resolve\" to end the war, which has been shown by the \"momentum we're building up now\" by the many allied countries being \"on the same page\" both politically and militarily. He said Thursday's meeting of military chiefs \"is very much an operational planning meeting\". The PM added the \"coalition of the willing\" had increased in size since leaders met for the first time just under two weeks ago at Lancaster House in London. Italian Prime Minister Georgia Meloni was the most notable addition after reports she would \"shun\" the meeting because she is \"not convinced\" by the Anglo-French plan to send European peacekeepers to Ukraine. Read more:Zelenskyy says 'good chance' of ending war in Ukraine'A classic power play' - Trump's fixer made to wait eight hours to meet Putin PM dodges what rules of engagement would be Answering a question from Sky News' deputy political editor Sam Coates on what the rules of engagement would be for troops on the ground as part of a peacekeeping process, Sir Keir said the meeting will set that out. He said he has already indicated he wants the UK \"to play a leading role\" in the provision of troops and air power, while other countries will have different capabilities. But, he said a peace deal needs to be achieved first, which requires more pressure on Russia. \"If there's going to be lasting peace, there's going to have to be security arrangements,\" the PM said, noting that Putin has previously broken a peace deal with Ukraine. 'World needs action, not a study' Sir Keir also said on the call that the gathering of leaders rejected Mr Putin's \"yes, but\" approach, in reference to the Russian president saying he would agree to a ceasefire but there must be a \"study\" into how that would look. The prime minister said: \"The world needs action, not a study, not empty words and conditions. So my message is very clear. Sooner or later, Putin will have to come to the table. \"So this is the moment that the guns fall silent, that the barbaric attacks on Ukraine once and for all stop and agree to a ceasefire now.\" The PM revealed seizing Russian assets was discussed in the meeting but said it was \"a complicated question\". Political correspondent While Sir Keir Starmer's coalition of willing world leaders weren't standing literally shoulder to shoulder at this morning’s meeting, their united presence still sent a powerful message of support to the Ukrainians after another tumultuous week. It was clearly important to make a united statement of conviction that the Ukrainians are the \"party of peace\", willing to sign up to a ceasefire without conditions, and the Russians, therefore the de facto party of war, delaying a ceasefire and continuing with their \"barbaric attacks\". But what of the \"concrete commitments\" Sir Keir said he wanted to secure from the meeting?\n While the PM said new commitments had been made, he gave no specific details beyond insisting the coalition would be moving into an \"operational military planning\" phase, with a meeting of military leaders to be held in the UK.\n He had no detailed answer to Sky News' deputy political editor Sam Coates' question about what power any troops deployed as part of the coalition of the willing would actually have to police any deal, arguing he was willing for UK forces to play a leading role but that operational capabilities will be discussed on Thursday.\n Today's messages were directed at both Russia and the US. Starmer insisted Russia would be forced to the table sooner or later - by the increased military support given to the Ukrainians and through the threat of greater economic sanctions. The long-held hope of seizing frozen Russian assets was also discussed, he said.\n And as for his audience in the White House, the PM was demonstrating again that Europe and its allies have been listening to his calls to do more to shoulder the burden of defending Ukraine - and themselves.\n But his argument that no peace deal can be secure and lasting without American security guarantees is unchanged. He reiterated all this needs to be done \"in conjunction with the United States\" and said his team are in daily talks with Washington.\n For all the political power assembled online today, the absence of the US is as striking as ever. Despite that, progress continues. Zelenskyy accuses Putin of lying to everyone President Zelenskyy revealed he addressed the meeting and told them the path to peace \"must begin unconditionally\" and if Russia does not want to do that \"then strong pressure must be applied until they do\". He said the 30-day ceasefire proposal from the Americans negotiating in Saudi Arabia with the Russians has been on the table since Tuesday but accused Mr Putin of \"lying to everyone\" about the situation on the ground and about how a ceasefire is \"supposedly too complicated\". The Ukrainian leader pleaded with the West to \"define a clear position on security guarantees\" and for European nations to invest in defence so the continent has \"its arsenals and the capability to produce the most advanced weapons\", and to strengthen air defence. Mr Zelenskyy suggested another coalition of the willing meeting will be held in a week's time. Who is part of the 'coalition of the willing'? The leaders involved in Saturday's call were from: Australia, Belgium, Bulgaria, Canada, Czech Republic, Denmark, Finland, France, Germany, Greece, Iceland, Italy, Latvia, Lithuania, Luxembourg, Netherlands, New Zealand, Norway, Poland, Portugal, Romania, Spain, Sweden, Turkey, Ukraine and the UK. NATO Secretary General Mark Rutte, EU Commission President Ursula von der Leyen and EU Council President Antonio Costa also joined."
    },
    {
        "title": "Five people in court and another arrested over woman's fatal shooting",
        "description": "Five people have appeared in court and another has been arrested in connection with the fatal shooting of Joanne Penney in South Wales.",
        "url": "https://news.sky.com/story/five-people-charged-and-another-arrested-over-womans-fatal-shooting-13328987",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-south-wales-police_6856032.jpg?20250314102322",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-15 09:25:00",
        "Headline": "Joanne Penney, 40, died after being shot on 9 March in Llys Illtyd, Talbot Green.",
        "Content": "Five people have appeared in court and another has been arrested in connection with the fatal shooting of Joanne Penney in South Wales. Ms Penney, 40, died after being shot in the chest on 9 March in Llys Illtyd, Talbot Green. Five people, two women and three men, have now been charged in connection with her death and appeared before Cardiff Magistrates' Court on Saturday. They are: Marcus Huntley, 20, of Cardiff, charged with murder; Joshua Gordon, 27, of Leicestershire, charged with murder; Tony Porter, 68, of Leicestershire, charged with murder and participating in the criminal activities of an organised crime group; Melissa Quailey-Dashper, 39, of Leicester, charged with murder; and Kristina Ginova, 21, of Leicestershire, charged with assisting an offender. They were remanded into custody to appear at Cardiff Crown Court on 18 March. Detectives also arrested a 32-year-old man in Suffolk on Friday evening, South Wales police said. His was the seventh arrest - including the five charged - and a 42-year-old local man who was arrested on the day of the shooting but later released without charge. \n                  'It felt like my own personal October the 7th': Gang jailed for kidnapping Jewish-Israeli music producer\n                 \n                  Joanne Penney: Family pay tribute to South Wales mother shot dead in possible case of mistaken identity\n                 \n                  UK's longest ski slope set to be built in Merthyr Tydfil\n                 Read more from Sky NewsGang jailed for kidnapping music producerJohn Hunt returns to commentating after family's murderDelivery driver's murderer jailed for 30 years Detective Chief Superintendent Ceri Hughes said: \"Our team of detectives and specialist staff are continuing to piece together the circumstances behind Joanne's tragic death and I would still urge anyone who has information, either about her death or what happened at the property in Llys Illtyd on Sunday evening, to come forward - the smallest piece of information could be of vital importance. \"I would like to thank the local community for their support of the investigation so far and to everyone who has spoken to us and provided information.\" Paying tribute to her, Ms Penney's family said they were \"devastated by the tragic loss of our beloved Joanne\". \"She was a daughter, mother, sister, and niece - loved deeply by all who knew her,\" they said. \"Her kindness, strength, and love for her family will never be forgotten.\" The family asked for privacy as they \"begin to process this unimaginable loss\" and said they \"appreciate the support and condolences from the community\"."
    },
    {
        "title": "Donald Trump launches strikes against Yemen's Houthis over Red Sea ship attacks",
        "description": "US President Donald Trump has launched strikes against the Houthis in Yemen. ",
        "url": "https://news.sky.com/story/donald-trump-launches-strikes-against-yemens-houthis-13329695",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-yemen-houthis_6857893.jpg?20250315192111",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-15 18:44:00",
        "Headline": "At least nine civilians have been killed, according to the health ministry run by the Iran-backed group. ",
        "Content": "US President Donald Trump has launched strikes against the Houthis in Yemen.  In a post on his Truth Social platform, he also warned Iran the country's support for the group must \"end immediately\". The Iran-backed Houthis reported a series of explosions in Yemen's capital Sanaa on Saturday evening.   The Houthi-run health ministry said in a post on X that at least nine civilians have been killed and nine others injured. Images shared online show plumes of black smoke over the area of the city's airport complex, which includes a sprawling military facility. Mr Trump said the strikes were over the group's attacks against ships in the Red Sea. \"Your time is up, and your attacks must stop, starting today. If they don't, hell will rain down upon you like nothing you have ever seen before,\" he said. The president said Iran would be held \"fully accountable\" for the actions of its proxy, adding: \"And we won't be nice about it!\" The strikes come days after the Houthis said they would resume attacks on Israeli vessels sailing in waters off Yemen in response to Israel's blockade on Gaza, although there have been no Houthi attacks reported since then. Earlier this month, Israel halted all aid coming into Gaza and warned of \"additional consequences\" for Hamas if their fragile ceasefire is not extended as negotiations continue over starting a second phase. \"The Houthi attack on American vessels will not be tolerated. We will use overwhelming lethal force until we have achieved our objective,\" Mr Trump wrote. \"These relentless assaults have cost the US and World Economy many BILLIONS of Dollars while, at the same time, putting innocent lives at risk.\" The Houthis launched more than 100 attacks targeting shipping from November 2023, saying they were in solidarity with Palestinians over Israel's war with Hamas in Gaza. The US, Israel and Britain have previously hit Houthi-held areas in Yemen. According to a US official, the operation - the first strike on the Houthis under the second Trump administration - was conducted solely by the US. Read more from Sky News:At least 17 dead in US stormsUS expels South African ambassador The Houthi media office said the strikes hit \"a residential neighbourhood\" in Sanaa's northern district of Shouab. Sanaa residents said at least four airstrikes hit the Eastern Geraf neighbourhood in the district, terrifying women and children in the area. \"The explosions were very strong,\" said Abdallah al Alffi. \"It was like an earthquake.\" Similar missile strikes against the Houthis were done multiple times by Joe Biden's administration in response to frequent attacks by the Houthis against commercial and military vessels in the region."
    },
    {
        "title": "At least 26 killed as tornadoes and dust storms rip through parts of US",
        "description": "At least 26 people are reported to have died in powerful storms across the United States.",
        "url": "https://news.sky.com/story/at-least-26-killed-as-tornadoes-and-dust-storms-rip-through-parts-of-us-13329033",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-missouri-storm-bridgeton_6858082.jpg?20250316004528",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-15 12:07:00",
        "Headline": "Missouri recorded 12 fatalities, with deaths also recorded in Arkansas and Texas after tornadoes ripped apart homes and brought down trees. The massive weather system has also produced deadly dust storms, wildfires and hail the size of baseballs.",
        "Content": "At least 26 people are reported to have died in powerful storms across the United States. The number of fatalities increased after eight people died in a highway pile-up caused by a dust storm in Sherman County, Kansas on Friday. At least 50 vehicles were involved. Car crashes during a dust storm also killed three people in Amarillo, Texas. Authorities in Missouri say 12 people died after tornadoes struck the state, with another three deaths reported in Arkansas. Around 108 million people remain under widespread wind, flash flooding and wildfire alerts in central and southern US states. Hundreds of thousands of households are also without power. Tornado warnings are in place in parts of Illinois, Missouri, Arkansas, Mississippi, Indiana, and Kentucky as a massive storm system moves across the country. Many areas across southern states are, or will soon be, dealing with widespread flash flooding, the National Weather Service warned. It added that the flooding could turn deadly. In Butler County, Missouri, on the border with Arkansas, local coroner Jim Akers said the man and his wife were sleeping when the tornado struck. Rescuers were able to pull the woman from the debris - but could not save the man whose mobile home was ripped apart. \"It was unrecognisable as a home. Just a debris field,\" he said, describing the scene. \"The floor was upside down. We were walking on walls.\" Large vehicles were also pictured overturned across the state. Arkansas governor Sarah Huckabee Sanders warned the recovery could take months after surveying damage from an EF3 tornado in Cave City, in the north of the state. A storm ranked as EF3, on a scale of one to five, requires wind speeds of between 136-165mph (218-265kph). Hail the size of baseballs \"It's hard to look at this level of devastation and not be heartbroken,\" she said. \"It's a whole other world when you see it up close and personal.\" Winds gusting up to 80mph (130kph) were predicted from the Canadian border to Texas, threatening blizzard conditions in colder northern areas and wildfire risk in warmer, drier places to the south. Hail was also a hazard, some the size of baseballs were reported in Christian County, the US weather service said. Fatal pile-ups during dust storms In the Texas city of Amarillo, three people were killed in car crashes caused by a dust storm on Friday, according to the state's public safety department. One of the deaths happened after three lorries collided with four other vehicles in Palmer County, Bovina's fire chief Cesar Marquez said. Another occurred after a pile-up of an estimated 38 cars. \"It's the worst I've ever seen,\" public safety department sergeant Cindy Barkley said, calling the near-zero visibility a nightmare. \"We couldn't tell that they were all together until the dust kind of settled.\" Evacuations were ordered in some Oklahoma communities as more than 130 fires were reported across the state. Nearly 300 homes were damaged or destroyed, said governor Kevin Stitt. Read more from Sky News:Trump launches strikes against HouthisUS expels SA ambassadorThe big unknowns after Starmer's summit Three deaths happened due to storm damage in Independence County, Arkansas on Friday night, with a further 29 people injured across eight different counties, authorities said. More than 260,000 households are without power in midwestern and southern states, according to the monitoring website PowerOutage.us. The Storm Prediction Center at the National Weather Service issued an update on Sunday, warning of a moderate risk of severe thunderstorms. The warning covers an area from the extreme southeastern part of Mississippi, across much of Alabama, into western Georgia and the western Florida panhandle."
    },
    {
        "title": "Nine Palestinians killed, including three journalists, in Israeli airstrike, Gaza health ministry says",
        "description": "An Israeli airstrike in Gaza has killed at least nine Palestinians, including three local journalists, the territory's health ministry has said.",
        "url": "https://news.sky.com/story/nine-palestinians-killed-including-three-journalists-in-israeli-airstrike-gaza-health-ministry-says-13329524",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-palestinians-israeli_6857665.jpg?20250315174621",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-15 17:14:00",
        "Headline": "An NGO says six volunteers were \"deliberately targeted\" and killed while on their way to deliver aid. The Israeli military says it struck two individuals who it identified as \"terrorists\" and later struck several other suspects.",
        "Content": "An Israeli airstrike in Gaza has killed at least nine Palestinians, including three local journalists, the territory's health ministry has said. The strike hit a car, with casualties inside and outside the vehicle, and several people were critically injured, according to officials in the Gaza Strip. Six volunteers from the Al Khair Foundation were \"deliberately targeted\" and killed while on their way to deliver aid in the northern town of Beit Lahia, said the UK-based international non-governmental organisation (NGO). Among the six were the three journalists - Mahmoud al Sarraj, Mahmoud Isleem, and Bilal Abu Matar - who were recording humanitarian relief efforts for those affected by the war in Gaza, the foundation said.  The other three victims have been named as Bilal Akeela, Mohammad al Ghafir, and Hazem Gharib. The foundation said: \"The first strike injured one team member, prompting them to move away, but a drone followed them and struck their vehicle directly with a second strike, killing them all.\" What has Israel's military said? In a statement, the Israeli military said it had struck two individuals who it identified as \"terrorists\" operating a drone that it said posed a threat to forces in Beit Lahiya. The military later struck several other suspects who it said had collected the drone equipment and entered a vehicle. The military did not say how it had established that the individuals it had struck were \"terrorists\" or provide details about the threat that the drone had posed to its troops. Gaza official denies army's claims  Salama Marouf, the head of the Hamas-run Gaza government media office, denied the Israeli army's allegations. \"The team was made of civilians and worked in an area near a shelter on a mission sponsored by a charity. They didn't exist in a prohibited area and didn't pose any danger of any kind to the occupation army,\" Marouf said in a statement.  Saturday's incident underscores the fragility of the 19 January ceasefire agreement that halted large-scale fighting in the Gaza Strip. Palestinian health officials say dozens of people have been killed by Israeli fire despite the truce. The airstrike coincided with a visit to Egypt's capital Cairo by Hamas's exiled Gaza chief, Khalil al Hayya, for further truce talks aimed at resolving disputes with Israel. Read more:Israel accused of 'genocidal acts' against Palestinians in UN reportPalestinian officials say Israel kills eight in Gaza and five in West Bank The militant group has accused Israel of attempting to renege on the ceasefire agreement, putting the number of Palestinians killed since 19 January, it says, at 150. Hamas urged mediators to compel Israel to move ahead with the implementation of the phased ceasefire deal, blaming Israel's Prime Minister Benjamin Netanyahu for the current impasse. What next for ceasefire deal? The temporary first phase, where Hamas released dozens of Israeli hostages in return for around 1,500 Palestinian prisoners being freed from Israeli jails, expired on 2 March. But Israel says it wants to extend the first phase, a proposal backed by US envoy Steve Witkoff. Hamas says it will only resume freeing hostages under the second phase. Israel has rejected opening the second phase of talks, which would require it to negotiate over a permanent end to the war, which is Hamas's main demand. The war began when Hamas militants carried out a cross-border raid into southern Israel on 7 October 2023, killing 1,200 people and capturing around 250 hostages, according to Israeli officials. Israel responded by launching an air and ground offensive in Gaza which has killed more than 48,000 Palestinians, say Gaza health officials. The Gaza health ministry does not distinguish between civilians and combatants in its count but said more than half of the fatalities were women and children."
    },
    {
        "title": "US expels South African ambassador for being 'race-baiting politician'",
        "description": "The United States has expelled South Africa's ambassador for being a \"race-baiting politician who hates America\".",
        "url": "https://news.sky.com/story/us-expels-south-african-ambassador-for-being-race-baiting-politician-13328948",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-ebrahim-rasool-south-africa_6856924.jpg?20250315075042",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-15 07:22:00",
        "Headline": "Relations between the US and South Africa have been strained since Donald Trump re-entered the White House in January.",
        "Content": "The United States has expelled South Africa's ambassador for being a \"race-baiting politician who hates America\". Secretary of state Marco Rubio posted on X late on Friday to say Ebrahim Rasool is \"no longer welcome in our great country\" because he \"hates America and @POTUS [President of the United States]\". \"We have nothing to discuss with him and so he is considered PERSONA NON GRATA,\" Mr Rubio said. Relations between the US and South Africa have been strained since Donald Trump re-entered the White House in January. The second-time president cut the country's financial aid and has criticised both its land policy, aimed at evening out racial disparities, and its genocide case against Israel at the International Criminal Court (ICC). Mr Trump, without any supporting evidence, has claimed \"South Africa is confiscating land\" and that \"certain classes of people\" are being treated \"very badly\" there. Elon Musk, his close ally and head of newly created Department of Government Efficiency (DOGE), has said white South Africans have fallen victim to \"racist ownership laws\". The new legislation, passed in January, makes it easier for the government to expropriate land in the public interest. The expulsion comes after Mr Rasool addressed a webinar in which he said Mr Trump is leading a \"white supremacist\" movement in America. Mr Rubio posted a news report on the webinar alongside his announcement. Read more from Sky NewsUK city hit by bin strikeGang jailed for kidnapping music producerInfluencer snatches baby wombat US-South Africa relations at 'lowest point' Mr Rasool began his second post as US ambassador in January, having served in Washington previously between 2010 and 2015. The office for South Africa's president Cyril Ramaphosa described the US decision as \"regrettable\", adding that it remains committed to a \"mutually beneficial relationship with the country\". Mr Rasool has been excluded from meetings with key State Department officials - and members of Mr Trump's administration, according to news website Semafor. His pro-Palestinian views and criticism of Israel appear to have been the reason, the website claimed, citing an anonymous South African diplomat. Former US ambassador to South Africa Patrick Gaspard told Reuters that ties between the two nations have reached their \"lowest point\". \"There's too much at stake to not work towards the repair of this partnership,\" he said."
    },
    {
        "title": "France win Six Nations with victory over Scotland in Paris",
        "description": "France have won the Six Nations after beating Scotland 35-16 in Paris.",
        "url": "https://news.sky.com/story/france-win-six-nations-with-victory-over-scotland-in-paris-13329671",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-six-nations-france_6858018.jpg?20250315222015",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-15 18:19:00",
        "Headline": "England finished second after thrashing Wales, while last year's champions Ireland ended up in third place.",
        "Content": "France have won the Six Nations after beating Scotland 35-16 in Paris. England pushed the championship battle to the final game after earlier destroying Wales with a record 68-14 win in Cardiff. But Les Bleus sealed victory in front of a home crowd in a packed Stade de France to lift their first title since 2022 and only their second since 2010. Scotland briefly threatened to spoil the party and were unlucky to go into halftime 16-13 behind after a Tom Jordan try was disallowed.  The match remained tight until France threw on their forward replacements and Scotland's defence tired under the onslaught. Yoram Moefana grabbed the bonus-point securing fourth try and the celebrations in Paris began. France had bounced back emphatically from their defeat away to England on matchday two to crush Ireland and Italy and put themselves in pole position entering the final day. The hosts only needed a win against Scotland, with both England and Ireland also in with a chance, but only if other results went their way. Read more from Sky News:Meet the penguins of the FalklandsAt least 17 dead in US storms Last year's champions Ireland kept their hopes of retaining the title alive with an unconvincing 22-17 bonus-point win over Italy in the early game in Rome. A week on from having their Grand Slam dream crushed by a 42-27 drubbing in Dublin at the hands of France, Ireland moved top of the table ahead of the other matches. But they needed both of their championship rivals to slip up, and England's 10-try demolition of Wales pushed Ireland back into second place, while France's win meant they finished the competition in third. The Prince of Wales, who is the patron of the Welsh Rugby Union and his wife the Princess of Wales, the patron of the Rugby Football Union, cheered on opposing sides from the stands. England's emphatic bonus-point victory still left them relying on Scotland to beat the favourites to finish in the top spot. Winless Wales were condemned to a second successive wooden spoon and 17th Test defeat on the bounce - a record for a tier one nation in the professional era."
    },
    {
        "title": "An abundance of marine life - but the wildlife of the Falkland Islands is more vulnerable than most",
        "description": "You can hear them before you see them. And smell them.",
        "url": "https://news.sky.com/story/why-wildlife-in-the-falkland-islands-is-more-vulnerable-than-most-13328568",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-penguins-clarke_6856330.png?20250314153234",
        "type": "World",
        "Author": "Tom Clarke",
        "Date Published": "2025-03-15 00:01:00",
        "Headline": "Conservation and research here is almost entirely reliant on grant funding from the UK government through a scheme for British Overseas Territories called Darwin Plus.\nBut the future of the scheme is in doubt as budgets for overseas development and conservation are threatened.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  You can hear them before you see them. And smell them. At this time of year - the South Atlantic summer - the penguins of the Falkland Islands mob together in rookeries on these isolated beaches to raise their fluffy chicks. And we're surrounded by them. The beach at Volunteer Point on the northeast tip of the Falklands is home to its largest colony of king penguins. Up to a metre tall, they stand squabbling in a defensive huddle around their chicks. But there are others too, burrowing magellanic penguins and red-billed, yellow-footed gentoo. Across the 740 islands that make up the Falklands there are five different species and around a million of them in total. \n                  What we learnt flying over the world's largest iceberg A23a - and why it's not long for this world\n                 \n                  Trump government attempts to rip up 31 environmental protections and reviews damage of greenhouse gases\n                 \n                  The furious rise of climate whiplash\n                 To prevent disturbance, and the spread of bird flu, visitors are asked to keep six metres from the birds. But the rule doesn't apply in reverse. Turn your back for a minute or two and a curious or territorial penguin will waddle right up, giving you a side-eye like a three foot yob in a colourful wetsuit. The penguins are just some of the most visible and accessible marine life on these islands. There are sealions, fur seals, even a few of the world's largest, the elephant seal. Seabirds like albatross, petrels and only recently large numbers of whales are returning. They were rarely seen here since their wholesale slaughter in the 19th and 20th centuries. An abundance of life that's in stark contrast to the windswept peat bog and rough grassland interior of the Falklands. And a revelation to many visitors who arrive thinking the islands are remarkable only for the remoteness and a brutal conflict more than four decades ago. But seeing the best of the island's wildlife isn't easy. To get to Volunteer Point, it is a three-hour drive from the capital Port Stanley, two hours of which is off road. Read more from Sky News:The town bracing for UK's biggest council tax riseWhat we learnt flying over the world's largest iceberg At one point even our well equipped 4X4 and experienced driver were no match for the boggy terrain that swallowed our vehicle's wheels up to the axles. Like everywhere, the wildlife of the Falklands is vulnerable to climate change. But here, it's more vulnerable than most. The Falklands is some of the first ice-free land between Antarctica and the rest of the world and many species here are at the northerly limit of their range, that is expected to move further south as the planet warms. Already, numbers of rockhopper penguins are declining on the islands and that's thought to be due to their main food source, shrimp-like krill, moving further south to cooler waters. The Falklands are receiving less rainfall, which has led to its peat soils drying out. That, combined with centuries of overgrazing by sheep, is causing soil being blown away by strong South Atlantic winds. \"On some of the land that we're working on we're seeing around nine football pitches worth of soil blowing away each year,\" says Esther Bertram, chief executive of Falklands Conservation. The drying climate has led to wildfires too. Recent fires burned crucial wildlife habitats. \"We had albatrosses sitting on their nests literally burning alive,\" says Ms Bertram. Conservation groups and researchers on the islands have been working to study the changing ecosystem and restore crucial habitats, including replanting native tussock grass to help retain the soil crucial for burrowing penguins and petrels. But even that work is in jeopardy. Conservation and research here is almost entirely reliant on grant funding from the UK government through a scheme for British Overseas Territories called Darwin Plus. However, the future of the scheme is in doubt as budgets for overseas development and conservation are threatened. Defra, which administers the scheme, was unable to confirm whether the Darwin Plus scheme will continue beyond 2025. With 8,000 miles of ocean between the Falklands and the financial dilemmas of Westminster, the value of their unique wildlife is easily overlooked."
    },
    {
        "title": "Russian captain of ship in North Sea crash appears in court",
        "description": "The Russian captain of a ship involved in the North Sea crash has appeared in court.",
        "url": "https://news.sky.com/story/russian-captain-of-ship-in-north-sea-crash-appears-in-court-13328993",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-solong-container-ship_6853935.jpg?20250312092801",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-15 10:08:00",
        "Headline": "On Monday, the US oil tanker the Stena Immaculate and the Portuguese-flagged Solong collided in the North Sea off the coast of Yorkshire. One crew member remains missing and is thought to have died - a Filipino national named as Mark Angelo Pernia.",
        "Content": "The Russian captain of a ship involved in the North Sea crash has appeared in court. Vladimir Motin, of Primorsky, St Petersburg, was remanded into custody after appearing at Hull Magistrates' Court on Saturday. The 59-year-old has been charged with gross negligence manslaughter. In a glass-front dock for the 35-minute long hearing, Motin heard how the Solong collided with the stationary US-flagged oil tanker, the Stena Immaculate, on Monday, off the coast of Yorkshire. There was no application made for bail and no pleas were entered. Motin, with the help of a translator, only spoke to confirm his name, date of birth and that he did not have an address in the UK. He will appear at the Old Bailey on 14 April. One member of the Solong crew is lost at sea, thought to be dead. He has been named by the Crown Prosecution Service as 38-year-old Filipino national Mark Angelo Pernia. After the collision, there was an explosion on the forward deck of the Solong, where Mr Pernia was working. His fellow crew members tried to find him before evacuating, but were not able to do so. The crash took place about 13 miles off the Yorkshire coast and saw dozens of people forced to abandon the vessels as they caught fire. A large search and rescue operation was launched and successfully brought 36 people from both ships back ashore. The Portuguese-flagged Solong had been sailing from Grangemouth, in Scotland, to Rotterdam, in the Netherlands, at the time of the collision. It was initially feared to be carrying sodium cyanide, but the German owner Ernst Russ said four containers on the vessel had previously been carrying the chemical. Read more from Sky News:Five charged over mum's fatal shootingAt least five dead after road collapsesTrump's fixer waited eight hours to meet Putin The Stena Immaculate is still at anchor at the same point where the collision happened. Meanwhile, the Solong drifted south of this location, but both vessels were said to be \"stable\", with salvors having boarded to assess the damage. The Stena Immaculate had been carrying 220,000 barrels of jet fuel in 16 segregated tanks - at least one of which was \"ruptured\" during the collision, US shipping firm Crowley, who operates the ship, said. But it said the jet fuel spill was having a \"limited\" impact. Most of it had burned off, and there were no signs of further leaks from either ship. Investigations are still ongoing, currently led by the Marine Accident Investigations Branch, to establish the cause of the collision. The coastguard is also continuing to monitor the ships in case they release more pollution."
    },
    {
        "title": "Western military chiefs set to meet to discuss 'operational phase' of Ukraine peace deal",
        "description": "Military chiefs from around the world will meet next week to discuss the \"operational phase\" of protecting Ukraine as part of a peacekeeping force, Sir Keir Starmer has announced.",
        "url": "https://news.sky.com/story/western-military-chiefs-set-to-meet-to-discuss-operational-phase-of-ukraine-peace-deal-13329053",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-keir-starmer-downing-street_6857073.jpg?20250315150044",
        "type": "World",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-15 12:41:00",
        "Headline": "The \"coalition of the willing\" met on Saturday to discuss what should happen next with Ukraine as peace talks continue.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Military chiefs from around the world will meet next week to discuss the \"operational phase\" of protecting Ukraine as part of a peacekeeping force, Sir Keir Starmer has announced. The prime minister hosted a virtual meeting of the \"coalition of the willing\" on Saturday, which involved leaders of 26 nations, including Ukraine, plus the EU and NATO, to discuss ending the war in Ukraine. Speaking after the 90-minute meeting, Sir Keir revealed military chiefs from the group of Western nations would meet on Thursday as they move \"into an operational phase\". He said they would draw up plans to help secure Ukraine \"on the land, at sea and in the sky\" if a peace deal can be agreed with Russia. Ukraine war latest: We must be prepared to defend peace deal The day before, Ukraine President Volodymyr Zelenskyy accepted a proposal for a 30-day interim ceasefire as Russia agreed to an end to fighting, however, President Vladimir Putin said \"lots of questions\" remain over the proposals. Notably absent from Saturday's call was US President Donald Trump, but Sir Keir reiterated any peace deal requires a US backstop. \n                  The two big unknowns left up in the air after Starmer's 'coalition of the willing' Ukraine summit\n                 \n                  Starmer to host virtual meeting of 'coalition of the willing' - and demand 'concrete commitments' on Ukraine\n                 \n                  'We need to get a grip' on welfare, chancellor says - as controversial cuts widely expected\n                 He said the UK is talking to the US \"on a daily basis\" and there is a \"collective resolve\" to end the war, which has been shown by the \"momentum we're building up now\" by the many allied countries being \"on the same page\" both politically and militarily. He said Thursday's meeting of military chiefs \"is very much an operational planning meeting\". The PM added the \"coalition of the willing\" had increased in size since leaders met for the first time just under two weeks ago at Lancaster House in London. Italian Prime Minister Georgia Meloni was the most notable addition after reports she would \"shun\" the meeting because she is \"not convinced\" by the Anglo-French plan to send European peacekeepers to Ukraine. Read more:Zelenskyy says 'good chance' of ending war in Ukraine'A classic power play' - Trump's fixer made to wait eight hours to meet Putin PM dodges what rules of engagement would be Answering a question from Sky News' deputy political editor Sam Coates on what the rules of engagement would be for troops on the ground as part of a peacekeeping process, Sir Keir said the meeting will set that out. He said he has already indicated he wants the UK \"to play a leading role\" in the provision of troops and air power, while other countries will have different capabilities. But, he said a peace deal needs to be achieved first, which requires more pressure on Russia. \"If there's going to be lasting peace, there's going to have to be security arrangements,\" the PM said, noting that Putin has previously broken a peace deal with Ukraine. 'World needs action, not a study' Sir Keir also said on the call that the gathering of leaders rejected Mr Putin's \"yes, but\" approach, in reference to the Russian president saying he would agree to a ceasefire but there must be a \"study\" into how that would look. The prime minister said: \"The world needs action, not a study, not empty words and conditions. So my message is very clear. Sooner or later, Putin will have to come to the table. \"So this is the moment that the guns fall silent, that the barbaric attacks on Ukraine once and for all stop and agree to a ceasefire now.\" The PM revealed seizing Russian assets was discussed in the meeting but said it was \"a complicated question\". Political correspondent While Sir Keir Starmer's coalition of willing world leaders weren't standing literally shoulder to shoulder at this morning’s meeting, their united presence still sent a powerful message of support to the Ukrainians after another tumultuous week. It was clearly important to make a united statement of conviction that the Ukrainians are the \"party of peace\", willing to sign up to a ceasefire without conditions, and the Russians, therefore the de facto party of war, delaying a ceasefire and continuing with their \"barbaric attacks\". But what of the \"concrete commitments\" Sir Keir said he wanted to secure from the meeting?\n While the PM said new commitments had been made, he gave no specific details beyond insisting the coalition would be moving into an \"operational military planning\" phase, with a meeting of military leaders to be held in the UK.\n He had no detailed answer to Sky News' deputy political editor Sam Coates' question about what power any troops deployed as part of the coalition of the willing would actually have to police any deal, arguing he was willing for UK forces to play a leading role but that operational capabilities will be discussed on Thursday.\n Today's messages were directed at both Russia and the US. Starmer insisted Russia would be forced to the table sooner or later - by the increased military support given to the Ukrainians and through the threat of greater economic sanctions. The long-held hope of seizing frozen Russian assets was also discussed, he said.\n And as for his audience in the White House, the PM was demonstrating again that Europe and its allies have been listening to his calls to do more to shoulder the burden of defending Ukraine - and themselves.\n But his argument that no peace deal can be secure and lasting without American security guarantees is unchanged. He reiterated all this needs to be done \"in conjunction with the United States\" and said his team are in daily talks with Washington.\n For all the political power assembled online today, the absence of the US is as striking as ever. Despite that, progress continues. Zelenskyy accuses Putin of lying to everyone President Zelenskyy revealed he addressed the meeting and told them the path to peace \"must begin unconditionally\" and if Russia does not want to do that \"then strong pressure must be applied until they do\". He said the 30-day ceasefire proposal from the Americans negotiating in Saudi Arabia with the Russians has been on the table since Tuesday but accused Mr Putin of \"lying to everyone\" about the situation on the ground and about how a ceasefire is \"supposedly too complicated\". The Ukrainian leader pleaded with the West to \"define a clear position on security guarantees\" and for European nations to invest in defence so the continent has \"its arsenals and the capability to produce the most advanced weapons\", and to strengthen air defence. Mr Zelenskyy suggested another coalition of the willing meeting will be held in a week's time. Who is part of the 'coalition of the willing'? The leaders involved in Saturday's call were from: Australia, Belgium, Bulgaria, Canada, Czech Republic, Denmark, Finland, France, Germany, Greece, Iceland, Italy, Latvia, Lithuania, Luxembourg, Netherlands, New Zealand, Norway, Poland, Portugal, Romania, Spain, Sweden, Turkey, Ukraine and the UK. NATO Secretary General Mark Rutte, EU Commission President Ursula von der Leyen and EU Council President Antonio Costa also joined."
    },
    {
        "title": "At least 26 killed as tornadoes and dust storms rip through parts of US",
        "description": "At least 26 people are reported to have died in powerful storms across the United States.",
        "url": "https://news.sky.com/story/at-least-26-killed-as-tornadoes-and-dust-storms-rip-through-parts-of-us-13329033",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-missouri-storm-bridgeton_6858082.jpg?20250316004528",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-15 12:07:00",
        "Headline": "Missouri recorded 12 fatalities, with deaths also recorded in Arkansas and Texas after tornadoes ripped apart homes and brought down trees. The massive weather system has also produced deadly dust storms, wildfires and hail the size of baseballs.",
        "Content": "At least 26 people are reported to have died in powerful storms across the United States. The number of fatalities increased after eight people died in a highway pile-up caused by a dust storm in Sherman County, Kansas on Friday. At least 50 vehicles were involved. Car crashes during a dust storm also killed three people in Amarillo, Texas. Authorities in Missouri say 12 people died after tornadoes struck the state, with another three deaths reported in Arkansas. Around 108 million people remain under widespread wind, flash flooding and wildfire alerts in central and southern US states. Hundreds of thousands of households are also without power. Tornado warnings are in place in parts of Illinois, Missouri, Arkansas, Mississippi, Indiana, and Kentucky as a massive storm system moves across the country. Many areas across southern states are, or will soon be, dealing with widespread flash flooding, the National Weather Service warned. It added that the flooding could turn deadly. In Butler County, Missouri, on the border with Arkansas, local coroner Jim Akers said the man and his wife were sleeping when the tornado struck. Rescuers were able to pull the woman from the debris - but could not save the man whose mobile home was ripped apart. \"It was unrecognisable as a home. Just a debris field,\" he said, describing the scene. \"The floor was upside down. We were walking on walls.\" Large vehicles were also pictured overturned across the state. Arkansas governor Sarah Huckabee Sanders warned the recovery could take months after surveying damage from an EF3 tornado in Cave City, in the north of the state. A storm ranked as EF3, on a scale of one to five, requires wind speeds of between 136-165mph (218-265kph). Hail the size of baseballs \"It's hard to look at this level of devastation and not be heartbroken,\" she said. \"It's a whole other world when you see it up close and personal.\" Winds gusting up to 80mph (130kph) were predicted from the Canadian border to Texas, threatening blizzard conditions in colder northern areas and wildfire risk in warmer, drier places to the south. Hail was also a hazard, some the size of baseballs were reported in Christian County, the US weather service said. Fatal pile-ups during dust storms In the Texas city of Amarillo, three people were killed in car crashes caused by a dust storm on Friday, according to the state's public safety department. One of the deaths happened after three lorries collided with four other vehicles in Palmer County, Bovina's fire chief Cesar Marquez said. Another occurred after a pile-up of an estimated 38 cars. \"It's the worst I've ever seen,\" public safety department sergeant Cindy Barkley said, calling the near-zero visibility a nightmare. \"We couldn't tell that they were all together until the dust kind of settled.\" Evacuations were ordered in some Oklahoma communities as more than 130 fires were reported across the state. Nearly 300 homes were damaged or destroyed, said governor Kevin Stitt. Read more from Sky News:Trump launches strikes against HouthisUS expels SA ambassadorThe big unknowns after Starmer's summit Three deaths happened due to storm damage in Independence County, Arkansas on Friday night, with a further 29 people injured across eight different counties, authorities said. More than 260,000 households are without power in midwestern and southern states, according to the monitoring website PowerOutage.us. The Storm Prediction Center at the National Weather Service issued an update on Sunday, warning of a moderate risk of severe thunderstorms. The warning covers an area from the extreme southeastern part of Mississippi, across much of Alabama, into western Georgia and the western Florida panhandle."
    },
    {
        "title": "Donald Trump launches strikes against Yemen's Houthis over Red Sea ship attacks",
        "description": "US President Donald Trump has launched strikes against the Houthis in Yemen. ",
        "url": "https://news.sky.com/story/donald-trump-launches-strikes-against-yemens-houthis-13329695",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-yemen-houthis_6857893.jpg?20250315192111",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-15 18:44:00",
        "Headline": "At least nine civilians have been killed, according to the health ministry run by the Iran-backed group. ",
        "Content": "US President Donald Trump has launched strikes against the Houthis in Yemen.  In a post on his Truth Social platform, he also warned Iran the country's support for the group must \"end immediately\". The Iran-backed Houthis reported a series of explosions in Yemen's capital Sanaa on Saturday evening.   The Houthi-run health ministry said in a post on X that at least nine civilians have been killed and nine others injured. Images shared online show plumes of black smoke over the area of the city's airport complex, which includes a sprawling military facility. Mr Trump said the strikes were over the group's attacks against ships in the Red Sea. \"Your time is up, and your attacks must stop, starting today. If they don't, hell will rain down upon you like nothing you have ever seen before,\" he said. The president said Iran would be held \"fully accountable\" for the actions of its proxy, adding: \"And we won't be nice about it!\" The strikes come days after the Houthis said they would resume attacks on Israeli vessels sailing in waters off Yemen in response to Israel's blockade on Gaza, although there have been no Houthi attacks reported since then. Earlier this month, Israel halted all aid coming into Gaza and warned of \"additional consequences\" for Hamas if their fragile ceasefire is not extended as negotiations continue over starting a second phase. \"The Houthi attack on American vessels will not be tolerated. We will use overwhelming lethal force until we have achieved our objective,\" Mr Trump wrote. \"These relentless assaults have cost the US and World Economy many BILLIONS of Dollars while, at the same time, putting innocent lives at risk.\" The Houthis launched more than 100 attacks targeting shipping from November 2023, saying they were in solidarity with Palestinians over Israel's war with Hamas in Gaza. The US, Israel and Britain have previously hit Houthi-held areas in Yemen. According to a US official, the operation - the first strike on the Houthis under the second Trump administration - was conducted solely by the US. Read more from Sky News:At least 17 dead in US stormsUS expels South African ambassador The Houthi media office said the strikes hit \"a residential neighbourhood\" in Sanaa's northern district of Shouab. Sanaa residents said at least four airstrikes hit the Eastern Geraf neighbourhood in the district, terrifying women and children in the area. \"The explosions were very strong,\" said Abdallah al Alffi. \"It was like an earthquake.\" Similar missile strikes against the Houthis were done multiple times by Joe Biden's administration in response to frequent attacks by the Houthis against commercial and military vessels in the region."
    },
    {
        "title": "US expels South African ambassador for being 'race-baiting politician'",
        "description": "The United States has expelled South Africa's ambassador for being a \"race-baiting politician who hates America\".",
        "url": "https://news.sky.com/story/us-expels-south-african-ambassador-for-being-race-baiting-politician-13328948",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-ebrahim-rasool-south-africa_6856924.jpg?20250315075042",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-15 07:22:00",
        "Headline": "Relations between the US and South Africa have been strained since Donald Trump re-entered the White House in January.",
        "Content": "The United States has expelled South Africa's ambassador for being a \"race-baiting politician who hates America\". Secretary of state Marco Rubio posted on X late on Friday to say Ebrahim Rasool is \"no longer welcome in our great country\" because he \"hates America and @POTUS [President of the United States]\". \"We have nothing to discuss with him and so he is considered PERSONA NON GRATA,\" Mr Rubio said. Relations between the US and South Africa have been strained since Donald Trump re-entered the White House in January. The second-time president cut the country's financial aid and has criticised both its land policy, aimed at evening out racial disparities, and its genocide case against Israel at the International Criminal Court (ICC). Mr Trump, without any supporting evidence, has claimed \"South Africa is confiscating land\" and that \"certain classes of people\" are being treated \"very badly\" there. Elon Musk, his close ally and head of newly created Department of Government Efficiency (DOGE), has said white South Africans have fallen victim to \"racist ownership laws\". The new legislation, passed in January, makes it easier for the government to expropriate land in the public interest. The expulsion comes after Mr Rasool addressed a webinar in which he said Mr Trump is leading a \"white supremacist\" movement in America. Mr Rubio posted a news report on the webinar alongside his announcement. Read more from Sky NewsUK city hit by bin strikeGang jailed for kidnapping music producerInfluencer snatches baby wombat US-South Africa relations at 'lowest point' Mr Rasool began his second post as US ambassador in January, having served in Washington previously between 2010 and 2015. The office for South Africa's president Cyril Ramaphosa described the US decision as \"regrettable\", adding that it remains committed to a \"mutually beneficial relationship with the country\". Mr Rasool has been excluded from meetings with key State Department officials - and members of Mr Trump's administration, according to news website Semafor. His pro-Palestinian views and criticism of Israel appear to have been the reason, the website claimed, citing an anonymous South African diplomat. Former US ambassador to South Africa Patrick Gaspard told Reuters that ties between the two nations have reached their \"lowest point\". \"There's too much at stake to not work towards the repair of this partnership,\" he said."
    },
    {
        "title": "Trump 100 Day 55: Will Trump's gamble on peace in Ukraine pay off? ",
        "description": "<a href='https://podfollow.com/trump100/view'>👉 Follow Trump 100 on your podcast app 👈  </a>",
        "url": "https://news.sky.com/story/trump-100-day-55-will-trumps-gamble-on-peace-in-ukraine-pay-off-13328774",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-podcasts-donald-trump_6801283.png?20250129031345",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-15 00:01:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump 100 on your podcast app 👈   Donald Trump signals a possible end to the Ukraine war after \"productive\" talks with Vladimir Putin. But with no direct Trump-Putin call yet, what's really going on behind the scenes?  Our US correspondents James Matthews, Martha Kelner, and Mark Stone break down the latest from special envoy Steve Witkoff's visit to Moscow, and reactions from the G7 meeting in Canada. Plus, governor of California Gavin Newsom is drawing criticism for welcoming far-right provocateur Steve Bannon on to his new podcast. If you've got a question you'd like James, Martha, and Mark to answer, you can email it to trump100@sky.uk."
    },
    {
        "title": "'His miserable life was terminated' says Trump after airstrike kills head of Islamic State in Iraq and Syria",
        "description": "The head of Islamic State (IS) in Iraq and Syria has been killed in an airstrike in western Iraq, according to Iraqi officials and US military commanders.\n",
        "url": "https://news.sky.com/story/his-miserable-life-was-terminated-says-trump-after-airstrike-kills-head-of-islamic-state-in-iraq-and-syria-13328893",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-centcom-khadijah-iraq_6856820.png?20250315035353",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-15 03:18:00",
        "Headline": "Iraq's prime minister has described Abu Khadija as \"one of the most dangerous terrorists in Iraq and the world\". On Thursday, an airstrike targeted his vehicle and US forces said they had confirmed his death using DNA tests.",
        "Content": " The head of Islamic State (IS) in Iraq and Syria has been killed in an airstrike in western Iraq, according to Iraqi officials and US military commanders.\n Donald Trump said in a post on Truth Social the \"fugitive leader of ISIS in Iraq was killed\" after being \"relentlessly hunted down by our intrepid warfighters. His miserable life was terminated\". He added: \"PEACE THROUGH STRENGTH!\" Details of the operation in Iraq have been described by US Central Command (CENTCOM) which said on X it had conducted \"a precision airstrike in Al Anbar Province\" in cooperation with Iraqi intelligence and security forces. The statement added that the airstrike had \"killed the global ISIS #2 leader, chief of global operations and the delegated committee emir - Abdallah Makki Muslih al-Rifai, alias 'Abu Khadijah' [Khadija], and one other ISIS operative\". Following the attack, CENTCOM said their forces and Iraqi troops examined the site and found two bodies, which were wearing unexploded \"suicide vests\" and had multiple weapons. It added that Abu Khadija's death was confirmed using DNA tests. On Friday, Iraqi Prime Minister Mohammed Shia al Sudani described Khadija as \"one of the most dangerous terrorists in Iraq and the world\". \n                  Iraqi PM frustrated with West's 'failures' over Gaza\n                 \n                  UK investigators assist in arrest of suspected human traffickers in Iraq for first time\n                 \n                  Suicide bombers 'planned to attack Pope Francis' on visit to Iraq\n                 In a statement on X, he added: \"The Iraqis continue their impressive victories over the forces of darkness and terrorism.\" Details of the airstrike coincided with the first visit by Syria's top diplomat to Iraq, during which the two countries pledged to work together to combat IS. The operation comes at a time when Iraqi officials are anxious about an IS resurgence after the fall of former Syrian President Bashar al Assad in Syria. While Syria's new rulers - led by the Islamist former insurgent group Hayat Tahrir al Sham (HTS) - have pursued IS cells since taking power, some fear a breakdown in overall security that could allow the group to stage a resurgence.  Read more:IS leader Abu Yusif killed in SyriaFears of IS resurgence in Syria Commenting on the operation against Khadija, the commander of US Central Command said: \"Abu Khadijah [Khadija] was one of the most important ISIS members in the entire global ISIS organisation.\" \"We will continue to kill terrorists and dismantle their organizations that threaten our homeland and US, allied and partner personnel in the region and beyond,\" added General Michael Erik Kurilla. 👉 Follow Trump 100 on your podcast app 👈 Last year, the US and Iraq announced an agreement to wind down the military mission in Iraq of an American-led coalition fighting IS by September 2025. The intention has been for US forces to leave some bases where they have stationed troops during a two-decade-long military presence in the country."
    },
    {
        "title": "Premiership Rugby rivals and CVC to fund Newcastle Falcons loan",
        "description": "English rugby union's top teams and the sport's private equity backer are in advanced talks to fund a multimillion pound loan to Newcastle Falcons to help it meet financial criteria allowing it to play next season.",
        "url": "https://news.sky.com/story/premiership-rugby-rivals-and-cvc-to-fund-newcastle-falcons-loan-13328996",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-newcastle-falcons-gallagher-premiership_6856978.jpg?20250315103552",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-15 10:31:00",
        "Headline": "The top flight of English rugby union, which includes Bath and Saracens, and CVC Capital Partners are in talks to provide about £4m in funding to the league's bottom club, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n English rugby union's top teams and the sport's private equity backer are in advanced talks to fund a multimillion pound loan to Newcastle Falcons to help it meet financial criteria allowing it to play next season. Sky News has learnt that the nine other Gallagher Premiership Rugby sides, which include current league leaders Bath, Saracens and Harlequins, and CVC Capital Partners are drawing up plans for a loan worth about £4m to the north-east club. The Falcons, who are propping up the Premiership table with just two wins from 11 matches, are said to need the additional funding in order to meet the tests applied by the league's recently created Financial Monitoring Panel. Newcastle's plight comes two years after Worcester, Wasps and London Irish all went out of business, leaving the Premiership with just ten teams. A further loan, which could be finalised within weeks, would require approval by the Department for Culture, Media and Sport (DCMS), according to insiders. The exact size of the loan has yet to be determined but one source said it could be worth between £4m and £5m. Premiership clubs are said to be keen to ensure that any new funding they provide ranks on at least equal terms to emergency loans provided to the sport by the government during the pandemic. \n                  Economy finds reverse gear in January with surprise contraction\n                 \n                  Weekend Money: Give up your career or work for £30 a day - the impossible choice facing women across UK\n                 \n                  Rats and other rodents posing 'huge' public health risk amid Birmingham bin strikes\n                 In 2021, the then culture secretary, Oliver Dowden, signed off an £88m support package to the top flight of English rugby to ensure the league's survival. Much of that funding has yet to be repaid. CVC, which bought into Premiership Rugby in 2019, owns a 27% stake in the league. Under its stewardship, broadcast audiences and attendances have turned a corner, with total TV audiences up 40% this year - partly as a result of an increase in the number of games being shown. Sponsorship revenues are said to have nearly doubled since CVC's initial investment, with fan interest among the crucial 18-34 age demographic rising by 30% during the last year, according to insiders. The Newcastle loan talks come amid negotiations over a new broadcast rights deal for Premiership Rugby, with sources suggesting this weekend that TNT Sports, the incumbent rights-holder, was expected to agree to a renewal at a premium to the current sum in the coming weeks. One insider said the sport's improving commercial backdrop meant it made sense for Newcastle's nine fellow Premiership clubs and CVC to support the bottom side financially. It emerged last November that Semore Kurdi, who has backed Newcastle Falcons for more than a decade, had put the club up for sale. Rugby executives said this weekend that a number of family offices were among the parties which had expressed an interest in buying the Falcons. It was unclear, however, whether any form of deal was imminent. A takeover would include the club's 30-acre Kingston Park stadium site. The Falcons have been lossmaking for some time, despite Mr Kurdi's moves to cut costs, with Newcastle Falcons spending millions of pounds less on wages than it is permitted to under the sport's salary cap. Of the clubs which collapsed, London Irish has been acquired by a consortium fronted by Eddie Jordan, the former Formula One team-owner, while Wasps said in November that it had secured land in the south-wast to build a new stadium as part of its revival plans. Worcester Warriors said this month it had submitted an application to the Rugby Football Union to enable it to compete again from next season. CVC, Newcastle Falcons and the DCMS all declined to comment."
    },
    {
        "title": "Rats and other rodents posing 'huge' public health risk amid Birmingham bin strikes",
        "description": "Rats and other rodents are posing a \"huge\" public health risk amid the ongoing bin strikes in Birmingham, a pest control expert has warned.",
        "url": "https://news.sky.com/story/rats-and-other-rodents-posing-huge-public-health-risk-amid-birmingham-bin-strikes-13328936",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-birmingham-refuse-collection_6853181.jpg?20250311151227",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-03-15 06:36:00",
        "Headline": "Waste workers in Birmingham went on strike on Tuesday in a row over jobs and pay. Unite warned disruption could last into the summer and the city council countered saying it had made a \"fair and reasonable offer\".",
        "Content": "Rats and other rodents are posing a \"huge\" public health risk amid the ongoing bin strikes in Birmingham, a pest control expert has warned. The rodents are said to be flourishing on the \"banquet\" of rotting food left out for them. On Tuesday, nearly 400 council bin workers in the Midlands city began indefinite strike action as part of a row over jobs and pay. Unite, the union, said the city council could end the dispute \"by agreeing to pay a decent rate of pay\". Birmingham City Council said it had made a \"fair and reasonable offer\" to the workers and claimed the \"escalation\" of industrial action would mean greater disruption for residents. Grahame Turner, technical manager at the National Pest Technicians Association (NPTA), said: \"This is a huge public health danger, and what we're seeing in Birmingham is incredibly concerning. \"Pests like rats, mice and even squirrels are on the lookout for easy meals at this time of year, and easily accessible waste is an open invitation. \n                  Birmingham bin strike sees rubbish piled on streets as workers walk off job indefinitely\n                 \n                  Driver killed 'showboating' e-bike rider to 'teach him a lesson'\n                 \n                  Boy, 12, stabbed to death in Birmingham named - after 14-year-old arrested on suspicion of murder\n                 \"Rotting food is an absolute banquet to them, and Birmingham is already extremely vulnerable due to previous strikes and infestation levels of rodents that are observed within urban areas.\" He went on that once rodents find overflowing bins, they may explore other parts of the location too, such as nearby houses, seeking warmth and shelter. \"Rodents aren't just a nuisance - they can pose serious health risks to you and your family. Rats and mice are known to carry diseases such as leptospirosis, hantavirus, and salmonella, which can spread through their droppings, urine, and even by contaminating food supplies,\" he added. Alongside that, they can cause \"serious structural damage\" by chewing through electrical wiring, insulation and even causing damage to plumbing. In light of the strikes, Mr Turner said if residents could take any actions to minimise encouraging rodents, they should. This could take the form of storing uncollected rubbish in sealed boxes or bins, or transporting the waste themselves to a local recycling centre or tip. Disruption could run into the summer Unite has warned that disruption to waste collection could run into the summer after workers voted in favour of extending their strike due to the council's use of temporary labour to \"undermine\" the industrial action. The union warned its members face pay cuts after the scrapping of waste collection and recycling officer roles, despite them already having accepted voluntary cuts after the council declared bankruptcy. Earlier this week, the council said 90 waste collection crews out of a total of 200 were still out collecting rubbish. Read more from Sky News:Meet the penguins of the FalklandsChance of ending war quickly, says ZelenskyyUS influencer snatched baby wombat It asked residents to continue to put waste out as usual and said staff affected in the removal of the two roles had been given the opportunity to move to alternative roles, take voluntary redundancy or train as drivers."
    },
    {
        "title": "The two big unknowns left up in the air after Starmer's 'coalition of the willing' Ukraine summit",
        "description": "There was one clear, united message from today's virtual meeting of leaders - that they rejected Vladimir Putin's \"yes, but\" approach to a ceasefire.",
        "url": "https://news.sky.com/story/the-two-big-unknowns-left-up-in-the-air-after-starmers-coalition-of-the-willing-ukraine-summit-13329413",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-keir-starmer-downing-street_6856351.jpg?20250314154910",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-03-15 16:41:00",
        "Headline": "Leaders want Russia to mirror Ukraine's ceasefire pledge - but don't trust Vladimir Putin to uphold promises on peace.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  There was one clear, united message from today's virtual meeting of leaders - that they rejected Vladimir Putin's \"yes, but\" approach to a ceasefire. The \"coalition of the willing\" - the 27 leaders, plus NATO and the EU led by Sir Keir Starmer and Emmanuel Macron - want the Russian president to mirror Ukraine's pledge for a 30-day pause in fighting, in order to hammer out a sustainable peace deal. Sir Keir made that very clear, and suggested the attendees at the meeting were behind this approach. Ukraine war latest: Putin's ceasefire conditions 'not good enough'  The prime minister said: \"Volodymyr [Zelenskyy] has committed to a 30-day unconditional ceasefire, but Mr Putin is trying to delay, saying there must be a painstaking study before a ceasefire can take place. \"Well, the world needs action, not a study, not empty words and conditions. So my message is very clear. Sooner or later, Putin will have to come to the table.\" There are two reasons for this challenge - an immediate end to fighting is a goal in itself, but many of those in today's call, including Sir Keir, do not trust Mr Putin to uphold promises on peace and are trying to convince US President Donald Trump to be more clear-eyed about the Russian approach. Challenging the Russian leader to follow the US request for a ceasefire and watching him refuse is designed to send a message to the White House as well as the Kremlin. There were, however, bigger unknowns left hanging. Read more from Sky News:Russian captain of North Sea crash ship appears in courtAt least 17 dead in US storms One of which was the clear signal from Sir Keir that he is still relying on a US security guarantee in order to bring on board a \"coalition of the willing\" who might be able to provide troops to Ukraine. There are, however, many that don't think that that US security guarantee is coming in any substantial way, based on the noises coming out of the US. That is a big problem for the PM, as government sources tell me that the scope and the remit of any potential peacekeeping force is determined by what protection the US might be able to provide. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 The second issue that is being sidestepped by Sir Keir is what any peace keeping might be able to do in practice. UK troops, like those of any NATO country, cannot engage directly with Russia in combat for fear of triggering a much bigger conflagration. So if not that, then what is their purpose - a question repeatedly asked by experts like the former national security adviser Lord Ricketts. I put exactly this to the PM, but did not get an answer. He suggested that we were a long way away from getting an an answer, even though military chiefs also appear to be meeting to \"operationalise\" plans on Thursday. How can they operationalise a plan that does not, and currently cannot, have a remit? Today Sir Keir heralded the participation of Canada, Australia and New Zealand on the call, as part of the effort. But if the remit of the coalition of the willing isn't clear, how can it truly be effective?"
    },
    {
        "title": "Western military chiefs set to meet to discuss 'operational phase' of Ukraine peace deal",
        "description": "Military chiefs from around the world will meet next week to discuss the \"operational phase\" of protecting Ukraine as part of a peacekeeping force, Sir Keir Starmer has announced.",
        "url": "https://news.sky.com/story/western-military-chiefs-set-to-meet-to-discuss-operational-phase-of-ukraine-peace-deal-13329053",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-keir-starmer-downing-street_6857073.jpg?20250315150044",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-15 12:41:00",
        "Headline": "The \"coalition of the willing\" met on Saturday to discuss what should happen next with Ukraine as peace talks continue.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Military chiefs from around the world will meet next week to discuss the \"operational phase\" of protecting Ukraine as part of a peacekeeping force, Sir Keir Starmer has announced. The prime minister hosted a virtual meeting of the \"coalition of the willing\" on Saturday, which involved leaders of 26 nations, including Ukraine, plus the EU and NATO, to discuss ending the war in Ukraine. Speaking after the 90-minute meeting, Sir Keir revealed military chiefs from the group of Western nations would meet on Thursday as they move \"into an operational phase\". He said they would draw up plans to help secure Ukraine \"on the land, at sea and in the sky\" if a peace deal can be agreed with Russia. Ukraine war latest: We must be prepared to defend peace deal The day before, Ukraine President Volodymyr Zelenskyy accepted a proposal for a 30-day interim ceasefire as Russia agreed to an end to fighting, however, President Vladimir Putin said \"lots of questions\" remain over the proposals. Notably absent from Saturday's call was US President Donald Trump, but Sir Keir reiterated any peace deal requires a US backstop. \n                  The two big unknowns left up in the air after Starmer's 'coalition of the willing' Ukraine summit\n                 \n                  Starmer to host virtual meeting of 'coalition of the willing' - and demand 'concrete commitments' on Ukraine\n                 \n                  'We need to get a grip' on welfare, chancellor says - as controversial cuts widely expected\n                 He said the UK is talking to the US \"on a daily basis\" and there is a \"collective resolve\" to end the war, which has been shown by the \"momentum we're building up now\" by the many allied countries being \"on the same page\" both politically and militarily. He said Thursday's meeting of military chiefs \"is very much an operational planning meeting\". The PM added the \"coalition of the willing\" had increased in size since leaders met for the first time just under two weeks ago at Lancaster House in London. Italian Prime Minister Georgia Meloni was the most notable addition after reports she would \"shun\" the meeting because she is \"not convinced\" by the Anglo-French plan to send European peacekeepers to Ukraine. Read more:Zelenskyy says 'good chance' of ending war in Ukraine'A classic power play' - Trump's fixer made to wait eight hours to meet Putin PM dodges what rules of engagement would be Answering a question from Sky News' deputy political editor Sam Coates on what the rules of engagement would be for troops on the ground as part of a peacekeeping process, Sir Keir said the meeting will set that out. He said he has already indicated he wants the UK \"to play a leading role\" in the provision of troops and air power, while other countries will have different capabilities. But, he said a peace deal needs to be achieved first, which requires more pressure on Russia. \"If there's going to be lasting peace, there's going to have to be security arrangements,\" the PM said, noting that Putin has previously broken a peace deal with Ukraine. 'World needs action, not a study' Sir Keir also said on the call that the gathering of leaders rejected Mr Putin's \"yes, but\" approach, in reference to the Russian president saying he would agree to a ceasefire but there must be a \"study\" into how that would look. The prime minister said: \"The world needs action, not a study, not empty words and conditions. So my message is very clear. Sooner or later, Putin will have to come to the table. \"So this is the moment that the guns fall silent, that the barbaric attacks on Ukraine once and for all stop and agree to a ceasefire now.\" The PM revealed seizing Russian assets was discussed in the meeting but said it was \"a complicated question\". Political correspondent While Sir Keir Starmer's coalition of willing world leaders weren't standing literally shoulder to shoulder at this morning’s meeting, their united presence still sent a powerful message of support to the Ukrainians after another tumultuous week. It was clearly important to make a united statement of conviction that the Ukrainians are the \"party of peace\", willing to sign up to a ceasefire without conditions, and the Russians, therefore the de facto party of war, delaying a ceasefire and continuing with their \"barbaric attacks\". But what of the \"concrete commitments\" Sir Keir said he wanted to secure from the meeting?\n While the PM said new commitments had been made, he gave no specific details beyond insisting the coalition would be moving into an \"operational military planning\" phase, with a meeting of military leaders to be held in the UK.\n He had no detailed answer to Sky News' deputy political editor Sam Coates' question about what power any troops deployed as part of the coalition of the willing would actually have to police any deal, arguing he was willing for UK forces to play a leading role but that operational capabilities will be discussed on Thursday.\n Today's messages were directed at both Russia and the US. Starmer insisted Russia would be forced to the table sooner or later - by the increased military support given to the Ukrainians and through the threat of greater economic sanctions. The long-held hope of seizing frozen Russian assets was also discussed, he said.\n And as for his audience in the White House, the PM was demonstrating again that Europe and its allies have been listening to his calls to do more to shoulder the burden of defending Ukraine - and themselves.\n But his argument that no peace deal can be secure and lasting without American security guarantees is unchanged. He reiterated all this needs to be done \"in conjunction with the United States\" and said his team are in daily talks with Washington.\n For all the political power assembled online today, the absence of the US is as striking as ever. Despite that, progress continues. Zelenskyy accuses Putin of lying to everyone President Zelenskyy revealed he addressed the meeting and told them the path to peace \"must begin unconditionally\" and if Russia does not want to do that \"then strong pressure must be applied until they do\". He said the 30-day ceasefire proposal from the Americans negotiating in Saudi Arabia with the Russians has been on the table since Tuesday but accused Mr Putin of \"lying to everyone\" about the situation on the ground and about how a ceasefire is \"supposedly too complicated\". The Ukrainian leader pleaded with the West to \"define a clear position on security guarantees\" and for European nations to invest in defence so the continent has \"its arsenals and the capability to produce the most advanced weapons\", and to strengthen air defence. Mr Zelenskyy suggested another coalition of the willing meeting will be held in a week's time. Who is part of the 'coalition of the willing'? The leaders involved in Saturday's call were from: Australia, Belgium, Bulgaria, Canada, Czech Republic, Denmark, Finland, France, Germany, Greece, Iceland, Italy, Latvia, Lithuania, Luxembourg, Netherlands, New Zealand, Norway, Poland, Portugal, Romania, Spain, Sweden, Turkey, Ukraine and the UK. NATO Secretary General Mark Rutte, EU Commission President Ursula von der Leyen and EU Council President Antonio Costa also joined."
    },
    {
        "title": "An abundance of marine life - but the wildlife of the Falkland Islands is more vulnerable than most",
        "description": "You can hear them before you see them. And smell them.",
        "url": "https://news.sky.com/story/why-wildlife-in-the-falkland-islands-is-more-vulnerable-than-most-13328568",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-penguins-clarke_6856330.png?20250314153234",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-03-15 00:01:00",
        "Headline": "Conservation and research here is almost entirely reliant on grant funding from the UK government through a scheme for British Overseas Territories called Darwin Plus.\nBut the future of the scheme is in doubt as budgets for overseas development and conservation are threatened.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  You can hear them before you see them. And smell them. At this time of year - the South Atlantic summer - the penguins of the Falkland Islands mob together in rookeries on these isolated beaches to raise their fluffy chicks. And we're surrounded by them. The beach at Volunteer Point on the northeast tip of the Falklands is home to its largest colony of king penguins. Up to a metre tall, they stand squabbling in a defensive huddle around their chicks. But there are others too, burrowing magellanic penguins and red-billed, yellow-footed gentoo. Across the 740 islands that make up the Falklands there are five different species and around a million of them in total. \n                  What we learnt flying over the world's largest iceberg A23a - and why it's not long for this world\n                 \n                  Trump government attempts to rip up 31 environmental protections and reviews damage of greenhouse gases\n                 \n                  The furious rise of climate whiplash\n                 To prevent disturbance, and the spread of bird flu, visitors are asked to keep six metres from the birds. But the rule doesn't apply in reverse. Turn your back for a minute or two and a curious or territorial penguin will waddle right up, giving you a side-eye like a three foot yob in a colourful wetsuit. The penguins are just some of the most visible and accessible marine life on these islands. There are sealions, fur seals, even a few of the world's largest, the elephant seal. Seabirds like albatross, petrels and only recently large numbers of whales are returning. They were rarely seen here since their wholesale slaughter in the 19th and 20th centuries. An abundance of life that's in stark contrast to the windswept peat bog and rough grassland interior of the Falklands. And a revelation to many visitors who arrive thinking the islands are remarkable only for the remoteness and a brutal conflict more than four decades ago. But seeing the best of the island's wildlife isn't easy. To get to Volunteer Point, it is a three-hour drive from the capital Port Stanley, two hours of which is off road. Read more from Sky News:The town bracing for UK's biggest council tax riseWhat we learnt flying over the world's largest iceberg At one point even our well equipped 4X4 and experienced driver were no match for the boggy terrain that swallowed our vehicle's wheels up to the axles. Like everywhere, the wildlife of the Falklands is vulnerable to climate change. But here, it's more vulnerable than most. The Falklands is some of the first ice-free land between Antarctica and the rest of the world and many species here are at the northerly limit of their range, that is expected to move further south as the planet warms. Already, numbers of rockhopper penguins are declining on the islands and that's thought to be due to their main food source, shrimp-like krill, moving further south to cooler waters. The Falklands are receiving less rainfall, which has led to its peat soils drying out. That, combined with centuries of overgrazing by sheep, is causing soil being blown away by strong South Atlantic winds. \"On some of the land that we're working on we're seeing around nine football pitches worth of soil blowing away each year,\" says Esther Bertram, chief executive of Falklands Conservation. The drying climate has led to wildfires too. Recent fires burned crucial wildlife habitats. \"We had albatrosses sitting on their nests literally burning alive,\" says Ms Bertram. Conservation groups and researchers on the islands have been working to study the changing ecosystem and restore crucial habitats, including replanting native tussock grass to help retain the soil crucial for burrowing penguins and petrels. But even that work is in jeopardy. Conservation and research here is almost entirely reliant on grant funding from the UK government through a scheme for British Overseas Territories called Darwin Plus. However, the future of the scheme is in doubt as budgets for overseas development and conservation are threatened. Defra, which administers the scheme, was unable to confirm whether the Darwin Plus scheme will continue beyond 2025. With 8,000 miles of ocean between the Falklands and the financial dilemmas of Westminster, the value of their unique wildlife is easily overlooked."
    },
    {
        "title": "Eclipse captured from moon's point of view as lander takes images during 'historic' event",
        "description": "This week's eclipse has been photographed from the moon's point of view.",
        "url": "https://news.sky.com/story/eclipse-captured-from-moons-point-of-view-as-lander-takes-images-during-historic-event-13329001",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-firefly-aerospace-eclipse_6857012.jpg?20250315110736",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-15 10:54:00",
        "Headline": "The images were taken by a camera on board the unmanned Blue Ghost spacecraft which successfully landed on the planet earlier this month.",
        "Content": "This week's eclipse has been photographed from the moon's point of view. But rather than being the lunar eclipse that was seen from Earth, on the moon it was a solar eclipse. The images were taken by a camera on board the unmanned Blue Ghost spacecraft which successfully landed on the planet earlier this month. Operator Firefly Aerospace said it was the first time in history that a commercial company had operated actively on the moon during an eclipse. In a total lunar eclipse, the Earth lines up between the moon and the sun, hiding the moon from sunlight. On Friday, the moon turned red in an event known as a blood moon. The full lunar eclipse was visible from North and South America, while in the UK only a partial lunar eclipse was visible. The first picture of the cosmic event from the moon shows the Earth beginning to block out the sun. \n                  Blood moon 2025: How to see the lunar eclipse\n                 \n                  Athena lander does not appear to be standing upright on moon\n                 \n                  Second-ever privately funded space craft touches down on moon\n                 The solar eclipse can also be seen in a reflection of the lander's solar panel in the same picture. In a caption on X accompanying the 14 March photo, Firefly Aerospace wrote: \"BlueGhost caught her first look at the solar eclipse from the moon around 12.30am CDT - notice the glowing ring of light emerge in the reflection of our solar panel as the Earth began to block the sun!\" A second image, captured from the landing site, shows the \"diamond ring\" as the sun is about to emerge from totality behind Earth. A third photo showed the Blue Ghost turn a reddish colour during the event. Firefly Aerospace said: \"The red hue is the result of sunlight refracting through the Earth's atmosphere as the sun is blocked by our planet, casting a shadow on the lunar surface. The glowing ring of the eclipse is again seen on Blue Ghost's solar panel.\" Blue Ghost's three solar panels have been powering the lander's research instruments for a 14-day mission on the moon. Read more from Sky News:Rocket with replacement crew for stranded astronauts launchesWhat can being in space for so long do to your health? The four-legged Blue Ghost, which is the size of a compact car, touched down on 2 March near an ancient volcanic vent on Mare Crisium, a large basin in the northeast corner of the moon's Earth-facing side. It is carrying 10 scientific payloads and used 21 thrusters to guide itself to touchdown. It has on board a vacuum to suck up moon dirt for analysis and a drill to measure temperatures as deep as 10 feet. Firefly Aerospace became the second private firm to carry out a moon landing, though it declared itself the first company to make a \"fully successful\" soft landing. Houston-based Intuitive Machine's Odysseus lander made a lopsided touchdown last year, landing mostly intact but dooming many of its onboard instruments. Only five nations have been successful in soft-landings in the past: The then-Soviet Union, the US, China, India and Japan."
    },
    {
        "title": "Gangs Of London is back - here's what you need to know",
        "description": "Gangs Of London is one of the most violent shows on television and has gripped audiences since its release in 2020.",
        "url": "https://news.sky.com/story/gangs-of-london-is-back-heres-what-you-need-to-know-13328694",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-sope-dirisu-elliott-carter_6856726.jpg?20250314225742",
        "type": "Entertainment",
        "Author": "Debbie Ridgard",
        "Date Published": "2025-03-15 00:01:00",
        "Headline": "First launched in 2020, crime thriller Gangs Of London is back for its third season - and cast members Sope Dirisu, Richard Dormer and Andrew Koji talk to Sky News about what fans can expect.",
        "Content": "\n          Entertainment reporter\n              @Debbie_Ridgard\n Gangs Of London is one of the most violent shows on television and has gripped audiences since its release in 2020. Definitely not for the faint-hearted, it follows undercover police officer Elliott Carter, played by Sope Dirisu, working in the heart of a top-level criminal organisation after infiltrating the infamous and powerful Wallace family. Now in its third season, familiar faces return, and new villains emerge as the battle to lead the criminal underworld rages on. Note: Mild spoilers ahead \"Every year we're trying to go a bit further,\" Dirisu told Sky News. The London-born actor is the cop-turned-criminal whose life was turned upside down when his family were killed in a car accident. Season three delves into those events as Elliott takes on a new role among the gangs. \n                  will.i.am and Sean Paul on embracing artificial intelligence in music \n                 \n                  Stalker who 'terrified' Cheryl jailed - as Girls Aloud singer feared for her and her son's safety\n                 \n                  Four female news presenters settle age and sex discrimination tribunal claims with BBC\n                 \"It's a great testament to the response that we're getting from our audiences that they want more of it. People are still engaged. There are some shows that don't get to make a season three, so we don't take that for granted at all,\" he said. Set in a fictionalised version of London, akin to Gotham in the Batman universe, season three sees some new faces joining the fold. \"It does feel like Batman is going to fly in at any minute,\" laughs Richard Dormer. The Game Of Thrones actor plays Cornelius Quinn in the series, the brother of Michelle Fairley's Marian Wallace and the uncle of Peaky Blinders actor Joe Cole's character Sean Wallace. Dormer said: \"I watched episode two of season one, when they raid the Travellers camp, and I just really sat up with wow. I just thought it was brilliantly done, technically, it was just amazing to watch.\" For the actor, as much as he enjoys being part of the cast, the violence depicted is not his cup of tea as a viewer. He said: \"I'm not a big fan of it but I think technically, when it's done right, it's breathtaking. There's this kind of a thrill in it because it's safe and so over the top that you know it's not real so you can kind of wallow in it and enjoy it, you know.\" Read more from Sky News:will.i.am and Sean Paul on embracing AI in musicStalker who 'terrified' Cheryl jailed Andrew Koji takes on the mysterious assassin role, hidden by a hood and a glorious side fringe, in the upcoming episodes. \"I didn't realise the fringe was that prominent,\" he told Sky News after watching the new episodes, adding \"it's gone now, hopefully never to return\". After working on Bullet Train, Warrior, Snake Eyes and most recently the Netflix show Black Doves, Koji said getting to use his background in mixed martial arts is always something he wants to lean towards. \"This unique mix of his raid-esque style action with gripping family drama in this kind of heightened, stylised London is interesting, nuanced and different. I jumped at the opportunity.\" All eight episodes of Gangs Of London 3 will launch as a box set on Sky Atlantic and the streaming service NOW from 20 March."
    }
]