[
    {
        "title": "Texas floods: The victims and people missing that have been named so far",
        "description": "Details of those who have died and those who are missing after US flash floods are slowly emerging - with several young girls among those unaccounted for.",
        "url": "https://news.sky.com/story/texas-floods-the-victims-and-the-missing-named-so-far-13393118",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-texas-camp-mystic-flash-floods_6958476.jpg?20250706131139",
        "type": "Home",
        "Author": "Dylan Donnelly, news reporter",
        "Date Published": "2025-07-06 10:57:00",
        "Headline": "At least 79 people have died from the flooding in Texas, with an unknown number of people - including at least 10 girls from Camp Mystic in Kerr County - still missing.",
        "Content": "By Dylan Donnelly, news reporter  Details of those who have died and those who are missing after US flash floods are slowly emerging - with several young girls among those unaccounted for. At least 79 people have died from the flooding in Texas, with an unknown number of people - including 11 girls and a counsellor from Camp Mystic in Kerr County - still missing. As much as 10ins (25cm) of heavy rain fell in just a few hours overnight in central Kerr County on Friday, causing the banks of the Guadalupe River to burst at around 4am local time. Tributes to those who died, and appeals for those who are still missing, are now being shared.  Renee Smajstrla, eight Renee's uncle Shawn Salta confirmed the eight-year-old had died, and said she was one of 700 children staying at Camp Mystic. \"Renee has been found and while not the outcome we prayed for, the social media outreach likely assisted the first responders in helping to identify her so quickly,\" he said. \"We are thankful she was with her friends and having the time of her life, as evidenced by this picture from yesterday. \"She will forever be living her best life at Camp Mystic.\" Sarah Marsh, eight Mountain Brook mayor Stewart Welch confirmed the death of eight-year-old Sarah, from Alabama, who was a pupil at Cherokee Bend Elementary. \"This is an unimaginable loss for her family, her school, and our entire community,\" he said. \"Sarah's passing is a sorrow shared by all of us, and our hearts are with those who knew and loved her. \"As we grieve alongside the Marsh family, we also remember the many others affected by this tragedy.\" Eloise Peck and Lila Bonner, both nine Eloise's mother Missy Peck told local broadcaster FOX4 that her daughter and Lila were best friends and cabinmates at Camp Mystic. Writing about her daughter on Instagram, Ms Peck said: \"She lost her life in the tragic flooding... our family is grieving and processing this unimaginable loss together.\" Lila's family told NBC Dallas Fort Worth, a local affiliate network of Sky's US partner network, that they were in \"unimaginable grief\", and said: \"We ache with all who loved her.\" Janie Hunt, nine Janie's family confirmed her death to a reporter from NBC Dallas Fort Worth, who said \"her mother tells me she's devastated\". Richard 'Dick' Eastland, owner of Camp Mystic Kerr County judge Rob Kelly told the Washington Post that Mr Eastland, who owned the camp died in a helicopter on the way to a Houston hospital. Local outlet The Kerrville Daily Times reported he was killed while trying to save the girls from the flash floods. \"It doesn't surprise me at all that his last act of kindness and sacrifice was working to save the lives of campers,\" guest columnist Paige Sumner said in the Daily Times' tribute to Mr Eastland. Blair and Brooke Harber, 13 and 11 RJ Harber told CNN his daughters died during flooding in Kerr County, saying Blair \"was a gifted student and had a generous kind heart\". He added that Brooke \"was like a light in any room, people gravitated to her and she made them laugh and enjoy the moment\". He also said both his parents were still missing. Jane Ragsdale, owner of Heart O' the Hills camp On Heart O' the Hills's website, the camp confirmed it was \"right in the path of the flood\" along the Guadalupe River. While there were no campers in residence, Jane Ragsdale died. The camp said: \"We at the camp are stunned and deeply saddened by Jane's death. \"She embodied the spirit of Heart O' the Hills and was exactly the type of strong, joyful woman that the camp aimed to develop with the girls entrusted to us each summer.\" Julian Ryan, 27 Relatives of Mr Ryan told local news broadcaster KHOU 11 that he died saving his family from floodwaters in Texas Hill County. They described how he tried to smash a window to help them escape the rising water, but it cut his arm and he bled out before help could arrive. Tanya Burwick, 62 Ms Burwick was heading to work at a Walmart in the San Angelo area early Friday when the flood waters hit. When she didn't show up for work, her employer filed a missing persons report and sent another colleague to look for the 62-year-old. Police found Ms Burwick's unoccupied SUV fully submerged later that day, before locating her body on Saturday morning, \"several blocks\" away from her car. Her daughter, Lindsey Burwick, said her mother was a beloved parent, grandparent and colleague to many, adding: \"She lit up the room and had a laugh that made other people laugh.\" Read more:Deadly Texas floods: Why were people caught by surprise?Trump's 'big beautiful bill' passes final hurdle in US CongressSeven missing after explosion at fireworks warehouse Penny, Emlyn, and Madelyn 'Emmy' Jeffrey, 11 Christin Jeffrey Jones posted on Facebook that her parents Penny and Emlyn Jeffrey are missing, as well her niece Madelyn 'Emmy' Jeffrey. She said her family were in Hunt, Texas, and \"were spending the night at their cabin on the river at Casa Bonita which is now completely gone\". \"We ask for continued prayers and miracles,\" she said. \"Please share the word.\" Charlene and Mike Harber, 74 and 76 RJ Harber also told CNN that his parents, Charlene and Mike Harber, are still missing. He believes the couple have died."
    },
    {
        "title": "7/7 bombings: Stories that define the bravery of victims and responders 20 years on",
        "description": "Today marks 20 years since the 7/7 attacks, which saw four suicide bombers kill 52 people and injure 770 others on the London transport network.",
        "url": "https://news.sky.com/story/77-bombings-stories-that-define-the-bravery-of-victims-and-responders-20-years-on-13393139",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-7-july-bombings-tavistock_6956443.jpg?20250703163106",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-06 12:18:00",
        "Headline": "Two decades have passed, but for the victims' families, survivors and the responders, 7/7's impact is still being felt. Sky News spoke to some of the people profoundly affected by the infamous attacks.",
        "Content": "Today marks 20 years since the 7/7 attacks, which saw four suicide bombers kill 52 people and injure 770 others on the London transport network. The attacks on 7 July 2005 all happened within an hour of each other, with the bombers having met at Luton railway station in the morning before heading to King's Cross. Shezhad Tanweer detonated his device at Aldgate, Mohammed Sidique Khan at Edgware Road, and Germaine Lindsay between King's Cross and Russell Square - all within three minutes of 8.50am. Habib Hussain detonated his bomb on board the number 30 bus at Tavistock Square at 9.47am.  Two decades have passed, but for the victims' families, survivors and the responders, the impact is still being felt. Sky News spoke to some of the people profoundly affected by the attacks. Passenger went back to the tracks to save lives Adrian Heili was in the third carriage of the westbound Circle Line train heading towards Paddington. It was in the second carriage that Mohammad Sidique Khan blew up his device at Edgware Road, killing six people. If Adrian hadn't been there, it may well have been more. He managed to get out of the train and, having previously served as a medic in the Armed Forces, instantly made it his mission to save as many lives as possible. \"Instinct took over,\" he tells Sky News.  His bravery first brought him to Daniel Biddle, who had been blown out of the second carriage and was now trapped in a tight space between the tunnel wall and the track. Adrian remembers crawling in blood to reach Daniel, who he now calls Danny. His left leg had been blown off, his right severed from the knee down and he lost an eye, along with suffering other extensive injuries. He pinched shut the artery in Daniel's thigh to stop the bleeding until paramedics got to him. Daniel has written a book about his experiences, titled Back From The Dead, and has credited Adrian with saving his life. Adrian eventually helped first responders carry him out. Then he went back into the tunnel several times over to assist with the evacuation of 12 other people. He pays tribute to the first responders at the scene, who he says were \"amazing\". \"Myself and another gentleman by the name of Lee Hunt were the last to actually leave Edgware Road,\" he adds. \"And I remember sitting at the top of the platform on the stairs and just looking out after everyone had left.\" In his book, Daniel has been open about his struggles with PTSD after the attack. Adrian says he has had a \"very good support network\" around him to help him deal with the aftermath, and adds that talking about it rather than \"holding it in\" has been vital. \"It still plays an effect on myself, as it has with Danny,\" he says, who he has formed a close bond with. He says PTSD triggers can be all around the survivors, from police and ambulance sirens to the smell of smoke from cooking. \"But it's how we manage those triggers that define us,\" he says. On the 20-year anniversary, he adds: \"It's going to be an emotional time. But I think for me, it's going to be a time of reflection and to honour those that are not with us and those that were injured. \"They still have a voice. They have a voice with me and I'll remember it. I'll remember that day and that, for me, is very important.\" 'Instinctively, I decided to see if there was something I could do to help' You may recognise Paul Dadge from the photograph below, where he's helping a 7/7 bombing victim after she sustained severe burns to her face.  It went viral before the social media age, featuring on the front of national newspapers, and in others across the world. The Londoner, who was 28 at the time, was on his way to an office in Hammersmith where he had just got a job. He passed Edgware Road, where he saw a commotion as people rushed out of the station, and an emergency responder go in. He didn't yet know that one of the bombers had just set off the explosive in their backpack. \"Instinctively, I decided to see if there was something I could do to help,\" he told Sky News. Paul, who was a former firefighter, made an announcement to those standing outside the station, telling them to stick together if they had been affected by whatever had happened and to wait at a shop near the scene until they had spoken to a police officer. Many had black soot on their faces, he says, adding that he initially assumed it was due to a power surge. Eventually the store was evacuated, so Paul went with the victims to a nearby hotel, and it was while doing so that photographers snapped the famous photos of him comforting the victim with a gauze mask, who had been badly burned. He started noting down the names and details of those who had been injured, along with the extent of their injuries, so that he could pass them onto the emergency services. It was only three hours after the incident that Paul found out the injuries had been caused by an attack. His actions had him deemed a hero by the public. Read more:How Prevent is tackling extremism 20 years onWhy is the govt's anti-terrorism programme controversial? \"I know that after that bombing had occurred, everybody worked together as a team,\" he says. \"I think it's a bit of a British thing, really, that when we're really in trouble, we're very, very good at working together to help each other.\" He says he is still in touch with people he met on that day, including the victim he was photographed with. He also says the rest of his life has been \"carved\" by that day, and that he is now much more politically active and conscious of how emergency services respond to major incidents. He believes emergency services are \"a lot more prepared than they were on 7th July\", but adds that he still thinks they would find it \"very difficult\" to deal with an incident on the scale of the 7/7 attacks today. 'What is haunting are those screams' Sajda Mughal is a survivor of the bombing that hit a Piccadilly line train between King's Cross and Russell Square. She tells Sky News that about 10 seconds after leaving King's Cross \"there's a massive bang… which was the explosion\". \"The train shook as if it was an earthquake, and came to a sudden standstill. I fell off my chair to the ground, people fell forward, lights went out.\"  Sajda adds: \"The black smoke that was coming through, it was really intense. And then all I could hear was screams. I could hear people screaming, I could hear people shouting, someone grabbing on to me saying, 'are you okay'.\" She was \"frozen and just going into that thought process of we're going to die, and then me thinking I haven't said bye to my loved ones, I haven't got married, I haven't had kids, I haven't seen the world.\" She says that \"what is haunting from that morning are those screams and hearing 'blood, she's hurt, he's hurt'\". Sajda says that as she and others were escorted out through the carriage to King's Cross, the emergency services told them not to turn around and don't look back. She thinks that was because the rescuers didn't want them to see injured individuals, \"so it was a very, very surreal, very traumatic and emotional experience\". Sajda, who is the only known Muslim survivor of 7/7, says getting through the attack alive \"turned my life around 360\". \"I took that pain and I turned it into a positive because I didn't want that happening again. And so I left the corporate world, I left my dream to want to change hearts and minds.\" She became involved with the JAN Trust, including its work countering extremism. \"I have travelled across the UK, I've worked with thousands of mothers and Muslim mothers. I have helped to educate them on radicalisation. And I've heard from mothers whose sons… went to Syria, who joined ISIS and died.\" Calls for a public inquiry Graham Foulkes, whose son David was killed in the Edgware Road Tube bomb, wants there to be a public inquiry into what happened. He says a \"public inquiry is the only way because at a public inquiry people can be compelled to come and give evidence. At an inquest, they can just say 'no, I'm not coming' and that's what happens\".  He adds: \"The fact that we're here 20 years later, there are unanswered questions and terrorists are still slipping through, still getting past MI5, still get past MI6 and MI5, needs to be answered. \"We need to have a better system in place and by not being honest and open about what happened 20 years ago, we've got no mechanism in place at all. \"It's still the same people making the same decisions that allowed MSK [Mohammed Sidique Khan] to get through and allowed the Manchester Arena attack and the Westminster Bridge attack. It's still the same people, still the same processes. The processes need to change.\" Speaking of the last 20 years, Graham says: \"We're lucky enough to have a daughter, and we have the two most wonderful grandchildren as well. But we should have a son, and he should have his family. \"And I shouldn't be having this conversation with you. I should be at home at this time having dinner or going to the pub with David, and it's not possible to describe the feeling of having your son murdered in such a pointless way.\" 'The resilience was as inspiring as the attack was ghastly' \"Most of all, my thoughts are with the families of the 52 people who lost their lives and also the more than 700 who were injured, some of them horrifically seriously on that day,\" Metropolitan Police Commissioner Sir Mark Rowley says. He also pays tribute to those who stepped forward on the day, like Paul Dadge, and the emergency services, who he says acted \"extraordinarily\" to help others. \"They and the families and the victims - what strikes me is how they're still carrying the effects of that day through to today and for the rest of their lives,\" he adds, saying you can still see the \"heavy burden\" many of them carry 20 years on.  The commissioner, who was a senior officer in Surrey at the time, says he remembers the \"slow horror\" of watching on as investigating and reporting uncovered what had happened. \"The way everyone stepped forward, the bravery… the resilience was as inspiring as the attack was ghastly.\" He says the attacks have led to \"massive changes\" in counter-terrorism work to better protect the public. \"The first was the changes that brought policing and our security services, particularly MI5, much more close together so that we now have the closest joint operating arrangements anywhere in the world,\" he says. \"And secondly, counter-terrorism work became something that wasn't just about what was based in London and a network was built with bases in all of the regions across the country.\" He adds the unit now has a reach \"far stronger and far more effective at protecting communities than we had before that day\". Asked about those who may still feel under threat from similar attacks now, he says the public has \"extraordinary people working hard day in and day out to protect you\" and that policing and security services have strengthened due to experiences like that of the 7/7 bombings. \"The efforts of all those who were involved on that day… that all feeds through to today… [and gives us] one of the strongest and most effective preventative approaches you could possibly have,\" he says. \"But sadly we are in difficult times and no system will ever be perfect,\" he adds, but concludes by saying communities can \"be rest assured about the amazing work that's going on\"."
    },
    {
        "title": "'We'll never yield': Millions of Iranians unite in mourning",
        "description": "Under the red flag of martyrdom, they beat their chests in memory of a fallen religious leader as the cleric recounts his fate outside one of Tehran's oldest mosques.",
        "url": "https://news.sky.com/story/well-never-yield-millions-of-iranians-unite-in-mourning-13393378",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ashura-dominic-waghorn_6958956.jpg?20250706203500",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-07-06 18:50:00",
        "Headline": "People across Iran have attended mourning ceremonies to mark Ashura, one of the holiest days for Shia Muslims. The events have added significance this year, after Iran's 12-day war with Israel last month.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  Under the red flag of martyrdom, they beat their chests in memory of a fallen religious leader as the cleric recounts his fate outside one of Tehran's oldest mosques. Imam Hussein was tricked and martyred by his enemies in the seventh-century battle of Karbala. The crowd of grown men and women wept with grief as Hussein's story was retold on Sunday. Ashura is always deeply moving for the Shia faithful but this year even more so. It comes after the trauma of Israel's surprise attacks on Iran.   There was a sense of emotional release and a chance for Iranians to come together in solidarity. Ashura is also a reminder that Iran's revolutionary leaders draw much of their power from the strength of religion in this country after a conflict its enemies hoped would see those same leaders toppled. The festival has come at just the right time for its embattled government. Iran's supreme leader has appeared in public for the first time since Israel attacked his country. Ayatollah Ali Khamenei was greeted with ecstatic cheers by his followers at Ashura prayers. His supporters told us they welcomed his return. \"I was so happy that I didn't know what to do,\" said one woman. \"This caused our big enemies the United States and Israel to receive a great slap in the mouth.\" \"His appearance on TV for Ashura,\" a young man told us, \"showed that all the talk about him hiding and taking the path of peace with the United States is not true and it shows that he is holding his position strongly and steadfastly\". Read more:Defiance in Tehran as Khamenei makes appearance We had been given rare access to Iran among a handful of journalists who were let in after the 12-day war. Its scars aren't hard to find - buildings left with gaping holes where Israeli airstrikes took out members of Iran's elite, one after another. And Abbas Aslani, an analyst with close ties to the government, says there is a fear it may not be over. \"The Iranian government and the army are prepared for a new round of conflict, because they think that the other party, specifically Israel, is not to be trusted in terms of any ceasefire,\" he said. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 At the Ashura ceremony, the crowd chants, \"we'll never yield to humiliation\" - an age-old message for Iran's enemies today as they brace for the possibility of more conflict."
    },
    {
        "title": "MP recalls childhood abuse as he calls for law change to make domestic abuse a specific criminal offence",
        "description": "An MP who decided until recently to \"never speak\" about the abuse he suffered as a child has shared his harrowing story so that \"no kid has to go through\" what he did.",
        "url": "https://news.sky.com/story/mp-recalls-childhood-abuse-as-he-calls-for-law-change-to-make-domestic-abuse-a-specific-criminal-offence-13393127",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-josh-babarinde-ali-fortescue_6958522.png?20250706135908",
        "type": "Home",
        "Author": "Ali Fortescue",
        "Date Published": "2025-07-06 23:01:00",
        "Headline": "MP Josh Barabinde is calling for domestic abuse to be made a specific criminal offence, recalling his own experience of abuse as a child.",
        "Content": "\n          Political correspondent\n              @AliFortescue\n  An MP who decided until recently to \"never speak\" about the abuse he suffered as a child has shared his harrowing story so that \"no kid has to go through\" what he did. Josh Babarinde describes being physically abused by his mother's former partner from the age of four, and remembers crying himself to sleep under the covers \"hearing shouts, hearing screams and things smash\". He says he became hypervigilant growing up and felt safe at school but \"like he was treading on eggshells\" in his own home. The Eastbourne MP, who is also the Liberal Democrats' justice spokesperson, says his experience has driven his politics. He is calling on the government to stop abusers \"slipping through the net\" and being released from prison early. Opening up about his story in his twenties was \"difficult\" but looking back, Mr Babarinde says, he is \"so proud of the resilience of that kid\". The MP recently found his childhood diary containing Star Wars drawings alongside an entry he wrote from the bathroom. The diary, he recalls, wrote: \"I'm really going to try to go (to the toilet) but I can't. Oh my goodness, I'm gonna be in so much trouble, I'm going to get smacked so hard.\" Then an entry five minutes later: \"I still haven't done anything, I'm going to be in so much trouble.\" \n                  Minister tells 'gloomsters' to 'get stuffed'\n                 \n                  Another tantrum from the Labour backbenches is inevitable\n                 \n                  UK restores diplomatic ties with Syria\n                 He says reading the entry reminded him of how \"helpless\" he felt. \"It was mortifying,\" he says. \"An abuser takes away your sense of self-worth.\" The 32-year-old is calling on the government to change the law to make domestic abuse a specific criminal offence. The change would mean, he argues, abusers can no longer effectively disguise their history under other offences like assault. He says the Ministry of Justice's early release scheme, which has seen thousands of prisoners released early to ease overcrowding, has failed to exclude domestic abusers despite government promises because there is no formal categorisation for offenders. It is impossible, he argues, to know exactly how many domestic abusers are in prison currently so perpetrators are \"slipping through the net\" on early release. Read more from Sky News:Remembering the bravery of 7/7 victims and responders 20 years onMet Police chief calls for 'mega' forces in push for shake-up  Mr Babarinde says the uncertainty means victims and survivors are not able to prepare for their abuser's release. He said: \"They might need to move house or move their kids to a new school, shop in different places. All of these kind of things are so important, and so that's why that commitment the government made was so important.\" A spokesperson for the Ministry of Justice said: \"Our thoughts are with all victims of domestic abuse - it takes immense courage to speak out. \"We are building a justice system that puts victims first - strengthening support, increasing transparency, and giving people the confidence to come forward and be heard.\""
    },
    {
        "title": "Israel attacks Houthi targets at three ports and power plant in Yemen",
        "description": "Israel says its military has attacked Houthi targets at three ports and a power plant in Yemen.",
        "url": "https://news.sky.com/story/explosions-at-yemeni-port-after-israel-issues-evacuation-warning-13393408",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-houthi-supporters-yemen_6959001.jpg?20250706225516",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-06 21:00:00",
        "Headline": "Earlier in the day, a ship was reportedly set on fire after being attacked in the Red Sea. A private security company said the assault, off the coast of Yemen, resembled that of the Houthis, who are backed by Iran.",
        "Content": "Israel says its military has attacked Houthi targets at three ports and a power plant in Yemen. Defence minister Israel Katz confirmed the strikes, saying they were carried out due to repeated attacks by the Iranian-backed rebel group on Israel. Mr Katz said the Israeli military attacked the Galaxy Leader ship which he claimed was hijacked by the Houthis and was being used for \"terrorist activities in the Red Sea\".   It came after the Israel Defense Forces (IDF) issued an evacuation warning for people at Hodeidah, Ras Issa, and Salif ports - as well as the Ras al Khatib power station, which it said is controlled by Houthi rebels. The IDF said it would carry out airstrikes on those areas due to \"military activities being carried out there\". Afterwards, Mr Katz confirmed the strikes at the ports and power plant. Earlier in the day, a ship was reportedly set on fire after being attacked in the Red Sea. A private security company said the assault, off the southwest coast of Yemen, resembled that of the Houthi militant group.  It was the first such incident reported in the vital shipping corridor since mid-April. The vessel, identified as the Liberian-flagged, Greek-owned bulk carrier Magic Seas, had taken on water after being hit by sea drones, maritime security sources said. The crew later abandoned the ship. The Houthi rebels have been launching missile and drone attacks against commercial and military ships in the region in what the group's leadership called an effort to end Israel's offensive against Hamas in Gaza. Between November 2023 and January 2025, the Houthis targeted more than 100 merchant vessels with missiles and drones, sinking two of them and killing four sailors. The Houthis paused attacks in a self-imposed ceasefire until the US launched an assault against the rebels in mid-March. That ended weeks later and the Houthis have not attacked a vessel, though they have continued occasional missile attacks targeting Israel. Read more:What is the possible Gaza hostage and ceasefire deal?'We'll never yield': Millions of Iranians unite in mourning A renewed Houthi campaign against shipping could again draw in US and Western forces to the area. The ship attack comes at a sensitive moment in the Middle East. A possible ceasefire in the Israel-Hamas war hangs in the balance and Iran is weighing up whether to restart negotiations over its nuclear programme. It follows American airstrikes last month, which targeted its most-sensitive atomic sites amid an Israeli war against the Islamic Republic that ended after 12 days. How did the Houthis come to control much of Yemen? A civil war erupted in Yemen in late 2014 when the Houthis seized Sanaa. Worried by the growing influence of Shia Iran along its border, Saudi Arabia led a Western-backed coalition in March 2015, which intervened in support of the Saudi-backed government. The Houthis established control over much of the north and other large population centres, while the internationally recognised government based itself in the port city of Aden."
    },
    {
        "title": "Post Office scandal: Victims say government's control of redress schemes should be taken away",
        "description": "Post Office scandal victims are calling for redress schemes to be taken away from the government completely, ahead of the public inquiry publishing its first findings.",
        "url": "https://news.sky.com/story/post-office-scandal-victims-say-governments-control-of-redress-schemes-should-be-taken-away-13393405",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-post-office-sign_6839861.jpg?20250225230217",
        "type": "Home",
        "Author": "Adele Robinson",
        "Date Published": "2025-07-06 20:37:00",
        "Headline": "At the moment, the Department for Business and Trade administers most of the redress schemes including the Horizon Conviction Redress Scheme and the Group Litigation Order (GLO) Scheme. The Post Office is still responsible for the Horizon Shortfall scheme.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n  Post Office scandal victims are calling for redress schemes to be taken away from the government completely, ahead of the public inquiry publishing its first findings. Phase 1, which is due back on Tuesday, will report on the human impact of what happened as well as compensation schemes. \"Take (them) off the government completely,\" says Jo Hamilton OBE, a high-profile campaigner and former sub-postmistress, who was convicted of stealing from her branch in 2008. \"It's like the fox in charge of the hen house,\" she adds, \"because they were the only shareholders of Post Office\". \"So they're in it up to their necks... So why should they be in charge of giving us financial redress?\" Jo and others are hoping Sir Wyn Williams, chairman of the public statutory inquiry, will make recommendations for an independent body to take control of redress schemes. The inquiry has been examining the Post Office scandal which saw more than 700 people wrongfully convicted between 1999 and 2015. \n                  Post Office: Police identify seven suspects related to Horizon scandal\n                 \n                  Post Office scandal: Government has not done enough to ensure compensation for victims, committee of MPs finds\n                 \n                  Post Office Capture scandal: Sir Alan Bates calls for those responsible for wrongful convictions to be 'brought to account'\n                 Sub-postmasters were forced to pay back false accounting shortfalls because of the faulty IT system, Horizon. At the moment, the Department for Business and Trade administers most of the redress schemes including the Horizon Conviction Redress Scheme and the Group Litigation Order (GLO) Scheme. The Post Office is still responsible for the Horizon Shortfall scheme. Lee Castleton OBE, another victim of the scandal, was bankrupted in 2007 when he lost his case in the civil courts representing himself against the Post Office. The civil judgment against him, however, still stands. \"It's the oddest thing in the world to be an OBE, fighting for justice, while still having the original case standing against me,\" he tells Sky News. While he has received an interim payment he has not applied to a redress scheme. \"The GLO scheme - that's there on the table for me to do,\" he says, \"but I know that they would use my original case, still standing against me, in any form of redress. \"So they would still tell me repeatedly that the court found me to be liable and therefore they only acted on the court's outcome.\" He agrees with other victims who want the inquiry this week to recommend \"taking the bad piece out\" of redress schemes. \"The bad piece is the company - Post Office Limited,\" he continues, \"and the government - they need to be outside. \"When somebody goes to court, even if it's a case against the Department for Business and Trade (DBT), when they go to court DBT do not decide what the outcome is. \"A judge decides, a third party decides, a right-minded individual a fair individual, that's what needs to happen.\" Mr Castleton is also taking legal action against the Post Office and Fujitsu - the first individual victim to sue the organisations for compensation and \"vindication\" in court. \"I want to hear why it happened, to hear what I believe to be the truth, to hear what they believe to be the truth and let the judge decide.\" Neil Hudgell, a lawyer for victims, said he expects the first inquiry report this week may be \"really rather damning\" of the redress claim process describing \"inconsistencies\", \"bureaucracy\" and \"delays\". \"The over-lawyeringness of it,\" he adds, \"the minute analysis, micro-analysis of detail, the inability to give people fully the benefit of doubt. \"All those things I think are going to be part and parcel of what Sir Wynn says about compensation. \"And we would hope, not going to say expect because history's not great, we would hope it's a springboard to an acceleration, a meaningful acceleration of that process.\"  A Department for Business and Trade spokesperson said they were \"grateful\" for the inquiry's work describing \"the immeasurable suffering\" victims endured. Their statement continued: \"This government has quadrupled the total amount paid to affected postmasters to provide them with full and fair redress, with more than £1bn having now been paid to thousands of claimants. \"We will also continue to work with the Post Office, who have already written to over 24,000 postmasters, to ensure that everyone who may be eligible for redress is given the opportunity to apply for it.\""
    },
    {
        "title": "Met Police chief calls for 'mega' forces in push for major policing shake-up",
        "description": "The way policing is organised in England and Wales is decades out of date and needs a major shake-up, the head of the Metropolitan Police has said.",
        "url": "https://news.sky.com/story/met-police-chief-calls-for-mega-forces-in-push-for-major-policing-shake-up-13393111",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-sir-mark-rowley-metropolitan-police_6689558.jpg?20240918183612",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-06 10:41:00",
        "Headline": "Sir Mark Rowley says the current system of 43 county forces hasn't been fit for purpose \"for at least two decades\" and should be replaced by 12-15 mega forces better able to use modern technology and reduce costs.",
        "Content": "The way policing is organised in England and Wales is decades out of date and needs a major shake-up, the head of the Metropolitan Police has said. Metropolitan Police Commissioner Sir Mark Rowley said the current system of 43 county forces hasn't been fit for purpose \"for at least two decades\" and should be replaced by 12-15 mega forces. Those larger forces would be better able to use modern technology and would reduce \"expensive\" governance and support functions, he said. Sir Mark said the 43-force model \"was designed in the 1960s and hasn't been fit for purpose for at least two decades\". \"It hinders the effective confrontation of today's threats and stops us fully reaping the benefits of technology,\" he said. \"We need to reduce the number of forces by two-thirds, with the new bigger and fully capable regional forces supported by the best of modern technology and making better use of the limited funding available.\" Writing in The Sunday Times, he called his plans \"the first serious reform of our policing model in over 60 years\". Chancellor Rachel Reeves' decision to increase police funding by 2.3% above inflation each year in the recent spending review was \"disappointing\", he added. Read more on Sky News:51 killed in Texas floodingBritain's young extremistsOzzy Osbourne's 'final bow' Police forces have lost 3,300 officers and staff in recent years, which was \"a big hit\" from a total of more than 40,000, Mr Rowley told the BBC's Sunday With Laura Kuenssberg. He said he was \"determined to improve day-in and day-out experiences of Londoners on the streets. We can only do that if we focus ruthlessly on police work. \"When new recruits join they expect they're going to spend most of their time protecting the public, enforcing the law, catching criminals. Within a couple of years 80% of them are saying 'I spend most of my time safeguarding the vulnerable, that's critical work, but that's not the core work of policing'. \"So we need help to cut away some of these areas where other pressed public services have effectively pushed work to the police.\" He also called for football clubs, especially those in the Premier League, to pay more towards the cost of policing matches across the country, which, he said costs £70 million."
    },
    {
        "title": "What is the possible Gaza hostage and ceasefire deal - and what challenges could lie ahead?",
        "description": "An Israeli delegation is heading to Qatar for indirect talks with Hamas on a possible hostage and ceasefire deal in Gaza.",
        "url": "https://news.sky.com/story/what-is-the-possible-gaza-hostage-and-ceasefire-deal-and-what-challenges-could-lie-ahead-13393205",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-gaza-israeli-strike_6958613.jpg?20250706154245",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-06 14:25:00",
        "Headline": "The US leader has been increasing pressure on the Israeli government and Hamas to secure a permanent ceasefire and an end to the 21-month-long war in Gaza.",
        "Content": "An Israeli delegation is heading to Qatar for indirect talks with Hamas on a possible hostage and ceasefire deal in Gaza. The development comes ahead of a meeting between Israeli Prime Minister Benjamin Netanyahu and US President Donald Trump in Washington DC on Monday aimed at pushing forward peace efforts. The US leader has been increasing pressure on the Israeli government and Hamas to secure a permanent ceasefire and an end to the 21-month-long war in Gaza. Mr Trump said on Tuesday on social media that Israel had agreed \"to the necessary conditions to finalise\" a deal on a truce. And Hamas, which runs the coastal Palestinian territory, said on Friday it has responded to the US-backed proposal in a \"positive spirit\". So what is in the plan? The plan is for an initial 60-day ceasefire that would include a partial release of hostages held by the militant group in exchange for more humanitarian supplies being allowed into Gaza. \n                  Two security workers injured after grenades thrown at aid site, Gaza Humanitarian Foundation says\n                 \n                  Gaza: The man in the room acting as backchannel for Hamas in negotiations with US\n                 \n                  94 killed in Israeli strikes in Gaza, health authorities say – as UN expert calls situation ‘apocalyptic’\n                 The proposed truce calls for talks on ending the war altogether. The war in Gaza began after Hamas attacked Israel on 7 October 2023, killing 1,200 people and taking 250 others hostage. Dozens of hostages have since been released or rescued by Israeli forces, while 50 remain in captivity, including about 30 who Israel believes are dead. The proposal would reportedly see about half of the living hostages and around half of the dead hostages returned to Israel over 60 days, in five separate releases. Eight living hostages would be freed on the first day and two released on the 50th day, according to an Arab diplomat from one of the mediating countries, it is reported. Five dead hostages would be returned on the seventh day, five more on the 30th day and eight more on the 60th day. That would leave 22 hostages still held in Gaza, 10 of them believed to be alive. It is not clear whether Israel or Hamas would determine who is to be released. Hamas has sought guarantees that the initial truce would lead to a total end to the war and the withdrawal of Israeli troops from Gaza. A Hamas official has said Mr Trump has guaranteed that the ceasefire will extend beyond 60 days if necessary to reach a peace deal, but there is no confirmation from the US of such a guarantee.  Possible challenges ahead And in a sign of the potential challenges still facing the two sides, a Palestinian official from a militant group allied with Hamas said concerns remained. The concerns were over humanitarian aid, passage through the Rafah crossing in southern Israel to Egypt, and clarity over a timetable for Israeli troop withdrawals. Hamas's \"positive\" response to the proposal had slightly different wording on three issues around humanitarian aid, the status of the Israeli Defense Forces (IDF) inside Gaza and the language around guarantees beyond the 60-day ceasefire, a source with knowledge of the negotiations revealed. But the source told Sky News: \"Things are looking good.\" The Times of Israel reported Hamas has proposed three amendments to the framework. According to a source, Hamas wants the agreement to say that talks on a permanent ceasefire will continue until an agreement is reached; that aid will fully resume through mechanisms backed by the United Nations and other international aid organisations; and that the IDF withdraws to positions it maintained before the collapse of the previous ceasefire in March. Mr Netanyahu's office said in a statement that changes sought by Hamas to the ceasefire proposal were \"not acceptable to Israel\". However, his office said the delegation would still fly to Qatar to \"continue efforts to secure the return of our hostages based on the Qatari proposal that Israel agreed to\". At Ben Gurion airport in Israel before setting off for the US, Mr Netanyahu said he thought Mr Trump \"can certainly help to advance\" ceasefire efforts. Mr Netanyahu also asserted his goal of returning the remaining hostages to Israel, and said he would ensure \"the elimination of Hamas' military and governmental power\". Read more:'Two security workers injured after grenades thrown at aid site'The man in the room acting as backchannel for Hamas in negotiations with US Another potential challenge is that Mr Netanyahu has repeatedly said Hamas must be disarmed, which is a demand the militant group has so far refused to discuss. Hamas has said it is willing to free all the hostages in exchange for a full withdrawal of Israeli troops and an end to the war in Gaza. Israel rejects that offer, saying it will agree to end the war if Hamas surrenders, disarms and goes into exile - something that the group refuses. Previous negotiations have stalled over Hamas demands of guarantees that further negotiations would lead to the war's end, while Mr Netanyahu has insisted Israel would resume fighting to ensure the group's destruction."
    },
    {
        "title": "Defiance in Tehran as Khamenei makes appearance",
        "description": "They rose to their feet in ecstatic surprise, shouting \"heydar, heydar\" - a Shia victory chant.",
        "url": "https://news.sky.com/story/defiance-in-tehran-as-khamenei-makes-appearance-13393028",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-iran-supreme-leader_6958311.jpg?20250706072300",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-07-06 05:46:00",
        "Headline": "It's assumed Supreme Leader Ayatollah Ali Khamenei spent the last weeks sequestered in a bunker for his safety following numerous death threats from Israel and the US. His re-emergence suggests a return to normality.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  They rose to their feet in ecstatic surprise, shouting \"heydar, heydar\" - a Shia victory chant. This was the first public appearance of their supreme leader since Israel began attacking their country. He emerged during evening prayers in his private compound. He said nothing but looked stern and resolute as he waved to the crowd. He has spent the last weeks sequestered in a bunker, it is assumed, for his safety following numerous death threats from Israel and the US. His re-emergence suggests a return to normality and a sense of defiance that we have witnessed here on the streets of Tehran too. Earlier, we had filmed as men in black marched through the streets of the capital to the sound of mournful chants and the slow beat of drums, whipping their backs with metal flails.  This weekend they mark the Shia festival of Ashura as they have for 14 centuries. But this year has poignant significance for Iranians far more than most. The devout remember the betrayal and death of Imam Hussein as if it happened yesterday. We filmed men and women weeping as they worshipped at the Imamzadeh Saleh Shrine in northern Tehran. The armies of the Caliph Yazid killed the grandson of the Prophet Muhammad in the seventh-century Battle of Karbala. Shiite Muslims mark the anniversary every year and reflect on the virtue it celebrates, of resistance against oppression and injustice. But more so than ever in the wake of Israel and America's attacks on their country. The story is one of prevailing over adversity and deception. A sense of betrayal is keenly felt here among people and officials. Many Iranians believe they were lured into pursuing diplomacy as part of a ruse by the US. Iran believed it was making diplomatic progress in talks with America it hoped could lead to a deal. Then Israel launched its attacks and, instead of condemning them, the US joined in. Death to Israel chants resounded outside the mosque in skies which were filled for 12 days with the sounds of Israeli jets. There is a renewed sense of defiance here. One man told us: \"The lesson to be learned from Hussein is not to give in to oppression even if it is the most powerful force in the world.\" A woman was dismissive about the US president. \"I don't think about Trump, nobody likes him. He always wants to attack too many countries.\" Pictures on billboards nearby draw a line between Imam Hussein's story and current events. The seventh-century imam on horseback alongside images of modern missiles and drones from the present day. Other huge signs remember the dead. Iran says almost 1,000 people were killed in the strikes, many of them women and children. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 Officially Iran is projecting defiance but not closing the door to diplomacy. Government spokeswoman Dr Fatemeh Mohajerani told Sky News that Israel should not even think about attacking again. \"We are very strong in defence and as state officials have announced, this time Israel will receive an even stronger response compared to previous times,\" she said. \"We hope that Israel will not make such a mistake.\" But there is also a hint of conciliation: Senior Iranian officials have told Sky News that back-channel efforts are under way to explore new talks with the US. Israel had hoped its attacks could topple the Iranian leadership. That proved unfounded, the government is in control here. For many Iranians, it seems quite the opposite happened - the 12-day war has brought them closer together."
    },
    {
        "title": "Boy, four, dies after gravestone falls on him at Rawtenstall Cemetery in Lancashire, police say",
        "description": "A four-year-old boy has died after a gravestone fell on him at a cemetery, police have said.",
        "url": "https://news.sky.com/story/boy-four-dies-after-gravestone-falls-on-him-at-rawtenstall-cemetery-in-lancashire-police-say-13393178",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-lancashire-rawtensall-cemetery_6958529.jpg?20250706145221",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-06 13:28:00",
        "Headline": "Paramedics tried to save him but the boy died in the \"devastating\" incident on Saturday lunchtime, Lancashire Police said.",
        "Content": "A four-year-old boy has died after a gravestone fell on him at a cemetery, police have said. The boy was fatally injured at Rawtenstall Cemetery on Burnley Road, Haslingden, at lunchtime on Saturday, Lancashire Police said. Paramedics tried to save him but \"tragically\" the boy died in the \"devastating\" incident, the force said in a statement. Officers were called to the cemetery at 1pm \"following reports a gravestone had fallen onto a child. \"Tragically, and despite the best efforts of the emergency services, the boy sadly died. Our thoughts are with his loved ones at this devastating time.\" His death was not being treated as suspicious and a file will be sent to the coroner \"in due course\". Rossendale Borough Council posted on X on Saturday evening: \"We are deeply saddened by the tragic death of a young child at Rawtenstall Cemetery today. Our thoughts are with the family at this devastating time. \n                  Woman arrested after allegedly trying to abduct baby in Blackpool\n                 \n                  Father charged with causing death of son by dangerous driving in M6 crash\n                 \n                  Boy, 14, killed and father seriously injured as van crashes into tree on M6 near Halton\n                 Read more on Sky News:Thunderstorms for UKBritain's young extremistsOzzy Osbourne's 'final bow' Andy MacNae, Labour MP for Rossendale and Darwen, said on Facebook his thoughts went out to the family and everyone affected by the \"tragic incident\". Local councillor Liz McInnes also wrote on Facebook it was \"a terrible tragedy. My heartfelt and deepest sympathies to the family of this poor boy. The whole of Rawtenstall is grieving\"."
    },
    {
        "title": "7/7 bombings: Stories that define the bravery of victims and responders 20 years on",
        "description": "Today marks 20 years since the 7/7 attacks, which saw four suicide bombers kill 52 people and injure 770 others on the London transport network.",
        "url": "https://news.sky.com/story/77-bombings-stories-that-define-the-bravery-of-victims-and-responders-20-years-on-13393139",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-7-july-bombings-tavistock_6956443.jpg?20250703163106",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-06 12:18:00",
        "Headline": "Two decades have passed, but for the victims' families, survivors and the responders, 7/7's impact is still being felt. Sky News spoke to some of the people profoundly affected by the infamous attacks.",
        "Content": "Today marks 20 years since the 7/7 attacks, which saw four suicide bombers kill 52 people and injure 770 others on the London transport network. The attacks on 7 July 2005 all happened within an hour of each other, with the bombers having met at Luton railway station in the morning before heading to King's Cross. Shezhad Tanweer detonated his device at Aldgate, Mohammed Sidique Khan at Edgware Road, and Germaine Lindsay between King's Cross and Russell Square - all within three minutes of 8.50am. Habib Hussain detonated his bomb on board the number 30 bus at Tavistock Square at 9.47am.  Two decades have passed, but for the victims' families, survivors and the responders, the impact is still being felt. Sky News spoke to some of the people profoundly affected by the attacks. Passenger went back to the tracks to save lives Adrian Heili was in the third carriage of the westbound Circle Line train heading towards Paddington. It was in the second carriage that Mohammad Sidique Khan blew up his device at Edgware Road, killing six people. If Adrian hadn't been there, it may well have been more. He managed to get out of the train and, having previously served as a medic in the Armed Forces, instantly made it his mission to save as many lives as possible. \"Instinct took over,\" he tells Sky News.  His bravery first brought him to Daniel Biddle, who had been blown out of the second carriage and was now trapped in a tight space between the tunnel wall and the track. Adrian remembers crawling in blood to reach Daniel, who he now calls Danny. His left leg had been blown off, his right severed from the knee down and he lost an eye, along with suffering other extensive injuries. He pinched shut the artery in Daniel's thigh to stop the bleeding until paramedics got to him. Daniel has written a book about his experiences, titled Back From The Dead, and has credited Adrian with saving his life. Adrian eventually helped first responders carry him out. Then he went back into the tunnel several times over to assist with the evacuation of 12 other people. He pays tribute to the first responders at the scene, who he says were \"amazing\". \"Myself and another gentleman by the name of Lee Hunt were the last to actually leave Edgware Road,\" he adds. \"And I remember sitting at the top of the platform on the stairs and just looking out after everyone had left.\" In his book, Daniel has been open about his struggles with PTSD after the attack. Adrian says he has had a \"very good support network\" around him to help him deal with the aftermath, and adds that talking about it rather than \"holding it in\" has been vital. \"It still plays an effect on myself, as it has with Danny,\" he says, who he has formed a close bond with. He says PTSD triggers can be all around the survivors, from police and ambulance sirens to the smell of smoke from cooking. \"But it's how we manage those triggers that define us,\" he says. On the 20-year anniversary, he adds: \"It's going to be an emotional time. But I think for me, it's going to be a time of reflection and to honour those that are not with us and those that were injured. \"They still have a voice. They have a voice with me and I'll remember it. I'll remember that day and that, for me, is very important.\" 'Instinctively, I decided to see if there was something I could do to help' You may recognise Paul Dadge from the photograph below, where he's helping a 7/7 bombing victim after she sustained severe burns to her face.  It went viral before the social media age, featuring on the front of national newspapers, and in others across the world. The Londoner, who was 28 at the time, was on his way to an office in Hammersmith where he had just got a job. He passed Edgware Road, where he saw a commotion as people rushed out of the station, and an emergency responder go in. He didn't yet know that one of the bombers had just set off the explosive in their backpack. \"Instinctively, I decided to see if there was something I could do to help,\" he told Sky News. Paul, who was a former firefighter, made an announcement to those standing outside the station, telling them to stick together if they had been affected by whatever had happened and to wait at a shop near the scene until they had spoken to a police officer. Many had black soot on their faces, he says, adding that he initially assumed it was due to a power surge. Eventually the store was evacuated, so Paul went with the victims to a nearby hotel, and it was while doing so that photographers snapped the famous photos of him comforting the victim with a gauze mask, who had been badly burned. He started noting down the names and details of those who had been injured, along with the extent of their injuries, so that he could pass them onto the emergency services. It was only three hours after the incident that Paul found out the injuries had been caused by an attack. His actions had him deemed a hero by the public. Read more:How Prevent is tackling extremism 20 years onWhy is the govt's anti-terrorism programme controversial? \"I know that after that bombing had occurred, everybody worked together as a team,\" he says. \"I think it's a bit of a British thing, really, that when we're really in trouble, we're very, very good at working together to help each other.\" He says he is still in touch with people he met on that day, including the victim he was photographed with. He also says the rest of his life has been \"carved\" by that day, and that he is now much more politically active and conscious of how emergency services respond to major incidents. He believes emergency services are \"a lot more prepared than they were on 7th July\", but adds that he still thinks they would find it \"very difficult\" to deal with an incident on the scale of the 7/7 attacks today. 'What is haunting are those screams' Sajda Mughal is a survivor of the bombing that hit a Piccadilly line train between King's Cross and Russell Square. She tells Sky News that about 10 seconds after leaving King's Cross \"there's a massive bang… which was the explosion\". \"The train shook as if it was an earthquake, and came to a sudden standstill. I fell off my chair to the ground, people fell forward, lights went out.\"  Sajda adds: \"The black smoke that was coming through, it was really intense. And then all I could hear was screams. I could hear people screaming, I could hear people shouting, someone grabbing on to me saying, 'are you okay'.\" She was \"frozen and just going into that thought process of we're going to die, and then me thinking I haven't said bye to my loved ones, I haven't got married, I haven't had kids, I haven't seen the world.\" She says that \"what is haunting from that morning are those screams and hearing 'blood, she's hurt, he's hurt'\". Sajda says that as she and others were escorted out through the carriage to King's Cross, the emergency services told them not to turn around and don't look back. She thinks that was because the rescuers didn't want them to see injured individuals, \"so it was a very, very surreal, very traumatic and emotional experience\". Sajda, who is the only known Muslim survivor of 7/7, says getting through the attack alive \"turned my life around 360\". \"I took that pain and I turned it into a positive because I didn't want that happening again. And so I left the corporate world, I left my dream to want to change hearts and minds.\" She became involved with the JAN Trust, including its work countering extremism. \"I have travelled across the UK, I've worked with thousands of mothers and Muslim mothers. I have helped to educate them on radicalisation. And I've heard from mothers whose sons… went to Syria, who joined ISIS and died.\" Calls for a public inquiry Graham Foulkes, whose son David was killed in the Edgware Road Tube bomb, wants there to be a public inquiry into what happened. He says a \"public inquiry is the only way because at a public inquiry people can be compelled to come and give evidence. At an inquest, they can just say 'no, I'm not coming' and that's what happens\".  He adds: \"The fact that we're here 20 years later, there are unanswered questions and terrorists are still slipping through, still getting past MI5, still get past MI6 and MI5, needs to be answered. \"We need to have a better system in place and by not being honest and open about what happened 20 years ago, we've got no mechanism in place at all. \"It's still the same people making the same decisions that allowed MSK [Mohammed Sidique Khan] to get through and allowed the Manchester Arena attack and the Westminster Bridge attack. It's still the same people, still the same processes. The processes need to change.\" Speaking of the last 20 years, Graham says: \"We're lucky enough to have a daughter, and we have the two most wonderful grandchildren as well. But we should have a son, and he should have his family. \"And I shouldn't be having this conversation with you. I should be at home at this time having dinner or going to the pub with David, and it's not possible to describe the feeling of having your son murdered in such a pointless way.\" 'The resilience was as inspiring as the attack was ghastly' \"Most of all, my thoughts are with the families of the 52 people who lost their lives and also the more than 700 who were injured, some of them horrifically seriously on that day,\" Metropolitan Police Commissioner Sir Mark Rowley says. He also pays tribute to those who stepped forward on the day, like Paul Dadge, and the emergency services, who he says acted \"extraordinarily\" to help others. \"They and the families and the victims - what strikes me is how they're still carrying the effects of that day through to today and for the rest of their lives,\" he adds, saying you can still see the \"heavy burden\" many of them carry 20 years on.  The commissioner, who was a senior officer in Surrey at the time, says he remembers the \"slow horror\" of watching on as investigating and reporting uncovered what had happened. \"The way everyone stepped forward, the bravery… the resilience was as inspiring as the attack was ghastly.\" He says the attacks have led to \"massive changes\" in counter-terrorism work to better protect the public. \"The first was the changes that brought policing and our security services, particularly MI5, much more close together so that we now have the closest joint operating arrangements anywhere in the world,\" he says. \"And secondly, counter-terrorism work became something that wasn't just about what was based in London and a network was built with bases in all of the regions across the country.\" He adds the unit now has a reach \"far stronger and far more effective at protecting communities than we had before that day\". Asked about those who may still feel under threat from similar attacks now, he says the public has \"extraordinary people working hard day in and day out to protect you\" and that policing and security services have strengthened due to experiences like that of the 7/7 bombings. \"The efforts of all those who were involved on that day… that all feeds through to today… [and gives us] one of the strongest and most effective preventative approaches you could possibly have,\" he says. \"But sadly we are in difficult times and no system will ever be perfect,\" he adds, but concludes by saying communities can \"be rest assured about the amazing work that's going on\"."
    },
    {
        "title": "MP recalls childhood abuse as he calls for law change to make domestic abuse a specific criminal offence",
        "description": "An MP who decided until recently to \"never speak\" about the abuse he suffered as a child has shared his harrowing story so that \"no kid has to go through\" what he did.",
        "url": "https://news.sky.com/story/mp-recalls-childhood-abuse-as-he-calls-for-law-change-to-make-domestic-abuse-a-specific-criminal-offence-13393127",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-josh-babarinde-ali-fortescue_6958522.png?20250706135908",
        "type": "UK",
        "Author": "Ali Fortescue",
        "Date Published": "2025-07-06 23:01:00",
        "Headline": "MP Josh Barabinde is calling for domestic abuse to be made a specific criminal offence, recalling his own experience of abuse as a child.",
        "Content": "\n          Political correspondent\n              @AliFortescue\n  An MP who decided until recently to \"never speak\" about the abuse he suffered as a child has shared his harrowing story so that \"no kid has to go through\" what he did. Josh Babarinde describes being physically abused by his mother's former partner from the age of four, and remembers crying himself to sleep under the covers \"hearing shouts, hearing screams and things smash\". He says he became hypervigilant growing up and felt safe at school but \"like he was treading on eggshells\" in his own home. The Eastbourne MP, who is also the Liberal Democrats' justice spokesperson, says his experience has driven his politics. He is calling on the government to stop abusers \"slipping through the net\" and being released from prison early. Opening up about his story in his twenties was \"difficult\" but looking back, Mr Babarinde says, he is \"so proud of the resilience of that kid\". The MP recently found his childhood diary containing Star Wars drawings alongside an entry he wrote from the bathroom. The diary, he recalls, wrote: \"I'm really going to try to go (to the toilet) but I can't. Oh my goodness, I'm gonna be in so much trouble, I'm going to get smacked so hard.\" Then an entry five minutes later: \"I still haven't done anything, I'm going to be in so much trouble.\" \n                  Minister tells 'gloomsters' to 'get stuffed'\n                 \n                  Another tantrum from the Labour backbenches is inevitable\n                 \n                  UK restores diplomatic ties with Syria\n                 He says reading the entry reminded him of how \"helpless\" he felt. \"It was mortifying,\" he says. \"An abuser takes away your sense of self-worth.\" The 32-year-old is calling on the government to change the law to make domestic abuse a specific criminal offence. The change would mean, he argues, abusers can no longer effectively disguise their history under other offences like assault. He says the Ministry of Justice's early release scheme, which has seen thousands of prisoners released early to ease overcrowding, has failed to exclude domestic abusers despite government promises because there is no formal categorisation for offenders. It is impossible, he argues, to know exactly how many domestic abusers are in prison currently so perpetrators are \"slipping through the net\" on early release. Read more from Sky News:Remembering the bravery of 7/7 victims and responders 20 years onMet Police chief calls for 'mega' forces in push for shake-up  Mr Babarinde says the uncertainty means victims and survivors are not able to prepare for their abuser's release. He said: \"They might need to move house or move their kids to a new school, shop in different places. All of these kind of things are so important, and so that's why that commitment the government made was so important.\" A spokesperson for the Ministry of Justice said: \"Our thoughts are with all victims of domestic abuse - it takes immense courage to speak out. \"We are building a justice system that puts victims first - strengthening support, increasing transparency, and giving people the confidence to come forward and be heard.\""
    },
    {
        "title": "Post Office scandal: Victims say government's control of redress schemes should be taken away",
        "description": "Post Office scandal victims are calling for redress schemes to be taken away from the government completely, ahead of the public inquiry publishing its first findings.",
        "url": "https://news.sky.com/story/post-office-scandal-victims-say-governments-control-of-redress-schemes-should-be-taken-away-13393405",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-post-office-sign_6839861.jpg?20250225230217",
        "type": "UK",
        "Author": "Adele Robinson",
        "Date Published": "2025-07-06 20:37:00",
        "Headline": "At the moment, the Department for Business and Trade administers most of the redress schemes including the Horizon Conviction Redress Scheme and the Group Litigation Order (GLO) Scheme. The Post Office is still responsible for the Horizon Shortfall scheme.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n  Post Office scandal victims are calling for redress schemes to be taken away from the government completely, ahead of the public inquiry publishing its first findings. Phase 1, which is due back on Tuesday, will report on the human impact of what happened as well as compensation schemes. \"Take (them) off the government completely,\" says Jo Hamilton OBE, a high-profile campaigner and former sub-postmistress, who was convicted of stealing from her branch in 2008. \"It's like the fox in charge of the hen house,\" she adds, \"because they were the only shareholders of Post Office\". \"So they're in it up to their necks... So why should they be in charge of giving us financial redress?\" Jo and others are hoping Sir Wyn Williams, chairman of the public statutory inquiry, will make recommendations for an independent body to take control of redress schemes. The inquiry has been examining the Post Office scandal which saw more than 700 people wrongfully convicted between 1999 and 2015. \n                  Post Office: Police identify seven suspects related to Horizon scandal\n                 \n                  Post Office scandal: Government has not done enough to ensure compensation for victims, committee of MPs finds\n                 \n                  Post Office Capture scandal: Sir Alan Bates calls for those responsible for wrongful convictions to be 'brought to account'\n                 Sub-postmasters were forced to pay back false accounting shortfalls because of the faulty IT system, Horizon. At the moment, the Department for Business and Trade administers most of the redress schemes including the Horizon Conviction Redress Scheme and the Group Litigation Order (GLO) Scheme. The Post Office is still responsible for the Horizon Shortfall scheme. Lee Castleton OBE, another victim of the scandal, was bankrupted in 2007 when he lost his case in the civil courts representing himself against the Post Office. The civil judgment against him, however, still stands. \"It's the oddest thing in the world to be an OBE, fighting for justice, while still having the original case standing against me,\" he tells Sky News. While he has received an interim payment he has not applied to a redress scheme. \"The GLO scheme - that's there on the table for me to do,\" he says, \"but I know that they would use my original case, still standing against me, in any form of redress. \"So they would still tell me repeatedly that the court found me to be liable and therefore they only acted on the court's outcome.\" He agrees with other victims who want the inquiry this week to recommend \"taking the bad piece out\" of redress schemes. \"The bad piece is the company - Post Office Limited,\" he continues, \"and the government - they need to be outside. \"When somebody goes to court, even if it's a case against the Department for Business and Trade (DBT), when they go to court DBT do not decide what the outcome is. \"A judge decides, a third party decides, a right-minded individual a fair individual, that's what needs to happen.\" Mr Castleton is also taking legal action against the Post Office and Fujitsu - the first individual victim to sue the organisations for compensation and \"vindication\" in court. \"I want to hear why it happened, to hear what I believe to be the truth, to hear what they believe to be the truth and let the judge decide.\" Neil Hudgell, a lawyer for victims, said he expects the first inquiry report this week may be \"really rather damning\" of the redress claim process describing \"inconsistencies\", \"bureaucracy\" and \"delays\". \"The over-lawyeringness of it,\" he adds, \"the minute analysis, micro-analysis of detail, the inability to give people fully the benefit of doubt. \"All those things I think are going to be part and parcel of what Sir Wynn says about compensation. \"And we would hope, not going to say expect because history's not great, we would hope it's a springboard to an acceleration, a meaningful acceleration of that process.\"  A Department for Business and Trade spokesperson said they were \"grateful\" for the inquiry's work describing \"the immeasurable suffering\" victims endured. Their statement continued: \"This government has quadrupled the total amount paid to affected postmasters to provide them with full and fair redress, with more than £1bn having now been paid to thousands of claimants. \"We will also continue to work with the Post Office, who have already written to over 24,000 postmasters, to ensure that everyone who may be eligible for redress is given the opportunity to apply for it.\""
    },
    {
        "title": "Boy, four, dies after gravestone falls on him at Rawtenstall Cemetery in Lancashire, police say",
        "description": "A four-year-old boy has died after a gravestone fell on him at a cemetery, police have said.",
        "url": "https://news.sky.com/story/boy-four-dies-after-gravestone-falls-on-him-at-rawtenstall-cemetery-in-lancashire-police-say-13393178",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-lancashire-rawtensall-cemetery_6958529.jpg?20250706145221",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-06 13:28:00",
        "Headline": "Paramedics tried to save him but the boy died in the \"devastating\" incident on Saturday lunchtime, Lancashire Police said.",
        "Content": "A four-year-old boy has died after a gravestone fell on him at a cemetery, police have said. The boy was fatally injured at Rawtenstall Cemetery on Burnley Road, Haslingden, at lunchtime on Saturday, Lancashire Police said. Paramedics tried to save him but \"tragically\" the boy died in the \"devastating\" incident, the force said in a statement. Officers were called to the cemetery at 1pm \"following reports a gravestone had fallen onto a child. \"Tragically, and despite the best efforts of the emergency services, the boy sadly died. Our thoughts are with his loved ones at this devastating time.\" His death was not being treated as suspicious and a file will be sent to the coroner \"in due course\". Rossendale Borough Council posted on X on Saturday evening: \"We are deeply saddened by the tragic death of a young child at Rawtenstall Cemetery today. Our thoughts are with the family at this devastating time. \n                  Woman arrested after allegedly trying to abduct baby in Blackpool\n                 \n                  Father charged with causing death of son by dangerous driving in M6 crash\n                 \n                  Boy, 14, killed and father seriously injured as van crashes into tree on M6 near Halton\n                 Read more on Sky News:Thunderstorms for UKBritain's young extremistsOzzy Osbourne's 'final bow' Andy MacNae, Labour MP for Rossendale and Darwen, said on Facebook his thoughts went out to the family and everyone affected by the \"tragic incident\". Local councillor Liz McInnes also wrote on Facebook it was \"a terrible tragedy. My heartfelt and deepest sympathies to the family of this poor boy. The whole of Rawtenstall is grieving\"."
    },
    {
        "title": "Met Police chief calls for 'mega' forces in push for major policing shake-up",
        "description": "The way policing is organised in England and Wales is decades out of date and needs a major shake-up, the head of the Metropolitan Police has said.",
        "url": "https://news.sky.com/story/met-police-chief-calls-for-mega-forces-in-push-for-major-policing-shake-up-13393111",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-sir-mark-rowley-metropolitan-police_6689558.jpg?20240918183612",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-06 10:41:00",
        "Headline": "Sir Mark Rowley says the current system of 43 county forces hasn't been fit for purpose \"for at least two decades\" and should be replaced by 12-15 mega forces better able to use modern technology and reduce costs.",
        "Content": "The way policing is organised in England and Wales is decades out of date and needs a major shake-up, the head of the Metropolitan Police has said. Metropolitan Police Commissioner Sir Mark Rowley said the current system of 43 county forces hasn't been fit for purpose \"for at least two decades\" and should be replaced by 12-15 mega forces. Those larger forces would be better able to use modern technology and would reduce \"expensive\" governance and support functions, he said. Sir Mark said the 43-force model \"was designed in the 1960s and hasn't been fit for purpose for at least two decades\". \"It hinders the effective confrontation of today's threats and stops us fully reaping the benefits of technology,\" he said. \"We need to reduce the number of forces by two-thirds, with the new bigger and fully capable regional forces supported by the best of modern technology and making better use of the limited funding available.\" Writing in The Sunday Times, he called his plans \"the first serious reform of our policing model in over 60 years\". Chancellor Rachel Reeves' decision to increase police funding by 2.3% above inflation each year in the recent spending review was \"disappointing\", he added. Read more on Sky News:51 killed in Texas floodingBritain's young extremistsOzzy Osbourne's 'final bow' Police forces have lost 3,300 officers and staff in recent years, which was \"a big hit\" from a total of more than 40,000, Mr Rowley told the BBC's Sunday With Laura Kuenssberg. He said he was \"determined to improve day-in and day-out experiences of Londoners on the streets. We can only do that if we focus ruthlessly on police work. \"When new recruits join they expect they're going to spend most of their time protecting the public, enforcing the law, catching criminals. Within a couple of years 80% of them are saying 'I spend most of my time safeguarding the vulnerable, that's critical work, but that's not the core work of policing'. \"So we need help to cut away some of these areas where other pressed public services have effectively pushed work to the police.\" He also called for football clubs, especially those in the Premier League, to pay more towards the cost of policing matches across the country, which, he said costs £70 million."
    },
    {
        "title": "Another tantrum from the Labour backbenches is inevitable",
        "description": "In common with many parents across the country, here's a conversation that I have with my young daughter on a semi-regular basis (bear with me, this will take on some political relevance eventually).",
        "url": "https://news.sky.com/story/another-tantrum-from-the-labour-backbenches-is-inevitable-13393136",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-rachel-reeves-sir-keir-starmer_6957623.jpg?20250705095908",
        "type": "UK",
        "Author": "Rob Powell",
        "Date Published": "2025-07-06 11:45:00",
        "Headline": "After Labour backbenchers forced a welfare U-turn, it will be harder for ministers to hold the line on all their other demands.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n In common with many parents across the country, here's a conversation that I have with my young daughter on a semi-regular basis (bear with me, this will take on some political relevance eventually). Me: \"So it's 15 minutes until your bedtime, you can either have a little bit of TV or do a jigsaw, not both.\" Daughter: \"Ummmm, I want to watch TV.\" Me: \"That's fine, but it's bed after that, you can't do a jigsaw as well.\" Fast-forward 15 minutes. Me: \"Right, TV off now please, bedtime.\" (Pause) Daughter: \"I want to do a jigsaw.\" Now replace me with the government, the TV and jigsaw options with axing welfare cuts and scrapping the two-child cap, and my daughter with rebellious backbenchers. Politics latest: Former Labour leader calls for wealth tax on assets above £10m  That is the tension currently present between Downing Street and Labour MPs. And my initial ultimatum is the messaging being pumped out from the government this weekend. In essence: you've had your welfare U-turn, so there's no money left for the two-child cap to go as well. As an aside - and before my inbox fills with angry emails lambasting me for using such a crude metaphor for policies that fundamentally alter the lives of some of the most vulnerable in society - yes, I hear you, and that's part of my point.  For many in Labour, this approach feels like the lives of their constituents are being used in a childish game of horse-trading. So what can be done? Well, the government could change the rules. Altering the fiscal rules is - and will likely remain - an extremely unlikely solution. But as it happens, one of Labour's proverbial grandparents has just popped round with a different suggestion.  A wealth tax, Lord Neil Kinnock says, is the necessary outcome of the economic restrictions the party has placed on itself. Ever the Labour storyteller, Lord Kinnock believes this would allow the government to craft a more compelling narrative about whose side this administration is on. That could be valuable, given one of the big gripes from many backbench critics is that they still don't really understand what this prime minister stands for - and by extension, what all these \"difficult decisions\" are in aid of. The downside is whether it will actually raise much money.  The super-rich may have lots of assets to take a slice from, but they also have expensive lawyers ready to find novel ways to keep their client's cash away from the prying eyes of the state. Or, of course, they could just leave - as many are doing already. In the short term, the future is a bit easier to predict. If Downing Street is indeed now saying there is no money to scrap the two-child cap (after heavy briefing in the opposite direction just weeks ago), an almighty tantrum from the backbenches is inevitable. And as every parent knows, the more you give in, the harder it becomes to hold the line."
    },
    {
        "title": "Man charged with murder after pensioner found dead in Streatham ",
        "description": "A man has been charged with murder after an 85-year-old man was found dead at a property in south London, police have said.",
        "url": "https://news.sky.com/story/man-charged-with-murder-after-pensioner-found-dead-in-streatham-13393202",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-churchmore-road-streatham_6957767.jpg?20250705121906",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-06 14:11:00",
        "Headline": "Police say the victim, who has not been named, was found with a number of injuries and pronounced dead at the scene.",
        "Content": "A man has been charged with murder after an 85-year-old man was found dead at a property in south London, police have said. Officers were called to an address in Streatham by the London Ambulance Service at around 1pm on Friday after reports that an elderly man had suffered serious injuries. The victim, who has not been named, was found with a number of injuries and pronounced dead at the scene in Churchmore Road, the Metropolitan Police said.   The force added: \"Despite the best efforts of emergency services, the man was sadly pronounced dead at the scene. \"A post-mortem examination will take place in due course. The victim's next of kin have been made aware and are being supported by specialist officers.\" Read more on Sky News:Thunderstorms for UKOzzy Osbourne's 'final bow' Amithraz Balgobin, 36, of Woodbourne Avenue, Lambeth, has since been charged with murder and possession of Class A and Class B drugs. He was arrested nearby and charged on Sunday, police said. He was remanded in custody to appear at Bromley Magistrates' Court on Monday."
    },
    {
        "title": "Israel attacks Houthi targets at three ports and power plant in Yemen",
        "description": "Israel says its military has attacked Houthi targets at three ports and a power plant in Yemen.",
        "url": "https://news.sky.com/story/explosions-at-yemeni-port-after-israel-issues-evacuation-warning-13393408",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-houthi-supporters-yemen_6959001.jpg?20250706225516",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-06 21:00:00",
        "Headline": "Earlier in the day, a ship was reportedly set on fire after being attacked in the Red Sea. A private security company said the assault, off the coast of Yemen, resembled that of the Houthis, who are backed by Iran.",
        "Content": "Israel says its military has attacked Houthi targets at three ports and a power plant in Yemen. Defence minister Israel Katz confirmed the strikes, saying they were carried out due to repeated attacks by the Iranian-backed rebel group on Israel. Mr Katz said the Israeli military attacked the Galaxy Leader ship which he claimed was hijacked by the Houthis and was being used for \"terrorist activities in the Red Sea\".   It came after the Israel Defense Forces (IDF) issued an evacuation warning for people at Hodeidah, Ras Issa, and Salif ports - as well as the Ras al Khatib power station, which it said is controlled by Houthi rebels. The IDF said it would carry out airstrikes on those areas due to \"military activities being carried out there\". Afterwards, Mr Katz confirmed the strikes at the ports and power plant. Earlier in the day, a ship was reportedly set on fire after being attacked in the Red Sea. A private security company said the assault, off the southwest coast of Yemen, resembled that of the Houthi militant group.  It was the first such incident reported in the vital shipping corridor since mid-April. The vessel, identified as the Liberian-flagged, Greek-owned bulk carrier Magic Seas, had taken on water after being hit by sea drones, maritime security sources said. The crew later abandoned the ship. The Houthi rebels have been launching missile and drone attacks against commercial and military ships in the region in what the group's leadership called an effort to end Israel's offensive against Hamas in Gaza. Between November 2023 and January 2025, the Houthis targeted more than 100 merchant vessels with missiles and drones, sinking two of them and killing four sailors. The Houthis paused attacks in a self-imposed ceasefire until the US launched an assault against the rebels in mid-March. That ended weeks later and the Houthis have not attacked a vessel, though they have continued occasional missile attacks targeting Israel. Read more:What is the possible Gaza hostage and ceasefire deal?'We'll never yield': Millions of Iranians unite in mourning A renewed Houthi campaign against shipping could again draw in US and Western forces to the area. The ship attack comes at a sensitive moment in the Middle East. A possible ceasefire in the Israel-Hamas war hangs in the balance and Iran is weighing up whether to restart negotiations over its nuclear programme. It follows American airstrikes last month, which targeted its most-sensitive atomic sites amid an Israeli war against the Islamic Republic that ended after 12 days. How did the Houthis come to control much of Yemen? A civil war erupted in Yemen in late 2014 when the Houthis seized Sanaa. Worried by the growing influence of Shia Iran along its border, Saudi Arabia led a Western-backed coalition in March 2015, which intervened in support of the Saudi-backed government. The Houthis established control over much of the north and other large population centres, while the internationally recognised government based itself in the port city of Aden."
    },
    {
        "title": "'We'll never yield': Millions of Iranians unite in mourning",
        "description": "Under the red flag of martyrdom, they beat their chests in memory of a fallen religious leader as the cleric recounts his fate outside one of Tehran's oldest mosques.",
        "url": "https://news.sky.com/story/well-never-yield-millions-of-iranians-unite-in-mourning-13393378",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ashura-dominic-waghorn_6958956.jpg?20250706203500",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-07-06 18:50:00",
        "Headline": "People across Iran have attended mourning ceremonies to mark Ashura, one of the holiest days for Shia Muslims. The events have added significance this year, after Iran's 12-day war with Israel last month.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  Under the red flag of martyrdom, they beat their chests in memory of a fallen religious leader as the cleric recounts his fate outside one of Tehran's oldest mosques. Imam Hussein was tricked and martyred by his enemies in the seventh-century battle of Karbala. The crowd of grown men and women wept with grief as Hussein's story was retold on Sunday. Ashura is always deeply moving for the Shia faithful but this year even more so. It comes after the trauma of Israel's surprise attacks on Iran.   There was a sense of emotional release and a chance for Iranians to come together in solidarity. Ashura is also a reminder that Iran's revolutionary leaders draw much of their power from the strength of religion in this country after a conflict its enemies hoped would see those same leaders toppled. The festival has come at just the right time for its embattled government. Iran's supreme leader has appeared in public for the first time since Israel attacked his country. Ayatollah Ali Khamenei was greeted with ecstatic cheers by his followers at Ashura prayers. His supporters told us they welcomed his return. \"I was so happy that I didn't know what to do,\" said one woman. \"This caused our big enemies the United States and Israel to receive a great slap in the mouth.\" \"His appearance on TV for Ashura,\" a young man told us, \"showed that all the talk about him hiding and taking the path of peace with the United States is not true and it shows that he is holding his position strongly and steadfastly\". Read more:Defiance in Tehran as Khamenei makes appearance We had been given rare access to Iran among a handful of journalists who were let in after the 12-day war. Its scars aren't hard to find - buildings left with gaping holes where Israeli airstrikes took out members of Iran's elite, one after another. And Abbas Aslani, an analyst with close ties to the government, says there is a fear it may not be over. \"The Iranian government and the army are prepared for a new round of conflict, because they think that the other party, specifically Israel, is not to be trusted in terms of any ceasefire,\" he said. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 At the Ashura ceremony, the crowd chants, \"we'll never yield to humiliation\" - an age-old message for Iran's enemies today as they brace for the possibility of more conflict."
    },
    {
        "title": "What is the possible Gaza hostage and ceasefire deal - and what challenges could lie ahead?",
        "description": "An Israeli delegation is heading to Qatar for indirect talks with Hamas on a possible hostage and ceasefire deal in Gaza.",
        "url": "https://news.sky.com/story/what-is-the-possible-gaza-hostage-and-ceasefire-deal-and-what-challenges-could-lie-ahead-13393205",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-gaza-israeli-strike_6958613.jpg?20250706154245",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-06 14:25:00",
        "Headline": "The US leader has been increasing pressure on the Israeli government and Hamas to secure a permanent ceasefire and an end to the 21-month-long war in Gaza.",
        "Content": "An Israeli delegation is heading to Qatar for indirect talks with Hamas on a possible hostage and ceasefire deal in Gaza. The development comes ahead of a meeting between Israeli Prime Minister Benjamin Netanyahu and US President Donald Trump in Washington DC on Monday aimed at pushing forward peace efforts. The US leader has been increasing pressure on the Israeli government and Hamas to secure a permanent ceasefire and an end to the 21-month-long war in Gaza. Mr Trump said on Tuesday on social media that Israel had agreed \"to the necessary conditions to finalise\" a deal on a truce. And Hamas, which runs the coastal Palestinian territory, said on Friday it has responded to the US-backed proposal in a \"positive spirit\". So what is in the plan? The plan is for an initial 60-day ceasefire that would include a partial release of hostages held by the militant group in exchange for more humanitarian supplies being allowed into Gaza. \n                  Two security workers injured after grenades thrown at aid site, Gaza Humanitarian Foundation says\n                 \n                  Gaza: The man in the room acting as backchannel for Hamas in negotiations with US\n                 \n                  94 killed in Israeli strikes in Gaza, health authorities say – as UN expert calls situation ‘apocalyptic’\n                 The proposed truce calls for talks on ending the war altogether. The war in Gaza began after Hamas attacked Israel on 7 October 2023, killing 1,200 people and taking 250 others hostage. Dozens of hostages have since been released or rescued by Israeli forces, while 50 remain in captivity, including about 30 who Israel believes are dead. The proposal would reportedly see about half of the living hostages and around half of the dead hostages returned to Israel over 60 days, in five separate releases. Eight living hostages would be freed on the first day and two released on the 50th day, according to an Arab diplomat from one of the mediating countries, it is reported. Five dead hostages would be returned on the seventh day, five more on the 30th day and eight more on the 60th day. That would leave 22 hostages still held in Gaza, 10 of them believed to be alive. It is not clear whether Israel or Hamas would determine who is to be released. Hamas has sought guarantees that the initial truce would lead to a total end to the war and the withdrawal of Israeli troops from Gaza. A Hamas official has said Mr Trump has guaranteed that the ceasefire will extend beyond 60 days if necessary to reach a peace deal, but there is no confirmation from the US of such a guarantee.  Possible challenges ahead And in a sign of the potential challenges still facing the two sides, a Palestinian official from a militant group allied with Hamas said concerns remained. The concerns were over humanitarian aid, passage through the Rafah crossing in southern Israel to Egypt, and clarity over a timetable for Israeli troop withdrawals. Hamas's \"positive\" response to the proposal had slightly different wording on three issues around humanitarian aid, the status of the Israeli Defense Forces (IDF) inside Gaza and the language around guarantees beyond the 60-day ceasefire, a source with knowledge of the negotiations revealed. But the source told Sky News: \"Things are looking good.\" The Times of Israel reported Hamas has proposed three amendments to the framework. According to a source, Hamas wants the agreement to say that talks on a permanent ceasefire will continue until an agreement is reached; that aid will fully resume through mechanisms backed by the United Nations and other international aid organisations; and that the IDF withdraws to positions it maintained before the collapse of the previous ceasefire in March. Mr Netanyahu's office said in a statement that changes sought by Hamas to the ceasefire proposal were \"not acceptable to Israel\". However, his office said the delegation would still fly to Qatar to \"continue efforts to secure the return of our hostages based on the Qatari proposal that Israel agreed to\". At Ben Gurion airport in Israel before setting off for the US, Mr Netanyahu said he thought Mr Trump \"can certainly help to advance\" ceasefire efforts. Mr Netanyahu also asserted his goal of returning the remaining hostages to Israel, and said he would ensure \"the elimination of Hamas' military and governmental power\". Read more:'Two security workers injured after grenades thrown at aid site'The man in the room acting as backchannel for Hamas in negotiations with US Another potential challenge is that Mr Netanyahu has repeatedly said Hamas must be disarmed, which is a demand the militant group has so far refused to discuss. Hamas has said it is willing to free all the hostages in exchange for a full withdrawal of Israeli troops and an end to the war in Gaza. Israel rejects that offer, saying it will agree to end the war if Hamas surrenders, disarms and goes into exile - something that the group refuses. Previous negotiations have stalled over Hamas demands of guarantees that further negotiations would lead to the war's end, while Mr Netanyahu has insisted Israel would resume fighting to ensure the group's destruction."
    },
    {
        "title": "Defiance in Tehran as Khamenei makes appearance",
        "description": "They rose to their feet in ecstatic surprise, shouting \"heydar, heydar\" - a Shia victory chant.",
        "url": "https://news.sky.com/story/defiance-in-tehran-as-khamenei-makes-appearance-13393028",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-iran-supreme-leader_6958311.jpg?20250706072300",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-07-06 05:46:00",
        "Headline": "It's assumed Supreme Leader Ayatollah Ali Khamenei spent the last weeks sequestered in a bunker for his safety following numerous death threats from Israel and the US. His re-emergence suggests a return to normality.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  They rose to their feet in ecstatic surprise, shouting \"heydar, heydar\" - a Shia victory chant. This was the first public appearance of their supreme leader since Israel began attacking their country. He emerged during evening prayers in his private compound. He said nothing but looked stern and resolute as he waved to the crowd. He has spent the last weeks sequestered in a bunker, it is assumed, for his safety following numerous death threats from Israel and the US. His re-emergence suggests a return to normality and a sense of defiance that we have witnessed here on the streets of Tehran too. Earlier, we had filmed as men in black marched through the streets of the capital to the sound of mournful chants and the slow beat of drums, whipping their backs with metal flails.  This weekend they mark the Shia festival of Ashura as they have for 14 centuries. But this year has poignant significance for Iranians far more than most. The devout remember the betrayal and death of Imam Hussein as if it happened yesterday. We filmed men and women weeping as they worshipped at the Imamzadeh Saleh Shrine in northern Tehran. The armies of the Caliph Yazid killed the grandson of the Prophet Muhammad in the seventh-century Battle of Karbala. Shiite Muslims mark the anniversary every year and reflect on the virtue it celebrates, of resistance against oppression and injustice. But more so than ever in the wake of Israel and America's attacks on their country. The story is one of prevailing over adversity and deception. A sense of betrayal is keenly felt here among people and officials. Many Iranians believe they were lured into pursuing diplomacy as part of a ruse by the US. Iran believed it was making diplomatic progress in talks with America it hoped could lead to a deal. Then Israel launched its attacks and, instead of condemning them, the US joined in. Death to Israel chants resounded outside the mosque in skies which were filled for 12 days with the sounds of Israeli jets. There is a renewed sense of defiance here. One man told us: \"The lesson to be learned from Hussein is not to give in to oppression even if it is the most powerful force in the world.\" A woman was dismissive about the US president. \"I don't think about Trump, nobody likes him. He always wants to attack too many countries.\" Pictures on billboards nearby draw a line between Imam Hussein's story and current events. The seventh-century imam on horseback alongside images of modern missiles and drones from the present day. Other huge signs remember the dead. Iran says almost 1,000 people were killed in the strikes, many of them women and children. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 Officially Iran is projecting defiance but not closing the door to diplomacy. Government spokeswoman Dr Fatemeh Mohajerani told Sky News that Israel should not even think about attacking again. \"We are very strong in defence and as state officials have announced, this time Israel will receive an even stronger response compared to previous times,\" she said. \"We hope that Israel will not make such a mistake.\" But there is also a hint of conciliation: Senior Iranian officials have told Sky News that back-channel efforts are under way to explore new talks with the US. Israel had hoped its attacks could topple the Iranian leadership. That proved unfounded, the government is in control here. For many Iranians, it seems quite the opposite happened - the 12-day war has brought them closer together."
    },
    {
        "title": "UK restores diplomatic ties with Syria",
        "description": "The UK has re-established diplomatic ties with Syria, David Lammy has said, as he made the first visit to the country by a British minister for 14 years.",
        "url": "https://news.sky.com/story/uk-restores-diplomatic-ties-with-syria-13393025",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-david-lammy-syria-ahmed-al-sharaa_6958309.jpg?20250706063502",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-06 04:53:00",
        "Headline": "The UK has already lifted a number of sanctions against Syria since the fall of Bashar al Assad's regime, and has suggested the rebel group HTS could be removed from proscribed terror lists.",
        "Content": " The UK has re-established diplomatic ties with Syria, David Lammy has said, as he made the first visit to the country by a British minister for 14 years. The foreign secretary visited Damascus and met with interim president Ahmed al Sharaa, also the leader of the rebel group Hayat Tahrir al-Sham (HTS), and foreign minister Asaad al Shaibani. It marks the latest diplomatic move since Bashar al Assad's regime was toppled by rebel groups led by HTS in December. In a statement, Mr Lammy said a \"stable Syria is in the UK's interests\" and added: \"I've seen first-hand the remarkable progress Syrians have made in rebuilding their lives and their country. \"After over a decade of conflict, there is renewed hope for the Syrian people. \"The UK is re-establishing diplomatic relations because it is in our interests to support the new government to deliver their commitment to build a stable, more secure and prosperous future for all Syrians.\" The Foreign, Commonwealth and Development Office has also announced a £94.5m support package for urgent humanitarian aid and to support the country's long-term recovery, after a number of British sanctions against the country were lifted in April. While HTS is still classified as a proscribed terror group, Sir Keir Starmer said last year that it could be removed from the list. The Syrian president's office also said on Saturday that the president and Mr Lammy discussed co-operation, as well as the latest developments in the Middle East. Read more:Wildfires break out in Greece, Turkey and SyriaPutin 'mocking Trump's peace efforts', Poland saysHamas gives 'positive' response to ceasefire proposal Since Assad fled Syria in December, a transitional government headed by Mr al Sharaa was announced in March and a number of western countries have restored ties. In May, US President Donald Trump said the United States would lift long-standing sanctions on Syria and normalise relations during a speech at the US-Saudi investment conference.  He said he wanted to give the country \"a chance at peace\" and added: \"There is a new government that will hopefully succeed. \"I say good luck, Syria. Show us something special.\""
    },
    {
        "title": "Dalai Lama turns 90: Worshippers including Richard Gere travel to Himalayas to celebrate",
        "description": "The Dalai Lama, the spiritual leader of Tibetan Buddhists, turns 90 on Sunday after a week of celebrations.",
        "url": "https://news.sky.com/story/dalai-lama-turns-90-worshippers-including-richard-gere-travel-to-himalayas-to-celebrate-13393016",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-dalai-lama_6958303.jpg?20250706050758",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-06 03:32:00",
        "Headline": "Events for the Dalai Lama's birthday already started on Monday, which marked his 90th birthday in the Tibetan calendar, six days before his birthday in the Gregorian calendar on Sunday.",
        "Content": " The Dalai Lama, the spiritual leader of Tibetan Buddhists, turns 90 on Sunday after a week of celebrations. Thousands of worshippers from around the world have travelled to Dharamshala, the small Indian town in the foothills of the Himalayas where the Dalai Lama lives, to mark the occasion. This includes long-time follower and Hollywood star Richard Gere, who is set to speak during the celebrations for the Nobel laureate, who is regarded as one of the world's most influential religious leaders and worshipped by millions of Tibetan Buddhists as the living manifestation of Chenrezig, the Buddhist god of compassion. Hundreds of red-robed monks and nuns braved incessant rain on Sunday as they poured through the narrow streets of Dharamshala towards the main Dalai Lama temple, where the spiritual leader will hold a speech. Events for the Dalai Lama's birthday already started on Monday, which marked his 90th birthday in the Tibetan calendar, six days before his birthday in the Gregorian calendar on Sunday. On Saturday, the Dalai Lama said he hoped to live for decades more, until the age of 130. Tenzin Gyatso, who became the 14th reincarnation of the Dalai Lama in 1940, fled his native Tibet in 1959 following a failed uprising against Chinese rule and took shelter in India, along with hundreds of thousands of Tibetans. \n                  Dalai Lama says he plans to reincarnate - but how is a successor chosen and why is it controversial?\n                 \n                  Dalai Lama says his successor to be born outside China - but Beijing says it is their decision\n                 \n                  Tibetan leader: 'Unfair' to criticise Dalai Lama for kissing boy and asking him to 'suck my tongue'\n                 China has labelled the Dalai Lama a separatist and has sought to bring Tibetan Buddhism back under its control. During his week of celebrations, the Dalai Lama explicitly said he will have a successor after his death, ending years of speculation over whether he would be the last Tibetan spiritual leader. 👉 Listen to Sky News Daily on your podcast app 👈 Read more:How is a successor for the Dalai Lama chosen?Dalai Lama says successor to be born outside China He riled China again by saying the next Dalai Lama should be found in line with Buddhist traditions, signalling that China should stay away from the process of identifying his successor, but Beijing said that the succession would have to be approved by its leaders. Seeking to counter the rise of China, the US has called on Beijing to stop interfering in the succession of the Dalai Lama and other Tibetan Buddhist lamas."
    },
    {
        "title": "Texas floods: The victims and people missing that have been named so far",
        "description": "Details of those who have died and those who are missing after US flash floods are slowly emerging - with several young girls among those unaccounted for.",
        "url": "https://news.sky.com/story/texas-floods-the-victims-and-the-missing-named-so-far-13393118",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-texas-camp-mystic-flash-floods_6958476.jpg?20250706131139",
        "type": "US",
        "Author": "Dylan Donnelly, news reporter",
        "Date Published": "2025-07-06 10:57:00",
        "Headline": "At least 79 people have died from the flooding in Texas, with an unknown number of people - including at least 10 girls from Camp Mystic in Kerr County - still missing.",
        "Content": "By Dylan Donnelly, news reporter  Details of those who have died and those who are missing after US flash floods are slowly emerging - with several young girls among those unaccounted for. At least 79 people have died from the flooding in Texas, with an unknown number of people - including 11 girls and a counsellor from Camp Mystic in Kerr County - still missing. As much as 10ins (25cm) of heavy rain fell in just a few hours overnight in central Kerr County on Friday, causing the banks of the Guadalupe River to burst at around 4am local time. Tributes to those who died, and appeals for those who are still missing, are now being shared.  Renee Smajstrla, eight Renee's uncle Shawn Salta confirmed the eight-year-old had died, and said she was one of 700 children staying at Camp Mystic. \"Renee has been found and while not the outcome we prayed for, the social media outreach likely assisted the first responders in helping to identify her so quickly,\" he said. \"We are thankful she was with her friends and having the time of her life, as evidenced by this picture from yesterday. \"She will forever be living her best life at Camp Mystic.\" Sarah Marsh, eight Mountain Brook mayor Stewart Welch confirmed the death of eight-year-old Sarah, from Alabama, who was a pupil at Cherokee Bend Elementary. \"This is an unimaginable loss for her family, her school, and our entire community,\" he said. \"Sarah's passing is a sorrow shared by all of us, and our hearts are with those who knew and loved her. \"As we grieve alongside the Marsh family, we also remember the many others affected by this tragedy.\" Eloise Peck and Lila Bonner, both nine Eloise's mother Missy Peck told local broadcaster FOX4 that her daughter and Lila were best friends and cabinmates at Camp Mystic. Writing about her daughter on Instagram, Ms Peck said: \"She lost her life in the tragic flooding... our family is grieving and processing this unimaginable loss together.\" Lila's family told NBC Dallas Fort Worth, a local affiliate network of Sky's US partner network, that they were in \"unimaginable grief\", and said: \"We ache with all who loved her.\" Janie Hunt, nine Janie's family confirmed her death to a reporter from NBC Dallas Fort Worth, who said \"her mother tells me she's devastated\". Richard 'Dick' Eastland, owner of Camp Mystic Kerr County judge Rob Kelly told the Washington Post that Mr Eastland, who owned the camp died in a helicopter on the way to a Houston hospital. Local outlet The Kerrville Daily Times reported he was killed while trying to save the girls from the flash floods. \"It doesn't surprise me at all that his last act of kindness and sacrifice was working to save the lives of campers,\" guest columnist Paige Sumner said in the Daily Times' tribute to Mr Eastland. Blair and Brooke Harber, 13 and 11 RJ Harber told CNN his daughters died during flooding in Kerr County, saying Blair \"was a gifted student and had a generous kind heart\". He added that Brooke \"was like a light in any room, people gravitated to her and she made them laugh and enjoy the moment\". He also said both his parents were still missing. Jane Ragsdale, owner of Heart O' the Hills camp On Heart O' the Hills's website, the camp confirmed it was \"right in the path of the flood\" along the Guadalupe River. While there were no campers in residence, Jane Ragsdale died. The camp said: \"We at the camp are stunned and deeply saddened by Jane's death. \"She embodied the spirit of Heart O' the Hills and was exactly the type of strong, joyful woman that the camp aimed to develop with the girls entrusted to us each summer.\" Julian Ryan, 27 Relatives of Mr Ryan told local news broadcaster KHOU 11 that he died saving his family from floodwaters in Texas Hill County. They described how he tried to smash a window to help them escape the rising water, but it cut his arm and he bled out before help could arrive. Tanya Burwick, 62 Ms Burwick was heading to work at a Walmart in the San Angelo area early Friday when the flood waters hit. When she didn't show up for work, her employer filed a missing persons report and sent another colleague to look for the 62-year-old. Police found Ms Burwick's unoccupied SUV fully submerged later that day, before locating her body on Saturday morning, \"several blocks\" away from her car. Her daughter, Lindsey Burwick, said her mother was a beloved parent, grandparent and colleague to many, adding: \"She lit up the room and had a laugh that made other people laugh.\" Read more:Deadly Texas floods: Why were people caught by surprise?Trump's 'big beautiful bill' passes final hurdle in US CongressSeven missing after explosion at fireworks warehouse Penny, Emlyn, and Madelyn 'Emmy' Jeffrey, 11 Christin Jeffrey Jones posted on Facebook that her parents Penny and Emlyn Jeffrey are missing, as well her niece Madelyn 'Emmy' Jeffrey. She said her family were in Hunt, Texas, and \"were spending the night at their cabin on the river at Casa Bonita which is now completely gone\". \"We ask for continued prayers and miracles,\" she said. \"Please share the word.\" Charlene and Mike Harber, 74 and 76 RJ Harber also told CNN that his parents, Charlene and Mike Harber, are still missing. He believes the couple have died."
    },
    {
        "title": "Deadly Texas floods: What were the warnings?",
        "description": "Questions have been raised over extreme weather warnings in Texas, after heavy rain caused fatal flash floods along the Guadalupe River.",
        "url": "https://news.sky.com/story/deadly-texas-floods-what-were-the-warnings-13393057",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-texas-floods_6958439.jpg?20250706111243",
        "type": "US",
        "Author": "Dylan Donnelly, news reporter",
        "Date Published": "2025-07-06 07:54:00",
        "Headline": "Local and federal officials have been criticised after flash floods struck across Texas, killing at least 69 people and leaving 11 girls from a camp missing.",
        "Content": "By Dylan Donnelly, news reporter  Questions have been raised over extreme weather warnings in Texas, after heavy rain caused fatal flash floods along the Guadalupe River. At least 69 people have died from the flooding in Texas, with an unknown number of people - including 11 girls from Camp Mystic in Kerr County - still missing. As rescue teams continue to search for the missing, local and federal officials have come under fire over their flood preparations and about why those along the river weren't warned of the risks sooner. What happened? As much as 10ins (25cm) of heavy rain fell in just a few hours overnight in central Kerr County on Friday, causing the banks of the Guadalupe River to burst at around 4am local time. Homes and vehicles were swept away by the downpour - equivalent to months' worth of rain - while 27 girls staying at Camp Mystic, a Christian summer camp along the river, went missing when the fast-rising floodwaters hit. The death toll stands at:• At least 43 people, including 15 children and 28 adults, in Kerr County,• One person in Kendall County,• At least four people in Travis County,• At least two in Burnet County,• And one person in the city of San Angelo.  What flood warnings were there?  Private forecasting company AccuWeather said it and the National Weather Service (NWS) sent warnings about potential flash flooding hours before it began, urging people to move to higher ground and evacuate flood-prone areas. The NWS also issued flash flood emergencies - a rare alert notifying of imminent danger - at 4.23am local time. In a statement, AccuWeather said that \"these warnings should have provided officials with ample time to evacuate camps such as Camp Mystic and get people to safety\". It also called Texas Hill County one of the most flash-flood-prone areas of the US because of its terrain and many water crossings. However, chief of the Texas Division of Emergency Management Nim Kidd said that one NWS forecast earlier in the week had called for up to six inches of rain. \"It did not predict the amount of rain that we saw,\" he said.  Were they enough?  Locals have told various news agencies that while there had been phone alerts late into the night, forecasts headed into Friday evening did not predict the extreme conditions. Christopher Flowers, who was staying at a friend's house along the river when the flooding started, told the Reuters news agency: \"What they need is some kind of external system, like a tornado warning that tells people to get out now.\" Kerrville resident Darryl Huffman told Sky's US partner network NBC News that he did not believe the storm would pose such danger before its arrival. \"I looked out the window and it was barely sprinkling outside,\" he said, \"so I had no indication that the river was going to be right outside my driveway\". Jonathan Porter, chief meteorologist at AccuWeather, said it appeared evacuations and other proactive measures could have been undertaken to reduce the risk of fatalities. He said in a statement: \"People, businesses, and governments should take action based on Flash Flood Warnings that are issued, regardless of the rainfall amounts that have occurred or are forecast.\" Separately, the NWS's union told NBC News the agency's offices in central Texas were well-staffed and had issued timely warnings, \"giving preliminary lead times of more than three hours before warning criteria were met\". What have officials said? Local and federal officials have said they had not expected such an intense downpour of rain and insisted that no one saw the flood potential coming. Kerr County Judge Rob Kelly, the county's top elected official, said: \"We know we get rain. We know the river rises. But nobody saw this coming.\" \"We have floods all the time. This is the most dangerous river valley in the United States,\" he said, adding: \"We had no reason to believe this was going to be anything like what's happened here. None whatsoever.\" Mr Kelly separately noted that while the county considered a flood warning system along the river that would have functioned like a tornado warning siren about six or seven years ago, \"the public reeled at the cost\". Read more:Trump's 'big beautiful bill' passes final hurdle in CongressElon Musk says he's created his own political party At a news conference with the Texas governor, Homeland Security secretary Kristi Noem said on Saturday that \"everybody knows that the weather is extremely difficult to predict\" before saying \"we have all wanted more time and more warning and more alerts and more notification\" from the NWS. She said a \"moderate\" flood watch issued on Thursday by the NWS had not accurately predicted the extreme rainfall and said the Trump administration was working to upgrade their technology. Will forecasting get better?  While Ms Noem said technology for the NWS would be upgraded, the White House has previously been criticised after Donald Trump's administration ordered 800 job cuts at the National Oceanic and Atmospheric Administration (NOAA) - the parent organisation of the NWS. A 30% cut to its budget is also in the pipeline, subject to approval by Congress. Professor Costa Samaras, who worked on energy policy at the White House under President Joe Biden, said NOAA had been in the middle of developing new flood maps for neighbourhoods and that cuts to NOAA were \"devastating\"."
    },
    {
        "title": "Post Office scandal: Victims say government's control of redress schemes should be taken away",
        "description": "Post Office scandal victims are calling for redress schemes to be taken away from the government completely, ahead of the public inquiry publishing its first findings.",
        "url": "https://news.sky.com/story/post-office-scandal-victims-say-governments-control-of-redress-schemes-should-be-taken-away-13393405",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-post-office-sign_6839861.jpg?20250225230217",
        "type": "Business",
        "Author": "Adele Robinson",
        "Date Published": "2025-07-06 20:37:00",
        "Headline": "At the moment, the Department for Business and Trade administers most of the redress schemes including the Horizon Conviction Redress Scheme and the Group Litigation Order (GLO) Scheme. The Post Office is still responsible for the Horizon Shortfall scheme.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n  Post Office scandal victims are calling for redress schemes to be taken away from the government completely, ahead of the public inquiry publishing its first findings. Phase 1, which is due back on Tuesday, will report on the human impact of what happened as well as compensation schemes. \"Take (them) off the government completely,\" says Jo Hamilton OBE, a high-profile campaigner and former sub-postmistress, who was convicted of stealing from her branch in 2008. \"It's like the fox in charge of the hen house,\" she adds, \"because they were the only shareholders of Post Office\". \"So they're in it up to their necks... So why should they be in charge of giving us financial redress?\" Jo and others are hoping Sir Wyn Williams, chairman of the public statutory inquiry, will make recommendations for an independent body to take control of redress schemes. The inquiry has been examining the Post Office scandal which saw more than 700 people wrongfully convicted between 1999 and 2015. \n                  Post Office: Police identify seven suspects related to Horizon scandal\n                 \n                  Post Office scandal: Government has not done enough to ensure compensation for victims, committee of MPs finds\n                 \n                  Post Office Capture scandal: Sir Alan Bates calls for those responsible for wrongful convictions to be 'brought to account'\n                 Sub-postmasters were forced to pay back false accounting shortfalls because of the faulty IT system, Horizon. At the moment, the Department for Business and Trade administers most of the redress schemes including the Horizon Conviction Redress Scheme and the Group Litigation Order (GLO) Scheme. The Post Office is still responsible for the Horizon Shortfall scheme. Lee Castleton OBE, another victim of the scandal, was bankrupted in 2007 when he lost his case in the civil courts representing himself against the Post Office. The civil judgment against him, however, still stands. \"It's the oddest thing in the world to be an OBE, fighting for justice, while still having the original case standing against me,\" he tells Sky News. While he has received an interim payment he has not applied to a redress scheme. \"The GLO scheme - that's there on the table for me to do,\" he says, \"but I know that they would use my original case, still standing against me, in any form of redress. \"So they would still tell me repeatedly that the court found me to be liable and therefore they only acted on the court's outcome.\" He agrees with other victims who want the inquiry this week to recommend \"taking the bad piece out\" of redress schemes. \"The bad piece is the company - Post Office Limited,\" he continues, \"and the government - they need to be outside. \"When somebody goes to court, even if it's a case against the Department for Business and Trade (DBT), when they go to court DBT do not decide what the outcome is. \"A judge decides, a third party decides, a right-minded individual a fair individual, that's what needs to happen.\" Mr Castleton is also taking legal action against the Post Office and Fujitsu - the first individual victim to sue the organisations for compensation and \"vindication\" in court. \"I want to hear why it happened, to hear what I believe to be the truth, to hear what they believe to be the truth and let the judge decide.\" Neil Hudgell, a lawyer for victims, said he expects the first inquiry report this week may be \"really rather damning\" of the redress claim process describing \"inconsistencies\", \"bureaucracy\" and \"delays\". \"The over-lawyeringness of it,\" he adds, \"the minute analysis, micro-analysis of detail, the inability to give people fully the benefit of doubt. \"All those things I think are going to be part and parcel of what Sir Wynn says about compensation. \"And we would hope, not going to say expect because history's not great, we would hope it's a springboard to an acceleration, a meaningful acceleration of that process.\"  A Department for Business and Trade spokesperson said they were \"grateful\" for the inquiry's work describing \"the immeasurable suffering\" victims endured. Their statement continued: \"This government has quadrupled the total amount paid to affected postmasters to provide them with full and fair redress, with more than £1bn having now been paid to thousands of claimants. \"We will also continue to work with the Post Office, who have already written to over 24,000 postmasters, to ensure that everyone who may be eligible for redress is given the opportunity to apply for it.\""
    },
    {
        "title": "Digital wallet provider Hyperlayer closes in on £30m funding boost",
        "description": "A British fintech which counts Standard Life among its key clients is close to finalising one of the industry's biggest funding rounds so far this year.",
        "url": "https://news.sky.com/story/digital-wallet-provider-hyperlayer-closes-in-on-16330m-funding-boost-13393076",
        "image_url": "https://e3.365dm.com/23/01/1920x1080/skynews-rob-rooney-rooney_6027809.jpg?20230118115122",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-06 08:44:00",
        "Headline": "The fintech, which is working with Standard Life on a consumer money app aimed at people approaching retirement, is close to finalising a round led by CDAM valuing it at about £160m, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A British fintech which counts Standard Life among its key clients is close to finalising one of the industry's biggest funding rounds so far this year. Sky News understands that Hyperlayer, which is run by the former Morgan Stanley executive Rob Rooney, is lining up a major equity injection led by CDAM, a UK-based investment firm, and several new institutional investors. City sources said this weekend that the new capital from CDAM and other backers could total at least £30m. The funding round is expected to take place at a post-money valuation of about £160m. Hyperlayer, which operates a consumer-facing digital wallet called Hyperjar, intends to use the new funding as growth capital to finance the development of new partnerships with global banks and asset managers. The company provides smart account technology on existing client infrastructure, and is said to work with a number of the world's 10 largest banks - although it has not publicly disclosed their identities. Its work with Standard Life involves the future launch of a consumer money app aimed at people approaching or in early retirement. Hyperlayer's consumer-facing platform sees customers organise their money in what the company calls \"digital jam jars\", enabling them to earn rewards which give them access to partner brands such as Asda, Morrisons and Starbucks. IKEA and the John Lewis Partnership are among the other merchant partners with which Hyperlayer is working to develop distinctive loyalty-based initiatives for its financial institution clients. Read more from Sky News:Octopus Energy sparks £10bn demerger of tech arm KrakenWhat happens to your pension when you die? Founded in 2006 by Adam Chamberlain and Scott Davies, CDAM has $1.5bn in assets under management and is an experienced investor in financial services technology. Mr Davies has had a seat on Hyperlayer's board for several years. Mr Rooney, who was a prominent Wall Street executive for years, ultimately serving as Morgan Stanley's technology operations, joined the company as CEO in 2023. The new capital injection led by CDAM is understood to be subject to approval by Hyperlayer's shareholders. Hyperlayer declined to comment on Sunday."
    },
    {
        "title": "MP recalls childhood abuse as he calls for law change to make domestic abuse a specific criminal offence",
        "description": "An MP who decided until recently to \"never speak\" about the abuse he suffered as a child has shared his harrowing story so that \"no kid has to go through\" what he did.",
        "url": "https://news.sky.com/story/mp-recalls-childhood-abuse-as-he-calls-for-law-change-to-make-domestic-abuse-a-specific-criminal-offence-13393127",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-josh-babarinde-ali-fortescue_6958522.png?20250706135908",
        "type": "Politics",
        "Author": "Ali Fortescue",
        "Date Published": "2025-07-06 23:01:00",
        "Headline": "MP Josh Barabinde is calling for domestic abuse to be made a specific criminal offence, recalling his own experience of abuse as a child.",
        "Content": "\n          Political correspondent\n              @AliFortescue\n  An MP who decided until recently to \"never speak\" about the abuse he suffered as a child has shared his harrowing story so that \"no kid has to go through\" what he did. Josh Babarinde describes being physically abused by his mother's former partner from the age of four, and remembers crying himself to sleep under the covers \"hearing shouts, hearing screams and things smash\". He says he became hypervigilant growing up and felt safe at school but \"like he was treading on eggshells\" in his own home. The Eastbourne MP, who is also the Liberal Democrats' justice spokesperson, says his experience has driven his politics. He is calling on the government to stop abusers \"slipping through the net\" and being released from prison early. Opening up about his story in his twenties was \"difficult\" but looking back, Mr Babarinde says, he is \"so proud of the resilience of that kid\". The MP recently found his childhood diary containing Star Wars drawings alongside an entry he wrote from the bathroom. The diary, he recalls, wrote: \"I'm really going to try to go (to the toilet) but I can't. Oh my goodness, I'm gonna be in so much trouble, I'm going to get smacked so hard.\" Then an entry five minutes later: \"I still haven't done anything, I'm going to be in so much trouble.\" \n                  Minister tells 'gloomsters' to 'get stuffed'\n                 \n                  Another tantrum from the Labour backbenches is inevitable\n                 \n                  UK restores diplomatic ties with Syria\n                 He says reading the entry reminded him of how \"helpless\" he felt. \"It was mortifying,\" he says. \"An abuser takes away your sense of self-worth.\" The 32-year-old is calling on the government to change the law to make domestic abuse a specific criminal offence. The change would mean, he argues, abusers can no longer effectively disguise their history under other offences like assault. He says the Ministry of Justice's early release scheme, which has seen thousands of prisoners released early to ease overcrowding, has failed to exclude domestic abusers despite government promises because there is no formal categorisation for offenders. It is impossible, he argues, to know exactly how many domestic abusers are in prison currently so perpetrators are \"slipping through the net\" on early release. Read more from Sky News:Remembering the bravery of 7/7 victims and responders 20 years onMet Police chief calls for 'mega' forces in push for shake-up  Mr Babarinde says the uncertainty means victims and survivors are not able to prepare for their abuser's release. He said: \"They might need to move house or move their kids to a new school, shop in different places. All of these kind of things are so important, and so that's why that commitment the government made was so important.\" A spokesperson for the Ministry of Justice said: \"Our thoughts are with all victims of domestic abuse - it takes immense courage to speak out. \"We are building a justice system that puts victims first - strengthening support, increasing transparency, and giving people the confidence to come forward and be heard.\""
    },
    {
        "title": "Another tantrum from the Labour backbenches is inevitable",
        "description": "In common with many parents across the country, here's a conversation that I have with my young daughter on a semi-regular basis (bear with me, this will take on some political relevance eventually).",
        "url": "https://news.sky.com/story/another-tantrum-from-the-labour-backbenches-is-inevitable-13393136",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-rachel-reeves-sir-keir-starmer_6957623.jpg?20250705095908",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-07-06 11:45:00",
        "Headline": "After Labour backbenchers forced a welfare U-turn, it will be harder for ministers to hold the line on all their other demands.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n In common with many parents across the country, here's a conversation that I have with my young daughter on a semi-regular basis (bear with me, this will take on some political relevance eventually). Me: \"So it's 15 minutes until your bedtime, you can either have a little bit of TV or do a jigsaw, not both.\" Daughter: \"Ummmm, I want to watch TV.\" Me: \"That's fine, but it's bed after that, you can't do a jigsaw as well.\" Fast-forward 15 minutes. Me: \"Right, TV off now please, bedtime.\" (Pause) Daughter: \"I want to do a jigsaw.\" Now replace me with the government, the TV and jigsaw options with axing welfare cuts and scrapping the two-child cap, and my daughter with rebellious backbenchers. Politics latest: Former Labour leader calls for wealth tax on assets above £10m  That is the tension currently present between Downing Street and Labour MPs. And my initial ultimatum is the messaging being pumped out from the government this weekend. In essence: you've had your welfare U-turn, so there's no money left for the two-child cap to go as well. As an aside - and before my inbox fills with angry emails lambasting me for using such a crude metaphor for policies that fundamentally alter the lives of some of the most vulnerable in society - yes, I hear you, and that's part of my point.  For many in Labour, this approach feels like the lives of their constituents are being used in a childish game of horse-trading. So what can be done? Well, the government could change the rules. Altering the fiscal rules is - and will likely remain - an extremely unlikely solution. But as it happens, one of Labour's proverbial grandparents has just popped round with a different suggestion.  A wealth tax, Lord Neil Kinnock says, is the necessary outcome of the economic restrictions the party has placed on itself. Ever the Labour storyteller, Lord Kinnock believes this would allow the government to craft a more compelling narrative about whose side this administration is on. That could be valuable, given one of the big gripes from many backbench critics is that they still don't really understand what this prime minister stands for - and by extension, what all these \"difficult decisions\" are in aid of. The downside is whether it will actually raise much money.  The super-rich may have lots of assets to take a slice from, but they also have expensive lawyers ready to find novel ways to keep their client's cash away from the prying eyes of the state. Or, of course, they could just leave - as many are doing already. In the short term, the future is a bit easier to predict. If Downing Street is indeed now saying there is no money to scrap the two-child cap (after heavy briefing in the opposite direction just weeks ago), an almighty tantrum from the backbenches is inevitable. And as every parent knows, the more you give in, the harder it becomes to hold the line."
    },
    {
        "title": "UK restores diplomatic ties with Syria",
        "description": "The UK has re-established diplomatic ties with Syria, David Lammy has said, as he made the first visit to the country by a British minister for 14 years.",
        "url": "https://news.sky.com/story/uk-restores-diplomatic-ties-with-syria-13393025",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-david-lammy-syria-ahmed-al-sharaa_6958309.jpg?20250706063502",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-06 04:53:00",
        "Headline": "The UK has already lifted a number of sanctions against Syria since the fall of Bashar al Assad's regime, and has suggested the rebel group HTS could be removed from proscribed terror lists.",
        "Content": " The UK has re-established diplomatic ties with Syria, David Lammy has said, as he made the first visit to the country by a British minister for 14 years. The foreign secretary visited Damascus and met with interim president Ahmed al Sharaa, also the leader of the rebel group Hayat Tahrir al-Sham (HTS), and foreign minister Asaad al Shaibani. It marks the latest diplomatic move since Bashar al Assad's regime was toppled by rebel groups led by HTS in December. In a statement, Mr Lammy said a \"stable Syria is in the UK's interests\" and added: \"I've seen first-hand the remarkable progress Syrians have made in rebuilding their lives and their country. \"After over a decade of conflict, there is renewed hope for the Syrian people. \"The UK is re-establishing diplomatic relations because it is in our interests to support the new government to deliver their commitment to build a stable, more secure and prosperous future for all Syrians.\" The Foreign, Commonwealth and Development Office has also announced a £94.5m support package for urgent humanitarian aid and to support the country's long-term recovery, after a number of British sanctions against the country were lifted in April. While HTS is still classified as a proscribed terror group, Sir Keir Starmer said last year that it could be removed from the list. The Syrian president's office also said on Saturday that the president and Mr Lammy discussed co-operation, as well as the latest developments in the Middle East. Read more:Wildfires break out in Greece, Turkey and SyriaPutin 'mocking Trump's peace efforts', Poland saysHamas gives 'positive' response to ceasefire proposal Since Assad fled Syria in December, a transitional government headed by Mr al Sharaa was announced in March and a number of western countries have restored ties. In May, US President Donald Trump said the United States would lift long-standing sanctions on Syria and normalise relations during a speech at the US-Saudi investment conference.  He said he wanted to give the country \"a chance at peace\" and added: \"There is a new government that will hopefully succeed. \"I say good luck, Syria. Show us something special.\""
    }
]