[
    {
        "title": "'Immigration is killing Europe': Donald Trump issues warning to leaders as he arrives in Scotland",
        "description": "Donald Trump has landed in Scotland ahead of a four-day trip, which includes high-level meetings, praising Sir Keir Starmer as \"a good man\" but also calling illegal migration a \"horrible invasion\" that was \"killing Europe\".",
        "url": "https://news.sky.com/story/immigration-is-killing-europe-donald-trump-issues-warning-to-leaders-as-he-arrives-in-scotland-13401882",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-scotland_6973967.jpg?20250725211441",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-25 19:14:00",
        "Headline": "After touching down at Prestwick Airport, the US President spoke about a wide range of topics, including illegal immigration, Jeffrey Epstein, his thoughts on Sir Keir Starmer and Sean Connery.",
        "Content": " Donald Trump has landed in Scotland ahead of a four-day trip, which includes high-level meetings, praising Sir Keir Starmer as \"a good man\" but also calling illegal migration a \"horrible invasion\" that was \"killing Europe\". Crowds gathered at Prestwick Airport in Ayrshire amid a major security operation for the US president's visit. Mr Trump told reporters: \"I like your prime minister. He's slightly more liberal than I am... but he's a good man... he got a trade deal done. It's a good deal for the UK.\" Trump latest: Donald Trump arrives in Scotland  The pair are expected to discuss potential changes to the UK-US trade deal which came into force last month. Trump left Air Force One to head to Turnberry, one of his Scottish golf courses. Part of the trip will include the opening of another course in Aberdeenshire, billed as \"the greatest 36 holes in golf\". \"There's no place like Turnberry. It's the best, probably the best course in the world. And I would say Aberdeen is right up there,\" the US president said. \"Sean Connery helped get me the [planning] permits. If it weren't for Sean Connery, we wouldn't have those great courses,\" he added. During the trip, President Trump will also hold discussions with Scotland's First Minister John Swinney and EU Commission President Ursula von der Leyen, who is keen to secure a trade deal with the US. Mr Trump told reporters there was \"a good 50-50 chance\" of an agreement with the EU but added there were \"maybe 20 different\" sticking points. EU diplomats say a deal could result in a broad 15% tariff on EU goods and half of the 30% Trump is threatening to impose by 1 August. The US president touched on illegal immigration and gave European leaders a stark warning. \"You better get your act together or you're not going to have Europe anymore. You got to get your act together,\" he said. \"But you're allowing it to happen to your countries and you got to stop this horrible invasion that's happening to Europe. Immigration is killing Europe,\" he told reporters.  He was also scathing about the installation of wind turbines across Europe. \"Stop the windmills. You're ruining your countries,\" he said. \"It's so sad. You fly over and you see these windmills all over the place, ruining your beautiful fields and valleys and killing your birds.\" Read more from Sky News:Epstein risks following TrumpGhislaine Maxwell questionedEpstein questions keep coming Domestically, President Trump faces the biggest political crisis of his second term in office over his administration's handling of files linked to disgraced financier and sex offender Jeffrey Epstein, who died in prison in 2019. He faced another round of questions after stepping off Air Force One. \"You're making a big thing over something that's not a big thing. I'm focused on making deals, not on conspiracy theories that you are,\" he said. Mr Trump added that \"now's not the time\" to discuss a pardon for Ghislaine Maxwell, Epstein's imprisoned accomplice.  👉 Follow Trump100 on your podcast app 👈 While the president's visit did attract some enthusiastic flag-waving supporters at Prestwick Airport, he is also likely to trigger a number of protests, prompting Police Scotland to call in support from other forces in the UK. The Stop Trump Scotland group has planned demonstrations on Saturday in Edinburgh, Aberdeen and Dumfries. About 70% of Scots have an unfavourable opinion of Trump, while 18% have a positive opinion, an Ipsos poll in March found. President Trump is staying at his Turnberry property on Scotland's west coast this weekend, before travelling to Aberdeenshire on Monday, where he will open a second 18-hole course. He is due to return to the UK in September for a state visit hosted by the King - the first world leader in modern times to undertake two UK state visits."
    },
    {
        "title": "Over 200 MPs sign cross-party letter demanding Starmer recognise Palestine as a state",
        "description": "Sir Keir Starmer is under increasing pressure to recognise a Palestinian state, with 221 MPs signing a cross-party letter demanding he take the step.",
        "url": "https://news.sky.com/story/mass-cross-party-letter-demands-starmer-recognise-palestine-as-a-state-13401496",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-keir-starmer-downing-street_6966237.jpg?20250716154528",
        "type": "Home",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-07-25 06:55:00",
        "Headline": "The letter is being organised by the Labour backbencher Sarah Champion, who also sits as the International Development Committee Chair. ",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  Sir Keir Starmer is under increasing pressure to recognise a Palestinian state, with 221 MPs signing a cross-party letter demanding he take the step. The letter is being organised by the Labour backbencher Sarah Champion, who also sits as the International Development Committee chair. They write: \"British recognition of Palestine would be particularly powerful given its role as the author of the Balfour Declaration and the former Mandatory Power in Palestine. \"Since 1980 we have backed a two-state solution. Such a recognition would give that position substance as well as living up to a historic responsibility we have to the people under that Mandate.\"  Explainer: What does recognising a Palestinian state mean?  Earlier this month, nearly 60 Labour MPs called on David Lammy and the Foreign Office to immediately recognise Palestine as a state in a private letter, but this new call shows how dissatisfied many still are with the government's refusal to change its stance on the issue. \n                  Sir Keir Starmer is caught between Trump, Macron and MPs over Palestine recognition\n                 \n                  What does recognising a Palestinian state mean - and will other countries follow in France's footsteps?\n                 \n                  Aid is sitting idle in Gaza - where there is now widespread malnutrition\n                 As Number 10 came under growing pressure, Sir Keir on Friday released a statement on Gaza calling the \"appalling scenes\" in the Strip \"unrelenting\". Israel has denied there is a food shortage in Gaza - despite earlier this week more than 100 aid agencies warning of mass starvation in Gaza - and claims it had to take control of the supply and distribution of aid because Hamas fighters have been stealing aid before it reached civilians. Hamas has denied this, as have some humanitarian groups, including USAID. Talking about the need for a regional \"lasting peace\", the prime minister said: \"Recognition of a Palestinian state has to be one of those steps. I am unequivocal about that. But it must be part of a wider plan which ultimately results in a two-state solution and lasting security for Palestinians and Israelis.\" Read more:British surgeon claims IDF shooting Gazans in specific areasFrance to become first G7 nation to recognise Palestine as a stateDozens of MPs call for UK to recognise Palestine as a state  In light of a tweet by the French President Emmanuel Macron, also sent last night, declaring France would recognise a Palestinian state in September at a UN conference, a number of MPs now say Number 10's current position is untenable. \"They had said they wanted to be in lockstep with allies, but this means that position won't hold,\" said one Labour MP.  US President Donald Trump, speaking to reporters at the White House before heading to Scotland, was dismissive of Mr Macron's statement. \"What he says doesn't matter,\" he said. \"He's a very good guy. I like him, but that statement doesn't carry weight.\" Israeli Prime Minister Benjamin Netanyahu said: \"We strongly condemn President Macron's decision to recognise a Palestinian state next to Tel Aviv in the wake of the October 7 massacre. Such a move rewards terror and risks creating another Iranian proxy, just as Gaza became. \"A Palestinian state in these conditions would be a launch pad to annihilate Israel - not to live in peace beside it. Peter Kyle, the technology secretary, on Friday morning defended the government's resistance to calls for immediate UK recognition of a Palestinian state. \"We want Palestinian statehood. We desire it, and we want to make sure the circumstances can exist where that kind of long-term political solution can have the space to evolve and make sure that it can become a permanent circumstance that can bring peace to the entire region,\" he told Sky News. \"But right now, today, we've got to focus on what will ease the suffering, and it is extreme, unwarranted suffering in Gaza that has to be the priority for us today.\"  An emergency call with Germany and France was scheduled for Friday to discuss what Sir Keir described as a \"human catastrophe\" which has \"reached new depths\". The Foreign Office has maintained it is committed to recognising a Palestinian state but has expressed a willingness to do so only when it will have the \"most impact in support of a peace process\". It said: \"We continue to provide lifesaving aid to support Palestinians in Gaza and the West Bank, and to work closely in support of the Palestinian Authority.\""
    },
    {
        "title": "Botox-like injections spark outbreak of rare disease many doctors have never treated",
        "description": "A woman who thought she was being injected with Botox was left unable to swallow and doctors thought she had suffered a stroke - after she contracted a life-threatening illness from a potentially illegal product.",
        "url": "https://news.sky.com/story/its-the-wild-west-dozens-of-women-develop-botulism-linked-to-anti-wrinkle-injections-13401548",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-botox-botulism_6973283.jpg?20250725102415",
        "type": "Home",
        "Author": "Katie Barnfield",
        "Date Published": "2025-07-25 23:12:00",
        "Headline": "The UK Health Security Agency has so far confirmed 38 cases of botulism linked to cosmetic toxin injections, but Sky News has been told of several more.",
        "Content": "\n          North of England correspondent\n        A woman who thought she was being injected with Botox was left unable to swallow and doctors thought she had suffered a stroke - after she contracted a life-threatening illness from a potentially illegal product. Nicola Fairley is one of dozens of people who have developed botulism linked to unlicenced anti-wrinkle injections. She had the procedure done with her regular beautician after winning a Facebook competition for three areas of \"Botox\". \"Within two or three hours my forehead and the sides of my eyes had started to freeze,\" Nicola says. \"At first I thought 'amazing', that's what I wanted - then it just carried on.\" Nicola was eventually sent to A&E in Durham, where she met several other patients who all had similar symptoms. Doctors were stumped. \"They thought I'd had a stroke,\" she says. \n                  Age verification tools on adult websites bypassed in seconds\n                 \n                  Rising costs and tight budgets mean school trips are under threat - even though some kids have never seen the sea \n                 \n                  'Immigration is killing Europe': Donald Trump issues warning to leaders as he arrives in Scotland\n                 \"We all had problems with our eyes, some of us with our breathing. I couldn't swallow - they put me on nil by mouth because they were worried I would choke in the waiting room.\" It turns out all of the patients had recently had anti-wrinkle injections containing botulinum toxin. Health officials believe they were imported, illegal products. Botulism - the disease they caused - is so rare many doctors never see it in their entire careers. It can cause symptoms including slurred speech and breathing problems, and can be deadly. The disease is so unusual, and so many cases were coming in, that doctors exhausted their stocks of anti-toxin and had to ask hospitals as far away as London to get more. The UK Health Security Agency has so far confirmed 38 cases of botulism linked to cosmetic toxin injections, but Sky News has been told of several more. The outbreak began in the North East but cases have now been seen in the East of England and East Midlands as well. There are only a handful of legal botulinum toxin products in the UK - of which Botox is one. But cosmetic treatments are largely unregulated, with anyone allowed to inject products like fillers and toxins without any medical training. Cheap, illegal products imported from overseas are easily available. 'It's the Wild West' Dr Steven Land runs Novellus Aesthetics clinic in Newcastle upon Tyne. He worked for decades as an emergency medicine doctor before moving into aesthetics. He says he has been warning health officials of an outbreak for years. \"It's the Wild West,\" Dr Land told Sky News. \"Because anyone can do this, there is a lack of knowledge around what is legal, what's not legal, what is okay to be injected. \"These illegal toxins could have 50 units, 5,000 units or rat poison - there could be anything in there.\" Read more from Sky News:Kelly Osbourne pays tribute to 'best friend' OzzyScots divided as Trump flies in for visit Dr Land showed us messages that he says he gets on a weekly basis, from sellers trying to push him cheap, unlicenced products. They advertise \"limited time offers\" and cheap bundles on toxins imported from overseas. He calls them \"drug dealers\". \"They are preying on the lack of knowledge among non-medical practitioners,\" he says. Consultations on how to regulate the aesthetics industry have been ongoing for years - but so far, no changes have been introduced. The UK government now says it does plan to regulate certain procedures, but it's not said how it will do this, or when. \"What will it take?\" Nicola says. \"One of the women we were with did almost die - she had to be resuscitated.\" Nicola's beautician has stopped responding to her messages, so she says she still has no idea what the product was \"or how much of it is in me\". She doesn't know how long her symptoms will last, but just hopes she will eventually recover."
    },
    {
        "title": "What is Tea - the women-only app with millions of users?",
        "description": "Millions of women in the US have downloaded a \"dating advice\" app that claims it catches catfish, checks for hidden marriages and keeps users safe from men online.",
        "url": "https://news.sky.com/story/what-is-tea-the-women-only-app-with-millions-of-users-13401888",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-tea-app_6974079.jpg?20250726021804",
        "type": "Home",
        "Author": "Dylan Donnelly, news reporter",
        "Date Published": "2025-07-25 19:32:00",
        "Headline": "According to App Store tracker SensorTower.com, Tea Dating Advice has become the most popular free app in America and is the number one lifestyle download.",
        "Content": "By Dylan Donnelly, news reporter  Millions of women in the US have downloaded a \"dating advice\" app that claims it catches catfish, checks for hidden marriages and keeps users safe from men online. According to App Store tracker SensorTower.com, Tea Dating Advice has become the most popular free app in the US, and is the number one lifestyle download. It also claimed earlier this week to have recently gained close to a million new users, and said on Instagram it has more than four million women \"in our community\". However, the women-only app has come under fire for being \"anti-men\", and for a data breach that saw 13,000 user photos leaked. But what is Tea? And why has it proved controversial? What is the app? Tea Dating Advice is a women-only app that allows users to anonymously post about men they are dating in the US. The app's website says it was launched \"to give women the tools they need to date safely\" - and offers AI-powered reverse image searching to catch catfish using fake images on dating profiles. It also offers phone number searching to check if men have \"hidden marriages\", background checks to look for criminal records, and a map of registered sex offenders. While these features aren't unique to Tea - with most being publicly accessible - the app offers them in one package. Tea also touts that it has \"the largest women's group chat in the US, where users share experiences, anonymous dating reviews, and support\". Sean Cook, a Bay Area tech executive, founded and self-funded the app in 2023 because his mother was catfished and talked to men with criminal records while dating online. Read more: 'It's not you, it's dating': Where is modern love going wrong? Who can use it? Only women can use the app, which requires users to register by creating a username including location, birth date, a photo and official identification. Tea says it deletes all photos after a review, where moderators approve or deny applications and verify if new users are women. All users who get accepted are promised anonymity outside of the usernames they choose, and taking screenshots of what's in the app is also blocked. Once approved, users can leave comments describing specific men as a \"red flag\" or \"green flag\", and share other information about them. Comments on Tea's Instagram show that applications aren't that straightforward however, with a number of people saying it takes days to be approved. While men cannot use the app, Tea says any takedown requests should be emailed to their support desk with their name, location, as much information as possible about the content in question, as well as a photo. Read more from Sky News:New internet rules come into force - here's what is changingMan tells how he conned dozens of womenThe frustrated entrepreneurs taking on dating  What are the concerns? Tea has faced a heavy backlash, with The Times calling it a \"man-shaming\" app, and a post in the MensRights subreddit saying it \"must be deleted\". Much like the Facebook pages it resembles, the app has also been criticised for devolving into places for gossip or for spreading possible misinformation about people. Sky's US partner network NBC News reported that judges in Illinois and California dismissed two defamation lawsuits filed by men who were posted in such Facebook groups. Writing for the culture website Dazed, Serena Swift said it's \"clear how an app like Tea could be abused\", noting doxxing - where private information about someone is shared online with malicious intent - and concerns about men \"who aren't abusers\" having their information published. Speaking to Fox 2, lawyer William Barnwell said men could have civil legal recourse if the posts affect their work, family life, or reputation as defamation might apply. A male-only version of the app - Cheeky - has also been launched, offering anonymous chats about dating. It says on it's official Instagram that it's \"our response to the Tea App\". However, NBC News reported the creator of Teaborn - a previous men-only alternative that climbed to number three in the free apps chart - had condemned its users for allegedly sharing revenge porn on that app. What happened with the Tea data breach? NBC News reported that thousands of accounts were leaked after a hacker managed to breach the company's database. Tea has confirmed the leak to Sky News, and said it had identified \"unauthorised access to one of their systems and immediately launched a full investigation to assess the scope and impact\". In preliminary findings, the company said the incident involved a legacy data storage system containing information from prior to February 2024. It is estimated that around 72,000 images - including approximately 13,000 images of selfies or selfies featuring a photo identification submitted during account verification and 59,000 images publicly viewable in the app from posts, comments and direct messages - were accessed. \"Protecting Tea users' privacy and data is their highest priority,\" it said. \"Tea is taking every necessary step to ensure the security of the platform and prevent further exposure.\" Posts on social media suggest the leak was first posted on 4chan and has been shared widely since then. Sky News has not independently verified any leaked information."
    },
    {
        "title": "Ghislaine Maxwell answered justice department questions 'about 100 different people', her lawyer says",
        "description": "Ghislaine Maxwell answered \"every single question\" from the US justice department, her lawyer has said.",
        "url": "https://news.sky.com/story/ghislaine-maxwell-answered-justice-department-questions-about-100-different-people-her-lawyer-says-13401865",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ghislaine-maxwell-jeffrey-epstein_6973964.jpg?20250725211106",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-25 18:45:00",
        "Headline": "The deputy US attorney general previously announced she would be interviewed after Donald Trump's directive to release evidence about others who may have committed crimes. ",
        "Content": " Ghislaine Maxwell answered \"every single question\" from the US justice department, her lawyer has said. The imprisoned former girlfriend of convicted sex offender Jeffrey Epstein answered questions \"about 100 different people\" during one-and-a-half days of questioning in the federal courthouse in Tallahassee, Florida, her attorney David Oscar Markus said. Mr Markus said Maxwell \"answered those questions honestly, truthfully, to the best of her ability\" when she met with deputy attorney general Todd Blanche.   \"She never invoked a privilege. She never refused to answer a question, so we're very proud of her,\" Mr Markus added. Maxwell, who was jailed in 2022 for luring young girls to massage rooms for Epstein to abuse, is currently serving a 20-year prison sentence. Epstein, 66, was found dead in his cell at a Manhattan federal jail in August 2019 as he awaited trial on sex trafficking charges. His death was ruled a suicide. His case has generated endless attention and conspiracy theories due to his and Maxwell's links to famous people like royals, presidents and billionaires, including Donald Trump. Mr Trump is facing ongoing questions about the Epstein case. He denied prior knowledge of Epstein's crimes and claimed he cut off their relationship long ago.  The deputy US attorney general, Mr Blanche, announced earlier this week that Maxwell would be interviewed because of Mr Trump's directive to gather and release any credible evidence about others who may have committed crimes. Maxwell's lawyer, Mr Markus, praised Mr Blanche's approach. \"The deputy attorney general is seeking the truth. He asked every possible question, and he was doing an amazing job,\" he said. Mr Markus said Maxwell did not receive anything in return for answering the questions, but he acknowledged that Mr Trump could pardon her. \"Listen, the president this morning said he had the power to do so. We hope he exercises that power in the right and just way,\" Mr Markus said. When asked whether he had thought about a pardon or clemency for Maxwell, Mr Trump claimed he had not considered it. \"I'm allowed to do it, but it's something I have not thought about,\" he told reporters outside the White House. He later shut down another question, saying: \"I don't want to talk about that.\" Read more from Sky News:Analysis: Trump hopes to escape Epstein controversyScots divided as Trump heads to Turnberry Meanwhile, Maxwell's family have suggested the disgraced British socialite could use \"government misconduct\" to challenge her imprisonment. Her family have frequently claimed she \"did not receive a fair trial\", but legal appeals against her sex trafficking convictions have been rejected by the courts. Judges previously dismissed arguments from Maxwell's lawyers that she \"should never have been prosecuted\" because of a \"weird\" agreement drafted more than 15 years ago. The family argue that Maxwell should have been protected under an agreement Epstein had entered with the US Department of Justice in 2007, which agreed not to prosecute any of his co-conspirators. During her trial in 2021, Maxwell was described as \"dangerous\" by prosecutors, who told jurors about how she would entice vulnerable girls to go to Epstein's properties for him to sexually abuse. In a statement, her family said: \"Our sister Ghislaine did not receive a fair trial. Her legal team continues to fight her case in the courts and will file its reply in short order to the government's opposition in the US Supreme Court.\""
    },
    {
        "title": "Top Boy actor Micheal Ward charged with two counts of rape",
        "description": "Top Boy actor Micheal Ward has been charged with two counts of rape and is due to appear in court next month.",
        "url": "https://news.sky.com/story/top-boy-actor-micheal-ward-charged-with-two-counts-of-rape-13401772",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-micheal-ward-police_6973702.jpg?20250725164102",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-25 15:35:00",
        "Headline": "Ward, 27, has also been charged with two counts of assault by penetration and one count of sexual assault.",
        "Content": "Top Boy actor Micheal Ward has been charged with two counts of rape and is due to appear in court next month. Ward, 27, has also been charged with two counts of assault by penetration and one count of sexual assault. The offences relate to one woman and are reported to have taken place in January 2023. \"Our specialist officers continue to support the woman who has come forward - we know investigations of this nature can have a significant impact on those who make reports,\" said Detective Superintendent Scott Ware, whose team is leading the Met Police's investigation. Ward, of Cheshunt, Hertfordshire, is due to appear at Thames Magistrates' Court on 28 August, the Crown Prosecution Service said. Ward said he denies the charges of rape and sexual assault, adding in a statement: \"I recognise that proceedings are now ongoing, and I have full faith that they will lead to my name being cleared.\" In a statement, Catherine Baccas, deputy chief crown prosecutor for CPS London South, said: \"We remind all concerned that proceedings against the suspect are active and he has a right to a fair trial. \n                  Grammy-winning jazz singer Dame Cleo Laine dies\n                 \n                  Riverdance star Michael Flatley to make bid for Irish presidency, court hears\n                 \n                  Kelly Osbourne pays tribute to 'best friend' Ozzy - in first comments since his death\n                 \"It is vital that there should be no reporting, commentary or sharing of information online which could in anyway prejudice these proceedings.\" Ward starred in the popular Netflix series Top Boy as Jamie. He also appeared in films like Blue Story, The Old Guard and Empire of Light. In 2020, the Jamaican-born actor was awarded the Bafta Rising Star honour in 2020. Read more from Sky News:Teenagers jailed for 15 years for machete murderHome Office threaten asylum seekers with homelessness He was nominated for Best Supporting Actor Bafta in 2021 for his role as Franklyn in the BBC series Small Axe, and 2022 for his performance as Stephen in Empire of Light. Ward is also in the upcoming American film Eddington alongside Joaquin Phoenix and Pedro Pascal, which is set to be released in the UK next month. He has more than a million followers on Instagram and participated in charity events like the Soccer Aid match at Stamford Bridge last year. Ward gave a reading at the Christmas Eve carol service hosted by the Princess of Wales in 2023."
    },
    {
        "title": "Turkey faces 'truly great disaster', warns Erdogan amid raging wildfires and sweltering temperatures across Europe",
        "description": "Disaster zones have been declared in two provinces of Turkey as new wildfires broke out on the Mediterranean coast. ",
        "url": "https://news.sky.com/story/turkey-faces-truly-great-disaster-warns-erdogan-amid-raging-wildfires-and-sweltering-temperatures-across-europe-13401785",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-wildfire-turkey-karabuk_6972597.jpg?20250724134335",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-25 15:56:00",
        "Headline": "Thirteen people in Turkey have been killed by the wildfires so far, including 10 volunteers and forestry workers in the central Eskisehir province.",
        "Content": " Disaster zones have been declared in two provinces of Turkey as new wildfires broke out on the Mediterranean coast.  Smoke billowed across the sky in the popular resort of Antalya, with homes evacuated in the city centre and elsewhere. In the nearby city of Manavgat locals grabbed hoses and buckets to help firefighters, with aircraft dumping water from above. Other wildfires started on Friday in Adana and Mersin, further east along the coast.  Turkey's interior minister declared the western provinces of Izmir and Bilecik \"disaster areas\" after a month of fires in the country. President Recep Tayyip Erdogan also said on Friday that the country faced \"a truly great disaster\" and that 25,000 people were involved in the emergency effort. \n                  Cyprus attorney general appeals after five Israeli men cleared of gang raping British tourist in Ayia Napa\n                 \n                  How a British woman accused of lying about being gang-raped in Cyprus won a human rights case\n                 \n                  Why are 700 British troops being deployed to Cyprus?\n                 Thirteen people have been killed so far, including 10 volunteers and forestry workers in the central Eskisehir province on Wednesday. Cyprus has also been enduring one of its worst wildfires in living memory. Temperatures have reached 43C (109F) on the island this week. Two people were found dead in their car on Wednesday and scores of homes have been destroyed. Spain, Egypt, Jordan and Israel were providing assistance, and planes from the RAF base on the island were also helping. Elsewhere in southern Europe, firefighters in Albania have been dealing with a blaze in the mountainous forests near Elbasan. The devastating fires come amid dry, sweltering temperatures in southern parts of the continent. Greece's iconic Acropolis was forced to limit its hours this week as it approached the mid-40s, while there's also been intense heat in the Balkans. And it's not only southern Europe that's been getting abnormal heat: Finland broke a record this week after experiencing 14 straight days above 30C. The previous record of 13 days was set in 1972. Read more from Sky News:East and West Midlands officially in drought - which areas could be next?Top Boy actor charged with two counts of rapeWhere are hosepipe bans in place and what does it mean? Respite looks to be ahead, however, with many areas expected to cool to more usual levels next week. Most experts attribute the above-average temperatures for this time of year to human-caused climate change and say wildfires are likely to become more frequent. 2024 was the warmest year on record, with temperatures exceeding 1.5C above the pre-industrial era for the first time."
    },
    {
        "title": "Home Office threatens asylum seekers with homelessness if they refuse hotel move",
        "description": "Asylum seekers risk becoming homeless if they refuse accommodation under plans to end the use of expensive hotels. ",
        "url": "https://news.sky.com/story/home-office-threaten-asylum-seekers-with-homelessness-if-they-refuse-hotel-move-13401695",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-migrants-gravelines_6966714.jpg?20250717074802",
        "type": "Home",
        "Author": "Faye Brown",
        "Date Published": "2025-07-25 13:49:00",
        "Headline": "The Home Office has accused some asylum seekers of 'gaming the system' by refusing to move into suitable accommodation. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Asylum seekers risk becoming homeless if they refuse accommodation under plans to end the use of expensive hotels.  Announcing the policy on Friday, the Home Office said some migrants were \"gaming the system\" by resisting efforts to move them into alternative housing without a valid reason. Politics Live: Macron lays out plan for France to recognise a Palestinian state. The new Failure to Travel policy means housing support will be removed from those who block transfer requests. The Home Office said this will \"ensure individuals who are moved from hotels to suitable alternative accommodation must take it\". They added: \"Those who refuse to move without a valid reason will now risk losing their housing and support. It is a firm but fair approach, aimed to end abuse of asylum support and contribute towards the closure of costly hotel accommodation. \"While the government has a duty to support all asylum seekers who would otherwise be destitute in appropriate accommodation, the new policy establishes clear consequences for those who game the system whilst protecting the vulnerable.\" \n                  Over 200 MPs sign cross-party letter demanding Starmer recognise Palestine as a state\n                 \n                  Sir Keir Starmer is caught between Trump, Macron and MPs over Palestine recognition\n                 \n                  France to become first G7 nation to recognise Palestine as a state\n                 There would be several steps before stripping someone of accommodation - with it being a last resort, Sky News understands. It follows a week of unrest outside a hotel in Epping used to house asylum seekers.  Several demonstrations have been held outside the Bell Hotel since 13 July, after an asylum seeker was charged with allegedly attempting to kiss a 14-year-old girl. Hadush Gerberslasie Kebatu, 38, from Ethiopia, denied sexually assaulting the 14-year-old girl at Chelmsford Magistrates' Court last week and will stand trial in August. On Thursday Epping council unanimously voted to urge the government to shut the site. Ministers are under pressure to restore order amid fears of further unrest, like that seen in Southport last summer. Labour has pledged to end the use of asylum hotels by the end of this parliament, a move chancellor Rachel Reeves has claimed will save £1bn a year. However there is a question mark as to how this will be achieved as Channel Crossings continue to rise. Nearly 20,000 migrants made the journey to the UK in the first six months of this year, a rise of almost 50% on the number crossing in 2024 and a new record for the first half of a year. Ministers say they inherited a \"broken system\", with 400 hotels being used to accommodate asylum seekers at the peak of the crisis under the Tories, costing £9 million per day. Minister for Border Security and Asylum, Dame Angela Eagle, said: \"We inherited an asylum system on the brink of collapse - mismanaged, under strain, and costing the public a fortune. We are getting a grip. \"We are working to close hotels, restore order, and put fairness and value for money at the heart of our asylum system. This government is making those necessary decisions to protect the taxpayer and uphold the integrity of our borders. \"These reforms to the Failure to Travel policy are another example of this government's action to transform the asylum accommodation system and crack down on those who abuse our system, so it operates fairly and saves the taxpayer money.\""
    },
    {
        "title": "Botox-like injections spark outbreak of rare disease many doctors have never treated",
        "description": "A woman who thought she was being injected with Botox was left unable to swallow and doctors thought she had suffered a stroke - after she contracted a life-threatening illness from a potentially illegal product.",
        "url": "https://news.sky.com/story/its-the-wild-west-dozens-of-women-develop-botulism-linked-to-anti-wrinkle-injections-13401548",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-botox-botulism_6973283.jpg?20250725102415",
        "type": "UK",
        "Author": "Katie Barnfield",
        "Date Published": "2025-07-25 23:12:00",
        "Headline": "The UK Health Security Agency has so far confirmed 38 cases of botulism linked to cosmetic toxin injections, but Sky News has been told of several more.",
        "Content": "\n          North of England correspondent\n        A woman who thought she was being injected with Botox was left unable to swallow and doctors thought she had suffered a stroke - after she contracted a life-threatening illness from a potentially illegal product. Nicola Fairley is one of dozens of people who have developed botulism linked to unlicenced anti-wrinkle injections. She had the procedure done with her regular beautician after winning a Facebook competition for three areas of \"Botox\". \"Within two or three hours my forehead and the sides of my eyes had started to freeze,\" Nicola says. \"At first I thought 'amazing', that's what I wanted - then it just carried on.\" Nicola was eventually sent to A&E in Durham, where she met several other patients who all had similar symptoms. Doctors were stumped. \"They thought I'd had a stroke,\" she says. \n                  Age verification tools on adult websites bypassed in seconds\n                 \n                  Rising costs and tight budgets mean school trips are under threat - even though some kids have never seen the sea \n                 \n                  'Immigration is killing Europe': Donald Trump issues warning to leaders as he arrives in Scotland\n                 \"We all had problems with our eyes, some of us with our breathing. I couldn't swallow - they put me on nil by mouth because they were worried I would choke in the waiting room.\" It turns out all of the patients had recently had anti-wrinkle injections containing botulinum toxin. Health officials believe they were imported, illegal products. Botulism - the disease they caused - is so rare many doctors never see it in their entire careers. It can cause symptoms including slurred speech and breathing problems, and can be deadly. The disease is so unusual, and so many cases were coming in, that doctors exhausted their stocks of anti-toxin and had to ask hospitals as far away as London to get more. The UK Health Security Agency has so far confirmed 38 cases of botulism linked to cosmetic toxin injections, but Sky News has been told of several more. The outbreak began in the North East but cases have now been seen in the East of England and East Midlands as well. There are only a handful of legal botulinum toxin products in the UK - of which Botox is one. But cosmetic treatments are largely unregulated, with anyone allowed to inject products like fillers and toxins without any medical training. Cheap, illegal products imported from overseas are easily available. 'It's the Wild West' Dr Steven Land runs Novellus Aesthetics clinic in Newcastle upon Tyne. He worked for decades as an emergency medicine doctor before moving into aesthetics. He says he has been warning health officials of an outbreak for years. \"It's the Wild West,\" Dr Land told Sky News. \"Because anyone can do this, there is a lack of knowledge around what is legal, what's not legal, what is okay to be injected. \"These illegal toxins could have 50 units, 5,000 units or rat poison - there could be anything in there.\" Read more from Sky News:Kelly Osbourne pays tribute to 'best friend' OzzyScots divided as Trump flies in for visit Dr Land showed us messages that he says he gets on a weekly basis, from sellers trying to push him cheap, unlicenced products. They advertise \"limited time offers\" and cheap bundles on toxins imported from overseas. He calls them \"drug dealers\". \"They are preying on the lack of knowledge among non-medical practitioners,\" he says. Consultations on how to regulate the aesthetics industry have been ongoing for years - but so far, no changes have been introduced. The UK government now says it does plan to regulate certain procedures, but it's not said how it will do this, or when. \"What will it take?\" Nicola says. \"One of the women we were with did almost die - she had to be resuscitated.\" Nicola's beautician has stopped responding to her messages, so she says she still has no idea what the product was \"or how much of it is in me\". She doesn't know how long her symptoms will last, but just hopes she will eventually recover."
    },
    {
        "title": "'Immigration is killing Europe': Donald Trump issues warning to leaders as he arrives in Scotland",
        "description": "Donald Trump has landed in Scotland ahead of a four-day trip, which includes high-level meetings, praising Sir Keir Starmer as \"a good man\" but also calling illegal migration a \"horrible invasion\" that was \"killing Europe\".",
        "url": "https://news.sky.com/story/immigration-is-killing-europe-donald-trump-issues-warning-to-leaders-as-he-arrives-in-scotland-13401882",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-scotland_6973967.jpg?20250725211441",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-25 19:14:00",
        "Headline": "After touching down at Prestwick Airport, the US President spoke about a wide range of topics, including illegal immigration, Jeffrey Epstein, his thoughts on Sir Keir Starmer and Sean Connery.",
        "Content": " Donald Trump has landed in Scotland ahead of a four-day trip, which includes high-level meetings, praising Sir Keir Starmer as \"a good man\" but also calling illegal migration a \"horrible invasion\" that was \"killing Europe\". Crowds gathered at Prestwick Airport in Ayrshire amid a major security operation for the US president's visit. Mr Trump told reporters: \"I like your prime minister. He's slightly more liberal than I am... but he's a good man... he got a trade deal done. It's a good deal for the UK.\" Trump latest: Donald Trump arrives in Scotland  The pair are expected to discuss potential changes to the UK-US trade deal which came into force last month. Trump left Air Force One to head to Turnberry, one of his Scottish golf courses. Part of the trip will include the opening of another course in Aberdeenshire, billed as \"the greatest 36 holes in golf\". \"There's no place like Turnberry. It's the best, probably the best course in the world. And I would say Aberdeen is right up there,\" the US president said. \"Sean Connery helped get me the [planning] permits. If it weren't for Sean Connery, we wouldn't have those great courses,\" he added. During the trip, President Trump will also hold discussions with Scotland's First Minister John Swinney and EU Commission President Ursula von der Leyen, who is keen to secure a trade deal with the US. Mr Trump told reporters there was \"a good 50-50 chance\" of an agreement with the EU but added there were \"maybe 20 different\" sticking points. EU diplomats say a deal could result in a broad 15% tariff on EU goods and half of the 30% Trump is threatening to impose by 1 August. The US president touched on illegal immigration and gave European leaders a stark warning. \"You better get your act together or you're not going to have Europe anymore. You got to get your act together,\" he said. \"But you're allowing it to happen to your countries and you got to stop this horrible invasion that's happening to Europe. Immigration is killing Europe,\" he told reporters.  He was also scathing about the installation of wind turbines across Europe. \"Stop the windmills. You're ruining your countries,\" he said. \"It's so sad. You fly over and you see these windmills all over the place, ruining your beautiful fields and valleys and killing your birds.\" Read more from Sky News:Epstein risks following TrumpGhislaine Maxwell questionedEpstein questions keep coming Domestically, President Trump faces the biggest political crisis of his second term in office over his administration's handling of files linked to disgraced financier and sex offender Jeffrey Epstein, who died in prison in 2019. He faced another round of questions after stepping off Air Force One. \"You're making a big thing over something that's not a big thing. I'm focused on making deals, not on conspiracy theories that you are,\" he said. Mr Trump added that \"now's not the time\" to discuss a pardon for Ghislaine Maxwell, Epstein's imprisoned accomplice.  👉 Follow Trump100 on your podcast app 👈 While the president's visit did attract some enthusiastic flag-waving supporters at Prestwick Airport, he is also likely to trigger a number of protests, prompting Police Scotland to call in support from other forces in the UK. The Stop Trump Scotland group has planned demonstrations on Saturday in Edinburgh, Aberdeen and Dumfries. About 70% of Scots have an unfavourable opinion of Trump, while 18% have a positive opinion, an Ipsos poll in March found. President Trump is staying at his Turnberry property on Scotland's west coast this weekend, before travelling to Aberdeenshire on Monday, where he will open a second 18-hole course. He is due to return to the UK in September for a state visit hosted by the King - the first world leader in modern times to undertake two UK state visits."
    },
    {
        "title": "Over 200 MPs sign cross-party letter demanding Starmer recognise Palestine as a state",
        "description": "Sir Keir Starmer is under increasing pressure to recognise a Palestinian state, with 221 MPs signing a cross-party letter demanding he take the step.",
        "url": "https://news.sky.com/story/mass-cross-party-letter-demands-starmer-recognise-palestine-as-a-state-13401496",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-keir-starmer-downing-street_6966237.jpg?20250716154528",
        "type": "UK",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-07-25 06:55:00",
        "Headline": "The letter is being organised by the Labour backbencher Sarah Champion, who also sits as the International Development Committee Chair. ",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  Sir Keir Starmer is under increasing pressure to recognise a Palestinian state, with 221 MPs signing a cross-party letter demanding he take the step. The letter is being organised by the Labour backbencher Sarah Champion, who also sits as the International Development Committee chair. They write: \"British recognition of Palestine would be particularly powerful given its role as the author of the Balfour Declaration and the former Mandatory Power in Palestine. \"Since 1980 we have backed a two-state solution. Such a recognition would give that position substance as well as living up to a historic responsibility we have to the people under that Mandate.\"  Explainer: What does recognising a Palestinian state mean?  Earlier this month, nearly 60 Labour MPs called on David Lammy and the Foreign Office to immediately recognise Palestine as a state in a private letter, but this new call shows how dissatisfied many still are with the government's refusal to change its stance on the issue. \n                  Sir Keir Starmer is caught between Trump, Macron and MPs over Palestine recognition\n                 \n                  What does recognising a Palestinian state mean - and will other countries follow in France's footsteps?\n                 \n                  Aid is sitting idle in Gaza - where there is now widespread malnutrition\n                 As Number 10 came under growing pressure, Sir Keir on Friday released a statement on Gaza calling the \"appalling scenes\" in the Strip \"unrelenting\". Israel has denied there is a food shortage in Gaza - despite earlier this week more than 100 aid agencies warning of mass starvation in Gaza - and claims it had to take control of the supply and distribution of aid because Hamas fighters have been stealing aid before it reached civilians. Hamas has denied this, as have some humanitarian groups, including USAID. Talking about the need for a regional \"lasting peace\", the prime minister said: \"Recognition of a Palestinian state has to be one of those steps. I am unequivocal about that. But it must be part of a wider plan which ultimately results in a two-state solution and lasting security for Palestinians and Israelis.\" Read more:British surgeon claims IDF shooting Gazans in specific areasFrance to become first G7 nation to recognise Palestine as a stateDozens of MPs call for UK to recognise Palestine as a state  In light of a tweet by the French President Emmanuel Macron, also sent last night, declaring France would recognise a Palestinian state in September at a UN conference, a number of MPs now say Number 10's current position is untenable. \"They had said they wanted to be in lockstep with allies, but this means that position won't hold,\" said one Labour MP.  US President Donald Trump, speaking to reporters at the White House before heading to Scotland, was dismissive of Mr Macron's statement. \"What he says doesn't matter,\" he said. \"He's a very good guy. I like him, but that statement doesn't carry weight.\" Israeli Prime Minister Benjamin Netanyahu said: \"We strongly condemn President Macron's decision to recognise a Palestinian state next to Tel Aviv in the wake of the October 7 massacre. Such a move rewards terror and risks creating another Iranian proxy, just as Gaza became. \"A Palestinian state in these conditions would be a launch pad to annihilate Israel - not to live in peace beside it. Peter Kyle, the technology secretary, on Friday morning defended the government's resistance to calls for immediate UK recognition of a Palestinian state. \"We want Palestinian statehood. We desire it, and we want to make sure the circumstances can exist where that kind of long-term political solution can have the space to evolve and make sure that it can become a permanent circumstance that can bring peace to the entire region,\" he told Sky News. \"But right now, today, we've got to focus on what will ease the suffering, and it is extreme, unwarranted suffering in Gaza that has to be the priority for us today.\"  An emergency call with Germany and France was scheduled for Friday to discuss what Sir Keir described as a \"human catastrophe\" which has \"reached new depths\". The Foreign Office has maintained it is committed to recognising a Palestinian state but has expressed a willingness to do so only when it will have the \"most impact in support of a peace process\". It said: \"We continue to provide lifesaving aid to support Palestinians in Gaza and the West Bank, and to work closely in support of the Palestinian Authority.\""
    },
    {
        "title": "Man charged with murder after great-grandparents killed in St Helens house fire",
        "description": "A man has been charged with murder after two great-grandparents died following an arson attack on their home in St Helens last week.",
        "url": "https://news.sky.com/story/man-charged-with-murder-after-great-grandparents-killed-in-st-helens-arson-attack-13401853",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-eric-greener-sheila-jackson_6969161.png?20250720114935",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-25 18:16:00",
        "Headline": "Eric Greener, 77, and Sheila Jackson, 83, died after a house fire in St Helens, Merseyside, in the early hours of 15 July.",
        "Content": "A man has been charged with murder after two great-grandparents died following an arson attack on their home in St Helens last week. Eric Greener, 77, and Sheila Jackson, 83, died after the fire in Merseyside in the early hours of 15 July. Police said Lee Owens, 46, of no fixed address, was charged with two counts of murder and arson with intent to endanger life on Friday.   He has been remanded in custody and is to appear at Liverpool Magistrates' Court on Saturday. Merseyside Police said a 31-year-old man from St Helens, who was arrested on suspicion of murder, remains on conditional bail. The force also said an accelerant was used to start the fire on South John Street, where Mr Greener and Ms Shelia had lived for 15 years. The pair were rescued from their home and taken to hospital after emergency services were called at 12.40am. Read more from Sky News:Sarina Wiegman on the 'high purpose' of footballNew internet rules enforced from today Mr Greener died on the evening of 16 July, while Ms Jackson died the next morning. In a tribute released on Thursday, the victims' family said they were \"the life and soul of the party\" and would \"forever be devastatingly missed but eternally loved\"."
    },
    {
        "title": "Top Boy actor Micheal Ward charged with two counts of rape",
        "description": "Top Boy actor Micheal Ward has been charged with two counts of rape and is due to appear in court next month.",
        "url": "https://news.sky.com/story/top-boy-actor-micheal-ward-charged-with-two-counts-of-rape-13401772",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-micheal-ward-police_6973702.jpg?20250725164102",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-25 15:35:00",
        "Headline": "Ward, 27, has also been charged with two counts of assault by penetration and one count of sexual assault.",
        "Content": "Top Boy actor Micheal Ward has been charged with two counts of rape and is due to appear in court next month. Ward, 27, has also been charged with two counts of assault by penetration and one count of sexual assault. The offences relate to one woman and are reported to have taken place in January 2023. \"Our specialist officers continue to support the woman who has come forward - we know investigations of this nature can have a significant impact on those who make reports,\" said Detective Superintendent Scott Ware, whose team is leading the Met Police's investigation. Ward, of Cheshunt, Hertfordshire, is due to appear at Thames Magistrates' Court on 28 August, the Crown Prosecution Service said. Ward said he denies the charges of rape and sexual assault, adding in a statement: \"I recognise that proceedings are now ongoing, and I have full faith that they will lead to my name being cleared.\" In a statement, Catherine Baccas, deputy chief crown prosecutor for CPS London South, said: \"We remind all concerned that proceedings against the suspect are active and he has a right to a fair trial. \n                  Grammy-winning jazz singer Dame Cleo Laine dies\n                 \n                  Riverdance star Michael Flatley to make bid for Irish presidency, court hears\n                 \n                  Kelly Osbourne pays tribute to 'best friend' Ozzy - in first comments since his death\n                 \"It is vital that there should be no reporting, commentary or sharing of information online which could in anyway prejudice these proceedings.\" Ward starred in the popular Netflix series Top Boy as Jamie. He also appeared in films like Blue Story, The Old Guard and Empire of Light. In 2020, the Jamaican-born actor was awarded the Bafta Rising Star honour in 2020. Read more from Sky News:Teenagers jailed for 15 years for machete murderHome Office threaten asylum seekers with homelessness He was nominated for Best Supporting Actor Bafta in 2021 for his role as Franklyn in the BBC series Small Axe, and 2022 for his performance as Stephen in Empire of Light. Ward is also in the upcoming American film Eddington alongside Joaquin Phoenix and Pedro Pascal, which is set to be released in the UK next month. He has more than a million followers on Instagram and participated in charity events like the Soccer Aid match at Stamford Bridge last year. Ward gave a reading at the Christmas Eve carol service hosted by the Princess of Wales in 2023."
    },
    {
        "title": "Sir Keir Starmer is caught between Trump, Macron and MPs over Palestine recognition",
        "description": "Parliament may have shut up shop for a six-week summer break, but MPs and the French president are turning up the heat on Sir Keir Starmer over the Middle East.",
        "url": "https://news.sky.com/story/how-sir-keir-starmer-is-caught-between-trump-macron-and-mps-over-palestine-recognition-13401896",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sir-keir-starmer-india_6973976.jpg?20250725213125",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-07-25 20:04:00",
        "Headline": "In response to a call from more than one in three MPs to officially recognise Palestine as a state, Sir Keir Starmer's answer is essentially: Yes, but not yet.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Parliament may have shut up shop for a six-week summer break, but MPs and the French president are turning up the heat on Sir Keir Starmer over the Middle East. More than one in three of all 650 MPs have written to the prime minister calling on the UK to recognise a Palestinian state at a United Nations conference next week. In response to the call, his answer is essentially: Yes, but not yet. That, of course, won't satisfy the 222 MPs backing an all-party letter to the PM penned by the Labour MP Sarah Champion. The majority of names on the letter, predictably, are Labour, Lib Dem and SNP MPs. But there are some Tory big hitters too, including Father of the House Sir Edward Leigh and former cabinet minister Kit Malthouse. Until now, the PM and foreign secretary David Lammy have argued that the gesture of recognising Palestine on its own won't end what Sir Keir himself calls \"the appalling scenes in Gaza\". But the pressure for recognition isn't just coming from MPs. French President Emmanuel Macron has said France will recognise a Palestinian state at the UN General Assembly in September. Read more: What does recognising a Palestinian state mean?  Might Mr Macron - whose bromance with the PM during his state visit to the UK could not have been warmer - persuade Sir Keir to do the same? Possibly. He's not ruling it out. But there's one big obstacle to Sir Keir bowing to the pressure from MPs and the French president. And that's the towering figure who's in Scotland this weekend: the golfing president of the United States. When Donald Trump was asked about President Macron's vow to recognise Palestine in September, his response was brutal and bordering on condescending. \"What he says doesn't matter,\" the president told reporters at the White House as he headed for Air Force One. \"He's a very good guy. I like him, but that statement doesn't carry weight.\"  Ouch! But the US president's unflinching support for Israeli Prime Minister Benjamin Netanyahu places Sir Keir in an awkward spot: Caught between the opposing stances of the French and US presidents. The PM is, therefore, also under pressure from President Trump, and he won't want to fall out with him when he meets him this weekend. Hence, his carefully worded statement responding to the letter from the MPs. Appearing to try and please the US and French presidents - and the large number of Labour MPs backing Sarah Champion's letter - Sir Keir said he's \"working on a pathway to peace\" in the Middle East. He spoke of \"concrete steps\" to turn a ceasefire into a lasting peace and said recognition of a Palestinian state \"has to be one of those steps\", adding: \"I am unequivocal about that.\" And he concluded: \"But it must be part of a wider plan which ultimately results in a two-state solution and lasting security for Palestinians and Israelis. \"This is the way to ensure it is a tool of maximum utility to improve the lives of those who are suffering - which of course, will always be our ultimate goal.\" Read more from Sky News:Aid is sitting idle in Gaza - where there is now widespread malnutritionIsrael allows foreign countries to parachute aid into Gaza'Walking corpses' in Gaza - with one in five children malnourished, says UN As well as his own statement, the PM issued a joint statement with President Macron and German Chancellor Friedrich Merz, both of whom have held talks with Sir Keir in the UK in the past fortnight. That statement was tough, beginning: \"The time has come to end the war in Gaza.\" It went on: \"The humanitarian catastrophe that we are witnessing in Gaza must end now.\" Yet there's little sign of either the war or the humanitarian catastrophe ending any time soon. And that means that throughout parliament's summer break, MPs will no doubt continue to turn up the heat on the PM."
    },
    {
        "title": "Two teenagers sentenced to at least 15 years for machete murder of boy, 14, on London bus",
        "description": "Two teenagers have been sentenced to at least 15 years for the machete murder of 14-year-old Kelyan Bokassa on a bus.",
        "url": "https://news.sky.com/story/two-teenagers-sentenced-to-at-least-15-years-for-machete-murder-of-boy-14-on-london-bus-13401527",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-kelyan-bokassa-woolwich_6799155.jpg?20250114170315",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-25 15:15:00",
        "Headline": "Kelyan Bokassa was killed on 7 January in Woolwich in what prosecutors said was a planned attack. The defendants, now 16, stabbed him 27 times.",
        "Content": " Two teenagers have been sentenced to at least 15 years for the machete murder of 14-year-old Kelyan Bokassa on a bus. Kelyan was killed on 7 January in Woolwich, southeast London, in what prosecutors said was a planned attack. The defendants, now 16, who are too young to be named, stabbed him 27 times with machetes. They pleaded guilty in May, with one appearing to change his plea at the last moment, and both admitted possessing an offensive weapon.  On Friday, Judge Mark Lucraft KC sentenced the two boys to life in prison, with a minimum term of 15 years and 110 days before they can be considered for parole. One appeared to smile as he was sent down. The judge noted that during the attack, \"the CCTV shows you were smiling\", and said Kelyan's death was a \"senseless loss\" of another boy to the \"horrors of knife crime\". Marie Bokassa, Kelyan's mother, said later that the boys \"shattered an entire world\" in a statement read outside the court on her behalf.  Mother 'a broken soul' after murder Prosecutor Tom Little KC previously told the Old Bailey that Kelyan was attacked \"almost instantaneously\" by the boys on the top deck. The 14-year-old suffered a severed femoral artery during the attack, which happened in the middle of the afternoon in Woolwich Church Street, and died shortly after medics arrived. Marie Bokassa, Kelyan's mother, described herself in a victim impact statement on Friday as \"a broken soul whose life changed forever the day my child's life was taken from me by another child\". \"I ask myself what has happened to those two boys that has resulted in that terrible act of violence and I cannot imagine how can they be so angry,\" she added. \"What they did was horrific and I do not know what has led them to do this and maybe I will never. \"That moment of violence may have lasted seconds but its consequences are eternal.\" She then told the court she had spent her son's 15th birthday at his graveside, and said she is scared to take public transport - particularly the 472 bus route, on which her son was killed. \"I feel judged,\" Ms Bokassa said, before adding: \"These two young boys took my son's life without hesitation, they will now have to face the consequences of their actions here today. \"My only hope is they get the help they need before they ever get released into society.\" Young people urged to stop carrying knives Ms Bokassa said Kelyan's life \"was not theirs to take\" and pleaded with young people to stop carrying knives. \"I beg you to stop,\" she said. \"Before you raise that blade, think of your own mother, think of the mothers who will cry every night like I do, who will scream into her pillow, who will walk past her child's empty room and collapse with grief. \"Don't let a moment of anger steal your future. Don't let the streets raise you in a way your mother never would.\" Detective Chief Inspector Sarah Lee, whose team led the Metropolitan Police investigation, added: \"The harsh reality in London is that violence disproportionately affects young black men and boys. \"The fact we're seeing so many teenagers like Kelyan die should be at the forefront of the minds of every politician, every policy maker and everyone who wants better for children growing up in London. \"Without this collective effort, we won't be able to tackle knife crime in its entirety.\" Read more from Sky News:Top Boy actor charged with two counts of rapeTour de France shortens to avoid diseased cowsNew internet rules enforced from today Speaking after his death, Ms Bokassa said Kelyan had been groomed by gangs from the age of six, and she was not surprised when she found out he was dead. She said the pair had spent Christmas together, after he was previously in care for several years, but she was concerned he still had \"one foot in the streets\".  Ms Bokassa added she had tried to stop him from associating with gangs but did not get support from authorities. One of the machetes used in the attack was thrown in the River Thames but later recovered."
    },
    {
        "title": "Grammy-winning jazz singer Dame Cleo Laine dies",
        "description": "Grammy-winning jazz singer Dame Cleo Laine has died aged 97.",
        "url": "https://news.sky.com/story/grammy-winning-jazz-singer-dame-cleo-laine-dies-13401823",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-cleo-laine-laine_6973792.jpg?20250725215017",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-25 17:06:00",
        "Headline": "Dame Cleo was a leading figure of the British jazz music scene for many years and worked with the likes of Ray Charles and Frank Sinatra. ",
        "Content": "Grammy-winning jazz singer Dame Cleo Laine has died aged 97. Dame Cleo was a leading figure of the British jazz scene for many years and worked with the likes of Ray Charles and Frank Sinatra. Her famed scat singing style, her remarkable range from tenor to contralto and her smoky voice made her Britain's most successful jazz singer, earning her the nickname the First Lady of Jazz.   \"It is with deepest sadness that we announce the passing of our dearly beloved mother, Cleo, who died peacefully yesterday afternoon,\" her children Jacqui and Alec Dankworth said. \"We will all miss her terribly. The family wish to be given space to grieve and ask for privacy at this very difficult time.\" Dame Cleo's husband, saxophonist Sir John Dankworth, died aged 82 in 2010 after being a mainstay of the British jazz scene for more than 50 years. The couple founded a charity and venue called The Stables in 1970 to \"ensure young people have access to great music and music education\", David Meadowcroft, chairman of the charity, said, adding that The Stables would continue the couple's commitment. He added that Dame Cleo \"was a remarkable performer who was loved by audiences around the world\". Monica Ferguson, artistic director of The Stables, said the singer \"will be greatly missed, but her unique talent will always be remembered\". Born Clementina Dinah Campbell, the singer grew up with her Jamaican father and English mother in Southall, west London, where she was supported by her father's busking talents. She became a professional jazz singer in her mid-20s when she successfully auditioned for the Johnny Dankworth Seven in 1951 and changed her name to Cleo Laine. Seven years later, Dame Cleo married Sir John. Their son Alec was born in 1960, a year before his mother scored a top 10 hit with You'll Answer To Me, before daughter Jacqueline followed in 1963. In 1973, Dame Cleo and Sir John drew a sold-out crowd at New York's Carnegie Hall and launched a series of popular concerts. She received a Grammy Award for Best Jazz Vocal Performance for Cleo At Carnegie in 1986. Read more from Sky News:Top Boy actor charged with two counts of rapeAnother resignation after viral Coldplay concert video In the 1997 Birthday Honours, the singer became the first British jazz artist to be made a dame. Her career was later also honoured with a Life Achievement Award at the British Jazz Awards in 2002."
    },
    {
        "title": "Israel allows foreign countries to parachute aid into Gaza",
        "description": "Israel has said foreign countries can drop aid into Gaza from today.",
        "url": "https://news.sky.com/story/israel-allows-foreign-countries-to-parachute-aid-into-gaza-13401638",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-gaza-aid_6479479.jpg?20240305141412",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-25 11:40:00",
        "Headline": "Aid was dropped into Gaza last year, but humanitarian organisations warned it wasn't enough, and in March 2024, five people were killed when an aid parachute failed and supplies fell on them.",
        "Content": "Israel has said foreign countries can drop aid into Gaza from today. A senior IDF official told Sky News on Friday: \"Starting today, Israel will allow foreign countries to parachute aid into Gaza. \"Starting this afternoon, the WCK organisation began reactivating its kitchens.\" Latest: Starmer to have 'emergency' Gaza call with France and Germany  Humanitarian aid organisation World Central Kitchen paused its operation in Gaza in November after a number of its workers were killed in an Israeli airstrike last year. Aid workers in Gaza - who help provide food, medicine and shelter for the millions displaced there - have been affected by the ongoing conflict between Israel and Hamas. The Gaza Humanitarian Foundation - an Israel and US-backed organisation - has been distributing food packages in Gaza since the end of May, after Israel eased its 11-week blockade of aid into the territory. \n                  Dozens dead as storm sweeps through the Philippines\n                 \n                  Turkey faces 'truly great disaster', warns Erdogan amid raging wildfires and sweltering temperatures across Europe\n                 \n                  As fighting enters day two, neither Cambodia or Thailand seem willing to back down just yet\n                 More than 1,000 people have reportedly been killed while trying to receive food aid since then, according to the UN, with the territory facing a starvation crisis. Gaza's Hamas-run health ministry said on Friday that nine people have died of malnutrition in the past 24 hours. In a post on Facebook, the ministry said a total of 122 people, including 83 children, have died because of a lack of food since the war began. In the first two weeks of July, the UN children's agency UNICEF treated 5,000 children facing acute malnutrition in the Strip. On Friday, the UN warned that Gaza was running out of specialised therapeutic foods to treat malnourished children. Aid was air-dropped into the territory from military planes last year by countries, including Jordan, the US and the UK via the Royal Air Force, but humanitarian organisations warned it wasn't enough. It is also a potentially dangerous way to deliver supplies, and in March 2024, five people were killed when an aid parachute failed and a parcel fell on them. Communities correspondent Israel says there is no famine in Gaza – so why is it sanctioning an urgent international aid drop by air, particularly when doing so safely also means having a temporary pause in its bombardment of Gaza. The reality is – whatever the public message – Israel must be feeling the intense pressure from the international community and global aid organisations to ease its blockade.\n The UN secretary-general has said starvation is knocking on every door in Gaza.  The F word – famine – is even being talked about on Israeli television channels.\n We understand the Jordanian government is discussing playing a role in the aid drop and we already know that the UN says there is enough food stockpiled in Egypt and Jordan to feed Gazans for three months.\n Yet it hasn't reached hungry mouths in Gaza because Israel stands accused of making it simply too difficult to transport aid by road around a dangerous conflict zone for organisations, including the UN, which are trying to step in in the face of claims that the main sites run by the Gaza Humanitarian Foundation have turned into \"death traps\".\n Dropping large aid packages may be the quickest way to get food into Gaza, given the circumstances, but it is also very dangerous, because of the scramble that ensues amongst people trying to reach the supplies.\n However, this sign of movement in the aid crisis comes after a desperate week for Gazans fighting to survive hunger in a war zone.\n\n Israel will remind the world it stopped the old ways of aid distribution because it says aid was falling into the hands of the militant group Hamas, still holding 20 living Israeli hostages.\n\n There have also been reports of people drowning while trying to reach supplies that had fallen into the sea. Israel has been at war with Hamas in Gaza since the Palestinian militant group rampaged through southern Israel, killing 1,200 people, and taking around 250 hostage, on 7 October 2023. Israel has denied there is a food shortage in Gaza - despite earlier this week more than 100 aid agencies warning of mass starvation in Gaza - and claims it had to take control of the supply and distribution of aid because Hamas fighters have been stealing aid before it reached civilians. Hamas has denied this, as have some humanitarian groups, including USAID.  The IDF said in a statement on Friday it \"categorically rejects the claims of intentional harm to civilians, particularly in the manner described. For the sake of clarity, the army's binding orders prohibit forces operating in the area from intentionally firing at civilians\". Read more:People in Gaza are 'walking corpses'Recognise Palestine, Starmer urgedIDF 'shooting Gazans in specific areas' It added: \"We are aware of reports of casualties among those who arrived at the aid distribution sites. These incidents are under examination by the relevant IDF authorities. Any allegation of a violation of the law or regulations will be thoroughly investigated, including taking appropriate action if necessary.  \"The IDF is working to facilitate and ease the distribution of humanitarian aid in the Gaza Strip by the Gaza Humanitarian Foundation (GHF) at the designated distribution centres, as well as through other international actors. These efforts are being conducted under difficult and complex operational conditions. As part of its operational conduct, the IDF draws lessons and conducts systematic learning processes in order to improve its operational response.\""
    },
    {
        "title": "Dozens dead as storm sweeps through the Philippines",
        "description": "A fierce tropical storm has torn through the Philippines' mountainous north, in a week which has already seen floods and landslides claim at least 25 lives.",
        "url": "https://news.sky.com/story/tropical-storm-sweeps-through-the-philippines-leaving-at-least-25-dead-13401780",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-philippines-typhoon-co-may_6973277.jpg?20250725101642",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-25 15:42:00",
        "Headline": "President Ferdinand Marcos Jr. warned that country must adapt to the growing frequency of natural disasters caused by climate change.",
        "Content": "A fierce tropical storm has torn through the Philippines' mountainous north, in a week which has already seen floods and landslides claim at least 25 lives. Typhoon Co-may struck the town of Agno in Pangasinan province Thursday night with winds reaching speeds of 120 kilometres (74 miles) per hour. By Friday afternoon, as it moved northeast, the typhoon had weakened slightly. Co-may struck after seasonal monsoon rains drenched a vast part of the country for over a week. More than a dozen additional tropical storms are expected to strike the Southeast Asian nation before the end of the year, forecasts show. At least 25 deaths have been reported since last weekend, mostly due to flash floods, toppled trees, landslides, and electrocution, according to officials. A further eight people have been reported missing. Schools in the capital, Manila, remained closed for the third consecutive day on Friday, with classes also suspended in 35 provinces across the main northern region of Luzon. Over 80 towns and cities, mostly in Luzon, have declared a state of calamity, enabling quicker access to emergency funds and the freezing of prices on essential goods. The weather has forced 278,000 people to seek refuge in emergency shelters or with relatives. According to the government's disaster response agency, close to 3,000 homes have suffered damage. Thousands of military personnel, police officers, coast guard members, firefighters, and civilian volunteers have been deployed to assist in rescuing residents. \n                  Israel allows foreign countries to parachute aid into Gaza\n                 \n                  Turkey faces 'truly great disaster', warns Erdogan amid raging wildfires and sweltering temperatures across Europe\n                 \n                  As fighting enters day two, neither Cambodia or Thailand seem willing to back down just yet\n                 Philippines President Ferdinand Marcos Jr. visited emergency shelters Thursday in Rizal province to help distribute food packs to displaced residents. \"Everything has changed,\" Marcos said. He subsequently called an emergency meeting with disaster-response officials, warning that both the government and the public need to adapt to the increasing frequency and unpredictability of natural disasters due to climate change. The United States has pledged to provide military aircraft to assist in transporting food and other aid to remote areas if weather conditions deteriorate further. The Philippines is struck by around 20 typhoons and storms every year and frequently experiences earthquakes and volcanic activity, making it one of the world's most disaster-prone countries."
    },
    {
        "title": "Turkey faces 'truly great disaster', warns Erdogan amid raging wildfires and sweltering temperatures across Europe",
        "description": "Disaster zones have been declared in two provinces of Turkey as new wildfires broke out on the Mediterranean coast. ",
        "url": "https://news.sky.com/story/turkey-faces-truly-great-disaster-warns-erdogan-amid-raging-wildfires-and-sweltering-temperatures-across-europe-13401785",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-wildfire-turkey-karabuk_6972597.jpg?20250724134335",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-25 15:56:00",
        "Headline": "Thirteen people in Turkey have been killed by the wildfires so far, including 10 volunteers and forestry workers in the central Eskisehir province.",
        "Content": " Disaster zones have been declared in two provinces of Turkey as new wildfires broke out on the Mediterranean coast.  Smoke billowed across the sky in the popular resort of Antalya, with homes evacuated in the city centre and elsewhere. In the nearby city of Manavgat locals grabbed hoses and buckets to help firefighters, with aircraft dumping water from above. Other wildfires started on Friday in Adana and Mersin, further east along the coast.  Turkey's interior minister declared the western provinces of Izmir and Bilecik \"disaster areas\" after a month of fires in the country. President Recep Tayyip Erdogan also said on Friday that the country faced \"a truly great disaster\" and that 25,000 people were involved in the emergency effort. \n                  Cyprus attorney general appeals after five Israeli men cleared of gang raping British tourist in Ayia Napa\n                 \n                  How a British woman accused of lying about being gang-raped in Cyprus won a human rights case\n                 \n                  Why are 700 British troops being deployed to Cyprus?\n                 Thirteen people have been killed so far, including 10 volunteers and forestry workers in the central Eskisehir province on Wednesday. Cyprus has also been enduring one of its worst wildfires in living memory. Temperatures have reached 43C (109F) on the island this week. Two people were found dead in their car on Wednesday and scores of homes have been destroyed. Spain, Egypt, Jordan and Israel were providing assistance, and planes from the RAF base on the island were also helping. Elsewhere in southern Europe, firefighters in Albania have been dealing with a blaze in the mountainous forests near Elbasan. The devastating fires come amid dry, sweltering temperatures in southern parts of the continent. Greece's iconic Acropolis was forced to limit its hours this week as it approached the mid-40s, while there's also been intense heat in the Balkans. And it's not only southern Europe that's been getting abnormal heat: Finland broke a record this week after experiencing 14 straight days above 30C. The previous record of 13 days was set in 1972. Read more from Sky News:East and West Midlands officially in drought - which areas could be next?Top Boy actor charged with two counts of rapeWhere are hosepipe bans in place and what does it mean? Respite looks to be ahead, however, with many areas expected to cool to more usual levels next week. Most experts attribute the above-average temperatures for this time of year to human-caused climate change and say wildfires are likely to become more frequent. 2024 was the warmest year on record, with temperatures exceeding 1.5C above the pre-industrial era for the first time."
    },
    {
        "title": "As fighting enters day two, neither Cambodia or Thailand seem willing to back down just yet",
        "description": "The roads in northeastern Thailand are deserted. The only vehicles we pass are military trucks.",
        "url": "https://news.sky.com/story/as-fighting-enters-day-two-neither-cambodia-or-thailand-seem-willing-to-back-down-just-yet-13401689",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-child-si-sa-ket-province_6973575.png?20250725150845",
        "type": "World",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-07-25 13:35:00",
        "Headline": "Close to the border in Si Sa Ket province, Sky News heard the loud rumble and rattle of Thailand's clashes with Cambodia, the thump of artillery strikes, and the fairly constant exchange of gunfire.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  The roads in northeastern Thailand are deserted. The only vehicles we pass are military trucks. More than 130,000 people have now been evacuated. And we can soon hear why. Close to the border in Si Sa Ket province, we hear the loud rumble and rattle of clashes with Cambodia. The thump of artillery strikes, the fairly constant exchange of gunfire. It's the second day of fighting between these two neighbours and neither side seems willing just yet to back down. So many lives have been uprooted so quickly here. Read more: Why have tensions escalated between Thailand and Cambodia? \n                  Why have tensions escalated between Thailand and Cambodia - and is it safe to travel there?\n                 \n                  Eleven civilians killed as Thailand and Cambodia exchange fire in escalating border dispute\n                 \n                  13 women found guilty for selling babies for cash in Cambodia \n                  About an hour from the border, at Baan Nong Sanom Temple, more than 500 people have spent the night sleeping on the floor. They rushed from their homes in the early hours, most with only the clothes they were wearing. Ruehtairat Bula has lived through skirmishes with Cambodia before. But this time feels different, she says. \"This time is more violent. The Cambodian side is using strong weapons. They're dropping rockets into residential areas where civilians live. \"It's killing people, including students.\" She, like many here, was surprised at the number of civilians killed - at least 15 people have died, while Cambodia says one. \"I'm afraid that this moment will set a precedent,\" she says, her face full of worry. \"Cambodia and Thailand will be more divided and will feel the need to fight every time. And that's scary.\" The youngest evacuee here is just one month old. Others are in their eighties, frail and in need of medicine they were in too much of a rush to grab when they fled. Ampan Kongkaew, another evacuee, looks blindsided. \"It all happened too fast. I knew there would be fighting, but I didn't know it would be this quick. \"I couldn't pack my things in time. Everyone here only has the clothes they're wearing. There's elderly and sick people.\" In the border provinces, it's almost a mirror image. People huddled together at makeshift sites, looking dazed and uncertain. The Cambodian government has accused Thailand of using banned cluster munitions, and officials say seven sites have been hit. Allies on both sides are calling for peace, but neither Thailand nor Cambodia seem willing to back down just yet. The fighting follows two months of tensions over contested territory. But at the heart of this story is a feud between two political titans, two strongmen trying to influence this moment from the sidelines - Cambodia's former leader, Hun Sen and Thailand's former leader, Thaksin Shinawatra. The test for this region is whether the road to diplomacy will trump the long shadow of political dynasties. Read more from Sky News:Scots divided as Donald Trump heads to TurnberryBritish surgeon claims IDF 'deliberately' shooting Gaza boysAnother resignation after viral Coldplay concert video The fighting is ongoing, but the political risks of a major escalation are massive for both sides. An all-out war still seems highly unlikely - a ceasefire perhaps not far off. But days of pitched battles - that's still very plausible."
    },
    {
        "title": "Riverdance star Michael Flatley to make bid for Irish presidency, court hears",
        "description": "Riverdance star Michael Flatley is hoping to become Ireland's next president, a court has heard.",
        "url": "https://news.sky.com/story/riverdance-star-michael-flatley-to-make-bid-for-irish-presidency-court-hears-13401658",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-flatley-riverdance_6973450.jpg?20250725132545",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-25 12:12:00",
        "Headline": "Flatley said last week that the \"average person on the street\" is unhappy with the status quo and \"somebody has to speak for the Irish people\".",
        "Content": "Riverdance star Michael Flatley is hoping to become Ireland's next president, a court has heard. The revelation came out in a legal case over work done on his mansion in County Cork, the Castlehyde. Barrister Ronnie Hudson said there had been a \"material change in circumstances\" for Flatley and he's set to move back to Ireland in the next two weeks in the hope of running in autumn's election. A legal statement signed by the star's solicitor, Maxwell Mooney, was also submitted to the High Court stating Flatley would \"seek nominations to run for president of Ireland\". Flatley rose to fame when Riverdance, which features traditional Irish music and dance, became a phenomenon in the 1990s and went on to tour the world. It continues to be performed today. The choreographer and dancer also created and starred in Lord Of The Dance. The 67-year-old - who currently lives in Monaco - strongly hinted at a presidential bid last week, but said he hadn't made a final decision. \n                  Thomas 'Bomber' Kavanagh: Kinahan crime boss ordered to pay back £1.1m \n                 \n                  International experts join mass grave excavation at former mother and baby home in Ireland\n                 \n                  What happened at the Tuam mother and baby home - and why is the site now only being excavated?\n                 He told a radio interview he didn't think the Irish people had a \"true proper deep voice that speaks their language\". Flatley said the \"average person on the street\" is unhappy with the status quo and \"somebody has to speak for the Irish people\". Read more from Sky News:Powerboat driver dies after crashing into houseboatAnother resignation as fallout from Coldplay video deepens The role of president in Ireland is largely ceremonial and is currently held by Michael D Higgins, whose term ends on 11 November. The election is expected to take place at the end of October. A candidate needs nominations from at least 20 members of the Irish parliament or at least four local authorities. Those who've already met the criteria are former farming journalist and EU commissioner Mairead McGuinness, and former Galway mayor Catherine Connolly. Former MMA fighter Conor McGregor is among others who have also hinted they might run - although the prospect was universally rejected by other politicians in Ireland."
    },
    {
        "title": "Tour de France shortens stage to avoid diseased cows",
        "description": "A stage of the Tour de France has been shortened to avoid a herd of diseased cows, organisers said.",
        "url": "https://news.sky.com/story/tour-de-france-shortens-stage-to-avoid-diseased-cows-13401723",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-tour-de-france-cow_6973638.jpg?20250725155348",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-25 14:34:00",
        "Headline": "Stage 19, from Albertville to La Plagne, was cut from nearly 130km to 95km (81 miles to 59 miles), eliminating two of the five planned climbs during the gruelling mountain stage.",
        "Content": "A stage of the Tour de France has been shortened to avoid a herd of diseased cows, organisers said. Stage 19 of the 21-stage competition through the mountains from Albertville to La Plagne was cut from nearly 130km to 95km (81 miles to 59 miles), eliminating two of the five planned climbs. Organisers shortened the stage due to an outbreak of \"contagious nodular dermatitis\" found in a herd of cows in Col des Saisies, a 13.7km (8.5-mile) climb. \"The discovery of an outbreak of contagious nodular dermatitis affecting cattle in a herd located specifically in the Col des Saisies has necessitated the culling of the animals,\" the organisers of the Tour de France, ASO, said in a statement late Thursday. \"In light of the distress experienced by the affected farmers and in order to preserve the smooth running of the race, it has been decided, in agreement with the relevant authorities, to modify the route of Stage 19 (Albertville-La Plagne) and to avoid the ascent to the col des Saisies.\" The stage started one hour later than planned at 2.30pm local time (1.30pm UK time) and bypassed climbs in Cote d'Hery-sur-Ugine and Col des Saises and rejoining the original route near Beaufort. Read more from Sky News:Powerboat driver dies after crashing during raceTeenagers jailed for 15 years for machete murder \n                  Israel allows foreign countries to parachute aid into Gaza\n                 \n                  Dozens dead as storm sweeps through the Philippines\n                 \n                  Turkey faces 'truly great disaster', warns Erdogan amid raging wildfires and sweltering temperatures across Europe\n                 The tour is set to end in Paris on Sunday. Currently in the lead is three-time winner and defending champion Tadej Pogacar from Slovenia, who held a lead of four minutes and 26 seconds ahead of his rival Jonas Vingegaard after the completion of Stage 18 on Thursday."
    },
    {
        "title": "England rematch brings back memories for Spain - but not all of them are happy ones ",
        "description": "A return to a final and a rematch with England, brings back memories of how Spain reached the pinnacle of women's football.",
        "url": "https://news.sky.com/story/england-rematch-brings-back-memories-for-spain-but-not-all-of-them-are-happy-ones-13401453",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-luis-rubiales-kiss_6825462.jpg?20250221091929",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2025-07-25 03:46:00",
        "Headline": "Despite being crowned world champions, the Spanish women's team doesn't have many followers - with the Luis Rubiales scandal overshadowing the win.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n A return to a final and a rematch with England, brings back memories of how Spain reached the pinnacle of women's football. But regrettably for fans and players, also memories of how the euphoria of the World Cup triumph was tainted by the actions of the man entrusted to run Spanish football. And how the conviction of Luis Rubiales for sexual assault on the Sydney podium has not brought about the profound societal change hoped for. \"It was like a big shadow and things are getting better, but it's not enough yet for sure,\" said Spain fan Ina Penné. \"I think there's still people who say he didn't do anything wrong.\" Two years on, star striker Jenni Hermoso - who was subjected to the non-consensual kiss by her federation president in the celebrations - was omitted from the European Championship squad. It was presented as a performance-based decision, but Spain's all-time top scorer spoke obliquely on social media about \"environments with such bad energy\". So while \"it's over\" was the rallying cry across Spain in 2023, do fans feel the gender inequality exposed shifted attitudes? \n                  'No one should be subjected to racist abuse,' Meta tells Sky News - five days after England star Jess Carter quit social media\n                 \n                  Sarina Wiegman on the Euros final, the Lionesses as campaigners, and their late comebacks\n                 \n                  England v Spain: When is the Women's Euro 2025 final and where can you watch it?\n                 \"I feel like in England, when they won the Euros three years ago, there were so many changes,\" Penné said. \"And in Spain you still don't have the money. There were all the issues with the coach and everything. So I think they need to do a lot, still.\" Just look at the number of supporters following the team in Switzerland at the Euros. While the Spanish federation placed a makeshift stage in a Zurich street celebrating the team before their semi-final against Germany, the march to the stadium was sparsely attended. Contrast that to the thousands following England at their semi-final in Geneva a day earlier. And the Lionesses are European champions rather than world champions. \"We don't see a lot of change in Spain,\" said fan Elodie Cailliez. \"There are not many followers of the Spanish team. \"It was supposed to be a moment of change, but Spain won two years ago and we are almost at the same point.\" That is her perception from attending matches and trying to find coverage she hopes for across the Spanish media. England star Keira Walsh has a keen perspective having been playing at Barcelona until earlier this year. She shared a dressing room with World Cup winners, including Aitana Bonmatí and Alexia Putellas. \"I think they probably could have had more (respect),\" Walsh said at England's Zurich base. \"The way our league jumped after we won the Euros and everything in and around it, if you compare it to Spain, it probably wasn't the same and they won the World Cup. They probably could have had more support.\"  A revolt over the squad environment under Jorge Vilda had already seen some players refuse to play for the coach at that 2023 World Cup. He was fired in the weeks after the 1-0 victory over England in the fallout from Rubiales' kiss and attempt to cling to power. While Vilda was charged in the case alongside Rubiales, he was cleared in court of coercing Hermoso into downplaying the kiss. And he is back coaching, by coincidence this weekend in another final, leading Morocco at the Women's African Cup of Nations. \"You can see there that people don't really care about it,\" Penné said. \"They just put them to another team and that's it... it's insane.\"  Even England players are disappointed Spain's greatest day in women's football was sullied by Rubiales. Walsh said: \"After the game there was a lot of controversy and, I don't think for them, there was enough spotlight on how incredible they played and how incredible some of their players were. It was all about the other stuff that had gone on. \"As a professional, that was disappointing to see. I have a lot of friends in that team and I think they probably deserved a little bit more. Walsh will be hoping to inspire England to successive European titles. But how much will Spain reaching another final, would another title finally achieve the respect, the rights and the backing the players, fans and society have been calling for? It's not over yet for many following Spanish football."
    },
    {
        "title": "'Immigration is killing Europe': Donald Trump issues warning to leaders as he arrives in Scotland",
        "description": "Donald Trump has landed in Scotland ahead of a four-day trip, which includes high-level meetings, praising Sir Keir Starmer as \"a good man\" but also calling illegal migration a \"horrible invasion\" that was \"killing Europe\".",
        "url": "https://news.sky.com/story/immigration-is-killing-europe-donald-trump-issues-warning-to-leaders-as-he-arrives-in-scotland-13401882",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-scotland_6973967.jpg?20250725211441",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-25 19:14:00",
        "Headline": "After touching down at Prestwick Airport, the US President spoke about a wide range of topics, including illegal immigration, Jeffrey Epstein, his thoughts on Sir Keir Starmer and Sean Connery.",
        "Content": " Donald Trump has landed in Scotland ahead of a four-day trip, which includes high-level meetings, praising Sir Keir Starmer as \"a good man\" but also calling illegal migration a \"horrible invasion\" that was \"killing Europe\". Crowds gathered at Prestwick Airport in Ayrshire amid a major security operation for the US president's visit. Mr Trump told reporters: \"I like your prime minister. He's slightly more liberal than I am... but he's a good man... he got a trade deal done. It's a good deal for the UK.\" Trump latest: Donald Trump arrives in Scotland  The pair are expected to discuss potential changes to the UK-US trade deal which came into force last month. Trump left Air Force One to head to Turnberry, one of his Scottish golf courses. Part of the trip will include the opening of another course in Aberdeenshire, billed as \"the greatest 36 holes in golf\". \"There's no place like Turnberry. It's the best, probably the best course in the world. And I would say Aberdeen is right up there,\" the US president said. \"Sean Connery helped get me the [planning] permits. If it weren't for Sean Connery, we wouldn't have those great courses,\" he added. During the trip, President Trump will also hold discussions with Scotland's First Minister John Swinney and EU Commission President Ursula von der Leyen, who is keen to secure a trade deal with the US. Mr Trump told reporters there was \"a good 50-50 chance\" of an agreement with the EU but added there were \"maybe 20 different\" sticking points. EU diplomats say a deal could result in a broad 15% tariff on EU goods and half of the 30% Trump is threatening to impose by 1 August. The US president touched on illegal immigration and gave European leaders a stark warning. \"You better get your act together or you're not going to have Europe anymore. You got to get your act together,\" he said. \"But you're allowing it to happen to your countries and you got to stop this horrible invasion that's happening to Europe. Immigration is killing Europe,\" he told reporters.  He was also scathing about the installation of wind turbines across Europe. \"Stop the windmills. You're ruining your countries,\" he said. \"It's so sad. You fly over and you see these windmills all over the place, ruining your beautiful fields and valleys and killing your birds.\" Read more from Sky News:Epstein risks following TrumpGhislaine Maxwell questionedEpstein questions keep coming Domestically, President Trump faces the biggest political crisis of his second term in office over his administration's handling of files linked to disgraced financier and sex offender Jeffrey Epstein, who died in prison in 2019. He faced another round of questions after stepping off Air Force One. \"You're making a big thing over something that's not a big thing. I'm focused on making deals, not on conspiracy theories that you are,\" he said. Mr Trump added that \"now's not the time\" to discuss a pardon for Ghislaine Maxwell, Epstein's imprisoned accomplice.  👉 Follow Trump100 on your podcast app 👈 While the president's visit did attract some enthusiastic flag-waving supporters at Prestwick Airport, he is also likely to trigger a number of protests, prompting Police Scotland to call in support from other forces in the UK. The Stop Trump Scotland group has planned demonstrations on Saturday in Edinburgh, Aberdeen and Dumfries. About 70% of Scots have an unfavourable opinion of Trump, while 18% have a positive opinion, an Ipsos poll in March found. President Trump is staying at his Turnberry property on Scotland's west coast this weekend, before travelling to Aberdeenshire on Monday, where he will open a second 18-hole course. He is due to return to the UK in September for a state visit hosted by the King - the first world leader in modern times to undertake two UK state visits."
    },
    {
        "title": "Snipers, Secret Service sweeps and a personal chef on standby: Scotland awaits Trump's arrival",
        "description": "Donald Trump likes a wall. And now he has his very own 10ft-high metal barrier creating a fortress as he tees off for a weekend of politics, play and precision in Scotland.",
        "url": "https://news.sky.com/story/snipers-secret-service-sweeps-and-a-personal-chef-on-standby-scotland-awaits-trumps-arrival-13401094",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-trump-t-edinburgh_6973103.jpg?20250725021546",
        "type": "US",
        "Author": "Connor Gillies",
        "Date Published": "2025-07-25 01:05:00",
        "Headline": "Around 5,000 officers will be on the streets, with police coming from across the UK to ensure Mr Trump's visit passes safely. The president will later head to Aberdeen to visit his other Scottish golf course.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n Donald Trump likes a wall. And now he has his very own 10ft-high metal barrier creating a fortress as he tees off for a weekend of politics, play and precision in Scotland. An almost surreal contrast now exists in the tiny Ayrshire village of Turnberry. On one side, the stunning coastline and luxury hotel that bears the president's name. And on the other, an armed buffer zone with sniper teams and road checkpoints. This visit is unlike those that have gone before. The threat level and associated security on display is unprecedented following the attempted assassination of Trump at a campaign rally in the US. \"It would be inappropriate for me to plan an operation and not bear in mind what has happened,\" the senior officer in charge of this weekend's policing efforts told me. Turnberry, and its population of about 200 people, have this week witnessed a never-ending stream of Army trucks, terrorist sweeps, road checkpoints, airspace restrictions, sniper positions being erected and Secret Service agents roaming around. \n                  'Immigration is killing Europe': Donald Trump issues warning to leaders as he arrives in Scotland\n                 \n                  Ghislaine Maxwell answered justice department questions 'about 100 different people', her lawyer says\n                 \n                  Epstein questions keep coming as White House tightens its grip on who can answer them\n                 It is the most extensive security deployment in Scotland since the death of the late Queen in 2022. It is estimated around 5,000 officers will be on the streets, with teams coming from across the UK to assist. The spectacle primarily centres on Donald Trump coming to play golf before the arrival of Prime Minister Sir Keir Starmer for talks, likely on Monday. The president, whose mother was born on the Scottish island of Lewis, is then scheduled to travel to his Aberdeenshire resort where a new golf course is set to open. 'Trump is a decent boss' Stephanie Campbell and Leanne Maxwell live in Turnberry and used to work at the Trump-owned resort, like many other locals. The pair told Sky News the very first lesson staff at the resort are given is not in fine service or guest etiquette, but in how to respond to a bomb threat. It is claimed there are posters above the landline phones in the hotel with instructions on the worst-case scenario. Stephanie told Sky News: \"I had no issues working for him, he is a really decent boss. \"The last time he came there was an element of excitement, I think this time there comes with an added element of concern. \"It brings a lot higher threats and security and it's much more difficult for everybody in the area.\" Echoing her concerns, Leanne told Sky News: \"Security is obviously being bumped up. It's quite worrying. He's quite a man, ain't he?\" Sweeps of the rooms are carried out by US Secret Service agents after housekeeping staff complete their duties and Trump's meals, they say, are prepared by a personal chef to avoid the risk of poisoning. To the outside world, these measures seem standard for a US president. But to those who live in Turnberry, it's far from normal when they have a date with the commander-in-chief. Awkward encounters Prestwick Airport has become something of an American airbase in recent days. The infamous armoured limousine, known as \"The Beast\", has been spotted being wheeled out of a US military plane as the presidential motorcade prepares for his arrival tonight. Greeting the president at the doors of Air Force One will be the secretary of state for Scotland, Ian Murray, who previously supported a motion alleging Trump was guilty of \"misogynism, racism and xenophobia\". Another awkward encounter could come in the form of Scottish First Minister John Swinney's showdown with Mr Trump next week. Read more from Sky News:Trump told in May his name in Epstein files - reportTrump says US will 'win' AI race as plan unveiled The SNP leader, who publicly backed Kamala Harris in the presidential race, called for September's state visit to be scrapped after the Ukrainian president's visit to the White House descended into a shouting match live on TV earlier this year. Demonstrations are planned throughout the weekend, with marches and protests announced in Glasgow, Edinburgh and Aberdeen. Kirsty Haigh, from Scotland Against Trump, claims the president uses Scotland to \"cleanse his image\" and he should not be able to use the country as an \"escape\" from his views. She told Sky News: \"He should not be welcomed by us, by our leaders. \"We want to see a Scotland that is very different than [the] America that's being created.\""
    },
    {
        "title": "Ghislaine Maxwell answered justice department questions 'about 100 different people', her lawyer says",
        "description": "Ghislaine Maxwell answered \"every single question\" from the US justice department, her lawyer has said.",
        "url": "https://news.sky.com/story/ghislaine-maxwell-answered-justice-department-questions-about-100-different-people-her-lawyer-says-13401865",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ghislaine-maxwell-jeffrey-epstein_6973964.jpg?20250725211106",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-25 18:45:00",
        "Headline": "The deputy US attorney general previously announced she would be interviewed after Donald Trump's directive to release evidence about others who may have committed crimes. ",
        "Content": " Ghislaine Maxwell answered \"every single question\" from the US justice department, her lawyer has said. The imprisoned former girlfriend of convicted sex offender Jeffrey Epstein answered questions \"about 100 different people\" during one-and-a-half days of questioning in the federal courthouse in Tallahassee, Florida, her attorney David Oscar Markus said. Mr Markus said Maxwell \"answered those questions honestly, truthfully, to the best of her ability\" when she met with deputy attorney general Todd Blanche.   \"She never invoked a privilege. She never refused to answer a question, so we're very proud of her,\" Mr Markus added. Maxwell, who was jailed in 2022 for luring young girls to massage rooms for Epstein to abuse, is currently serving a 20-year prison sentence. Epstein, 66, was found dead in his cell at a Manhattan federal jail in August 2019 as he awaited trial on sex trafficking charges. His death was ruled a suicide. His case has generated endless attention and conspiracy theories due to his and Maxwell's links to famous people like royals, presidents and billionaires, including Donald Trump. Mr Trump is facing ongoing questions about the Epstein case. He denied prior knowledge of Epstein's crimes and claimed he cut off their relationship long ago.  The deputy US attorney general, Mr Blanche, announced earlier this week that Maxwell would be interviewed because of Mr Trump's directive to gather and release any credible evidence about others who may have committed crimes. Maxwell's lawyer, Mr Markus, praised Mr Blanche's approach. \"The deputy attorney general is seeking the truth. He asked every possible question, and he was doing an amazing job,\" he said. Mr Markus said Maxwell did not receive anything in return for answering the questions, but he acknowledged that Mr Trump could pardon her. \"Listen, the president this morning said he had the power to do so. We hope he exercises that power in the right and just way,\" Mr Markus said. When asked whether he had thought about a pardon or clemency for Maxwell, Mr Trump claimed he had not considered it. \"I'm allowed to do it, but it's something I have not thought about,\" he told reporters outside the White House. He later shut down another question, saying: \"I don't want to talk about that.\" Read more from Sky News:Analysis: Trump hopes to escape Epstein controversyScots divided as Trump heads to Turnberry Meanwhile, Maxwell's family have suggested the disgraced British socialite could use \"government misconduct\" to challenge her imprisonment. Her family have frequently claimed she \"did not receive a fair trial\", but legal appeals against her sex trafficking convictions have been rejected by the courts. Judges previously dismissed arguments from Maxwell's lawyers that she \"should never have been prosecuted\" because of a \"weird\" agreement drafted more than 15 years ago. The family argue that Maxwell should have been protected under an agreement Epstein had entered with the US Department of Justice in 2007, which agreed not to prosecute any of his co-conspirators. During her trial in 2021, Maxwell was described as \"dangerous\" by prosecutors, who told jurors about how she would entice vulnerable girls to go to Epstein's properties for him to sexually abuse. In a statement, her family said: \"Our sister Ghislaine did not receive a fair trial. Her legal team continues to fight her case in the courts and will file its reply in short order to the government's opposition in the US Supreme Court.\""
    },
    {
        "title": "What is Tea - the women-only app with millions of users?",
        "description": "Millions of women in the US have downloaded a \"dating advice\" app that claims it catches catfish, checks for hidden marriages and keeps users safe from men online.",
        "url": "https://news.sky.com/story/what-is-tea-the-women-only-app-with-millions-of-users-13401888",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-tea-app_6974079.jpg?20250726021804",
        "type": "US",
        "Author": "Dylan Donnelly, news reporter",
        "Date Published": "2025-07-25 19:32:00",
        "Headline": "According to App Store tracker SensorTower.com, Tea Dating Advice has become the most popular free app in America and is the number one lifestyle download.",
        "Content": "By Dylan Donnelly, news reporter  Millions of women in the US have downloaded a \"dating advice\" app that claims it catches catfish, checks for hidden marriages and keeps users safe from men online. According to App Store tracker SensorTower.com, Tea Dating Advice has become the most popular free app in the US, and is the number one lifestyle download. It also claimed earlier this week to have recently gained close to a million new users, and said on Instagram it has more than four million women \"in our community\". However, the women-only app has come under fire for being \"anti-men\", and for a data breach that saw 13,000 user photos leaked. But what is Tea? And why has it proved controversial? What is the app? Tea Dating Advice is a women-only app that allows users to anonymously post about men they are dating in the US. The app's website says it was launched \"to give women the tools they need to date safely\" - and offers AI-powered reverse image searching to catch catfish using fake images on dating profiles. It also offers phone number searching to check if men have \"hidden marriages\", background checks to look for criminal records, and a map of registered sex offenders. While these features aren't unique to Tea - with most being publicly accessible - the app offers them in one package. Tea also touts that it has \"the largest women's group chat in the US, where users share experiences, anonymous dating reviews, and support\". Sean Cook, a Bay Area tech executive, founded and self-funded the app in 2023 because his mother was catfished and talked to men with criminal records while dating online. Read more: 'It's not you, it's dating': Where is modern love going wrong? Who can use it? Only women can use the app, which requires users to register by creating a username including location, birth date, a photo and official identification. Tea says it deletes all photos after a review, where moderators approve or deny applications and verify if new users are women. All users who get accepted are promised anonymity outside of the usernames they choose, and taking screenshots of what's in the app is also blocked. Once approved, users can leave comments describing specific men as a \"red flag\" or \"green flag\", and share other information about them. Comments on Tea's Instagram show that applications aren't that straightforward however, with a number of people saying it takes days to be approved. While men cannot use the app, Tea says any takedown requests should be emailed to their support desk with their name, location, as much information as possible about the content in question, as well as a photo. Read more from Sky News:New internet rules come into force - here's what is changingMan tells how he conned dozens of womenThe frustrated entrepreneurs taking on dating  What are the concerns? Tea has faced a heavy backlash, with The Times calling it a \"man-shaming\" app, and a post in the MensRights subreddit saying it \"must be deleted\". Much like the Facebook pages it resembles, the app has also been criticised for devolving into places for gossip or for spreading possible misinformation about people. Sky's US partner network NBC News reported that judges in Illinois and California dismissed two defamation lawsuits filed by men who were posted in such Facebook groups. Writing for the culture website Dazed, Serena Swift said it's \"clear how an app like Tea could be abused\", noting doxxing - where private information about someone is shared online with malicious intent - and concerns about men \"who aren't abusers\" having their information published. Speaking to Fox 2, lawyer William Barnwell said men could have civil legal recourse if the posts affect their work, family life, or reputation as defamation might apply. A male-only version of the app - Cheeky - has also been launched, offering anonymous chats about dating. It says on it's official Instagram that it's \"our response to the Tea App\". However, NBC News reported the creator of Teaborn - a previous men-only alternative that climbed to number three in the free apps chart - had condemned its users for allegedly sharing revenge porn on that app. What happened with the Tea data breach? NBC News reported that thousands of accounts were leaked after a hacker managed to breach the company's database. Tea has confirmed the leak to Sky News, and said it had identified \"unauthorised access to one of their systems and immediately launched a full investigation to assess the scope and impact\". In preliminary findings, the company said the incident involved a legacy data storage system containing information from prior to February 2024. It is estimated that around 72,000 images - including approximately 13,000 images of selfies or selfies featuring a photo identification submitted during account verification and 59,000 images publicly viewable in the app from posts, comments and direct messages - were accessed. \"Protecting Tea users' privacy and data is their highest priority,\" it said. \"Tea is taking every necessary step to ensure the security of the platform and prevent further exposure.\" Posts on social media suggest the leak was first posted on 4chan and has been shared widely since then. Sky News has not independently verified any leaked information."
    },
    {
        "title": "Trump hopes to escape Epstein controversy, but story risks following him to Scotland",
        "description": "I knew Donald Trump when he was nothing.",
        "url": "https://news.sky.com/story/trump-hopes-to-escape-epstein-controversy-but-story-risks-following-him-to-scotland-13401446",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-ayrshire_6973467.jpg?20250725135624",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2025-07-25 02:17:00",
        "Headline": "Hundreds of extra police officers have been deployed to his golf courses in Turnberry and Aberdeenshire as an army of protestors mobilise for what they're calling a \"carnival of resistance\".",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n I knew Donald Trump when he was nothing. Nothing like he is today, to be precise. It was the 18 April 2006, and he had landed by helicopter at St Andrew's, on his way to survey a stretch of Aberdeenshire coastline he was going to turn into a golf course. He duly delivered and \"Trump International\" is a stunning addition to Scotland's golfing real estate, alongside his other course at Turnberry.  Back in 2006, Trump was big time and big news. He was the brand built on property and showbiz and, upon arrival, the star of TV's The Apprentice breezed his way through our interview, obliging us by pointing down the barrel of the camera and delivering his trademark \"you're fired\". We talked investment, Scottish roots and some local objections to the golf course. \n                  Trump in Scotland: Escaping Epstein?\n                 \n                  Inside the MAGA comeback of 2024\n                 \n                  Trump, Epstein and a 'bawdy' birthday card\n                 I said it was all a bit like the film Local Hero, which likened him to the rich guy played by Burt Lancaster and he seemed happy enough. Innocent times. Fast forward 20 years to President Trump and we are braced for his latest return 'home'. For this son of Scotland (his mother is from the Isle of Lewis), it's a homecoming from hell. Hellish on security logistics, at least. You might think a trip to the old country would carry an element of triumph, wrapped in a nation's pride. He's the prodigal who made president, after all - think Biden, Ireland, and the rock star welcome rolled out there for one of their own. Not so for President Trump. The dynamic's different with the Donald - the heartland he'll visit isn't loved up, it's locked down. Same as it ever was, whenever he lands in Scotland. Hundreds of extra police officers have been drafted from around the country to hermetically seal his golf courses in Turnberry and Aberdeenshire. A private trip in two very public settings demands a huge security operation, complicated by an army of protestors mobilising for what they're calling a \"carnival of resistance\". Demonstrations are planned over a range of causes - organisers cite \"threats\" to democracy, climate, the global economy and more. There is no cause untouched by a president of the US and none forgotten by this weekend's protests. Scotland leans left of Donald Trump, and critics will lean into an effort to let him know. It's an awkward setting for a charm offensive by Prime Minister Sir Keir Starmer and Scotland's First Minister John Swinney. As the biggest show in politics rolls into town, they will polish the script on trade negotiations, wary of a president distracted, unpredictable and prone to changing the plot. His distraction, of course, is the political drama back home. Read more from Sky News:Epstein questions remain for TrumpTrump knew he appears in Epstein files Trump will welcome a weekend under the radar as an opportunity to escape the Jeffrey Epstein controversy, but there's every chance the story will travel with him. Daily efforts to steer the media away from the scandal haven't stemmed the flow of persistent enquiry and revelations that cement Trump's relationship with Epstein in the public consciousness, and so further raise questions of cover-up."
    },
    {
        "title": "Another resignation as fallout from viral Coldplay concert video deepens",
        "description": "The woman who went viral after she was seen embracing a colleague at a Coldplay concert has resigned.",
        "url": "https://news.sky.com/story/woman-in-coldplay-concert-video-resigns-as-astronomers-chief-people-officer-days-after-ceo-13401457",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-coldplay-andy-byron_6968322.jpg?20250719094855",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-25 04:25:00",
        "Headline": "Coldplay's lead singer Chris Martin poked fun at the couple as they tried to hide from the camera - quipping: \"Either they're having an affair or they're very shy.\"",
        "Content": " The woman who went viral after she was seen embracing a colleague at a Coldplay concert has resigned. Kristin Cabot plunged her head into her hands and turned her back after appearing on giant screens at the gig in Boston. In a statement, the tech firm Astronomer confirmed she has stepped down as chief people officer. She was in the arms of Andy Byron at the time, who also resigned as the company's chief executive officer a few days ago. Coldplay's lead singer Chris Martin poked fun at the couple as they tried to hide from the camera - quipping: \"Either they're having an affair or they're very shy.\" The footage quickly went viral on social media, with Ms Cabot and Mr Byron later identified as the two people in the clip. After Mr Byron resigned, the company had said in a statement: \"Astronomer is committed to the values and culture that have guided us since our founding. \n                  Top Boy actor Micheal Ward charged with two counts of rape\n                 \n                  Grammy-winning jazz singer Dame Cleo Laine dies\n                 \n                  Riverdance star Michael Flatley to make bid for Irish presidency, court hears\n                 \"Our leaders are expected to set the standard in both conduct and accountability, and recently, that standard was not met.\" Astronomer has previously confirmed that \"no other employees were in the video\", with false reports online suggesting that another staff member had been at the event. Pete DeJoy, who has taken over as interim CEO, admitted on Monday that the company has faced an \"unusual and surreal\" amount of attention in recent days. On LinkedIn, he wrote: \"While I would never have wished for it to happen like this, Astronomer is now a household name.\" So-called \"kiss cams\" are a popular feature at gigs and sporting events, but the incident has inspired many fans to start ducking if they end up appearing on screen. Chris Martin, performing for the first time since the viral video last Saturday, also gave concertgoers a heads-up before the kiss cam sprang into action. He said: \"We'd like to say hello to some of you in the crowd. How we're gonna do that is we're gonna use our cameras and put some of you on the big screen. \"So please, if you haven't done your make-up, do your make-up now.\""
    },
    {
        "title": "Good economic news as sunny weather boosted retail sales",
        "description": "Retail sales grew in June as warm weather boosted spending and day trips, official figures show. ",
        "url": "https://news.sky.com/story/good-economic-news-as-sunny-weather-boosted-retail-sales-13401474",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-primark-oxford-street_6973127.jpg?20250725065151",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-07-25 05:43:00",
        "Headline": "Heat meant shoppers switched to online, which, along with market stalls, saw the biggest rise in nearly three years. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Retail sales grew in June as warm weather boosted spending and day trips, official figures show.  Spending on goods such as food, clothes and household items rose 0.9%, the Office for National Statistics (ONS) said. It's a bounce back from the 2.8% dip in May, but last month's figure was below economists' forecast 1.2% uplift as consumers dealt with higher prices from increased inflation. Money blog: The odd rules that could land you with a big fine on holiday Also weighing on spending was reduced consumer confidence amid talk of higher taxes, according to a closely watched indicator from market research firm GfK. Retail sales figures are significant as they measure household consumption, the largest expenditure in the UK economy. Growing retail sales can mean economic growth, which the government has repeatedly said is its top priority. \n                  US-listed Ulta Beauty swoops on high street chain Space NK\n                 \n                  New Look owners line up bankers to fashion high street exit\n                 \n                  Full list of 33 River Island shop closures\n                  Where have people been shopping? June's retail sales rise came as people bought more in supermarkets, and retailers said drinks sales were up. While hot and sunny weather boosted some brick-and-mortar shops, the heat led some to head online. Read more from Money:Satellite tracker Spaceflux reaches lift-off with £5m funding boostTrade war uncertainty prompts halt to eurozone rate cuts Non-store retailers, which include mainly online shops, but also market stalls, had sold the most in more than three years. Not since February 2022 had sales been so high as the Met Office said England had its warmest ever June, and the second warmest for the UK as a whole. The June increases suggest that the May drop was a bump in the road. When looked at as a whole, the first six months of the year saw retail sales up 1.7%. Filling up the car for day trips to take advantage of the sun played an important role in the retail sales growth. When fuel is excluded, the rise was smaller, just 0.6%. Welcome news Despite lower consumer sentiment and more expensive goods, consumers are benefitting from rising wages and are cutting back on savings. The ONS lifestyle survey - backed up by hard data like the Bank of England's money and credit figures - shows that households have rebuilt their rainy day savings and are cutting back on the amount of money they squirrel away each month."
    },
    {
        "title": "Former Poundland owner lines up advisers as restructuring looms",
        "description": "The former owner of Poundland is lining up advisers to supervise its transition to new shareholders through a court-sanctioned process that will involve store closures and job cuts at the discount retailer.",
        "url": "https://news.sky.com/story/former-poundland-owner-lines-up-advisers-as-restructuring-looms-13401612",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-money-poundland_6944222.jpg?20250617113739",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-25 10:55:00",
        "Headline": "Pepco Group has asked FRP Advisory to act as an observer for it as one of Britain's biggest discount retailers prepares to close shops and axe jobs under new owner Gordon Brothers, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The former owner of Poundland is lining up advisers to supervise its transition to new shareholders through a court-sanctioned process that will involve store closures and job cuts at the discount retailer. Sky News has learnt that Pepco Group, which is listed on the Warsaw Stock Exchange, is drafting in FRP Advisory weeks after it struck a deal to sell Poundland to Gordon Brothers. Industry sources said FRP had been asked by Pepco to act as an observer, with the High Court scheduled to sanction a restructuring plan in the last week of August. Under the proposed deal, 68 Poundland shops would close in the short term, along with two distribution centres. More shops are expected to be shut under Gordon Brothers over time, resulting in hundreds of job losses. Pepco is said to be particularly focused on IT systems which Poundland uses in common with Pepco's operations in Poland. Barry Williams, managing director of Poundland, said at the time of the deal's announcement: \"It's no secret that we have much work to do to get Poundland back on track. \n                  Money blog: Pound sinks against euro in blow for British holidaymakers\n                 \n                  Good economic news as sunny weather boosted retail sales\n                 \n                  Slow summer sales, phone launches and new online age protections\n                 \"While Poundland remains a strong brand, serving 20 million-plus shoppers each year, our performance for a significant period has fallen short of our high standards and action is needed to enable the business to return to growth. \"It's sincerely regrettable that this plan includes the closure of stores and distribution centres, but it's necessary if we're to achieve our goal of securing the future of thousands of jobs and hundreds of stores. Prior to the deal's announcement, Poundland employed roughly 16,000 people across an estate of over 800 shops in the UK and Ireland. Tax hikes announced by Rachel Reeves, the chancellor, in last autumn's Budget have increased the financial pressure on high street retailers. In recent months, chains including WH Smith, Lakeland and The Original Factory Shop have changed hands amid challenging circumstances. In June, Sky News revealed that River Island, the family-owned clothing retailer, was also working with advisers on a rescue plan aimed at averting its collapse. Pepco and Poundland declined to comment."
    },
    {
        "title": "Slow summer sales, phone launches and new online age protections",
        "description": "Darren McCaffrey talks to Deann Evans, managing director for EMEA (Europe, the Middle East and Africa) at ecommerce platform Shopify, about slower-than-expected sales.\n\n",
        "url": "https://news.sky.com/story/slow-summer-sales-phone-launches-and-new-online-age-protections-13401666",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-biz-podcast-podcast_6937464.jpg?20250609141833",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-25 12:39:00",
        "Headline": "No subtitle found",
        "Content": "Darren McCaffrey talks to Deann Evans, managing director for EMEA (Europe, the Middle East and Africa) at ecommerce platform Shopify, about slower-than-expected sales.\n\n Samsung's Annika Bizon, vice president of product and marketing, discusses a new line of devices. And Andy Lulham, chief operating officer at Verifymy, talks about tough new age verification rules online. :: Listen and subscribe to the Sky News Business Podcast here."
    },
    {
        "title": "TalkTalk dials up £100m investment from Ares Management",
        "description": "TalkTalk, the telecoms and broadband group, has secured a &#163;100m capital injection from one of its existing backers in a deal that will relieve the growing financial pressure on the company.",
        "url": "https://news.sky.com/story/talktalk-dials-up-163100m-investment-from-ares-management-13401562",
        "image_url": "https://e3.365dm.com/20/07/1920x1080/2372007270116501107_5051325.jpg?20201008152915",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-25 09:32:00",
        "Headline": "The funding injection from existing backer Ares forms part of a broader package worth about £200m including asset sales and the deferral of interest payments, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n TalkTalk, the telecoms and broadband group, has secured a £100m capital injection from one of its existing backers in a deal that will relieve the growing financial pressure on the company. Sky News has learnt that Ares Management has agreed to provide the new funding in two tranches, with the first £60m said to be imminent. A deal could be announced as soon as Friday afternoon, according to banking sources. Money blog: Pound sinks against Euro in blow for British holidaymakers The funding agreement comes amid discussions between TalkTalk and its bondholders about a potential break-up of the company, which would involve the sale of its consumer arm and PXC, its wholesale and network division. Those disposals are now not expected to be launched in the short term. One person close to the situation said that in addition to Ares's £100m commitment, TalkTalk had raised £50m from two disposals in March and June, comprising the sale of non-core customers to Utility Warehouse. \n                  Money blog: Pound sinks against euro in blow for British holidaymakers\n                 \n                  Good economic news as sunny weather boosted retail sales\n                 \n                  Former Poundland owner lines up advisers as restructuring looms\n                 There was also an in-principle agreement to defer cash interest payments and to capitalise those, which would be worth approximately £60m.TalkTalk has been grappling with a strained balance sheet for some time, and recently drafted in advisers from Alvarez & Marsal, the professional services firm, to assist its finance function. The group has more than 3m broadband customers, making it one of the largest players in the UK market. It completed a £1.2bn refinancing late last year, but has been under pressure from bondholders to raise additional capital. Read more from Sky News:UK's biggest lender expects two more interest rate cuts in 2025Trade war uncertainty prompts halt to eurozone rate cuts Last month, the Financial Times reported that BT's broadband infrastructure arm, Openreach, could block TalkTalk from adding new customers to its network in an escalating dispute over payments owed to BT Group. TalkTalk, which was taken private in 2021, and Ares both declined to comment."
    },
    {
        "title": "Over 200 MPs sign cross-party letter demanding Starmer recognise Palestine as a state",
        "description": "Sir Keir Starmer is under increasing pressure to recognise a Palestinian state, with 221 MPs signing a cross-party letter demanding he take the step.",
        "url": "https://news.sky.com/story/mass-cross-party-letter-demands-starmer-recognise-palestine-as-a-state-13401496",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-keir-starmer-downing-street_6966237.jpg?20250716154528",
        "type": "Politics",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-07-25 06:55:00",
        "Headline": "The letter is being organised by the Labour backbencher Sarah Champion, who also sits as the International Development Committee Chair. ",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  Sir Keir Starmer is under increasing pressure to recognise a Palestinian state, with 221 MPs signing a cross-party letter demanding he take the step. The letter is being organised by the Labour backbencher Sarah Champion, who also sits as the International Development Committee chair. They write: \"British recognition of Palestine would be particularly powerful given its role as the author of the Balfour Declaration and the former Mandatory Power in Palestine. \"Since 1980 we have backed a two-state solution. Such a recognition would give that position substance as well as living up to a historic responsibility we have to the people under that Mandate.\"  Explainer: What does recognising a Palestinian state mean?  Earlier this month, nearly 60 Labour MPs called on David Lammy and the Foreign Office to immediately recognise Palestine as a state in a private letter, but this new call shows how dissatisfied many still are with the government's refusal to change its stance on the issue. \n                  Sir Keir Starmer is caught between Trump, Macron and MPs over Palestine recognition\n                 \n                  What does recognising a Palestinian state mean - and will other countries follow in France's footsteps?\n                 \n                  Aid is sitting idle in Gaza - where there is now widespread malnutrition\n                 As Number 10 came under growing pressure, Sir Keir on Friday released a statement on Gaza calling the \"appalling scenes\" in the Strip \"unrelenting\". Israel has denied there is a food shortage in Gaza - despite earlier this week more than 100 aid agencies warning of mass starvation in Gaza - and claims it had to take control of the supply and distribution of aid because Hamas fighters have been stealing aid before it reached civilians. Hamas has denied this, as have some humanitarian groups, including USAID. Talking about the need for a regional \"lasting peace\", the prime minister said: \"Recognition of a Palestinian state has to be one of those steps. I am unequivocal about that. But it must be part of a wider plan which ultimately results in a two-state solution and lasting security for Palestinians and Israelis.\" Read more:British surgeon claims IDF shooting Gazans in specific areasFrance to become first G7 nation to recognise Palestine as a stateDozens of MPs call for UK to recognise Palestine as a state  In light of a tweet by the French President Emmanuel Macron, also sent last night, declaring France would recognise a Palestinian state in September at a UN conference, a number of MPs now say Number 10's current position is untenable. \"They had said they wanted to be in lockstep with allies, but this means that position won't hold,\" said one Labour MP.  US President Donald Trump, speaking to reporters at the White House before heading to Scotland, was dismissive of Mr Macron's statement. \"What he says doesn't matter,\" he said. \"He's a very good guy. I like him, but that statement doesn't carry weight.\" Israeli Prime Minister Benjamin Netanyahu said: \"We strongly condemn President Macron's decision to recognise a Palestinian state next to Tel Aviv in the wake of the October 7 massacre. Such a move rewards terror and risks creating another Iranian proxy, just as Gaza became. \"A Palestinian state in these conditions would be a launch pad to annihilate Israel - not to live in peace beside it. Peter Kyle, the technology secretary, on Friday morning defended the government's resistance to calls for immediate UK recognition of a Palestinian state. \"We want Palestinian statehood. We desire it, and we want to make sure the circumstances can exist where that kind of long-term political solution can have the space to evolve and make sure that it can become a permanent circumstance that can bring peace to the entire region,\" he told Sky News. \"But right now, today, we've got to focus on what will ease the suffering, and it is extreme, unwarranted suffering in Gaza that has to be the priority for us today.\"  An emergency call with Germany and France was scheduled for Friday to discuss what Sir Keir described as a \"human catastrophe\" which has \"reached new depths\". The Foreign Office has maintained it is committed to recognising a Palestinian state but has expressed a willingness to do so only when it will have the \"most impact in support of a peace process\". It said: \"We continue to provide lifesaving aid to support Palestinians in Gaza and the West Bank, and to work closely in support of the Palestinian Authority.\""
    },
    {
        "title": "Home Office threatens asylum seekers with homelessness if they refuse hotel move",
        "description": "Asylum seekers risk becoming homeless if they refuse accommodation under plans to end the use of expensive hotels. ",
        "url": "https://news.sky.com/story/home-office-threaten-asylum-seekers-with-homelessness-if-they-refuse-hotel-move-13401695",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-migrants-gravelines_6966714.jpg?20250717074802",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-07-25 13:49:00",
        "Headline": "The Home Office has accused some asylum seekers of 'gaming the system' by refusing to move into suitable accommodation. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Asylum seekers risk becoming homeless if they refuse accommodation under plans to end the use of expensive hotels.  Announcing the policy on Friday, the Home Office said some migrants were \"gaming the system\" by resisting efforts to move them into alternative housing without a valid reason. Politics Live: Macron lays out plan for France to recognise a Palestinian state. The new Failure to Travel policy means housing support will be removed from those who block transfer requests. The Home Office said this will \"ensure individuals who are moved from hotels to suitable alternative accommodation must take it\". They added: \"Those who refuse to move without a valid reason will now risk losing their housing and support. It is a firm but fair approach, aimed to end abuse of asylum support and contribute towards the closure of costly hotel accommodation. \"While the government has a duty to support all asylum seekers who would otherwise be destitute in appropriate accommodation, the new policy establishes clear consequences for those who game the system whilst protecting the vulnerable.\" \n                  Over 200 MPs sign cross-party letter demanding Starmer recognise Palestine as a state\n                 \n                  Sir Keir Starmer is caught between Trump, Macron and MPs over Palestine recognition\n                 \n                  France to become first G7 nation to recognise Palestine as a state\n                 There would be several steps before stripping someone of accommodation - with it being a last resort, Sky News understands. It follows a week of unrest outside a hotel in Epping used to house asylum seekers.  Several demonstrations have been held outside the Bell Hotel since 13 July, after an asylum seeker was charged with allegedly attempting to kiss a 14-year-old girl. Hadush Gerberslasie Kebatu, 38, from Ethiopia, denied sexually assaulting the 14-year-old girl at Chelmsford Magistrates' Court last week and will stand trial in August. On Thursday Epping council unanimously voted to urge the government to shut the site. Ministers are under pressure to restore order amid fears of further unrest, like that seen in Southport last summer. Labour has pledged to end the use of asylum hotels by the end of this parliament, a move chancellor Rachel Reeves has claimed will save £1bn a year. However there is a question mark as to how this will be achieved as Channel Crossings continue to rise. Nearly 20,000 migrants made the journey to the UK in the first six months of this year, a rise of almost 50% on the number crossing in 2024 and a new record for the first half of a year. Ministers say they inherited a \"broken system\", with 400 hotels being used to accommodate asylum seekers at the peak of the crisis under the Tories, costing £9 million per day. Minister for Border Security and Asylum, Dame Angela Eagle, said: \"We inherited an asylum system on the brink of collapse - mismanaged, under strain, and costing the public a fortune. We are getting a grip. \"We are working to close hotels, restore order, and put fairness and value for money at the heart of our asylum system. This government is making those necessary decisions to protect the taxpayer and uphold the integrity of our borders. \"These reforms to the Failure to Travel policy are another example of this government's action to transform the asylum accommodation system and crack down on those who abuse our system, so it operates fairly and saves the taxpayer money.\""
    },
    {
        "title": "Sir Keir Starmer is caught between Trump, Macron and MPs over Palestine recognition",
        "description": "Parliament may have shut up shop for a six-week summer break, but MPs and the French president are turning up the heat on Sir Keir Starmer over the Middle East.",
        "url": "https://news.sky.com/story/how-sir-keir-starmer-is-caught-between-trump-macron-and-mps-over-palestine-recognition-13401896",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sir-keir-starmer-india_6973976.jpg?20250725213125",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-07-25 20:04:00",
        "Headline": "In response to a call from more than one in three MPs to officially recognise Palestine as a state, Sir Keir Starmer's answer is essentially: Yes, but not yet.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Parliament may have shut up shop for a six-week summer break, but MPs and the French president are turning up the heat on Sir Keir Starmer over the Middle East. More than one in three of all 650 MPs have written to the prime minister calling on the UK to recognise a Palestinian state at a United Nations conference next week. In response to the call, his answer is essentially: Yes, but not yet. That, of course, won't satisfy the 222 MPs backing an all-party letter to the PM penned by the Labour MP Sarah Champion. The majority of names on the letter, predictably, are Labour, Lib Dem and SNP MPs. But there are some Tory big hitters too, including Father of the House Sir Edward Leigh and former cabinet minister Kit Malthouse. Until now, the PM and foreign secretary David Lammy have argued that the gesture of recognising Palestine on its own won't end what Sir Keir himself calls \"the appalling scenes in Gaza\". But the pressure for recognition isn't just coming from MPs. French President Emmanuel Macron has said France will recognise a Palestinian state at the UN General Assembly in September. Read more: What does recognising a Palestinian state mean?  Might Mr Macron - whose bromance with the PM during his state visit to the UK could not have been warmer - persuade Sir Keir to do the same? Possibly. He's not ruling it out. But there's one big obstacle to Sir Keir bowing to the pressure from MPs and the French president. And that's the towering figure who's in Scotland this weekend: the golfing president of the United States. When Donald Trump was asked about President Macron's vow to recognise Palestine in September, his response was brutal and bordering on condescending. \"What he says doesn't matter,\" the president told reporters at the White House as he headed for Air Force One. \"He's a very good guy. I like him, but that statement doesn't carry weight.\"  Ouch! But the US president's unflinching support for Israeli Prime Minister Benjamin Netanyahu places Sir Keir in an awkward spot: Caught between the opposing stances of the French and US presidents. The PM is, therefore, also under pressure from President Trump, and he won't want to fall out with him when he meets him this weekend. Hence, his carefully worded statement responding to the letter from the MPs. Appearing to try and please the US and French presidents - and the large number of Labour MPs backing Sarah Champion's letter - Sir Keir said he's \"working on a pathway to peace\" in the Middle East. He spoke of \"concrete steps\" to turn a ceasefire into a lasting peace and said recognition of a Palestinian state \"has to be one of those steps\", adding: \"I am unequivocal about that.\" And he concluded: \"But it must be part of a wider plan which ultimately results in a two-state solution and lasting security for Palestinians and Israelis. \"This is the way to ensure it is a tool of maximum utility to improve the lives of those who are suffering - which of course, will always be our ultimate goal.\" Read more from Sky News:Aid is sitting idle in Gaza - where there is now widespread malnutritionIsrael allows foreign countries to parachute aid into Gaza'Walking corpses' in Gaza - with one in five children malnourished, says UN As well as his own statement, the PM issued a joint statement with President Macron and German Chancellor Friedrich Merz, both of whom have held talks with Sir Keir in the UK in the past fortnight. That statement was tough, beginning: \"The time has come to end the war in Gaza.\" It went on: \"The humanitarian catastrophe that we are witnessing in Gaza must end now.\" Yet there's little sign of either the war or the humanitarian catastrophe ending any time soon. And that means that throughout parliament's summer break, MPs will no doubt continue to turn up the heat on the PM."
    },
    {
        "title": "Inside Jeremy Corbyn's new party: Is the Labour left making a comeback?",
        "description": "It was a very messy start to what the left hoped could be the most exciting left-wing movement in modern times.",
        "url": "https://news.sky.com/story/inside-the-messy-launch-of-jeremy-corbyns-new-party-13401443",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jeremy-corbyn-keir_6957272.jpg?20250724210513",
        "type": "Politics",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-07-25 00:38:00",
        "Headline": "Former Labour MP Zarah Sultana was missing from the launch of the new left-wing party, which she prematurely announced earlier this month. But even as Jeremy Corbyn confirmed the details on Thursday, the party does seem slightly in chaos.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  It was a very messy start to what the left hoped could be the most exciting left-wing movement in modern times. Jeremy Corbyn finally announced something Westminster had known for a while - that he was launching a new left-wing party with the former Labour MP Zarah Sultana to \"take on the rich and powerful\" and campaign for the redistribution of wealth. Politics latest: Labour 'full of control freaks', says Corbyn  They released a joint statement saying the system had been \"rigged\" for too long and they would offer an alternative to the \"control freaks\" within Labour as well as the \"dangerously divisive\" politics of Reform UK. It was a much slicker statement than earlier this month, when the young firebrand Zarah Sultana sent a statement only 10 minutes after a Zoom meeting where a loose discussion over the structure of the party had been agreed, stating she would leave Labour to join the new left-wing party. Corbyn was so unhappy with this he only responded publicly two days later - his team described the timing of the announcement as \"unfortunate\". This inevitably led to claims of factualism and the long left tradition of splitism. But even as the party is formally announced, it still lacks a name. \n                  Jeremy Corbyn and Zarah Sultana announce new political party\n                 \n                  Starmer would be foolish not to recognise the threat posed by a left-wing Corbyn party\n                 \n                  How easy is it to set up a new political party?\n                 When I asked Jeremy Corbyn this, he said it was \"your party\" and as such the grassroots should choose the name. When I asked if this was a well thought out party, he denied that the communications plan was messy.  One insider closely connected to the new party's strategy told me: \"The problem is Jeremy listens to everyone and as a result things take longer, there are lots of deliberations - that's what's been holding things up.\" But most people are happy with the agreed structure, one senior politician in the party told me: \"I'm team both - Jeremy is the older statesman, and Zarah is the future of the party. We are thrilled to get Zarah and her social media followers.\" There's no doubt that while a lot has been done behind closed doors, the party does seem slightly in chaos. Still to be worked out is the party branding, the logo, how they will be affiliated with other organisations, they haven't registered with the Electoral Commission, and one insider working on the communications side said they had wanted a big slick website before launching. A big unknown is the issue of party donors. They know they don't have the backing that other parties have, and they understand they require a lot of money to keep this all ticking along.  They confirmed they will have an inaugural conference sometime in the autumn and an assembly before that to decide on a few more things - potentially the name. \"Some people want a pre-conference to decide all of these things, but it will be decided by the same group that decided that Jeremy and Zarah should co-lead.\" What they do have going for them is support, even at this early stage. Jeremy Corbyn told me they have an average of 500 people per minute signing up and only five hours after their official launch, they had 80,000 members. And when you hear them talk about what the party will do, you can understand why. It's a list of where they think the government has failed. And that list is long: personal independence payment (PIP), the welfare rebellion, winter fuel chaos and above everything else, Gaza. Read more from Sky News:Starmer must not ignore Corbyn threatPM sends rebel Labour MPs warningHow easy is it to create a new party? Timing in politics is everything and the Labour left are seizing on a bit of a moment. One year on from Labour's loveless landslide, the cracks are forming. One member who was included in the new party's earliest Zoom calls said they understand where they might have success: \"There's a lot of appetite for an anti-establishment movement that doesn't bash migrants. The Labour Party has left a massive gap when it abandoned people on immigration and Palestine.\" Another left-wing activist still in the party says it's only capturing people who got kicked out of the party anyway. But Labour gave the most withering response of all. A source said: \"The electorate has twice given its verdict on a Jeremy Corbyn-led party.\" As we go into recess, it's clear what all this organisation is about. Someone on the organisation committee told me they've been gearing up for next year's local elections for a while now. They've been speaking to independent groups and formed a sub-committee of councillors with about 200 people already on board. A vice chair of this group described themselves to me as \"foot soldiers waiting for their orders\". The new party expects Labour to get a hammering or, in their words, they think \"Labour is f*****\". At the last locals, Reform got a boost and this time the left think it's theirs for the taking. \"You can't make things happen overnight, look at Reform who came out of UKIP - these things don't come out of nowhere.\" Keir Starmer started his premiership attempting to crush the left and probably thought coming into power they were safely sealed inside a tomb. They wanted to prove him wrong, and two of the Labour party's most popular and rebellious former MPs now plan to take him on."
    },
    {
        "title": "Govt 'shadowy' to reveal Rayner warning about social cohesion in 'readout', Harriet Harman says",
        "description": "It was \"shadowy\" of the government to reveal Angela Rayner warned about the threat to social cohesion in a \"readout\", Harriet Harman has said.",
        "url": "https://news.sky.com/story/govt-shadowy-to-reveal-rayner-warning-about-social-cohesion-in-readout-harriet-harman-says-13401155",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-harman-beth-dysfunction_6962192.png?20250710200101",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-25 01:58:00",
        "Headline": "Number 10 said the deputy prime minister had told ministers they needed to show there was a plan to address concerns after the Southport riots.",
        "Content": "It was \"shadowy\" of the government to reveal Angela Rayner warned about the threat to social cohesion in a \"readout\", Harriet Harman has said. On Wednesday, Downing Street released a \"cabinet readout\" saying the deputy prime minister told ministers the government \"had to show it had a plan to address people's concerns\" to defuse community tensions. She said immigration was having a \"profound impact on society\" and noted 17 out of 18 places where protests broke out last summer after kicking off in Southport were the most deprived areas in Britain. This was widely interpreted as a warning that riots could happen this summer. But Baroness Harman told Beth Rigby on the Electoral Dysfunction podcast that announcing it in a \"readout\" - given to journalists after a cabinet meeting - was not the way to do things. \"These are quite huge issues - the potential for disorder, social integration, the public mood, and ahead of summer,\" the Labour peer said. \"I don't know whether I'm just a bit old-fashioned about this, but I think it's better when government are making statements like that they give people an opportunity to ask questions rather than this kind of sort of rather shadowy way of doing it.\" \n                  Over 200 MPs sign cross-party letter demanding Starmer recognise Palestine as a state\n                 \n                  Home Office threatens asylum seekers with homelessness if they refuse hotel move\n                 \n                  Sir Keir Starmer is caught between Trump, Macron and MPs over Palestine recognition\n                 Read more: Essex Police say Farage claims about migrant hotel protest are 'categorically wrong'  The former minister added that cabinet meetings are supposed to be secret so that everybody around the table can speak and say \"anything they want because there is this protected thing\". \"You don't say what's happening at cabinet,\" she added. \"And if anybody asks in the House of Commons or anywhere else, what happened in cabinet, the automatic response is 'we don't talk about what's happened in cabinet, it's private'. And they've sort of slightly breached that now. \"So is it now a situation where anybody can be asked, what did somebody say in cabinet? \"Or is it only that the prime minister can say what happened in cabinet? \"It's a bit puzzling.\" Baroness Harman's comments came after protests in Epping last week outside a hotel housing asylum seekers turned violent. More than 1,000 people gathered outside The Bell Hotel in protests over two nights after an asylum seeker was arrested and charged on suspicion of alleged sexual assault of a 14-year-old girl in the town. Counter-protesters joined, and this week Reform UK leader Nigel Farage accused Essex Police of bussing them in, which the force said was \"categorically wrong\"."
    },
    {
        "title": "Is the government preparing for a summer of riots? ",
        "description": "<a href='https://podcasts.apple.com/us/podcast/electoral-dysfunction/id1613562765' target='_blank'> 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈</a> ",
        "url": "https://news.sky.com/story/is-the-government-preparing-for-a-summer-of-riots-13401237",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-electoral-dysfunction_6862564.png?20250320204606",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-25 04:22:00",
        "Headline": "No subtitle found",
        "Content": " 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈  Summer is here and the government is worrying about riots on the streets. In their final episode of this political term, Beth, Ruth and Harriet unpack No 10's briefing this week that Angela Rayner has warned about the risk of civil unrest, almost a year on from the murders in Southport that sparked a summer of violent protests. So what is the government's strategy? And what's really going on in towns like Epping, where asylum hotels have sparked backlash this week? Plus, the return of Sir James Cleverly to the Tory frontbench: is this the start of a Conservative revival or just more reshuffling? Remember, you can also watch us on YouTube."
    },
    {
        "title": "What is Tea - the women-only app with millions of users?",
        "description": "Millions of women in the US have downloaded a \"dating advice\" app that claims it catches catfish, checks for hidden marriages and keeps users safe from men online.",
        "url": "https://news.sky.com/story/what-is-tea-the-women-only-app-with-millions-of-users-13401888",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-tea-app_6974079.jpg?20250726021804",
        "type": "Technology",
        "Author": "Dylan Donnelly, news reporter",
        "Date Published": "2025-07-25 19:32:00",
        "Headline": "According to App Store tracker SensorTower.com, Tea Dating Advice has become the most popular free app in America and is the number one lifestyle download.",
        "Content": "By Dylan Donnelly, news reporter  Millions of women in the US have downloaded a \"dating advice\" app that claims it catches catfish, checks for hidden marriages and keeps users safe from men online. According to App Store tracker SensorTower.com, Tea Dating Advice has become the most popular free app in the US, and is the number one lifestyle download. It also claimed earlier this week to have recently gained close to a million new users, and said on Instagram it has more than four million women \"in our community\". However, the women-only app has come under fire for being \"anti-men\", and for a data breach that saw 13,000 user photos leaked. But what is Tea? And why has it proved controversial? What is the app? Tea Dating Advice is a women-only app that allows users to anonymously post about men they are dating in the US. The app's website says it was launched \"to give women the tools they need to date safely\" - and offers AI-powered reverse image searching to catch catfish using fake images on dating profiles. It also offers phone number searching to check if men have \"hidden marriages\", background checks to look for criminal records, and a map of registered sex offenders. While these features aren't unique to Tea - with most being publicly accessible - the app offers them in one package. Tea also touts that it has \"the largest women's group chat in the US, where users share experiences, anonymous dating reviews, and support\". Sean Cook, a Bay Area tech executive, founded and self-funded the app in 2023 because his mother was catfished and talked to men with criminal records while dating online. Read more: 'It's not you, it's dating': Where is modern love going wrong? Who can use it? Only women can use the app, which requires users to register by creating a username including location, birth date, a photo and official identification. Tea says it deletes all photos after a review, where moderators approve or deny applications and verify if new users are women. All users who get accepted are promised anonymity outside of the usernames they choose, and taking screenshots of what's in the app is also blocked. Once approved, users can leave comments describing specific men as a \"red flag\" or \"green flag\", and share other information about them. Comments on Tea's Instagram show that applications aren't that straightforward however, with a number of people saying it takes days to be approved. While men cannot use the app, Tea says any takedown requests should be emailed to their support desk with their name, location, as much information as possible about the content in question, as well as a photo. Read more from Sky News:New internet rules come into force - here's what is changingMan tells how he conned dozens of womenThe frustrated entrepreneurs taking on dating  What are the concerns? Tea has faced a heavy backlash, with The Times calling it a \"man-shaming\" app, and a post in the MensRights subreddit saying it \"must be deleted\". Much like the Facebook pages it resembles, the app has also been criticised for devolving into places for gossip or for spreading possible misinformation about people. Sky's US partner network NBC News reported that judges in Illinois and California dismissed two defamation lawsuits filed by men who were posted in such Facebook groups. Writing for the culture website Dazed, Serena Swift said it's \"clear how an app like Tea could be abused\", noting doxxing - where private information about someone is shared online with malicious intent - and concerns about men \"who aren't abusers\" having their information published. Speaking to Fox 2, lawyer William Barnwell said men could have civil legal recourse if the posts affect their work, family life, or reputation as defamation might apply. A male-only version of the app - Cheeky - has also been launched, offering anonymous chats about dating. It says on it's official Instagram that it's \"our response to the Tea App\". However, NBC News reported the creator of Teaborn - a previous men-only alternative that climbed to number three in the free apps chart - had condemned its users for allegedly sharing revenge porn on that app. What happened with the Tea data breach? NBC News reported that thousands of accounts were leaked after a hacker managed to breach the company's database. Tea has confirmed the leak to Sky News, and said it had identified \"unauthorised access to one of their systems and immediately launched a full investigation to assess the scope and impact\". In preliminary findings, the company said the incident involved a legacy data storage system containing information from prior to February 2024. It is estimated that around 72,000 images - including approximately 13,000 images of selfies or selfies featuring a photo identification submitted during account verification and 59,000 images publicly viewable in the app from posts, comments and direct messages - were accessed. \"Protecting Tea users' privacy and data is their highest priority,\" it said. \"Tea is taking every necessary step to ensure the security of the platform and prevent further exposure.\" Posts on social media suggest the leak was first posted on 4chan and has been shared widely since then. Sky News has not independently verified any leaked information."
    },
    {
        "title": "'No one should be subjected to racist abuse,' Meta tells Sky News - five days after England star Jess Carter quit social media",
        "description": "Instagram's owners have taken five days to respond publicly to racism suffered by England star Jess Carter - and to raise issues about a Sky News interview with the head of the Football Association about the abuse.",
        "url": "https://news.sky.com/story/no-one-should-be-subjected-to-racist-abuse-meta-tells-sky-news-five-days-after-england-star-jess-carter-quit-social-media-13401852",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jess-carter-england_6969249.jpg?20250720142428",
        "type": "Technology",
        "Author": "Rob Harris",
        "Date Published": "2025-07-25 18:11:00",
        "Headline": "FA chief executive Mark Bullingham told Sky News on Thursday he had received no direct contact from Meta, which owns Instagram, and said it had \"avoided responsibility\".",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  Instagram's owners have taken five days to respond publicly to racism suffered by England star Jess Carter - and to raise issues about a Sky News interview with the head of the Football Association about the abuse. While the FA and police had been in operational discussions with social media platforms, FA chief executive Mark Bullingham told Sky News on Thursday he had received no direct contact and said they had \"avoided responsibility\". In a statement breaking its silence, Meta told Sky News: \"We're surprised to read these comments since we have been working directly with the FA and UEFA both before and during this tournament.\"    Carter went public on Sunday with the online hate she has been facing throughout England's defence of the European Championship title - removing herself from social media. Sky News immediately asked Instagram owner Meta for comment, with follow-ups including DMs to Instagram head Adam Mosseri. The response from Meta's Press Office only came late on Friday to ask us to update our coverage of Thursday's interview with Mr Bullingham \"ASAP\" as \"it's really important in the lead up to Sunday's game that your readers know we're firmly taking action on this matter\". We first asked Meta for comment before we aired an interview with Kick It Out chairman Sanjay Bhandari, who said social media companies have \"actually gone backwards over the last four or five years, not forwards. It's got worse on social media, not better\". There was no response at the time to explain what Meta was doing - only to counter comments from the FA at the end of the week. \"No one should be subjected to racist abuse and we remove this content when we find it,\" Meta asked us to attribute to an unnamed spokesperson. \"We're surprised to read these comments [from Mr Bullingham] since we have been working directly with the FA and UEFA both before and during this tournament. \"We have proactively removed a number of violating comments and taken action against accounts which break our rules. \"We've also developed several tools to help protect people from having to see abuse, including Hidden Words which filters offensive comments and DMs. \"No one thing will stop racist behaviour overnight, but we'll continue working to protect our community from abuse and cooperate with police investigations.\" The email from Meta ended: \"Let me know if you have any questions.\" Read more from Sky News:Epping council demands government close asylum hotelNew internet rules enforced from todayDoctors on strike want what Labour does not have Two hours after sending that, there was no response to follow-up requests to discuss the issues raised. X still has not responded to Sky News after five days. The Lionesses play Spain in Sunday's Euros final."
    },
    {
        "title": "Turkey faces 'truly great disaster', warns Erdogan amid raging wildfires and sweltering temperatures across Europe",
        "description": "Disaster zones have been declared in two provinces of Turkey as new wildfires broke out on the Mediterranean coast. ",
        "url": "https://news.sky.com/story/turkey-faces-truly-great-disaster-warns-erdogan-amid-raging-wildfires-and-sweltering-temperatures-across-europe-13401785",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-wildfire-turkey-karabuk_6972597.jpg?20250724134335",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-07-25 15:56:00",
        "Headline": "Thirteen people in Turkey have been killed by the wildfires so far, including 10 volunteers and forestry workers in the central Eskisehir province.",
        "Content": " Disaster zones have been declared in two provinces of Turkey as new wildfires broke out on the Mediterranean coast.  Smoke billowed across the sky in the popular resort of Antalya, with homes evacuated in the city centre and elsewhere. In the nearby city of Manavgat locals grabbed hoses and buckets to help firefighters, with aircraft dumping water from above. Other wildfires started on Friday in Adana and Mersin, further east along the coast.  Turkey's interior minister declared the western provinces of Izmir and Bilecik \"disaster areas\" after a month of fires in the country. President Recep Tayyip Erdogan also said on Friday that the country faced \"a truly great disaster\" and that 25,000 people were involved in the emergency effort. \n                  Cyprus attorney general appeals after five Israeli men cleared of gang raping British tourist in Ayia Napa\n                 \n                  How a British woman accused of lying about being gang-raped in Cyprus won a human rights case\n                 \n                  Why are 700 British troops being deployed to Cyprus?\n                 Thirteen people have been killed so far, including 10 volunteers and forestry workers in the central Eskisehir province on Wednesday. Cyprus has also been enduring one of its worst wildfires in living memory. Temperatures have reached 43C (109F) on the island this week. Two people were found dead in their car on Wednesday and scores of homes have been destroyed. Spain, Egypt, Jordan and Israel were providing assistance, and planes from the RAF base on the island were also helping. Elsewhere in southern Europe, firefighters in Albania have been dealing with a blaze in the mountainous forests near Elbasan. The devastating fires come amid dry, sweltering temperatures in southern parts of the continent. Greece's iconic Acropolis was forced to limit its hours this week as it approached the mid-40s, while there's also been intense heat in the Balkans. And it's not only southern Europe that's been getting abnormal heat: Finland broke a record this week after experiencing 14 straight days above 30C. The previous record of 13 days was set in 1972. Read more from Sky News:East and West Midlands officially in drought - which areas could be next?Top Boy actor charged with two counts of rapeWhere are hosepipe bans in place and what does it mean? Respite looks to be ahead, however, with many areas expected to cool to more usual levels next week. Most experts attribute the above-average temperatures for this time of year to human-caused climate change and say wildfires are likely to become more frequent. 2024 was the warmest year on record, with temperatures exceeding 1.5C above the pre-industrial era for the first time."
    },
    {
        "title": "New internet rules enforced from today - but this grieving mother is sceptical they will work",
        "description": "\"People always think: 'Oh, that's not going to happen to me, it's not going to happen to my child,'\" says Ellen Roone.&#160;",
        "url": "https://news.sky.com/story/new-internet-rules-enforced-from-today-but-this-grieving-mother-is-sceptical-they-will-work-13401388",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jools-ofcom_6973023.jpg?20250725093319",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-07-25 00:53:00",
        "Headline": "Today, amid scepticism, Ofcom begins enforcing new rules to protect the UK's children online.",
        "Content": "\n          Science and technology reporter\n        \"People always think: 'Oh, that's not going to happen to me, it's not going to happen to my child,'\" says Ellen Roone.  She's sitting in her peaceful garden in Cheltenham, bumblebees trundling around in the bushes behind her. \"I didn't expect it to be my child.\" Jools, Ellen's son, was 14 years old when he took his life in 2022. It's thought he had been watching harmful content online when he died. Ellen was the one who found him. Jools was funny, into martial arts - in fact, he was a black belt in kung fu at just 10 years old - and he was popular. This weekend, his school friends are all heading to Ellen's house to help her mark what should be his 18th. They come every year to celebrate his birthday, and there are signs of how loved he is all over the house - pictures, a small wooden dinghy painted red in the garden, his name written down the side in curly script. When Jools passed away, Ellen became part of a small but growing group of parents in the UK whose children have died after seeing harmful content on the internet. Today, Ofcom, the communications regulator, begins enforcing new rules to protect the UK's children online. Read more: New internet rules come into force - here's what will change 'New rules don't go far enough' The new rules mean \"highly effective\" age verification systems must be in place on pornographic content, and social media algorithms must be altered to stop harmful content popping up on young people's feeds. But Ellen, and many of the bereaved parents she campaigns with, aren't satisfied - for them, the rules don't go far enough. \"At the moment, you've got massive gaps still where it's not safe,\" she says. \"Online platforms are having to do age verification. Is that going to work? Children are quite clever. They find loopholes of how to get around these things.\"  Teens: Internet a 'malicious place' She's not alone in her scepticism. More than a hundred miles away in a Warrington youth club, a group of 15 teenagers have given up one of their first afternoons of summer holidays to talk about what they've seen online. When asked if they've seen harmful or inappropriate content online, one of them, a 17-year-old called Amy, replies: \"More than I can count.\" When she describes the things she has been sent or scrolled through on social media, it's clear she's not exaggerating. Ryan, another 17-year-old, nonchalantly describes the internet as a \"very, very malicious place\". \"If you're going into an online space and you're expecting simplicity and everything to be nice and tame, you're going in quite naive,\" he says. Lucas and his twin brother are just 12 years old and even they've seen language that \"can be quite explicit for children around my age\", he says. But the young people here at Warrington Youth Zone aren't all convinced these new rules are going to make a difference. Many of them assume their peers will just find ways around the content controls. \"If people are that determined to have an over-18s account, nothing is really going to stop them,\" says 15-year-old Freya. Warning of 'steep sanctions' Peter Kyle, the technology secretary, is more optimistic. \"This is a moment where the safety of children online is going to take the biggest step forward since the creation of the internet,\" he told Sky News. \"Finally, we [have] platforms who are having to verify people's age before they access material and there will be very steep sanctions if material finds its way into children's hands and it is inappropriate,\" he says. He's proud of these new regulations; they are the first of their kind in this country. Not only are there much stricter rules in place, Ofcom, the communications regulator, also has significant powers if companies don't comply. Read more from science and technology:Donald Trump declares US is going to 'win' AI race'Thousands of cancer cases could be prevented' Plenty of cynicism about checks It can impose fines of up to £18m or 10% of revenue and, in very serious cases, stop sites operating in the UK, all in the name of cleaning up the internet \"cesspit\" he says the UK's children have become used to. \"It is indistinguishable for them as to what's going to come up next [in their feeds]. \"They don't know whether it's going to be something healthy that they want to see or whether it is something criminally violent or exploitative or damaging.\" There's plenty of cynicism about these new rules. Some people are suspicious about privacy. \"Highly effective\" age verification can include bank or ID checks or even AI tools that estimate people's ages. The chief executive of Yoti, one of the companies now offering these age-checking tools, says he would be \"out of business\" if he didn’t look after users' data. Robin Tombs added: \"Over time, people will get comfortable [and] trust that if it is well-regulated, you can do this with privacy.\" Criminalisation of children? Others worry that more teenagers will end up being criminalised. Marcus Johnstone, a lawyer who specialises in sexual crimes, says: \"You're not going to be able to stop teenagers watching pornography.\" \"The schools, the colleges they're at, everybody's watching pornography so they will want access to that. \"It will result in criminalisation of more young people because they will want to find that material and if it's not available on the easy access sites where they might find it now, then they will go on to the illegal sites.\" Ofcom's response to that concern was that these rules are about creating societal change as much as technological blocks on content. \"It's about what we as a society say is normal for our online experiences,\" says Jessica Smith, online safety principal at the regulator. Others, like Ellen, want the rules to go much further. She supports an all-out ban of under-18s on social media, saying an Australia-style ban of under-16s doesn't go far enough. \"At 16, you're still quite naive and young. I remember thinking I was very mature at 16. Looking back, I really wasn't,\" she says. Peter Kyle, while celebrating the new rules, is realistic. \"I am not telling every parent out there that [from today], every single corner of the internet is going to be safe for their kids to be on, or that some content won't slip through. \"But what I am saying is that I am expecting a step change in children's experience. \"They will notice the difference. For the first time since the creation of the internet, parents and children will notice a difference in their online experience.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Dozens dead as storm sweeps through the Philippines",
        "description": "A fierce tropical storm has torn through the Philippines' mountainous north, in a week which has already seen floods and landslides claim at least 25 lives.",
        "url": "https://news.sky.com/story/tropical-storm-sweeps-through-the-philippines-leaving-at-least-25-dead-13401780",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-philippines-typhoon-co-may_6973277.jpg?20250725101642",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-07-25 15:42:00",
        "Headline": "President Ferdinand Marcos Jr. warned that country must adapt to the growing frequency of natural disasters caused by climate change.",
        "Content": "A fierce tropical storm has torn through the Philippines' mountainous north, in a week which has already seen floods and landslides claim at least 25 lives. Typhoon Co-may struck the town of Agno in Pangasinan province Thursday night with winds reaching speeds of 120 kilometres (74 miles) per hour. By Friday afternoon, as it moved northeast, the typhoon had weakened slightly. Co-may struck after seasonal monsoon rains drenched a vast part of the country for over a week. More than a dozen additional tropical storms are expected to strike the Southeast Asian nation before the end of the year, forecasts show. At least 25 deaths have been reported since last weekend, mostly due to flash floods, toppled trees, landslides, and electrocution, according to officials. A further eight people have been reported missing. Schools in the capital, Manila, remained closed for the third consecutive day on Friday, with classes also suspended in 35 provinces across the main northern region of Luzon. Over 80 towns and cities, mostly in Luzon, have declared a state of calamity, enabling quicker access to emergency funds and the freezing of prices on essential goods. The weather has forced 278,000 people to seek refuge in emergency shelters or with relatives. According to the government's disaster response agency, close to 3,000 homes have suffered damage. Thousands of military personnel, police officers, coast guard members, firefighters, and civilian volunteers have been deployed to assist in rescuing residents. \n                  Israel allows foreign countries to parachute aid into Gaza\n                 \n                  Turkey faces 'truly great disaster', warns Erdogan amid raging wildfires and sweltering temperatures across Europe\n                 \n                  As fighting enters day two, neither Cambodia or Thailand seem willing to back down just yet\n                 Philippines President Ferdinand Marcos Jr. visited emergency shelters Thursday in Rizal province to help distribute food packs to displaced residents. \"Everything has changed,\" Marcos said. He subsequently called an emergency meeting with disaster-response officials, warning that both the government and the public need to adapt to the increasing frequency and unpredictability of natural disasters due to climate change. The United States has pledged to provide military aircraft to assist in transporting food and other aid to remote areas if weather conditions deteriorate further. The Philippines is struck by around 20 typhoons and storms every year and frequently experiences earthquakes and volcanic activity, making it one of the world's most disaster-prone countries."
    },
    {
        "title": "Top Boy actor Micheal Ward charged with two counts of rape",
        "description": "Top Boy actor Micheal Ward has been charged with two counts of rape and is due to appear in court next month.",
        "url": "https://news.sky.com/story/top-boy-actor-micheal-ward-charged-with-two-counts-of-rape-13401772",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-micheal-ward-police_6973702.jpg?20250725164102",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-25 15:35:00",
        "Headline": "Ward, 27, has also been charged with two counts of assault by penetration and one count of sexual assault.",
        "Content": "Top Boy actor Micheal Ward has been charged with two counts of rape and is due to appear in court next month. Ward, 27, has also been charged with two counts of assault by penetration and one count of sexual assault. The offences relate to one woman and are reported to have taken place in January 2023. \"Our specialist officers continue to support the woman who has come forward - we know investigations of this nature can have a significant impact on those who make reports,\" said Detective Superintendent Scott Ware, whose team is leading the Met Police's investigation. Ward, of Cheshunt, Hertfordshire, is due to appear at Thames Magistrates' Court on 28 August, the Crown Prosecution Service said. Ward said he denies the charges of rape and sexual assault, adding in a statement: \"I recognise that proceedings are now ongoing, and I have full faith that they will lead to my name being cleared.\" In a statement, Catherine Baccas, deputy chief crown prosecutor for CPS London South, said: \"We remind all concerned that proceedings against the suspect are active and he has a right to a fair trial. \n                  Grammy-winning jazz singer Dame Cleo Laine dies\n                 \n                  Riverdance star Michael Flatley to make bid for Irish presidency, court hears\n                 \n                  Kelly Osbourne pays tribute to 'best friend' Ozzy - in first comments since his death\n                 \"It is vital that there should be no reporting, commentary or sharing of information online which could in anyway prejudice these proceedings.\" Ward starred in the popular Netflix series Top Boy as Jamie. He also appeared in films like Blue Story, The Old Guard and Empire of Light. In 2020, the Jamaican-born actor was awarded the Bafta Rising Star honour in 2020. Read more from Sky News:Teenagers jailed for 15 years for machete murderHome Office threaten asylum seekers with homelessness He was nominated for Best Supporting Actor Bafta in 2021 for his role as Franklyn in the BBC series Small Axe, and 2022 for his performance as Stephen in Empire of Light. Ward is also in the upcoming American film Eddington alongside Joaquin Phoenix and Pedro Pascal, which is set to be released in the UK next month. He has more than a million followers on Instagram and participated in charity events like the Soccer Aid match at Stamford Bridge last year. Ward gave a reading at the Christmas Eve carol service hosted by the Princess of Wales in 2023."
    },
    {
        "title": "Grammy-winning jazz singer Dame Cleo Laine dies",
        "description": "Grammy-winning jazz singer Dame Cleo Laine has died aged 97.",
        "url": "https://news.sky.com/story/grammy-winning-jazz-singer-dame-cleo-laine-dies-13401823",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-cleo-laine-laine_6973792.jpg?20250725215017",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-25 17:06:00",
        "Headline": "Dame Cleo was a leading figure of the British jazz music scene for many years and worked with the likes of Ray Charles and Frank Sinatra. ",
        "Content": "Grammy-winning jazz singer Dame Cleo Laine has died aged 97. Dame Cleo was a leading figure of the British jazz scene for many years and worked with the likes of Ray Charles and Frank Sinatra. Her famed scat singing style, her remarkable range from tenor to contralto and her smoky voice made her Britain's most successful jazz singer, earning her the nickname the First Lady of Jazz.   \"It is with deepest sadness that we announce the passing of our dearly beloved mother, Cleo, who died peacefully yesterday afternoon,\" her children Jacqui and Alec Dankworth said. \"We will all miss her terribly. The family wish to be given space to grieve and ask for privacy at this very difficult time.\" Dame Cleo's husband, saxophonist Sir John Dankworth, died aged 82 in 2010 after being a mainstay of the British jazz scene for more than 50 years. The couple founded a charity and venue called The Stables in 1970 to \"ensure young people have access to great music and music education\", David Meadowcroft, chairman of the charity, said, adding that The Stables would continue the couple's commitment. He added that Dame Cleo \"was a remarkable performer who was loved by audiences around the world\". Monica Ferguson, artistic director of The Stables, said the singer \"will be greatly missed, but her unique talent will always be remembered\". Born Clementina Dinah Campbell, the singer grew up with her Jamaican father and English mother in Southall, west London, where she was supported by her father's busking talents. She became a professional jazz singer in her mid-20s when she successfully auditioned for the Johnny Dankworth Seven in 1951 and changed her name to Cleo Laine. Seven years later, Dame Cleo married Sir John. Their son Alec was born in 1960, a year before his mother scored a top 10 hit with You'll Answer To Me, before daughter Jacqueline followed in 1963. In 1973, Dame Cleo and Sir John drew a sold-out crowd at New York's Carnegie Hall and launched a series of popular concerts. She received a Grammy Award for Best Jazz Vocal Performance for Cleo At Carnegie in 1986. Read more from Sky News:Top Boy actor charged with two counts of rapeAnother resignation after viral Coldplay concert video In the 1997 Birthday Honours, the singer became the first British jazz artist to be made a dame. Her career was later also honoured with a Life Achievement Award at the British Jazz Awards in 2002."
    },
    {
        "title": "Riverdance star Michael Flatley to make bid for Irish presidency, court hears",
        "description": "Riverdance star Michael Flatley is hoping to become Ireland's next president, a court has heard.",
        "url": "https://news.sky.com/story/riverdance-star-michael-flatley-to-make-bid-for-irish-presidency-court-hears-13401658",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-flatley-riverdance_6973450.jpg?20250725132545",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-25 12:12:00",
        "Headline": "Flatley said last week that the \"average person on the street\" is unhappy with the status quo and \"somebody has to speak for the Irish people\".",
        "Content": "Riverdance star Michael Flatley is hoping to become Ireland's next president, a court has heard. The revelation came out in a legal case over work done on his mansion in County Cork, the Castlehyde. Barrister Ronnie Hudson said there had been a \"material change in circumstances\" for Flatley and he's set to move back to Ireland in the next two weeks in the hope of running in autumn's election. A legal statement signed by the star's solicitor, Maxwell Mooney, was also submitted to the High Court stating Flatley would \"seek nominations to run for president of Ireland\". Flatley rose to fame when Riverdance, which features traditional Irish music and dance, became a phenomenon in the 1990s and went on to tour the world. It continues to be performed today. The choreographer and dancer also created and starred in Lord Of The Dance. The 67-year-old - who currently lives in Monaco - strongly hinted at a presidential bid last week, but said he hadn't made a final decision. \n                  Thomas 'Bomber' Kavanagh: Kinahan crime boss ordered to pay back £1.1m \n                 \n                  International experts join mass grave excavation at former mother and baby home in Ireland\n                 \n                  What happened at the Tuam mother and baby home - and why is the site now only being excavated?\n                 He told a radio interview he didn't think the Irish people had a \"true proper deep voice that speaks their language\". Flatley said the \"average person on the street\" is unhappy with the status quo and \"somebody has to speak for the Irish people\". Read more from Sky News:Powerboat driver dies after crashing into houseboatAnother resignation as fallout from Coldplay video deepens The role of president in Ireland is largely ceremonial and is currently held by Michael D Higgins, whose term ends on 11 November. The election is expected to take place at the end of October. A candidate needs nominations from at least 20 members of the Irish parliament or at least four local authorities. Those who've already met the criteria are former farming journalist and EU commissioner Mairead McGuinness, and former Galway mayor Catherine Connolly. Former MMA fighter Conor McGregor is among others who have also hinted they might run - although the prospect was universally rejected by other politicians in Ireland."
    },
    {
        "title": "Kelly Osbourne pays tribute to 'best friend' Ozzy - in first comments since his death",
        "description": "Kelly Osbourne has commented on the death of her father Ozzy Osbourne for the first time since he died on Tuesday.",
        "url": "https://news.sky.com/story/kelly-osbourne-pays-tribute-to-best-friend-ozzy-in-first-comments-since-his-death-13401480",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-kelly-osbourne-ozzy_6971149.jpg?20250722214618",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-25 06:17:00",
        "Headline": "Daughter Kelly uses lyrics from a Black Sabbath song to pay tribute to father Ozzy Osbourne after he passed away this week.",
        "Content": "Kelly Osbourne has commented on the death of her father Ozzy Osbourne for the first time since he died on Tuesday. The figurehead of heavy metal died aged 76, just a few weeks after performing a huge farewell show with his Black Sabbath bandmates in Birmingham, where the band was formed in 1968. After the show, Kelly got engaged to her longtime partner and musician Sid Wilson, of the band Slipknot, after he got down on one knee backstage. After the frontman passed away on Tuesday, the Osbourne family released a joint statement that read: \"It is with more sadness than mere words can convey that we have to report that our beloved Ozzy Osbourne has passed away this morning. He was with his family and surrounded by love.\"  In her first comments since losing her father, Kelly wrote on Instagram: \"I feel unhappy I am so sad. I lost the best friend I ever had,\" followed by a broken heart emoji. She was quoting lyrics from the 1972 Black Sabbath song Changes. 👉 Listen to Sky News Daily on your podcast app 👈  \n                  How Ozzy Osbourne made Birmingham the birthplace of metal \n                 \n                  'A local lad done good': Fans remember Ozzy Osbourne in his hometown of Birmingham\n                 \n                  Black Sabbath, Elton John and Rod Stewart among music giants paying tribute to Ozzy Osbourne \n                 The father and daughter were famously close, appearing on The Osbournes reality TV show together and covering the song Changes as a duet in 2003. \"That song stands for so much in our family and to me and Dad,\" Kelly said on the TV show Ozzy & Jack's World Detour, starring her brother, Jack. \"It was not only both of our first number one [single] in the UK, it represented a time in my life and a time in Dad's life, it represented our relationship and how much we loved each other.\" Black Sabbath are widely credited with having invented heavy metal, but the piano ballad Changes widely deviated from their usual guitar and drum-heavy style.  The band Coldplay also used the song to pay tribute to Ozzy this week, playing a stripped back, short version of Changes in a show in Nashville, Tennessee. After the song, frontman Chris Martin said: \"Ozzy, we love you, wherever you're going.\" Read more from Sky News: Oasis photographers remember the early days: 'The journalist had to take a week off afterwards!'Another resignation as fallout from viral Coldplay concert video deepens"
    },
    {
        "title": "Oasis photographers remember the early days: 'The journalist had to take a week off afterwards!'",
        "description": "It was a cold, typically rainy Manchester evening, October 1993, when Michael Spencer Jones set out to meet a new guitar band he had been commissioned to photograph.",
        "url": "https://news.sky.com/story/oasis-photographers-remember-the-early-days-the-journalist-had-to-take-a-week-off-afterwards-13400664",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-oasis-liam-gallagher_6972561.jpg?20250724130751",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-07-25 02:42:00",
        "Headline": "Photographers Kevin Cummins, Michael Spencer Jones and Jill Furmanovsky all worked with Oasis over the years before they split.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n It was a cold, typically rainy Manchester evening, October 1993, when Michael Spencer Jones set out to meet a new guitar band he had been commissioned to photograph. The weather was miserable, he didn't know their music, wasn't totally in the mood. \"I had to drag myself from home, thinking: is it going to be worth the trouble?\" On the drive to the Out Of The Blue studio in Ancoats, on the outskirts of the city centre, a song he'd never heard before came on the local radio station. \"It was like, wow, what is that?\" The track was Columbia, by Oasis, the band he was on his way to meet. He started to get excited. Spencer Jones had previously met Noel Gallagher during the musician's time as a roadie for fellow Manchester band Inspiral Carpets. But not Liam. \"As a photographer, obviously, the aesthetic of a band is massively important,\" he says as he recalls that first shoot. \"I'm just looking down the camera lens with a certain amount of disbelief.\" In front of him was a 21-year-old, months before the start of the fame rollercoaster that lay ahead. And yet. \"I was looking at a face that just seemed to embody the quality of stardom.\" 'Success was inevitable' It was the start of a partnership that continued throughout the band's heyday, with Spencer Jones shooting the covers for their first three albums, their most successful records, and the singles that went with them. \"You work with bands pre-fame and there's always that question: are they going to make it? With Oasis there was never that question. Their success was inevitable.\" There was a confidence, even in those early days. \"Incredible, intoxicating confidence. [They were] not interested in any kind of social norms or social constraints.\" It wasn't arrogance, he says, of a criticism sometimes levelled at the Gallaghers. \"They just had this enormous self-belief.\" Spencer Jones was one of several photographers who followed the band, capturing the moments that became part of rock history. 'Noel had an uncanny intuition' Jill Furmanovsky, who started working with Oasis towards the end of 1994, a few months after the release of debut album Definitely Maybe, says Noel always seemed aware their time together should be documented. \"An uncanny intuition, really, that it was important,\" she says. \"I think Noel has been aware right from the start, because for him that's what he used to look at when he used to buy his Smiths records or Leo Sayer or whatever, he would stare at the covers and be fascinated by the pictures.\" Contrary to popular belief, Furmanovsky says the brothers got on fairly well most of the time, \"otherwise they wouldn't have been able to function\". She picks one shoot in 1997, around the release of their third album, Be Here Now, as one of the more memorable ones. Noel had shared his thoughts about the band on a chalkboard and \"they were having such a laugh.\" But when things did erupt, it became significant. \"There were tensions in some shoots but they never started hitting each other in front of me or anything like that. I used to complain about it, actually - 'don't leave me out of those pictures where you're really arguing!'.\" In Paris in 1995, tensions had boiled over. \"It's one of my favourites,\" she says of the shoot. \"It reflects not just the band but the family situation, these brothers in a strop with each other.\" What is notable, she says, is that they were happy for photographers to take candid shots, not just set up pictures to show them \"looking cool\". Pictures that on the surface might sound mundane, showing \"what they were really like - tensions, mucking about, sometimes yawning... This was the genius of Noel and [former Oasis press officer] Johnny Hopkins.\" Furmanovsky also notes the women who worked behind the scenes for Oasis - unusual at a time when the industry was even more male-dominated than it is now - and how they kept them in line. Read more on Oasis:A high-five and the briefest hug: Oasis - the first reunion gigCool Britannia: Life in the UK in the '90sIt felt like it would never happen - but now, finally, Oasis are back \"They got on well working with women,\" she says. \"Maggie Mouzakitis was their tour manager for ages and was so young, but she ruled. For a band one could say were a bunch of macho Manchester blokes, they had a lot of women working in senior positions.\" This is down to the influence of their mum, Peggy, she adds. \"Absolutely crucial.\" Furmanovsky has been working with Noel on an upcoming book documenting her time with the band, and says she initially wanted to start with a picture of the Gallagher matriarch. \"Noel said to me, 'Jill, you do know she wasn't actually in the band?'\" Touring with Oasis - 'the journalist had to take a week off' Kevin Cummins was commissioned to take pictures when Oasis signed to Creation Records, and it \"kind of spiralled out of control a little bit\", he laughs. \"I photographed them for NME, gave them their first cover. I photographed them in Man City shirts because we were all Man City fans, and City were at the time sponsored by a Japanese electronics company, Brother. It seemed a perfect fit.\" The early days documenting the band were \"fairly riotous\", he says. \"They were quite young, they were obviously enjoying being in the limelight. \"I remember we went on tour with them for three days for an NME 'on the road' piece, and the journalist who came with me had to take a week off afterwards. \"I dipped in and out of tours occasionally - I've always done that with musicians because I cannot imagine spending more than about seven or eight days on tour with somebody, it would drive you nuts. They're so hedonistic, especially in the early days. It's very, very difficult to keep up.\" Cummins says the relationship between Noel and Liam was \"like anybody's relationship, if you've got a younger brother - he'd get on your nerves.\" During the shoot for the City shirt pictures, he says, \"Liam kicked a ball at Noel, Noel pushed him, Liam pushed him back. They have a bit of a pushing match and then they stop and they get on with it.\" Another time, following a show in Portsmouth, \"as soon as we got [to the hotel] after the gig, Liam threw all the plastic furniture in the pool. Noel looked at him and said, 'where are we going to sit?' And he made him get in the pool and get all the furniture out. So there were like attempts at being rock and roll, and not quite getting it right sometimes.\" Cummins says he has \"very affectionate\" memories of working with Oasis. \"I've got a lot of very sensitive looking pictures of Liam and people are really surprised when they see them,\" he says. \"But he is a very sensitive lad... it's just he was irritating because he was younger and he wanted to make himself heard.\" Getting ready for the reunion All three photographers have yet to see the reunion show, but all have tickets. All say the announcement last summer came as a surprise. \"There was an inkling of it, I suppose, just in the thawing of the comments between the brothers, but I still wouldn't have guessed it,\" says Furmanovsky, who has a book out later this year, and whose pictures feature in the programme. \"It's wonderful they have pulled it off with such conviction and passion.\" Cummins' work can be seen in a free outdoor exhibition at Wembley Park, which fans will be able to see throughout the summer until the final gigs there in September. \"I think the atmosphere at the gigs seems to have been really friendly... I like the idea that people are taking their kids and they're passing the baton on a little bit,\" he says. \"Everyone's just having a blast and it's like the event of the summer - definitely something we need at the moment.\" Spencer Jones, who released his second Oasis book, Definitely Maybe - A View From Within, for the album's 30th anniversary last year - adds: \"They really seem to be capturing a new generation of fans and I don't think a band has ever done that [to this extent] before. Bands from 20, 30 years ago normally just take their traditional fanbase with them.\" But he says his first thought when the reunion was announced was for the Gallaghers' mum, Peggy. \"I think for any parent, to have two children who don't talk is pretty tough,\" he says. \"It's that notion of reconciliation - if they can do it, anyone can do it. \"The fact they're walking on stage, hands clasped together, there's a huge amount of symbolism there that transcends Oasis and music. Especially in a fractured society, that unity is inspiring. Everyone's had a bit of a rough time since COVID, battle weary with life itself. I think people generally are just gagging to have some fun.\" Brothers: Liam And Noel Through The Lens Of Kevin Cummins is on at Wembley Park until 30 September. Definitely Maybe - A View From Within, by Michael Spencer Jones, available through Spellbound Galleries, is out now. Oasis: Trying To Find A Way Out Of Nowhere, by Jill Furmanovsky and edited by Noel Gallagher, published by Thames & Hudson, is out from 23 September."
    },
    {
        "title": "Another resignation as fallout from viral Coldplay concert video deepens",
        "description": "The woman who went viral after she was seen embracing a colleague at a Coldplay concert has resigned.",
        "url": "https://news.sky.com/story/woman-in-coldplay-concert-video-resigns-as-astronomers-chief-people-officer-days-after-ceo-13401457",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-coldplay-andy-byron_6968322.jpg?20250719094855",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-25 04:25:00",
        "Headline": "Coldplay's lead singer Chris Martin poked fun at the couple as they tried to hide from the camera - quipping: \"Either they're having an affair or they're very shy.\"",
        "Content": " The woman who went viral after she was seen embracing a colleague at a Coldplay concert has resigned. Kristin Cabot plunged her head into her hands and turned her back after appearing on giant screens at the gig in Boston. In a statement, the tech firm Astronomer confirmed she has stepped down as chief people officer. She was in the arms of Andy Byron at the time, who also resigned as the company's chief executive officer a few days ago. Coldplay's lead singer Chris Martin poked fun at the couple as they tried to hide from the camera - quipping: \"Either they're having an affair or they're very shy.\" The footage quickly went viral on social media, with Ms Cabot and Mr Byron later identified as the two people in the clip. After Mr Byron resigned, the company had said in a statement: \"Astronomer is committed to the values and culture that have guided us since our founding. \n                  Top Boy actor Micheal Ward charged with two counts of rape\n                 \n                  Grammy-winning jazz singer Dame Cleo Laine dies\n                 \n                  Riverdance star Michael Flatley to make bid for Irish presidency, court hears\n                 \"Our leaders are expected to set the standard in both conduct and accountability, and recently, that standard was not met.\" Astronomer has previously confirmed that \"no other employees were in the video\", with false reports online suggesting that another staff member had been at the event. Pete DeJoy, who has taken over as interim CEO, admitted on Monday that the company has faced an \"unusual and surreal\" amount of attention in recent days. On LinkedIn, he wrote: \"While I would never have wished for it to happen like this, Astronomer is now a household name.\" So-called \"kiss cams\" are a popular feature at gigs and sporting events, but the incident has inspired many fans to start ducking if they end up appearing on screen. Chris Martin, performing for the first time since the viral video last Saturday, also gave concertgoers a heads-up before the kiss cam sprang into action. He said: \"We'd like to say hello to some of you in the crowd. How we're gonna do that is we're gonna use our cameras and put some of you on the big screen. \"So please, if you haven't done your make-up, do your make-up now.\""
    },
    {
        "title": "'I'll never shut up': Fantastic Four's Pedro Pascal on using fame to highlight issues he cares about",
        "description": "Pedro Pascal is everywhere right now.",
        "url": "https://news.sky.com/story/ill-never-shut-up-fantastic-fours-pedro-pascal-on-using-fame-to-highlight-issues-he-cares-about-13401429",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-pedro-pascal_6973078.jpg?20250724224711",
        "type": "Entertainment",
        "Author": "Debbie Ridgard",
        "Date Published": "2025-07-25 03:00:00",
        "Headline": "Pedro Pascal leads the new iteration of Marvel's The Fantastic Four alongside Vanessa Kirby, Ebon Moss-Bachrach and Joseph Quinn",
        "Content": "\n          Entertainment reporter\n              @Debbie_Ridgard\n Pedro Pascal is everywhere right now. You walk into the cinema and he's on most of the film posters there: Fantastic Four: First Steps, Eddington, The Materialists and The Uninvited. With that level of public attention, you wouldn't be shocked to see the actor become closed off. Shielded by a sea of publicists maintaining a studio's desired image and an influx of influencers replacing film reporters, public figures speaking their mind in Hollywood have become somewhat of a rarity. Perhaps this is why the delayed yet meteoric rise to fame for Pedro Pascal feels refreshing for his fans. In between self-promotion for his latest projects, the Chilean-American uses his fame to highlight causes he cares about by wearing \"Protect The Dolls\" T-shirts in public settings, posting about food blockades into Gaza and linking non-profit organisations, Doctors Without Borders and The Trevor Project, on his Instagram account where he has over 11 million followers. In a time where a single sentence can be taken out of context in a TikTok post or altered to suit a narrative driven by a headline (and yes, the irony of writing this does not go unnoticed), speaking candidly can feel like you're walking into a trap. \n                  Top Boy actor Micheal Ward charged with two counts of rape\n                 \n                  Grammy-winning jazz singer Dame Cleo Laine dies\n                 \n                  Riverdance star Michael Flatley to make bid for Irish presidency, court hears\n                 \"I think it's very easy to get scared no matter what you sort of talk about,\" the actor tells Sky News. \"There's so many different ways that things can get kind of fractured and have a life of itself really.\" He adds: \"It's sort of a business part of the way media can work really. There's one thing that you can say and no matter what your intention behind it, it is absolutely lost in all of these different headlines, I suppose, but I'll never shut up.\" Read more entertainment news:Hulk Hogan diesKneecap banned from Hungary It's the last line, \"I'll never shut up\", that echoes after our four minute and two second conversation in the midst of a days-long \"press run\" in London for the release of The Fantastic Four: First Steps. The 50-year-old knows one misstep in an increasingly reactive media industry can shatter the careers of many. Pascal is aware of the dangers but uses his voice anyway. It's that decision that makes him \"fantastic\", maybe more so than his role as Dr Reed Richards in The Fantastic Four: First Steps - a character quite literally weighed down with the worries of the world on his shoulders whilst simultaneously welcoming new life with his wife Sue Storm. The film, directed by WandaVision's Matt Shakman, stands alone in its own universe within the MCU and also features Vanessa Kirby, Ebon Moss Bachrach and Joseph Quinn. The Fantastic Four: First Steps is in cinemas now."
    }
]