[
    {
        "title": "Donald Trump tells Keir Starmer 'do not give away Diego Garcia' in fresh attack on Chagos Islands deal",
        "description": "Donald Trump has launched a fresh broadside on the UK's Chagos Islands deal with Mauritius, saying Sir Keir Starmer is \"making a big mistake\".",
        "url": "https://news.sky.com/story/donald-trump-tells-keir-starmer-do-not-give-away-diego-garcia-in-fresh-attack-on-chagos-islands-deal-13509245",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-diego-garcia-chagos_7140219.jpg?20260123212238",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-18 18:56:00",
        "Headline": "The US president has changed his tune multiple times about the UK's deal to hand over the Chagos Islands. His latest commentary comes just a day after his administration expressed support for the arrangement.",
        "Content": "Donald Trump has launched a fresh broadside on the UK's Chagos Islands deal with Mauritius, saying Sir Keir Starmer is \"making a big mistake\". In a post on his Truth Social platform, the US president warned against the potential loss of a US-UK military base on Diego Garcia, which the UK is retaining through a 99-year lease of the island. \"Our relationship with the United Kingdom is a strong and powerful one, and it has been for many years, but prime minister Starmer is losing control of this important Island by claims of entities never known of before,\" said Mr Trump. Mr Trump said Sir Keir \"should not lose control, for any reason, of Diego Garcia, by entering a tenuous, at best, 100 Year Lease\". He added: \"This land should not be taken away from the U.K. and, if it is allowed to be, it will be a blight on our Great Ally. We will always be ready, willing, and able to fight for the U.K., but they have to remain strong in the face of Wokeism, and other problems put before them. \"DO NOT GIVE AWAY DIEGO GARCIA!\" Read more:What is in the Chagos Islands deal? The UK government has defended the deal following Mr Trump's post. A Foreign Office spokesperson said: \"The deal to secure the joint UK-US military base on Diego Garcia military is crucial to the security of the UK and our key allies, and to keeping the British people safe. \"The agreement we have reached is the only way to guarantee the long-term future of this vital military base.\" 'A difficult read' Sky's US correspondent Mark Stone said the post will be a \"difficult read\" for the UK government, who are \"exasperated by the flip-flopping that has gone on\". The Chagos Islands are an archipelago in the Indian Ocean, with the island of Diego Garcia home to a joint UK-US military base. The islands are an overseas territory of the UK, but after the UK lost a court case over the sovereignty of the islands, the government agreed to cede the islands to Mauritius. Charting Trump's flip-flopping position The US backed the deal to give sovereignty of the islands to Mauritius as recently as Tuesday. A spokesperson for the US State Department said then: \"The United States supports the decision of the United Kingdom to proceed with its agreement with Mauritius concerning the Chagos archipelago.\" Mr Trump previously criticised the deal in January, calling it an \"act of total weakness\" and \"great stupidity\". Then, following a phone call with Sir Keir on 5 February, he signalled his support for the deal, calling it \"the best [Sir Keir] could make\". Before all that, he had given the deal his backing last year. What's changed now? Asked by reporters whether Mr Trump's latest post meant the US position on the Chagos Islands deal had changed, White House press secretary Karoline Leavitt said: \"The post should be taken as the policy of the Trump administration, it's coming straight from the horse's mouth.\" Sky News understands Conservative MP Sir Iain Duncan Smith, a strong opponent of the deal, has just returned from Washington where he lobbied the White House, National Security Council, and State Department on the issue. 'Kill this terrible deal,' says Badenoch The law to give away the islands is still before parliament, and the issue has become a significant political row. The Conservatives and Reform UK both oppose the deal, while the Liberal Democrats have demanded MPs are given a fresh vote on the issue. Responding to Mr Trump's latest comments, Tory leader Kemi Badenoch said the US president was \"right\". \"Chagos is a strategic asset. If our closest ally is saying this, the PM should listen. It's time to kill this terrible deal,\" she added. But Liberal Democrat leader Sir Ed Davey criticised Mr Trump's changing position: \"Trump's endless flip-flopping on the Chagos Islands shows why Starmer's approach is doomed to fail. Britain can't rely on the US while Trump is in the White House.\" Reform UK leader Nigel Farage said: \"Keir Starmer risks alienating our most important ally by giving away the Chagos Islands, the worst deal in British history… Starmer must cancel this deal.\" The House of Lords inflicted four defeats on the government last month on the details of the leasing of Diego Garcia - and the publication of any detailed payments made to Mauritius. The government pulled the bill from the Lords, and has yet to reschedule it."
    },
    {
        "title": "Trump could be about to force yet another Labour U-turn",
        "description": "Number 10 will be nursing its whiplash this evening as Donald Trump once again throws a diplomatic hand grenade into the UK's Chagos deal with Mauritius.",
        "url": "https://news.sky.com/story/starmer-must-bring-trump-back-from-the-brink-or-chagos-deal-is-dead-13509338",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-keir-starmer-donald-trump_7139750.jpg?20260119144840",
        "type": "Home",
        "Author": "Mhari Aurora",
        "Date Published": "2026-02-18 22:44:00",
        "Headline": "In a fresh attack online, the US president said the deal would be \"a blight\" on the UK and claimed the prime minister is \"losing control\" of the military base. ",
        "Content": "\n          Political correspondent\n              @MhariAurora\n Number 10 will be nursing its whiplash this evening as Donald Trump once again throws a diplomatic hand grenade into the UK's Chagos deal with Mauritius. Posting on Truth Social, Donald Trump implored Sir Keir Starmer to scrap the deal, saying: \"DO NOT GIVE AWAY DIEGO GARCIA!\" In his long post online, the US president claimed the prime minister is \"losing control\" of the military base in the Indian Ocean, and that the deal would be \"a blight\" on the UK. It came just a day after the US government released a statement in which it said it \"supports the decision of the United Kingdom to proceed with its agreement with Mauritius concerning the Chagos archipelago\". Number 10 and the Foreign Office will be asking itself what has changed in the space of 24 hours. UK government backs 'crucial' deal Pushing back on Trump's latest change of heart, a Foreign Office spokesperson said: \"The deal to secure the joint UK-US military base on Diego Garcia military is crucial to the security of the UK and our key allies, and to keeping the British people safe. \"The agreement we have reached is the only way to guarantee the long-term future of this vital military base.\" So what now? The government clearly did not see this latest Trump intervention coming, but leaders are often judged not by the events that happen on their watch but how they deal with such events. Interestingly, only last night Starmer and Trump held a bilateral phone call - but when Number 10 released a readout of that meeting, there was no mention of the Chagos deal. 'Utter humiliation' Opposition parties on the right are celebrating Trump's comments as a win for their campaigning. Shadow foreign secretary Priti Patel called this \"an utter humiliation\" for the prime minister, arguing the deal is undermining the UK's relationship with the US and must be junked. And the Tory leader Kemi Badenoch mirrored previous comments made last month by the US president, calling the deal an \"act of stupidity\" and self-sabotage. Reform UK's leader Nigel Farage claims the deal negotiated by the government risks alienating the US and has also called for the deal to be scrapped. Read more from Sky News:Tech firms could be blocked from UKPlans to raise minimum wage could be delayed Meanwhile, the Liberal Democrat leader Sir Ed Davey used the fallout as an opportunity to continue his attacks on Trump, insisting the US is no longer an ally the UK can rely on, and we must cosy up to our neighbours in Europe. Rather awkwardly the foreign secretary, Yvette Cooper, is in the US this week and will be having meetings with Trump's top team in Washington DC. Despite being blindsided by the persistent flip-flopping of the US administration's position on the Chagos deal, it could be a fortuitous opportunity to plead the UK government's case directly to her counterpart Marco Rubio. The Conservatives and Reform will be hoping Trump's latest intervention may be able to push the prime minister into rethinking this deal, or at least cause him enough political difficulty that the deal is ratified under a dark cloud. Starmer will need to bring the US president back from the brink, or we could be seeing U-turn number 16 from Labour."
    },
    {
        "title": "Retail warns of high price for workers from government costs ahead",
        "description": "Retail staff face reduced hours or even losing their job as bosses continue to face up to rising government-imposed costs, according to an industry lobby group.",
        "url": "https://news.sky.com/story/retail-warns-of-high-price-for-workers-from-government-costs-ahead-13509197",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-highstreet-communities_7030789.jpg?20250924205743",
        "type": "Home",
        "Author": "James Sillars",
        "Date Published": "2026-02-18 16:19:00",
        "Headline": "An industry body reports growing pessimism among those holding the purse strings following a year of job losses across the sector, cuts widely blamed on policy decisions.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Retail staff face reduced hours or even losing their job as bosses continue to face up to rising government-imposed costs, according to an industry lobby group. The British Retail Consortium (BRC) said its survey of finance chiefs in the sector found 61% were planning to reduce the number of hours and overtime for staff. The body reported that 55% saw head office workers at risk while 42% were to target in-store roles amid a surge in pessimism on the outlook, despite 74,000 jobs already being cut over the past 12 months. Mark Kleinman blog: See latest stories from Sky's City editor For more information about how we use your data and your rights, you can visit our Privacy Centre. The BRC said its study revealed a sharp rise in anxiety about labour-related costs, concerns that it said had \"shot up the agenda\" since the phased implementation of new employment laws got under way. The survey's findings risk exacerbating the growing sense of crisis over unemployment, with the UK's jobless rate surging by more than a percentage point to 5.2% since Labour came to power. It's currently at a level not seen for almost five years. The official figures have also shown youth unemployment at 16.1% - its highest figure since 2014 - and weaker pay awards across the private sector. Businesses, especially in big employment sectors such as retail, have complained of higher costs since the pandemic, but their concerns have intensified since the 2024 budget. The BRC said raised employer national insurance contributions, coupled with minimum wage hikes, imposed since last April, had added £5bn annually to the sector's costs, harmed investment, pay awards and employment. It calculated that the cost of employing a full-time entry-level worker rose by 10%, while that number rose to 13% for someone part-time. At the same time, continuing cost of living pressures have harmed both essential and discretionary spending among consumers, exacerbating fears over the future of UK high streets. PM rules out minimum wage U-turn The BRC said its members faced another increase in labour costs this April due to further minimum pay rises above the rate of inflation. The Times reported this week that the government was reviewing its pledge to equalise, over time, the minimum wage between younger and older workers, to avoid placing further pressure on youth unemployment. But Sir Keir Starmer later ruled out a U-turn, arguing: \"We've made commitments to young people in our manifesto, and we will keep to those commitments, including the commitment that we would make sure that the living wage would go up this April, which I can absolutely confirm to you will happen.\" Read more from Sky News:Man dead after double stabbingTrump warns Starmer of 'big mistake' BRC chief executive Helen Dickinson said of its report: \"We all want more high-quality, well-paid jobs. \"But retail has already lost 250,000 roles in the past five years, and youth unemployment is climbing fast.\" If the government's flagship Employment Rights Act fails to consider business needs on policies like guaranteed hours and union rights, she warned, it will \"add complexity and reduce flexibility, ultimately stripping away entry-level and part-time opportunities at precisely the moment the country needs them most\". A government spokesperson acknowledged retailers \"are facing a difficult time\", but said the reforms \"will boost productivity and retention in workplaces across the UK and give job security to over 18 million workers\". \"We are also supporting retailers through our small business plan, and we will work with business including the BRC to see what further support we can provide ahead of publishing our High Streets Strategy later this year,\" they said."
    },
    {
        "title": "How US military is assembling within striking distance of Iran",
        "description": "Donald Trump told protesters in Iran that \"help was coming\" little over a month ago.",
        "url": "https://news.sky.com/story/how-the-us-military-is-assembling-within-striking-distance-of-iran-13509295",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-jordan-trump_7168653.png?20260218213514",
        "type": "Home",
        "Author": "Michael Clarke",
        "Date Published": "2026-02-18 22:40:00",
        "Headline": "A powerful US military force is assembling within striking distance of Iran.",
        "Content": "\n          Military analyst\n       Donald Trump told protesters in Iran that \"help was coming\" little over a month ago. But at that time, there was almost no US military presence that would have made a difference in the region. On 22 January, he said there was a \"great armada\" assembling, when what he was referring to was the aircraft carrier, the USS Abraham Lincoln and its attendant Carrier Strike Group 3. None of it matched his rhetoric. But by this weekend, it will have done so, as a powerful US military force assembles within striking distance of Iran. It has three main elements. First is the naval force. The Lincoln and its CSG 3 will shortly be joined by the USS Gerald Ford, and its attendant CSG 12. The USS Ford is passing through the Gibraltar Strait in the next 24 hours and can be expected to be on station south of Cyprus in about four days, travelling at normal cruising speed. Read more:Middle East seemingly edging closer to warIran and US agree 'guiding principles' These two Nimitz-class carriers (CVN 72 and CVN 78) will be bringing extra air defence and Tomahawk-carrying destroyers with them, bringing the number of known, and named, US destroyers in the region to 11. They will join three Littoral Combat Ships already on station and a good number of support ships as well. In addition, each CSG includes - though never usually named - a nuclear attack submarine (an SSN), probably of the Virginia class. And there may also be an Ohio-class SSN in the area, which is specifically designed to launch Tomahawk and other missiles at land targets. The second element has been provided over the previous 10 days by an extensive series of C-5 and C-17, Galaxy and Globemaster flights in and out of the region, bringing air defence assets to US bases, presumably as cover in the event of any Iranian retaliation in response to potential US attacks. Israeli \"Iron Dome\" air defence batteries have also been moved from its frontier with Gaza to its borders in the east, probably for the same reason. And thirdly, the US has sent an extensive force of KC-130 air-to-air refuelling tankers to bolster its existing air tanker force. They left from the British base at Mildenhall (six tankers on 16 February) to Greece, and (on 18 February) no fewer than 10 more came from bases in the continental United States, via Britain, to bases in Greece and Bulgaria. In addition, US aircraft are known to be in the British base at Akrotiri in Cyprus, at Aviano in Italy, in the Azores, in Spain and at the Chagos Island base of Diego Garcia. Well over 100 US combat aircraft - F-15s, F18s, F-22s, F35s and B2 bombers - are now available to US military planners in the potential theatre of operations. But the extra KC-130 tankers are the giveaway. They give away the possibility that US aircraft might be operating from bases not sited on the territories of America's Middle East allies, but from less politically sensitive bases further away. And they give away the possibility that any air campaign might be quite prolonged, not just a sudden one-off attack. The final piece of the jigsaw: no fewer than six E3 Sentry aircraft. These flying control centres can survey and control everything that happens beneath them. They are, in effect, flying HQ's and a country can run a war from one of them. By the weekend, there will be a lot for these six E3 Sentry aircraft to look at and control. What all this military power will be used for is still a matter of some speculation. What does the tracking data show us? By Freya Gibson, junior OSINT producer Sky News Data & Forensics team has tracked the locations of US military planes and ships heading to the region in recent days and weeks. Several US Navy boats have been sent to the Middle East, including the USS Abraham Lincoln, a nuclear-powered aircraft carrier that carries 90 aircraft, including F35 fighters, and 5,680 crew. The Lincoln is leading a carrier strike group which includes three destroyers. The ship was last seen in the Arabian Sea around 240km off the coast of Oman. Sky News confirmed the location of this ship on 15 January. In addition, the USS Gerald R Ford, the lead ship of the US Navy's nuclear-powered aircraft carriers, is en route to the Middle East. Sky News has confirmed its latest location as tracking shows the Ford was around 600km from the Strait of Gibraltar at 1.58pm on 18 January. This aircraft carrier, like the USS Abraham Lincoln, also forms a carrier strike group that includes three destroyers. In total, there are reported to be more than 12 US ships now in the Middle East. Sky News has also tracked movements of US aircraft in the region. More than 15 refuelling tankers have repositioned towards the Middle East and Europe since 16 January. These aircraft, the K-135s, are aerial refuelling aircraft. They can carry up to 200,000 pounds of fuel and 83,000 pounds of cargo. They have four engines and operate at speeds up to 530mph and altitudes up to 50,000 feet.  The aircraft came from multiple locations, including RAF Mildenhall in the UK, Tampa in Florida and Sioux City in Iowa. They have been landing in different locations, including Chania Airport in Greece and Sofia Airport in Bulgaria. Satellite imagery shows F-15s and A-10 Thunderbolts at Muwaffaq Salti Air Base, Jordan. They can conduct precision airstrikes and engage armoured targets, alongside C-130 transport aircraft providing logistical support. What is Iran doing? Sky News has tracked the positions of Iranian Navy vessels using data from TankerTrackers. Around six vessels can be seen just off the coast of Bandar Abbas on 16 January. One of these ships is an Iranian Drone Carrier, IRIS Shahid Bagheri. Satellite imagery confirmed its location on 16 January, 10km from the coast. It is often spotted around this location in the Strait of Hormuz. It can deploy roughly 60 drones along with helicopters."
    },
    {
        "title": "Ex-Man Utd star Mikael Silvestre has strong words for Jose Mourinho over Vinicius Junior's racist abuse claim",
        "description": "Former Manchester United player Mikael Silvestre has claimed Jose Mourinho has \"failed us\" over his response to Vinicius Junior's allegations of racist abuse.",
        "url": "https://news.sky.com/story/mikael-silvestre-has-strong-words-for-jose-mourinho-over-vinicius-juniors-racist-abuse-claim-13509253",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-jose-mourinho-benfica_7168618.jpg?20260218205248",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-18 19:05:00",
        "Headline": "Mikael Silvestre has criticised Benfica's manager in the wake of the Real Madrid forward's allegation of racist abuse in a Champions League fixture.",
        "Content": "Former Manchester United player Mikael Silvestre has claimed Jose Mourinho has \"failed us\" over his response to Vinicius Junior's allegations of racist abuse. The 25-year-old left the field during Real Madrid's Champions League play-off in Lisbon on Tuesday after reporting Benfica winger Gianluca Prestianni to the referee. But Benfica manager Mourinho appeared apportion some blame to Vinicius, telling reporters afterwards: \"A stadium where Vinicius plays, something happens, always.\" On Wednesday, former France international Silvestre told Sky News that Mourinho was trying to mislead fans with his comments. “In terms of what high level and reputation he has, Jose Mourinho failed us,\" Silvestre told chief presenter Mark Austin. \"As an industry, and as human beings, he completely misled everyone - or he tried. “But we are not foolish - and we know what happened.\" Prestianni, however, has denied making racist comments towards Vinicius, claiming he was \"misunderstood\" by his opponent. Mourinho also came under fire for claiming Vinicius had provoked the abuse with his celebration after scoring the only goal early in the second half. The Brazilian danced around the corner flag, an apparent nod to Cameroonian Roger Milla's iconic World Cup celebration. Mourinho told Amazon Prime: \"I told him, when you score a goal like that, you just celebrate and walk back.\" Silvestre hit back against the former Manchester United manager, adding: \"For Jose Mourinho to divert and even vilify Vinicius Junior behaviour for celebrating the goal that he did - remembering Roger Milla for Cameroon years ago - it's not the way a top manager like him should do. \"We expect better, clearly it was bad for everyone, and I hope he's regretting his comment during the game, and also after during the press conference.\" Sports correspondent Vinicius Junior had every right to want to leave the pitch - and for the game to be abandoned. Because while he is a superstar of the game, well used to the biggest Champions League occasions, being the target of racism cannot be excused as coming with football's tribalism. This was reporting being racially abused at work. Just after adding another wondrous strike to his collection of goals. The accused - Benfica's Gianluca Prestianni - has every right to a thorough process if he persists with denials. And the UEFA case has to be watertight before imposing the minimum 10-game ban for racism. But Benfica have gone beyond defending their man with statements, showing no empathy with a player who has been singled out for hate because he is black too often in his career. Read Rob's full analysis here Silvestre is a member on the FIFA Player’s Voice Panel, tasked with advising on on-pitch racism incidents, alongside legends such as George Weah and Didier Drogba. Prestianni's response to abuse allegation In a statement in Portuguese on Instagram, shared by Benfica on social media, Prestianni denied he made any racist comments. He wrote: “I want to clarify that at no time did I direct racist insults to Vinicius Junior, who regrettably misunderstood what he thought he heard. “I was never racist with anyone and I regret the threats I received from Real Madrid players.”"
    },
    {
        "title": "Man dead and teen critically injured after stabbings at skate park in Northampton",
        "description": "A man is dead and a teenage boy is in a critical condition after being stabbed at a skate park in Northampton.",
        "url": "https://news.sky.com/story/man-dead-and-teen-critically-injured-after-skate-park-stabbing-13509360",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-police-devon-fire_7067205.jpg?20251030175538",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-18 23:56:00",
        "Headline": "A murder investigation has been launched and police said four people - two teenage boys, a man, and a woman - have been arrested.",
        "Content": "A man is dead and a teenage boy is in a critical condition after being stabbed at a skate park in Northampton. Four people have been arrested in connection with Wednesday's incident in the Briar Hill area, police said. They are two teenage boys, a man, and a woman all from Northampton. All remain in custody. The man who died was in his 20s and the boy who was stabbed is in hospital with life-threatening injuries. Northamptonshire Police have launched a murder investigation, and anyone with information - including CCTV or doorbell footage - is being urged to come forward. Detective Chief Inspector Torie Harrison said: \"This is a tragic incident in which a man has sadly lost his life, and a teenage boy is in a critical condition. Our thoughts are firmly with both their families at this difficult time.\" Officers are \"working at pace to establish what has happened\", the inspector continued, but added: \"I would still appeal for any witnesses or anyone with information who has not yet come forward, to please do so.\" Read more from Sky News:Trump warns Starmer of 'big mistake'Ex-Man Utd star's strong words for Mourinho A police cordon remains in place at the park in Ringway and house-to-house enquiries are set to continue. Locals are asked to avoid the area where possible."
    },
    {
        "title": "Dennis the Menace plays 'greatest prank yet' as Royal Mint presses 75-year anniversary 50p coins",
        "description": "A new range of Dennis the Menace-themed coins will be minted, marking 75 years of the iconic comic prankster.",
        "url": "https://news.sky.com/story/dennis-the-menace-plays-greatest-prank-yet-as-royal-mint-presses-75-year-anniversary-50p-coins-13509040",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-dennis-the-menace-beano_7168092.jpg?20260218113058",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-18 11:20:00",
        "Headline": "Marking 75 years since the iconic Beano character made his first appearance, the Royal Mint's Rebecca Morgan said the 50p coin \"captures everything we love about him\".",
        "Content": "A new range of Dennis the Menace-themed coins will be minted, marking 75 years of the iconic comic prankster. A collaboration between the Royal Mint and Beano will see Dennis and his dog Gnasher feature on collectable 50p coins. Vibrant colour printing is available, meaning the cartoon character's famous red and black jumper pops next to an engraving that reads \"75 years of Dennis\". The character made his first appearance in issue 452 of the Beano on 17 March 1951 and has since appeared on the BBC, ITV, and in video games. Dennis and Gnasher were also the mascots for Beanoland in Chessington World of Adventures from 1999 to 2010. It's the latest birthday celebration for the famous prankster. For his 60th, he and Gnasher gatecrashed the headquarters of Sky News in a comic strip. Rebecca Morgan, from the Royal Mint, said there's \"something wonderfully fitting about this legendary mischief-maker finally making his mark\" on the collectable coins. \"I'm sure Dennis himself would see it as his greatest prank yet,\" she added. Rob Glenny, from Beano, which was launched by Dundee-based publisher DC Thomson in 1938, said the coin \"captures the unmistakable spark that has kept Dennis at the heart of childhood for generations\". Read more: How the Beano's characters have changed The commemorative coin is available to buy from the Royal Mint's website from today, starting at £15. Fom 26 February, visitors to the Royal Mint Experience, based in Llantrisant, South Wales, will also be able to mint their own Dennis the Menace coin. "
    },
    {
        "title": "Tech firms must take down abusive images in 48 hours - or face being blocked from UK",
        "description": "Technology firms that do not take down abusive images from their platforms within 48 hours face being blocked from the UK under new rules proposed by the government.",
        "url": "https://news.sky.com/story/tech-firms-must-take-down-abusive-images-in-48-hours-or-face-being-blocked-from-uk-13509229",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-sir-keir-starmer-grok_7130381.png?20260108174350",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-18 22:29:00",
        "Headline": "Tech companies that don't take down abusive images reported to them could be blocked from operating in the UK or fined 10% of worldwide revenue.",
        "Content": "Technology firms that do not take down abusive images from their platforms within 48 hours face being blocked from the UK under new rules proposed by the government. Prime Minister Sir Keir Starmer said he was putting tech companies \"on notice\" to take down non-consensual intimate images, and will leave \"no stone unturned\" to protect women and girls. Companies will be legally required by law to remove the images within 48 hours of them being reported to them. If they do not, firms could be fined 10% of qualifying worldwide revenue - which could amount to billions of pounds for some major platforms - or have their services banned from the UK. Ministers say tech firms should take tackling intimate image abuse as seriously as they take tackling terrorist or child sexual abuse material. The government is making the change through an amendment to the Crime and Policing Bill, which is currently going through parliament. Media regulator Ofcom is also considering plans to treat non-consensual intimate images as the same as child sexual abuse material, which is digitally marked when found, so that any time they are re-shared, they are automatically taken down. \n                  Are you using an AI-generated password? It might be time to change it\n                 \n                  Priced-out Britons are using AI for financial advice. Critics call it a 'dangerous' - we put the chatbots to the test\n                 \n                  Beth Rigby: The constant challenges I face keeping my kids safe in the new Wild West\n                 Additionally, the government says it will publish guidance for internet companies on how to block \"rogue websites\" that host this content and fall out of reach of the Online Safety Act. Sir Keir said he would \"leave no stone unturned in the fight to protect women from violence and abuse\". He said the government had already taken \"urgent action against chatbots and 'nudification' tools\", and that they were \"going further, putting companies on notice so that any non-consensual image is taken down in under 48 hours\". Technology Secretary Liz Kendall said: \"The days of tech firms having a free pass are over... No woman should have to chase platform after platform, waiting days for an image to come down.\" Shadow technology secretary Julia Lopez said when a similar proposal was put forward by Conservative peer, Baroness Charlotte Owen, Labour had failed to take action. \"Once again, the government is playing catch-up to duck a major backbench rebellion. \"The reality is that, for all the prime minister's tough rhetoric, he has arrived late to this issue. He does not know what to believe - he only knows what to do to try and survive another week.\" The move follows controversy in January over X's AI tool, Grok, creating AI images undressing people without their consent. Creating non-consensual intimate images, including sexually explicit deepfakes, was criminalised earlier this month, and X stopped Grok from creating the images following the outrage. Other countries are also taking action against X, with Ireland's data privacy regulator saying on Tuesday that X faces an EU privacy investigation over the non-consensual deepfakes created by Grok. Earlier this week, Sir Keir announced a crackdown on social media platforms, such as closing a legal loophole to eliminate \"vile illegal content created by AI\". Downing Street has also launched a consultation on measures like an Australian-style ban on under-16s using social media, and is ensuring it is able to implement one quickly if it is recommended."
    },
    {
        "title": "Ex-Victoria's Secret mogul says Jeffrey Epstein 'stole vast sums from our family'",
        "description": "A billionaire mogul says paedophile financier Jeffrey Epstein stole vast sums from his family.",
        "url": "https://news.sky.com/story/ex-victorias-secret-mogul-says-jeffrey-epstein-stole-vast-sums-from-our-family-13509269",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-les-wexner-jeffrey-epstein_7168343.png?20260218144856",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-18 21:21:00",
        "Headline": "Les Wexner, 88, allowed Epstein to manage his finances but stressed he did not know about his crimes.",
        "Content": "A billionaire mogul says paedophile financier Jeffrey Epstein stole vast sums from his family. Les Wexner, 88, who was behind retailers including Victoria's Secret and Abercrombie & Fitch, was answering questions about his friendship with Epstein in a behind-closed-door session on Wednesday with US Congress. Mr Wexner, who is pictured in the Epstein files, has not been accused of any wrongdoing and always denied any knowledge or involvement in Epstein's crimes. He is one of Epstein's most prominent former friends, and their relationship stretches back to the 1980s, but he is on the record as saying he regrets the friendship. In August 2019, he said: \"I am embarrassed that, like so many others, I was deceived by Mr Epstein. \"I know now that my trust in him was grossly misplaced and I deeply regret having ever crossed his path.\" Epstein files latest Ahead of the hearing, Mr Wexner, who had allowed Epstein to manage his finances, released a statement he was due to provide to US Congress. He said he was \"pleased to testify\" because it would provide \"an opportunity to set the record straight\", but added he had been \"naive, foolish, and gullible\" for trusting Epstein with his business. Mr Wexner stressed he did not know about or witness Epstein's crimes or take part in them. He added that Epstein had revealed in 2006 that he had legal issues in Florida, which later turned into his conviction for sexual abuse. Read more:Police assess information around private flights to and from Stansted AirportTrump administration accused of 'purposefully muddying waters' A year later, he revealed the situation \"could become messy\" and left it to Mr Wexner's wife to handle their personal finances. This led to the family discovering \"Epstein had stolen vast sums from our family\", he said. Mr Wexner said: \"Once I learned of his abusive conduct and theft from my family, I never spoke with Epstein again. Never.\" The businessman also testified on Wednesday that he had never seen Epstein with any young girls, and his heart goes out to each of his victims. \"The pain he inflicted upon them is unfathomable to me,\" he said 'Birthday book' A note from a person signed as \"Leslie\" featured in Epstein's \"birthday book\", which was released as part of the Epstein files. The note addresses Epstein and says the author wanted to \"get you what you want\" over what appears to be a drawing of breasts. It is then signed with \"your friend Leslie\". As there is no surname, it is unclear who the author is. Sky News' data and forensics team have analysed the signature and believe there are similarities with Mr Wexner's handwriting. Being featured in the Epstein files is not an indication of wrongdoing. UK police forces investigating information from Epstein files On Wednesday, West Midlands Police said it was assessing information \"that has emerged in relation to private flights into and out of Birmingham Airport following the publication of the US DoJ Epstein files\". It is understood private jets linked to Epstein passed through BHX, according to flight logs between the early 1990s and 2018. That was the fourth UK police statement, connected to the Epstein files, since Tuesday. Essex Police had said on Tuesday it was working through logs of private jets that had travelled through Stansted Airport, while Bedfordshire Police said it was reviewing links to London Luton Airport. On Wednesday afternoon, Surrey Police said it was carrying out enquires over claims of human trafficking and sexual assault, dating back to 1994. The National Crime Agency confirmed \"a number\" of UK police forces are assessing allegations that have emerged through the Epstein files. Last week, Thames Valley Police said it was assessing claims that Andrew Mountbatten-Windsor shared confidential documents with Epstein while acting as trade envoy. Andrew has vigorously denied any accusations against him related to Epstein and his crimes. Earlier this month, the Metropolitan Police confirmed Peter Mandelson would face a criminal investigation into allegations he leaked market sensitive information from Downing Street to Epstein while serving as business secretary. Lord Mandelson has said of his connection to Epstein in a statement: \"I was wrong to believe Epstein following his conviction and to continue my association with him afterwards. \"I apologise unequivocally for doing so to the women and girls who suffered.\""
    },
    {
        "title": "Donald Trump tells Keir Starmer 'do not give away Diego Garcia' in fresh attack on Chagos Islands deal",
        "description": "Donald Trump has launched a fresh broadside on the UK's Chagos Islands deal with Mauritius, saying Sir Keir Starmer is \"making a big mistake\".",
        "url": "https://news.sky.com/story/donald-trump-tells-keir-starmer-do-not-give-away-diego-garcia-in-fresh-attack-on-chagos-islands-deal-13509245",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-diego-garcia-chagos_7140219.jpg?20260123212238",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-18 18:56:00",
        "Headline": "The US president has changed his tune multiple times about the UK's deal to hand over the Chagos Islands. His latest commentary comes just a day after his administration expressed support for the arrangement.",
        "Content": "Donald Trump has launched a fresh broadside on the UK's Chagos Islands deal with Mauritius, saying Sir Keir Starmer is \"making a big mistake\". In a post on his Truth Social platform, the US president warned against the potential loss of a US-UK military base on Diego Garcia, which the UK is retaining through a 99-year lease of the island. \"Our relationship with the United Kingdom is a strong and powerful one, and it has been for many years, but prime minister Starmer is losing control of this important Island by claims of entities never known of before,\" said Mr Trump. Mr Trump said Sir Keir \"should not lose control, for any reason, of Diego Garcia, by entering a tenuous, at best, 100 Year Lease\". He added: \"This land should not be taken away from the U.K. and, if it is allowed to be, it will be a blight on our Great Ally. We will always be ready, willing, and able to fight for the U.K., but they have to remain strong in the face of Wokeism, and other problems put before them. \"DO NOT GIVE AWAY DIEGO GARCIA!\" Read more:What is in the Chagos Islands deal? The UK government has defended the deal following Mr Trump's post. A Foreign Office spokesperson said: \"The deal to secure the joint UK-US military base on Diego Garcia military is crucial to the security of the UK and our key allies, and to keeping the British people safe. \"The agreement we have reached is the only way to guarantee the long-term future of this vital military base.\" 'A difficult read' Sky's US correspondent Mark Stone said the post will be a \"difficult read\" for the UK government, who are \"exasperated by the flip-flopping that has gone on\". The Chagos Islands are an archipelago in the Indian Ocean, with the island of Diego Garcia home to a joint UK-US military base. The islands are an overseas territory of the UK, but after the UK lost a court case over the sovereignty of the islands, the government agreed to cede the islands to Mauritius. Charting Trump's flip-flopping position The US backed the deal to give sovereignty of the islands to Mauritius as recently as Tuesday. A spokesperson for the US State Department said then: \"The United States supports the decision of the United Kingdom to proceed with its agreement with Mauritius concerning the Chagos archipelago.\" Mr Trump previously criticised the deal in January, calling it an \"act of total weakness\" and \"great stupidity\". Then, following a phone call with Sir Keir on 5 February, he signalled his support for the deal, calling it \"the best [Sir Keir] could make\". Before all that, he had given the deal his backing last year. What's changed now? Asked by reporters whether Mr Trump's latest post meant the US position on the Chagos Islands deal had changed, White House press secretary Karoline Leavitt said: \"The post should be taken as the policy of the Trump administration, it's coming straight from the horse's mouth.\" Sky News understands Conservative MP Sir Iain Duncan Smith, a strong opponent of the deal, has just returned from Washington where he lobbied the White House, National Security Council, and State Department on the issue. 'Kill this terrible deal,' says Badenoch The law to give away the islands is still before parliament, and the issue has become a significant political row. The Conservatives and Reform UK both oppose the deal, while the Liberal Democrats have demanded MPs are given a fresh vote on the issue. Responding to Mr Trump's latest comments, Tory leader Kemi Badenoch said the US president was \"right\". \"Chagos is a strategic asset. If our closest ally is saying this, the PM should listen. It's time to kill this terrible deal,\" she added. But Liberal Democrat leader Sir Ed Davey criticised Mr Trump's changing position: \"Trump's endless flip-flopping on the Chagos Islands shows why Starmer's approach is doomed to fail. Britain can't rely on the US while Trump is in the White House.\" Reform UK leader Nigel Farage said: \"Keir Starmer risks alienating our most important ally by giving away the Chagos Islands, the worst deal in British history… Starmer must cancel this deal.\" The House of Lords inflicted four defeats on the government last month on the details of the leasing of Diego Garcia - and the publication of any detailed payments made to Mauritius. The government pulled the bill from the Lords, and has yet to reschedule it."
    },
    {
        "title": "Trump could be about to force yet another Labour U-turn",
        "description": "Number 10 will be nursing its whiplash this evening as Donald Trump once again throws a diplomatic hand grenade into the UK's Chagos deal with Mauritius.",
        "url": "https://news.sky.com/story/starmer-must-bring-trump-back-from-the-brink-or-chagos-deal-is-dead-13509338",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-keir-starmer-donald-trump_7139750.jpg?20260119144840",
        "type": "UK",
        "Author": "Mhari Aurora",
        "Date Published": "2026-02-18 22:44:00",
        "Headline": "In a fresh attack online, the US president said the deal would be \"a blight\" on the UK and claimed the prime minister is \"losing control\" of the military base. ",
        "Content": "\n          Political correspondent\n              @MhariAurora\n Number 10 will be nursing its whiplash this evening as Donald Trump once again throws a diplomatic hand grenade into the UK's Chagos deal with Mauritius. Posting on Truth Social, Donald Trump implored Sir Keir Starmer to scrap the deal, saying: \"DO NOT GIVE AWAY DIEGO GARCIA!\" In his long post online, the US president claimed the prime minister is \"losing control\" of the military base in the Indian Ocean, and that the deal would be \"a blight\" on the UK. It came just a day after the US government released a statement in which it said it \"supports the decision of the United Kingdom to proceed with its agreement with Mauritius concerning the Chagos archipelago\". Number 10 and the Foreign Office will be asking itself what has changed in the space of 24 hours. UK government backs 'crucial' deal Pushing back on Trump's latest change of heart, a Foreign Office spokesperson said: \"The deal to secure the joint UK-US military base on Diego Garcia military is crucial to the security of the UK and our key allies, and to keeping the British people safe. \"The agreement we have reached is the only way to guarantee the long-term future of this vital military base.\" So what now? The government clearly did not see this latest Trump intervention coming, but leaders are often judged not by the events that happen on their watch but how they deal with such events. Interestingly, only last night Starmer and Trump held a bilateral phone call - but when Number 10 released a readout of that meeting, there was no mention of the Chagos deal. 'Utter humiliation' Opposition parties on the right are celebrating Trump's comments as a win for their campaigning. Shadow foreign secretary Priti Patel called this \"an utter humiliation\" for the prime minister, arguing the deal is undermining the UK's relationship with the US and must be junked. And the Tory leader Kemi Badenoch mirrored previous comments made last month by the US president, calling the deal an \"act of stupidity\" and self-sabotage. Reform UK's leader Nigel Farage claims the deal negotiated by the government risks alienating the US and has also called for the deal to be scrapped. Read more from Sky News:Tech firms could be blocked from UKPlans to raise minimum wage could be delayed Meanwhile, the Liberal Democrat leader Sir Ed Davey used the fallout as an opportunity to continue his attacks on Trump, insisting the US is no longer an ally the UK can rely on, and we must cosy up to our neighbours in Europe. Rather awkwardly the foreign secretary, Yvette Cooper, is in the US this week and will be having meetings with Trump's top team in Washington DC. Despite being blindsided by the persistent flip-flopping of the US administration's position on the Chagos deal, it could be a fortuitous opportunity to plead the UK government's case directly to her counterpart Marco Rubio. The Conservatives and Reform will be hoping Trump's latest intervention may be able to push the prime minister into rethinking this deal, or at least cause him enough political difficulty that the deal is ratified under a dark cloud. Starmer will need to bring the US president back from the brink, or we could be seeing U-turn number 16 from Labour."
    },
    {
        "title": "Retail warns of high price for workers from government costs ahead",
        "description": "Retail staff face reduced hours or even losing their job as bosses continue to face up to rising government-imposed costs, according to an industry lobby group.",
        "url": "https://news.sky.com/story/retail-warns-of-high-price-for-workers-from-government-costs-ahead-13509197",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-highstreet-communities_7030789.jpg?20250924205743",
        "type": "UK",
        "Author": "James Sillars",
        "Date Published": "2026-02-18 16:19:00",
        "Headline": "An industry body reports growing pessimism among those holding the purse strings following a year of job losses across the sector, cuts widely blamed on policy decisions.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Retail staff face reduced hours or even losing their job as bosses continue to face up to rising government-imposed costs, according to an industry lobby group. The British Retail Consortium (BRC) said its survey of finance chiefs in the sector found 61% were planning to reduce the number of hours and overtime for staff. The body reported that 55% saw head office workers at risk while 42% were to target in-store roles amid a surge in pessimism on the outlook, despite 74,000 jobs already being cut over the past 12 months. Mark Kleinman blog: See latest stories from Sky's City editor For more information about how we use your data and your rights, you can visit our Privacy Centre. The BRC said its study revealed a sharp rise in anxiety about labour-related costs, concerns that it said had \"shot up the agenda\" since the phased implementation of new employment laws got under way. The survey's findings risk exacerbating the growing sense of crisis over unemployment, with the UK's jobless rate surging by more than a percentage point to 5.2% since Labour came to power. It's currently at a level not seen for almost five years. The official figures have also shown youth unemployment at 16.1% - its highest figure since 2014 - and weaker pay awards across the private sector. Businesses, especially in big employment sectors such as retail, have complained of higher costs since the pandemic, but their concerns have intensified since the 2024 budget. The BRC said raised employer national insurance contributions, coupled with minimum wage hikes, imposed since last April, had added £5bn annually to the sector's costs, harmed investment, pay awards and employment. It calculated that the cost of employing a full-time entry-level worker rose by 10%, while that number rose to 13% for someone part-time. At the same time, continuing cost of living pressures have harmed both essential and discretionary spending among consumers, exacerbating fears over the future of UK high streets. PM rules out minimum wage U-turn The BRC said its members faced another increase in labour costs this April due to further minimum pay rises above the rate of inflation. The Times reported this week that the government was reviewing its pledge to equalise, over time, the minimum wage between younger and older workers, to avoid placing further pressure on youth unemployment. But Sir Keir Starmer later ruled out a U-turn, arguing: \"We've made commitments to young people in our manifesto, and we will keep to those commitments, including the commitment that we would make sure that the living wage would go up this April, which I can absolutely confirm to you will happen.\" Read more from Sky News:Man dead after double stabbingTrump warns Starmer of 'big mistake' BRC chief executive Helen Dickinson said of its report: \"We all want more high-quality, well-paid jobs. \"But retail has already lost 250,000 roles in the past five years, and youth unemployment is climbing fast.\" If the government's flagship Employment Rights Act fails to consider business needs on policies like guaranteed hours and union rights, she warned, it will \"add complexity and reduce flexibility, ultimately stripping away entry-level and part-time opportunities at precisely the moment the country needs them most\". A government spokesperson acknowledged retailers \"are facing a difficult time\", but said the reforms \"will boost productivity and retention in workplaces across the UK and give job security to over 18 million workers\". \"We are also supporting retailers through our small business plan, and we will work with business including the BRC to see what further support we can provide ahead of publishing our High Streets Strategy later this year,\" they said."
    },
    {
        "title": "Man dead and teen critically injured after stabbings at skate park in Northampton",
        "description": "A man is dead and a teenage boy is in a critical condition after being stabbed at a skate park in Northampton.",
        "url": "https://news.sky.com/story/man-dead-and-teen-critically-injured-after-skate-park-stabbing-13509360",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-police-devon-fire_7067205.jpg?20251030175538",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-18 23:56:00",
        "Headline": "A murder investigation has been launched and police said four people - two teenage boys, a man, and a woman - have been arrested.",
        "Content": "A man is dead and a teenage boy is in a critical condition after being stabbed at a skate park in Northampton. Four people have been arrested in connection with Wednesday's incident in the Briar Hill area, police said. They are two teenage boys, a man, and a woman all from Northampton. All remain in custody. The man who died was in his 20s and the boy who was stabbed is in hospital with life-threatening injuries. Northamptonshire Police have launched a murder investigation, and anyone with information - including CCTV or doorbell footage - is being urged to come forward. Detective Chief Inspector Torie Harrison said: \"This is a tragic incident in which a man has sadly lost his life, and a teenage boy is in a critical condition. Our thoughts are firmly with both their families at this difficult time.\" Officers are \"working at pace to establish what has happened\", the inspector continued, but added: \"I would still appeal for any witnesses or anyone with information who has not yet come forward, to please do so.\" Read more from Sky News:Trump warns Starmer of 'big mistake'Ex-Man Utd star's strong words for Mourinho A police cordon remains in place at the park in Ringway and house-to-house enquiries are set to continue. Locals are asked to avoid the area where possible."
    },
    {
        "title": "Dennis the Menace plays 'greatest prank yet' as Royal Mint presses 75-year anniversary 50p coins",
        "description": "A new range of Dennis the Menace-themed coins will be minted, marking 75 years of the iconic comic prankster.",
        "url": "https://news.sky.com/story/dennis-the-menace-plays-greatest-prank-yet-as-royal-mint-presses-75-year-anniversary-50p-coins-13509040",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-dennis-the-menace-beano_7168092.jpg?20260218113058",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-18 11:20:00",
        "Headline": "Marking 75 years since the iconic Beano character made his first appearance, the Royal Mint's Rebecca Morgan said the 50p coin \"captures everything we love about him\".",
        "Content": "A new range of Dennis the Menace-themed coins will be minted, marking 75 years of the iconic comic prankster. A collaboration between the Royal Mint and Beano will see Dennis and his dog Gnasher feature on collectable 50p coins. Vibrant colour printing is available, meaning the cartoon character's famous red and black jumper pops next to an engraving that reads \"75 years of Dennis\". The character made his first appearance in issue 452 of the Beano on 17 March 1951 and has since appeared on the BBC, ITV, and in video games. Dennis and Gnasher were also the mascots for Beanoland in Chessington World of Adventures from 1999 to 2010. It's the latest birthday celebration for the famous prankster. For his 60th, he and Gnasher gatecrashed the headquarters of Sky News in a comic strip. Rebecca Morgan, from the Royal Mint, said there's \"something wonderfully fitting about this legendary mischief-maker finally making his mark\" on the collectable coins. \"I'm sure Dennis himself would see it as his greatest prank yet,\" she added. Rob Glenny, from Beano, which was launched by Dundee-based publisher DC Thomson in 1938, said the coin \"captures the unmistakable spark that has kept Dennis at the heart of childhood for generations\". Read more: How the Beano's characters have changed The commemorative coin is available to buy from the Royal Mint's website from today, starting at £15. Fom 26 February, visitors to the Royal Mint Experience, based in Llantrisant, South Wales, will also be able to mint their own Dennis the Menace coin. "
    },
    {
        "title": "Tech firms must take down abusive images in 48 hours - or face being blocked from UK",
        "description": "Technology firms that do not take down abusive images from their platforms within 48 hours face being blocked from the UK under new rules proposed by the government.",
        "url": "https://news.sky.com/story/tech-firms-must-take-down-abusive-images-in-48-hours-or-face-being-blocked-from-uk-13509229",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-sir-keir-starmer-grok_7130381.png?20260108174350",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-18 22:29:00",
        "Headline": "Tech companies that don't take down abusive images reported to them could be blocked from operating in the UK or fined 10% of worldwide revenue.",
        "Content": "Technology firms that do not take down abusive images from their platforms within 48 hours face being blocked from the UK under new rules proposed by the government. Prime Minister Sir Keir Starmer said he was putting tech companies \"on notice\" to take down non-consensual intimate images, and will leave \"no stone unturned\" to protect women and girls. Companies will be legally required by law to remove the images within 48 hours of them being reported to them. If they do not, firms could be fined 10% of qualifying worldwide revenue - which could amount to billions of pounds for some major platforms - or have their services banned from the UK. Ministers say tech firms should take tackling intimate image abuse as seriously as they take tackling terrorist or child sexual abuse material. The government is making the change through an amendment to the Crime and Policing Bill, which is currently going through parliament. Media regulator Ofcom is also considering plans to treat non-consensual intimate images as the same as child sexual abuse material, which is digitally marked when found, so that any time they are re-shared, they are automatically taken down. \n                  Are you using an AI-generated password? It might be time to change it\n                 \n                  Priced-out Britons are using AI for financial advice. Critics call it a 'dangerous' - we put the chatbots to the test\n                 \n                  Beth Rigby: The constant challenges I face keeping my kids safe in the new Wild West\n                 Additionally, the government says it will publish guidance for internet companies on how to block \"rogue websites\" that host this content and fall out of reach of the Online Safety Act. Sir Keir said he would \"leave no stone unturned in the fight to protect women from violence and abuse\". He said the government had already taken \"urgent action against chatbots and 'nudification' tools\", and that they were \"going further, putting companies on notice so that any non-consensual image is taken down in under 48 hours\". Technology Secretary Liz Kendall said: \"The days of tech firms having a free pass are over... No woman should have to chase platform after platform, waiting days for an image to come down.\" Shadow technology secretary Julia Lopez said when a similar proposal was put forward by Conservative peer, Baroness Charlotte Owen, Labour had failed to take action. \"Once again, the government is playing catch-up to duck a major backbench rebellion. \"The reality is that, for all the prime minister's tough rhetoric, he has arrived late to this issue. He does not know what to believe - he only knows what to do to try and survive another week.\" The move follows controversy in January over X's AI tool, Grok, creating AI images undressing people without their consent. Creating non-consensual intimate images, including sexually explicit deepfakes, was criminalised earlier this month, and X stopped Grok from creating the images following the outrage. Other countries are also taking action against X, with Ireland's data privacy regulator saying on Tuesday that X faces an EU privacy investigation over the non-consensual deepfakes created by Grok. Earlier this week, Sir Keir announced a crackdown on social media platforms, such as closing a legal loophole to eliminate \"vile illegal content created by AI\". Downing Street has also launched a consultation on measures like an Australian-style ban on under-16s using social media, and is ensuring it is able to implement one quickly if it is recommended."
    },
    {
        "title": "Britain's Got Talent dancer Kerri-Anne Donaldson found dead at home had been accused of 'child sex offence', inquest hears",
        "description": "A Britain's Got Talent dancer found dead at home had been arrested over a child sex offence just days earlier, an inquest has heard. ",
        "url": "https://news.sky.com/story/britains-got-talent-dancer-kerri-anne-donaldson-found-dead-at-home-had-been-accused-of-child-sex-offence-inquest-hears-13509167",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-kerri-anne-donaldson_7168158.jpg?20260218173300",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-18 15:19:00",
        "Headline": "The 38-year-old, who reached the semi-final of Britain's Got Talent as part of a dance group, was found dead at her home in Farnborough, Hampshire, the morning after being released from hospital.",
        "Content": "A Britain's Got Talent dancer found dead at home had been arrested over a child sex offence just days earlier, an inquest has heard.  Warning: This story contains descriptions some readers may find distressing, including references to suicide. Kerri-Anne Donaldson's body was discovered in Farnborough, Hampshire, on 7 June 2023 - the day after she was discharged from hospital. The 38-year-old had been taken into custody and questioned at a police station on suspicion of \"child sex offending\" three days before her death, the hearing was told. Ms Donaldson, who reached the semi-final of the TV talent show in 2014 as part of dance group Kings and Queens, was arrested on 4 June 2023 about the alleged sex offence, which she denied. After going missing and being found at a hotel in Woking, Surrey, she was taken to nearby St Peter's Hospital, having taken an overdose. But she was discharged on 6 June, then Ms Donaldson was found dead at her home the following morning, Winchester coroner's court heard. At an inquest into her death, the coroner heard Ms Donaldson told the alleged victim she would take her own life \"if someone finds out\" about the allegation made to police. Detective Constable Benjamin Harris, of Hampshire Constabulary, said he considered the possibility Ms Donaldson's reported comments could be a \"form of control\" against her accuser. He said: \"In my experience in some offences it can often be said without wanting to carry it out.\" After being taken to hospital following her arrest and deemed a \"high and imminent risk of suicide\", she was later ruled suitable for release as she had \"settled\", allowing her to be discharged. Consultant psychiatrist Dr Martin Williams, who was one of three mental health workers who carried out an assessment of Ms Donaldson before her release, told the inquest she was suffering from an \"acute adjustment reaction\" to her arrest. Read more from Sky News:Is Britain's most notorious prisoner finally going to be released?UEFA probing claims Real Madrid forward was racially abused A psychiatric nurse rated her risk at level 10 out of 10 on 5 June, but the next day she was assessed as having changed her position from the previous evening and was released. Dr Williams said: \"I was able to form a snapshot of the risk she was posing at that point, she expressed clearly that she didn't have plans to carry out acts that could lead to her death. \"It struck me how warm and personable Kerri-Anne was, it struck me she was open, she was receptive, she was showing emotions appropriate of what she was facing.\" Dr Williams added: \"We considered the possibility she was masking a higher level of risk than she was saying, but all the indications were that she was settling and the risk was markedly reduced from the previous day.\" Dr Williams said hospital staff were told the nature of the allegation by either police or Ms Donaldson, but she told him she no longer believed she was \"definitely going to go to prison\". He said: \"She had shifted from a position of quite stressed and downbeat about the police involvement to where she felt much more confident.\" Dr Williams said Ms Donaldson said she \"wanted to take her own legal advice and wanted to fight the case\". He added: \"She believed she had a good case in putting together a defence to whatever the arrest was for, she believed she had a good case. \"She expressed a view on the day of the assessment, she was no longer so worried about going to prison.\" Detective Chief Superintendent Sarah McConnell, of Hampshire Constabulary, said the officer who carried out an enhanced risk assessment of Ms Donaldson while she was in hospital acted \"appropriately\" by not revealing to the medical team what she had been arrested for. No further details about the nature of the allegation, other than it was over \"child sex offending,\" were heard during the inquest. The hearing continues. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Police name suspect in London knife murder as £10,000 reward offered",
        "description": "Detectives have named a man they want to speak to in connection to the murder of Dariusz Serafin, who died a year ago after he stumbled into a London pub with knife wounds. ",
        "url": "https://news.sky.com/story/police-name-suspect-in-london-knife-murder-as-16310000-reward-offered-13509211",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-siavosh-mohammad-khani_7168489.png?20260218180954",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-18 17:11:00",
        "Headline": "The Metropolitan Police have released an image of Siavosh Mohammad-Khani, who they want to speak to in connection with the murder of Dariusz Serafin in Hanwell just over a year ago.",
        "Content": "Detectives have named a man they want to speak to in connection to the murder of Dariusz Serafin, who died a year ago after he stumbled into a London pub with knife wounds.  Police are urging anyone with information that leads to the arrest and prosecution of Siavosh Mohammad-Khani, 34, to come forward. A reward of £10,000 has been offered by Crimestoppers for information, the Metropolitan Police said. Serafin, 33, staggered into a pub on Oaklands Road in Hanwell, west London, on 10 February 2025 at about 10.15pm with serious injuries from knife wounds. He was pronounced dead at the scene, despite the efforts of paramedics. After a year-long investigation, police put out a public appeal on Wednesday to speak to Mohammad-Khani in connection to the murder. The Met have released an image of Mohammad-Khani, along with footage of him taken on the day of the murder. \n                  Ex-council worker who stole £900k from vulnerable claimants to fund luxury lifestyle is jailed\n                 \n                  UK gang jailed after cocaine found hidden in books destined for Australia\n                 \n                  Hundreds arrested for phone theft in London - as Met chief calls on courts to stop releasing offenders\n                 The video shows him at a garage in Marylebone with a black BMW X4 car, with the registration HV67 RZP. The car is believed to have been used by Mr Serafin's killers on the night of the murder. Detective Chief Inspector Alison Foxwell said: \"Dariusz's death was a tragedy, and we are working tirelessly to get justice for his family. \"Since last year, we have worked to piece together vital clues of what took place that night, and are now asking for the public's help as part of our enquiries.\" DCI Foxwell urged anyone who knows where Mohammad-Khani can be found to contact police or Crimestoppers. She also appealed for anyone who saw the black BMW, or may have CCTV or dashcam footage of the car, to come forward. \"We are appealing directly to anyone with information to please do the right thing and come forward - even the smallest detail might prove vital,\" she said. Crimestoppers Greater London regional manager Alexa Loukas said the charity was a safe and secure way for anyone who is unwilling to speak directly to the police to pass on information. Read more from Sky News:CCTV shows the moments before Saudi student is fatally stabbedDancer found dead at home accused of 'child sex offence', inquest hears \"Tell us what you know, and we'll pass your information on,\" she said. \"Dariusz's family are desperate for answers, and need justice. You could make a huge difference in this tragic case. \"With our guarantee of anonymity, you will never have to speak to the police, attend a court or provide a witness statement.\""
    },
    {
        "title": "How US military is assembling within striking distance of Iran",
        "description": "Donald Trump told protesters in Iran that \"help was coming\" little over a month ago.",
        "url": "https://news.sky.com/story/how-the-us-military-is-assembling-within-striking-distance-of-iran-13509295",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-jordan-trump_7168653.png?20260218213514",
        "type": "World",
        "Author": "Michael Clarke",
        "Date Published": "2026-02-18 22:40:00",
        "Headline": "A powerful US military force is assembling within striking distance of Iran.",
        "Content": "\n          Military analyst\n       Donald Trump told protesters in Iran that \"help was coming\" little over a month ago. But at that time, there was almost no US military presence that would have made a difference in the region. On 22 January, he said there was a \"great armada\" assembling, when what he was referring to was the aircraft carrier, the USS Abraham Lincoln and its attendant Carrier Strike Group 3. None of it matched his rhetoric. But by this weekend, it will have done so, as a powerful US military force assembles within striking distance of Iran. It has three main elements. First is the naval force. The Lincoln and its CSG 3 will shortly be joined by the USS Gerald Ford, and its attendant CSG 12. The USS Ford is passing through the Gibraltar Strait in the next 24 hours and can be expected to be on station south of Cyprus in about four days, travelling at normal cruising speed. Read more:Middle East seemingly edging closer to warIran and US agree 'guiding principles' These two Nimitz-class carriers (CVN 72 and CVN 78) will be bringing extra air defence and Tomahawk-carrying destroyers with them, bringing the number of known, and named, US destroyers in the region to 11. They will join three Littoral Combat Ships already on station and a good number of support ships as well. In addition, each CSG includes - though never usually named - a nuclear attack submarine (an SSN), probably of the Virginia class. And there may also be an Ohio-class SSN in the area, which is specifically designed to launch Tomahawk and other missiles at land targets. The second element has been provided over the previous 10 days by an extensive series of C-5 and C-17, Galaxy and Globemaster flights in and out of the region, bringing air defence assets to US bases, presumably as cover in the event of any Iranian retaliation in response to potential US attacks. Israeli \"Iron Dome\" air defence batteries have also been moved from its frontier with Gaza to its borders in the east, probably for the same reason. And thirdly, the US has sent an extensive force of KC-130 air-to-air refuelling tankers to bolster its existing air tanker force. They left from the British base at Mildenhall (six tankers on 16 February) to Greece, and (on 18 February) no fewer than 10 more came from bases in the continental United States, via Britain, to bases in Greece and Bulgaria. In addition, US aircraft are known to be in the British base at Akrotiri in Cyprus, at Aviano in Italy, in the Azores, in Spain and at the Chagos Island base of Diego Garcia. Well over 100 US combat aircraft - F-15s, F18s, F-22s, F35s and B2 bombers - are now available to US military planners in the potential theatre of operations. But the extra KC-130 tankers are the giveaway. They give away the possibility that US aircraft might be operating from bases not sited on the territories of America's Middle East allies, but from less politically sensitive bases further away. And they give away the possibility that any air campaign might be quite prolonged, not just a sudden one-off attack. The final piece of the jigsaw: no fewer than six E3 Sentry aircraft. These flying control centres can survey and control everything that happens beneath them. They are, in effect, flying HQ's and a country can run a war from one of them. By the weekend, there will be a lot for these six E3 Sentry aircraft to look at and control. What all this military power will be used for is still a matter of some speculation. What does the tracking data show us? By Freya Gibson, junior OSINT producer Sky News Data & Forensics team has tracked the locations of US military planes and ships heading to the region in recent days and weeks. Several US Navy boats have been sent to the Middle East, including the USS Abraham Lincoln, a nuclear-powered aircraft carrier that carries 90 aircraft, including F35 fighters, and 5,680 crew. The Lincoln is leading a carrier strike group which includes three destroyers. The ship was last seen in the Arabian Sea around 240km off the coast of Oman. Sky News confirmed the location of this ship on 15 January. In addition, the USS Gerald R Ford, the lead ship of the US Navy's nuclear-powered aircraft carriers, is en route to the Middle East. Sky News has confirmed its latest location as tracking shows the Ford was around 600km from the Strait of Gibraltar at 1.58pm on 18 January. This aircraft carrier, like the USS Abraham Lincoln, also forms a carrier strike group that includes three destroyers. In total, there are reported to be more than 12 US ships now in the Middle East. Sky News has also tracked movements of US aircraft in the region. More than 15 refuelling tankers have repositioned towards the Middle East and Europe since 16 January. These aircraft, the K-135s, are aerial refuelling aircraft. They can carry up to 200,000 pounds of fuel and 83,000 pounds of cargo. They have four engines and operate at speeds up to 530mph and altitudes up to 50,000 feet.  The aircraft came from multiple locations, including RAF Mildenhall in the UK, Tampa in Florida and Sioux City in Iowa. They have been landing in different locations, including Chania Airport in Greece and Sofia Airport in Bulgaria. Satellite imagery shows F-15s and A-10 Thunderbolts at Muwaffaq Salti Air Base, Jordan. They can conduct precision airstrikes and engage armoured targets, alongside C-130 transport aircraft providing logistical support. What is Iran doing? Sky News has tracked the positions of Iranian Navy vessels using data from TankerTrackers. Around six vessels can be seen just off the coast of Bandar Abbas on 16 January. One of these ships is an Iranian Drone Carrier, IRIS Shahid Bagheri. Satellite imagery confirmed its location on 16 January, 10km from the coast. It is often spotted around this location in the Strait of Hormuz. It can deploy roughly 60 drones along with helicopters."
    },
    {
        "title": "UEFA investigating alleged racist abuse directed at Real Madrid's Vinicius Junior",
        "description": "UEFA has appointed an ethics and disciplinary inspector after allegations a racist &#8204;slur was directed at Real Madrid forward Vinicius Junior during last night's Champions League match against Benfica. ",
        "url": "https://news.sky.com/story/uefa-investigating-alleged-racist-abuse-directed-at-real-madrids-vinicius-junior-13509064",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-francois-letexier-vinicius-junior_7167791.jpg?20260217231050",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-18 12:18:00",
        "Headline": "The Champions League match in Lisbon was stopped for the incident, shortly after ​Vinicius Junior gave Real Madrid a 1-0 lead over Benfica.",
        "Content": "UEFA has appointed an ethics and disciplinary inspector after allegations a racist ‌slur was directed at Real Madrid forward Vinicius Junior during last night's Champions League match against Benfica.  The match, in Lisbon, Portugal, was halted five minutes into the second half, shortly after ​Vinicius gave the away side a 1-0 lead in the first leg of the knockout playoffs. Cameras picked up the 25-year-old telling French referee Francois Letexier he had been targeted in a comment made to him by Benfica's Gianluca Prestianni. Prestianni has denied making a racist slur, claiming the Real player \"misinterpreted what he thought he heard\". In a statement, UEFA said that an \"Ethics and Disciplinary Inspector has been appointed to investigate allegations of discriminatory behaviour\" during the game. It added that \"further information regarding this matter will be made available in due course\". Responding to the UEFA announcement, Benfica said the club viewed the appointment \"with a spirit of complete collaboration, transparency, openness and a sense of clarity\". \n                  Two dead and hundreds arrested across France after PSG's Champions League win\n                 \n                  Merchandise stand catches fire outside Manchester City's stadium ahead of Champions League match\n                 \n                  Champions League draw: UEFA insists no risk AI-assisted system will be manipulated by cyber attacks\n                 The statement added the club \"clearly and unequivocally\" reaffirms their commitment to \"equality, respect and inclusion\" but added that they regret \"the defamation campaign to which the player has been subjected\". The Champions League match was stopped for 11 minutes as Vinicius went to the sidelines at the Estadio da Luz. Both coaches, Benfica's Jose Mourinho and Madrid's Alvaro Arbeloa, talked to him at one point. It appeared that Benfica players were not happy with the forward because he celebrated his goal by dancing in front of the corner flag, and some went to confront him. Vinicius had been shown a yellow card after the celebration. After the forward's complaint, the referee responded by crossing ​his arms in front of his ⁠face, activating FIFA's anti-racism protocol and stopping the match. Real's players threatened ⁠to leave the pitch ​as tensions rose, but the referee ​eventually allowed the match to resume. Step one - If the referee becomes aware of alleged racist behaviour, or is informed of it by the fourth official, he or she will stop the game.\n The referee will then request an announcement to be made over the public address system asking spectators to immediately stop any alleged racist behaviour - if the alleged racism involves the crowd.\n Step two - If the alleged racist behaviour does not cease after the game has restarted, the referee will suspend the match for a reasonable period of time, for example, five to ten minutes, and request teams to go to the dressing rooms. \n\n A further announcement is then made over the public address system.\n Step three - As a final resort, if the alleged racist behaviour continues after a second restart, the referee can definitively abandon the match. The UEFA delegate responsible for the match will assist the referee, through the fourth official, in determining whether the alleged racist behaviour has ceased.  Any decision to abandon the match will only be taken after all other possible measures have been implemented and the impact of abandoning the match on the security of the players and public has been assessed. After the match, the case is referred to UEFA's disciplinary authorities. The teams are due to go to Madrid to play the second leg, with the Spanish side 1-0 up, but Sky News' sports correspondent Rob Harris said there could be sanctions - including a ban for the Benfica player if he is found guilty of racial abuse. In a post on his Instagram story after the game, Vinicius said that \"racists are, above all, cowards\". He added, however, that he felt \"they have, on their side, the protection of others who, theoretically, have the obligation to punish\". \"Nothing that happened here today was new in my life and my family's\", the Brazilian player said. \"I received a yellow card for celebrating a goal. I still don't understand why. \"On the other hand, just a poorly executed protocol that served no purpose. I don't like appearing in situations like this, even more so after a great victory and when the headlines have to be about Real Madrid, but it's necessary.\" In a message on his own Instagram, Prestianni said: \"I want to clarify that at no point did I direct racist insults at the player Vinicius Junior, who unfortunately misinterpreted what he thought he heard. \"I have never been racist towards anyone, and I regret the threats I received from Real Madrid players.\" Gianni Infantino, president of FIFA, football's world governing body, said he was \"shocked and saddened\" to see the incident of alleged racism towards Vinicius. \"There is absolutely no room for racism in our sport and in society,\" he said. \"We need all the relevant stakeholders to take action and hold those responsible to account.\" Read more from Sky News:Police blow in case of TV host's missing motherIs Charles Bronson on the verge of freedom? Vinicius has made multiple allegations of racist abuse by both players and fans since he moved to Spain's La Liga in 2018, including during matches against Real's fiercest rivals, Atletico Madrid and Barcelona. In 2023, he reacted to alleged racist abuse in a match at Valencia by saying \"racism is normal in La Liga\". Later that year, the Vinicius Jr law was passed in Brazil to combat racism at sporting events. In 2024, at a news conference ahead of Brazil's friendly against Spain in Madrid - a game organised to raise awareness of racism in the sport - Vinicius broke down, admitting he had \"less will to play\" because of the abuse directed toward him."
    },
    {
        "title": "Ex-Victoria's Secret mogul says Jeffrey Epstein 'stole vast sums from our family'",
        "description": "A billionaire mogul says paedophile financier Jeffrey Epstein stole vast sums from his family.",
        "url": "https://news.sky.com/story/ex-victorias-secret-mogul-says-jeffrey-epstein-stole-vast-sums-from-our-family-13509269",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-les-wexner-jeffrey-epstein_7168343.png?20260218144856",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-18 21:21:00",
        "Headline": "Les Wexner, 88, allowed Epstein to manage his finances but stressed he did not know about his crimes.",
        "Content": "A billionaire mogul says paedophile financier Jeffrey Epstein stole vast sums from his family. Les Wexner, 88, who was behind retailers including Victoria's Secret and Abercrombie & Fitch, was answering questions about his friendship with Epstein in a behind-closed-door session on Wednesday with US Congress. Mr Wexner, who is pictured in the Epstein files, has not been accused of any wrongdoing and always denied any knowledge or involvement in Epstein's crimes. He is one of Epstein's most prominent former friends, and their relationship stretches back to the 1980s, but he is on the record as saying he regrets the friendship. In August 2019, he said: \"I am embarrassed that, like so many others, I was deceived by Mr Epstein. \"I know now that my trust in him was grossly misplaced and I deeply regret having ever crossed his path.\" Epstein files latest Ahead of the hearing, Mr Wexner, who had allowed Epstein to manage his finances, released a statement he was due to provide to US Congress. He said he was \"pleased to testify\" because it would provide \"an opportunity to set the record straight\", but added he had been \"naive, foolish, and gullible\" for trusting Epstein with his business. Mr Wexner stressed he did not know about or witness Epstein's crimes or take part in them. He added that Epstein had revealed in 2006 that he had legal issues in Florida, which later turned into his conviction for sexual abuse. Read more:Police assess information around private flights to and from Stansted AirportTrump administration accused of 'purposefully muddying waters' A year later, he revealed the situation \"could become messy\" and left it to Mr Wexner's wife to handle their personal finances. This led to the family discovering \"Epstein had stolen vast sums from our family\", he said. Mr Wexner said: \"Once I learned of his abusive conduct and theft from my family, I never spoke with Epstein again. Never.\" The businessman also testified on Wednesday that he had never seen Epstein with any young girls, and his heart goes out to each of his victims. \"The pain he inflicted upon them is unfathomable to me,\" he said 'Birthday book' A note from a person signed as \"Leslie\" featured in Epstein's \"birthday book\", which was released as part of the Epstein files. The note addresses Epstein and says the author wanted to \"get you what you want\" over what appears to be a drawing of breasts. It is then signed with \"your friend Leslie\". As there is no surname, it is unclear who the author is. Sky News' data and forensics team have analysed the signature and believe there are similarities with Mr Wexner's handwriting. Being featured in the Epstein files is not an indication of wrongdoing. UK police forces investigating information from Epstein files On Wednesday, West Midlands Police said it was assessing information \"that has emerged in relation to private flights into and out of Birmingham Airport following the publication of the US DoJ Epstein files\". It is understood private jets linked to Epstein passed through BHX, according to flight logs between the early 1990s and 2018. That was the fourth UK police statement, connected to the Epstein files, since Tuesday. Essex Police had said on Tuesday it was working through logs of private jets that had travelled through Stansted Airport, while Bedfordshire Police said it was reviewing links to London Luton Airport. On Wednesday afternoon, Surrey Police said it was carrying out enquires over claims of human trafficking and sexual assault, dating back to 1994. The National Crime Agency confirmed \"a number\" of UK police forces are assessing allegations that have emerged through the Epstein files. Last week, Thames Valley Police said it was assessing claims that Andrew Mountbatten-Windsor shared confidential documents with Epstein while acting as trade envoy. Andrew has vigorously denied any accusations against him related to Epstein and his crimes. Earlier this month, the Metropolitan Police confirmed Peter Mandelson would face a criminal investigation into allegations he leaked market sensitive information from Downing Street to Epstein while serving as business secretary. Lord Mandelson has said of his connection to Epstein in a statement: \"I was wrong to believe Epstein following his conviction and to continue my association with him afterwards. \"I apologise unequivocally for doing so to the women and girls who suffered.\""
    },
    {
        "title": "Ex-Man Utd star Mikael Silvestre has strong words for Jose Mourinho over Vinicius Junior's racist abuse claim",
        "description": "Former Manchester United player Mikael Silvestre has claimed Jose Mourinho has \"failed us\" over his response to Vinicius Junior's allegations of racist abuse.",
        "url": "https://news.sky.com/story/mikael-silvestre-has-strong-words-for-jose-mourinho-over-vinicius-juniors-racist-abuse-claim-13509253",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-jose-mourinho-benfica_7168618.jpg?20260218205248",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-18 19:05:00",
        "Headline": "Mikael Silvestre has criticised Benfica's manager in the wake of the Real Madrid forward's allegation of racist abuse in a Champions League fixture.",
        "Content": "Former Manchester United player Mikael Silvestre has claimed Jose Mourinho has \"failed us\" over his response to Vinicius Junior's allegations of racist abuse. The 25-year-old left the field during Real Madrid's Champions League play-off in Lisbon on Tuesday after reporting Benfica winger Gianluca Prestianni to the referee. But Benfica manager Mourinho appeared apportion some blame to Vinicius, telling reporters afterwards: \"A stadium where Vinicius plays, something happens, always.\" On Wednesday, former France international Silvestre told Sky News that Mourinho was trying to mislead fans with his comments. “In terms of what high level and reputation he has, Jose Mourinho failed us,\" Silvestre told chief presenter Mark Austin. \"As an industry, and as human beings, he completely misled everyone - or he tried. “But we are not foolish - and we know what happened.\" Prestianni, however, has denied making racist comments towards Vinicius, claiming he was \"misunderstood\" by his opponent. Mourinho also came under fire for claiming Vinicius had provoked the abuse with his celebration after scoring the only goal early in the second half. The Brazilian danced around the corner flag, an apparent nod to Cameroonian Roger Milla's iconic World Cup celebration. Mourinho told Amazon Prime: \"I told him, when you score a goal like that, you just celebrate and walk back.\" Silvestre hit back against the former Manchester United manager, adding: \"For Jose Mourinho to divert and even vilify Vinicius Junior behaviour for celebrating the goal that he did - remembering Roger Milla for Cameroon years ago - it's not the way a top manager like him should do. \"We expect better, clearly it was bad for everyone, and I hope he's regretting his comment during the game, and also after during the press conference.\" Sports correspondent Vinicius Junior had every right to want to leave the pitch - and for the game to be abandoned. Because while he is a superstar of the game, well used to the biggest Champions League occasions, being the target of racism cannot be excused as coming with football's tribalism. This was reporting being racially abused at work. Just after adding another wondrous strike to his collection of goals. The accused - Benfica's Gianluca Prestianni - has every right to a thorough process if he persists with denials. And the UEFA case has to be watertight before imposing the minimum 10-game ban for racism. But Benfica have gone beyond defending their man with statements, showing no empathy with a player who has been singled out for hate because he is black too often in his career. Read Rob's full analysis here Silvestre is a member on the FIFA Player’s Voice Panel, tasked with advising on on-pitch racism incidents, alongside legends such as George Weah and Didier Drogba. Prestianni's response to abuse allegation In a statement in Portuguese on Instagram, shared by Benfica on social media, Prestianni denied he made any racist comments. He wrote: “I want to clarify that at no time did I direct racist insults to Vinicius Junior, who regrettably misunderstood what he thought he heard. “I was never racist with anyone and I regret the threats I received from Real Madrid players.”"
    },
    {
        "title": "Twelve people die in fireworks explosion at Lunar New Year celebrations in eastern China",
        "description": "At least 12 people have been killed after an explosion and fire at a fireworks shop in eastern China, the country's state media has said.",
        "url": "https://news.sky.com/story/twelve-people-die-in-fireworks-explosion-at-lunar-new-year-celebrations-in-eastern-china-13509070",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-beijing-china-fireworks_7168164.jpg?20260218122005",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-18 12:22:00",
        "Headline": "Firework-related blasts are not uncommon in China, where they are used widely and often indiscriminately during celebrations such as the Lunar New Year holiday, which began on Tuesday.",
        "Content": "At least 12 people have been killed after an explosion and fire at a fireworks shop in eastern China, the country's state media has said. Emergency services put out the blaze at the unnamed shop in the town of Xiangyang, in central Hubei province on Wednesday afternoon, the official Xinhua News Agency said. Flames engulfed a 50sqm (538sqft) area of the premises, state broadcaster CCTV said. Firework-related blasts are not uncommon in China, where they are used widely and often indiscriminately during celebrations such as the Lunar New Year holiday, which began on Tuesday. On Sunday, eight people died and two others were injured after a similar incident at a fireworks shop in eastern Jiangsu province, also in eastern China. Someone had set off fireworks too close to the shop, according to officials. In June, a blast at a fireworks factory ⁠in neighbouring Hunan killed nine ​people and injured 26 ​others. \n                  China imposes 13% tax on condoms as birth rate declines \n                 \n                  China hosts world's first half-marathon race between humans and robots\n                 \n                  China to host world's first half-marathon race between humans and robots\n                 Read more on Sky News:Is a Middle East conflict coming?South Korean drone warning Pyrotechnics have been banned in some Chinese cities for safety and air pollution reasons, but the measures are controversial ⁠as firecrackers are traditionally used ​to scare off evil spirits and remain ​central to the new year celebrations. The latest incident comes a day after the Ministry of Emergency Management warned that \"fireworks are still the biggest risks during the Spring Festival period\". Investigators are now looking into the cause of the Xiangyang explosion, Xinhua said."
    },
    {
        "title": "Ukrainian officials to boycott Winter Paralympics over 'outrageous' decision to allow Russia to compete under flag",
        "description": "Ukrainian officials will boycott next month's Milano Cortina Winter Paralympics over the participation of &#8203;Russian and Belarusian &#8204;athletes who have been cleared &#8203;to compete under their flags.",
        "url": "https://news.sky.com/story/ukrainian-officials-to-boycott-winter-paralympics-over-decision-to-allow-russians-to-compete-under-their-flag-13509072",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-paralympics-winter-paralympics_7168218.jpg?20260218125739",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-18 12:24:00",
        "Headline": "Ukraine's athletes will still take ‌part in the Milano Cortina 2026 Paralympic Winter Games, but no official from the country will attend due to the war.",
        "Content": "Ukrainian officials will boycott next month's Milano Cortina Winter Paralympics over the participation of ​Russian and Belarusian ‌athletes who have been cleared ​to compete under their flags. Russia ​and Belarus will ​have a combined 10 athletes at next month's ⁠Winter Paralympics following Tuesday's ​decision by the International ​Paralympic Committee (IPC). Ukrainian athletes will still take ‌part in the 6-15 March Paralympic Games, but the country's sports minister, Matviy Bidnyi, said no Ukraine official would be at the opening ceremony - ⁠or any event ​of the Games. Mr Bidnyi said: \"In response to the outrageous decision to let Russians and Belarusians compete under their national flags, Ukrainian public officials will not attend the Paralympic Games. \"We will not be present at the opening ceremony. We will not take part in any other official Paralympic events. \"We thank every official from the free world who will do the same. We will keep fighting!\" On Tuesday, the UK Secretary of State for Culture, Media and Sport posted that the decision to allow the participation of the two countries was the completely \"wrong decision\". \"Allowing athletes from Russia and Belarus to compete under their own flags while the brutal invasion of Ukraine continues sends a terrible message,\" Lisa Nandy said, urging the committee to urgently reconsider the decision. The IPC's decision comes after Russia was twice banned from the games, first in 2016 over a state-sponsored doping scheme, and then in 2022 due to the full-scale invasion of Ukraine. The IPC president Andrew Parsons spoke with Sky's sports correspondent Rob Harris last year, claiming that Russian participation in the games was \"not linked to participation in wars\". Read more from Sky News:Zelenskyy risks Trump anger with 'never forgive' criticismUkraine's brutal winter as Russia brings war into homes \"Russia and Belarus, they used Paralympic sport to promote what they called the 'special operation' at the time,\" he said in an interview. \"And this is what led to the first suspension, the suspension in 2023. Between 2023 and now... there is less evidence of that being used again for the promotion of the war.\" The UK and 32 mainly European countries signed a joint statement expressing \"serious concern\" after IPC members voted to lift the partial suspensions of Russia and Belarus in September."
    },
    {
        "title": "Drones flown into North Korea by civilians are harming relations, says South Korea",
        "description": "Drones being flown into North Korea by civilians are harming inter-Korean relations, a South Korean minister has said.&#160;",
        "url": "https://news.sky.com/story/drones-flown-into-north-korea-by-civilians-are-harming-relations-says-south-korea-13508998",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-drones-korea_7168019.jpg?20260218103415",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-18 10:07:00",
        "Headline": "Three civilians flew the aircraft on four occasions between September 2025 and January this year, a South Korean minister has said, as police and the military investigate.",
        "Content": "Drones being flown into North Korea by civilians are harming inter-Korean relations, a South Korean minister has said.  Chung Dong-young claimed three civilians had sent drones to the secretive state on four occasions since Lee Jae Myung became South Korea's president last June. The suspects flew the aircraft between September 2025 and January this year, according to Mr Chung, as police and the military investigate. The unification minister said drones crashed two times in the North, in line with claims made by Pyongyang. On two other attempts, the drones returned to Paju, a border settlement in South Korea, after flying over Kaesong, a city in North Korea, Mr Chung said on Wednesday. Authorities in the South were investigating the three civilians on suspicion of violating the aviation safety act and breaching criminal law by benefiting the enemy, he continued. Some officials at South Korea's military intelligence agency and the national intelligence service were also under investigation for alleged involvement with the trio, Mr Chung added. \n                  Drones delivering drugs and weapons to prisons in 'new era' as organised gangs profit\n                 \n                  Flying taxis could be in UK skies from 2028 and end up being as cheap as an Uber\n                 \n                  Irish police investigating after drone sightings during Zelenskyy visit\n                 \"We express official regret to the North,\" he said, and stated the government was taking the drone incursion incidents very seriously. South Korea's government plans to strengthen penalties for sending drones to the North, Mr Chung said, including up to a one-year jail term or a 10 million won (£5,100) fine. Pyongyang hits out North Korea has reacted angrily over the activity, saying last month that drones from South Korea entered its airspace, after another intrusion in September. Kim Yo Jong, the powerful sister of North Korean leader Kim Jong Un, urged Seoul to investigate the incident, warning provocations could result in \"terrible situations\". Mr Chung also expressed regret over South Korea sending 18 drones to North Korea under the alleged direction of ousted president Yoon Suk Yeol. \"It was an extremely dangerous incident aimed to induce an attack against South Korea by sending 18 drones on 11 occasions, to sensitive areas in North Korea including the airspace over the Workers' Party office,\" he said. Read more from Sky News:British man killed in avalanche in French AlpsBrazilian butt lifts 'should be banned immediately', MPs say Alleged covert drone operation South Korean prosecutors have indicted Yoon, who declared a short-lived martial law in December 2024, before he was ousted in April 2025, on charges that include aiding an enemy state. They accused him and his military commanders of ordering a covert drone operation into the North to raise tensions and justify his martial law decree. Yoon denies wrongdoing. A verdict is expected on Thursday as to whether his martial law declaration amounted to an insurrection."
    },
    {
        "title": "Jose Mourinho sounded like he was victim blaming - but Vinicius Junior needs empathy over alleged racist abuse",
        "description": "Vinicius Junior had every right to want to leave the pitch - and for the game to be abandoned.",
        "url": "https://news.sky.com/story/jose-mourinho-sounded-like-he-was-victim-blaming-but-vinicius-junior-needs-empathy-over-alleged-racist-abuse-13509193",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-real-madrid-vinicius-junior_7167736.jpg?20260217222028",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2026-02-18 16:26:00",
        "Headline": "The Brazilian, one of football's superstars, was allegedly racially abused more than once  during a Champions League tie between Real Madrid and Benfica in Lisbon.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Vinicius Junior had every right to want to leave the pitch - and for the game to be abandoned. Because while he is a superstar of the game, well used to the biggest Champions League occasions, being the target of racism cannot be excused as coming with football's tribalism. This was reporting being racially abused at work. Just after adding another wondrous strike to his collection of goals. The accused - Benfica's Gianluca Prestianni - has every right to a thorough process if he persists with denials. And the UEFA case has to be watertight before imposing the minimum 10-game ban for racism. But Benfica have gone beyond defending their man with statements, showing no empathy with a player who has been singled out for hate because he is black too often in his career. There has been no acknowledgement of how difficult it is to take a stand and report abuse, halting a match being watched worldwide by millions. There has been no recognition of the anguish Vinicius will be feeling, even if, as a club, you do not believe he was called a monkey by Prestianni on Tuesday night in Lisbon - five times, according to his Real teammate Kylian Mbappe. You can recognise that personal pain as a club without admitting wrongdoing. For all the courage and dignity demonstrated by Vinicius - praised by his Brazilian FA bosses - there was only deflection and no compassion from Jose Mourinho and Benfica. They only complained about facing a \"defamation campaign\", and appropriated the memory and legacy of Eusebio and the black superstar's legendary career with them in the 1960s and 70s as evidence that the club cannot be racist. That overlooked the racism Eusebio endured. How does Benfica reaffirming their \"historical and unwavering commitment to defending the values of equality, respect, and inclusion\" align with victim blaming? Mourinho suggested Vinicius incited the crowd with his goal celebration. And yet if there is anyone in football known for goading, overexuberant celebrations, it is Mourinho himself on the touchlines. UEFA has avoided saying anything beyond the appointment of an ethics and disciplinary inspector to investigate. But FIFA President Gianni Infantino did speak out in a statement naming Vinicius, showing \"full solidarity to victims of racism and any form of discrimination\" and saying: \"We need all the relevant stakeholders to take action and hold those responsible to account.\" But that did not happen when another Real Madrid player, Antonio Rudiger, reported being racially abused last year. It was in the Club World Cup - a tournament run by FIFA. An investigation was launched, but no one was held to account. Read more on Sky News:UEFA investigates Vinicius allegationsFans jailed for Vinicius racist abuse So, when the world asks why racism is still a stain on the game, why black players fear being abused in stadiums and online, the words and actions of those with status and power come under greater scrutiny. And at the heart of it is Vinicius feeling he isn't being protected enough by football, and could have to face the alleged perpetrator next week in the second leg in Madrid."
    },
    {
        "title": "Norway's Johannes Hoesflot Klaebo sets record with fifth Olympic gold medal - and 10th overall - at Winter Games",
        "description": "Norway's Johannes Hoesflot Klaebo has won his fifth Olympic gold medal at the Winter Games - and the 10th of his career.",
        "url": "https://news.sky.com/story/norways-johannes-hoesflot-klaebo-sets-record-with-fifth-olympic-gold-medal-and-10th-overall-at-winter-games-13509198",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-johannes-hoesflot-klaebo_7168426.jpg?20260218164628",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-18 16:29:00",
        "Headline": "The 29-year-old's latest win in the men's team sprint means he is now only the second athlete to win 10 Olympic gold medals, following US swimming legend Michael Phelps, who has a total of 23.",
        "Content": "Norway's Johannes Hoesflot Klaebo has won his fifth Olympic gold medal at the Winter Games - and the 10th of his career. The 29-year-old cross-country skier won gold again on Wednesday when he, along with Einar Hedegart, won the men's team sprint with a time of 18 minutes and 28.9 seconds. He has won every race he has entered in at the 2026 Milan Cortina Games, breaking the Winter Olympics record in Sunday's 4 x 7.5km relay. His final race will be in the 50km mass start this weekend. The latest win means Norway's Klaebo is now only the second athlete to win 10 Olympic gold medals, following US swimming legend Michael Phelps, who has a total of 23. \"It's obviously very satisfying to make this happen,\" Klaebo said after his win. \"The team sprint is one of the most fun events, but also one of the hardest.\" He added: \"There are so many strong teams, and so many fast skiers, so it always comes down to tight battles. That makes it even more rewarding.\" Coming in second place were US skiers Ben Ogden and Gus Schumacher, who were just 1.4 seconds behind for the silver medal. Speaking to journalists after the race, Schumacher said that he \"locked in\" - and followed Klaebo over the line. \"I did it, and I'm really proud of it,\" he said. Read more from Sky News:British man killed in avalanche in French AlpsUkrainian officials to boycott Winter Paralympics With 10 metres to go, he saw Ogden - now the US's most decorated male cross-country skier - across the finish line to greet him, and knew a medal was in hand, having beaten Italy's Federico Pellegrino."
    },
    {
        "title": "Ex-Victoria's Secret mogul says Jeffrey Epstein 'stole vast sums from our family'",
        "description": "A billionaire mogul says paedophile financier Jeffrey Epstein stole vast sums from his family.",
        "url": "https://news.sky.com/story/ex-victorias-secret-mogul-says-jeffrey-epstein-stole-vast-sums-from-our-family-13509269",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-les-wexner-jeffrey-epstein_7168343.png?20260218144856",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-18 21:21:00",
        "Headline": "Les Wexner, 88, allowed Epstein to manage his finances but stressed he did not know about his crimes.",
        "Content": "A billionaire mogul says paedophile financier Jeffrey Epstein stole vast sums from his family. Les Wexner, 88, who was behind retailers including Victoria's Secret and Abercrombie & Fitch, was answering questions about his friendship with Epstein in a behind-closed-door session on Wednesday with US Congress. Mr Wexner, who is pictured in the Epstein files, has not been accused of any wrongdoing and always denied any knowledge or involvement in Epstein's crimes. He is one of Epstein's most prominent former friends, and their relationship stretches back to the 1980s, but he is on the record as saying he regrets the friendship. In August 2019, he said: \"I am embarrassed that, like so many others, I was deceived by Mr Epstein. \"I know now that my trust in him was grossly misplaced and I deeply regret having ever crossed his path.\" Epstein files latest Ahead of the hearing, Mr Wexner, who had allowed Epstein to manage his finances, released a statement he was due to provide to US Congress. He said he was \"pleased to testify\" because it would provide \"an opportunity to set the record straight\", but added he had been \"naive, foolish, and gullible\" for trusting Epstein with his business. Mr Wexner stressed he did not know about or witness Epstein's crimes or take part in them. He added that Epstein had revealed in 2006 that he had legal issues in Florida, which later turned into his conviction for sexual abuse. Read more:Police assess information around private flights to and from Stansted AirportTrump administration accused of 'purposefully muddying waters' A year later, he revealed the situation \"could become messy\" and left it to Mr Wexner's wife to handle their personal finances. This led to the family discovering \"Epstein had stolen vast sums from our family\", he said. Mr Wexner said: \"Once I learned of his abusive conduct and theft from my family, I never spoke with Epstein again. Never.\" The businessman also testified on Wednesday that he had never seen Epstein with any young girls, and his heart goes out to each of his victims. \"The pain he inflicted upon them is unfathomable to me,\" he said 'Birthday book' A note from a person signed as \"Leslie\" featured in Epstein's \"birthday book\", which was released as part of the Epstein files. The note addresses Epstein and says the author wanted to \"get you what you want\" over what appears to be a drawing of breasts. It is then signed with \"your friend Leslie\". As there is no surname, it is unclear who the author is. Sky News' data and forensics team have analysed the signature and believe there are similarities with Mr Wexner's handwriting. Being featured in the Epstein files is not an indication of wrongdoing. UK police forces investigating information from Epstein files On Wednesday, West Midlands Police said it was assessing information \"that has emerged in relation to private flights into and out of Birmingham Airport following the publication of the US DoJ Epstein files\". It is understood private jets linked to Epstein passed through BHX, according to flight logs between the early 1990s and 2018. That was the fourth UK police statement, connected to the Epstein files, since Tuesday. Essex Police had said on Tuesday it was working through logs of private jets that had travelled through Stansted Airport, while Bedfordshire Police said it was reviewing links to London Luton Airport. On Wednesday afternoon, Surrey Police said it was carrying out enquires over claims of human trafficking and sexual assault, dating back to 1994. The National Crime Agency confirmed \"a number\" of UK police forces are assessing allegations that have emerged through the Epstein files. Last week, Thames Valley Police said it was assessing claims that Andrew Mountbatten-Windsor shared confidential documents with Epstein while acting as trade envoy. Andrew has vigorously denied any accusations against him related to Epstein and his crimes. Earlier this month, the Metropolitan Police confirmed Peter Mandelson would face a criminal investigation into allegations he leaked market sensitive information from Downing Street to Epstein while serving as business secretary. Lord Mandelson has said of his connection to Epstein in a statement: \"I was wrong to believe Epstein following his conviction and to continue my association with him afterwards. \"I apologise unequivocally for doing so to the women and girls who suffered.\""
    },
    {
        "title": "Donald Trump tells Keir Starmer 'do not give away Diego Garcia' in fresh attack on Chagos Islands deal",
        "description": "Donald Trump has launched a fresh broadside on the UK's Chagos Islands deal with Mauritius, saying Sir Keir Starmer is \"making a big mistake\".",
        "url": "https://news.sky.com/story/donald-trump-tells-keir-starmer-do-not-give-away-diego-garcia-in-fresh-attack-on-chagos-islands-deal-13509245",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-diego-garcia-chagos_7140219.jpg?20260123212238",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-18 18:56:00",
        "Headline": "The US president has changed his tune multiple times about the UK's deal to hand over the Chagos Islands. His latest commentary comes just a day after his administration expressed support for the arrangement.",
        "Content": "Donald Trump has launched a fresh broadside on the UK's Chagos Islands deal with Mauritius, saying Sir Keir Starmer is \"making a big mistake\". In a post on his Truth Social platform, the US president warned against the potential loss of a US-UK military base on Diego Garcia, which the UK is retaining through a 99-year lease of the island. \"Our relationship with the United Kingdom is a strong and powerful one, and it has been for many years, but prime minister Starmer is losing control of this important Island by claims of entities never known of before,\" said Mr Trump. Mr Trump said Sir Keir \"should not lose control, for any reason, of Diego Garcia, by entering a tenuous, at best, 100 Year Lease\". He added: \"This land should not be taken away from the U.K. and, if it is allowed to be, it will be a blight on our Great Ally. We will always be ready, willing, and able to fight for the U.K., but they have to remain strong in the face of Wokeism, and other problems put before them. \"DO NOT GIVE AWAY DIEGO GARCIA!\" Read more:What is in the Chagos Islands deal? The UK government has defended the deal following Mr Trump's post. A Foreign Office spokesperson said: \"The deal to secure the joint UK-US military base on Diego Garcia military is crucial to the security of the UK and our key allies, and to keeping the British people safe. \"The agreement we have reached is the only way to guarantee the long-term future of this vital military base.\" 'A difficult read' Sky's US correspondent Mark Stone said the post will be a \"difficult read\" for the UK government, who are \"exasperated by the flip-flopping that has gone on\". The Chagos Islands are an archipelago in the Indian Ocean, with the island of Diego Garcia home to a joint UK-US military base. The islands are an overseas territory of the UK, but after the UK lost a court case over the sovereignty of the islands, the government agreed to cede the islands to Mauritius. Charting Trump's flip-flopping position The US backed the deal to give sovereignty of the islands to Mauritius as recently as Tuesday. A spokesperson for the US State Department said then: \"The United States supports the decision of the United Kingdom to proceed with its agreement with Mauritius concerning the Chagos archipelago.\" Mr Trump previously criticised the deal in January, calling it an \"act of total weakness\" and \"great stupidity\". Then, following a phone call with Sir Keir on 5 February, he signalled his support for the deal, calling it \"the best [Sir Keir] could make\". Before all that, he had given the deal his backing last year. What's changed now? Asked by reporters whether Mr Trump's latest post meant the US position on the Chagos Islands deal had changed, White House press secretary Karoline Leavitt said: \"The post should be taken as the policy of the Trump administration, it's coming straight from the horse's mouth.\" Sky News understands Conservative MP Sir Iain Duncan Smith, a strong opponent of the deal, has just returned from Washington where he lobbied the White House, National Security Council, and State Department on the issue. 'Kill this terrible deal,' says Badenoch The law to give away the islands is still before parliament, and the issue has become a significant political row. The Conservatives and Reform UK both oppose the deal, while the Liberal Democrats have demanded MPs are given a fresh vote on the issue. Responding to Mr Trump's latest comments, Tory leader Kemi Badenoch said the US president was \"right\". \"Chagos is a strategic asset. If our closest ally is saying this, the PM should listen. It's time to kill this terrible deal,\" she added. But Liberal Democrat leader Sir Ed Davey criticised Mr Trump's changing position: \"Trump's endless flip-flopping on the Chagos Islands shows why Starmer's approach is doomed to fail. Britain can't rely on the US while Trump is in the White House.\" Reform UK leader Nigel Farage said: \"Keir Starmer risks alienating our most important ally by giving away the Chagos Islands, the worst deal in British history… Starmer must cancel this deal.\" The House of Lords inflicted four defeats on the government last month on the details of the leasing of Diego Garcia - and the publication of any detailed payments made to Mauritius. The government pulled the bill from the Lords, and has yet to reschedule it."
    },
    {
        "title": "Nancy Guthrie: No match found for DNA on glove recovered near home",
        "description": "DNA recovered from a glove found near the home of Nancy Guthrie does not match anything in a national database, authorities have said.",
        "url": "https://news.sky.com/story/nancy-guthrie-no-match-found-for-dna-on-glove-recovered-near-home-13508873",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-nancy-guthrie-savannah-guthrie_7166789.jpg?20260216193605",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-18 03:58:00",
        "Headline": "The Guthrie family, who have released several public appeals for help, have been ruled out as suspects and are holding out hope that Nancy is still alive.",
        "Content": "DNA recovered from a glove found near the home of Nancy Guthrie does not match anything in a national database, authorities have said. It marks a significant setback for detectives investigating the case of the missing 84-year-old, who is the mother of NBC's Today show presenter Savannah Guthrie. She was last seen on 31 January when her family dropped her off at her home near Tucson, Arizona, following dinner with them. The case has since gripped America and beyond. Authorities announced they had obtained a DNA sample from a glove found near the property on Sunday. The glove appeared to match the pair worn by a masked prowler seen in doorbell camera footage before Nancy was abducted, and forensic experts hoped to find a match on a national DNA database. It was announced on Tuesday that no match had been found. Pima County Sheriff Chris Nanos has said he believes the man in the doorbell video is the likely perpetrator of the abduction and the primary person authorities are looking for. The Guthrie family, who have released several public appeals for help, have been ruled out as suspects and are holding out hope that Nancy is still alive. More from Sky News:Obama leads Jesse Jackson tributes1,000 suspected paedophiles arrested a month The disappearance is still being treated by police and the FBI as an apparent kidnapping for ransom. Mr Nanos has said Nancy, who has a pacemaker, was extremely limited in her physical mobility and could not have left her home unassisted, leading investigators to believe she had been taken against her will early on."
    },
    {
        "title": "Retail warns of high price for workers from government costs ahead",
        "description": "Retail staff face reduced hours or even losing their job as bosses continue to face up to rising government-imposed costs, according to an industry lobby group.",
        "url": "https://news.sky.com/story/retail-warns-of-high-price-for-workers-from-government-costs-ahead-13509197",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-highstreet-communities_7030789.jpg?20250924205743",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2026-02-18 16:19:00",
        "Headline": "An industry body reports growing pessimism among those holding the purse strings following a year of job losses across the sector, cuts widely blamed on policy decisions.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Retail staff face reduced hours or even losing their job as bosses continue to face up to rising government-imposed costs, according to an industry lobby group. The British Retail Consortium (BRC) said its survey of finance chiefs in the sector found 61% were planning to reduce the number of hours and overtime for staff. The body reported that 55% saw head office workers at risk while 42% were to target in-store roles amid a surge in pessimism on the outlook, despite 74,000 jobs already being cut over the past 12 months. Mark Kleinman blog: See latest stories from Sky's City editor For more information about how we use your data and your rights, you can visit our Privacy Centre. The BRC said its study revealed a sharp rise in anxiety about labour-related costs, concerns that it said had \"shot up the agenda\" since the phased implementation of new employment laws got under way. The survey's findings risk exacerbating the growing sense of crisis over unemployment, with the UK's jobless rate surging by more than a percentage point to 5.2% since Labour came to power. It's currently at a level not seen for almost five years. The official figures have also shown youth unemployment at 16.1% - its highest figure since 2014 - and weaker pay awards across the private sector. Businesses, especially in big employment sectors such as retail, have complained of higher costs since the pandemic, but their concerns have intensified since the 2024 budget. The BRC said raised employer national insurance contributions, coupled with minimum wage hikes, imposed since last April, had added £5bn annually to the sector's costs, harmed investment, pay awards and employment. It calculated that the cost of employing a full-time entry-level worker rose by 10%, while that number rose to 13% for someone part-time. At the same time, continuing cost of living pressures have harmed both essential and discretionary spending among consumers, exacerbating fears over the future of UK high streets. PM rules out minimum wage U-turn The BRC said its members faced another increase in labour costs this April due to further minimum pay rises above the rate of inflation. The Times reported this week that the government was reviewing its pledge to equalise, over time, the minimum wage between younger and older workers, to avoid placing further pressure on youth unemployment. But Sir Keir Starmer later ruled out a U-turn, arguing: \"We've made commitments to young people in our manifesto, and we will keep to those commitments, including the commitment that we would make sure that the living wage would go up this April, which I can absolutely confirm to you will happen.\" Read more from Sky News:Man dead after double stabbingTrump warns Starmer of 'big mistake' BRC chief executive Helen Dickinson said of its report: \"We all want more high-quality, well-paid jobs. \"But retail has already lost 250,000 roles in the past five years, and youth unemployment is climbing fast.\" If the government's flagship Employment Rights Act fails to consider business needs on policies like guaranteed hours and union rights, she warned, it will \"add complexity and reduce flexibility, ultimately stripping away entry-level and part-time opportunities at precisely the moment the country needs them most\". A government spokesperson acknowledged retailers \"are facing a difficult time\", but said the reforms \"will boost productivity and retention in workplaces across the UK and give job security to over 18 million workers\". \"We are also supporting retailers through our small business plan, and we will work with business including the BRC to see what further support we can provide ahead of publishing our High Streets Strategy later this year,\" they said."
    },
    {
        "title": "Big fall in household energy bills predicted from April",
        "description": "Annual energy bills will fall by &#163;117 from April due to government changes, forecasters have predicted.",
        "url": "https://news.sky.com/story/big-fall-in-household-energy-bills-predicted-from-april-13508979",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-pylon-scotland-uk-energy_6683164.jpg?20240912143105",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2026-02-18 09:51:00",
        "Headline": "The three figure drop is forecast due to government cuts in green levies. The energy price cap is then expected to remain \"relatively steady\" for 2026.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Annual energy bills will fall by £117 from April due to government changes, forecasters have predicted. Measures announced in the budget will mean a drop to £1,641 a year for a typical dual‑fuel household, according to research firm Cornwall Insight. That would represent a 7% fall from the £1,758 being paid until the end of the financial year in March, under the energy price cap. If the forecast proves correct, annual bills will be at their lowest since July 2024. The expected fall is down to government interventions, which are doing \"most of the heavy lifting\" to reduce costs, Cornwall Insight's principal consultant Dr Craig Lowrey said. Why? As announced in the budget, some charges that had been part of bills are being removed and instead funded through general taxation. \n                  Ovo to compensate vulnerable customers 'left without support'\n                 \n                  Britons are less well off than they were in 2019 - and these figures show it\n                 \n                  Whitakers' real-life Willy Wonka on shrinkflation and the rise of chocolate-flavour bars\n                 Chancellor Rachel Reeves had said the government would reduce bills by £150 by cutting levies. Money blog: Big drop in inflation announced - follow live The Energy Company Obligation (ECO) scheme, designed to tackle fuel poverty and help reduce carbon emissions, has been scrapped, while the vast majority (75%) of renewables obligation costs are being removed from consumer energy bills, the research firm said. But bills will not fall by the full amount that making those changes saves, as other charges associated with operating and maintaining energy networks have risen. Not as steep a drop as first thought The fall is also less steep than was first expected in December. Households were then forecast to experience the biggest price fall in two years, a £138 drop. Volatility in wholesale gas markets amid geopolitical tension has changed this. What is the energy price cap? The energy price cap is a limit on the amount energy providers can charge per unit of power. It's set by the regulator Ofgem every three months and is based on wholesale energy prices and policy measures. For more information about how we use your data and your rights, you can visit our Privacy Centre. The official energy price cap announcement for April will be made next Wednesday. Lower bills are anticipated to stay as the energy price cap is forecast to \"remain relatively steady\" for 2026, Cornwall Insights said. Only a small rise in July is foreseen, though fossil fuel market moves and policy announcements could change this."
    },
    {
        "title": "Plans to raise minimum wage for young people could be delayed, Sky News understands",
        "description": "Plans to increase the minimum wage for 18 to 20-year-olds to the same level as for other adults could be delayed, Sky News understands.",
        "url": "https://news.sky.com/story/plans-to-raise-minimum-wage-for-young-people-could-be-delayed-sky-news-understands-13509160",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-waitress-minimum-wage_7168454.jpg?20260218172125",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-02-18 14:56:00",
        "Headline": "Reports suggest the potential delay is over fears the higher cost of employing young people could put off firms from hiring them and worsen youth unemployment.",
        "Content": "Plans to increase the minimum wage for 18 to 20-year-olds to the same level as for other adults could be delayed, Sky News understands. In its 2024 election manifesto, Labour committed to \"remove the discriminatory age bands, so all adults are entitled to the same minimum wage, delivering a pay rise to hundreds of thousands of workers across the UK\". Politics latest: Reform would bring back two-child benefit cap, says Jenrick But Sky News understands the government is considering delaying the pledge - although it is committed to doing it eventually. Reports suggest the potential delay is over fears the higher cost of employing young people could put off firms from hiring them and worsen youth unemployment. New figures released on Tuesday showed the UK's unemployment rate rose to 5.2% in October to December last year, the highest it has been in almost five years - while the rate for 16 to 24-year-olds was 16.1%, the highest level since early 2015. Almost 950,000 people of that age were not in employment, education, or training in July to September last year. \n                  MPs raise alarm over future of pubs - with more than 500 tipped to close this year\n                 \n                  Cabinet revolt brewing over business rates hike - as hospitality warned not to protest\n                 \n                  Hundreds of jobs to be lost in TGI Fridays insolvency plan\n                 Speaking in Cardiff, Prime Minister Sir Keir Starmer confirmed the government's commitment to equalising the youth minimum wage. But companies say measures taken by the government, such as increasing employer National Insurance contributions, have made it more expensive and riskier to hire new staff in industries which would typically hire young people, such as hospitality. Chair of the Federation of Small Businesses, Tina McKenzie, told Sky News: \"If [the government] think that small employers can handle [increased costs], as well as the increase in the minimum wage, then good luck. \"Take your head out of the sand and realise if you continue to increase costs of employment and you make hiring young people more difficult for small employers, then all that's going to happen is that they will hire less young people.\" Unions have warned the government against \"scaremongering\" on a delay in implementing the rise. Read more from Sky News:Brazilian butt lifts 'should be banned immediately', MPs saySix taken to hospital after double-decker buses crash General secretary of the TUC, Paul Nowak, said that youth unemployment \"is an urgent issue and one which deserves real solutions like an ambitious jobs guarantee, ending insecure employment and driving up the number of quality apprenticeships - not more scaremongering about the minimum wage\". \"Young workers have bills to pay too - and it's only right that they get a fair rate for the job. That's why the government must stick to its target on scrapping pay rates based on age, rather than based on the work people do,\" he said. Chancellor Rachel Reeves dodged questions from reporters in south London earlier on whether she was sticking to the commitment, saying: \"We already have incentives to hire young people with the apprenticeship rate of the minimum wage, but also for no National Insurance contributions for the youngest of workers.\" Recognising challenges that young people face, she added: \"As a government, we have determined to do everything we can to support them,\" naming policies such as increased apprenticeship places.\" The minimum wage for workers aged between 18 and 20 is £10 an hour, rising to £10.85 in April. In comparison, the minimum wage for workers aged 21 and over - known as the national living wage - is £12.21 an hour, rising to £12.71."
    },
    {
        "title": "Donald Trump tells Keir Starmer 'do not give away Diego Garcia' in fresh attack on Chagos Islands deal",
        "description": "Donald Trump has launched a fresh broadside on the UK's Chagos Islands deal with Mauritius, saying Sir Keir Starmer is \"making a big mistake\".",
        "url": "https://news.sky.com/story/donald-trump-tells-keir-starmer-do-not-give-away-diego-garcia-in-fresh-attack-on-chagos-islands-deal-13509245",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-diego-garcia-chagos_7140219.jpg?20260123212238",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-18 18:56:00",
        "Headline": "The US president has changed his tune multiple times about the UK's deal to hand over the Chagos Islands. His latest commentary comes just a day after his administration expressed support for the arrangement.",
        "Content": "Donald Trump has launched a fresh broadside on the UK's Chagos Islands deal with Mauritius, saying Sir Keir Starmer is \"making a big mistake\". In a post on his Truth Social platform, the US president warned against the potential loss of a US-UK military base on Diego Garcia, which the UK is retaining through a 99-year lease of the island. \"Our relationship with the United Kingdom is a strong and powerful one, and it has been for many years, but prime minister Starmer is losing control of this important Island by claims of entities never known of before,\" said Mr Trump. Mr Trump said Sir Keir \"should not lose control, for any reason, of Diego Garcia, by entering a tenuous, at best, 100 Year Lease\". He added: \"This land should not be taken away from the U.K. and, if it is allowed to be, it will be a blight on our Great Ally. We will always be ready, willing, and able to fight for the U.K., but they have to remain strong in the face of Wokeism, and other problems put before them. \"DO NOT GIVE AWAY DIEGO GARCIA!\" Read more:What is in the Chagos Islands deal? The UK government has defended the deal following Mr Trump's post. A Foreign Office spokesperson said: \"The deal to secure the joint UK-US military base on Diego Garcia military is crucial to the security of the UK and our key allies, and to keeping the British people safe. \"The agreement we have reached is the only way to guarantee the long-term future of this vital military base.\" 'A difficult read' Sky's US correspondent Mark Stone said the post will be a \"difficult read\" for the UK government, who are \"exasperated by the flip-flopping that has gone on\". The Chagos Islands are an archipelago in the Indian Ocean, with the island of Diego Garcia home to a joint UK-US military base. The islands are an overseas territory of the UK, but after the UK lost a court case over the sovereignty of the islands, the government agreed to cede the islands to Mauritius. Charting Trump's flip-flopping position The US backed the deal to give sovereignty of the islands to Mauritius as recently as Tuesday. A spokesperson for the US State Department said then: \"The United States supports the decision of the United Kingdom to proceed with its agreement with Mauritius concerning the Chagos archipelago.\" Mr Trump previously criticised the deal in January, calling it an \"act of total weakness\" and \"great stupidity\". Then, following a phone call with Sir Keir on 5 February, he signalled his support for the deal, calling it \"the best [Sir Keir] could make\". Before all that, he had given the deal his backing last year. What's changed now? Asked by reporters whether Mr Trump's latest post meant the US position on the Chagos Islands deal had changed, White House press secretary Karoline Leavitt said: \"The post should be taken as the policy of the Trump administration, it's coming straight from the horse's mouth.\" Sky News understands Conservative MP Sir Iain Duncan Smith, a strong opponent of the deal, has just returned from Washington where he lobbied the White House, National Security Council, and State Department on the issue. 'Kill this terrible deal,' says Badenoch The law to give away the islands is still before parliament, and the issue has become a significant political row. The Conservatives and Reform UK both oppose the deal, while the Liberal Democrats have demanded MPs are given a fresh vote on the issue. Responding to Mr Trump's latest comments, Tory leader Kemi Badenoch said the US president was \"right\". \"Chagos is a strategic asset. If our closest ally is saying this, the PM should listen. It's time to kill this terrible deal,\" she added. But Liberal Democrat leader Sir Ed Davey criticised Mr Trump's changing position: \"Trump's endless flip-flopping on the Chagos Islands shows why Starmer's approach is doomed to fail. Britain can't rely on the US while Trump is in the White House.\" Reform UK leader Nigel Farage said: \"Keir Starmer risks alienating our most important ally by giving away the Chagos Islands, the worst deal in British history… Starmer must cancel this deal.\" The House of Lords inflicted four defeats on the government last month on the details of the leasing of Diego Garcia - and the publication of any detailed payments made to Mauritius. The government pulled the bill from the Lords, and has yet to reschedule it."
    },
    {
        "title": "Trump could be about to force yet another Labour U-turn",
        "description": "Number 10 will be nursing its whiplash this evening as Donald Trump once again throws a diplomatic hand grenade into the UK's Chagos deal with Mauritius.",
        "url": "https://news.sky.com/story/starmer-must-bring-trump-back-from-the-brink-or-chagos-deal-is-dead-13509338",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-keir-starmer-donald-trump_7139750.jpg?20260119144840",
        "type": "Politics",
        "Author": "Mhari Aurora",
        "Date Published": "2026-02-18 22:44:00",
        "Headline": "In a fresh attack online, the US president said the deal would be \"a blight\" on the UK and claimed the prime minister is \"losing control\" of the military base. ",
        "Content": "\n          Political correspondent\n              @MhariAurora\n Number 10 will be nursing its whiplash this evening as Donald Trump once again throws a diplomatic hand grenade into the UK's Chagos deal with Mauritius. Posting on Truth Social, Donald Trump implored Sir Keir Starmer to scrap the deal, saying: \"DO NOT GIVE AWAY DIEGO GARCIA!\" In his long post online, the US president claimed the prime minister is \"losing control\" of the military base in the Indian Ocean, and that the deal would be \"a blight\" on the UK. It came just a day after the US government released a statement in which it said it \"supports the decision of the United Kingdom to proceed with its agreement with Mauritius concerning the Chagos archipelago\". Number 10 and the Foreign Office will be asking itself what has changed in the space of 24 hours. UK government backs 'crucial' deal Pushing back on Trump's latest change of heart, a Foreign Office spokesperson said: \"The deal to secure the joint UK-US military base on Diego Garcia military is crucial to the security of the UK and our key allies, and to keeping the British people safe. \"The agreement we have reached is the only way to guarantee the long-term future of this vital military base.\" So what now? The government clearly did not see this latest Trump intervention coming, but leaders are often judged not by the events that happen on their watch but how they deal with such events. Interestingly, only last night Starmer and Trump held a bilateral phone call - but when Number 10 released a readout of that meeting, there was no mention of the Chagos deal. 'Utter humiliation' Opposition parties on the right are celebrating Trump's comments as a win for their campaigning. Shadow foreign secretary Priti Patel called this \"an utter humiliation\" for the prime minister, arguing the deal is undermining the UK's relationship with the US and must be junked. And the Tory leader Kemi Badenoch mirrored previous comments made last month by the US president, calling the deal an \"act of stupidity\" and self-sabotage. Reform UK's leader Nigel Farage claims the deal negotiated by the government risks alienating the US and has also called for the deal to be scrapped. Read more from Sky News:Tech firms could be blocked from UKPlans to raise minimum wage could be delayed Meanwhile, the Liberal Democrat leader Sir Ed Davey used the fallout as an opportunity to continue his attacks on Trump, insisting the US is no longer an ally the UK can rely on, and we must cosy up to our neighbours in Europe. Rather awkwardly the foreign secretary, Yvette Cooper, is in the US this week and will be having meetings with Trump's top team in Washington DC. Despite being blindsided by the persistent flip-flopping of the US administration's position on the Chagos deal, it could be a fortuitous opportunity to plead the UK government's case directly to her counterpart Marco Rubio. The Conservatives and Reform will be hoping Trump's latest intervention may be able to push the prime minister into rethinking this deal, or at least cause him enough political difficulty that the deal is ratified under a dark cloud. Starmer will need to bring the US president back from the brink, or we could be seeing U-turn number 16 from Labour."
    },
    {
        "title": "Retail warns of high price for workers from government costs ahead",
        "description": "Retail staff face reduced hours or even losing their job as bosses continue to face up to rising government-imposed costs, according to an industry lobby group.",
        "url": "https://news.sky.com/story/retail-warns-of-high-price-for-workers-from-government-costs-ahead-13509197",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-highstreet-communities_7030789.jpg?20250924205743",
        "type": "Politics",
        "Author": "James Sillars",
        "Date Published": "2026-02-18 16:19:00",
        "Headline": "An industry body reports growing pessimism among those holding the purse strings following a year of job losses across the sector, cuts widely blamed on policy decisions.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Retail staff face reduced hours or even losing their job as bosses continue to face up to rising government-imposed costs, according to an industry lobby group. The British Retail Consortium (BRC) said its survey of finance chiefs in the sector found 61% were planning to reduce the number of hours and overtime for staff. The body reported that 55% saw head office workers at risk while 42% were to target in-store roles amid a surge in pessimism on the outlook, despite 74,000 jobs already being cut over the past 12 months. Mark Kleinman blog: See latest stories from Sky's City editor For more information about how we use your data and your rights, you can visit our Privacy Centre. The BRC said its study revealed a sharp rise in anxiety about labour-related costs, concerns that it said had \"shot up the agenda\" since the phased implementation of new employment laws got under way. The survey's findings risk exacerbating the growing sense of crisis over unemployment, with the UK's jobless rate surging by more than a percentage point to 5.2% since Labour came to power. It's currently at a level not seen for almost five years. The official figures have also shown youth unemployment at 16.1% - its highest figure since 2014 - and weaker pay awards across the private sector. Businesses, especially in big employment sectors such as retail, have complained of higher costs since the pandemic, but their concerns have intensified since the 2024 budget. The BRC said raised employer national insurance contributions, coupled with minimum wage hikes, imposed since last April, had added £5bn annually to the sector's costs, harmed investment, pay awards and employment. It calculated that the cost of employing a full-time entry-level worker rose by 10%, while that number rose to 13% for someone part-time. At the same time, continuing cost of living pressures have harmed both essential and discretionary spending among consumers, exacerbating fears over the future of UK high streets. PM rules out minimum wage U-turn The BRC said its members faced another increase in labour costs this April due to further minimum pay rises above the rate of inflation. The Times reported this week that the government was reviewing its pledge to equalise, over time, the minimum wage between younger and older workers, to avoid placing further pressure on youth unemployment. But Sir Keir Starmer later ruled out a U-turn, arguing: \"We've made commitments to young people in our manifesto, and we will keep to those commitments, including the commitment that we would make sure that the living wage would go up this April, which I can absolutely confirm to you will happen.\" Read more from Sky News:Man dead after double stabbingTrump warns Starmer of 'big mistake' BRC chief executive Helen Dickinson said of its report: \"We all want more high-quality, well-paid jobs. \"But retail has already lost 250,000 roles in the past five years, and youth unemployment is climbing fast.\" If the government's flagship Employment Rights Act fails to consider business needs on policies like guaranteed hours and union rights, she warned, it will \"add complexity and reduce flexibility, ultimately stripping away entry-level and part-time opportunities at precisely the moment the country needs them most\". A government spokesperson acknowledged retailers \"are facing a difficult time\", but said the reforms \"will boost productivity and retention in workplaces across the UK and give job security to over 18 million workers\". \"We are also supporting retailers through our small business plan, and we will work with business including the BRC to see what further support we can provide ahead of publishing our High Streets Strategy later this year,\" they said."
    },
    {
        "title": "Tech firms must take down abusive images in 48 hours - or face being blocked from UK",
        "description": "Technology firms that do not take down abusive images from their platforms within 48 hours face being blocked from the UK under new rules proposed by the government.",
        "url": "https://news.sky.com/story/tech-firms-must-take-down-abusive-images-in-48-hours-or-face-being-blocked-from-uk-13509229",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-sir-keir-starmer-grok_7130381.png?20260108174350",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-18 22:29:00",
        "Headline": "Tech companies that don't take down abusive images reported to them could be blocked from operating in the UK or fined 10% of worldwide revenue.",
        "Content": "Technology firms that do not take down abusive images from their platforms within 48 hours face being blocked from the UK under new rules proposed by the government. Prime Minister Sir Keir Starmer said he was putting tech companies \"on notice\" to take down non-consensual intimate images, and will leave \"no stone unturned\" to protect women and girls. Companies will be legally required by law to remove the images within 48 hours of them being reported to them. If they do not, firms could be fined 10% of qualifying worldwide revenue - which could amount to billions of pounds for some major platforms - or have their services banned from the UK. Ministers say tech firms should take tackling intimate image abuse as seriously as they take tackling terrorist or child sexual abuse material. The government is making the change through an amendment to the Crime and Policing Bill, which is currently going through parliament. Media regulator Ofcom is also considering plans to treat non-consensual intimate images as the same as child sexual abuse material, which is digitally marked when found, so that any time they are re-shared, they are automatically taken down. \n                  Are you using an AI-generated password? It might be time to change it\n                 \n                  Priced-out Britons are using AI for financial advice. Critics call it a 'dangerous' - we put the chatbots to the test\n                 \n                  Beth Rigby: The constant challenges I face keeping my kids safe in the new Wild West\n                 Additionally, the government says it will publish guidance for internet companies on how to block \"rogue websites\" that host this content and fall out of reach of the Online Safety Act. Sir Keir said he would \"leave no stone unturned in the fight to protect women from violence and abuse\". He said the government had already taken \"urgent action against chatbots and 'nudification' tools\", and that they were \"going further, putting companies on notice so that any non-consensual image is taken down in under 48 hours\". Technology Secretary Liz Kendall said: \"The days of tech firms having a free pass are over... No woman should have to chase platform after platform, waiting days for an image to come down.\" Shadow technology secretary Julia Lopez said when a similar proposal was put forward by Conservative peer, Baroness Charlotte Owen, Labour had failed to take action. \"Once again, the government is playing catch-up to duck a major backbench rebellion. \"The reality is that, for all the prime minister's tough rhetoric, he has arrived late to this issue. He does not know what to believe - he only knows what to do to try and survive another week.\" The move follows controversy in January over X's AI tool, Grok, creating AI images undressing people without their consent. Creating non-consensual intimate images, including sexually explicit deepfakes, was criminalised earlier this month, and X stopped Grok from creating the images following the outrage. Other countries are also taking action against X, with Ireland's data privacy regulator saying on Tuesday that X faces an EU privacy investigation over the non-consensual deepfakes created by Grok. Earlier this week, Sir Keir announced a crackdown on social media platforms, such as closing a legal loophole to eliminate \"vile illegal content created by AI\". Downing Street has also launched a consultation on measures like an Australian-style ban on under-16s using social media, and is ensuring it is able to implement one quickly if it is recommended."
    },
    {
        "title": "Robert Jenrick tries to blend old with new - but can ex-Tory really be Reform's 'reassuring revolutionary'?",
        "description": "Robert Jenrick, in his first major speech as Reform's Treasury spokesperson, said he wanted to approach his brief as a \"reassuring revolutionary\".",
        "url": "https://news.sky.com/story/robert-jenrick-tries-to-blend-old-with-new-but-can-ex-tory-really-be-reforms-reassuring-revolutionary-13509146",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-robert-jenrick-reform_7167186.jpg?20260217131100",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2026-02-18 14:36:00",
        "Headline": "In his first speech as Reform's Treasury spokesperson, Jenrick promised to be a \"reassuring revolutionary\" in a party that wants to project credibility to the electorate.",
        "Content": "\n          Political correspondent\n              @alexrogerssky\n Robert Jenrick, in his first major speech as Reform's Treasury spokesperson, said he wanted to approach his brief as a \"reassuring revolutionary\". It might seem contradictory, but to the former senior Tory, it is complementary. Politics latest: Reform would bring back two-child benefit cap Giving his speech in the City of London, Mr Jenrick did his utmost to take the best of the old - the reverence for fiscal prudence represented by his past as a Tory minister - and merge it with the new. The old looks like maintaining the Office for Budget Responsibility, which sets economic forecasts, and the independence of the Bank of England, thereby soothing the markets which went into meltdown following the Liz Truss mini budget. The new, represented by Reform UK, is characterised by the desire to shake things up: whether that be by ripping up the Equality Act, passing emergency legislation for Heathrow's third runway and other major transport projects, and slashing the benefits bill in a way no other party has achieved. Critics will question whether achieving both is possible. \n                  Farage wants Reform to be party of future - but can its new top team distance itself from a Tory past?\n                 \n                  Who is in Nigel Farage's new Reform top team?\n                 \n                  Greens and Reform hit back at Sir Keir Starmer after attacks in Munich speech\n                 Ms Truss - the former Tory prime minister who Mr Jenrick has done much to try to distance himself from despite serving in her government - wanted to achieve a radical economic agenda of tax cuts and spending pledges, and the markets punished her for it. Mr Jenrick seems to think he can avoid that fate, by issuing warm words about never playing \"fast and loose\" with the public finances and promising a crackdown on welfare. But already Reform is slipping into the trap that is bedevilling his rival parties: disagreements and U-turns. How can Reform claim to be fiscally responsible when on the first day with his new title, Mr Jenrick announces a U-turn, and quietly admits that Nigel Farage \"drew a line\" under his promised tax cuts - all £90bn of them? First the party wanted to scrap the two-child cap to encourage people to have more children, then the stance was to abolish the cap for British people in work only, and now the cap is reinstated for everyone. There were also signs of possible disagreement on the pensions triple lock, with Mr Jenrick saying there would be an announcement coming but he had always supported it and \"we're always going to protect pensioners\". Moments later, Reform leader Mr Farage spoke to the press when the lights went down, reportedly telling journalists that the party was not committed to the triple lock at this stage. \"It's open for debate,\" he said. \"Everything is open for debate.\" At the moment, Reform is still deciding its precise stance on a whole host of policy issues - which, as a party of opposition, it can just about get away with. But if Reform is serious about projecting credibility, it needs to be more consistent and ensure everyone is singing from the same hymn sheet."
    },
    {
        "title": "Plans to raise minimum wage for young people could be delayed, Sky News understands",
        "description": "Plans to increase the minimum wage for 18 to 20-year-olds to the same level as for other adults could be delayed, Sky News understands.",
        "url": "https://news.sky.com/story/plans-to-raise-minimum-wage-for-young-people-could-be-delayed-sky-news-understands-13509160",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-waitress-minimum-wage_7168454.jpg?20260218172125",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-18 14:56:00",
        "Headline": "Reports suggest the potential delay is over fears the higher cost of employing young people could put off firms from hiring them and worsen youth unemployment.",
        "Content": "Plans to increase the minimum wage for 18 to 20-year-olds to the same level as for other adults could be delayed, Sky News understands. In its 2024 election manifesto, Labour committed to \"remove the discriminatory age bands, so all adults are entitled to the same minimum wage, delivering a pay rise to hundreds of thousands of workers across the UK\". Politics latest: Reform would bring back two-child benefit cap, says Jenrick But Sky News understands the government is considering delaying the pledge - although it is committed to doing it eventually. Reports suggest the potential delay is over fears the higher cost of employing young people could put off firms from hiring them and worsen youth unemployment. New figures released on Tuesday showed the UK's unemployment rate rose to 5.2% in October to December last year, the highest it has been in almost five years - while the rate for 16 to 24-year-olds was 16.1%, the highest level since early 2015. Almost 950,000 people of that age were not in employment, education, or training in July to September last year. \n                  MPs raise alarm over future of pubs - with more than 500 tipped to close this year\n                 \n                  Cabinet revolt brewing over business rates hike - as hospitality warned not to protest\n                 \n                  Hundreds of jobs to be lost in TGI Fridays insolvency plan\n                 Speaking in Cardiff, Prime Minister Sir Keir Starmer confirmed the government's commitment to equalising the youth minimum wage. But companies say measures taken by the government, such as increasing employer National Insurance contributions, have made it more expensive and riskier to hire new staff in industries which would typically hire young people, such as hospitality. Chair of the Federation of Small Businesses, Tina McKenzie, told Sky News: \"If [the government] think that small employers can handle [increased costs], as well as the increase in the minimum wage, then good luck. \"Take your head out of the sand and realise if you continue to increase costs of employment and you make hiring young people more difficult for small employers, then all that's going to happen is that they will hire less young people.\" Unions have warned the government against \"scaremongering\" on a delay in implementing the rise. Read more from Sky News:Brazilian butt lifts 'should be banned immediately', MPs saySix taken to hospital after double-decker buses crash General secretary of the TUC, Paul Nowak, said that youth unemployment \"is an urgent issue and one which deserves real solutions like an ambitious jobs guarantee, ending insecure employment and driving up the number of quality apprenticeships - not more scaremongering about the minimum wage\". \"Young workers have bills to pay too - and it's only right that they get a fair rate for the job. That's why the government must stick to its target on scrapping pay rates based on age, rather than based on the work people do,\" he said. Chancellor Rachel Reeves dodged questions from reporters in south London earlier on whether she was sticking to the commitment, saying: \"We already have incentives to hire young people with the apprenticeship rate of the minimum wage, but also for no National Insurance contributions for the youngest of workers.\" Recognising challenges that young people face, she added: \"As a government, we have determined to do everything we can to support them,\" naming policies such as increased apprenticeship places.\" The minimum wage for workers aged between 18 and 20 is £10 an hour, rising to £10.85 in April. In comparison, the minimum wage for workers aged 21 and over - known as the national living wage - is £12.21 an hour, rising to £12.71."
    },
    {
        "title": "Brazilian butt lifts 'should be banned immediately' by government, MPs say",
        "description": "MPs have called on the government to immediately ban Brazilian butt lifts (BBLs).",
        "url": "https://news.sky.com/story/brazilian-butt-lifts-should-be-banned-immediately-by-government-mps-say-13508910",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-cosmetic-surgery-butt-lift_6749254.jpg?20241115183133",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-18 08:03:00",
        "Headline": "Ministers have been accused of \"not moving fast enough\" in introducing a licensing system for non-surgical cosmetic procedures.",
        "Content": "MPs have called on the government to immediately ban Brazilian butt lifts (BBLs). The Women and Equalities Committee (WEC) of MPs accused ministers of \"not moving fast enough\" in introducing a licensing system for non-surgical cosmetic procedures. They warned that a lack of regulation in the cosmetics industry had led to a \"wild west\" where patients are having procedures in garden sheds, hotel rooms and public toilets. The committee welcomed government proposals to make sure BBLs and other high-risk procedures are only performed by specified health workers. It said this would act as a \"de facto ban\" on these procedures, which \"pose a serious threat to patient safety\". But in a report the WEC called on the government to go further, saying: \"High-harm procedures such as the liquid Brazilian butt lift (BBL), which has resulted in fatalities, should be banned immediately without further consultation. \"A licensing system for lower-risk procedures, in which only those suitably qualified can perform them, should be introduced within this Parliament.\" The MPs added: \"The government is not moving quickly enough in introducing such a system. \"At present, individuals without any formal training can carry out potentially harmful interventions, placing the public at risk.\" There is currently no regulation on who can perform non-surgical cosmetic procedures such as injectables, including fillers or botulinum toxin injections, often referred to as Botox, laser therapy or chemical peels. A BBL is a non-surgical augmentation which sees dermal fillers injected into the buttocks to increase volume and alter their shape. Read more from Sky News:The Catch-22 facing Britain's most notorious prisonerPolice look at private Stansted flights after Epstein files Impact of social media and face-editing tech The committee also suggested more people are turning to cosmetic procedures because of body image issues due to social media and face-editing technologies. MPs raised concerns about the impact of influencers \"normalising\" high-risk procedures. They also suggested the NHS should record data on cosmetic procedures performed abroad. Government 'taking action to crack down on cosmetic cowboys' Health Secretary Wes Streeting said in 2024 he would work to improve safety for Britons travelling abroad for cosmetic procedures in the wake of several deaths. A Department of Health and Social Care spokesperson said: \"This government is taking action to crack down on cosmetic cowboys and root out dangerous treatments. \"Our tough new measures will ensure only qualified healthcare professionals will be able to perform the highest-risk procedures. \"For anyone considering a cosmetic procedure, please check the provider's qualifications and insurance - and avoid treatments that appear suspiciously cheap. \"We will consider the Women and Equalities Committee's report and respond fully in due course.\""
    },
    {
        "title": "Is this social media's 'tobacco' moment?",
        "description": "Why could what happened to tobacco companies in the 1990s come back to haunt social media companies?",
        "url": "https://news.sky.com/story/is-this-social-medias-tobacco-moment-13509062",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-social-media-trial_7168264.jpg?20260218132832",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2026-02-18 12:16:00",
        "Headline": "There are more than 2,000 cases going through the US courts, accusing social media companies of harm. These three trials are ones to watch.",
        "Content": "\n          Science and technology reporter\n       Why could what happened to tobacco companies in the 1990s come back to haunt social media companies? In the 1990s, tobacco companies faced a series of trials that ultimately held them accountable for selling a product they knew was harmful - they became known as the 'tobacco trials'. Could social media companies be about to face the same fate? There's a series of landmark trials taking place in the US, where lawyers representing people allegedly harmed by social media are trying a new line of attack against tech giants. These trials focus on how platforms are designed - not on what is posted on them. That means the tech companies can't rely on Section 230 of the Communications Act, a piece of law that protects them from liability over user content. That defence has seen a lot of cases fail in the past. There are currently more than 2,000 active cases looking at social media harm in the US. Here are three of those cases that are particularly significant. LA social media trial - featuring Mark Zuckerberg Thousands of people have filed lawsuits accusing TikTok, Meta, Snapchat, and YouTube of designing addictive, harmful platforms. Now, lawyers have bundled those cases together and picked what they believe are the strongest to take to court. The first one, happening at the moment, focuses on a 20-year-old Californian known as KGM. She says addictive features on social media like infinite scrolling and photo filters gave her anxiety, depression, and body image issues. Snapchat and TikTok settled out of court before the proceedings started, but YouTube and Meta are fighting back. In his testimony on Wednesday, Meta CEO Zuckerberg insisted the company's philosophy has always been \"to try to build useful services that people connect to\" and claimed it did not have targeted internal goals for how long people should use the apps. Zuckerberg added: \"If something is valuable, people will do it more because it's useful to them.\" He also said that Meta had worked to remove underage accounts, and any implication to the contrary was \"not true\". He did, however, admit that \"I don't think we identified every single person who tried to get around restrictions\". Zuckerberg later apologised to the families present at the trial: \"I'm sorry for everything you have all been through.\" Instagram boss Adam Mosseri said in his testimony last week that he does not believe people can get clinically addicted to social media. Instead, he said there can be \"problematic use\". If KGM's lawyers can convince the jury that those social media features were damaging to her mental health, this court case lays the groundwork for how much compensation social media victims should get. But, it could also see the companies forced to make changes to their platforms to stop them from being addictive or damaging. Meta told Sky News: \"The question for the jury in Los Angeles is whether Instagram was a substantial factor in the plaintiff's mental health struggles. \"The evidence will show she faced many significant, difficult challenges well before she ever used social media.\" British parents suing over TikTok's algorithm The second case to watch is being brought by five British parents. They're suing TikTok in Delaware over the deaths of their children, who they say all died attempting the dangerous 'blackout' challenge they saw on the platform. Speaking to Sky News last month, the parents all described cheerful, happy children who had shown no mental health issues before their deaths. \"How the hell do you, as a parent, get your head around that?\" asked Lisa Kenevan, whose son, Isaac, died when he was 13. However, these parents aren't suing over the videos themselves, but over what they describe as a harmful algorithm that \"flooded them with a seemingly endless stream of harms\". TikTok is contesting these claims, and told us: \"Our deepest sympathies remain with these families. \"We strictly prohibit content that promotes or encourages dangerous behaviour. \"Using robust detection systems and dedicated enforcement teams to proactively identify and remove this content, we remove 99% that's found to break these rules before it is reported to us.\" If the parents are successful, TikTok could be forced to change how its algorithm works - especially for young users - to prevent harmful content being promoted. The case is still in the early stages, although we're expecting an update before mid-April. Scottish family taking action over sextortion The third case involves the family of 16-year-old Murray Dowey, from Scotland. They're suing Meta after he took his own life while being blackmailed on Instagram by sextortionists. They're joined by a US mother, whose son, Levi, died in similar circumstances. It's the first UK case where a social media company is facing legal action over sextortion on its platform. In the past, cases have focused on the perpetrators. If it's successful, Meta may have to strengthen protections for young users. While under-16s have restricted accounts by default, Murray's family say older teenagers are still vulnerable. The lawsuit also challenges Meta's data collection practices, arguing Instagram's recommendation systems helped sextortionists target him. Read more from Sky News:Do AI resignations leave the world in 'peril'?Can governments ever keep up with big tech? Meta is contesting these claims. A spokesperson told Sky News: \"Since 2021, we've placed teens under 16 into private accounts when they sign up for Instagram, which means they have to approve any new followers. \"We work to prevent accounts showing suspicious behaviour from following teens and avoid recommending teens to them. \"We also take other precautionary steps, like blurring potentially sensitive images sent in DMs and reminding teens of the risks of sharing them, and letting people know when they're chatting to someone who may be in a different country.\" Social media companies are being bombarded with litigation - but if just one of these cases succeeds, we could see a huge difference in the way they approach online safety."
    },
    {
        "title": "Tech firms must take down abusive images in 48 hours - or face being blocked from UK",
        "description": "Technology firms that do not take down abusive images from their platforms within 48 hours face being blocked from the UK under new rules proposed by the government.",
        "url": "https://news.sky.com/story/tech-firms-must-take-down-abusive-images-in-48-hours-or-face-being-blocked-from-uk-13509229",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-sir-keir-starmer-grok_7130381.png?20260108174350",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-18 22:29:00",
        "Headline": "Tech companies that don't take down abusive images reported to them could be blocked from operating in the UK or fined 10% of worldwide revenue.",
        "Content": "Technology firms that do not take down abusive images from their platforms within 48 hours face being blocked from the UK under new rules proposed by the government. Prime Minister Sir Keir Starmer said he was putting tech companies \"on notice\" to take down non-consensual intimate images, and will leave \"no stone unturned\" to protect women and girls. Companies will be legally required by law to remove the images within 48 hours of them being reported to them. If they do not, firms could be fined 10% of qualifying worldwide revenue - which could amount to billions of pounds for some major platforms - or have their services banned from the UK. Ministers say tech firms should take tackling intimate image abuse as seriously as they take tackling terrorist or child sexual abuse material. The government is making the change through an amendment to the Crime and Policing Bill, which is currently going through parliament. Media regulator Ofcom is also considering plans to treat non-consensual intimate images as the same as child sexual abuse material, which is digitally marked when found, so that any time they are re-shared, they are automatically taken down. \n                  Are you using an AI-generated password? It might be time to change it\n                 \n                  Priced-out Britons are using AI for financial advice. Critics call it a 'dangerous' - we put the chatbots to the test\n                 \n                  Beth Rigby: The constant challenges I face keeping my kids safe in the new Wild West\n                 Additionally, the government says it will publish guidance for internet companies on how to block \"rogue websites\" that host this content and fall out of reach of the Online Safety Act. Sir Keir said he would \"leave no stone unturned in the fight to protect women from violence and abuse\". He said the government had already taken \"urgent action against chatbots and 'nudification' tools\", and that they were \"going further, putting companies on notice so that any non-consensual image is taken down in under 48 hours\". Technology Secretary Liz Kendall said: \"The days of tech firms having a free pass are over... No woman should have to chase platform after platform, waiting days for an image to come down.\" Shadow technology secretary Julia Lopez said when a similar proposal was put forward by Conservative peer, Baroness Charlotte Owen, Labour had failed to take action. \"Once again, the government is playing catch-up to duck a major backbench rebellion. \"The reality is that, for all the prime minister's tough rhetoric, he has arrived late to this issue. He does not know what to believe - he only knows what to do to try and survive another week.\" The move follows controversy in January over X's AI tool, Grok, creating AI images undressing people without their consent. Creating non-consensual intimate images, including sexually explicit deepfakes, was criminalised earlier this month, and X stopped Grok from creating the images following the outrage. Other countries are also taking action against X, with Ireland's data privacy regulator saying on Tuesday that X faces an EU privacy investigation over the non-consensual deepfakes created by Grok. Earlier this week, Sir Keir announced a crackdown on social media platforms, such as closing a legal loophole to eliminate \"vile illegal content created by AI\". Downing Street has also launched a consultation on measures like an Australian-style ban on under-16s using social media, and is ensuring it is able to implement one quickly if it is recommended."
    },
    {
        "title": "1,000 suspected paedophiles being arrested every month",
        "description": "Police are arresting 1,000 suspected paedophiles every month as the threat of child sex abuse worsens, the National Crime Agency (NCA) has warned.",
        "url": "https://news.sky.com/story/1000-suspected-paedophiles-being-arrested-every-month-13508868",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-arrest-crime-police_7167831.jpg?20260218010050",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-18 00:29:00",
        "Headline": "During a single week in January, there were 252 arrests of child sexual abuse suspects across the UK, including 118 who were then charged.",
        "Content": "Police are arresting 1,000 suspected paedophiles every month as the threat of child sex abuse worsens, the National Crime Agency (NCA) has warned. Rob Jones, the NCA's director of general operations, said online groups had resulted in offenders' behaviour being \"rationalised\", as \"like-minded\" abusers are brought together by algorithms. While they are collaborating on the dark web, they are using mainstream social media as \"discovery\" platforms to \"identify and abuse vulnerable children\". And with youngsters increasingly reliant on the internet themselves, they are at even greater risk. Mr Jones described the situation as \"incredibly damaging\", and warned: \"We want society to push back and people to confront their offending - that is the opposite of what happens in the online world.\" The amount of material referred to the authorities by the National Centre for Missing and Exploited Children has roughly doubled over the past three years, according to the NCA. Arrests have risen from between 500 and 800 per month a few years ago to 1,000. During a single week in January, the NCA and forces across the UK made 252 arrests, including 118 people who were then charged. Another 35 people were sentenced in court and 407 children were safeguarded. Offences that are becoming more prevalent include abusers paying on demand for the abuse of children to be livestreamed - sometimes for as little as £20. More from Sky News:Tracking unusual Russian flightObama leads Jesse Jackson tributes The NCA also warned of \"Com groups\" - sadistic groups that gamify abuse which were recently highlighted by a special report from Sky News. Mr Jones said members of these communities \"egg each other on\" to commit \"even more horrendous crimes\". Tech companies must 'act with urgency' Becky Riggs, the National Police Chiefs' lead for child protection and abuse investigation, said officers were working \"relentlessly\" to target abusers. But she said tech firms must \"act with urgency to make their platforms hostile environments for offenders\". Parents, guardians, carers, and teachers should also learn the signs that a child is being abused. \"The trusted adults around them [...] need clear, accessible guidance so they can recognise the signs of harm, have open conversations, and know where to turn for help,\" Ms Riggs added. The NCA's warning comes after the government announced a sweeping crackdown on tech companies to protect children from illegal content. It will include measures to eliminate \"vile illegal content created by AI\", and could even open the door to an Australia-style age limit on social media, a Number 10 spokesperson said."
    },
    {
        "title": "Dennis the Menace plays 'greatest prank yet' as Royal Mint presses 75-year anniversary 50p coins",
        "description": "A new range of Dennis the Menace-themed coins will be minted, marking 75 years of the iconic comic prankster.",
        "url": "https://news.sky.com/story/dennis-the-menace-plays-greatest-prank-yet-as-royal-mint-presses-75-year-anniversary-50p-coins-13509040",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-dennis-the-menace-beano_7168092.jpg?20260218113058",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-18 11:20:00",
        "Headline": "Marking 75 years since the iconic Beano character made his first appearance, the Royal Mint's Rebecca Morgan said the 50p coin \"captures everything we love about him\".",
        "Content": "A new range of Dennis the Menace-themed coins will be minted, marking 75 years of the iconic comic prankster. A collaboration between the Royal Mint and Beano will see Dennis and his dog Gnasher feature on collectable 50p coins. Vibrant colour printing is available, meaning the cartoon character's famous red and black jumper pops next to an engraving that reads \"75 years of Dennis\". The character made his first appearance in issue 452 of the Beano on 17 March 1951 and has since appeared on the BBC, ITV, and in video games. Dennis and Gnasher were also the mascots for Beanoland in Chessington World of Adventures from 1999 to 2010. It's the latest birthday celebration for the famous prankster. For his 60th, he and Gnasher gatecrashed the headquarters of Sky News in a comic strip. Rebecca Morgan, from the Royal Mint, said there's \"something wonderfully fitting about this legendary mischief-maker finally making his mark\" on the collectable coins. \"I'm sure Dennis himself would see it as his greatest prank yet,\" she added. Rob Glenny, from Beano, which was launched by Dundee-based publisher DC Thomson in 1938, said the coin \"captures the unmistakable spark that has kept Dennis at the heart of childhood for generations\". Read more: How the Beano's characters have changed The commemorative coin is available to buy from the Royal Mint's website from today, starting at £15. Fom 26 February, visitors to the Royal Mint Experience, based in Llantrisant, South Wales, will also be able to mint their own Dennis the Menace coin. "
    },
    {
        "title": "Nancy Guthrie: No match found for DNA on glove recovered near home",
        "description": "DNA recovered from a glove found near the home of Nancy Guthrie does not match anything in a national database, authorities have said.",
        "url": "https://news.sky.com/story/nancy-guthrie-no-match-found-for-dna-on-glove-recovered-near-home-13508873",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-nancy-guthrie-savannah-guthrie_7166789.jpg?20260216193605",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-18 03:58:00",
        "Headline": "The Guthrie family, who have released several public appeals for help, have been ruled out as suspects and are holding out hope that Nancy is still alive.",
        "Content": "DNA recovered from a glove found near the home of Nancy Guthrie does not match anything in a national database, authorities have said. It marks a significant setback for detectives investigating the case of the missing 84-year-old, who is the mother of NBC's Today show presenter Savannah Guthrie. She was last seen on 31 January when her family dropped her off at her home near Tucson, Arizona, following dinner with them. The case has since gripped America and beyond. Authorities announced they had obtained a DNA sample from a glove found near the property on Sunday. The glove appeared to match the pair worn by a masked prowler seen in doorbell camera footage before Nancy was abducted, and forensic experts hoped to find a match on a national DNA database. It was announced on Tuesday that no match had been found. Pima County Sheriff Chris Nanos has said he believes the man in the doorbell video is the likely perpetrator of the abduction and the primary person authorities are looking for. The Guthrie family, who have released several public appeals for help, have been ruled out as suspects and are holding out hope that Nancy is still alive. More from Sky News:Obama leads Jesse Jackson tributes1,000 suspected paedophiles arrested a month The disappearance is still being treated by police and the FBI as an apparent kidnapping for ransom. Mr Nanos has said Nancy, who has a pacemaker, was extremely limited in her physical mobility and could not have left her home unassisted, leading investigators to believe she had been taken against her will early on."
    }
]