[
    {
        "title": "OBR slashes UK growth forecast for 2025 but upgrades it for rest of parliament",
        "description": "The Office for Budget Responsibility has halved the UK growth forecast for 2025 from 2% to 1%, Chancellor Rachel Reeves has said.",
        "url": "https://news.sky.com/story/uk-growth-forecast-for-this-year-halved-chancellor-says-13335986",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rachel-reeves-spring-statement_6867458.jpg?20250326122730",
        "type": "Home",
        "Author": "Faith Ridler, politics reporter and Sarah Taaffe-Maguire, business and economics reporter",
        "Date Published": "2025-03-26 13:00:00",
        "Headline": "The Office for Budget Responsibility (OBR) downgraded growth for 2025 but upgraded it for every year after for the rest of this parliament. Its forecasts for the UK economy are for higher unemployment and inflation this year, but it said so-called economic inactivity is lower than thought.",
        "Content": "By Faith Ridler, politics reporter and Sarah Taaffe-Maguire, business and economics reporter   The Office for Budget Responsibility has halved the UK growth forecast for 2025 from 2% to 1%, Chancellor Rachel Reeves has said. However, the fiscal watchdog said that while growth has been downgraded for this year, it had been upgraded for every year after for the rest of this parliament - which is due to end in 2029. The chancellor said she is \"not satisfied with the numbers\" for this year as she delivered her long-awaited spring statement in the House of Commons. Politics latest: Follow live updates But, she explained, the OBR has forecast growth to hit 1.9% in 2026, 1.8% in 2027, 1.7% in 2028, and 1.8% in 2029. Some tough forecasts beyond headline figures The independent forecaster also published its economic outlook on Wednesday, showing there's a 54% chance the chancellor will not break her self-imposed fiscal rules to bring down government debt and balance the budget by 2030. Living standards, as measured by household disposable income, will fall after this year to almost no growth in 2027-28 before rising again due to firms rebuilding profit margins, wage growth slowing, taxes rising, and welfare measures taking effect. The OBR also raised its expectation for unemployment and net migration - the number of people immigrating to the UK minus those emigrating. The unemployment rate, the percentage of people out of work, will rise to 4.5% this year. This is 0.4 percentage points or 160,000 people higher than first thought in the October forecast. Net migration will fall sharply, the OBR said, due to a tightening of visa policies and higher levels of emigration. But the forecast has been upped by 25,000 since October as a higher share of immigrants are staying in the UK under the new migration system.  At the same time, there will be a reduction in people neither in work nor looking for work due to a reduction in caring as birth rates fall and childcare provision is expanded. But there are also fewer people in this position, classed as \"economically inactive\" than previously thought, the OBR said. The government launched its welfare cuts in an effort to reduce this economic inactivity. Further cuts are to come, the OBR said, as \"unprotected\" government departments such as local government justice, the environment, Home Office and culture may need to be cut by 0.8% a year from 2026-27 \"to accommodate assumed commitments in other areas\". Prices overall will go up even higher than initially anticipated, according to the OBR, which now forecasts inflation will rise to 3.8% in July due to higher energy, food and water bills. This will fall rapidly, however, from next year. 'No shortcuts to growth' Ms Reeves told MPs: \"There are no shortcuts to economic growth. It will take long-term decisions. It will take hard yards. It will take time for the reforms we are introducing to be felt in the everyday economy. \"It is right that the Office for Budget Responsibility consider the evidence and look carefully at measures before recognising a growth impact in their forecast.\" The chancellor pointed to changes to the National Planning Policy Framework, saying mandatory housing targets and bringing \"grey belt\" land into scope for development will \"permanently increase the level of real GDP by 0.2% by 2029-30\". This will bring an \"additional £6.8bn in our economy and by 0.4% of GDP within the next 10 years\", she said. Ms Reeves also highlighted reforms to the pension system and a national wealth fund, adding it was part of a \"serious plan\" for economic growth. Also announced in the spring statement today: The chancellor confirmed that a voluntary redundancy scheme is set to launch for civil servants as part of her mission to \"make government leaner\". She said this will deliver £3.5bn in \"day-to-day savings by 2029-30\".  Political reaction Shortly afterwards, Conservative leader Kemi Badenoch accused Labour of financial \"chaos\". She said the spring statement was \"all smoke and mirrors\", adding: \"I remember the last budget when Rachel Reeves said she was smashing glass ceilings, now it feels like the roof is falling over all our heads.\" A handful of Labour MPs were unimpressed with the moves around welfare, with Debbie Abrahams - the MP for Oldham East and Saddleworth - claiming \"all the evidence points to cuts in welfare leading to severe poverty and worsened health conditions\". An impact assessment into Labour's welfare reforms, which include narrowing the eligibility criteria for personal independence payments (PIP), found there could be an additional 250,000 people in \"relative poverty\" by 2030 due to the changes. Richard Burgon, the Labour MP for Leeds East, said \"taking away the personal independence payments\" from disabled people is an \"especially cruel choice\"."
    },
    {
        "title": "Chancellor's difficult decisions in spring statement could just be the start",
        "description": "It might not have been a budget, but the spring statement felt like one.",
        "url": "https://news.sky.com/story/chancellors-difficult-decisions-in-spring-statement-could-just-be-the-start-13336344",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-spring-statement-beth_6860429.jpg?20250318123852",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-03-26 21:17:00",
        "Headline": "Government insiders do not scent a rebellion over the spring statement, trusting the chancellor is serious about getting the public finances back on track. But their appetite for cuts was exhausted on Wednesday.",
        "Content": "\n          Political editor\n              @BethRigby\n  It might not have been a budget, but the spring statement felt like one. There was red pen all over the chancellor's economic plans as Rachel Reeves sought to repair deteriorating public finances by cuts that will hit the poorest in society. Faced with a deteriorating economic outlook and rising debt repayment costs, the chancellor was in a tight spot, having made her big call back in October when she executed a - her words - \"once in a generation\" £70bn tax and spend budget to improve public services and drive economic growth. Five months in, the budget is not living up to what was billed. She confirmed on Wednesday that the £9.9bn surplus forecast in 2029/30 had been wiped out, leaving the public finances in the red. Cue a £14bn repair job to restore her fiscal cushion as Reeves told the House of Commons her fiscal rule to fund day-to-day government spending from tax receipts not borrowing by the end of the decade was \"non-negotiable\". No more borrowing and no more tax hikes (for now). \n                  After chancellor's spring statement we end more or less where we began\n                 \n                  'I don't know how we will survive' - fears over benefit cuts and cost of living in chancellor's Leeds constituency\n                 \n                  Extra 50,000 children could be pushed into poverty over welfare changes, says government assessment\n                 The chancellor instead announced billions of spending cuts to make her sums add up and the cuts were hard to stomach for the Labour movement as they watched a Labour chancellor cut the welfare bill by £4.8bn. The government's own assessments estimate that 3.2m families on universal credit will be on average £1,720 worse off a year by 2029/30 while 250,000 adults and 50,000 more children are set to be pushed into relative poverty, according to the government's own impact assessment.  I don't need to tell you how uncomfortable this is for many Labour MPs and the clamour against cuts was plain to see, not only in the Commons as MPs stood up to rail against \"cruel cuts\" and urge the chancellor to think again, but outside Downing Street too as protesters gathered. For now, MPs, and government insiders, tell me they don't scent a full-blown rebellion. One seasoned MP told me that while MPs are very concerned about how these cuts will be implemented and reaction from constituents, they also \"generally still recognise the tough circumstances\" with \"no one in doubt Rachel Reeves is serious about turning around public finances\". Government figures argue they do not think the fall-out from the cuts will be as bad as their own assessment, pointing out that the calculations don't take into account the rise in national living wage, the government's poverty plan for around 700,000 vulnerable families and changes to employment support as part of the welfare reform that should help people back into work. But that does not mean the difficulties are not piling up for this chancellor even if on Wednesday she managed to buy a bit of political space as she repaired her black hole, avoided an emergency budget and could at least point to upgrades to the growth forecasts after 2026. Read More:Spring statement 2025 key takeawaysAfter the spring statement we end more or less where we began There was also a rabbit of sorts - the chancellor looks very happy about this - as she announced that the government's planning reforms would add nearly £7bn to the economy over the next five years. This is something to grasp on to for a politician groping around for a bit of good news and something to sell to her MPs: Stick with me the growth plan is going to work. But what is plain to see is that this is a repair job rather than a fix. As the Office of Budget Responsibility itself noted, the £9.9bn headroom Reeves has re-built to stick to her fiscal rules is flimsy and fragile and could easily be wiped out by trade wars, an interest rate shock or market volatility in these deeply uncertain times. So, the question on everyone's lips is will she have to come back for more in a few months? When I asked her at this afternoon's press conference, she said only that the government was, as demonstrated on Wednesday, \"determined to live within its means\". But it's obvious that further tax rises or spending cuts could soon be on the cards if she remains determined to stick to her fiscal rules and not borrow more. 👉 Listen to Sky News Daily on your podcast app 👈 What is clear too is that the appetite for further spending cuts from her own party is pretty much exhausted. Labour MPs were vocal about that in the chamber, demanding taxes on the rich rather than benefit cuts on the poor, while those who are sticking with the chancellor now also know all too well that pressure will build to raise revenue elsewhere. The chancellor may have managed to navigate a difficult day, but the months ahead look set to become harder still. The difficult decisions now could be just the start."
    },
    {
        "title": "Discrediting the messenger, rather than focusing on the message is order of day for Trump White House",
        "description": "Marjorie Taylor Greene has become the most aggressive spokesperson for the \"Make America Great Again\" movement.",
        "url": "https://news.sky.com/story/discrediting-the-messenger-rather-than-focusing-on-the-message-is-order-of-day-for-trump-white-house-13336352",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-marjorie-taylor-greene_6867998.png?20250326212056",
        "type": "Home",
        "Author": "Martha Kelner",
        "Date Published": "2025-03-26 22:21:00",
        "Headline": "\"Team Trump has adopted a crisis management strategy of attack, discredit and distract\", writes Sky's US correspondent Martha Kelner.",
        "Content": "\n          US correspondent\n              @marthakelner\n  Marjorie Taylor Greene has become the most aggressive spokesperson for the \"Make America Great Again\" movement. It's perhaps no surprise, then, that she would read straight from a fraying playbook when confronted about the Signal group chat fiasco. Team Trump has adopted a crisis management strategy of attack, discredit, and distract, a dark art of which Taylor Greene is emerging as a master. When questioned about whether the texts on the group chat, detailing timings and weapons to be used on strikes on Houthis in Yemen, amount to classified information, she refused to answer the question. Read more here:More details of US security breach revealedAtlantic publishes more texts shared on leaked chat The representative from Georgia attempted to deflect attention on to the Biden administration, then on to the US's border problem and finally, in a remarkable act of contortion, on to \"all the women that are raped by migrants\" in the UK. Refusing to answer a question from Sky News, she then turned to a question from a US reporter, who also asked for clarification on her views about the Signal scandal and its national security ramifications. 👉 Follow Trump 100 on your podcast app 👈 Eventually, Taylor Greene did respond to The Atlantic magazine's revelation of texts on the signal group chat, fully backing defence secretary, Pete Hegseth, who is facing calls for his resignation. In MAGA world, the villain of this scandal is Jeffrey Goldberg, the editor of The Atlantic, who was inadvertently invited on to the group chat. Despite the fact that Goldberg took care over his reporting and potentially exposing major failings in the way senior government communicate, he has been repeatedly smeared by the White House. Donald Trump calls him a \"sleazebag\", national security advisor Michael Waltz equates him to \"journalists trying to make a name for themselves\", and press secretary Karoline Leavitt calls him an \"anti-Trump hater.\" Discrediting the messenger, rather than focusing on the message and what lessons can be learned, is the order of the day for the Trump White House."
    },
    {
        "title": "President Trump announces 25% tariff on all imported cars ahead of 'liberation day'",
        "description": "US President Donald Trump has announced a new 25% tariff on all imported cars.",
        "url": "https://news.sky.com/story/president-trump-announces-25-tariff-on-all-imported-cars-ahead-of-liberation-day-13336389",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-united-states_6868041.jpg?20250326222222",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-26 21:45:00",
        "Headline": "As Washington continued to reel from the fallout over the Signal security breach, Donald Trump instead tried to talk about more tariffs he was implementing.",
        "Content": " US President Donald Trump has announced a new 25% tariff on all imported cars. Signing an executive order, Mr Trump said the tax would kick in on 2 April - what he has called \"liberation day\". This is when all his retaliatory import tariffs are supposed to take effect, but they have been delayed before. It comes amid the continued fallout from the Signalgate security breach in Washington. What was said in the Signal chat?  The move ratchets up the global trade war Mr Trump himself kicked off. Speaking late on Wednesday, Mr Trump said the proposal: \"Will continue to spur growth. We'll effectively be charging a 25% tariff.\" However, the tariffs could be complicated as even American car makers source components from around the world - meaning they could also face higher costs and lower sales. The announcement also drew swift condemnation from the European Union and from Canadian Prime Minister Mark Carney, who called it a \"direct attack\" on Canadian workers. During his second term, Mr Trump has used tariffs frequently as a trade weapon. He cited plans from South Korean car maker Hyundai to build a $5.8bn (£4.5bn) steel plant in Louisiana as evidence the economic measures would bring back manufacturing jobs. Despite Mr Trump's optimism, shares in General Motors fell by about 3% in Wednesday afternoon trading. Ford's stock was up slightly, but shares in Stellantis, the owner of Jeep and Chrysler, dropped nearly 4%. Even American and foreign firms already with domestic plants still rely on Canada, Mexico and other countries for parts and finished vehicles - meaning prices could increase and sales decline as new factories take time to build. Tariffs are a key part of Mr Trump's efforts to reshape global trade relations. He plans to impose what he calls \"reciprocal\" taxes on 2 April that would match tariffs and sales taxes levied by other nations. He has already placed a 20% tax on all imports from China. Similarly, he placed 25% tariffs on Mexico and Canada, with a lower 10% tariff on Canadian energy products. Sky News understands the UK government is engaging with the US on a trade deal and remains hopeful an agreement could be made before the tariffs come into force, but may retaliate if necessary. Signal security breach As Mr Trump was keen to talk up his tariffs, the rest of Washington was discussing the security breach that rocked the Capitol. Read more:Atlantic publishes more texts from group chatTrump White House rolls out playbook responseJD Vance announces trip to Greenland In a group called \"Houthi PC small group\", specific details of a US attack on Houthis were shared with intelligence director Tulsi Gabbard, national security adviser Mike Waltz, vice president JD Vance and more. However, a senior journalist for the magazine The Atlantic, Jeffrey Goldberg, was also somehow added to the Signal group chat. Goldberg published a story first on Monday about the incident. The White House had sought to downplay the leak of the messages, saying no classified information had been disclosed. Goldberg then published a follow-up story releasing the messages themselves earlier on Wednesday. Concerns have been raised about the security of some of the most important members of the US administration using a commercial app. During a hearing in front of Congress, some members outlined feared security issues with Signal."
    },
    {
        "title": "Misconduct claims at charity set up by Prince Harry 'a surprise', says Sentebale trustee",
        "description": "A former trustee at a charity co-founded by Prince Harry has said he is surprised at claims of bullying, harassment and misogyny made by its chairwoman.",
        "url": "https://news.sky.com/story/misconduct-claims-at-charity-set-up-by-prince-harry-a-surprise-says-sentebale-trustee-13336335",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-sentebale-prince-harry_6868042.jpg?20250326222357",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-26 20:30:00",
        "Headline": "Sky News speaks to Dr Kelello Lerotholi about a row with the charity's chair that's triggered the resignation of Prince Harry as patron.",
        "Content": " A former trustee at a charity co-founded by Prince Harry has said he is surprised at claims of bullying, harassment and misogyny made by its chairwoman. Dr Kelello Lerotholi told Sky's royal correspondent Rhiannon Mills he did not recognise the allegations. Prince Harry established Sentebale in 2006, in honour of his mother Princess Diana, to help children and young people in southern Africa. Dr Lerotholi and other trustees have resigned amid a bitter internal row, with Harry also quitting as patron in solidarity. The royal said on Tuesday he was devastated and \"in shock\" at having to part ways. \"What's transpired is unthinkable,\" said a joint statement issued with co-founder Prince Seeiso of Lesotho. Chairwoman Dr Sophie Chandauka, who has not accused anyone specifically, alleged \"issues of poor governance, weak executive management, abuse of power, bullying, harassment, misogyny and misogynoir\". \n                  Prince Harry 'in shock' as he quits Sentebale charity set up in honour of Princess Diana\n                 \n                  Documents about Prince Harry's US visa application released - with heavy redactions\n                 \n                  Prince Harry immigration files must be made public next week, US court rules\n                 However, Dr Lerotholi told Sky News he had never witnessed these issues and that the claims \"came to me as a surprise\". \"I can honestly say, in the meetings I was present in, there was never even a hint of such,\" he said. \"The general tone and conduct of the board has been one of respect for each other, accommodating each others' opinions and inputs, and speaking with respect to each other. \"So this all came as a shock to me.\" Dr Chandauka said on Tuesday that she had reported Sentebale's trustees to the Charity Commission in the UK and obtained an injunction to stop them from removing her. Precise details of the falling out within the charity are unclear, but reports have suggested it's connected to a decision to focus fundraising in Africa. \"I think things came to a head at the end of last year when it seemed that we were not doing as well as we used to be and that the future didn't look as bright as it used to,\" Dr Lerotholi added. \"As is natural in an organisation we had to sort of look inwards and see how we deal with it and then look at how the situation came to be.\" Royal correspondent You can't underestimate how significant Sentebale has been for Prince Harry. His personal tribute to his mother Princess Diana, it was the charity that showed he was more than just a Prince who liked a laugh. And so important to him that it was at one of their events that he broke his silence in the week after announcing he was stepping away from royal life.\n But now he's had to step away from the charity with a \"heavy heart\". Speaking to trustee Dr Kelello Lerotholi, who was in Lesotho and one of those who stepped down, you can get a real sense of the genuine upset this has all caused.  When I put to him the incredibly serious allegations made by the chair of harassment and bullying, he told me it simply wasn’t something he recognised. He said \"the general conduct of the board has been one of respect for each other, accommodating each others' opinions\". He talks instead about there being issues around \"stewardship\", suggesting fundraising plans may have been an area of concern. Dr Kelly, as he likes to be called, has been with the charity from the beginning, he was even there when Prince Harry spent part of his gap year there, the foundation for his bond with Prince Seiso and his desire to help the children of Lesotho. It now isn't clear what will happen next. Dr Kelly says the name of the charity, which means \"forget me not\", is so intrinsically linked to the two mothers of Prince Seiso and Prince Harry it's impossible to think of it without them. Harry's decision to step down is particularly astonishing when you think that the Invictus Games and Sentebale were the two main pillars of his work that remained from his old life, in a tumultuous five years where he had to give up his military affiliations, his royal patronages and some would say his family. Prince Harry was inspired to start the organisation after spending two months in Lesotho when he was on a gap year in 2004. Dr Lerotholi said the situation was especially painful for him because he \"was there at the very beginning\". \"I recall personally hosting Harry during his gap year. He happened to be in Lesotho during the Rugby World Cup. I happen to have an oversized TV so they spent most of their time watching the World Cup,\" he said, noting that this is when initial discussions about the charity started. \"So I've watched them from the very beginning into where they are now. I've also experienced very closely the successes they've had, the impact they've had. \"When I look at that and see where we're at now, it's really very disheartening and actually very painful and very personal to see what we've come to.\" Read more from Sky News:Harry's US visa application releasedPrince welcomes next Invictus Games Dr Lerotholi admitted it was \"very difficult\" to think about the next steps. He said he has a sense from Prince Harry and Prince Seeiso that they feel guilty \"of having to take the decision they’ve had to take, but also understanding the fact that they had no choice ultimately for the betterment of the charity\". The princes' decision to resign allows them to \"see what's next\", Dr Lerotholi said. \"Because I can tell you, I'm very sure they are not going to leave the kids in the lurch, they’re going to find a way to deliver on the mission that they've set for themselves in the memory of their mothers.\" A Charity Commission spokesperson said it was \"aware of concerns about the governance of Sentebale\" and was \"assessing the issues to determine the appropriate regulatory steps\". Prince Harry was in Lesotho - which has one of the world's highest rates of HIV and Aids - as recently as last October. In a statement, Sentebale said it was evolving into an organisation which addresses larger issues of youth health, wealth and climate resilience in southern Africa. It said it had not yet received resignations from its two royal patrons."
    },
    {
        "title": "Sudan army retakes Khartoum after nearly two years of fighting, says general",
        "description": "Sudan's army chief has declared Khartoum is \"free\" and that his forces have retaken the capital after nearly two years of fighting.",
        "url": "https://news.sky.com/story/sudanese-army-retakes-capital-khartoum-says-military-chief-after-nearly-two-years-of-fighting-13336219",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-sudan-abdel-fattah-al-burhan_6867860.jpg?20250326181941",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-26 17:44:00",
        "Headline": "It's estimated at least 28,000 people have been killed during the conflict, though the number is likely far higher. The UN says it's the world's largest humanitarian crisis.",
        "Content": "Sudan's army chief has declared Khartoum is \"free\" and that his forces have retaken the capital after nearly two years of fighting. The Sudanese Armed Forces (SAF) have been battling to oust the Rapid Support Forces (RSF) from a last foothold in the city, although the war looks far from over. In videos on social media, General Abdel Fattah al Burhan is seen walking with troops through the presidential palace, which was seized last week​​​​​​ in an important symbolic advance. \"Khartoum is now free. It's over. Khartoum is free. Free. Free,\" he can be heard telling soldiers. The Sudanese Armed Forces said they had also seized a key RSF base and recaptured the capital's airport after consolidating gains in Khartoum in recent days. The general kissed the ground and raised his fist after landing at the airport in a helicopter on Wednesday. The army also released drone footage of people walking across a dam, which it claimed showed RSF forces retreating across the Nile. \n                  Sudan's recaptured palace is a significant sign of return to order\n                 \n                  Sudan's military retakes more key government buildings in capital as it consolidates gains\n                 \n                  Sudan's military says it has seized control of presidential palace \n                 The war began in April 2023 as the country was attempting a democratic transition and has split the nation into rival zones of control. It's estimated at least 28,000 people have been killed during the conflict, though the number is likely far higher. The fighting has also caused what the UN calls the world's largest humanitarian crisis. While the SAF has made recent gains in central Sudan, the RSF remains deeply embedded in western Sudan.  When fighting broke out, Sudan's army had better resources, including air power, but the RSF was more deeply embedded in Khartoum and was able to hold much of the capital in an initial, devastating burst of warfare. Famine and disease is blighting several areas of Sudan and UN data suggests 12.8 million people have been displaced, more than a fifth of the population. Five million of those displaced are children, according to UNICEF. However, the army's control of the airport in Khartoum could now allow aid groups to fly in more supplies. Read more:Eyewitness: Waiting and praying for victory after two years of warSky News goes inside liberated district in war-torn capitalAnalysis: Sudan's capital left ravaged and ruined  The army and RSF had at one point been in a fragile partnership, jointly staging a coup in 2021 and also fought on the same side for years in the western state of Darfur. But the groups ended up turning against each other in a struggle for power."
    },
    {
        "title": "HIV deaths and infections will rise as a result of foreign aid cuts, study warns",
        "description": "HIV deaths and infections will rise as a result of cuts to foreign aid, a study has warned.",
        "url": "https://news.sky.com/story/hiv-deaths-and-infections-will-rise-as-a-result-of-foreign-aid-cuts-study-warns-13336152",
        "image_url": "https://e3.365dm.com/23/02/1920x1080/skynews-hiv-aids-test-tube_6064013.jpg?20230220153918",
        "type": "Home",
        "Author": "Samuel Osborne",
        "Date Published": "2025-03-26 14:17:00",
        "Headline": "Funding cuts could undo decades of progress and cause infections and deaths to surge to levels not seen since the early 2000s, researchers say.",
        "Content": "\n          News reporter\n              @samuelosborne93\n HIV deaths and infections will rise as a result of cuts to foreign aid, a study has warned. Funding cuts could undo decades of progress and cause infections and deaths to surge to levels not seen since the early 2000s, researchers said. They estimate there could be up to 10.8 million additional HIV infections in low and middle-income countries by 2030. Meanwhile, the number of HIV-related deaths in children and adults could reach 2.9 million by 2030. The study comes after Sir Keir Starmer's decision to cut overseas spending from 0.5% of gross national income to 0.3% over the next two years in order to fund defence commitments. The move led to the resignation of Anneliese Dodds as international development minister.  US President Donald Trump has ordered a pause in most US foreign aid spending and announced the country would withdraw from the World Health Organization. In a paper published in The Lancet HIV, researchers said international donors have contributed around 40% of all HIV funding in low and middle income countries since 2015. They said the UK, the US, France, Germany and the Netherlands account for over 90% of international funding. However, they point out that all the countries have recently announced plans to cut foreign aid, leading to a projected 24% reduction in international HIV funding by 2026. Through mathematical models the predominantly Australian-based researchers estimated there could be between 4.4 million and 10.8 million additional new HIV infections in low and middle income countries by 2030 and between 770,000 and 2.9 million HIV-related deaths in children and adults by the same year. Read more from Sky News:Bird flu strain 'has potential to become pandemic'Prince Harry quits charity after battle with chair \"The United States has historically been the largest contributor to global efforts to treat and prevent HIV, but the current cuts to Pepfar [the US President's Emergency Plan for AIDS Relief] and USAid-supported programmes have already disrupted access to essential HIV services including for antiretroviral therapy and HIV prevention and testing,\" said co-lead study author Dr Debra ten Brink of the Burnet Institute in Australia. \"Looking ahead, if other donor countries reduce funding, decades of progress to treat and prevent HIV could be unravelled. \"It is imperative to secure sustainable financing and avoid a resurgence of the HIV epidemic which could have devastating consequences, not just in regions such as sub-Saharan Africa, but globally.\" A spokesperson for the Foreign, Commonwealth and Development Office said: \"The UK provides significant funding to the global HIV response, supporting work to end AIDS-related deaths and prevent new HIV infections. \"We remain firmly committed to tackling global health challenges, not only because it is the right thing to do, but also because it will help us deliver on our Plan for Change in the UK by supporting global stability and growth.\""
    },
    {
        "title": "Farage and NatWest agree to settle debanking dispute",
        "description": "The Reform UK leader Nigel Farage has settled his debanking dispute with NatWest Group, nearly two years after the closure of his accounts sparked a chain of events culminating in the resignation of the lender's chief executive.",
        "url": "https://news.sky.com/story/farage-and-natwest-agree-to-settle-debanking-dispute-13336016",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-nigel-farage-natwest_6827889.png?20250213165715",
        "type": "Home",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-26 09:42:00",
        "Headline": "The Reform UK leader has agreed to end his dispute with the high street banking giant nearly two years after the closure of his Coutts accounts led to the ousting of its former CEO, Sky News can exclusively reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The Reform UK leader Nigel Farage has settled his debanking dispute with NatWest Group, nearly two years after the closure of his accounts sparked a chain of events culminating in the resignation of the lender's chief executive. Sky News can reveal that Mr Farage and NatWest have agreed to resolve their row, with the bank thought to have agreed to pay him an unspecified sum in damages. In return, Mr Farage is understood to have withdrawn the threat of potential civil and criminal proceedings against NatWest over the issue. Money blog: Are you better or worse off after the spring statement? Nick Candy, the Reform treasurer, is said to have played a key role in resolving the dispute between the two sides during mediation talks held at a London law firm on Tuesday. Precise details of the settlement were unclear on Wednesday evening. Responding to an enquiry from Sky News, Mr Farage and NatWest said in a joint statement: \"NatWest Group and Nigel Farage MP are pleased to confirm that they have resolved and settled their dispute, and the bank has apologised to Mr Farage. \n                  Nigel Farage would turn UK into a 'Trump tribute act', Lib Dem leader Sir Ed Davey says\n                 \n                  Rupert Lowe says Reform leader Nigel Farage 'must never be PM' in latest attack amid leaks of WhatsApp messages\n                 \n                  Reform UK's Andrea Jenkyns says Nigel Farage's row with Rupert Lowe was 'clearly a big falling out' - but insists it will 'blow over'\n                 \"The terms of settlement are confidential.\" Mr Farage was originally expected to seek millions of pounds from the company, alleging that the debanking row had damaged his reputation. The furore which claimed the scalp of Dame Alison Rose, NatWest's former chief executive, in the summer of 2023 centred on whether the bank's Coutts subsidiary had decided to close Mr Farage's accounts for commercial or political reasons. NatWest initially claimed the motivation was commercial, before Mr Farage obtained internal evidence from the bank suggesting that his political views had been a pivotal factor in the decision. A subsequent - and inaccurate - BBC News report further exacerbated the controversy after it emerged that the journalist who wrote the story had sat next to Dame Alison at a charity dinner when the row was at its height. It sparked a firestorm under the then Conservative government, with Rishi Sunak and Jeremy Hunt, the prime minister and chancellor respectively, indicating to NatWest's board that they had lost faith in Dame Alison's ability to lead the bank. An emergency late-night board meeting led to Sir Howard Davies, who at the time was NatWest's chairman, concluding that Dame Alison would need to step down - despite her having publicly apologised to Mr Farage for the bank's treatment of him. Since then, both have been replaced, with the former Ocado and MasterCard chairman Rick Haythornthwaite replacing Sir Howard, and Paul Thwaite now in his second year as the company's chief executive. NatWest has since reported a surge in profitability and is now on the verge of returning to full private sector ownership. Earlier this week, it disclosed that the government now owns less than 4% of its shares, with the sale of its remaining holding expected by the early summer. Then known as Royal Bank of Scotland Group and run by Fred Goodwin, RBS was bailed out in 2008 with £45.5bn of taxpayers' money. Its journey back to full private ownership has been a meandering one, and taxpayers will ultimately have lost billions of pounds on the government's rescue deal. On Wednesday afternoon, shares in NatWest closed at 463.9p, giving the bank a market capitalisation of over £37bn. The stock has risen by more than 75% during the last year. The debanking row which claimed Dame Alison's job prompted the City watchdog to order a change to the treatment by financial institutions of so-called politically exposed persons (PEPs). Since his initial promise to turn the issue into a mainstream battle against the major UK banks, Mr Farage's status as one of Britain's most influential politicians has been cemented. He led Reform to a handful of seats at last year's general election, while his party finished in second place in scores of other constituencies. An opinion poll for Sky News by YouGov earlier this year put Reform ahead of both Labour and the Tories for the first time."
    },
    {
        "title": "Anti-Hamas chants heard at rare protest in Gaza",
        "description": "Anti-Hamas chants have been heard in a rare sign of dissent in northern Gaza during a protest in which hundreds of Palestinians called for an end to the war.",
        "url": "https://news.sky.com/story/anti-hamas-chants-heard-at-rare-protest-in-gaza-13336073",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-palestinians-northern-gaza_6867427.jpg?20250326115630",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-26 11:28:00",
        "Headline": "Groups of protesters demand an end to the conflict in Gaza in a rare public show of opposition to Hamas, while the militant group claims the situation is being exploited by \"suspicious political agendas\".",
        "Content": " Anti-Hamas chants have been heard in a rare sign of dissent in northern Gaza during a protest in which hundreds of Palestinians called for an end to the war. Footage and images shared on social media showed people chanting, \"Hamas out\", as they marched down a street in Beit Lahiya surrounded by buildings damaged in the conflict. People were also shown chanting, \"We don't want war\", while holding banners saying, \"We are dying\" and 'Stop the war\". One witness, who did not want to be named, said: \"It was a spontaneous rally against the war because people are tired and they have no place to go. \"Many chanted slogans against Hamas, not all people, but many, saying 'out Hamas'. \"People are exhausted and no one should blame them.\" Middle East correspondent The protests in Gaza are potentially significant, but too complicated to be portrayed as being simply anti-Hamas demonstrations. Whilst some of the protestors have been seen openly calling for Hamas to go, others are calling for an end to the killing of women and children by Israel, and some are angry at inflated food prices because of the ongoing humanitarian blockade. It is a mixed picture.  Although they remain small, and only in a handful of districts for now, any dissent against Hamas, which has ruled Gaza since 2006, is unusual and therefore notable. It suits Israel to claim this is a sign that military pressure against Hamas is working, and to a limited extent that might have some merit, but Hamas's rivals, Fatah, also have reason to exaggerate anti-Hamas feeling amongst Palestinians. Further complicating things, many Palestinians have historically opposed Hamas as a governing body, but at the same time supported them as a resistance to Israeli occupation. There are some external indicators that suggest ongoing moves to replace Hamas in Gaza – an Israeli red line if the war is to end. There have been reports, as yet unconfirmed, that Jordan and other Arab countries have been examining plans to relocate up to three thousand Hamas leaders and fighters, although there is no suggestion where they would go. The White House, and Israel, have criticised a joint Arab plan for the future of Gaza because it doesn't include any suggestion to replace Hamas, so there is an incentive for that to be addressed if the plan is to be adopted. If the protests grow and spread, then there is a dangerous risk of intra-Palestinian violence in Gaza, and I would expect a number of players – Israel, the Palestinian Authority, Arab governments – to seize the energy of opposition as they pursue their own competing agendas for the future of Gaza. Videos and photographs shared on social media were said to have been taken on 25 March. Senior Hamas official Basem Naim said people had the right to protest at the suffering inflicted by the war. But he denounced what he claimed were \"suspicious political agendas\" exploiting the situation. He said: \"Where are they from, what is happening in the West Bank? \"Why don't they protest against the aggression there or allow people to take to the streets to denounce this aggression?\" The comments, reflecting tensions among Palestinian factions over the future of Gaza, came several hours after the rival Fatah movement called on Hamas to \"respond to the call of the Palestinian people in the Gaza Strip\". Fatah leads the Palestinian Authority in the occupied West Bank. Prime Minister Benjamin Netanyahu said the protest showed Israel's decision to renew its offensive was working in Gaza, where Hamas police - the group's enforcers - have again disappeared after emerging during a ceasefire. Read more:What happened to the Gaza-Israel ceasefire?Israeli strike hits key hospital in Gaza  More than 50,000 Palestinians have been killed by the Israeli campaign in Gaza, according to the territory's health ministry. The Hamas-run authority does not distinguish between civilians and combatants in its count, but has previously said more than half of those killed in the conflict were women and children. The war began when Hamas militants carried out a cross-border raid into southern Israel on 7 October 2023, killing 1,200 people and capturing around 250 hostages. Israel responded with an air and ground offensive in Gaza."
    },
    {
        "title": "Chancellor's difficult decisions in spring statement could just be the start",
        "description": "It might not have been a budget, but the spring statement felt like one.",
        "url": "https://news.sky.com/story/chancellors-difficult-decisions-in-spring-statement-could-just-be-the-start-13336344",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-spring-statement-beth_6860429.jpg?20250318123852",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-03-26 21:17:00",
        "Headline": "Government insiders do not scent a rebellion over the spring statement, trusting the chancellor is serious about getting the public finances back on track. But their appetite for cuts was exhausted on Wednesday.",
        "Content": "\n          Political editor\n              @BethRigby\n  It might not have been a budget, but the spring statement felt like one. There was red pen all over the chancellor's economic plans as Rachel Reeves sought to repair deteriorating public finances by cuts that will hit the poorest in society. Faced with a deteriorating economic outlook and rising debt repayment costs, the chancellor was in a tight spot, having made her big call back in October when she executed a - her words - \"once in a generation\" £70bn tax and spend budget to improve public services and drive economic growth. Five months in, the budget is not living up to what was billed. She confirmed on Wednesday that the £9.9bn surplus forecast in 2029/30 had been wiped out, leaving the public finances in the red. Cue a £14bn repair job to restore her fiscal cushion as Reeves told the House of Commons her fiscal rule to fund day-to-day government spending from tax receipts not borrowing by the end of the decade was \"non-negotiable\". No more borrowing and no more tax hikes (for now). \n                  After chancellor's spring statement we end more or less where we began\n                 \n                  'I don't know how we will survive' - fears over benefit cuts and cost of living in chancellor's Leeds constituency\n                 \n                  Extra 50,000 children could be pushed into poverty over welfare changes, says government assessment\n                 The chancellor instead announced billions of spending cuts to make her sums add up and the cuts were hard to stomach for the Labour movement as they watched a Labour chancellor cut the welfare bill by £4.8bn. The government's own assessments estimate that 3.2m families on universal credit will be on average £1,720 worse off a year by 2029/30 while 250,000 adults and 50,000 more children are set to be pushed into relative poverty, according to the government's own impact assessment.  I don't need to tell you how uncomfortable this is for many Labour MPs and the clamour against cuts was plain to see, not only in the Commons as MPs stood up to rail against \"cruel cuts\" and urge the chancellor to think again, but outside Downing Street too as protesters gathered. For now, MPs, and government insiders, tell me they don't scent a full-blown rebellion. One seasoned MP told me that while MPs are very concerned about how these cuts will be implemented and reaction from constituents, they also \"generally still recognise the tough circumstances\" with \"no one in doubt Rachel Reeves is serious about turning around public finances\". Government figures argue they do not think the fall-out from the cuts will be as bad as their own assessment, pointing out that the calculations don't take into account the rise in national living wage, the government's poverty plan for around 700,000 vulnerable families and changes to employment support as part of the welfare reform that should help people back into work. But that does not mean the difficulties are not piling up for this chancellor even if on Wednesday she managed to buy a bit of political space as she repaired her black hole, avoided an emergency budget and could at least point to upgrades to the growth forecasts after 2026. Read More:Spring statement 2025 key takeawaysAfter the spring statement we end more or less where we began There was also a rabbit of sorts - the chancellor looks very happy about this - as she announced that the government's planning reforms would add nearly £7bn to the economy over the next five years. This is something to grasp on to for a politician groping around for a bit of good news and something to sell to her MPs: Stick with me the growth plan is going to work. But what is plain to see is that this is a repair job rather than a fix. As the Office of Budget Responsibility itself noted, the £9.9bn headroom Reeves has re-built to stick to her fiscal rules is flimsy and fragile and could easily be wiped out by trade wars, an interest rate shock or market volatility in these deeply uncertain times. So, the question on everyone's lips is will she have to come back for more in a few months? When I asked her at this afternoon's press conference, she said only that the government was, as demonstrated on Wednesday, \"determined to live within its means\". But it's obvious that further tax rises or spending cuts could soon be on the cards if she remains determined to stick to her fiscal rules and not borrow more. 👉 Listen to Sky News Daily on your podcast app 👈 What is clear too is that the appetite for further spending cuts from her own party is pretty much exhausted. Labour MPs were vocal about that in the chamber, demanding taxes on the rich rather than benefit cuts on the poor, while those who are sticking with the chancellor now also know all too well that pressure will build to raise revenue elsewhere. The chancellor may have managed to navigate a difficult day, but the months ahead look set to become harder still. The difficult decisions now could be just the start."
    },
    {
        "title": "'I don't know how we will survive' - fears over benefit cuts and cost of living in chancellor's Leeds constituency",
        "description": "As Rachel Reeves made her spring statement, opposition to the spending cuts was being spelt out on the ground in her constituency, literally.",
        "url": "https://news.sky.com/story/i-dont-know-how-we-will-survive-fears-over-benefit-cuts-and-cost-of-living-in-chancellors-leeds-constituency-13336252",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-leeds-welfare-not-war_6867913.png?20250326191558",
        "type": "UK",
        "Author": "Paul Kelso",
        "Date Published": "2025-03-26 17:47:00",
        "Headline": "Welfare recipients are at the sharp end of the spending cuts, but they are not the only ones squeezed by the cost of living.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  As Rachel Reeves made her spring statement, opposition to the spending cuts was being spelt out on the ground in her constituency, literally. The voters of Leeds West and Pudsey sent the chancellor to Westminster with a majority of 12,000 last summer, support she perhaps can no longer take for granted after rewriting spending plans to meet self-imposed rules she can never have intended to break. In appropriately seasonal sunshine, disability campaigners gathered in the shadow of gold and silver cladding of the city's John Lewis. Politics latest: Reeves vows to 'never' again deliver budget like last one On the pavement, one wrote in chalk, \"Welfare not warfare\", expressing the disbelief some have at benefits being cut as defence spending goes up. The chancellor's cuts are a little more short term than that, a means of balancing the books that may have satisfied the OBR but left campaigners furious. The cuts to Personal Independence Payments (PIP) are particularly unpopular. The government's narrative is that cutting these benefits will help push people back to work. Campaigners like Flick Williams, a wheelchair user, point out PIP is unrelated to employment. She thinks she will lose at least £100 a week under new assessment rules, with devastating implications. \"I don't know how we will survive, I absolutely have no idea because I don't have any luxuries as it is,\" she says. \"The whole point of personal independence payment is to fund the additional costs you have for being a disabled person,\" adds Ms Williams. \"So, for example, disability equipment like my power chair, it's extremely expensive. I have a bigger electricity bill because I have to charge my wheelchairs. I have a bath lift which also needs charging, and this equipment wears out. \"The government's got a funny idea about what incentivises people because, honestly, nobody was ever motivated to go to work or increase their productivity by being pushed into penury.\" 'Everyone hit by cost-of-living crisis' Welfare recipients are at the sharp end of the spending cuts, but they are not the only ones squeezed by the cost of living. At the Pudsey Community Project, they see the impact of in-work financial stress, too. Based in a community hall serving 20,000 households across two wards, they have been operating for five years and have seldom been busier. The project offers a food bank and food pantry, a contributory scheme where people pay for subsidised goods, along with youth activities, lunch clubs for the elderly and lonely, and a busy clothes exchange. Children insist on growing, even if the economy does not. Director Richard Dimery says demand is steadily growing and senses that need has become entrenched, with the impact of the pandemic compounded by the cost of living. \"I don't know anybody who's not been affected by the cost of living crisis,\" he says. \"We've all become a lot more used to things not necessarily getting a lot better. There haven't been any quantum leaps of significant improvement, just ongoing costs, a lot of them above inflation. \"One of the reasons our pantry, our food bank, our children's clothes are all six days a week are because we know a lot of the people we're supporting are in work, either part-time or full-time.\" Economic growth would solve a lot of the chancellor's problems, never mind the country's. For that, companies like WDS Components need to thrive. Read more:Spring statement 2025 key takeawaysMoney blog: Are you better or worse off after statement?  Employing 50 people with an annual turnover of around £10m a year, it manufactures myriad parts used in production lines and finished goods. They stock more than 40,000 lines, from handles and hinges to hydraulics, casters and clamps, in what marketing director Mark Moody calls \"an engineers' candy store\". Like every other employer, it faces rising costs from higher employment taxes that kick in next week. It's the latest in a long line of challenges that has made growth and expansion a tougher proposition. \"Considering we've had a pandemic, we've had Brexit, global supply chain issues, the Suez Canal and a few wars, we're doing okay. We're holding our own with good, modest organic growth, and we're trying to stay positive,\" he says. \"As we try to manage our business, if we're constantly mitigating increases in costs and the pressures around us, then we're not as focused on driving the business in really exciting, innovative ways.\""
    },
    {
        "title": "Newborn baby found dead outside Notting Hill church was discovered in M&S bag, police say",
        "description": "Police say a newborn baby found dead outside a church in west London was discovered in a black M&S bag.",
        "url": "https://news.sky.com/story/police-giving-update-after-newborn-baby-found-dead-outside-church-13335973",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-church-dead-baby-notting-hill_6866916.jpg?20250325183128",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-26 09:57:00",
        "Headline": "Police give an update on what Superintendent Owen Renowden describes as a \"shocking and tragic\" case after the body of a baby was found in Notting Hill, west London, on Tuesday. ",
        "Content": " Police say a newborn baby found dead outside a church in west London was discovered in a black M&S bag. Metropolitan Police said officers and the ambulance service were called to the end of Talbot Road, in Notting Hill, at 12.46pm on Tuesday. The baby boy, who was found outside All Saints' Church, was declared dead at the scene. Superintendent Owen Renowden described the case as \"shocking and tragic\" as he gave an update on Wednesday morning. He said they were \"really worried\" about the mother's wellbeing \"as she will have recently given birth\". Read more from Sky News: Helicopter crashes as 'worst ever' wildfires rage in South KoreaTrump urged to fire 'unqualified' defence secretary over war plans leak Mr Renowden said: \"I know she will likely be feeling very frightened and going through an extremely difficult time. \"If you are the baby's mother and you see this today, I want to appeal directly to you to come forward and receive help, my priority is to help you, to make sure that you can receive medical assistance.\" He added she can get assistance anytime by attending any hospital, police station or by calling emergency services. He also appealed to anyone who may have information to come forward. They can call 101 or make an online report quoting reference 1879 and today's (26/3) date."
    },
    {
        "title": "Misconduct claims at charity set up by Prince Harry 'a surprise', says Sentebale trustee",
        "description": "A former trustee at a charity co-founded by Prince Harry has said he is surprised at claims of bullying, harassment and misogyny made by its chairwoman.",
        "url": "https://news.sky.com/story/misconduct-claims-at-charity-set-up-by-prince-harry-a-surprise-says-sentebale-trustee-13336335",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-sentebale-prince-harry_6868042.jpg?20250326222357",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-26 20:30:00",
        "Headline": "Sky News speaks to Dr Kelello Lerotholi about a row with the charity's chair that's triggered the resignation of Prince Harry as patron.",
        "Content": " A former trustee at a charity co-founded by Prince Harry has said he is surprised at claims of bullying, harassment and misogyny made by its chairwoman. Dr Kelello Lerotholi told Sky's royal correspondent Rhiannon Mills he did not recognise the allegations. Prince Harry established Sentebale in 2006, in honour of his mother Princess Diana, to help children and young people in southern Africa. Dr Lerotholi and other trustees have resigned amid a bitter internal row, with Harry also quitting as patron in solidarity. The royal said on Tuesday he was devastated and \"in shock\" at having to part ways. \"What's transpired is unthinkable,\" said a joint statement issued with co-founder Prince Seeiso of Lesotho. Chairwoman Dr Sophie Chandauka, who has not accused anyone specifically, alleged \"issues of poor governance, weak executive management, abuse of power, bullying, harassment, misogyny and misogynoir\". \n                  Prince Harry 'in shock' as he quits Sentebale charity set up in honour of Princess Diana\n                 \n                  Documents about Prince Harry's US visa application released - with heavy redactions\n                 \n                  Prince Harry immigration files must be made public next week, US court rules\n                 However, Dr Lerotholi told Sky News he had never witnessed these issues and that the claims \"came to me as a surprise\". \"I can honestly say, in the meetings I was present in, there was never even a hint of such,\" he said. \"The general tone and conduct of the board has been one of respect for each other, accommodating each others' opinions and inputs, and speaking with respect to each other. \"So this all came as a shock to me.\" Dr Chandauka said on Tuesday that she had reported Sentebale's trustees to the Charity Commission in the UK and obtained an injunction to stop them from removing her. Precise details of the falling out within the charity are unclear, but reports have suggested it's connected to a decision to focus fundraising in Africa. \"I think things came to a head at the end of last year when it seemed that we were not doing as well as we used to be and that the future didn't look as bright as it used to,\" Dr Lerotholi added. \"As is natural in an organisation we had to sort of look inwards and see how we deal with it and then look at how the situation came to be.\" Royal correspondent You can't underestimate how significant Sentebale has been for Prince Harry. His personal tribute to his mother Princess Diana, it was the charity that showed he was more than just a Prince who liked a laugh. And so important to him that it was at one of their events that he broke his silence in the week after announcing he was stepping away from royal life.\n But now he's had to step away from the charity with a \"heavy heart\". Speaking to trustee Dr Kelello Lerotholi, who was in Lesotho and one of those who stepped down, you can get a real sense of the genuine upset this has all caused.  When I put to him the incredibly serious allegations made by the chair of harassment and bullying, he told me it simply wasn’t something he recognised. He said \"the general conduct of the board has been one of respect for each other, accommodating each others' opinions\". He talks instead about there being issues around \"stewardship\", suggesting fundraising plans may have been an area of concern. Dr Kelly, as he likes to be called, has been with the charity from the beginning, he was even there when Prince Harry spent part of his gap year there, the foundation for his bond with Prince Seiso and his desire to help the children of Lesotho. It now isn't clear what will happen next. Dr Kelly says the name of the charity, which means \"forget me not\", is so intrinsically linked to the two mothers of Prince Seiso and Prince Harry it's impossible to think of it without them. Harry's decision to step down is particularly astonishing when you think that the Invictus Games and Sentebale were the two main pillars of his work that remained from his old life, in a tumultuous five years where he had to give up his military affiliations, his royal patronages and some would say his family. Prince Harry was inspired to start the organisation after spending two months in Lesotho when he was on a gap year in 2004. Dr Lerotholi said the situation was especially painful for him because he \"was there at the very beginning\". \"I recall personally hosting Harry during his gap year. He happened to be in Lesotho during the Rugby World Cup. I happen to have an oversized TV so they spent most of their time watching the World Cup,\" he said, noting that this is when initial discussions about the charity started. \"So I've watched them from the very beginning into where they are now. I've also experienced very closely the successes they've had, the impact they've had. \"When I look at that and see where we're at now, it's really very disheartening and actually very painful and very personal to see what we've come to.\" Read more from Sky News:Harry's US visa application releasedPrince welcomes next Invictus Games Dr Lerotholi admitted it was \"very difficult\" to think about the next steps. He said he has a sense from Prince Harry and Prince Seeiso that they feel guilty \"of having to take the decision they’ve had to take, but also understanding the fact that they had no choice ultimately for the betterment of the charity\". The princes' decision to resign allows them to \"see what's next\", Dr Lerotholi said. \"Because I can tell you, I'm very sure they are not going to leave the kids in the lurch, they’re going to find a way to deliver on the mission that they've set for themselves in the memory of their mothers.\" A Charity Commission spokesperson said it was \"aware of concerns about the governance of Sentebale\" and was \"assessing the issues to determine the appropriate regulatory steps\". Prince Harry was in Lesotho - which has one of the world's highest rates of HIV and Aids - as recently as last October. In a statement, Sentebale said it was evolving into an organisation which addresses larger issues of youth health, wealth and climate resilience in southern Africa. It said it had not yet received resignations from its two royal patrons."
    },
    {
        "title": "Farage and NatWest agree to settle debanking dispute",
        "description": "The Reform UK leader Nigel Farage has settled his debanking dispute with NatWest Group, nearly two years after the closure of his accounts sparked a chain of events culminating in the resignation of the lender's chief executive.",
        "url": "https://news.sky.com/story/farage-and-natwest-agree-to-settle-debanking-dispute-13336016",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-nigel-farage-natwest_6827889.png?20250213165715",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-26 09:42:00",
        "Headline": "The Reform UK leader has agreed to end his dispute with the high street banking giant nearly two years after the closure of his Coutts accounts led to the ousting of its former CEO, Sky News can exclusively reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The Reform UK leader Nigel Farage has settled his debanking dispute with NatWest Group, nearly two years after the closure of his accounts sparked a chain of events culminating in the resignation of the lender's chief executive. Sky News can reveal that Mr Farage and NatWest have agreed to resolve their row, with the bank thought to have agreed to pay him an unspecified sum in damages. In return, Mr Farage is understood to have withdrawn the threat of potential civil and criminal proceedings against NatWest over the issue. Money blog: Are you better or worse off after the spring statement? Nick Candy, the Reform treasurer, is said to have played a key role in resolving the dispute between the two sides during mediation talks held at a London law firm on Tuesday. Precise details of the settlement were unclear on Wednesday evening. Responding to an enquiry from Sky News, Mr Farage and NatWest said in a joint statement: \"NatWest Group and Nigel Farage MP are pleased to confirm that they have resolved and settled their dispute, and the bank has apologised to Mr Farage. \n                  Nigel Farage would turn UK into a 'Trump tribute act', Lib Dem leader Sir Ed Davey says\n                 \n                  Rupert Lowe says Reform leader Nigel Farage 'must never be PM' in latest attack amid leaks of WhatsApp messages\n                 \n                  Reform UK's Andrea Jenkyns says Nigel Farage's row with Rupert Lowe was 'clearly a big falling out' - but insists it will 'blow over'\n                 \"The terms of settlement are confidential.\" Mr Farage was originally expected to seek millions of pounds from the company, alleging that the debanking row had damaged his reputation. The furore which claimed the scalp of Dame Alison Rose, NatWest's former chief executive, in the summer of 2023 centred on whether the bank's Coutts subsidiary had decided to close Mr Farage's accounts for commercial or political reasons. NatWest initially claimed the motivation was commercial, before Mr Farage obtained internal evidence from the bank suggesting that his political views had been a pivotal factor in the decision. A subsequent - and inaccurate - BBC News report further exacerbated the controversy after it emerged that the journalist who wrote the story had sat next to Dame Alison at a charity dinner when the row was at its height. It sparked a firestorm under the then Conservative government, with Rishi Sunak and Jeremy Hunt, the prime minister and chancellor respectively, indicating to NatWest's board that they had lost faith in Dame Alison's ability to lead the bank. An emergency late-night board meeting led to Sir Howard Davies, who at the time was NatWest's chairman, concluding that Dame Alison would need to step down - despite her having publicly apologised to Mr Farage for the bank's treatment of him. Since then, both have been replaced, with the former Ocado and MasterCard chairman Rick Haythornthwaite replacing Sir Howard, and Paul Thwaite now in his second year as the company's chief executive. NatWest has since reported a surge in profitability and is now on the verge of returning to full private sector ownership. Earlier this week, it disclosed that the government now owns less than 4% of its shares, with the sale of its remaining holding expected by the early summer. Then known as Royal Bank of Scotland Group and run by Fred Goodwin, RBS was bailed out in 2008 with £45.5bn of taxpayers' money. Its journey back to full private ownership has been a meandering one, and taxpayers will ultimately have lost billions of pounds on the government's rescue deal. On Wednesday afternoon, shares in NatWest closed at 463.9p, giving the bank a market capitalisation of over £37bn. The stock has risen by more than 75% during the last year. The debanking row which claimed Dame Alison's job prompted the City watchdog to order a change to the treatment by financial institutions of so-called politically exposed persons (PEPs). Since his initial promise to turn the issue into a mainstream battle against the major UK banks, Mr Farage's status as one of Britain's most influential politicians has been cemented. He led Reform to a handful of seats at last year's general election, while his party finished in second place in scores of other constituencies. An opinion poll for Sky News by YouGov earlier this year put Reform ahead of both Labour and the Tories for the first time."
    },
    {
        "title": "Spring statement: Beth Rigby and Ed Conway on Rachel Reeves's changed plan",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/spring-statement-beth-rigby-and-ed-conway-on-rachel-reevess-changed-plan-13336162",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-bethrigby-edconway_6867617.jpg?20250326144509",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-26 14:45:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈 Chancellor Rachel Reeves has set out her plans for the UK economy during her spring statement in the House of Commons.  It came as the Office for Budget Responsibility (OBR) - which monitors the government's spending plans - unveiled its latest economic forecasts. Liz Bates is joined by Sky's political editor Beth Rigby, and economics and data editor Ed Conway, to pick through the detail and discuss why the chancellor changed her original plan. Producer: Natalie KtenaEditor: Philly Beaumont"
    },
    {
        "title": "Network Rail to set up property company to deliver 40,000 homes",
        "description": "Network Rail will set up a new property company to build 40,000 homes on its rail estate over the next decade in a drive to meet the government's housing target.",
        "url": "https://news.sky.com/story/network-rail-to-set-up-property-company-to-deliver-40000-homes-13336399",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-house-houses-home-estate_6796583.jpg?20250111100023",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-03-26 21:53:00",
        "Headline": "It is part of a drive to free up unused public land to help the government deliver its manifesto pledge to build 1.5m homes over this parliament. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Network Rail will set up a new property company to build 40,000 homes on its rail estate over the next decade in a drive to meet the government's housing target. The Treasury on Thursday announced the launch of a new cross-government taskforce to release surplus public land for housing, with unused Ministry of Defence (MOD) sites also to be among the first to be released. Announcing the plan, Chancellor Rachel Reeves said it would \"unlock the next generation of homeowners\", as the government strives to deliver 1.5 million new homes by the end of this parliament. It comes after the UK's fiscal watchdog estimated efforts to unblock the planning system will result in the highest levels of house building in 40 years, adding around £6.2bn to the UK's economy by 2029.  The figures were a rabbit out of the hat in the Office for Budget Responsibility's (OBR) economic forecast, which downgraded growth for this year as predicted, forcing Ms Reeves to announce a raft of spending cuts in order to stick to her fiscal rules. Speaking a day after Wednesday's spring statement, the chancellor described surplus government land as \"a huge untapped resource that could create opportunities for the next generation of homeowners\". She added: \"In contrast to the failed approach of the past, we are making the best use of public land to build the homes that families and our Armed Forces need, improving opportunities for homeownership and creating jobs across the country. \n                  OBR slashes UK growth forecast for 2025 but upgrades it for rest of parliament\n                 \n                  Spring statement 2025 key takeaways\n                 \n                  Chancellor's difficult decisions in spring statement could just be the start\n                 \"The OBR (Office for Budget Responsibility) has confirmed our planning reforms will result in housebuilding being at its highest in over 40 years - that won't just bring jobs and economic growth - but also will give families the homes that they deserve, delivering on our plan for change.\" Surplus MOD sites will pioneer the scheme, with the department to transfer land at Chetwynd Barracks in Nottinghamshire and Wyton Airfield in Cambridgeshire to Homes England for over 1,300 new properties. Deverell Barracks, near Ripon, North Yorkshire, will also be released to expedite the delivery of another 1,300 homes - with work to start within 12 months. Read More:Chancellor's difficult decisions could just be the startSee how your finances have changed after spring statementSpring statement 2025 key takeaways Defence Secretary John Healey has identified opportunities to build more than 100,000 homes on surplus military land in future, the Treasury added. Part of this will include a commitment to building new military family homes, following the return of Armed Forces housing to public ownership earlier this year. Network Rail plans to create its own development company, which will become operational later this year.  This will include as many as 5,000 homes at Newcastle Forth Yards; 1,500 homes at Manchester Mayfield station, and a mixed-use development in Nottingham which could yield 425 homes. It is not clear how many could be affordable housing. On Tuesday, the government announced £2bn for 18,000 new homes, saying it expects half of them to be affordable. But charities called for the \"vast majority\" to be for social rent as homelessness hits record highs across the country. The funding was described by the government as a \"down payment from the Treasury\" ahead of longer-term investment in social and affordable housing expected to be announced later in the year."
    },
    {
        "title": "University of Sussex to challenge £585,000 fine by regulator over transgender free speech case",
        "description": "The University of Sussex has been fined a record &#163;585,000 by the higher education regulator for failing to uphold freedom of speech.",
        "url": "https://news.sky.com/story/university-of-sussex-to-challenge-163585000-fine-by-regulator-over-transgender-free-speech-case-13335905",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-university-of-sussex_6867659.jpg?20250326152952",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-26 04:46:00",
        "Headline": "The Office for Students (OfS) said the university's trans and non-binary equality policy statement had \"a chilling effect\" on students and staff. But the university has called the investigation \"Kafkaesque\" and does not believe the ruling is lawful.",
        "Content": "The University of Sussex has been fined a record £585,000 by the higher education regulator for failing to uphold freedom of speech. The Office for Students (OfS) criticised the university's policy statement on transgender and non-binary equality, saying that it could lead to self-censorship. The policy required staff and students to \"positively represent trans people\" adding that \"transphobic propaganda [would] not be tolerated\". The university accused the regulator of pursuing a \"politically motivated\" inquiry and said it believes the findings were not lawful. It is seeking to challenge the ruling through a judicial review. Professor Sasha Roseneil, vice chancellor at the university, told Sky News the OfS investigation was \"quite a Kafkaesque experience\". She claimed the fine would \"paralyse university leaders\" and \"cause havoc across the UK higher education sector\". The OfS launched its investigation after campus protests calling for the dismissal of Professor Kathleen Stock. She left the university in 2021 after being accused of transphobia when she published a book questioning whether gender identity was more \"socially significant\" than biological sex. The OfS said the University of Sussex's policy had a \"chilling effect\" on the views of Prof Stock, who has been targeted by trans rights protesters. \"Professor Stock said that she became more cautious in her expression of gender critical views as a result of the policy,\" the OfS said in a statement. \"There were some views she did not feel able to express, and therefore teach, despite those views being lawful.\" Prof Roseneil, the vice chancellor at the university, said the OfS findings mean \"it makes it almost impossible for universities to have any policies that will control how people speak or relate to each other on campuses\". She added: \"It's free speech absolutism and puts free speech above all else. And the only thing that universities will effectively be able to do is regulate unlawful speech.\" Prof Roseneil explained she believed the university could only take action against antisemitic or anti-Muslim propaganda if it was actually illegal which is a \"very high bar\". But Arif Ahmed, the director for freedom of speech and academic freedom at the OfS, defended the fine. He told Sky News: \"If you have policies which are restricting what viewpoints you can express, what ideas can be expressed, then that's inconsistent with the whole aim of the university, with the aim of research and with the aim of a genuine humanistic education. \"So for all of those reasons, we think it's really important that the fine reflects the severity of the breaches that we saw, the damage that they caused,\" he said. Read more from Sky News:Growth forecasts for UK slashedHarry 'in shock' as he quits charityPolice update after newborn death The OfS was given the power in January to issue fines where freedom of speech was not upheld at a university. The penalty issued to the University of Sussex is the largest-ever issued by the regulator, with the institution saying it is 15 times larger than any other sanction imposed. Bridget Phillipson, the education secretary, said that \"free speech and academic freedom are non-negotiables in our universities\". \"If you go to university you must be prepared to have your views challenged, hear contrary opinions and be exposed to uncomfortable truths,\" she said. \"We are giving the OfS stronger powers on freedom of speech so students and academics are not muzzled by the chilling effect demonstrated in this case.\""
    },
    {
        "title": "Renee and Andrew MacRae: Police searching for bodies of mother and son murdered in 1976 examining item found in area linked to case",
        "description": "Police searching for the grave site of a mother and son murdered almost 50 years ago are examining an item found in an area linked to the historical case.",
        "url": "https://news.sky.com/story/renee-and-andrew-macrae-police-searching-for-bodies-of-mother-and-son-murdered-in-1976-examining-item-found-in-area-linked-to-case-13336061",
        "image_url": "https://e3.365dm.com/22/09/1920x1080/skynews-renee-andrew-macrae_5914409.jpg?20250326133907",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-03-26 14:33:00",
        "Headline": "Killer William MacDowell died in 2023 without revealing where he had disposed of Renee and Andrew MacRae's bodies.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n Police searching for the grave site of a mother and son murdered almost 50 years ago are examining an item found in an area linked to the historical case. Renee MacRae, 36, and her three-year-old son Andrew were murdered by William MacDowell after they disappeared from their home in Inverness in 1976. MacDowell evaded justice for decades but was found guilty of their murders in 2022 and handed a life sentence with at least 30 years behind bars. Married MacDowell, who had been having an affair with Mrs MacRae, died in February 2023 at the age of 81. He went to his grave without revealing where he had disposed of the bodies, but police are currently examining a potential breakthrough in the case. A Police Scotland spokesperson said: \"On Thursday 13 March 2025, officers attended the A9 near Dalmagarry after an item was recovered. \"The item is being examined and further enquiries are ongoing.\" \n                  Jaswinder Singh: Taxi driver jailed for sexually assaulting teenager on her way home from night out in Falkirk\n                 \n                  New Alba Party leader Kenny MacAskill vows to 'deliver dream of independence'\n                 \n                  Plans approved for hundreds of new homes at Glasgow's historic Govan Graving Docks\n                 Mrs MacRae and Andrew have been missing since 12 November 1976. The pair left their home in the Scottish Highlands, with Mrs MacRae's BMW car found later that day on fire in a layby on the A9 near Dalmagarry. MacDowell and mother-of-two Mrs MacRae had been having an affair for more than four years when she vanished. Mrs MacRae was estranged from her husband, Gordon, who was MacDowell's boss at Hugh MacRae Builders Limited. MacDowell denied any wrongdoing and was brought to court each day in a wheelchair by his wife Rosemary. However, jurors rejected his claim the murders were committed by somebody else and convicted him of the crimes. Judge Lord Armstrong described the murders as \"executions\". Read more from Sky News:Sarah Everard's parents call for tougher sentencesInside the online gangs where boys compete to be cruel Investigations have continued since 1976, with Dalmagarry Quarry searched again during a month-long excavation in 2004. In 2019, Leanach Quarry was excavated as part of the probe. And in August 2023, police said officers were looking into properties linked to MacDowell as well as other places he may have met Mrs MacRae during their relationship. Detective Chief Inspector Brian Geddes - who helped bring MacDowell to justice - said at the time: \"This case will never be considered resolved until we find Renee and Andrew.\""
    },
    {
        "title": "HIV deaths and infections will rise as a result of foreign aid cuts, study warns",
        "description": "HIV deaths and infections will rise as a result of cuts to foreign aid, a study has warned.",
        "url": "https://news.sky.com/story/hiv-deaths-and-infections-will-rise-as-a-result-of-foreign-aid-cuts-study-warns-13336152",
        "image_url": "https://e3.365dm.com/23/02/1920x1080/skynews-hiv-aids-test-tube_6064013.jpg?20230220153918",
        "type": "UK",
        "Author": "Samuel Osborne",
        "Date Published": "2025-03-26 14:17:00",
        "Headline": "Funding cuts could undo decades of progress and cause infections and deaths to surge to levels not seen since the early 2000s, researchers say.",
        "Content": "\n          News reporter\n              @samuelosborne93\n HIV deaths and infections will rise as a result of cuts to foreign aid, a study has warned. Funding cuts could undo decades of progress and cause infections and deaths to surge to levels not seen since the early 2000s, researchers said. They estimate there could be up to 10.8 million additional HIV infections in low and middle-income countries by 2030. Meanwhile, the number of HIV-related deaths in children and adults could reach 2.9 million by 2030. The study comes after Sir Keir Starmer's decision to cut overseas spending from 0.5% of gross national income to 0.3% over the next two years in order to fund defence commitments. The move led to the resignation of Anneliese Dodds as international development minister.  US President Donald Trump has ordered a pause in most US foreign aid spending and announced the country would withdraw from the World Health Organization. In a paper published in The Lancet HIV, researchers said international donors have contributed around 40% of all HIV funding in low and middle income countries since 2015. They said the UK, the US, France, Germany and the Netherlands account for over 90% of international funding. However, they point out that all the countries have recently announced plans to cut foreign aid, leading to a projected 24% reduction in international HIV funding by 2026. Through mathematical models the predominantly Australian-based researchers estimated there could be between 4.4 million and 10.8 million additional new HIV infections in low and middle income countries by 2030 and between 770,000 and 2.9 million HIV-related deaths in children and adults by the same year. Read more from Sky News:Bird flu strain 'has potential to become pandemic'Prince Harry quits charity after battle with chair \"The United States has historically been the largest contributor to global efforts to treat and prevent HIV, but the current cuts to Pepfar [the US President's Emergency Plan for AIDS Relief] and USAid-supported programmes have already disrupted access to essential HIV services including for antiretroviral therapy and HIV prevention and testing,\" said co-lead study author Dr Debra ten Brink of the Burnet Institute in Australia. \"Looking ahead, if other donor countries reduce funding, decades of progress to treat and prevent HIV could be unravelled. \"It is imperative to secure sustainable financing and avoid a resurgence of the HIV epidemic which could have devastating consequences, not just in regions such as sub-Saharan Africa, but globally.\" A spokesperson for the Foreign, Commonwealth and Development Office said: \"The UK provides significant funding to the global HIV response, supporting work to end AIDS-related deaths and prevent new HIV infections. \"We remain firmly committed to tackling global health challenges, not only because it is the right thing to do, but also because it will help us deliver on our Plan for Change in the UK by supporting global stability and growth.\""
    },
    {
        "title": "Crystal clear Trump wants to turn Putin from pariah to partner with lifting of some sanctions",
        "description": "This is a hugely significant moment. For the first time in more than three years, Washington is lifting sanctions on Moscow instead of imposing them.",
        "url": "https://news.sky.com/story/crystal-clear-trump-wants-to-turn-putin-from-pariah-to-partner-with-lifting-of-some-sanctions-13335966",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-vladimir-putin-donald-trump_6867226.jpg?20250326082512",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-03-26 08:01:00",
        "Headline": "The US is talking about easing a handful of restrictions so that Russia's agricultural and fertiliser exports can return to global markets.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n This is a hugely significant moment. For the first time in more than three years, Washington is lifting sanctions on Moscow instead of imposing them. It's the most tangible evidence yet of a US-Russia rapprochement, and a crystal clear signal of Donald Trump's intentions to turn Vladimir Putin the pariah into Putin the partner. For now, they're only talking about easing a handful of restrictions so that Russia's agricultural and fertiliser exports can return to global markets. Ukraine war latest: Russia launches drone attacks  It's important to point out that Russian food and fertiliser have, in fact, always been exempt from Western sanctions, but exports were disrupted by Russian banks' exclusion from the SWIFT global payments system. It has meant higher fees and delays in payments, even when it comes to cross-border trade with friendly nations. That's why Moscow wants sanctions to be lifted on Rosselkhozbank - the state-owned Russian agriculture bank - and for it to be reconnected to SWIFT. One could argue that it's just one brick in what is still a whole wall of sanctions surrounding Russia. But its removal will nevertheless be massively symbolic. Ukraine's Western allies were in lockstep when they built that wall - now its powerful supporter is starting the process of bringing it down. What's more, there'll be fears that Moscow could abuse America's charity here, particularly when it comes to one of the Kremlin's other demands - lifting restrictions on the supply of agricultural machinery to Russia. Read more from Sky News:Trump urged to fire defence secretary over war plans leakDrones shot down over Black Sea, Russia claims Restrictions were imposed on agricultural machinery due to some components being classified as 'dual-use' goods, which could potentially aid Russia's war machine. What's to say these fears won't be realised? That parts meant for tractors and harvesters suddenly find their way into weapon production? Washington might be happy to take Moscow's word for it, but Kyiv certainly won't be. Perhaps the most galling thing for Ukraine and its European allies, however, will be that Mr Putin appears to have secured this without giving up very much at all.  Yes, Russia has agreed to a maritime ceasefire. But it's a long way short of a full ceasefire, and it's something that was first agreed back in July 2022 with the Black Sea Grain Initiative. Russia withdrew from that deal in 2023, unhappy at the obstacles facing its food and fertiliser exports - sound familiar? Since then, attacks in the Black Sea have dropped off significantly. In fact, Ukrainian grain exports are pretty much back at pre-war levels already. So, a maritime ceasefire may not actually make that much of a difference to the conflict itself. The bigger impact will be in Washington and Moscow. For Mr Trump, it's something to show off - proof that he's taken a step closer to peace. For Mr Putin, it's Russia's first step coming back in from the cold."
    },
    {
        "title": "US appears to be significantly increasing its military presence in the Middle East",
        "description": "The United States appears to be significantly increasing its military presence in the Middle East with the deployment of highly sophisticated aircraft and a second aircraft carrier to the region.",
        "url": "https://news.sky.com/story/us-appears-to-be-significantly-increasing-its-military-presence-in-the-middle-east-13336089",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-b-2-spirit-stealth-bomber_6867452.jpg?20250326121502",
        "type": "World",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-03-26 12:01:00",
        "Headline": "The US has extended the deployment of the USS Harry S Truman carrier strike group in the Red Sea, while another is heading to the Middle East. At least five B-2 stealth bombers have also been deployed to Diego Garcia, a British military base used by the US in the Indian Ocean.",
        "Content": "\n          Middle East correspondent\n              @AliBunkallSKY\n The United States appears to be significantly increasing its military presence in the Middle East with the deployment of highly sophisticated aircraft and a second aircraft carrier to the region. In recent days, at least five B-2 stealth bombers have deployed to Diego Garcia, a British military base used by the US in the Indian Ocean. More are reportedly en route. Seven C17 aircraft have also been tracked landing on the remote atoll, suggesting transportation of equipment, personnel and supplies, and refuelling aircraft have been repositioned to strategic locations. The Pentagon recently ordered the USS Harry S Truman carrier strike group to extend its deployment in the Red Sea by a month, and a second strike group, led by the USS Carl Vinson aircraft carrier, is heading for the Middle East. Both groups have support ships, including destroyers, as part of the group. It is an unusual surge in military assets and an indication, perhaps, that the US is planning heavy strikes on the Houthis in Yemen and possibly looking to send a strong message to Iran. The Houthis, an Islamist group that controls a large part of Yemen, including the capital Sana'a, have repeatedly attacked Red Sea shipping and Israel during the war in Gaza. Those attacks stopped while the ceasefire was in force but have restarted following a resumption of Israeli military operations in Gaza. The Houthis have vowed to strike Israel's Ben Gurion airport and have fired ballistic missiles towards Israel on an almost daily basis in recent weeks, triggering air raid sirens in Tel Aviv and Jerusalem. They claimed to have launched drones at Israel on Tuesday night, but the Israeli military hasn't confirmed that. Read more:Yazidi women still enslaved in ISIS detention campsWhat happened to the Israel-Hamas ceasefire? The Trump administration has launched attacks against the Houthis to restore freedom of shipping in the Red Sea, a crucial waterway for global commerce as it's linked to the Mediterranean Sea via the Suez Canal. The first wave of those attacks was the subject of a major security breach when a journalist was mistakenly included in discussions between senior US government personnel on the messaging app Signal. US defence secretary Pete Hegseth has promised to continue striking the Houthis for as long as it takes, and President Trump has warned Iran he might be forced to take military action against their nuclear facilities if Tehran doesn't agree to talks."
    },
    {
        "title": "HIV deaths and infections will rise as a result of foreign aid cuts, study warns",
        "description": "HIV deaths and infections will rise as a result of cuts to foreign aid, a study has warned.",
        "url": "https://news.sky.com/story/hiv-deaths-and-infections-will-rise-as-a-result-of-foreign-aid-cuts-study-warns-13336152",
        "image_url": "https://e3.365dm.com/23/02/1920x1080/skynews-hiv-aids-test-tube_6064013.jpg?20230220153918",
        "type": "World",
        "Author": "Samuel Osborne",
        "Date Published": "2025-03-26 14:17:00",
        "Headline": "Funding cuts could undo decades of progress and cause infections and deaths to surge to levels not seen since the early 2000s, researchers say.",
        "Content": "\n          News reporter\n              @samuelosborne93\n HIV deaths and infections will rise as a result of cuts to foreign aid, a study has warned. Funding cuts could undo decades of progress and cause infections and deaths to surge to levels not seen since the early 2000s, researchers said. They estimate there could be up to 10.8 million additional HIV infections in low and middle-income countries by 2030. Meanwhile, the number of HIV-related deaths in children and adults could reach 2.9 million by 2030. The study comes after Sir Keir Starmer's decision to cut overseas spending from 0.5% of gross national income to 0.3% over the next two years in order to fund defence commitments. The move led to the resignation of Anneliese Dodds as international development minister.  US President Donald Trump has ordered a pause in most US foreign aid spending and announced the country would withdraw from the World Health Organization. In a paper published in The Lancet HIV, researchers said international donors have contributed around 40% of all HIV funding in low and middle income countries since 2015. They said the UK, the US, France, Germany and the Netherlands account for over 90% of international funding. However, they point out that all the countries have recently announced plans to cut foreign aid, leading to a projected 24% reduction in international HIV funding by 2026. Through mathematical models the predominantly Australian-based researchers estimated there could be between 4.4 million and 10.8 million additional new HIV infections in low and middle income countries by 2030 and between 770,000 and 2.9 million HIV-related deaths in children and adults by the same year. Read more from Sky News:Bird flu strain 'has potential to become pandemic'Prince Harry quits charity after battle with chair \"The United States has historically been the largest contributor to global efforts to treat and prevent HIV, but the current cuts to Pepfar [the US President's Emergency Plan for AIDS Relief] and USAid-supported programmes have already disrupted access to essential HIV services including for antiretroviral therapy and HIV prevention and testing,\" said co-lead study author Dr Debra ten Brink of the Burnet Institute in Australia. \"Looking ahead, if other donor countries reduce funding, decades of progress to treat and prevent HIV could be unravelled. \"It is imperative to secure sustainable financing and avoid a resurgence of the HIV epidemic which could have devastating consequences, not just in regions such as sub-Saharan Africa, but globally.\" A spokesperson for the Foreign, Commonwealth and Development Office said: \"The UK provides significant funding to the global HIV response, supporting work to end AIDS-related deaths and prevent new HIV infections. \"We remain firmly committed to tackling global health challenges, not only because it is the right thing to do, but also because it will help us deliver on our Plan for Change in the UK by supporting global stability and growth.\""
    },
    {
        "title": "Sudan army retakes Khartoum after nearly two years of fighting, says general",
        "description": "Sudan's army chief has declared Khartoum is \"free\" and that his forces have retaken the capital after nearly two years of fighting.",
        "url": "https://news.sky.com/story/sudanese-army-retakes-capital-khartoum-says-military-chief-after-nearly-two-years-of-fighting-13336219",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-sudan-abdel-fattah-al-burhan_6867860.jpg?20250326181941",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-26 17:44:00",
        "Headline": "It's estimated at least 28,000 people have been killed during the conflict, though the number is likely far higher. The UN says it's the world's largest humanitarian crisis.",
        "Content": "Sudan's army chief has declared Khartoum is \"free\" and that his forces have retaken the capital after nearly two years of fighting. The Sudanese Armed Forces (SAF) have been battling to oust the Rapid Support Forces (RSF) from a last foothold in the city, although the war looks far from over. In videos on social media, General Abdel Fattah al Burhan is seen walking with troops through the presidential palace, which was seized last week​​​​​​ in an important symbolic advance. \"Khartoum is now free. It's over. Khartoum is free. Free. Free,\" he can be heard telling soldiers. The Sudanese Armed Forces said they had also seized a key RSF base and recaptured the capital's airport after consolidating gains in Khartoum in recent days. The general kissed the ground and raised his fist after landing at the airport in a helicopter on Wednesday. The army also released drone footage of people walking across a dam, which it claimed showed RSF forces retreating across the Nile. \n                  Sudan's recaptured palace is a significant sign of return to order\n                 \n                  Sudan's military retakes more key government buildings in capital as it consolidates gains\n                 \n                  Sudan's military says it has seized control of presidential palace \n                 The war began in April 2023 as the country was attempting a democratic transition and has split the nation into rival zones of control. It's estimated at least 28,000 people have been killed during the conflict, though the number is likely far higher. The fighting has also caused what the UN calls the world's largest humanitarian crisis. While the SAF has made recent gains in central Sudan, the RSF remains deeply embedded in western Sudan.  When fighting broke out, Sudan's army had better resources, including air power, but the RSF was more deeply embedded in Khartoum and was able to hold much of the capital in an initial, devastating burst of warfare. Famine and disease is blighting several areas of Sudan and UN data suggests 12.8 million people have been displaced, more than a fifth of the population. Five million of those displaced are children, according to UNICEF. However, the army's control of the airport in Khartoum could now allow aid groups to fly in more supplies. Read more:Eyewitness: Waiting and praying for victory after two years of warSky News goes inside liberated district in war-torn capitalAnalysis: Sudan's capital left ravaged and ruined  The army and RSF had at one point been in a fragile partnership, jointly staging a coup in 2021 and also fought on the same side for years in the western state of Darfur. But the groups ended up turning against each other in a struggle for power."
    },
    {
        "title": "Former Brazil president Jair Bolsonaro to stand trial over alleged coup plot",
        "description": "Brazil's supreme court has decided to put former president Jair Bolsonaro on trial over an alleged coup plot.",
        "url": "https://news.sky.com/story/former-brazil-president-jair-bolsonaro-to-stand-trial-over-alleged-coup-plot-13336189",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-bolsonaro-brazil_6867716.jpg?20250326162712",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-26 15:49:00",
        "Headline": "The far-right politician, who denies any wrongdoing, could face decades in prison if convicted.",
        "Content": "Brazil's supreme court has decided to put former president Jair Bolsonaro on trial over an alleged coup plot. All five judges accepted the charges against him, related to an effort to cling to power after his election defeat in 2022. Brazil's prosecutor general Paulo Gonet charged Mr Bolsonaro and 33 others last month. The plans allegedly included poisoning his successor, current President Luiz Inacio Lula da Silva, and killing a Supreme Court judge. The former army captain, who was president from January 2019 to December 2022, has repeatedly denied wrongdoing and says he is being persecuted. Writing on X, he called it a \"political trial\" and an attempt to stop him standing in the 2026 general election. Mr Bolsonaro, 70, claimed the process was \"conducted in a partial, biased, and openly unfair manner by a completely compromised and suspicious rapporteur, whose objective is to take revenge, arresting me and removing me from the ballot box\". Coup charges carry a sentence of up to 12 years in prison. Combined with other potential crimes, he could face decades in prison. The judges said seven of Mr Bolsonaro's close allies should also stand trial on multiple counts. These are: Trying to stage a coup, participating in an armed criminal gang, attempted violent abolition of the rule of law, damage characterised by violence, and a serious threat against the state's assets. Casting his vote to accept the charges, Justice Flavio Dino said \"coups kill… It doesn't matter if it happens today, the following month, or a few years later\". Read more on Sky News:Trump officials' war plans group chat - details revealedRussia attacks Ukrainian port city amid ceasefire talks The prosecutor general said on Tuesday that those facing charges wanted to keep the ex-president in power \"at all costs\" and accelerated plans once Mr Bolsonaro lost the election. Mr Gonet said the coup did not go ahead at the eleventh hour as Mr Bolsonaro failed to gain the support of the army's commander. He said: \"Frustration overwhelmed the members of the criminal organisation who, however, did not give up on the violent seizure of power, not even after the elected president of the republic was sworn in.\" He was alluding to a riot by the far-right politician's supporters on 8 January 2023 - a week after President Lula took power - in which the presidential palace, the supreme court, and congress were broken into and damaged. In court, Justice de Moraes played the other judges a video from that day. He said: \"We had a very violent coup attempt. A savage violence, in total incivility, with the request for military intervention in the coup d'etat.\" The court will also vote on claims against Mr Bolsonaro's former running mate, ex-justice minister and others. Mr Bolsonaro has already been banned by Brazil's top electoral court from elections until 2030 over abuse of power and casting unfounded doubts on the country's electronic voting system."
    },
    {
        "title": "Serbia: Calls for investigation into claims illegal sonic weapon used against peaceful protesters",
        "description": "Pressure is growing on the Serbian government over reports security forces used a prohibited sonic weapon against a peaceful crowd during an anti-corruption rally.",
        "url": "https://news.sky.com/story/serbia-calls-for-investigation-into-claims-illegal-sonic-weapon-used-against-peaceful-protesters-13335920",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-serbia-belgrade-protest_6867123.jpg?20250326100144",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-26 06:04:00",
        "Headline": "Footage shows protesters at a mass anti-corruption rally in Belgrade suddenly start running away in panic and a swooshing sound can be heard.",
        "Content": " Pressure is growing on the Serbian government over reports security forces used a prohibited sonic weapon against a peaceful crowd during an anti-corruption rally. More than half a million people have signed a petition calling for an independent investigation - with new footage adding to the mounting speculation surrounding the dispersal tactics used during the 15 March demonstration attended by tens of thousands of people in the capital Belgrade. In the video footage, protesters can be seen holding up their lit mobile phones in silence - when suddenly there is a swooshing sound and the crowds start running away in panic. The alleged use of the sonic weapon occurred during a 15-minute period of silence to honour the victims of the Novi Sad disaster, when a concrete canopy at a railway station collapsed, killing 16 people. A wave of demonstrations by students and opponents of the government have followed November's tragedy, which many Serbians blame on corruption and mismanagement. Sonic weapons, which are illegal in Serbia, emit sound waves that can trigger physical and psychological effects, including dizziness, severe headaches, sharp ear pain, disorientation, eardrum ruptures, or even irreversible hearing damage. Serbia's populist president, Aleksandar Vucic, has dismissed the allegations that a sonic weapon was used at the peaceful protest as \"lies and fabrications\". 'Like a sound from hell' Ilic Sunderic, who was at the rally said it was \"quiet and peaceful and then we heard something we could not see… like a sound rolling toward us\". It was, she said, \"a subdued sound lasting only 2-3 seconds but very unusual and very frightening, like a sound from hell.\" \"I have been going to protests for 30 years but I've never heard anything like this,\" she added. Hundreds of others have offered similar accounts to hers, and officials have issued often contradictory denials, prompting calls for answers to explain what caused the sudden commotion if not a sonic device. Pictures from the Belgrade protest show what appears to be an LRAD 450XL, whose California-based manufacturer, Genasys, said on X that the evidence it had seen \"does not support the use of an LRAD\" at the demonstration. The photos showed nothing more than \"loudspeakers\" that also are available on eBay, Serbia's interior minister Ivica Dacic said. The rectangular devices, purchased from a US supplier in 2021, serve to emit warnings to the crowds in case of major trouble, he said. \"Serbian police have never, including March 15, used any illegal or unallowed device that is not envisaged by the law, including the device known as a sound cannon,\" said Mr Dacic. \"Police only use sound devices for warnings.\" 'Biblical' panic and stampede Student Sasa Cvrkovic, 23, likened the sound to a \"jet\" flying past. He said it created panic and a brief stampede, adding that a \"young man next to me broke his leg\". He said he felt nauseous the day after, while Ms Sunderic said she felt pressure in her head and ears. Thomas Withington, an expert in electronic warfare at the Royal United Services Institute (RUSI) thinktank, described the protesters as \"reacting en masse to something that is making them feel deeply unsettled or deeply uncomfortable\". \"An almost kind of biblical passing of a huge number of people in a very panicked rush,\" he said. Many who were in the crowd later complained of headaches, confusion, ear pressure, or nausea. Read more:'Worst ever' South Korea wildfiresDrones 'shot down over Black Sea'Trump urged to fire defence chief Hundreds of thousands of people have signed an online petition organised by the Serbian opposition Move-Change movement asking the United Nations, the Council of Europe, and the Organisation for Security and Cooperation in Europe for an independent investigation. Several Serbian rights groups said on Tuesday they have taken the issue to the European Court of Human Rights, after collating more than 4,000 statements from people who complained of various physical and psychological problems after the incident."
    },
    {
        "title": "Vehicle found in hunt for American soldiers missing in Lithuania, US army says",
        "description": "A vehicle has been found in the hunt for four American soldiers who went missing while training in Lithuania, the US Army said on Wednesday.",
        "url": "https://news.sky.com/story/vehicle-found-in-hunt-for-american-soldiers-missing-in-lithuania-us-army-says-13336292",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-us-army-arny_6867975.jpg?20250326204236",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-26 19:16:00",
        "Headline": "Their vehicle was discovered submerged in water and searches remain ongoing for their bodies.",
        "Content": "A vehicle has been found in the hunt for four American soldiers who went missing while training in Lithuania, the US Army said on Wednesday. The search for the missing soldiers - who were at the Pabrade training ground near the Lithuanian border with Belarus - is ongoing. Battalions of US soldiers have been based in the military camp since 2019, in rotations. \"The soldiers, all from 1st Brigade, 3rd Infantry Division, were conducting scheduled tactical training at the time of the incident,\" the US army said in a statement. \"The M88 Hercules armoured recovery vehicle the four missing US Soldiers were operating during a training exercise, has been located in Lithuania.\" An \"intensive\" rescue operation is currently under way, Lithuania's military wrote on X. Earlier, NATO Secretary General Mark Rutte said he had received word of the deaths of the soldiers but a NATO spokesperson later clarified his comments. They said: \"The secretary general was referring to news reports that had just emerged. He did not confirm the death of the four US soldiers, but noted that the details remain unconfirmed.\" Lithuanian Defence Minister Dovile Sakaliene, who visited the training site late on Wednesday, said no bodies had beenfound. \"That's why it would be wrong to say that the soldiers are dead,\" she said. US and Lithuanian armies said the search was expected to continue through the night. Lithuanian Chief of Defence Raimundas Vaiksnoras said the rescue team are investigating how fast the swampy location could be drained. He said: \"You all know how important is the presence of US troops in Lithuania. Their soldiers are like our soldiers to us. So we spare no effort to find them.\""
    },
    {
        "title": "JD Vance announces trip to Greenland and accuses Denmark of ignoring island 'for far too long'",
        "description": "US vice president JD Vance will fly to Greenland this week, after accusing American and Danish leaders of ignoring the island \"for far too long\".",
        "url": "https://news.sky.com/story/jd-vance-announces-trip-to-greenland-and-accuses-denmark-of-ignoring-island-for-far-too-long-13335925",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-greenland-waghorn_6852706.jpg?20250311001327",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-26 06:15:00",
        "Headline": "National security adviser Mike Waltz is also set to visit Greenland, but his name has reportedly been omitted from the latest announcement. It is unclear if he is still going, or whether his travel plans were altered after the leak.",
        "Content": " US vice president JD Vance will fly to Greenland this week, after accusing American and Danish leaders of ignoring the island \"for far too long\". He will join second lady Usha Vance and energy secretary Chris Wright as part of a delegation to visit the Pituffik space base, the US military base in Greenland. Originally, Ms Vance had planned to attend a popular dog-sled race in Greenland - a move Denmark's prime minister Mette Frederiksen criticised as putting \"unacceptable pressure\" on the semi-autonomous Danish territory. Announcing the change in destination to the US base, Mr Vance said he didn't want his wife to \"have all that fun by herself,\" before adding that \"a lot of countries have threatened\" the world's largest island. Mr Vance then said: \"We're going to check out how things are going there. \"Speaking for President Trump, we want to reinvigorate the security of the people of Greenland because we think it's important to protecting the security of the entire world.\" The vice president also claimed US and Danish leaders had \"ignored Greenland for far too long\" and that \"we think we can take things in a different direction\". Since US President Donald Trump took office, he has regularly floated the idea of Greenland becoming part of the United States. Greenland's strategic location, at the northeastern tip of the North American continent and as the gateway to the Arctic Ocean. as well as its rich mineral resources, would benefit the US. It also lies along the shortest route from Europe to North America, and is vital for the US ballistic missile warning system. Read more: Why does Trump want to take over Greenland?  The governments of both Greenland and Denmark have voiced opposition to such a move. Greenland Prime Minister Mute Egede told the newspaper Sermitsiaq his nation has tried \"all diplomatic and democratic options\", but Mr Trump's mission is \"to own and control Greenland\". On Tuesday, Danish Prime Minister Mette Frederiksen accused the US of putting \"unacceptable pressure\" on Greenland. Waltz omitted from announcement White House national security adviser Mike Waltz was originally set to take part in the Greenland visit. However, his name was omitted from the latest announcement, according to the Associated Press (AP). 👉 Follow Trump 100 on your podcast app 👈 It comes after a US journalist was added to a Signal group chat where US officials discussed airstrikes on Yemen's Iran-backed Houthis. It is unclear if he is still going, or whether his travel plans were altered after the leak. Read more from Sky News:Trump urged to fire defence secretaryDOGE staff getting daily death threats, says Musk Speaking on Tuesday evening, Mr Waltz said he took responsibility for creating the group, adding: \"I built the group. So look, that's the part that we have to figure out... \"Embarrassing? Yes, but Pete [Hegseth, US defence secretary] and I are veterans.\" It remains unclear why the officials chose to chat via Signal instead of secure government channels typically used for sensitive discussions. On Tuesday, Mr Trump told Sky News' US partner, NBC News, that the lapse \"turned out not to be a serious one\" and expressed his continued support for Mr Waltz."
    },
    {
        "title": "Anti-Hamas chants heard at rare protest in Gaza",
        "description": "Anti-Hamas chants have been heard in a rare sign of dissent in northern Gaza during a protest in which hundreds of Palestinians called for an end to the war.",
        "url": "https://news.sky.com/story/anti-hamas-chants-heard-at-rare-protest-in-gaza-13336073",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-palestinians-northern-gaza_6867427.jpg?20250326115630",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-26 11:28:00",
        "Headline": "Groups of protesters demand an end to the conflict in Gaza in a rare public show of opposition to Hamas, while the militant group claims the situation is being exploited by \"suspicious political agendas\".",
        "Content": " Anti-Hamas chants have been heard in a rare sign of dissent in northern Gaza during a protest in which hundreds of Palestinians called for an end to the war. Footage and images shared on social media showed people chanting, \"Hamas out\", as they marched down a street in Beit Lahiya surrounded by buildings damaged in the conflict. People were also shown chanting, \"We don't want war\", while holding banners saying, \"We are dying\" and 'Stop the war\". One witness, who did not want to be named, said: \"It was a spontaneous rally against the war because people are tired and they have no place to go. \"Many chanted slogans against Hamas, not all people, but many, saying 'out Hamas'. \"People are exhausted and no one should blame them.\" Middle East correspondent The protests in Gaza are potentially significant, but too complicated to be portrayed as being simply anti-Hamas demonstrations. Whilst some of the protestors have been seen openly calling for Hamas to go, others are calling for an end to the killing of women and children by Israel, and some are angry at inflated food prices because of the ongoing humanitarian blockade. It is a mixed picture.  Although they remain small, and only in a handful of districts for now, any dissent against Hamas, which has ruled Gaza since 2006, is unusual and therefore notable. It suits Israel to claim this is a sign that military pressure against Hamas is working, and to a limited extent that might have some merit, but Hamas's rivals, Fatah, also have reason to exaggerate anti-Hamas feeling amongst Palestinians. Further complicating things, many Palestinians have historically opposed Hamas as a governing body, but at the same time supported them as a resistance to Israeli occupation. There are some external indicators that suggest ongoing moves to replace Hamas in Gaza – an Israeli red line if the war is to end. There have been reports, as yet unconfirmed, that Jordan and other Arab countries have been examining plans to relocate up to three thousand Hamas leaders and fighters, although there is no suggestion where they would go. The White House, and Israel, have criticised a joint Arab plan for the future of Gaza because it doesn't include any suggestion to replace Hamas, so there is an incentive for that to be addressed if the plan is to be adopted. If the protests grow and spread, then there is a dangerous risk of intra-Palestinian violence in Gaza, and I would expect a number of players – Israel, the Palestinian Authority, Arab governments – to seize the energy of opposition as they pursue their own competing agendas for the future of Gaza. Videos and photographs shared on social media were said to have been taken on 25 March. Senior Hamas official Basem Naim said people had the right to protest at the suffering inflicted by the war. But he denounced what he claimed were \"suspicious political agendas\" exploiting the situation. He said: \"Where are they from, what is happening in the West Bank? \"Why don't they protest against the aggression there or allow people to take to the streets to denounce this aggression?\" The comments, reflecting tensions among Palestinian factions over the future of Gaza, came several hours after the rival Fatah movement called on Hamas to \"respond to the call of the Palestinian people in the Gaza Strip\". Fatah leads the Palestinian Authority in the occupied West Bank. Prime Minister Benjamin Netanyahu said the protest showed Israel's decision to renew its offensive was working in Gaza, where Hamas police - the group's enforcers - have again disappeared after emerging during a ceasefire. Read more:What happened to the Gaza-Israel ceasefire?Israeli strike hits key hospital in Gaza  More than 50,000 Palestinians have been killed by the Israeli campaign in Gaza, according to the territory's health ministry. The Hamas-run authority does not distinguish between civilians and combatants in its count, but has previously said more than half of those killed in the conflict were women and children. The war began when Hamas militants carried out a cross-border raid into southern Israel on 7 October 2023, killing 1,200 people and capturing around 250 hostages. Israel responded with an air and ground offensive in Gaza."
    },
    {
        "title": "Surgeons carry out world's first pig-to-human liver transplant",
        "description": "Surgeons have carried out the world's first liver transplant from a pig into a human recipient.",
        "url": "https://news.sky.com/story/surgeons-carry-out-worlds-first-pig-to-human-liver-transplant-13336159",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-pig-farm_6867618.jpg?20250326144548",
        "type": "World",
        "Author": "Thomas Moore",
        "Date Published": "2025-03-26 14:34:00",
        "Headline": "The operation used a liver from a pig that had been genetically modified to reduce the chance of the organ being rejected by a human immune system.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n Surgeons have carried out the world's first liver transplant from a pig into a human recipient. The operation, carried out in China, used a liver from a pig that had been genetically modified to reduce the chance of the organ being rejected by a human immune system. The organ successfully produced bile and essential proteins in a patient who was brain-dead, but still alive. Relatives asked for the experiment to be stopped after 10 days, but the researchers say the organ could have functioned for longer. They hailed the transplant as a \"great achievement\", and European experts have called it a significant milestone that could save lives in future. The surgical team, from Xijing Hospital in Xi'an, took the liver from a Bama miniature pig that had six key genes modified to improve compatibility of an organ when transplanted into a human. According to results published in the science journal Nature, the liver functioned normally, with good blood flow and no signs of rejection. Professor Lin Wang, who led the research team, said the transplant was carried out with full ethical approval from medical authorities and consent from the patient's family. \"Surgery was really successful,\" he told a news conference. \"The liver from the pig functioned very well in the human body. So it's a great achievement.\" Read more from Sky News:Bird flu strain 'has potential to become pandemic'Prince Harry quits charity after battle with chair Hearts and kidneys from genetically modified pigs have already been transplanted into a handful of living patients. Most died within weeks of the operation, but two people who had pig kidneys are understood to have survived in the United States. Professor Wang said a liver transplant from a pig is far more complicated. \"A heart is just a pump, the kidney only produces urine,\" he said. \"But the liver has many functions, so this is a huge obstacle for us to solve.\" Several research groups are experimenting with pigs raised in super-clean facilities for organ donation. Pigs are used because their organs are similar in size and structure to those in a human. But key genes need to be modified to reduce the risk of them being attacked by a patient's immune system after transplantation. The Chinese researchers propose using pig organs as a temporary support, either to take the pressure off a patient's liver so it can regenerate, or to give more time to find a permanent organ from a suitable human donor. There are currently more than 600 patients on the waiting list for a liver transplant in the UK. The average wait for an organ from a deceased donor is three to four months. Ivan Fernandez Vega, professor of pathological anatomy at the University of Oviedo in Spain, described the experiment as an important \"milestone\". \"The clinical implications are highly relevant, as optimising this approach could expand the pool of available organs and save lives in liver emergencies,\" he said. The Chinese team is planning to repeat the experiment in more brain-dead patients, for longer periods, before progressing to the first clinical transplants in living people."
    },
    {
        "title": "President Trump announces 25% tariff on all imported cars ahead of 'liberation day'",
        "description": "US President Donald Trump has announced a new 25% tariff on all imported cars.",
        "url": "https://news.sky.com/story/president-trump-announces-25-tariff-on-all-imported-cars-ahead-of-liberation-day-13336389",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-united-states_6868041.jpg?20250326222222",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-26 21:45:00",
        "Headline": "As Washington continued to reel from the fallout over the Signal security breach, Donald Trump instead tried to talk about more tariffs he was implementing.",
        "Content": " US President Donald Trump has announced a new 25% tariff on all imported cars. Signing an executive order, Mr Trump said the tax would kick in on 2 April - what he has called \"liberation day\". This is when all his retaliatory import tariffs are supposed to take effect, but they have been delayed before. It comes amid the continued fallout from the Signalgate security breach in Washington. What was said in the Signal chat?  The move ratchets up the global trade war Mr Trump himself kicked off. Speaking late on Wednesday, Mr Trump said the proposal: \"Will continue to spur growth. We'll effectively be charging a 25% tariff.\" However, the tariffs could be complicated as even American car makers source components from around the world - meaning they could also face higher costs and lower sales. The announcement also drew swift condemnation from the European Union and from Canadian Prime Minister Mark Carney, who called it a \"direct attack\" on Canadian workers. During his second term, Mr Trump has used tariffs frequently as a trade weapon. He cited plans from South Korean car maker Hyundai to build a $5.8bn (£4.5bn) steel plant in Louisiana as evidence the economic measures would bring back manufacturing jobs. Despite Mr Trump's optimism, shares in General Motors fell by about 3% in Wednesday afternoon trading. Ford's stock was up slightly, but shares in Stellantis, the owner of Jeep and Chrysler, dropped nearly 4%. Even American and foreign firms already with domestic plants still rely on Canada, Mexico and other countries for parts and finished vehicles - meaning prices could increase and sales decline as new factories take time to build. Tariffs are a key part of Mr Trump's efforts to reshape global trade relations. He plans to impose what he calls \"reciprocal\" taxes on 2 April that would match tariffs and sales taxes levied by other nations. He has already placed a 20% tax on all imports from China. Similarly, he placed 25% tariffs on Mexico and Canada, with a lower 10% tariff on Canadian energy products. Sky News understands the UK government is engaging with the US on a trade deal and remains hopeful an agreement could be made before the tariffs come into force, but may retaliate if necessary. Signal security breach As Mr Trump was keen to talk up his tariffs, the rest of Washington was discussing the security breach that rocked the Capitol. Read more:Atlantic publishes more texts from group chatTrump White House rolls out playbook responseJD Vance announces trip to Greenland In a group called \"Houthi PC small group\", specific details of a US attack on Houthis were shared with intelligence director Tulsi Gabbard, national security adviser Mike Waltz, vice president JD Vance and more. However, a senior journalist for the magazine The Atlantic, Jeffrey Goldberg, was also somehow added to the Signal group chat. Goldberg published a story first on Monday about the incident. The White House had sought to downplay the leak of the messages, saying no classified information had been disclosed. Goldberg then published a follow-up story releasing the messages themselves earlier on Wednesday. Concerns have been raised about the security of some of the most important members of the US administration using a commercial app. During a hearing in front of Congress, some members outlined feared security issues with Signal."
    },
    {
        "title": "Atlantic magazine publishes more texts shared on group chat about war plans",
        "description": "The Atlantic magazine has published what it said was a timeline of war plans shared by the US defence secretary in a group chat that mistakenly included a journalist.",
        "url": "https://news.sky.com/story/atlantic-magazine-publishes-more-texts-shared-on-group-chat-about-war-plans-13336110",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump_6840647.jpg?20250226192559",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-26 12:36:00",
        "Headline": "The latest revelations come after the White House had said no classified information had been disclosed in the group chat among top US officials that inadvertently also included a journalist.",
        "Content": "The Atlantic magazine has published what it said was a timeline of war plans shared by the US defence secretary in a group chat that mistakenly included a journalist. The latest revelation comes after the White House had sought to downplay the leak of information about plans to strike Houthi rebels in Yemen - saying no classified information had been disclosed. The plan was shared in a group chat on messaging app Signal that included senior government officials, including vice president JD Vance and defence secretary Pete Hegseth, as well as a journalist, The Atlantic editor-in-chief Jeffrey Goldberg. He was added to the group chat, called \"Houthi PC small group\", on 13 March. The strikes eventually took place on 15 March. US security breach latest updates  In its latest article, Here Are the Attack Plans That Trump's Advisers Shared on Signal, The Atlantic said on the day of the attack \"the discussion veered toward the operational\". It quoted Mr Hegseth as posting operational details of the plan, including weapon packages, targets and timing. At 11.44am eastern time, the defence secretary text, in caps: \"TEAM UPDATE:\" He added: \"TIME NOW (1144et): Weather is FAVORABLE. Just CONFIRMED w/CENTCOM we are a GO for mission launch\" - referring to Central Command, the US military's command for the Middle East. Mr Hegseth then texted, according to the report: \"1215et: F-18s LAUNCH (1st strike package)\". \"1345: 'Trigger Based' F-18 1st Strike Window Starts (Target Terrorist is @ his Known Location so SHOULD BE ON TIME - also, Strike Drones Launch (MQ-9s)\". The magazine noted the 11.44am message was sent \"31 minutes before the first US warplanes launched, and two hours and one minute before the beginning of a period in which a primary target, the Houthi 'Target Terrorist', was expected to be killed by these American aircraft\". Further texts by the Pentagon chief followed, The Atlantic reported: \"1410: More F-18s LAUNCH (2nd strike package)\". \"1415: Strike Drones on Target (THIS IS WHEN THE FIRST BOMBS WILL DEFINITELY DROP, pending earlier 'Trigger Based' targets)\". He also posted: \"1536 F-18 2nd Strike Starts - also, first sea-based Tomahawks launched\". And then: \"MORE TO FOLLOW (per timeline)\". \"We are currently clean on OPSEC\" (operational security), he added. \"Godspeed to our Warriors.\" Read more:Group chat gaffe wouldn't happen in UK - analysis'Pathetic European free-loading': What else was said in group chatWho were the officials discussing war plans on a group chat?  In an article titled The Trump Administration Accidentally Texted Me Its War Plans, the magazine had previously published other texts from the chat - but decided to withhold this information, citing national security concerns. But it said in its latest article that it had decided to publish the operational timeline after the Trump administration's statements over the leak. These statements, the magazine wrote, \"have led us to believe that people should see the texts in order to reach their own conclusions\". The Atlantic also revealed it asked if officials across the Trump administration opposed publication of the full texts and was told by the White House \"we object to the release\". 'No classified information' Mr Hegseth told reporters no one had texted war plans. US President Donald Trump said the texting of sensitive plans was \"the only glitch in two months\" and a non-issue. He said he believed the chat contained \"no classified information\". Director of National Intelligence Tulsi Gabbard and CIA director John Ratcliffe - who were both also in the chat - testified before the Senate Intelligence Committee on Tuesday that no classified material was shared. Ms Gabbard told the committee on Wednesday it had been \"a mistake\" to add the editor of The Atlantic to the chat. She also said she would be limited in her ability to discuss the incident because of a lawsuit filed over the case.  The scandal has led to calls for Mr Trump to sack his defence chief as well as national security adviser Mike Waltz, who has taken full responsibility\" for organising the group chat. It was Mr Waltz who had mistakenly added Mr Goldberg to the group. \"I take full responsibility, he said. \"I built the group.\" The Democrats have said the incident could have put American service members at risk. At Wednesday's Intelligence Committee hearing, there were also fresh calls for Mr Hegseth to resign and for an investigation \"as to whether other Signal chats are being used in this government\". The committee also heard it was a \"lie\" to claim information discussed on the Signal chat was not classified and that the Trump administration was using \"excuse after excuse, after excuse\". Signal is a publicly available app that provides encrypted communications, but it is not approved for carrying classified information. On 14 March, one day before the strikes, the US Defence Department warned about the vulnerability of Signal - and that Russia was attempting to hack the app, according to a report citing a US official. Previous reports said a known vulnerability of the app is that a malicious actor, with access to a person's phone, can link his or her device to the user's Signal and essentially monitor messages remotely in real time."
    },
    {
        "title": "HIV deaths and infections will rise as a result of foreign aid cuts, study warns",
        "description": "HIV deaths and infections will rise as a result of cuts to foreign aid, a study has warned.",
        "url": "https://news.sky.com/story/hiv-deaths-and-infections-will-rise-as-a-result-of-foreign-aid-cuts-study-warns-13336152",
        "image_url": "https://e3.365dm.com/23/02/1920x1080/skynews-hiv-aids-test-tube_6064013.jpg?20230220153918",
        "type": "US",
        "Author": "Samuel Osborne",
        "Date Published": "2025-03-26 14:17:00",
        "Headline": "Funding cuts could undo decades of progress and cause infections and deaths to surge to levels not seen since the early 2000s, researchers say.",
        "Content": "\n          News reporter\n              @samuelosborne93\n HIV deaths and infections will rise as a result of cuts to foreign aid, a study has warned. Funding cuts could undo decades of progress and cause infections and deaths to surge to levels not seen since the early 2000s, researchers said. They estimate there could be up to 10.8 million additional HIV infections in low and middle-income countries by 2030. Meanwhile, the number of HIV-related deaths in children and adults could reach 2.9 million by 2030. The study comes after Sir Keir Starmer's decision to cut overseas spending from 0.5% of gross national income to 0.3% over the next two years in order to fund defence commitments. The move led to the resignation of Anneliese Dodds as international development minister.  US President Donald Trump has ordered a pause in most US foreign aid spending and announced the country would withdraw from the World Health Organization. In a paper published in The Lancet HIV, researchers said international donors have contributed around 40% of all HIV funding in low and middle income countries since 2015. They said the UK, the US, France, Germany and the Netherlands account for over 90% of international funding. However, they point out that all the countries have recently announced plans to cut foreign aid, leading to a projected 24% reduction in international HIV funding by 2026. Through mathematical models the predominantly Australian-based researchers estimated there could be between 4.4 million and 10.8 million additional new HIV infections in low and middle income countries by 2030 and between 770,000 and 2.9 million HIV-related deaths in children and adults by the same year. Read more from Sky News:Bird flu strain 'has potential to become pandemic'Prince Harry quits charity after battle with chair \"The United States has historically been the largest contributor to global efforts to treat and prevent HIV, but the current cuts to Pepfar [the US President's Emergency Plan for AIDS Relief] and USAid-supported programmes have already disrupted access to essential HIV services including for antiretroviral therapy and HIV prevention and testing,\" said co-lead study author Dr Debra ten Brink of the Burnet Institute in Australia. \"Looking ahead, if other donor countries reduce funding, decades of progress to treat and prevent HIV could be unravelled. \"It is imperative to secure sustainable financing and avoid a resurgence of the HIV epidemic which could have devastating consequences, not just in regions such as sub-Saharan Africa, but globally.\" A spokesperson for the Foreign, Commonwealth and Development Office said: \"The UK provides significant funding to the global HIV response, supporting work to end AIDS-related deaths and prevent new HIV infections. \"We remain firmly committed to tackling global health challenges, not only because it is the right thing to do, but also because it will help us deliver on our Plan for Change in the UK by supporting global stability and growth.\""
    },
    {
        "title": "Discrediting the messenger, rather than focusing on the message is order of day for Trump White House",
        "description": "Marjorie Taylor Greene has become the most aggressive spokesperson for the \"Make America Great Again\" movement.",
        "url": "https://news.sky.com/story/discrediting-the-messenger-rather-than-focusing-on-the-message-is-order-of-day-for-trump-white-house-13336352",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-marjorie-taylor-greene_6867998.png?20250326212056",
        "type": "US",
        "Author": "Martha Kelner",
        "Date Published": "2025-03-26 22:21:00",
        "Headline": "\"Team Trump has adopted a crisis management strategy of attack, discredit and distract\", writes Sky's US correspondent Martha Kelner.",
        "Content": "\n          US correspondent\n              @marthakelner\n  Marjorie Taylor Greene has become the most aggressive spokesperson for the \"Make America Great Again\" movement. It's perhaps no surprise, then, that she would read straight from a fraying playbook when confronted about the Signal group chat fiasco. Team Trump has adopted a crisis management strategy of attack, discredit, and distract, a dark art of which Taylor Greene is emerging as a master. When questioned about whether the texts on the group chat, detailing timings and weapons to be used on strikes on Houthis in Yemen, amount to classified information, she refused to answer the question. Read more here:More details of US security breach revealedAtlantic publishes more texts shared on leaked chat The representative from Georgia attempted to deflect attention on to the Biden administration, then on to the US's border problem and finally, in a remarkable act of contortion, on to \"all the women that are raped by migrants\" in the UK. Refusing to answer a question from Sky News, she then turned to a question from a US reporter, who also asked for clarification on her views about the Signal scandal and its national security ramifications. 👉 Follow Trump 100 on your podcast app 👈 Eventually, Taylor Greene did respond to The Atlantic magazine's revelation of texts on the signal group chat, fully backing defence secretary, Pete Hegseth, who is facing calls for his resignation. In MAGA world, the villain of this scandal is Jeffrey Goldberg, the editor of The Atlantic, who was inadvertently invited on to the group chat. Despite the fact that Goldberg took care over his reporting and potentially exposing major failings in the way senior government communicate, he has been repeatedly smeared by the White House. Donald Trump calls him a \"sleazebag\", national security advisor Michael Waltz equates him to \"journalists trying to make a name for themselves\", and press secretary Karoline Leavitt calls him an \"anti-Trump hater.\" Discrediting the messenger, rather than focusing on the message and what lessons can be learned, is the order of the day for the Trump White House."
    },
    {
        "title": "Crystal clear Trump wants to turn Putin from pariah to partner with lifting of some sanctions",
        "description": "This is a hugely significant moment. For the first time in more than three years, Washington is lifting sanctions on Moscow instead of imposing them.",
        "url": "https://news.sky.com/story/crystal-clear-trump-wants-to-turn-putin-from-pariah-to-partner-with-lifting-of-some-sanctions-13335966",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-vladimir-putin-donald-trump_6867226.jpg?20250326082512",
        "type": "US",
        "Author": "Ivor Bennett",
        "Date Published": "2025-03-26 08:01:00",
        "Headline": "The US is talking about easing a handful of restrictions so that Russia's agricultural and fertiliser exports can return to global markets.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n This is a hugely significant moment. For the first time in more than three years, Washington is lifting sanctions on Moscow instead of imposing them. It's the most tangible evidence yet of a US-Russia rapprochement, and a crystal clear signal of Donald Trump's intentions to turn Vladimir Putin the pariah into Putin the partner. For now, they're only talking about easing a handful of restrictions so that Russia's agricultural and fertiliser exports can return to global markets. Ukraine war latest: Russia launches drone attacks  It's important to point out that Russian food and fertiliser have, in fact, always been exempt from Western sanctions, but exports were disrupted by Russian banks' exclusion from the SWIFT global payments system. It has meant higher fees and delays in payments, even when it comes to cross-border trade with friendly nations. That's why Moscow wants sanctions to be lifted on Rosselkhozbank - the state-owned Russian agriculture bank - and for it to be reconnected to SWIFT. One could argue that it's just one brick in what is still a whole wall of sanctions surrounding Russia. But its removal will nevertheless be massively symbolic. Ukraine's Western allies were in lockstep when they built that wall - now its powerful supporter is starting the process of bringing it down. What's more, there'll be fears that Moscow could abuse America's charity here, particularly when it comes to one of the Kremlin's other demands - lifting restrictions on the supply of agricultural machinery to Russia. Read more from Sky News:Trump urged to fire defence secretary over war plans leakDrones shot down over Black Sea, Russia claims Restrictions were imposed on agricultural machinery due to some components being classified as 'dual-use' goods, which could potentially aid Russia's war machine. What's to say these fears won't be realised? That parts meant for tractors and harvesters suddenly find their way into weapon production? Washington might be happy to take Moscow's word for it, but Kyiv certainly won't be. Perhaps the most galling thing for Ukraine and its European allies, however, will be that Mr Putin appears to have secured this without giving up very much at all.  Yes, Russia has agreed to a maritime ceasefire. But it's a long way short of a full ceasefire, and it's something that was first agreed back in July 2022 with the Black Sea Grain Initiative. Russia withdrew from that deal in 2023, unhappy at the obstacles facing its food and fertiliser exports - sound familiar? Since then, attacks in the Black Sea have dropped off significantly. In fact, Ukrainian grain exports are pretty much back at pre-war levels already. So, a maritime ceasefire may not actually make that much of a difference to the conflict itself. The bigger impact will be in Washington and Moscow. For Mr Trump, it's something to show off - proof that he's taken a step closer to peace. For Mr Putin, it's Russia's first step coming back in from the cold."
    },
    {
        "title": "US appears to be significantly increasing its military presence in the Middle East",
        "description": "The United States appears to be significantly increasing its military presence in the Middle East with the deployment of highly sophisticated aircraft and a second aircraft carrier to the region.",
        "url": "https://news.sky.com/story/us-appears-to-be-significantly-increasing-its-military-presence-in-the-middle-east-13336089",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-b-2-spirit-stealth-bomber_6867452.jpg?20250326121502",
        "type": "US",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-03-26 12:01:00",
        "Headline": "The US has extended the deployment of the USS Harry S Truman carrier strike group in the Red Sea, while another is heading to the Middle East. At least five B-2 stealth bombers have also been deployed to Diego Garcia, a British military base used by the US in the Indian Ocean.",
        "Content": "\n          Middle East correspondent\n              @AliBunkallSKY\n The United States appears to be significantly increasing its military presence in the Middle East with the deployment of highly sophisticated aircraft and a second aircraft carrier to the region. In recent days, at least five B-2 stealth bombers have deployed to Diego Garcia, a British military base used by the US in the Indian Ocean. More are reportedly en route. Seven C17 aircraft have also been tracked landing on the remote atoll, suggesting transportation of equipment, personnel and supplies, and refuelling aircraft have been repositioned to strategic locations. The Pentagon recently ordered the USS Harry S Truman carrier strike group to extend its deployment in the Red Sea by a month, and a second strike group, led by the USS Carl Vinson aircraft carrier, is heading for the Middle East. Both groups have support ships, including destroyers, as part of the group. It is an unusual surge in military assets and an indication, perhaps, that the US is planning heavy strikes on the Houthis in Yemen and possibly looking to send a strong message to Iran. The Houthis, an Islamist group that controls a large part of Yemen, including the capital Sana'a, have repeatedly attacked Red Sea shipping and Israel during the war in Gaza. Those attacks stopped while the ceasefire was in force but have restarted following a resumption of Israeli military operations in Gaza. The Houthis have vowed to strike Israel's Ben Gurion airport and have fired ballistic missiles towards Israel on an almost daily basis in recent weeks, triggering air raid sirens in Tel Aviv and Jerusalem. They claimed to have launched drones at Israel on Tuesday night, but the Israeli military hasn't confirmed that. Read more:Yazidi women still enslaved in ISIS detention campsWhat happened to the Israel-Hamas ceasefire? The Trump administration has launched attacks against the Houthis to restore freedom of shipping in the Red Sea, a crucial waterway for global commerce as it's linked to the Mediterranean Sea via the Suez Canal. The first wave of those attacks was the subject of a major security breach when a journalist was mistakenly included in discussions between senior US government personnel on the messaging app Signal. US defence secretary Pete Hegseth has promised to continue striking the Houthis for as long as it takes, and President Trump has warned Iran he might be forced to take military action against their nuclear facilities if Tehran doesn't agree to talks."
    },
    {
        "title": "JD Vance announces trip to Greenland and accuses Denmark of ignoring island 'for far too long'",
        "description": "US vice president JD Vance will fly to Greenland this week, after accusing American and Danish leaders of ignoring the island \"for far too long\".",
        "url": "https://news.sky.com/story/jd-vance-announces-trip-to-greenland-and-accuses-denmark-of-ignoring-island-for-far-too-long-13335925",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-greenland-waghorn_6852706.jpg?20250311001327",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-26 06:15:00",
        "Headline": "National security adviser Mike Waltz is also set to visit Greenland, but his name has reportedly been omitted from the latest announcement. It is unclear if he is still going, or whether his travel plans were altered after the leak.",
        "Content": " US vice president JD Vance will fly to Greenland this week, after accusing American and Danish leaders of ignoring the island \"for far too long\". He will join second lady Usha Vance and energy secretary Chris Wright as part of a delegation to visit the Pituffik space base, the US military base in Greenland. Originally, Ms Vance had planned to attend a popular dog-sled race in Greenland - a move Denmark's prime minister Mette Frederiksen criticised as putting \"unacceptable pressure\" on the semi-autonomous Danish territory. Announcing the change in destination to the US base, Mr Vance said he didn't want his wife to \"have all that fun by herself,\" before adding that \"a lot of countries have threatened\" the world's largest island. Mr Vance then said: \"We're going to check out how things are going there. \"Speaking for President Trump, we want to reinvigorate the security of the people of Greenland because we think it's important to protecting the security of the entire world.\" The vice president also claimed US and Danish leaders had \"ignored Greenland for far too long\" and that \"we think we can take things in a different direction\". Since US President Donald Trump took office, he has regularly floated the idea of Greenland becoming part of the United States. Greenland's strategic location, at the northeastern tip of the North American continent and as the gateway to the Arctic Ocean. as well as its rich mineral resources, would benefit the US. It also lies along the shortest route from Europe to North America, and is vital for the US ballistic missile warning system. Read more: Why does Trump want to take over Greenland?  The governments of both Greenland and Denmark have voiced opposition to such a move. Greenland Prime Minister Mute Egede told the newspaper Sermitsiaq his nation has tried \"all diplomatic and democratic options\", but Mr Trump's mission is \"to own and control Greenland\". On Tuesday, Danish Prime Minister Mette Frederiksen accused the US of putting \"unacceptable pressure\" on Greenland. Waltz omitted from announcement White House national security adviser Mike Waltz was originally set to take part in the Greenland visit. However, his name was omitted from the latest announcement, according to the Associated Press (AP). 👉 Follow Trump 100 on your podcast app 👈 It comes after a US journalist was added to a Signal group chat where US officials discussed airstrikes on Yemen's Iran-backed Houthis. It is unclear if he is still going, or whether his travel plans were altered after the leak. Read more from Sky News:Trump urged to fire defence secretaryDOGE staff getting daily death threats, says Musk Speaking on Tuesday evening, Mr Waltz said he took responsibility for creating the group, adding: \"I built the group. So look, that's the part that we have to figure out... \"Embarrassing? Yes, but Pete [Hegseth, US defence secretary] and I are veterans.\" It remains unclear why the officials chose to chat via Signal instead of secure government channels typically used for sensitive discussions. On Tuesday, Mr Trump told Sky News' US partner, NBC News, that the lapse \"turned out not to be a serious one\" and expressed his continued support for Mr Waltz."
    },
    {
        "title": "British Steel's Chinese owner rejects £500m government aid offer",
        "description": "The Chinese owner of British Steel has rejected a &#163;500m state rescue package in a move which raises fresh doubts about thousands of steel industry jobs.",
        "url": "https://news.sky.com/story/british-steels-chinese-owner-rejects-163500m-government-aid-offer-13336194",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-scunthorpe-british-steel_6831660.jpg?20250217144519",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-26 16:06:00",
        "Headline": "Jingye Group has turned down an offer of taxpayer support proposed by Jonathan Reynolds, the business secretary, leaving fresh questions over thousands of steel industry jobs, Sky News can reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The Chinese owner of British Steel has rejected a £500m state rescue package in a move which raises fresh doubts about thousands of steel industry jobs. Sky News has learnt that the offer was made by Jonathan Reynolds, the business secretary, in a letter sent to Jingye Group on Monday. The proposal - aimed at facilitating the Scunthorpe-based group's transition to green steel production - follows years of talks aimed at salvaging the future of the UK's second-biggest producer. Money blog: Are you better or worse off after the spring statement? Sarah Jones, the industry minister, told a committee of MPs on Wednesday afternoon that an offer had been made by the government earlier this week, and it had been rejected by Jingye. \"We are still in talks with them at the moment,\" she told the business and trade select committee. The minister did not disclose the size of the offer, but Whitehall sources confirmed that it was £500m - equivalent to the sum awarded to the larger Tata Steel as part of a £1.25bn package finalised last year. \n                  OBR slashes UK growth forecast for 2025 but upgrades it for rest of parliament\n                 \n                  Network Rail to set up property company to deliver 40,000 homes\n                 \n                  After chancellor's spring statement we end more or less where we began\n                 Government sources said the offer had been calibrated after protracted discussions between ministers, officials and their advisers lasting many months. However, the £500m package falls well short of the sum that Jingye has been seeking from the government during several rounds of talks since Labour won last summer's general election. The Chinese-owned group is thought to have requested £1bn or more from ministers - double the amount handed to Tata Steel, owner of the Port Talbot steelworks in South Wales, last autumn. The gap between the government's offer and Jingye's demands means that thousands of steel jobs could yet be at risk. British Steel, which was taken over by Jingye in 2020 after a spell in public ownership, employs about 3,500 people at its sites in Scunthorpe, Teesside and elsewhere. It has been pushing for taxpayer funding to support a transition to green steelmaking by replacing Scunthorpe's two blast furnaces with cleaner electric arc furnaces. The rejection of the £500m offer leaves Scunthorpe's future on a knife edge. It is unclear whether the government is prepared to increase the amount of money it hands to Jingye, despite Ms Jones's insistence that discussions are ongoing. Asked whether British Steel's blast furnaces would continue operating during negotiations, she said: \"Our preference would be for them to keep going; until at the least they have secured the volume of steel imports to keep the mills going. \"Our preference would be that this steel is secured before they close these furnaces.\" Without the injection of funding from government that it had sought, Jingye may argue that its loss-making operations are no longer viable and opt to close the blast furnaces without the financing in place to replace their output. Reports late last year suggested that nationalisation was an option being explored by ministers. The government's proposal comes at a deeply sensitive time for Britain's steel industry, with fears of swingeing US tariffs exacerbating concerns that the sector's viability will be put at risk. Earlier this month, Sharon Graham, general secretary of the Unite union, called on ministers to designate steel as critical national infrastructure: \"Our government must act decisively to protect the steel industry and its workers following the announcement of US tariffs. \"This is a matter of national security. \"Given the importance of steel to our economy and our everyday lives it is vital it is designated as critical national infrastructure and rules are introduced to ensure that the public sector always buys UK produced steel.\" Last month, Mr Reynolds published the government's Plan for Steel consultation, which will include up to £2.5bn in funding for the industry, in line with a commitment in last year's Labour election manifesto. \"The UK steel industry has a long-term future under this government,\" he said. \"Britain is open for business, and this government has committed up to £2.5bn to the future of steel to protect our industrial heartlands, maintain jobs, and drive growth as part of our Plan for Change.\" During the same month, Mr Reynolds held further talks with Jingye Group's boss, Li Huiming, in the latest chapter of a negotiation which has been dragging on for more than two years. British Steel was bought by Jingye the year after it was placed into compulsory liquidation. The company had been owned by private investment firm Greybull Capital. British Steel declined to comment, while the Department for Business and Trade has been approached for comment on the details of its offer to Jingye."
    },
    {
        "title": "OBR slashes UK growth forecast for 2025 but upgrades it for rest of parliament",
        "description": "The Office for Budget Responsibility has halved the UK growth forecast for 2025 from 2% to 1%, Chancellor Rachel Reeves has said.",
        "url": "https://news.sky.com/story/uk-growth-forecast-for-this-year-halved-chancellor-says-13335986",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rachel-reeves-spring-statement_6867458.jpg?20250326122730",
        "type": "Business",
        "Author": "Faith Ridler, politics reporter and Sarah Taaffe-Maguire, business and economics reporter",
        "Date Published": "2025-03-26 13:00:00",
        "Headline": "The Office for Budget Responsibility (OBR) downgraded growth for 2025 but upgraded it for every year after for the rest of this parliament. Its forecasts for the UK economy are for higher unemployment and inflation this year, but it said so-called economic inactivity is lower than thought.",
        "Content": "By Faith Ridler, politics reporter and Sarah Taaffe-Maguire, business and economics reporter   The Office for Budget Responsibility has halved the UK growth forecast for 2025 from 2% to 1%, Chancellor Rachel Reeves has said. However, the fiscal watchdog said that while growth has been downgraded for this year, it had been upgraded for every year after for the rest of this parliament - which is due to end in 2029. The chancellor said she is \"not satisfied with the numbers\" for this year as she delivered her long-awaited spring statement in the House of Commons. Politics latest: Follow live updates But, she explained, the OBR has forecast growth to hit 1.9% in 2026, 1.8% in 2027, 1.7% in 2028, and 1.8% in 2029. Some tough forecasts beyond headline figures The independent forecaster also published its economic outlook on Wednesday, showing there's a 54% chance the chancellor will not break her self-imposed fiscal rules to bring down government debt and balance the budget by 2030. Living standards, as measured by household disposable income, will fall after this year to almost no growth in 2027-28 before rising again due to firms rebuilding profit margins, wage growth slowing, taxes rising, and welfare measures taking effect. The OBR also raised its expectation for unemployment and net migration - the number of people immigrating to the UK minus those emigrating. The unemployment rate, the percentage of people out of work, will rise to 4.5% this year. This is 0.4 percentage points or 160,000 people higher than first thought in the October forecast. Net migration will fall sharply, the OBR said, due to a tightening of visa policies and higher levels of emigration. But the forecast has been upped by 25,000 since October as a higher share of immigrants are staying in the UK under the new migration system.  At the same time, there will be a reduction in people neither in work nor looking for work due to a reduction in caring as birth rates fall and childcare provision is expanded. But there are also fewer people in this position, classed as \"economically inactive\" than previously thought, the OBR said. The government launched its welfare cuts in an effort to reduce this economic inactivity. Further cuts are to come, the OBR said, as \"unprotected\" government departments such as local government justice, the environment, Home Office and culture may need to be cut by 0.8% a year from 2026-27 \"to accommodate assumed commitments in other areas\". Prices overall will go up even higher than initially anticipated, according to the OBR, which now forecasts inflation will rise to 3.8% in July due to higher energy, food and water bills. This will fall rapidly, however, from next year. 'No shortcuts to growth' Ms Reeves told MPs: \"There are no shortcuts to economic growth. It will take long-term decisions. It will take hard yards. It will take time for the reforms we are introducing to be felt in the everyday economy. \"It is right that the Office for Budget Responsibility consider the evidence and look carefully at measures before recognising a growth impact in their forecast.\" The chancellor pointed to changes to the National Planning Policy Framework, saying mandatory housing targets and bringing \"grey belt\" land into scope for development will \"permanently increase the level of real GDP by 0.2% by 2029-30\". This will bring an \"additional £6.8bn in our economy and by 0.4% of GDP within the next 10 years\", she said. Ms Reeves also highlighted reforms to the pension system and a national wealth fund, adding it was part of a \"serious plan\" for economic growth. Also announced in the spring statement today: The chancellor confirmed that a voluntary redundancy scheme is set to launch for civil servants as part of her mission to \"make government leaner\". She said this will deliver £3.5bn in \"day-to-day savings by 2029-30\".  Political reaction Shortly afterwards, Conservative leader Kemi Badenoch accused Labour of financial \"chaos\". She said the spring statement was \"all smoke and mirrors\", adding: \"I remember the last budget when Rachel Reeves said she was smashing glass ceilings, now it feels like the roof is falling over all our heads.\" A handful of Labour MPs were unimpressed with the moves around welfare, with Debbie Abrahams - the MP for Oldham East and Saddleworth - claiming \"all the evidence points to cuts in welfare leading to severe poverty and worsened health conditions\". An impact assessment into Labour's welfare reforms, which include narrowing the eligibility criteria for personal independence payments (PIP), found there could be an additional 250,000 people in \"relative poverty\" by 2030 due to the changes. Richard Burgon, the Labour MP for Leeds East, said \"taking away the personal independence payments\" from disabled people is an \"especially cruel choice\"."
    },
    {
        "title": "Network Rail to set up property company to deliver 40,000 homes",
        "description": "Network Rail will set up a new property company to build 40,000 homes on its rail estate over the next decade in a drive to meet the government's housing target.",
        "url": "https://news.sky.com/story/network-rail-to-set-up-property-company-to-deliver-40000-homes-13336399",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-house-houses-home-estate_6796583.jpg?20250111100023",
        "type": "Business",
        "Author": "Faye Brown",
        "Date Published": "2025-03-26 21:53:00",
        "Headline": "It is part of a drive to free up unused public land to help the government deliver its manifesto pledge to build 1.5m homes over this parliament. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Network Rail will set up a new property company to build 40,000 homes on its rail estate over the next decade in a drive to meet the government's housing target. The Treasury on Thursday announced the launch of a new cross-government taskforce to release surplus public land for housing, with unused Ministry of Defence (MOD) sites also to be among the first to be released. Announcing the plan, Chancellor Rachel Reeves said it would \"unlock the next generation of homeowners\", as the government strives to deliver 1.5 million new homes by the end of this parliament. It comes after the UK's fiscal watchdog estimated efforts to unblock the planning system will result in the highest levels of house building in 40 years, adding around £6.2bn to the UK's economy by 2029.  The figures were a rabbit out of the hat in the Office for Budget Responsibility's (OBR) economic forecast, which downgraded growth for this year as predicted, forcing Ms Reeves to announce a raft of spending cuts in order to stick to her fiscal rules. Speaking a day after Wednesday's spring statement, the chancellor described surplus government land as \"a huge untapped resource that could create opportunities for the next generation of homeowners\". She added: \"In contrast to the failed approach of the past, we are making the best use of public land to build the homes that families and our Armed Forces need, improving opportunities for homeownership and creating jobs across the country. \n                  OBR slashes UK growth forecast for 2025 but upgrades it for rest of parliament\n                 \n                  Spring statement 2025 key takeaways\n                 \n                  Chancellor's difficult decisions in spring statement could just be the start\n                 \"The OBR (Office for Budget Responsibility) has confirmed our planning reforms will result in housebuilding being at its highest in over 40 years - that won't just bring jobs and economic growth - but also will give families the homes that they deserve, delivering on our plan for change.\" Surplus MOD sites will pioneer the scheme, with the department to transfer land at Chetwynd Barracks in Nottinghamshire and Wyton Airfield in Cambridgeshire to Homes England for over 1,300 new properties. Deverell Barracks, near Ripon, North Yorkshire, will also be released to expedite the delivery of another 1,300 homes - with work to start within 12 months. Read More:Chancellor's difficult decisions could just be the startSee how your finances have changed after spring statementSpring statement 2025 key takeaways Defence Secretary John Healey has identified opportunities to build more than 100,000 homes on surplus military land in future, the Treasury added. Part of this will include a commitment to building new military family homes, following the return of Armed Forces housing to public ownership earlier this year. Network Rail plans to create its own development company, which will become operational later this year.  This will include as many as 5,000 homes at Newcastle Forth Yards; 1,500 homes at Manchester Mayfield station, and a mixed-use development in Nottingham which could yield 425 homes. It is not clear how many could be affordable housing. On Tuesday, the government announced £2bn for 18,000 new homes, saying it expects half of them to be affordable. But charities called for the \"vast majority\" to be for social rent as homelessness hits record highs across the country. The funding was described by the government as a \"down payment from the Treasury\" ahead of longer-term investment in social and affordable housing expected to be announced later in the year."
    },
    {
        "title": "After chancellor's spring statement we end more or less where we began",
        "description": "Nothing to see here - nothing has changed. That, at least, was the message the chancellor probably wants us to walk away with today, having consumed her first spring statement.",
        "url": "https://news.sky.com/story/after-chancellors-spring-statement-we-end-more-or-less-where-we-began-13336268",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rachel-reeves-chancellor_6867864.jpg?20250326182149",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-03-26 18:12:00",
        "Headline": "Why on earth is British economic policy being determined in large part with the objective of helping the chancellor to meet a fiscal rule she set herself and no one much cares about outside of Whitehall? The truth is, there's no particularly good answer to that question.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Nothing to see here - nothing has changed. That, at least, was the message the chancellor probably wants us to walk away with today, having consumed her first spring statement. Consider the \"current budget\" - in other words the extent to which the government is having to borrow to finance day-to-day spending in the public sector. This might seem like an arcane datapoint to focus on, but clearly someone in the Treasury is spending a lot of time thinking about it. Indeed, this was the very first statistic Chancellor Rachel Reeves mentioned in her speech today. And for good reason. Last year Ms Reeves set herself a couple of fiscal rules, the most binding of which came back to the current budget. If she isn't to fall foul of the rule, she needs to get the current budget into a surplus.  Last time around that surplus was £9.9bn - in other words she met the rule with £9.9bn \"headroom\". Actually, to be even more geeky about it, the headroom was £9.93bn. That raises a question: what was the headroom this time around? Lo and behold it was £9.93bn. Precisely the same number as the one last time around. In other words, in statistical terms, the chancellor has blitzed the homework assignment she set herself. But now let's look a little closer. \n                  'I don't know how we will survive' - fears over benefit cuts and cost of living in chancellor's Leeds constituency\n                 \n                  OBR slashes UK growth forecast for 2025 but upgrades it for rest of parliament\n                 \n                  Spring statement 2025 key takeaways\n                 In fact, that latest £9.93bn figure is a product of some extraordinary fiscal contortions behind the scenes. Because a few weeks ago, when the Office for Budget Responsibility provided the Treasury with their forecasts of the state of the economy and the implications for the public finances, her headroom was not £9.93bn. On the contrary, the entire headroom had been wiped out. Why? In large part because the economy is growing at a slower rate than previously expected and interest rates are higher. Put those two factors together and that adds up to more debt. It meant all of a sudden her £9.93bn surplus turned into a £4.1bn deficit. Read more: Spring statement 2025 key takeaways So how, you might ask, did the chancellor turn it back into the number she started with? Answer, by deploying all sorts of fiscal levers. There are clampdowns on tax avoidance. There's the redeployment of spending from aid to defence (since defence is mostly capital investment it has the benefit, from her perspective, of shoving a lot of spending into a different column in the governmental spreadsheet). There's a host of spending cuts (including reducing annual departmental spending in the years preceding the next election to the same rate Jeremy Hunt was targeting). And then there's those welfare cuts you read about last week. I could go on. The welfare cuts from last week turn out to be far less effective at saving money than the government told everyone last week; the OBR also rapped the Treasury over the fingers for not being transparent enough with its figures. Those cuts will, according to the government's own documents, push 350,000 or more people into poverty, including 50,000 children. Beth Rigby analysis: Starmer has moved on to Tory territory At this point (if you're still reading), you're probably asking yourself: why on earth is British economic policy being determined in large part with the objective of helping the chancellor to meet a fiscal rule she set herself and no one much cares about outside of Whitehall? And the truth is, there's no particularly good answer to that question. All the same: we end more or less where we began. The rule is met. The economy is weaker in the short run but slightly stronger in the longer run. But economic policy is not the same now as it was yesterday."
    },
    {
        "title": "Spring statement 2025 key takeaways",
        "description": "Rachel Reeves has delivered her much anticipated spring statement today.",
        "url": "https://news.sky.com/story/spring-statement-2025-key-takeaways-13336004",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-spring-statement-money_6860442.jpg?20250318124659",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-03-26 09:26:00",
        "Headline": "From welfare cuts to defence spending, here are the main announcements from Chancellor Rachel Reeves.",
        "Content": " Rachel Reeves has delivered her much anticipated spring statement today. The chancellor's statement is not a formal budget - as Labour pledged to only deliver one per year - but rather an update on the economy since her fiscal statement last October. Ms Reeves told MPs \"the world has changed\" since her first budget just under five months ago, and that was to blame for the string of cuts and downgrades she outlined in the Commons. Politics latest: Follow live updates But critics have said today’s update is a direct consequence of her decisions since taking office in July. Here are the key takeaways from the spring statement: The Office for Budget Responsibility (OBR) has halved the UK growth forecast for 2025 from 2% to 1%, Ms Reeves said, adding that she was \"not satisfied with these numbers\". She explained that the government's budget will move from a deficit of £36.1bn in 2025-26 and £13.4bn in 2026-27, to a surplus of £6bn in 2027-28, £7.1bn in 2028-29 and £9.9bn in 2029-30. While the short-term growth forecasts appear gloomy, the chancellor said the OBR predicts the economy will be \"larger\" by the end of the forecast compared with the time of her first budget as a result of her decisions. The OBR expects output to grow 1% in 2025, by 1.9% next year, 1.8% in 2027, 1.7% in 2028 and by 1.8% in 2029. On living standards, real household disposable income per person is expected to grow by an average of around 0.5 percentage points a year from 2025-26 to 2029-30, led by stronger wage growth and inflation starting to fall later in the forecast period. Ms Reeves said disposable income will \"grow this year at almost twice the rate expected in the autumn\", adding: \"Households will be on average over £500 a year better off under this government.\" The chancellor announced further welfare cuts after being told the reforms announced last week will save less than planned - £3.4bn instead of £5bn. Among the latest changes to welfare spending, Ms Reeves said the universal credit health element would be cut by 50% and frozen for new claimants rather than rising in line with inflation. However, the universal credit standard allowance will increase from £92 per week in 2025-26 to £106 per week by 2029-30. The changes will mean a further 150,000 people will not receive carer's allowance or the carer element of universal credit, according to the government's own impact assessment.  The OBR has estimated the new welfare savings package will save £4.8bn. Cuts to welfare will mean 250,000 more people - including 50,000 children - will be pushed into poverty by 2030, the government's assessment predicts. Separately, 800,000 people will not receive the daily living component personal independence payment (Pip) - due to tightening eligibility rules. The chancellor pledged to \"boost Britain's defence industry and to make the UK a defence industrial superpower\". She confirmed the government's pledge to spend 2.5% of GDP by 2027. The Ministry of Defence will get an additional £2.2bn next year, the chancellor said, which will be spent on new high-tech weaponry, upgrading HM Naval Base in Portsmouth, and refurbishing military family homes, among other things. The commitment is fully funded, with cash coming from Treasury reserves and also from the decision to slash foreign aid funding. Ms Reeves said the statement does not contain any further tax increases, but highlighted work that needs to be done to tackle tax evasion. She announced steps to crack down on it, saying the government will increase the number of tax fraudsters charged each year by 20%.She said reducing tax evasion will raise an extra £1bn for the economy. On departmental budgets - which dictate how much different parts of government can spend until 2030 - Ms Reeves said she aims to make the state \"leaner and more agile\". The chancellor also confirmed that a voluntary redundancy scheme is set to launch for civil servants, saying this will deliver £3.5bn in \"day-to-day savings by 2029-30\". Government spending will now grow by an average of 1.2% a year above inflation, compared with 1.3% in the autumn. Planning reforms will see house building reach a more than 40-year high by 2030, the chancellor said. She said the OBR has forecast that the government's reforms will boost house building by 170,000 over the next five years, to 305,000. This would put the government on track to add around 1.3 million to Britain's stock of homes in the UK, a rise of 16%, by the end of parliament. However, reforms will only increase the overall housing stock by 0.5% by the end of 2030, falling short of the government's initial pledge to build 1.5 million houses. How have the markets reacted? The reaction of financial markets to a fiscal event is important, particularly as a poorly received speech can add to government borrowing costs on the bond markets. The good news for the chancellor here is that yields - the premium demanded by investors to hold UK government debt - dipped slightly in the wake of her remarks. Read more:Beth Rigby analysis: Starmer has moved on to Tory territoryEd Conway takes us through economic numbers The yield for UK 30-year bonds, known as gilts, eased by almost 0.1 percentage points to 5.283%. Similar, but smaller, declines were seen for their 10 and two-year counterparts. The only other market reaction to speak of was a dip in the value of the pound, which fell to $1.2873, a two-week low."
    },
    {
        "title": "Farage and NatWest agree to settle debanking dispute",
        "description": "The Reform UK leader Nigel Farage has settled his debanking dispute with NatWest Group, nearly two years after the closure of his accounts sparked a chain of events culminating in the resignation of the lender's chief executive.",
        "url": "https://news.sky.com/story/farage-and-natwest-agree-to-settle-debanking-dispute-13336016",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-nigel-farage-natwest_6827889.png?20250213165715",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-26 09:42:00",
        "Headline": "The Reform UK leader has agreed to end his dispute with the high street banking giant nearly two years after the closure of his Coutts accounts led to the ousting of its former CEO, Sky News can exclusively reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The Reform UK leader Nigel Farage has settled his debanking dispute with NatWest Group, nearly two years after the closure of his accounts sparked a chain of events culminating in the resignation of the lender's chief executive. Sky News can reveal that Mr Farage and NatWest have agreed to resolve their row, with the bank thought to have agreed to pay him an unspecified sum in damages. In return, Mr Farage is understood to have withdrawn the threat of potential civil and criminal proceedings against NatWest over the issue. Money blog: Are you better or worse off after the spring statement? Nick Candy, the Reform treasurer, is said to have played a key role in resolving the dispute between the two sides during mediation talks held at a London law firm on Tuesday. Precise details of the settlement were unclear on Wednesday evening. Responding to an enquiry from Sky News, Mr Farage and NatWest said in a joint statement: \"NatWest Group and Nigel Farage MP are pleased to confirm that they have resolved and settled their dispute, and the bank has apologised to Mr Farage. \n                  Nigel Farage would turn UK into a 'Trump tribute act', Lib Dem leader Sir Ed Davey says\n                 \n                  Rupert Lowe says Reform leader Nigel Farage 'must never be PM' in latest attack amid leaks of WhatsApp messages\n                 \n                  Reform UK's Andrea Jenkyns says Nigel Farage's row with Rupert Lowe was 'clearly a big falling out' - but insists it will 'blow over'\n                 \"The terms of settlement are confidential.\" Mr Farage was originally expected to seek millions of pounds from the company, alleging that the debanking row had damaged his reputation. The furore which claimed the scalp of Dame Alison Rose, NatWest's former chief executive, in the summer of 2023 centred on whether the bank's Coutts subsidiary had decided to close Mr Farage's accounts for commercial or political reasons. NatWest initially claimed the motivation was commercial, before Mr Farage obtained internal evidence from the bank suggesting that his political views had been a pivotal factor in the decision. A subsequent - and inaccurate - BBC News report further exacerbated the controversy after it emerged that the journalist who wrote the story had sat next to Dame Alison at a charity dinner when the row was at its height. It sparked a firestorm under the then Conservative government, with Rishi Sunak and Jeremy Hunt, the prime minister and chancellor respectively, indicating to NatWest's board that they had lost faith in Dame Alison's ability to lead the bank. An emergency late-night board meeting led to Sir Howard Davies, who at the time was NatWest's chairman, concluding that Dame Alison would need to step down - despite her having publicly apologised to Mr Farage for the bank's treatment of him. Since then, both have been replaced, with the former Ocado and MasterCard chairman Rick Haythornthwaite replacing Sir Howard, and Paul Thwaite now in his second year as the company's chief executive. NatWest has since reported a surge in profitability and is now on the verge of returning to full private sector ownership. Earlier this week, it disclosed that the government now owns less than 4% of its shares, with the sale of its remaining holding expected by the early summer. Then known as Royal Bank of Scotland Group and run by Fred Goodwin, RBS was bailed out in 2008 with £45.5bn of taxpayers' money. Its journey back to full private ownership has been a meandering one, and taxpayers will ultimately have lost billions of pounds on the government's rescue deal. On Wednesday afternoon, shares in NatWest closed at 463.9p, giving the bank a market capitalisation of over £37bn. The stock has risen by more than 75% during the last year. The debanking row which claimed Dame Alison's job prompted the City watchdog to order a change to the treatment by financial institutions of so-called politically exposed persons (PEPs). Since his initial promise to turn the issue into a mainstream battle against the major UK banks, Mr Farage's status as one of Britain's most influential politicians has been cemented. He led Reform to a handful of seats at last year's general election, while his party finished in second place in scores of other constituencies. An opinion poll for Sky News by YouGov earlier this year put Reform ahead of both Labour and the Tories for the first time."
    },
    {
        "title": "Spring statement: Beth Rigby and Ed Conway on Rachel Reeves's changed plan",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/spring-statement-beth-rigby-and-ed-conway-on-rachel-reevess-changed-plan-13336162",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-bethrigby-edconway_6867617.jpg?20250326144509",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-03-26 14:45:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈 Chancellor Rachel Reeves has set out her plans for the UK economy during her spring statement in the House of Commons.  It came as the Office for Budget Responsibility (OBR) - which monitors the government's spending plans - unveiled its latest economic forecasts. Liz Bates is joined by Sky's political editor Beth Rigby, and economics and data editor Ed Conway, to pick through the detail and discuss why the chancellor changed her original plan. Producer: Natalie KtenaEditor: Philly Beaumont"
    },
    {
        "title": "President Trump announces 25% tariff on all imported cars ahead of 'liberation day'",
        "description": "US President Donald Trump has announced a new 25% tariff on all imported cars.",
        "url": "https://news.sky.com/story/president-trump-announces-25-tariff-on-all-imported-cars-ahead-of-liberation-day-13336389",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-united-states_6868041.jpg?20250326222222",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-03-26 21:45:00",
        "Headline": "As Washington continued to reel from the fallout over the Signal security breach, Donald Trump instead tried to talk about more tariffs he was implementing.",
        "Content": " US President Donald Trump has announced a new 25% tariff on all imported cars. Signing an executive order, Mr Trump said the tax would kick in on 2 April - what he has called \"liberation day\". This is when all his retaliatory import tariffs are supposed to take effect, but they have been delayed before. It comes amid the continued fallout from the Signalgate security breach in Washington. What was said in the Signal chat?  The move ratchets up the global trade war Mr Trump himself kicked off. Speaking late on Wednesday, Mr Trump said the proposal: \"Will continue to spur growth. We'll effectively be charging a 25% tariff.\" However, the tariffs could be complicated as even American car makers source components from around the world - meaning they could also face higher costs and lower sales. The announcement also drew swift condemnation from the European Union and from Canadian Prime Minister Mark Carney, who called it a \"direct attack\" on Canadian workers. During his second term, Mr Trump has used tariffs frequently as a trade weapon. He cited plans from South Korean car maker Hyundai to build a $5.8bn (£4.5bn) steel plant in Louisiana as evidence the economic measures would bring back manufacturing jobs. Despite Mr Trump's optimism, shares in General Motors fell by about 3% in Wednesday afternoon trading. Ford's stock was up slightly, but shares in Stellantis, the owner of Jeep and Chrysler, dropped nearly 4%. Even American and foreign firms already with domestic plants still rely on Canada, Mexico and other countries for parts and finished vehicles - meaning prices could increase and sales decline as new factories take time to build. Tariffs are a key part of Mr Trump's efforts to reshape global trade relations. He plans to impose what he calls \"reciprocal\" taxes on 2 April that would match tariffs and sales taxes levied by other nations. He has already placed a 20% tax on all imports from China. Similarly, he placed 25% tariffs on Mexico and Canada, with a lower 10% tariff on Canadian energy products. Sky News understands the UK government is engaging with the US on a trade deal and remains hopeful an agreement could be made before the tariffs come into force, but may retaliate if necessary. Signal security breach As Mr Trump was keen to talk up his tariffs, the rest of Washington was discussing the security breach that rocked the Capitol. Read more:Atlantic publishes more texts from group chatTrump White House rolls out playbook responseJD Vance announces trip to Greenland In a group called \"Houthi PC small group\", specific details of a US attack on Houthis were shared with intelligence director Tulsi Gabbard, national security adviser Mike Waltz, vice president JD Vance and more. However, a senior journalist for the magazine The Atlantic, Jeffrey Goldberg, was also somehow added to the Signal group chat. Goldberg published a story first on Monday about the incident. The White House had sought to downplay the leak of the messages, saying no classified information had been disclosed. Goldberg then published a follow-up story releasing the messages themselves earlier on Wednesday. Concerns have been raised about the security of some of the most important members of the US administration using a commercial app. During a hearing in front of Congress, some members outlined feared security issues with Signal."
    },
    {
        "title": "'Uncertainty' features 50+ times in Office for Budget Responsibility (OBR) assessment of UK public finances",
        "description": "The Office for Budget Responsibility (OBR) has given its latest take on the economy, and it's full of big changes to its economic projections but also plenty of red flags about the levels of uncertainty around its forecasts.",
        "url": "https://news.sky.com/story/uncertainty-features-50-times-in-office-for-budget-responsibility-obr-assessment-of-uk-public-finances-13336166",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-biz-graphic-housing_6643996.png?20240731155449",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-03-26 16:00:00",
        "Headline": "Warnings on forthcoming US tariffs and criticism of the UK government's detail on welfare plans contributed to the OBR's assessment that making forecasts is harder. The chancellor is still at risk of breaking her self-imposed fiscal rules.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n The Office for Budget Responsibility (OBR) has given its latest take on the economy, and it's full of big changes to its economic projections but also plenty of red flags about the levels of uncertainty around its forecasts. Echoing the chancellor's speech in the Commons and the Bank of England last week, the OBR warned there are many policy uncertainties, which has made its job harder. First, there's the threat of Donald Trump's looming tariffs, something the OBR alluded to when describing \"a tightening of global trade restrictions\". It also lacks confidence in its assessment of the government's plan to cut welfare benefits because it has not been given enough time to scrutinise them. The word \"uncertainty\" featured more than 50 times in this document. Money blog: Send us your questions on what spring statement means for you It means that these numbers could move again, and if they move in the wrong direction, Rachel Reeves could be back in the autumn, scrambling to find more savings to meet her fiscal rules. Indeed, the OBR warned that her headroom of £9.9bn by 2029/30 is historically small, \"only one-third of the average of £31.3bn that chancellors have set aside against their fiscal rules since 2010\". \n                  British Steel's Chinese owner rejects £500m government aid offer\n                 \n                  OBR slashes UK growth forecast for 2025 but upgrades it for rest of parliament\n                 \n                  Network Rail to set up property company to deliver 40,000 homes\n                 That headroom would have slipped to - £4.1bn in just the six months since October had the chancellor not done a repair job on Wednesday. It could easily slip again. Growth halved The OBR cut its economic projections for this year, halving growth from 2% to 1%. Even that is more optimistic than many other forecasters, including the Bank of England, which has the rate at 0.75%. The chancellor spoke of this as a global phenomenon, but it's clear business and consumer confidence has slipped at home among concerns about higher business taxes that were announced in the autumn budget. These are casting a long shadow on the economy, and their real force will be felt from next month when the rises to national insurance contributions kick in. A better picture for future GDP A bad year, but the OBR subsequently lifted its growth projections for subsequent years. GDP growth jumps to 1.9% in 2026 as inflation, interest rates, and gas prices fall back. Growth averages 1.75% over the rest of the decade, helped by a 0.4 percentage point boost from the chancellor's planning reforms. Those reforms will unlock £15.1bn for the public purse. Ms Reeves said it was the biggest boost to growth the OBR has ever recorded \"for a policy with no fiscal cost\". The watchdog said it would help unlock 305,000 new homes a year by the end of the decade, up from a decade low of around 100,000 in 2024.  Productivity down While it upgraded growth forecasts, the OBR downgraded its productivity projections. Productivity measures our economy's performance - the amount of growth it can generate with the resources it has. Increasing productivity is generally considered to be the key to unlocking better living standards in the long term. The OBR signalled that Britain's working population is larger than previously estimated, as are levels of employment. That's not being reflected in upgrades to the growth forecast, meaning productivity is lower. It said this would leave productivity 1.3% lower in 2029.  A bumpy boost to living standards That has also squeezed living standards. Real GDP per capita was 0.7% below the October forecast and 1.1% lower than it was on the eve of the pandemic. However, strong wage growth means it will recover from this year, and disposable incomes will also enjoy a boost. Labour is celebrating the fact that disposable incomes are up, with households \"£500 a year better off under this government\" but the OBR warned that it was not a smooth journey to better living standards, with the rise in national insurance contributions as well as higher taxes because of frozen income tax thresholds starting to weigh heavily on disposable incomes by 2027. It then picks up again as those thresholds are unfrozen. All of which is to say, there's a bumpy and uncertain journey ahead. Nothing underscores that better than this section from the report: \"Significant uncertainty surrounds domestic and global economic developments. \"If the projected recovery in UK productivity growth fails to materialise, and it continues to track its recent trend, then output would be 3.2% lower, and the current budget would be 1.4% of GDP in deficit by the end of the decade. \"A 0.6 percentage point increase in Bank rate and gilt yield expectations across the forecast would eliminate current balance headroom. \"And if global trade disputes escalate to include 20 percentage point rises in tariffs between the USA and the rest of the world, this could reduce UK GDP by a peak of 1% and reduce the current surplus in the target year to almost zero.\""
    },
    {
        "title": "Inflation eases to 2.8% in February - but big leap lurks",
        "description": "The rate of inflation eased back by more than expected in February, according to official figures released ahead of a predicted leap in the pace of price growth.",
        "url": "https://news.sky.com/story/inflation-eases-to-28-in-february-but-big-leap-lurks-13335919",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-money-blog-shopping_6573331.jpg?20240604185258",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-03-26 06:04:00",
        "Headline": "Declines in the cost of women's fashion are the main driver of the downwards move, according to the ONS, with alcoholic drink costs adding some upwards pressure.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The rate of inflation eased back by more than expected in February, according to official figures released ahead of a predicted leap in the pace of price growth. The Office for National Statistics (ONS) said the rolling annual rate for the consumer price index (CPI) measure of inflation stood at 2.8%, slowing from 3% the previous month. ONS chief economist Grant Fitzner said of the shift: \"Clothing prices, particularly for women's clothing, was the biggest driver of this month's fall. \"This was only partially offset by small increases, for example, from alcoholic drinks.\" Money latest: Why the inflation data matters to you Economists had expected a largely flat picture for the overall pace of price growth last month, but warned it is expected to leap markedly in April when households face inflation-busting increases to many bills. They include those for energy, unless you are on a fixed rate tariff, water, and council tax. The figures, nevertheless, will be welcome for the chancellor ahead of a difficult spring statement to MPs in the Commons. Higher inflation has added to government borrowing costs, reducing Rachel Reeves' headroom to meet her spending rules. The easing in inflation was bang in line with the expectations of the Bank of England amid intense speculation over the timing of the next interest rate cut. Financial market investors are currently split on the prospects for a reduction at the next rate-setting meeting in May, given that the Bank is projecting CPI inflation of 3.7% by the autumn. Two cuts are currently projected over the rest of the year, with a small majority expecting that May's meeting will agree the first. The Bank's job, however, is made much more difficult by the ever shifting threats to prices posed by the Trump administration's trade war.  While some targeted tariffs have proved to be temporary to date, being withdrawn moments after they were imposed, duties on all US steel and aluminium imports have taken effect globally. More clarity should emerge next week when a big escalation is threatened, with a broadening of US tariffs set to encapsulate the UK's biggest trading partner, the European Union, alongside punitive charges on other nations with the largest trading imbalances with America. Domestically, the Bank is also watching for costs being passed on by businesses from April as employer national insurance contribution (NIC) and National Living Wage (NLW) hikes, announced in October's budget, come in to force at the same time as the bills go up. Read more:The way price growth data is collected is changingHow Trump tariffs are affecting the UK David Bharier, head of research at the British Chambers of Commerce, said: \"Volatility will be a key feature for the next few months. \"SMEs (small and medium-sized businesses) are battling shocks from both home and abroad in the form of domestic tax increases and a looming global tariff war. \"Many firms tell us they will have to raise prices and rethink recruitment when NICs and NLW increases kick in next month. Investment is also likely to suffer until greater certainty emerges.\""
    },
    {
        "title": "OBR slashes UK growth forecast for 2025 but upgrades it for rest of parliament",
        "description": "The Office for Budget Responsibility has halved the UK growth forecast for 2025 from 2% to 1%, Chancellor Rachel Reeves has said.",
        "url": "https://news.sky.com/story/uk-growth-forecast-for-this-year-halved-chancellor-says-13335986",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rachel-reeves-spring-statement_6867458.jpg?20250326122730",
        "type": "Politics",
        "Author": "Faith Ridler, politics reporter and Sarah Taaffe-Maguire, business and economics reporter",
        "Date Published": "2025-03-26 13:00:00",
        "Headline": "The Office for Budget Responsibility (OBR) downgraded growth for 2025 but upgraded it for every year after for the rest of this parliament. Its forecasts for the UK economy are for higher unemployment and inflation this year, but it said so-called economic inactivity is lower than thought.",
        "Content": "By Faith Ridler, politics reporter and Sarah Taaffe-Maguire, business and economics reporter   The Office for Budget Responsibility has halved the UK growth forecast for 2025 from 2% to 1%, Chancellor Rachel Reeves has said. However, the fiscal watchdog said that while growth has been downgraded for this year, it had been upgraded for every year after for the rest of this parliament - which is due to end in 2029. The chancellor said she is \"not satisfied with the numbers\" for this year as she delivered her long-awaited spring statement in the House of Commons. Politics latest: Follow live updates But, she explained, the OBR has forecast growth to hit 1.9% in 2026, 1.8% in 2027, 1.7% in 2028, and 1.8% in 2029. Some tough forecasts beyond headline figures The independent forecaster also published its economic outlook on Wednesday, showing there's a 54% chance the chancellor will not break her self-imposed fiscal rules to bring down government debt and balance the budget by 2030. Living standards, as measured by household disposable income, will fall after this year to almost no growth in 2027-28 before rising again due to firms rebuilding profit margins, wage growth slowing, taxes rising, and welfare measures taking effect. The OBR also raised its expectation for unemployment and net migration - the number of people immigrating to the UK minus those emigrating. The unemployment rate, the percentage of people out of work, will rise to 4.5% this year. This is 0.4 percentage points or 160,000 people higher than first thought in the October forecast. Net migration will fall sharply, the OBR said, due to a tightening of visa policies and higher levels of emigration. But the forecast has been upped by 25,000 since October as a higher share of immigrants are staying in the UK under the new migration system.  At the same time, there will be a reduction in people neither in work nor looking for work due to a reduction in caring as birth rates fall and childcare provision is expanded. But there are also fewer people in this position, classed as \"economically inactive\" than previously thought, the OBR said. The government launched its welfare cuts in an effort to reduce this economic inactivity. Further cuts are to come, the OBR said, as \"unprotected\" government departments such as local government justice, the environment, Home Office and culture may need to be cut by 0.8% a year from 2026-27 \"to accommodate assumed commitments in other areas\". Prices overall will go up even higher than initially anticipated, according to the OBR, which now forecasts inflation will rise to 3.8% in July due to higher energy, food and water bills. This will fall rapidly, however, from next year. 'No shortcuts to growth' Ms Reeves told MPs: \"There are no shortcuts to economic growth. It will take long-term decisions. It will take hard yards. It will take time for the reforms we are introducing to be felt in the everyday economy. \"It is right that the Office for Budget Responsibility consider the evidence and look carefully at measures before recognising a growth impact in their forecast.\" The chancellor pointed to changes to the National Planning Policy Framework, saying mandatory housing targets and bringing \"grey belt\" land into scope for development will \"permanently increase the level of real GDP by 0.2% by 2029-30\". This will bring an \"additional £6.8bn in our economy and by 0.4% of GDP within the next 10 years\", she said. Ms Reeves also highlighted reforms to the pension system and a national wealth fund, adding it was part of a \"serious plan\" for economic growth. Also announced in the spring statement today: The chancellor confirmed that a voluntary redundancy scheme is set to launch for civil servants as part of her mission to \"make government leaner\". She said this will deliver £3.5bn in \"day-to-day savings by 2029-30\".  Political reaction Shortly afterwards, Conservative leader Kemi Badenoch accused Labour of financial \"chaos\". She said the spring statement was \"all smoke and mirrors\", adding: \"I remember the last budget when Rachel Reeves said she was smashing glass ceilings, now it feels like the roof is falling over all our heads.\" A handful of Labour MPs were unimpressed with the moves around welfare, with Debbie Abrahams - the MP for Oldham East and Saddleworth - claiming \"all the evidence points to cuts in welfare leading to severe poverty and worsened health conditions\". An impact assessment into Labour's welfare reforms, which include narrowing the eligibility criteria for personal independence payments (PIP), found there could be an additional 250,000 people in \"relative poverty\" by 2030 due to the changes. Richard Burgon, the Labour MP for Leeds East, said \"taking away the personal independence payments\" from disabled people is an \"especially cruel choice\"."
    },
    {
        "title": "Spring statement 2025 key takeaways",
        "description": "Rachel Reeves has delivered her much anticipated spring statement today.",
        "url": "https://news.sky.com/story/spring-statement-2025-key-takeaways-13336004",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-spring-statement-money_6860442.jpg?20250318124659",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-26 09:26:00",
        "Headline": "From welfare cuts to defence spending, here are the main announcements from Chancellor Rachel Reeves.",
        "Content": " Rachel Reeves has delivered her much anticipated spring statement today. The chancellor's statement is not a formal budget - as Labour pledged to only deliver one per year - but rather an update on the economy since her fiscal statement last October. Ms Reeves told MPs \"the world has changed\" since her first budget just under five months ago, and that was to blame for the string of cuts and downgrades she outlined in the Commons. Politics latest: Follow live updates But critics have said today’s update is a direct consequence of her decisions since taking office in July. Here are the key takeaways from the spring statement: The Office for Budget Responsibility (OBR) has halved the UK growth forecast for 2025 from 2% to 1%, Ms Reeves said, adding that she was \"not satisfied with these numbers\". She explained that the government's budget will move from a deficit of £36.1bn in 2025-26 and £13.4bn in 2026-27, to a surplus of £6bn in 2027-28, £7.1bn in 2028-29 and £9.9bn in 2029-30. While the short-term growth forecasts appear gloomy, the chancellor said the OBR predicts the economy will be \"larger\" by the end of the forecast compared with the time of her first budget as a result of her decisions. The OBR expects output to grow 1% in 2025, by 1.9% next year, 1.8% in 2027, 1.7% in 2028 and by 1.8% in 2029. On living standards, real household disposable income per person is expected to grow by an average of around 0.5 percentage points a year from 2025-26 to 2029-30, led by stronger wage growth and inflation starting to fall later in the forecast period. Ms Reeves said disposable income will \"grow this year at almost twice the rate expected in the autumn\", adding: \"Households will be on average over £500 a year better off under this government.\" The chancellor announced further welfare cuts after being told the reforms announced last week will save less than planned - £3.4bn instead of £5bn. Among the latest changes to welfare spending, Ms Reeves said the universal credit health element would be cut by 50% and frozen for new claimants rather than rising in line with inflation. However, the universal credit standard allowance will increase from £92 per week in 2025-26 to £106 per week by 2029-30. The changes will mean a further 150,000 people will not receive carer's allowance or the carer element of universal credit, according to the government's own impact assessment.  The OBR has estimated the new welfare savings package will save £4.8bn. Cuts to welfare will mean 250,000 more people - including 50,000 children - will be pushed into poverty by 2030, the government's assessment predicts. Separately, 800,000 people will not receive the daily living component personal independence payment (Pip) - due to tightening eligibility rules. The chancellor pledged to \"boost Britain's defence industry and to make the UK a defence industrial superpower\". She confirmed the government's pledge to spend 2.5% of GDP by 2027. The Ministry of Defence will get an additional £2.2bn next year, the chancellor said, which will be spent on new high-tech weaponry, upgrading HM Naval Base in Portsmouth, and refurbishing military family homes, among other things. The commitment is fully funded, with cash coming from Treasury reserves and also from the decision to slash foreign aid funding. Ms Reeves said the statement does not contain any further tax increases, but highlighted work that needs to be done to tackle tax evasion. She announced steps to crack down on it, saying the government will increase the number of tax fraudsters charged each year by 20%.She said reducing tax evasion will raise an extra £1bn for the economy. On departmental budgets - which dictate how much different parts of government can spend until 2030 - Ms Reeves said she aims to make the state \"leaner and more agile\". The chancellor also confirmed that a voluntary redundancy scheme is set to launch for civil servants, saying this will deliver £3.5bn in \"day-to-day savings by 2029-30\". Government spending will now grow by an average of 1.2% a year above inflation, compared with 1.3% in the autumn. Planning reforms will see house building reach a more than 40-year high by 2030, the chancellor said. She said the OBR has forecast that the government's reforms will boost house building by 170,000 over the next five years, to 305,000. This would put the government on track to add around 1.3 million to Britain's stock of homes in the UK, a rise of 16%, by the end of parliament. However, reforms will only increase the overall housing stock by 0.5% by the end of 2030, falling short of the government's initial pledge to build 1.5 million houses. How have the markets reacted? The reaction of financial markets to a fiscal event is important, particularly as a poorly received speech can add to government borrowing costs on the bond markets. The good news for the chancellor here is that yields - the premium demanded by investors to hold UK government debt - dipped slightly in the wake of her remarks. Read more:Beth Rigby analysis: Starmer has moved on to Tory territoryEd Conway takes us through economic numbers The yield for UK 30-year bonds, known as gilts, eased by almost 0.1 percentage points to 5.283%. Similar, but smaller, declines were seen for their 10 and two-year counterparts. The only other market reaction to speak of was a dip in the value of the pound, which fell to $1.2873, a two-week low."
    },
    {
        "title": "Chancellor's difficult decisions in spring statement could just be the start",
        "description": "It might not have been a budget, but the spring statement felt like one.",
        "url": "https://news.sky.com/story/chancellors-difficult-decisions-in-spring-statement-could-just-be-the-start-13336344",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-spring-statement-beth_6860429.jpg?20250318123852",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-03-26 21:17:00",
        "Headline": "Government insiders do not scent a rebellion over the spring statement, trusting the chancellor is serious about getting the public finances back on track. But their appetite for cuts was exhausted on Wednesday.",
        "Content": "\n          Political editor\n              @BethRigby\n  It might not have been a budget, but the spring statement felt like one. There was red pen all over the chancellor's economic plans as Rachel Reeves sought to repair deteriorating public finances by cuts that will hit the poorest in society. Faced with a deteriorating economic outlook and rising debt repayment costs, the chancellor was in a tight spot, having made her big call back in October when she executed a - her words - \"once in a generation\" £70bn tax and spend budget to improve public services and drive economic growth. Five months in, the budget is not living up to what was billed. She confirmed on Wednesday that the £9.9bn surplus forecast in 2029/30 had been wiped out, leaving the public finances in the red. Cue a £14bn repair job to restore her fiscal cushion as Reeves told the House of Commons her fiscal rule to fund day-to-day government spending from tax receipts not borrowing by the end of the decade was \"non-negotiable\". No more borrowing and no more tax hikes (for now). \n                  After chancellor's spring statement we end more or less where we began\n                 \n                  'I don't know how we will survive' - fears over benefit cuts and cost of living in chancellor's Leeds constituency\n                 \n                  Extra 50,000 children could be pushed into poverty over welfare changes, says government assessment\n                 The chancellor instead announced billions of spending cuts to make her sums add up and the cuts were hard to stomach for the Labour movement as they watched a Labour chancellor cut the welfare bill by £4.8bn. The government's own assessments estimate that 3.2m families on universal credit will be on average £1,720 worse off a year by 2029/30 while 250,000 adults and 50,000 more children are set to be pushed into relative poverty, according to the government's own impact assessment.  I don't need to tell you how uncomfortable this is for many Labour MPs and the clamour against cuts was plain to see, not only in the Commons as MPs stood up to rail against \"cruel cuts\" and urge the chancellor to think again, but outside Downing Street too as protesters gathered. For now, MPs, and government insiders, tell me they don't scent a full-blown rebellion. One seasoned MP told me that while MPs are very concerned about how these cuts will be implemented and reaction from constituents, they also \"generally still recognise the tough circumstances\" with \"no one in doubt Rachel Reeves is serious about turning around public finances\". Government figures argue they do not think the fall-out from the cuts will be as bad as their own assessment, pointing out that the calculations don't take into account the rise in national living wage, the government's poverty plan for around 700,000 vulnerable families and changes to employment support as part of the welfare reform that should help people back into work. But that does not mean the difficulties are not piling up for this chancellor even if on Wednesday she managed to buy a bit of political space as she repaired her black hole, avoided an emergency budget and could at least point to upgrades to the growth forecasts after 2026. Read More:Spring statement 2025 key takeawaysAfter the spring statement we end more or less where we began There was also a rabbit of sorts - the chancellor looks very happy about this - as she announced that the government's planning reforms would add nearly £7bn to the economy over the next five years. This is something to grasp on to for a politician groping around for a bit of good news and something to sell to her MPs: Stick with me the growth plan is going to work. But what is plain to see is that this is a repair job rather than a fix. As the Office of Budget Responsibility itself noted, the £9.9bn headroom Reeves has re-built to stick to her fiscal rules is flimsy and fragile and could easily be wiped out by trade wars, an interest rate shock or market volatility in these deeply uncertain times. So, the question on everyone's lips is will she have to come back for more in a few months? When I asked her at this afternoon's press conference, she said only that the government was, as demonstrated on Wednesday, \"determined to live within its means\". But it's obvious that further tax rises or spending cuts could soon be on the cards if she remains determined to stick to her fiscal rules and not borrow more. 👉 Listen to Sky News Daily on your podcast app 👈 What is clear too is that the appetite for further spending cuts from her own party is pretty much exhausted. Labour MPs were vocal about that in the chamber, demanding taxes on the rich rather than benefit cuts on the poor, while those who are sticking with the chancellor now also know all too well that pressure will build to raise revenue elsewhere. The chancellor may have managed to navigate a difficult day, but the months ahead look set to become harder still. The difficult decisions now could be just the start."
    },
    {
        "title": "Spring statement: Beth Rigby and Ed Conway on Rachel Reeves's changed plan",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/spring-statement-beth-rigby-and-ed-conway-on-rachel-reevess-changed-plan-13336162",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-bethrigby-edconway_6867617.jpg?20250326144509",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-26 14:45:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈 Chancellor Rachel Reeves has set out her plans for the UK economy during her spring statement in the House of Commons.  It came as the Office for Budget Responsibility (OBR) - which monitors the government's spending plans - unveiled its latest economic forecasts. Liz Bates is joined by Sky's political editor Beth Rigby, and economics and data editor Ed Conway, to pick through the detail and discuss why the chancellor changed her original plan. Producer: Natalie KtenaEditor: Philly Beaumont"
    },
    {
        "title": "Network Rail to set up property company to deliver 40,000 homes",
        "description": "Network Rail will set up a new property company to build 40,000 homes on its rail estate over the next decade in a drive to meet the government's housing target.",
        "url": "https://news.sky.com/story/network-rail-to-set-up-property-company-to-deliver-40000-homes-13336399",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-house-houses-home-estate_6796583.jpg?20250111100023",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-03-26 21:53:00",
        "Headline": "It is part of a drive to free up unused public land to help the government deliver its manifesto pledge to build 1.5m homes over this parliament. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Network Rail will set up a new property company to build 40,000 homes on its rail estate over the next decade in a drive to meet the government's housing target. The Treasury on Thursday announced the launch of a new cross-government taskforce to release surplus public land for housing, with unused Ministry of Defence (MOD) sites also to be among the first to be released. Announcing the plan, Chancellor Rachel Reeves said it would \"unlock the next generation of homeowners\", as the government strives to deliver 1.5 million new homes by the end of this parliament. It comes after the UK's fiscal watchdog estimated efforts to unblock the planning system will result in the highest levels of house building in 40 years, adding around £6.2bn to the UK's economy by 2029.  The figures were a rabbit out of the hat in the Office for Budget Responsibility's (OBR) economic forecast, which downgraded growth for this year as predicted, forcing Ms Reeves to announce a raft of spending cuts in order to stick to her fiscal rules. Speaking a day after Wednesday's spring statement, the chancellor described surplus government land as \"a huge untapped resource that could create opportunities for the next generation of homeowners\". She added: \"In contrast to the failed approach of the past, we are making the best use of public land to build the homes that families and our Armed Forces need, improving opportunities for homeownership and creating jobs across the country. \n                  OBR slashes UK growth forecast for 2025 but upgrades it for rest of parliament\n                 \n                  Spring statement 2025 key takeaways\n                 \n                  Chancellor's difficult decisions in spring statement could just be the start\n                 \"The OBR (Office for Budget Responsibility) has confirmed our planning reforms will result in housebuilding being at its highest in over 40 years - that won't just bring jobs and economic growth - but also will give families the homes that they deserve, delivering on our plan for change.\" Surplus MOD sites will pioneer the scheme, with the department to transfer land at Chetwynd Barracks in Nottinghamshire and Wyton Airfield in Cambridgeshire to Homes England for over 1,300 new properties. Deverell Barracks, near Ripon, North Yorkshire, will also be released to expedite the delivery of another 1,300 homes - with work to start within 12 months. Read More:Chancellor's difficult decisions could just be the startSee how your finances have changed after spring statementSpring statement 2025 key takeaways Defence Secretary John Healey has identified opportunities to build more than 100,000 homes on surplus military land in future, the Treasury added. Part of this will include a commitment to building new military family homes, following the return of Armed Forces housing to public ownership earlier this year. Network Rail plans to create its own development company, which will become operational later this year.  This will include as many as 5,000 homes at Newcastle Forth Yards; 1,500 homes at Manchester Mayfield station, and a mixed-use development in Nottingham which could yield 425 homes. It is not clear how many could be affordable housing. On Tuesday, the government announced £2bn for 18,000 new homes, saying it expects half of them to be affordable. But charities called for the \"vast majority\" to be for social rent as homelessness hits record highs across the country. The funding was described by the government as a \"down payment from the Treasury\" ahead of longer-term investment in social and affordable housing expected to be announced later in the year."
    },
    {
        "title": "Farage and NatWest agree to settle debanking dispute",
        "description": "The Reform UK leader Nigel Farage has settled his debanking dispute with NatWest Group, nearly two years after the closure of his accounts sparked a chain of events culminating in the resignation of the lender's chief executive.",
        "url": "https://news.sky.com/story/farage-and-natwest-agree-to-settle-debanking-dispute-13336016",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-nigel-farage-natwest_6827889.png?20250213165715",
        "type": "Politics",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-26 09:42:00",
        "Headline": "The Reform UK leader has agreed to end his dispute with the high street banking giant nearly two years after the closure of his Coutts accounts led to the ousting of its former CEO, Sky News can exclusively reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The Reform UK leader Nigel Farage has settled his debanking dispute with NatWest Group, nearly two years after the closure of his accounts sparked a chain of events culminating in the resignation of the lender's chief executive. Sky News can reveal that Mr Farage and NatWest have agreed to resolve their row, with the bank thought to have agreed to pay him an unspecified sum in damages. In return, Mr Farage is understood to have withdrawn the threat of potential civil and criminal proceedings against NatWest over the issue. Money blog: Are you better or worse off after the spring statement? Nick Candy, the Reform treasurer, is said to have played a key role in resolving the dispute between the two sides during mediation talks held at a London law firm on Tuesday. Precise details of the settlement were unclear on Wednesday evening. Responding to an enquiry from Sky News, Mr Farage and NatWest said in a joint statement: \"NatWest Group and Nigel Farage MP are pleased to confirm that they have resolved and settled their dispute, and the bank has apologised to Mr Farage. \n                  Nigel Farage would turn UK into a 'Trump tribute act', Lib Dem leader Sir Ed Davey says\n                 \n                  Rupert Lowe says Reform leader Nigel Farage 'must never be PM' in latest attack amid leaks of WhatsApp messages\n                 \n                  Reform UK's Andrea Jenkyns says Nigel Farage's row with Rupert Lowe was 'clearly a big falling out' - but insists it will 'blow over'\n                 \"The terms of settlement are confidential.\" Mr Farage was originally expected to seek millions of pounds from the company, alleging that the debanking row had damaged his reputation. The furore which claimed the scalp of Dame Alison Rose, NatWest's former chief executive, in the summer of 2023 centred on whether the bank's Coutts subsidiary had decided to close Mr Farage's accounts for commercial or political reasons. NatWest initially claimed the motivation was commercial, before Mr Farage obtained internal evidence from the bank suggesting that his political views had been a pivotal factor in the decision. A subsequent - and inaccurate - BBC News report further exacerbated the controversy after it emerged that the journalist who wrote the story had sat next to Dame Alison at a charity dinner when the row was at its height. It sparked a firestorm under the then Conservative government, with Rishi Sunak and Jeremy Hunt, the prime minister and chancellor respectively, indicating to NatWest's board that they had lost faith in Dame Alison's ability to lead the bank. An emergency late-night board meeting led to Sir Howard Davies, who at the time was NatWest's chairman, concluding that Dame Alison would need to step down - despite her having publicly apologised to Mr Farage for the bank's treatment of him. Since then, both have been replaced, with the former Ocado and MasterCard chairman Rick Haythornthwaite replacing Sir Howard, and Paul Thwaite now in his second year as the company's chief executive. NatWest has since reported a surge in profitability and is now on the verge of returning to full private sector ownership. Earlier this week, it disclosed that the government now owns less than 4% of its shares, with the sale of its remaining holding expected by the early summer. Then known as Royal Bank of Scotland Group and run by Fred Goodwin, RBS was bailed out in 2008 with £45.5bn of taxpayers' money. Its journey back to full private ownership has been a meandering one, and taxpayers will ultimately have lost billions of pounds on the government's rescue deal. On Wednesday afternoon, shares in NatWest closed at 463.9p, giving the bank a market capitalisation of over £37bn. The stock has risen by more than 75% during the last year. The debanking row which claimed Dame Alison's job prompted the City watchdog to order a change to the treatment by financial institutions of so-called politically exposed persons (PEPs). Since his initial promise to turn the issue into a mainstream battle against the major UK banks, Mr Farage's status as one of Britain's most influential politicians has been cemented. He led Reform to a handful of seats at last year's general election, while his party finished in second place in scores of other constituencies. An opinion poll for Sky News by YouGov earlier this year put Reform ahead of both Labour and the Tories for the first time."
    },
    {
        "title": "Extra 50,000 children could be pushed into poverty over welfare changes, says government assessment",
        "description": "An additional 50,000 children could be pushed into poverty as a result of welfare cuts, according to the government's own impact assessment.",
        "url": "https://news.sky.com/story/extra-50000-children-could-be-pushed-into-poverty-over-welfare-changes-says-government-assessment-13336097",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-schools-education-hygiene_6748973.jpg?20241115130443",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-03-26 12:28:00",
        "Headline": "Labour MPs have begun voicing their disquiet after the government's own impact assessment was published - with one accusing the chancellor of making \"cruel\" choices.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  An additional 50,000 children could be pushed into poverty as a result of welfare cuts, according to the government's own impact assessment. Documents published following Rachel Reeves' spring statement, where she confirmed previously announced changes to the welfare system, laid out the numbers who are likely to be affected. The Department for Work and Pensions (DWP) estimates another 250,000 people - including 50,000 children - could be pushed into relative poverty in the financial year ending 2030. Politics latest: Chancellor holds news conference after deeper cuts revealed Overall, 3.2 million families are expected to lose an average of £1,720 by the end of 2030 due to the changes. The figures are likely to cause further disquiet among Labour backbenchers, who had already expressed concern at the cuts when they were announced by Work and Pensions Secretary Liz Kendall last week. Speaking to Sky News, Labour MP Rachael Maskell said the spring statement confirmed her \"worst fears\". \n                  Celebrities urge government to reverse 'shameful' welfare cuts\n                 \n                  Is Rachel Reeves about to have a very tough week?\n                 \n                  Starmer defends 'vital' benefit cuts - as he cites cases of his late mother and brother\n                 She criticised the \"significant cuts\" to Personal Independence Payments (PIP), one of the main types of disability benefit, describing it as a \"lifeline for so many people in work and out of work\". Ms Maskell - who said she was prepared to vote against the changes - said they would have a \"catastrophic impact on some of the most vulnerable in our society\". She said her colleagues were \"worried about their constituents who are vulnerable - we see them in our surgeries, and we see them on our streets\". \"We need to reassure them that we have their back,\" she added.  Read more:Spring statement 2025 key takeawaysOBR slashes UK growth forecast for 2025 The chancellor earlier confirmed she would have to implement more welfare savings than she had initially planned after the Office for Budget Responsibility (OBR) said reforms announced last week would save £3.4bn instead of the £5bn ministers thought. To make up the shortfall, Ms Reeves said the health element of universal credit would be cut by 50% and frozen for new claimants rather than rising with inflation. However, the universal credit standard allowance will increase from £92 per week in 2025-26 to £106 per week by 2029-30. Asked about the poverty figures in a press conference after the spring statement, Ms Reeves said the impact assessment did not take into account measures the government was taking to get people back into work. She said: \"We're confident that the changes that we are making and the support that we're providing to get people into work will result in more people having fulfilling careers, paying decent wages. \"And that is the best way to lift families out of poverty.\" Other key findings in the impact assessment include: Political correspondent The mood has darkened among Labour MPs as the impact assessment - for the cuts announced by Welfare Secretary Liz Kendall last week - was unveiled by the Department for Work and Pensions.\n\n Labour MPs privately described it as \"cruel\" and \"very difficult\".  One rising star of the 2024 intake told me \"no one is being honest here\".\n\n \"We are doing this to make the numbers add up for the OBR,\" they said, although they added that MPs understood the huge growth in benefit claims had to be addressed.\n\n Ministers have insisted the impact did not take account of measures to help some of those families into work (although many recipients of personal independence payments are in work), or the impact on children of free breakfast clubs and falling childcare costs. \n\n Sources close to Liz Kendall said she was pleased with the £1.4bn the chancellor had put into employment support to help people back into work - the biggest package in years. \n\n In the Commons, there were early signs of a backlash among Labour MPs. Debbie Abrahams, MP for Oldham East and Saddleworth and the chair of the work and pensions select committee, said: \"All the evidence points to cuts in welfare leading to severe poverty and worsened health conditions. How will making people sicker and poorer get people into jobs?\" Richard Burgon, MP for Leeds East, said: \"Making cuts instead of taxing wealth is a political choice, and taking away the personal independence payments from so many disabled choice is an especially cruel choice. \"A disabled person who can't cut up their own food without assistance, and can't go to the toilet without assistance, and can't wash themselves without assistance will lose their personal independence payment.\""
    },
    {
        "title": "Assisted dying in doubt as rollout could be delayed until at least 2029",
        "description": "Assisted dying may not available in England and Wales until at least 2029 after MPs approved an extension of the rollout period.",
        "url": "https://news.sky.com/story/assisted-dying-in-doubt-as-rollout-could-be-delayed-until-at-least-2029-13335894",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-assisted-dying-kim-leadbeater_6825461.jpg?20250211124522",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-26 01:56:00",
        "Headline": "A Liberal Democrat MP warns the delay could push assisted dying legislation beyond the next general election - meaning it could be \"abandoned altogether\".",
        "Content": "Assisted dying may not available in England and Wales until at least 2029 after MPs approved an extension of the rollout period. An initial two-year \"backstop\" will now increase to four years after the change was proposed by Kim Leadbeater, the Labour MP behind the Terminally Ill Adults (End of Life) Bill. Ms Leadbeater said she was disappointed to propose the extension and acknowledged the \"upset\" felt by some supporters of the bill, but said it was \"more important to do this properly than to do it quickly\". The four-year delay, passed by the committee scrutinising the legislation, now means the law is unlikely to be operational until at least 2029 - the year by which the next general election must take place. After the vote in the early hours of Wednesday, Ms Leadbeater said the bill will come back to the Commons in a \"safer, fairer, and more workable\" form. MPs on the committee also voted for assisted dying to be available free on the NHS. One MP said the extension of the backstop risked the bill being abandoned. Tom Gordon, a Liberal Democrat MP, told The Guardian that \"delaying implementation risks pushing it beyond the next election, where it could be abandoned altogether\". \"We have thoroughly scrutinised and strengthened this bill, ensuring it is safe and robust. Every extra year means more unnecessary suffering for those who cannot afford to wait,\" Mr Gordon said.  The charity Humanists UK, which backs the assisted dying bill, said it regretted the delay. Its chief executive Andrew Copson said: \"Many other countries already have safe assisted dying laws and none of them has taken more than 19 months to implement them, apart from one that was subject to a court challenge. \"So it really shouldn't have to take four years for the one here. If it does, people who need this change in law will continue to die in ways not of their choosing.\" But Conservative MP Danny Kruger argued that the bill was a fundamental change to the founding principles of the NHS, which he said would become the \"national health and assisted suicide service\". Read more:What is in the legislation?Assisted dying is the biggest societal change in 50 years The overnight vote marks the end of two months of committee scrutiny, and the bill is likely to return for a debate and vote by all MPs in the coming months. Opponents of the bill have warned that people could be put under pressure to end their lives. But supporters have said the law will allow people suffering with difficult illnesses the choice over when to end their lives. Last month, Ms Leadbeater removed a key safeguard that said every assisted dying case must be scrutinised by a High Court justice. Citing concerns this could overwhelm the court system, Ms Leadbeater instead proposed that cases will be reviewed by panels including a senior lawyer, a psychiatrist, and a social worker. The bill would allow terminally ill adults in England and Wales who are expected to die within six months to request assistance from a doctor to end their life. MPs initially voted in support of the bill in November, with 330 MPs supporting it and 275 rejecting it. Meanwhile, the Isle of Man's parliament became the first part of the British Isles to pass assisted dying legislation. Its assisted dying bill will be sent for royal assent, having had its final reading by members of the legislative council on Tuesday. The bill, for adults resident on the island for five years who have a terminal illness with a life expectancy of no more than 12 months, could formally become law later this year with an assisted dying service potentially in place by 2027."
    },
    {
        "title": "New Alba Party leader Kenny MacAskill vows to 'deliver dream of independence'",
        "description": "Kenny MacAskill has pledged to deliver Alex Salmond's \"dream of independence\" for Scotland after being elected as the new leader of the Alba Party.",
        "url": "https://news.sky.com/story/new-alba-party-leader-kenny-macaskill-vows-to-deliver-dream-of-independence-13336072",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-alba-party-kenny-macaskill_6867441.jpg?20250326120520",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-26 11:29:00",
        "Headline": "Kenny MacAskill won the leadership contest with 1,331 votes (52.3%) to MSP Ash Regan's 1,212 (47.7%).",
        "Content": "Kenny MacAskill has pledged to deliver Alex Salmond's \"dream of independence\" for Scotland after being elected as the new leader of the Alba Party. Former first minister Mr Salmond founded the party after leaving the SNP and his death last year left it searching for a new leader. Acting leader Mr MacAskill won the leadership contest with 1,331 votes (52.3%), the party announced at an event in Edinburgh on Wednesday. The former MSP and MP beat rival candidate MSP Ash Regan, who secured 1,212 votes (47.7%).  The contest was triggered after Mr Salmond, 69, died of a heart attack while attending a conference in North Macedonia in October. Following his election, Mr MacAskill said: \"This was an election brought about by the tragic passing of our founder Alex Salmond. \"He will never be forgotten but the duty that now falls to me and all Alba Party members is to deliver his dream of independence.\" Read more:10th anniversary of the Scottish independence referendum Neale Hanvey was elected to replace Mr MacAskill as depute leader, winning 77.8% of votes cast to the 22.2% which went to challenger Chris McEleny. The Alba Party was set up by Mr Salmond in the lead up to the 2021 Holyrood election. No party candidate has been elected at the ballot box. Mr MacAskill, a former SNP justice secretary, defected to Alba in 2021 while serving as MP for East Lothian. He contested the Alloa and Grangemouth seat at last year's general election but lost out to Labour's Brian Leishman. Mr Hanvey also defected from the SNP to Alba in 2001 while MP for Kirkcaldy and Cowdenbeath. He stood for the renamed Cowdenbeath and Kirkcaldy constituency in the 2024 general election but was defeated by Labour's Melanie Ward."
    },
    {
        "title": "HIV deaths and infections will rise as a result of foreign aid cuts, study warns",
        "description": "HIV deaths and infections will rise as a result of cuts to foreign aid, a study has warned.",
        "url": "https://news.sky.com/story/hiv-deaths-and-infections-will-rise-as-a-result-of-foreign-aid-cuts-study-warns-13336152",
        "image_url": "https://e3.365dm.com/23/02/1920x1080/skynews-hiv-aids-test-tube_6064013.jpg?20230220153918",
        "type": "Technology",
        "Author": "Samuel Osborne",
        "Date Published": "2025-03-26 14:17:00",
        "Headline": "Funding cuts could undo decades of progress and cause infections and deaths to surge to levels not seen since the early 2000s, researchers say.",
        "Content": "\n          News reporter\n              @samuelosborne93\n HIV deaths and infections will rise as a result of cuts to foreign aid, a study has warned. Funding cuts could undo decades of progress and cause infections and deaths to surge to levels not seen since the early 2000s, researchers said. They estimate there could be up to 10.8 million additional HIV infections in low and middle-income countries by 2030. Meanwhile, the number of HIV-related deaths in children and adults could reach 2.9 million by 2030. The study comes after Sir Keir Starmer's decision to cut overseas spending from 0.5% of gross national income to 0.3% over the next two years in order to fund defence commitments. The move led to the resignation of Anneliese Dodds as international development minister.  US President Donald Trump has ordered a pause in most US foreign aid spending and announced the country would withdraw from the World Health Organization. In a paper published in The Lancet HIV, researchers said international donors have contributed around 40% of all HIV funding in low and middle income countries since 2015. They said the UK, the US, France, Germany and the Netherlands account for over 90% of international funding. However, they point out that all the countries have recently announced plans to cut foreign aid, leading to a projected 24% reduction in international HIV funding by 2026. Through mathematical models the predominantly Australian-based researchers estimated there could be between 4.4 million and 10.8 million additional new HIV infections in low and middle income countries by 2030 and between 770,000 and 2.9 million HIV-related deaths in children and adults by the same year. Read more from Sky News:Bird flu strain 'has potential to become pandemic'Prince Harry quits charity after battle with chair \"The United States has historically been the largest contributor to global efforts to treat and prevent HIV, but the current cuts to Pepfar [the US President's Emergency Plan for AIDS Relief] and USAid-supported programmes have already disrupted access to essential HIV services including for antiretroviral therapy and HIV prevention and testing,\" said co-lead study author Dr Debra ten Brink of the Burnet Institute in Australia. \"Looking ahead, if other donor countries reduce funding, decades of progress to treat and prevent HIV could be unravelled. \"It is imperative to secure sustainable financing and avoid a resurgence of the HIV epidemic which could have devastating consequences, not just in regions such as sub-Saharan Africa, but globally.\" A spokesperson for the Foreign, Commonwealth and Development Office said: \"The UK provides significant funding to the global HIV response, supporting work to end AIDS-related deaths and prevent new HIV infections. \"We remain firmly committed to tackling global health challenges, not only because it is the right thing to do, but also because it will help us deliver on our Plan for Change in the UK by supporting global stability and growth.\""
    },
    {
        "title": "Surgeons carry out world's first pig-to-human liver transplant",
        "description": "Surgeons have carried out the world's first liver transplant from a pig into a human recipient.",
        "url": "https://news.sky.com/story/surgeons-carry-out-worlds-first-pig-to-human-liver-transplant-13336159",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-pig-farm_6867618.jpg?20250326144548",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-03-26 14:34:00",
        "Headline": "The operation used a liver from a pig that had been genetically modified to reduce the chance of the organ being rejected by a human immune system.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n Surgeons have carried out the world's first liver transplant from a pig into a human recipient. The operation, carried out in China, used a liver from a pig that had been genetically modified to reduce the chance of the organ being rejected by a human immune system. The organ successfully produced bile and essential proteins in a patient who was brain-dead, but still alive. Relatives asked for the experiment to be stopped after 10 days, but the researchers say the organ could have functioned for longer. They hailed the transplant as a \"great achievement\", and European experts have called it a significant milestone that could save lives in future. The surgical team, from Xijing Hospital in Xi'an, took the liver from a Bama miniature pig that had six key genes modified to improve compatibility of an organ when transplanted into a human. According to results published in the science journal Nature, the liver functioned normally, with good blood flow and no signs of rejection. Professor Lin Wang, who led the research team, said the transplant was carried out with full ethical approval from medical authorities and consent from the patient's family. \"Surgery was really successful,\" he told a news conference. \"The liver from the pig functioned very well in the human body. So it's a great achievement.\" Read more from Sky News:Bird flu strain 'has potential to become pandemic'Prince Harry quits charity after battle with chair Hearts and kidneys from genetically modified pigs have already been transplanted into a handful of living patients. Most died within weeks of the operation, but two people who had pig kidneys are understood to have survived in the United States. Professor Wang said a liver transplant from a pig is far more complicated. \"A heart is just a pump, the kidney only produces urine,\" he said. \"But the liver has many functions, so this is a huge obstacle for us to solve.\" Several research groups are experimenting with pigs raised in super-clean facilities for organ donation. Pigs are used because their organs are similar in size and structure to those in a human. But key genes need to be modified to reduce the risk of them being attacked by a patient's immune system after transplantation. The Chinese researchers propose using pig organs as a temporary support, either to take the pressure off a patient's liver so it can regenerate, or to give more time to find a permanent organ from a suitable human donor. There are currently more than 600 patients on the waiting list for a liver transplant in the UK. The average wait for an organ from a deceased donor is three to four months. Ivan Fernandez Vega, professor of pathological anatomy at the University of Oviedo in Spain, described the experiment as an important \"milestone\". \"The clinical implications are highly relevant, as optimising this approach could expand the pool of available organs and save lives in liver emergencies,\" he said. The Chinese team is planning to repeat the experiment in more brain-dead patients, for longer periods, before progressing to the first clinical transplants in living people."
    }
]