[
    {
        "title": "'Better late than never': Palestinian minister says UK recognition of state would be 'courageous step'",
        "description": "Britain will be taking \"a courageous step at a very difficult time\" by officially recognising a Palestinian state, according to the authority's foreign minister, who told Sky News she believes the announcement - expected in the coming days - will inspire more nations to follow suit.",
        "url": "https://news.sky.com/story/better-late-than-never-palestinian-minister-says-uk-recognition-of-state-would-be-courageous-step-13434423",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-palestine-west-bank_7025862.jpg?20250920170605",
        "type": "Home",
        "Author": "Adam Parsons",
        "Date Published": "2025-09-20 15:58:00",
        "Headline": "The Palestinian Authority's foreign minister also says she is \"very angry\" with the White House over its \"unwavering support\" for Israel.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  Britain will be taking \"a courageous step at a very difficult time\" by officially recognising a Palestinian state, according to the authority's foreign minister, who told Sky News she believes the announcement - expected in the coming days - will inspire more nations to follow suit. The Palestinian Authority's foreign minister, Varsen Aghabekian, told me Britain's move was \"better late than never\", and said \"Britain, with its weight, can influence other countries to come forward and recognise, because that is the right thing to do\". But she also said she is \"very angry\" with the White House over its \"unwavering support\" for Israel, and said that Israel's refusal to pass on tax revenue was pushing Palestinian civil society to the brink of \"collapse\".    Aghabekian was speaking as Britain, along with France, Canada and Australia, prepares to recognise the State of Palestine officially at the United Nations. She told me: \"Britain has been supporting the existence and the flourishing of Israel for some time, but I think today Britain is looking at the matter objectively, in terms of the right of people, in terms of complying with international law, and in terms of the future of this area for both the Israelis and Palestinians.\" \n                  'Israeli strikes' on Yemen newspaper offices 'mark deadliest attack on press in 16 years'\n                 \n                  Starmer to announce formal recognition of Palestine as a state\n                 \n                  Why Starmer's move to recognise Palestine is a major shift\n                 She rejected the idea that recognising Palestine was a reward for Hamas terrorism, saying that \"non-recognition\" would also be a \"reward to the extremists\" and said that \"if we wait until Israel decides it wants to go into negotiations with the Palestinians, then it won't happen\". Aghabekian told me she expected Gaza to be returned to the Palestinians, but I put it to her that Israeli Prime Minister Benjamin Netanyahu was being empowered by the diplomatic support he receives from America, and in particular, US President Donald Trump. So is she angry with the White House? \"Very angry, because I expect the White House and the United States of America to align with international law, with human rights, with having no double standards. \"This unwavering support for Israel, this blind support, is not only harming the Palestinians but also Israeli society.\" Read more:What does recognising a Palestinian state mean?Gaza could be 'real estate bonanza', Israeli minister says The state of Palestine is already recognised by three-quarters of the United Nations' members. It comprises two separate territories - the West Bank, including East Jerusalem, and the Gaza Strip. Together, they are officially known as the Occupied Palestinian Territories. The West Bank has been subject to Israeli military occupation since 1967, while Gaza has been attacked by Israel since the Hamas attacks of 7 October 2023, when nearly 1,200 Israelis were killed and around 250 people were taken hostage. Since then, more than 65,000 people have been killed in Gaza as Israel has sought to destroy Hamas and recover its hostages. There are 48 hostages still in Gaza, with 20 believed to be alive. She confirmed to me that Mahmoud Abbas, leader of the Palestinian Authority, which governs the West Bank, \"has given guarantees in letters to various leaders around the globe that said Hamas will not be part of the governance of the Gaza Strip\" and insisted there was \"probably a worldwide consensus\" on the topic.  But she also insisted it was \"not reasonable\" to talk of completely erasing Hamas: \"Hamas is an ideology, not a building that you bring down. Hamas is in people's minds; in their heads. \"Those who support Hamas need to see a future, need to see something that is moving on the political level, need to see that there might be a state in which their children and their grandchildren might prosper. \"What people see today, whether they are Hamas supporters or not, they see darkness and they see destruction all over. They see violation of rights. They are helpless and hopeless. People need to see things are moving forward, and once that happens, there will be a shift in the mood, and they will look for a better future.\" But just as the Palestinians prepare to welcome recognition, Aghabekian said the West Bank was facing financial collapse as Israel continues to withhold hundreds of millions of dollars of tax revenue that, under a 30-year-old agreement, it collects on the Palestinian Authority's behalf. Israel has retained a proportion of the money since the start of the war in Gaza, but, encouraged by finance minister Bezalel Smotrich, it has recently withheld a much higher amount. \"People have not been paid, civil servants are only receiving small parts of their salaries. We can't buy medical supplies, equipment, you name it,\" said Aghabekian. \"How can a government run a country under such conditions? So yes, we are very worried.\""
    },
    {
        "title": "British fighter jets defend Polish skies after Russian drone incursion",
        "description": "Two British fighter jets have flown their first defence mission over Poland after a Russian drone incursion into the country&#8217;s skies. ",
        "url": "https://news.sky.com/story/british-fighter-jets-defend-polish-skies-after-russian-drone-incursion-13434752",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-typhoon-poland-raf_7026433.jpg?20250920153312",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-20 21:00:00",
        "Headline": "Two RAF typhoons were deployed as part of a NATO operation to bolster Europe's eastern flanks to deter potential Russian aggression. ",
        "Content": "Two British fighter jets have flown their first defence mission over Poland after a Russian drone incursion into the country’s skies.  The flight was part of NATO's operation \"Eastern Sentry\", launched to bolster Europe's eastern flank after Poland shot down Russian drones earlier this month. A Russian drone was intercepted flying over Romania days later, while three Russian jets entered Estonian airspace without permission for 12 minutes on Friday. The three incursions into NATO airspace fuelled concerns about the potential expansion of Russia's three-year war in Ukraine and have been seen as an attempt by Moscow to test the military alliance's response. The incident over Poland prompted its prime minister, Donald Tusk, to warn that his country was the closest to \"open conflict\" it had been since the Second World War, while the UK announced it would provide Warsaw with extra air cover. Two RAF Typhoons, supported by an RAF Voyager air-to-air refuelling plane, took off from RAF Coningsby, in Lincolnshire, on Friday night to defend Poland's skies before returning safely early on Saturday morning. Defence Secretary John Healey said the mission sends a clear signal that \"NATO airspace will be defended\". \n                  Britain is buying new air defence missile systems - but can they protect us?\n                 \n                  Another arrest after aircraft vandalised at RAF Brize Norton\n                 \n                  WWII Mosquito pilot who carried out 50 bombing raids across Germany shares memories of VE Day\n                 \"I'm proud of the outstanding British pilots and air crew who took part in this successful operation to defend our allies from reckless Russian aggression.\" He said the mission was \"especially poignant\" coming as the UK marks the 85th anniversary of the Battle of Britain - when Polish pilots came to the aid of the UK - this weekend. The head of the RAF, Air Chief Marshal Harv Smyth, said: \"This sortie marks the RAF's first operational mission on Eastern Sentry, reinforcing the UK's steadfast commitment to NATO and its allies. \"We remain agile, integrated, and ready to project airpower at range.\""
    },
    {
        "title": "Thousands of prison officers to get stab-proof vests - and hundreds will be given Tasers",
        "description": "Up to 10,000 more prison officers will get stab-proof vests while hundreds will be given Tasers after a string of high-profile attacks.",
        "url": "https://news.sky.com/story/thousands-of-prison-officers-to-get-stab-proof-vests-13435212",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-prison-body-armour_7027019.jpg?20250920200805",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-20 23:01:00",
        "Headline": "The announcement comes after a string of high-profile attacks. ",
        "Content": " Up to 10,000 more prison officers will get stab-proof vests while hundreds will be given Tasers after a string of high-profile attacks. Justice Secretary David Lammy announced £15m worth of new kit during a visit to Category A Belmarsh prison, in southeast London. The number of vests available will rise from 750 to 10,000, with 5,000 earmarked to equip every officer working in high-security facilities. Use of Tasers will also be ramped up after a trial of 20 specialist staff, with up to 500 officers to be trained to use the 1,500-volt weapons. The move comes after three officers were taken to hospital with serious injuries after they were allegedly attacked with hot oil and makeshift weapons at maximum-security HMP Frankland, in County Durham, in April. Manchester Arena bomb plotter Hashem Abedi, 28, has been charged with three counts of attempted murder, assault occasioning actual bodily harm and unauthorised possession of a knife or offensive weapon. He is yet to enter pleas to the charges and is next due in court on 25 September. \n                  Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation\n                 \n                  David Lammy given formal warning over lack of licence during fishing trip with JD Vance - but will avoid fine\n                 \n                  David Lammy refers himself to watchdog after fishing with US vice president\n                 During Mr Lammy's visit to Belmarsh, a prison officer of seven years told reporters he had seen colleagues stabbed and admitted to hospital. Mr Lammy said: \"I am determined to restore tough law and order, ensure prisons are fit for purpose, and make our streets safer. \"Our dedicated prison officers put themselves in harm's way every day to protect us. \"This new investment sends a clear message: we back our staff and we will give them the tools they need to do their jobs safely.\" Tory shadow justice secretary Robert Jenrick welcomed the measures, adding: \"Frontline officers have been left exposed for far too long. They cannot afford more delays - this equipment needs to reach them immediately. \"The situation in our prisons is a national security emergency. The Justice Secretary must immediately roll out anti-drone technology to stop weapons - and potentially guns - being flown into prisons. \"Every day the Justice Secretary delays, lives are put at risk.\" The new measures also come as legislation to tackle the prison capacity crisis was introduced to parliament earlier this month. The Sentencing Bill came just before Prime Minister Sir Keir Starmer's major cabinet reshuffle that saw former justice secretary Shabana Mahmood replaced by Mr Lammy, and followed a year of emergency measures to tackle jail overcrowding."
    },
    {
        "title": "Ed Davey attacks Reform and Nigel Farage as he pushes for emergency measures to clear asylum backlog",
        "description": "Sir Ed Davey kicked off the Lib Dem conference by attacking Reform and Nigel Farage as he pushed for emergency measures to clear the asylum backlog in a \"humane\" way.",
        "url": "https://news.sky.com/story/ed-davey-attacks-reform-and-nigel-farage-as-he-pushes-for-emergency-measures-to-clear-asylum-backlog-13435117",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ed-davey-lib-dems_7026905.jpg?20250920182858",
        "type": "Home",
        "Author": "Alix Culbertson",
        "Date Published": "2025-09-20 19:50:00",
        "Headline": "The Lib Dems have proposed launching Nightingale-style asylum processing centres which they said would clear the backlog within six months.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Sir Ed Davey kicked off the Lib Dem conference by attacking Reform and Nigel Farage as he pushed for emergency measures to clear the asylum backlog in a \"humane\" way. The Lib Dem leader, on the first day of his party's conference in Bournemouth, launched into their new tactic of criticising Reform with renewed vigour after a summer of Mr Farage holding headline-grabbing news conferences. He accused the Reform leader of not being a patriot after Mr Farage denigrated the UK during a speech in the US. Sir Ed also put the Lib Dems forward as the party that is \"true to British values\". He said asylum hotels could close within six months by setting up emergency processing centres modelled on the large-scale temporary Nightingale hospitals used during COVID. Under the plan, they would use the Civil Contingencies Act 2004 to allow the government additional powers to secure the funds to hire and train more asylum case workers to tackle the backlog. MP Lisa Smart, the Lib Dem home affairs spokesperson, said it would only take \"weeks\" to train up more case workers but training was key to ensure the right decisions were made and appeals could not be made, which would increase the backlog. Sir Ed told Sky News: \"We think you can stop the boats, deal with illegal immigration and close down the asylum hotels, but do it in a way that's still humane. \n                  Lib Dems toughen up immigration rhetoric as Sir Ed Davey pledges to 'stop the boats'\n                 \n                  By-elections that shook up politics – could Andy Burnham be next?\n                 \n                  Everything you need to know about being a political party member\n                 \"Our proposal is really well thought through, far more ambitious, far greater scale than we've seen from either Conservatives or Labour. And it would really show that Farage, for what he is, he's not offering real solutions.\" Read more:Lib Dems toughen up immigration rhetoricDropping Chinese spy charges 'leaves door open'  And after telling Sky News earlier in the week we need to \"stop the boats\" - a hardening of Lib Dem language - he said: \"If people have no right to be here, they should be deported. \"We just need to get on with the job. There are people there who deserve to be welcomed into our country, who are genuine asylum seekers, genuine refugees, and it's been the British tradition to welcome people who genuinely are refugees. So I think you can do both.\" Political correspondent Sir Ed Davey's all-singing, all-dancing entry to the conference was designed to promote two messages.  The first, most obviously, was to highlight his party's buoyant mood after last year's record haul of 72 MPs and a series of local election wins – quite a contrast to the increasingly public infighting amongst both the Conservatives and Labour. The second was a bid to wrest back the concept of patriotism away from what he described as the \"divisive politics\" of Reform UK. The tunes were cheerful pop classics and ticker tape rained down on the assembled activists, joyfully waving their union flags – quite a contrast to the divisive debate over the use of flags this summer. Sir Ed is adamant his party is not dancing to Farage's tune. But they are certainly turning their fire on Reform – with Lego Farage figurines labelled \"plastic patriots\", complete with MAGA hats, handed out to conference attendees. While the policies may not have changed all that much, Sir Ed's comments about the importance of deporting illegal migrants from safe countries such as Turkey and Brazil certainly sounded like tougher rhetoric than we have heard before. Less than a mile away there was a very different kind of march. Demonstrators brandishing much bigger flags made their way from Bournemouth pier to one of the town's three asylum hotels, chanting about stopping the boats, wanting their country back – and even – when the procession passed two women wearing them – banning burqas. They were met by a group of counter-protesters keen to welcome refugees (separated by several rows of police officers). Neither side was especially impressed by what the Lib Dems had to say – though counter-protesters welcomed the party's commitment to safe and legal routes, and calls for asylum seekers to be allowed to work and contribute to society.\n The Lib Dems then held a rally of their own – but the debate over asylum and patriotism is a loud one. Will they be able to cut through the noise? Ms Smart also took a strong line on flags in reaction to people hanging them all around the country in response to asylum hotels. She said she was \"relaxed\" about people flying a flag, adding: \"I'm not concerned about some of the motivations behind people plastering them in front of an asylum hotel. \"I don't think flying the flag means anything.\" While the Lib Dems may have changed their tone on immigration, they showed their signature style is still there, with Sir Ed arriving at conference leading a marching band that played classics such as Sweet Caroline and Crocodile Rock."
    },
    {
        "title": "Heathrow among major airports hit by delays after cyber attack",
        "description": "Heathrow was among a number of major airports across Europe hit by delays after a suspected cyber attack that targeted a service provider for check-in and boarding systems.",
        "url": "https://news.sky.com/story/passengers-stranded-by-cyber-attack-shouted-at-by-staff-despite-insane-queues-for-manual-check-in-13434669",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-heathrow-cyber-attack_7026587.jpg?20250920163902",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-20 13:30:00",
        "Headline": "Heathrow Airport said on Sunday morning that it was still working to \"resolve and recover\" following the attack.",
        "Content": "Heathrow was among a number of major airports across Europe hit by delays after a suspected cyber attack that targeted a service provider for check-in and boarding systems. The \"technical issue\" affecting Collins Aerospace, which provides check-in and boarding services for various airlines, resulted in 14 flights being cancelled at Brussels Airport on Saturday, and several more being delayed at London Heathrow, Berlin, and Dublin, among others. Passengers reported being unable to check in online, instead queuing for hours for staff to deal with them manually at desks and departure gates, only to be told their flights are not taking off. Read more from Sky NewsDublin Airport reopens after emergency evacuationMoment British couple freed by TalibanTrump to add $100,000 fee for foreign worker visas Heathrow Airport said in an update in the early hours of Sunday morning that \"work continues to resolve and recover\" from the outage. \"We encourage passengers to check the status of their flights before travelling to Heathrow.\" Helen Steel, 49, left Dorset for Heathrow at 3am to travel home to Oslo, with her cat Thomas - but was \"shouted at by staff\" who told her she would not be able to fly until Sunday. Describing the situation as an \"absolute nightmare\", she said: \"I've got an animal here, so I'm very concerned about his welfare. \"I've been shouted at twice and I broke down in tears because I was worried about him. None of us have had any information whatsoever. Whenever we ask ground staff, they shout at us.\" Ms Steel says she spent two hours in the queue on the phone to customer service and had to find a hotel to stay in overnight. Sam arrived at Heathrow expecting to drop his girlfriend off for her flight to Rio de Janeiro - but was still at the airport seven hours later. When they arrived, it was \"chaos everywhere\", he told Sky News, with \"nobody seeming to know what was going on\". The couple say they were not told about the cyber attack by airport staff, finding out about it online instead. After queuing for three hours, they made it to the front, only to be told the plane was not taking off, he said, adding: \"It's been a bit of a farce.\" 'Insane queues' and 'skeleton staff' Passenger Tereza Pultarova waited around 10 hours at Heathrow after she arrived at 4.30am on Saturday for her flight to Cape Town via Amsterdam. \"I'm not exaggerating. It was just insane, the queue wasn't moving,\" she said. \"And then suddenly they said, 'Oh, the flight will be departing, we're closing the gate'.\"  Maria Casey was due to fly to Thailand with Etihad Airways - but had to wait three hours to drop off her luggage at Heathrow, with staff taking between five and 10 minutes to deal with each passenger. \"The queues are terrible,\" she told Sky News. \"It was an absolute skeleton staff. Out of six of the desks there were probably two people.\" A Heathrow spokesperson advised people to arrive no more than three hours early for a flight and apologised for any inconvenience. It is understood British Airways at Terminal 5 remains unaffected and is operating as normal. Collins Aerospace said it was working to resolve the issue as soon as possible. Liberal Democrat foreign affairs spokesperson Calum Miller called on the government to immediately make a statement on whether Russian involvement is suspected in the alleged attack. \"After the flagrant violation of Estonian airspace, the government needs to urgently establish if Vladimir Putin is now attacking our cyber systems,\" Mr Miller said. The European Commission, which takes part in managing airspace across Europe, said it is monitoring the situation but added there were no signs the cyber attack was \"widespread or severe\"."
    },
    {
        "title": "King meets world's oldest person – who remembers when 'all the girls were in love with him' 50 years ago",
        "description": "The King has met the world's oldest person - who told him she remembers his investiture as Prince of Wales more than 50 years ago - when \"all the girls were in love with him\".",
        "url": "https://news.sky.com/story/king-meets-the-world8217s-oldest-person-8211-who-remembers-when-all-the-girls-were-in-love-with-him-50-years-ago-13435123",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-king-charles-ethel-caterham_7026921.jpg?20250920183627",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-20 21:00:00",
        "Headline": "Ethel Caterham became the world's oldest person aged 116 in April after the death of Brazilian nun Sister Inah Canabarro Lucas.",
        "Content": "The King has met the world's oldest person - who told him she remembers his investiture as Prince of Wales more than 50 years ago - when \"all the girls were in love with him\". Ethel Caterham became the world's oldest person aged 116 in April after the death of Brazilian nun Sister Inah Canabarro Lucas. She celebrated her birthday quietly with family in August but said she would mark the occasion properly if King Charles were to visit. He duly obliged and paid her a visit at her care home in Lightwater, Surrey, on Thursday, just after saying goodbye to US President Donald Trump on Thursday. Speaking to him in her armchair, she said: \"I remember when your mother crowned you in Caernarfon Castle. And all the girls were in love with you and wanted to marry you.\" The King, 76, raised his eyebrows, as one of Mrs Caterham's granddaughters, Kate Henderson, interjected, saying: \"You were saying that the other day, weren't you? You said 'Prince Charles was so handsome. All the girls were in love with him'. A true prince - and now the King.\" He quipped in response: \"Yes, well, all that's left of him anyway.\" Mrs Caterham has received 17 birthday cards from the King, and his late mother, Queen Elizabeth II, since she turned 100. In 2023, she featured on the Royal Family's official Instagram page, where she was filmed receiving her 114th birthday card from the King. When she broke the record for world's oldest person earlier this year, she received a signed letter of congratulations from Her Majesty. Read moreThe King and DonaldKing, William, and Kate attend funeralMemorable moments between presidents and the royals Last-surviving subject of Edward VII Mrs Caterham was born on 21 August 1909 in Shipton Bellinger, Hampshire the second youngest of eight siblings. She is the last-surviving subject of Edward VII, who died the following May. Mrs Caterham left for India to work as an au pair for a military family at the age of 18, returning three years later. She then met her husband Norman, who was a lieutenant colonel in the British Army, at a dinner party in 1931. They moved from their home in Salisbury to Gibraltar and Hong Kong, where he was stationed, and she set up a nursery school, and they raised two daughters - both of whom died before her. Norman died in 1976, while one of her sisters, Gladys, lived to be 104. Mrs Caterham drove until she was 97, played bridge well past the age of 100, and survived coronavirus in 2020 at the age of 110."
    },
    {
        "title": "Duchess of York says gushing message to Epstein was not what it seemed",
        "description": "Just weeks after publicly disowning disgraced billionaire Jeffrey Epstein, Sarah Ferguson apparently wrote him a gushing message describing him as her \"supreme friend,\" new reports claim.",
        "url": "https://news.sky.com/story/duchess-of-york-says-gushing-message-to-epstein-was-not-what-it-seemed-13435313",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sarah-ferguson-york_7027199.jpg?20250921000008",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-20 22:41:00",
        "Headline": "Sarah Ferguson spoke in an email to the convicted sex offender Jeffrey Epstein about not wanting to \"hurt Andrew\" and being in \"over-riding fear.\" But she now says the message was a ruse.",
        "Content": "Just weeks after publicly disowning disgraced billionaire Jeffrey Epstein, Sarah Ferguson apparently wrote him a gushing message describing him as her \"supreme friend,\" new reports claim. But Sarah, Duchess of York, only wrote the note because Epstein had threatened to sue her, her spokesman has now said. According to the Sun on Sunday, the ex-wife of the Duke of York had emailed Epstein in April 2011 and \"humbly apologised\" for linking him to paedophilia in the media a few weeks previously. She said in the message that he was a \"steadfast, generous and supreme friend\" to her. However, her spokesman said today it was sent \"in the context of advice the duchess was given to try to assuage Epstein and his threats\". The duchess's interview with the Evening Standard on 7 March 2011 saw her apologise for accepting £15,000 from Epstein. She told reporters she would \"never have anything to do with\" the sex offender again. 'Bedridden with fear' \n                  FBI director Kash Patel shouts at members of Congress for second day - as Democrats pile on questions about Jeffrey Epstein\n                 \n                  Arrests after Trump-Epstein images projected on to Windsor Castle\n                 \n                  Will Trump's UK visit be make or break for Starmer?\n                 She told the newspaper: \"I abhor paedophilia and any sexual abuse of children and know that this was a gigantic error of judgment on my behalf. I am just so contrite, I cannot say. \"Whenever I can, I will repay the money and have nothing ever to do with Jeffrey Epstein ever again.\" But the Sun says that little over a month later, the duchess emailed from her private account to the sex offender, apologising to him and telling him she was \"bedridden with fear\". \"I know you feel hellaciously let down by me.\n \"And I must humbly apologise to you and your heart for that. \"You have always been a steadfast, generous and supreme friend to me and my family. \"I am apologising to you today for not replying to your email or reaching out to you. I was bedridden with fear. I was paralysed. \"I was advised in no uncertain terms, to have nothing to do with you and to not speak or email you. \"And if I did - I would cause more problems to you, the Duke and myself. I was broken and lost. \"So please understand. I didn't want to hurt Andrew one more time. I was in over-riding fear. I am sorry.\" The duchess's spokesman said Epstein had threatened to sue her for defamation after associating him with paedophilia. 'Taken in by his lies' The spokesman said: \"The duchess spoke of her regret about her association with Epstein many years ago, and as they have always been, her first thoughts are with his victims. \"Like many people, she was taken in by his lies. \"As soon as she was aware of the extent of the allegations against him, she not only cut off contact but condemned him publicly, to the extent that he then threatened to sue her for defamation for associating him with paedophilia. \"She does not resile from anything she said then. \"This email was sent in the context of advice the duchess was given to try to assuage Epstein and his threats.\" Read more from Sky News:Starmer set to recognise Palestine as a stateUK fighter jets defend Polish skies after Russian drone incursionFormer Liverpool Women manager Matt Beard dies Earlier this month Peter Mandelson, the British ambassador to the US, was removed from post after it was discovered he too, sent messages to Epstein, calling him \"my best pal\" after he was jailed awaiting sex trafficking charges. Epstein was found dead in his cell at a federal jail in Manhattan in August 2019. The death was ruled a suicide."
    },
    {
        "title": "Luigi Mangione's lawyers call on judge to block the death penalty",
        "description": "Lawyers for Luigi Mangione have called on a judge to block federal prosecutors from seeking the death penalty against him.",
        "url": "https://news.sky.com/story/luigi-mangiones-lawyers-call-on-judge-to-block-the-death-penalty-13435211",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-luigi-mangione-unitedhealthcare_7022191.jpg?20250916151834",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-20 19:05:00",
        "Headline": "In a new court filing, his legal team argues federal prosecutors have \"violated Mr Mangione's constitutional and statutory rights\" and the case for the death penalty has been \"fatally prejudiced\" after comments made by US President Donald Trump.",
        "Content": "Lawyers for Luigi Mangione have called on a judge to block federal prosecutors from seeking the death penalty against him. Mangione's legal team says the 27-year-old's case has been turned into a \"Marvel movie\" after a failed bid by the US Justice Department to indict him on terrorism charges over the fatal shooting of UnitedHealthcare chief executive Brian Thompson in New York on 4 December. New York state judge Gregory Carro said there was no evidence that the killing, which took place as Mr Thompson walked into an investor conference at the New York Hilton Midtown hotel, amounted to a terrorist act. But Judge Carro upheld second-degree murder charges, which suggest there was malicious intent - but not that it was premeditated. US Attorney General Pam Bondi has called for Mangione to face capital punishment, describing the charges against him as a \"premeditated cold-blooded assassination that shocked America\". But in the new court filing, Mangione's legal team argues federal prosecutors have \"violated Mr Mangione's constitutional and statutory rights\" by \"staging a dehumanizing, unconstitutional 'perp walk' where he was televised, videotaped, and photographed clambering out of a helicopter in shackles\" on the way to his first court appearance. The legal team, led by former Manhattan prosecutor Karen Friedman Agnifilo, also claims the death penalty case has been \"fatally prejudiced\" after President Donald Trump commented on it on Fox News. Despite laws that prohibit any pre-trial commentary that could prejudice the defendant's right to a free trial, he told the network on Thursday: \"Think about Mangione. He shot someone in the back, as clear as you're looking at me or I'm looking at you.\" Read more from Sky NewsTrump throws out New York Times lawsuitFree speech warning after Kimmel taken off airSongwriter killed in small plane crash The defence team's 114-page court filing reads: \"There is a high bar to dismissing an indictment due to pretrial publicity. \"However, there has never been a situation remotely like this one where prejudice has been so great against a death-eligible defendant.\" Federal prosecutors have until 31 October to respond to the documents. Mangione has pleaded not guilty to all the state charges against him, which cannot result in the death penalty and only life imprisonment, unlike federal ones. He has also pleaded guilty to the federal charges. He is due back in court for a pre-trial hearing in the state case on 1 December and the federal case on 5 December. The 27-year-old was arrested five days after Mr Thompson was killed - when he was spotted at a McDonald's in Altoona, Pennsylvania, around 230 miles west of New York City."
    },
    {
        "title": "Former Liverpool Women manager Matt Beard dies",
        "description": "Former Liverpool Women manager Matt Beard has died aged 47.&#160;",
        "url": "https://news.sky.com/story/former-liverpool-women-manager-matt-beard-dies-13435306",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-matt-beard-liverpool_7027181.jpg?20250920230616",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-20 22:02:00",
        "Headline": "Liverpool FC described Beard as not only a \"successful, committed\" manager but as a \"person of real integrity\".",
        "Content": "Former Liverpool Women manager Matt Beard has died aged 47.  Beard managed Liverpool between 2012 to 2015 and again from 2021 to 2025. He also had spells at Chelsea Women, Millwall Lionesses, West Ham Women and most recently a short spell at Burnley Women. Liverpool confirmed the news on X, writing: \"Liverpool Football Club is deeply shocked and saddened by the sudden passing of former LFC Women manager Matt Beard. \"The thoughts of everyone at the club are with Matt's family and friends at this devastating time. \"Matt was not only an extremely committed and successful manager, he was also a person of real integrity and warmth, who will always be remembered with genuine fondness by everyone he worked with at the club.\" Beard coached Liverpool to back-to-back Women's Super League titles in 2013 and 2014. During his second spell in charge, he helped them win promotion back to the WSL before leading them to a seventh-placed finish on their return to the top flight. His former club Millwall, with whom he started his managerial career, paid tribute on X, stating: \"Everybody at the club is deeply saddened by the passing of former Lionesses manager, Matt Beard. \n                  Diogo Jota and Andre Silva's funeral in pictures\n                 \n                  Crowds in Portugal gather for the saddest of homecomings for brothers Diogo Jota and Andre Silva\n                 \n                  Diogo Jota's tragic final Instagram post after marrying childhood sweetheart\n                 \"We send all our love and support to his family, friends and colleagues across the many clubs he managed at this very difficult time.\" Read more from Sky News:UK fighter jets defend Polish skies after Russian drone incursionThousands of prison officers to get stab-proof vestsKing meets the world's oldest person Former Chelsea boss Emma Hayes hailed Beard as \"one of the best humans\" and a \"champion in the women's game\". Writing on Instagram, she said: \"Can't quite compute this. Absolutely one of the best humans. Always available for a chat, one of the good guys. A champion in the women's game and a top bloke. So gutted for his family.\" Beard's older brother Mark, who played for Millwall and Sheffield United, wrote on X: \"It is with great sadness that our beautiful Matthew Beard has passed away tonight at 7.28pm. \"He is a loving husband, father, son, brother and uncle. He was the most amazing, caring man who was loved by anyone who had the pleasure to meet him. We will Love you forever Matt Matt.\""
    },
    {
        "title": "British fighter jets defend Polish skies after Russian drone incursion",
        "description": "Two British fighter jets have flown their first defence mission over Poland after a Russian drone incursion into the country&#8217;s skies. ",
        "url": "https://news.sky.com/story/british-fighter-jets-defend-polish-skies-after-russian-drone-incursion-13434752",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-typhoon-poland-raf_7026433.jpg?20250920153312",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-20 21:00:00",
        "Headline": "Two RAF typhoons were deployed as part of a NATO operation to bolster Europe's eastern flanks to deter potential Russian aggression. ",
        "Content": "Two British fighter jets have flown their first defence mission over Poland after a Russian drone incursion into the country’s skies.  The flight was part of NATO's operation \"Eastern Sentry\", launched to bolster Europe's eastern flank after Poland shot down Russian drones earlier this month. A Russian drone was intercepted flying over Romania days later, while three Russian jets entered Estonian airspace without permission for 12 minutes on Friday. The three incursions into NATO airspace fuelled concerns about the potential expansion of Russia's three-year war in Ukraine and have been seen as an attempt by Moscow to test the military alliance's response. The incident over Poland prompted its prime minister, Donald Tusk, to warn that his country was the closest to \"open conflict\" it had been since the Second World War, while the UK announced it would provide Warsaw with extra air cover. Two RAF Typhoons, supported by an RAF Voyager air-to-air refuelling plane, took off from RAF Coningsby, in Lincolnshire, on Friday night to defend Poland's skies before returning safely early on Saturday morning. Defence Secretary John Healey said the mission sends a clear signal that \"NATO airspace will be defended\". \n                  Britain is buying new air defence missile systems - but can they protect us?\n                 \n                  Another arrest after aircraft vandalised at RAF Brize Norton\n                 \n                  WWII Mosquito pilot who carried out 50 bombing raids across Germany shares memories of VE Day\n                 \"I'm proud of the outstanding British pilots and air crew who took part in this successful operation to defend our allies from reckless Russian aggression.\" He said the mission was \"especially poignant\" coming as the UK marks the 85th anniversary of the Battle of Britain - when Polish pilots came to the aid of the UK - this weekend. The head of the RAF, Air Chief Marshal Harv Smyth, said: \"This sortie marks the RAF's first operational mission on Eastern Sentry, reinforcing the UK's steadfast commitment to NATO and its allies. \"We remain agile, integrated, and ready to project airpower at range.\""
    },
    {
        "title": "'Delighted to be free': Elderly British couple who were detained by Taliban arrive in UK",
        "description": "An elderly British couple who have arrived back in the UK after being detained in a maximum security Taliban prison are \"delighted to be free\", their son has told Sky News. ",
        "url": "https://news.sky.com/story/delighted-to-be-free-elderly-british-couple-who-were-detained-by-taliban-arrive-in-uk-13435138",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-barbie-peter-heathrow_7026302.jpg?20250920145257",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-20 20:10:00",
        "Headline": "Barbie and Peter Reynolds landed at Heathrow on Saturday after being held by the Taliban since February. ",
        "Content": " An elderly British couple who have arrived back in the UK after being detained in a maximum security Taliban prison are \"delighted to be free\", their son has told Sky News.  Barbie Reynolds, 76, and her husband Peter, 80, were arrested in February after spending decades in Afghanistan, where they have dual citizenship. They had been held without charge before being released from detention on Friday and flown to Qatar, where they were reunited with their daughter, before flying back to Heathrow Airport on Saturday.  The couple's son, Jonathan Reynolds, told Sky News: \"They're just delighted to be free... they're very excited to see their kids and grandkids and great grandkids, people they've just been wanting to catch up with and wondered if they'd ever see them again.\" Jonathan, who spoke to his parents from Wyoming in the US in a FaceTime call with some of his siblings, said: \"I've seen photographs of them in hospital beds getting checked. I've seen them having full English breakfasts. So they're jumping on that.\" He described some of the conditions his parents had been kept under in a \"big maximum security prison with thousands of inmates\". \"My dad described being handcuffed or chained to other criminals. And, one point he had his chest hairs ripped out,\" he said. \n                  Elderly British couple who were detained by Taliban arrive in UK\n                 \n                  She smiled and his eyes filled with emotion - the moment British couple were freed by the Taliban\n                 \n                  Elderly British couple held for months by Taliban reunited with daughter\n                 \"He was hit in the head. And, then they were moved, to more of a safe house.\" But Jonathan said his parents retained their British politeness even when calling him from a payphone in the prison yard, with his dad asking: \"Is now a good time?\". \"It was totally, 'Yeah, not too bad. Where's the queue to get out of here?'\" The UK government advises British nationals not to travel to Afghanistan.  Abdul Qahar Balkhi, a spokesperson at the Taliban government's foreign ministry, said in a statement posted on X that the couple \"violated Afghan law\" and were released from prison after a court hearing. He did not say what law the couple were alleged to have broken. Sky correspondent Cordelia Lynch was at Kabul Airport as the freed couple arrived and departed.  Mr Reynolds told her: \"We are just very thankful.\" His wife added: \"We've been treated very well. We're looking forward to seeing our children. \"We are looking forward to returning to Afghanistan if we can. We are Afghan citizens.\" The couple have lived in Afghanistan for 18 years and run an organisation called Rebuild, which provides education and training programmes. They have been together since the 1960s and married in the Afghan capital in 1970."
    },
    {
        "title": "Heathrow among major airports hit by delays after cyber attack",
        "description": "Heathrow was among a number of major airports across Europe hit by delays after a suspected cyber attack that targeted a service provider for check-in and boarding systems.",
        "url": "https://news.sky.com/story/passengers-stranded-by-cyber-attack-shouted-at-by-staff-despite-insane-queues-for-manual-check-in-13434669",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-heathrow-cyber-attack_7026587.jpg?20250920163902",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-20 13:30:00",
        "Headline": "Heathrow Airport said on Sunday morning that it was still working to \"resolve and recover\" following the attack.",
        "Content": "Heathrow was among a number of major airports across Europe hit by delays after a suspected cyber attack that targeted a service provider for check-in and boarding systems. The \"technical issue\" affecting Collins Aerospace, which provides check-in and boarding services for various airlines, resulted in 14 flights being cancelled at Brussels Airport on Saturday, and several more being delayed at London Heathrow, Berlin, and Dublin, among others. Passengers reported being unable to check in online, instead queuing for hours for staff to deal with them manually at desks and departure gates, only to be told their flights are not taking off. Read more from Sky NewsDublin Airport reopens after emergency evacuationMoment British couple freed by TalibanTrump to add $100,000 fee for foreign worker visas Heathrow Airport said in an update in the early hours of Sunday morning that \"work continues to resolve and recover\" from the outage. \"We encourage passengers to check the status of their flights before travelling to Heathrow.\" Helen Steel, 49, left Dorset for Heathrow at 3am to travel home to Oslo, with her cat Thomas - but was \"shouted at by staff\" who told her she would not be able to fly until Sunday. Describing the situation as an \"absolute nightmare\", she said: \"I've got an animal here, so I'm very concerned about his welfare. \"I've been shouted at twice and I broke down in tears because I was worried about him. None of us have had any information whatsoever. Whenever we ask ground staff, they shout at us.\" Ms Steel says she spent two hours in the queue on the phone to customer service and had to find a hotel to stay in overnight. Sam arrived at Heathrow expecting to drop his girlfriend off for her flight to Rio de Janeiro - but was still at the airport seven hours later. When they arrived, it was \"chaos everywhere\", he told Sky News, with \"nobody seeming to know what was going on\". The couple say they were not told about the cyber attack by airport staff, finding out about it online instead. After queuing for three hours, they made it to the front, only to be told the plane was not taking off, he said, adding: \"It's been a bit of a farce.\" 'Insane queues' and 'skeleton staff' Passenger Tereza Pultarova waited around 10 hours at Heathrow after she arrived at 4.30am on Saturday for her flight to Cape Town via Amsterdam. \"I'm not exaggerating. It was just insane, the queue wasn't moving,\" she said. \"And then suddenly they said, 'Oh, the flight will be departing, we're closing the gate'.\"  Maria Casey was due to fly to Thailand with Etihad Airways - but had to wait three hours to drop off her luggage at Heathrow, with staff taking between five and 10 minutes to deal with each passenger. \"The queues are terrible,\" she told Sky News. \"It was an absolute skeleton staff. Out of six of the desks there were probably two people.\" A Heathrow spokesperson advised people to arrive no more than three hours early for a flight and apologised for any inconvenience. It is understood British Airways at Terminal 5 remains unaffected and is operating as normal. Collins Aerospace said it was working to resolve the issue as soon as possible. Liberal Democrat foreign affairs spokesperson Calum Miller called on the government to immediately make a statement on whether Russian involvement is suspected in the alleged attack. \"After the flagrant violation of Estonian airspace, the government needs to urgently establish if Vladimir Putin is now attacking our cyber systems,\" Mr Miller said. The European Commission, which takes part in managing airspace across Europe, said it is monitoring the situation but added there were no signs the cyber attack was \"widespread or severe\"."
    },
    {
        "title": "Duchess of York says gushing message to Epstein was not what it seemed",
        "description": "Just weeks after publicly disowning disgraced billionaire Jeffrey Epstein, Sarah Ferguson apparently wrote him a gushing message describing him as her \"supreme friend,\" new reports claim.",
        "url": "https://news.sky.com/story/duchess-of-york-says-gushing-message-to-epstein-was-not-what-it-seemed-13435313",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sarah-ferguson-york_7027199.jpg?20250921000008",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-20 22:41:00",
        "Headline": "Sarah Ferguson spoke in an email to the convicted sex offender Jeffrey Epstein about not wanting to \"hurt Andrew\" and being in \"over-riding fear.\" But she now says the message was a ruse.",
        "Content": "Just weeks after publicly disowning disgraced billionaire Jeffrey Epstein, Sarah Ferguson apparently wrote him a gushing message describing him as her \"supreme friend,\" new reports claim. But Sarah, Duchess of York, only wrote the note because Epstein had threatened to sue her, her spokesman has now said. According to the Sun on Sunday, the ex-wife of the Duke of York had emailed Epstein in April 2011 and \"humbly apologised\" for linking him to paedophilia in the media a few weeks previously. She said in the message that he was a \"steadfast, generous and supreme friend\" to her. However, her spokesman said today it was sent \"in the context of advice the duchess was given to try to assuage Epstein and his threats\". The duchess's interview with the Evening Standard on 7 March 2011 saw her apologise for accepting £15,000 from Epstein. She told reporters she would \"never have anything to do with\" the sex offender again. 'Bedridden with fear' \n                  FBI director Kash Patel shouts at members of Congress for second day - as Democrats pile on questions about Jeffrey Epstein\n                 \n                  Arrests after Trump-Epstein images projected on to Windsor Castle\n                 \n                  Will Trump's UK visit be make or break for Starmer?\n                 She told the newspaper: \"I abhor paedophilia and any sexual abuse of children and know that this was a gigantic error of judgment on my behalf. I am just so contrite, I cannot say. \"Whenever I can, I will repay the money and have nothing ever to do with Jeffrey Epstein ever again.\" But the Sun says that little over a month later, the duchess emailed from her private account to the sex offender, apologising to him and telling him she was \"bedridden with fear\". \"I know you feel hellaciously let down by me.\n \"And I must humbly apologise to you and your heart for that. \"You have always been a steadfast, generous and supreme friend to me and my family. \"I am apologising to you today for not replying to your email or reaching out to you. I was bedridden with fear. I was paralysed. \"I was advised in no uncertain terms, to have nothing to do with you and to not speak or email you. \"And if I did - I would cause more problems to you, the Duke and myself. I was broken and lost. \"So please understand. I didn't want to hurt Andrew one more time. I was in over-riding fear. I am sorry.\" The duchess's spokesman said Epstein had threatened to sue her for defamation after associating him with paedophilia. 'Taken in by his lies' The spokesman said: \"The duchess spoke of her regret about her association with Epstein many years ago, and as they have always been, her first thoughts are with his victims. \"Like many people, she was taken in by his lies. \"As soon as she was aware of the extent of the allegations against him, she not only cut off contact but condemned him publicly, to the extent that he then threatened to sue her for defamation for associating him with paedophilia. \"She does not resile from anything she said then. \"This email was sent in the context of advice the duchess was given to try to assuage Epstein and his threats.\" Read more from Sky News:Starmer set to recognise Palestine as a stateUK fighter jets defend Polish skies after Russian drone incursionFormer Liverpool Women manager Matt Beard dies Earlier this month Peter Mandelson, the British ambassador to the US, was removed from post after it was discovered he too, sent messages to Epstein, calling him \"my best pal\" after he was jailed awaiting sex trafficking charges. Epstein was found dead in his cell at a federal jail in Manhattan in August 2019. The death was ruled a suicide."
    },
    {
        "title": "King meets world's oldest person – who remembers when 'all the girls were in love with him' 50 years ago",
        "description": "The King has met the world's oldest person - who told him she remembers his investiture as Prince of Wales more than 50 years ago - when \"all the girls were in love with him\".",
        "url": "https://news.sky.com/story/king-meets-the-world8217s-oldest-person-8211-who-remembers-when-all-the-girls-were-in-love-with-him-50-years-ago-13435123",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-king-charles-ethel-caterham_7026921.jpg?20250920183627",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-20 21:00:00",
        "Headline": "Ethel Caterham became the world's oldest person aged 116 in April after the death of Brazilian nun Sister Inah Canabarro Lucas.",
        "Content": "The King has met the world's oldest person - who told him she remembers his investiture as Prince of Wales more than 50 years ago - when \"all the girls were in love with him\". Ethel Caterham became the world's oldest person aged 116 in April after the death of Brazilian nun Sister Inah Canabarro Lucas. She celebrated her birthday quietly with family in August but said she would mark the occasion properly if King Charles were to visit. He duly obliged and paid her a visit at her care home in Lightwater, Surrey, on Thursday, just after saying goodbye to US President Donald Trump on Thursday. Speaking to him in her armchair, she said: \"I remember when your mother crowned you in Caernarfon Castle. And all the girls were in love with you and wanted to marry you.\" The King, 76, raised his eyebrows, as one of Mrs Caterham's granddaughters, Kate Henderson, interjected, saying: \"You were saying that the other day, weren't you? You said 'Prince Charles was so handsome. All the girls were in love with him'. A true prince - and now the King.\" He quipped in response: \"Yes, well, all that's left of him anyway.\" Mrs Caterham has received 17 birthday cards from the King, and his late mother, Queen Elizabeth II, since she turned 100. In 2023, she featured on the Royal Family's official Instagram page, where she was filmed receiving her 114th birthday card from the King. When she broke the record for world's oldest person earlier this year, she received a signed letter of congratulations from Her Majesty. Read moreThe King and DonaldKing, William, and Kate attend funeralMemorable moments between presidents and the royals Last-surviving subject of Edward VII Mrs Caterham was born on 21 August 1909 in Shipton Bellinger, Hampshire the second youngest of eight siblings. She is the last-surviving subject of Edward VII, who died the following May. Mrs Caterham left for India to work as an au pair for a military family at the age of 18, returning three years later. She then met her husband Norman, who was a lieutenant colonel in the British Army, at a dinner party in 1931. They moved from their home in Salisbury to Gibraltar and Hong Kong, where he was stationed, and she set up a nursery school, and they raised two daughters - both of whom died before her. Norman died in 1976, while one of her sisters, Gladys, lived to be 104. Mrs Caterham drove until she was 97, played bridge well past the age of 100, and survived coronavirus in 2020 at the age of 110."
    },
    {
        "title": "Ed Davey attacks Reform and Nigel Farage as he pushes for emergency measures to clear asylum backlog",
        "description": "Sir Ed Davey kicked off the Lib Dem conference by attacking Reform and Nigel Farage as he pushed for emergency measures to clear the asylum backlog in a \"humane\" way.",
        "url": "https://news.sky.com/story/ed-davey-attacks-reform-and-nigel-farage-as-he-pushes-for-emergency-measures-to-clear-asylum-backlog-13435117",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ed-davey-lib-dems_7026905.jpg?20250920182858",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-09-20 19:50:00",
        "Headline": "The Lib Dems have proposed launching Nightingale-style asylum processing centres which they said would clear the backlog within six months.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Sir Ed Davey kicked off the Lib Dem conference by attacking Reform and Nigel Farage as he pushed for emergency measures to clear the asylum backlog in a \"humane\" way. The Lib Dem leader, on the first day of his party's conference in Bournemouth, launched into their new tactic of criticising Reform with renewed vigour after a summer of Mr Farage holding headline-grabbing news conferences. He accused the Reform leader of not being a patriot after Mr Farage denigrated the UK during a speech in the US. Sir Ed also put the Lib Dems forward as the party that is \"true to British values\". He said asylum hotels could close within six months by setting up emergency processing centres modelled on the large-scale temporary Nightingale hospitals used during COVID. Under the plan, they would use the Civil Contingencies Act 2004 to allow the government additional powers to secure the funds to hire and train more asylum case workers to tackle the backlog. MP Lisa Smart, the Lib Dem home affairs spokesperson, said it would only take \"weeks\" to train up more case workers but training was key to ensure the right decisions were made and appeals could not be made, which would increase the backlog. Sir Ed told Sky News: \"We think you can stop the boats, deal with illegal immigration and close down the asylum hotels, but do it in a way that's still humane. \n                  Lib Dems toughen up immigration rhetoric as Sir Ed Davey pledges to 'stop the boats'\n                 \n                  By-elections that shook up politics – could Andy Burnham be next?\n                 \n                  Everything you need to know about being a political party member\n                 \"Our proposal is really well thought through, far more ambitious, far greater scale than we've seen from either Conservatives or Labour. And it would really show that Farage, for what he is, he's not offering real solutions.\" Read more:Lib Dems toughen up immigration rhetoricDropping Chinese spy charges 'leaves door open'  And after telling Sky News earlier in the week we need to \"stop the boats\" - a hardening of Lib Dem language - he said: \"If people have no right to be here, they should be deported. \"We just need to get on with the job. There are people there who deserve to be welcomed into our country, who are genuine asylum seekers, genuine refugees, and it's been the British tradition to welcome people who genuinely are refugees. So I think you can do both.\" Political correspondent Sir Ed Davey's all-singing, all-dancing entry to the conference was designed to promote two messages.  The first, most obviously, was to highlight his party's buoyant mood after last year's record haul of 72 MPs and a series of local election wins – quite a contrast to the increasingly public infighting amongst both the Conservatives and Labour. The second was a bid to wrest back the concept of patriotism away from what he described as the \"divisive politics\" of Reform UK. The tunes were cheerful pop classics and ticker tape rained down on the assembled activists, joyfully waving their union flags – quite a contrast to the divisive debate over the use of flags this summer. Sir Ed is adamant his party is not dancing to Farage's tune. But they are certainly turning their fire on Reform – with Lego Farage figurines labelled \"plastic patriots\", complete with MAGA hats, handed out to conference attendees. While the policies may not have changed all that much, Sir Ed's comments about the importance of deporting illegal migrants from safe countries such as Turkey and Brazil certainly sounded like tougher rhetoric than we have heard before. Less than a mile away there was a very different kind of march. Demonstrators brandishing much bigger flags made their way from Bournemouth pier to one of the town's three asylum hotels, chanting about stopping the boats, wanting their country back – and even – when the procession passed two women wearing them – banning burqas. They were met by a group of counter-protesters keen to welcome refugees (separated by several rows of police officers). Neither side was especially impressed by what the Lib Dems had to say – though counter-protesters welcomed the party's commitment to safe and legal routes, and calls for asylum seekers to be allowed to work and contribute to society.\n The Lib Dems then held a rally of their own – but the debate over asylum and patriotism is a loud one. Will they be able to cut through the noise? Ms Smart also took a strong line on flags in reaction to people hanging them all around the country in response to asylum hotels. She said she was \"relaxed\" about people flying a flag, adding: \"I'm not concerned about some of the motivations behind people plastering them in front of an asylum hotel. \"I don't think flying the flag means anything.\" While the Lib Dems may have changed their tone on immigration, they showed their signature style is still there, with Sir Ed arriving at conference leading a marching band that played classics such as Sweet Caroline and Crocodile Rock."
    },
    {
        "title": "Former Liverpool Women manager Matt Beard dies",
        "description": "Former Liverpool Women manager Matt Beard has died aged 47.&#160;",
        "url": "https://news.sky.com/story/former-liverpool-women-manager-matt-beard-dies-13435306",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-matt-beard-liverpool_7027181.jpg?20250920230616",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-20 22:02:00",
        "Headline": "Liverpool FC described Beard as not only a \"successful, committed\" manager but as a \"person of real integrity\".",
        "Content": "Former Liverpool Women manager Matt Beard has died aged 47.  Beard managed Liverpool between 2012 to 2015 and again from 2021 to 2025. He also had spells at Chelsea Women, Millwall Lionesses, West Ham Women and most recently a short spell at Burnley Women. Liverpool confirmed the news on X, writing: \"Liverpool Football Club is deeply shocked and saddened by the sudden passing of former LFC Women manager Matt Beard. \"The thoughts of everyone at the club are with Matt's family and friends at this devastating time. \"Matt was not only an extremely committed and successful manager, he was also a person of real integrity and warmth, who will always be remembered with genuine fondness by everyone he worked with at the club.\" Beard coached Liverpool to back-to-back Women's Super League titles in 2013 and 2014. During his second spell in charge, he helped them win promotion back to the WSL before leading them to a seventh-placed finish on their return to the top flight. His former club Millwall, with whom he started his managerial career, paid tribute on X, stating: \"Everybody at the club is deeply saddened by the passing of former Lionesses manager, Matt Beard. \n                  Diogo Jota and Andre Silva's funeral in pictures\n                 \n                  Crowds in Portugal gather for the saddest of homecomings for brothers Diogo Jota and Andre Silva\n                 \n                  Diogo Jota's tragic final Instagram post after marrying childhood sweetheart\n                 \"We send all our love and support to his family, friends and colleagues across the many clubs he managed at this very difficult time.\" Read more from Sky News:UK fighter jets defend Polish skies after Russian drone incursionThousands of prison officers to get stab-proof vestsKing meets the world's oldest person Former Chelsea boss Emma Hayes hailed Beard as \"one of the best humans\" and a \"champion in the women's game\". Writing on Instagram, she said: \"Can't quite compute this. Absolutely one of the best humans. Always available for a chat, one of the good guys. A champion in the women's game and a top bloke. So gutted for his family.\" Beard's older brother Mark, who played for Millwall and Sheffield United, wrote on X: \"It is with great sadness that our beautiful Matthew Beard has passed away tonight at 7.28pm. \"He is a loving husband, father, son, brother and uncle. He was the most amazing, caring man who was loved by anyone who had the pleasure to meet him. We will Love you forever Matt Matt.\""
    },
    {
        "title": "Thousands of prison officers to get stab-proof vests - and hundreds will be given Tasers",
        "description": "Up to 10,000 more prison officers will get stab-proof vests while hundreds will be given Tasers after a string of high-profile attacks.",
        "url": "https://news.sky.com/story/thousands-of-prison-officers-to-get-stab-proof-vests-13435212",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-prison-body-armour_7027019.jpg?20250920200805",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-20 23:01:00",
        "Headline": "The announcement comes after a string of high-profile attacks. ",
        "Content": " Up to 10,000 more prison officers will get stab-proof vests while hundreds will be given Tasers after a string of high-profile attacks. Justice Secretary David Lammy announced £15m worth of new kit during a visit to Category A Belmarsh prison, in southeast London. The number of vests available will rise from 750 to 10,000, with 5,000 earmarked to equip every officer working in high-security facilities. Use of Tasers will also be ramped up after a trial of 20 specialist staff, with up to 500 officers to be trained to use the 1,500-volt weapons. The move comes after three officers were taken to hospital with serious injuries after they were allegedly attacked with hot oil and makeshift weapons at maximum-security HMP Frankland, in County Durham, in April. Manchester Arena bomb plotter Hashem Abedi, 28, has been charged with three counts of attempted murder, assault occasioning actual bodily harm and unauthorised possession of a knife or offensive weapon. He is yet to enter pleas to the charges and is next due in court on 25 September. \n                  Lammy, Cooper and Mahmood get new jobs in major reshuffle after Rayner's resignation\n                 \n                  David Lammy given formal warning over lack of licence during fishing trip with JD Vance - but will avoid fine\n                 \n                  David Lammy refers himself to watchdog after fishing with US vice president\n                 During Mr Lammy's visit to Belmarsh, a prison officer of seven years told reporters he had seen colleagues stabbed and admitted to hospital. Mr Lammy said: \"I am determined to restore tough law and order, ensure prisons are fit for purpose, and make our streets safer. \"Our dedicated prison officers put themselves in harm's way every day to protect us. \"This new investment sends a clear message: we back our staff and we will give them the tools they need to do their jobs safely.\" Tory shadow justice secretary Robert Jenrick welcomed the measures, adding: \"Frontline officers have been left exposed for far too long. They cannot afford more delays - this equipment needs to reach them immediately. \"The situation in our prisons is a national security emergency. The Justice Secretary must immediately roll out anti-drone technology to stop weapons - and potentially guns - being flown into prisons. \"Every day the Justice Secretary delays, lives are put at risk.\" The new measures also come as legislation to tackle the prison capacity crisis was introduced to parliament earlier this month. The Sentencing Bill came just before Prime Minister Sir Keir Starmer's major cabinet reshuffle that saw former justice secretary Shabana Mahmood replaced by Mr Lammy, and followed a year of emergency measures to tackle jail overcrowding."
    },
    {
        "title": "More than 1,000 migrants arrive in small boats in one day - despite returns deal with France",
        "description": "More than 1,000 people crossed the Channel to the UK in small boats on Friday - the day after the first migrant was deported under the \"one in, one out\"&#160;deal.",
        "url": "https://news.sky.com/story/more-than-1000-migrants-arrive-in-small-boats-on-one-day-despite-returns-deal-with-france-13434504",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-migrants-small-boats_7008741.jpg?20250901214348",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-20 10:18:00",
        "Headline": "The latest figures show 1,072 people made the journey in 13 boats - averaging more than 82 people per boat.",
        "Content": " More than 1,000 people crossed the Channel to the UK in small boats on Friday - the day after the first migrant was deported under the \"one in, one out\" deal. The latest Home Office figures show 1,072 people made the journey in 13 boats - averaging more than 82 people per boat. On the same day, an Iranian man became the third migrant to be deported under the UK's deal with France. The number of people who have made the crossing so far in 2025 now stands at 32,103 - a record for this point in a year. Ministers hope the deal will act as a deterrent, showing migrants they face being sent back to France. But the scale of Friday's crossings suggested the policy was so far having little effect on those prepared to make the risky crossing across the Channel. Read more:What is the UK-France migrant returns deal?Where are the UK's asylum seekers from?  The deal with France means the UK can send migrants who enter the UK on small boats back to France. For each one returned, the UK will allow an asylum seeker to enter through a safe and legal route - as long as they have not previously tried to enter illegally. The first flights carrying asylum seekers from France to the UK under the reciprocal aspect of the deal are expected to take place next week. Although they would not comment on numbers, a Home Office source told the PA news agency they were expected to be \"at or close to parity\", given the \"one in, one out\" nature of the deal. The agreement came into force on 5 August, having been signed by both countries and approved by the European Commission."
    },
    {
        "title": "'Better late than never': Palestinian minister says UK recognition of state would be 'courageous step'",
        "description": "Britain will be taking \"a courageous step at a very difficult time\" by officially recognising a Palestinian state, according to the authority's foreign minister, who told Sky News she believes the announcement - expected in the coming days - will inspire more nations to follow suit.",
        "url": "https://news.sky.com/story/better-late-than-never-palestinian-minister-says-uk-recognition-of-state-would-be-courageous-step-13434423",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-palestine-west-bank_7025862.jpg?20250920170605",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-09-20 15:58:00",
        "Headline": "The Palestinian Authority's foreign minister also says she is \"very angry\" with the White House over its \"unwavering support\" for Israel.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  Britain will be taking \"a courageous step at a very difficult time\" by officially recognising a Palestinian state, according to the authority's foreign minister, who told Sky News she believes the announcement - expected in the coming days - will inspire more nations to follow suit. The Palestinian Authority's foreign minister, Varsen Aghabekian, told me Britain's move was \"better late than never\", and said \"Britain, with its weight, can influence other countries to come forward and recognise, because that is the right thing to do\". But she also said she is \"very angry\" with the White House over its \"unwavering support\" for Israel, and said that Israel's refusal to pass on tax revenue was pushing Palestinian civil society to the brink of \"collapse\".    Aghabekian was speaking as Britain, along with France, Canada and Australia, prepares to recognise the State of Palestine officially at the United Nations. She told me: \"Britain has been supporting the existence and the flourishing of Israel for some time, but I think today Britain is looking at the matter objectively, in terms of the right of people, in terms of complying with international law, and in terms of the future of this area for both the Israelis and Palestinians.\" \n                  'Israeli strikes' on Yemen newspaper offices 'mark deadliest attack on press in 16 years'\n                 \n                  Starmer to announce formal recognition of Palestine as a state\n                 \n                  Why Starmer's move to recognise Palestine is a major shift\n                 She rejected the idea that recognising Palestine was a reward for Hamas terrorism, saying that \"non-recognition\" would also be a \"reward to the extremists\" and said that \"if we wait until Israel decides it wants to go into negotiations with the Palestinians, then it won't happen\". Aghabekian told me she expected Gaza to be returned to the Palestinians, but I put it to her that Israeli Prime Minister Benjamin Netanyahu was being empowered by the diplomatic support he receives from America, and in particular, US President Donald Trump. So is she angry with the White House? \"Very angry, because I expect the White House and the United States of America to align with international law, with human rights, with having no double standards. \"This unwavering support for Israel, this blind support, is not only harming the Palestinians but also Israeli society.\" Read more:What does recognising a Palestinian state mean?Gaza could be 'real estate bonanza', Israeli minister says The state of Palestine is already recognised by three-quarters of the United Nations' members. It comprises two separate territories - the West Bank, including East Jerusalem, and the Gaza Strip. Together, they are officially known as the Occupied Palestinian Territories. The West Bank has been subject to Israeli military occupation since 1967, while Gaza has been attacked by Israel since the Hamas attacks of 7 October 2023, when nearly 1,200 Israelis were killed and around 250 people were taken hostage. Since then, more than 65,000 people have been killed in Gaza as Israel has sought to destroy Hamas and recover its hostages. There are 48 hostages still in Gaza, with 20 believed to be alive. She confirmed to me that Mahmoud Abbas, leader of the Palestinian Authority, which governs the West Bank, \"has given guarantees in letters to various leaders around the globe that said Hamas will not be part of the governance of the Gaza Strip\" and insisted there was \"probably a worldwide consensus\" on the topic.  But she also insisted it was \"not reasonable\" to talk of completely erasing Hamas: \"Hamas is an ideology, not a building that you bring down. Hamas is in people's minds; in their heads. \"Those who support Hamas need to see a future, need to see something that is moving on the political level, need to see that there might be a state in which their children and their grandchildren might prosper. \"What people see today, whether they are Hamas supporters or not, they see darkness and they see destruction all over. They see violation of rights. They are helpless and hopeless. People need to see things are moving forward, and once that happens, there will be a shift in the mood, and they will look for a better future.\" But just as the Palestinians prepare to welcome recognition, Aghabekian said the West Bank was facing financial collapse as Israel continues to withhold hundreds of millions of dollars of tax revenue that, under a 30-year-old agreement, it collects on the Palestinian Authority's behalf. Israel has retained a proportion of the money since the start of the war in Gaza, but, encouraged by finance minister Bezalel Smotrich, it has recently withheld a much higher amount. \"People have not been paid, civil servants are only receiving small parts of their salaries. We can't buy medical supplies, equipment, you name it,\" said Aghabekian. \"How can a government run a country under such conditions? So yes, we are very worried.\""
    },
    {
        "title": "At least 70 killed in Sudan after paramilitary attack on mosque",
        "description": "At least 70 people have been killed after a paramilitary drone attack on a mosque in Sudan.",
        "url": "https://news.sky.com/story/at-least-70-killed-in-sudan-after-paramilitary-attack-on-mosque-13434497",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sudan-rsf-sudan-army_7026005.png?20250920113206",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-20 09:58:00",
        "Headline": "Aid workers and Sudan's army said a drone attack by the paramilitary Rapid Support Forces hit a mosque during Friday prayers. At least 70 people have been killed.",
        "Content": "At least 70 people have been killed after a paramilitary drone attack on a mosque in Sudan. The Sudanese army and aid workers said the paramilitary group Rapid Support Forces (RSF) carried out the attack during Friday prayers in the North Darfur region. The attack took place in the besieged city of Al Fasher and was said to have completely destroyed the mosque. With bodies still buried under the rubble, the number of deaths is likely to rise, a worker with the local aid group Emergency Response Rooms said. The worker spoke anonymously, fearing retaliation from the RSF. Further details of the attack were difficult to ascertain because it took place in an area where many international and charitable organisations have already pulled out because of the violence. In a statement, Sudan's army said it was mourning the victims of the attack. It said: \"Targeting civilians unjustly is the motto of this rebel militia, and it continues to do so in full view of the entire world.\" Sky News Africa correspondent Yousra Elbagir reported earlier this month on the situation in North Darfur, where people are facing torture, rape and forced starvation. The Sudan war started in April 2023, when long-simmering tensions between the Sudanese army and the RSF broke out in Khartoum. The US special envoy to Sudan estimates that 150,000 people have been killed, but the exact figure is unknown. Close to 12 million people have been displaced. Several mediation attempts have failed to secure a humanitarian access mechanism or any lulls in fighting. Read more from Sky News:Cyber attack disrupts European airportsMore than 1,000 migrants arrive in small boats in one day The Resistance Committees in El Fasher, a group of local activists who track abuses, posted a video on Friday claiming to show parts of the mosque reduced to rubble with several scattered bodies. The Darfur Victims Support Organisation, which monitors abuses against civilians, said the attack happened at a mosque on the Daraga al Oula street at around 5am local time, citing witnesses. The attack is the latest in a series of heavy clashes in the past week of between the two sides in Al Fasher."
    },
    {
        "title": "Thousands evacuated after WWII bomb discovered in Hong Kong",
        "description": "Thousands of people were forced to evacuate their homes in Hong Kong after a large US-made bomb from the Second World War was discovered.",
        "url": "https://news.sky.com/story/thousands-evacuated-after-wwii-bomb-discovered-in-hong-kong-13434651",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-hong-kong-bomb_7026253.jpg?20250920143848",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-20 13:07:00",
        "Headline": "The 450kg US-made bomb was discovered by construction workers in a busy residential and business district.",
        "Content": "Thousands of people were forced to evacuate their homes in Hong Kong after a large US-made bomb from the Second World War was discovered. Police said the bomb weighed around 450kg and measured 1.5m in length. It was discovered by construction workers in a busy residential and business district on the west side of the island. \"We have confirmed this object to be a bomb dating back to World War II,\" said police official Andy Chan Tin-Chu. He said that because of \"the exceptionally high risks associated with its disposal\", about 1,900 households made up of 6,000 people were \"urged to evacuate swiftly\". No one was injured in the operation to deactivate the bomb, which concluded on Saturday morning. Read more from Sky News:Welcome to Russia's alternative EurovisionCanada bans Kneecap from entering country Much like in London, bombs left over from the Second World War are discovered from time to time in Hong Kong. The city was occupied by Japanese forces during the conflict, who used it as a base for military and shipping. Allied forces targeted Hong Kong in air raids to disrupt Japanese supply lines."
    },
    {
        "title": "Dublin Airport terminal reopens after evacuation during security incident",
        "description": "Dublin Airport's Terminal 2 has been given the all-clear, hours after passengers were evacuated from the building&#160;due to a report of an \"item of airline luggage of concern\".",
        "url": "https://news.sky.com/story/dublin-airport-terminal-evacuated-as-safety-precaution-13434544",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-dublin-airport_7026375.jpg?20250920151733",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-20 11:27:00",
        "Headline": "Police were reported to be at the Irish airport earlier following an incident. The airport has warned \"temporary disruption\" could continue for the rest of the day. ",
        "Content": "Dublin Airport's Terminal 2 has been given the all-clear, hours after passengers were evacuated from the building due to a report of an \"item of airline luggage of concern\". The airport said flights would resume at around 2.30pm, but \"temporary disruption\" could continue for the rest of the day. Irish police said it requested the \"assistance of the Defence Forces' Explosive Ordnance Disposal (EOD) Team\" after the report, and following an investigation, the luggage was \"contained and deemed safe for removal\" from the airport. There is no suggestion that the evacuation was linked to the cyber attack that has caused disruption at several European airports. However, the airport said it was also experiencing minor impacts related to the Europe-wide software issue. Passengers are still advised to check with their airline for travel updates."
    },
    {
        "title": "Less camp, more conservative - welcome to Russia's alternative Eurovision",
        "description": "Banned from Eurovision after its invasion of Ukraine, Russia will hold a rival international song contest on Saturday, with an emphasis on \"traditional values\".",
        "url": "https://news.sky.com/story/less-camp-more-conservative-inside-russias-alternative-eurovision-13434392",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-intervision-russia_7025840.jpg?20250920025358",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-09-20 01:32:00",
        "Headline": "\"Intervision\" is Putin's idea, so don't expect a celebration of sexual diversity and LGBTQ+ rights. Oh and don't ask about Ukraine...",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  Banned from Eurovision after its invasion of Ukraine, Russia will hold a rival international song contest on Saturday, with an emphasis on \"traditional values\". Instead of camp, think conservative - patriotic pop with a PG-rating. \"Intervision\" was launched under the order of Vladimir Putin, with the hope it would serve as an expression of Moscow's international pulling power. There are contestants from 23 countries, which are a mixture of Russia's allies, old and new, including Belarus, Cuba, and Tajikistan, as well as China, India and Saudi Arabia. The United States, originally the odd one out, was due to be represented by an artist called \"Vassy\". But late on Saturday, the organisers announced she had pulled out - as a result of \"unprecedented political pressure from the government of Australia\". Sergei Lavrov, Russian foreign minister and deputy chairman of the supervisory board of Intervision, said the contest \"was not striving for any political effect\". The organisers \"expressed their regret\" over the US decision, but stressed that it would still be represented on the judging panel by singer Deep Purple. 'War whitewash' Intervision is not entirely new. It was originally launched in the 1960s as an instrument of Soviet soft power, before largely fading from view in the 1980s. According to Moscow, its revival has nothing to do with politics. But Ukraine has condemned it as propaganda, and an attempt to whitewash Russia's war. It was a point I put to some contestants after their final press conferences, but it didn't go down well. \"We don't think like that, we are here to spread peace,\" India's Rauhan Malik told me, when I asked if his participation was a show of support for Russia's invasion. \"Are you not turning a blind eye to Russia's aggression?\" I countered. \"I have no idea about it,\" he said. \"I have no idea about the current situation that's happening. I don't want to speak about that as well.\" Really? He had no idea? But before I could go on, I felt a forceful hand on my shoulder and a minder stepped in. The intervention was even quicker when it came to speaking to Brazil's act. As soon as I mentioned the word Ukraine, I was drowned out by shouts of \"no, no, no, no\" and the duo were ushered away. Where's the glitter? Intervision is not just a reaction to Russia's recent exclusion from Eurosivion, however, it's also a reaction to the contest's values and what it's come to represent. Its celebration of sexual diversity and LGBTQ+ rights are seen as a symbol of what the Kremlin calls the West's moral decline. In contrast, Intervision organisers say their contest will promote \"traditional, family values.\" Judging by the costumes on show ahead of last week's draw, that translates to less glitter, more embroidery, with a thematic emphasis on national heritage. Read more from Sky News:NATO responds after Russian military jets 'violate' Estonian airspace'Gender testing rules would have earned me an Olympic medal'Two ambulance workers arrested in connection with six deaths So what do Russians think of Intervision's resurrection? Can it replace Eurovision? \"We don't miss Eurovision,\" Galina and Tatiana say, underneath a collection of purple and pink 'Intervision' flags near Red Square. \"It was so horrible, especially lately. We didn't like watching it at all.\"  Polina agrees, believing Russia's version will be \"more interesting\". \"Many countries that participated in Eurovision want to boycott it, so it's interesting to see a more peaceful event now,\" she says. Igor is more circumspect. \"I'd like to believe that this isn't a political event,\" he says, \"but rather an event that unites nations and people.\" Intervision will succeed in uniting some nations. But at the same time, it may only deepen divisions with others - further evidence that Russia and the West are singing very different tunes."
    },
    {
        "title": "'Delighted to be free': Elderly British couple who were detained by Taliban arrive in UK",
        "description": "An elderly British couple who have arrived back in the UK after being detained in a maximum security Taliban prison are \"delighted to be free\", their son has told Sky News. ",
        "url": "https://news.sky.com/story/delighted-to-be-free-elderly-british-couple-who-were-detained-by-taliban-arrive-in-uk-13435138",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-barbie-peter-heathrow_7026302.jpg?20250920145257",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-20 20:10:00",
        "Headline": "Barbie and Peter Reynolds landed at Heathrow on Saturday after being held by the Taliban since February. ",
        "Content": " An elderly British couple who have arrived back in the UK after being detained in a maximum security Taliban prison are \"delighted to be free\", their son has told Sky News.  Barbie Reynolds, 76, and her husband Peter, 80, were arrested in February after spending decades in Afghanistan, where they have dual citizenship. They had been held without charge before being released from detention on Friday and flown to Qatar, where they were reunited with their daughter, before flying back to Heathrow Airport on Saturday.  The couple's son, Jonathan Reynolds, told Sky News: \"They're just delighted to be free... they're very excited to see their kids and grandkids and great grandkids, people they've just been wanting to catch up with and wondered if they'd ever see them again.\" Jonathan, who spoke to his parents from Wyoming in the US in a FaceTime call with some of his siblings, said: \"I've seen photographs of them in hospital beds getting checked. I've seen them having full English breakfasts. So they're jumping on that.\" He described some of the conditions his parents had been kept under in a \"big maximum security prison with thousands of inmates\". \"My dad described being handcuffed or chained to other criminals. And, one point he had his chest hairs ripped out,\" he said. \n                  Elderly British couple who were detained by Taliban arrive in UK\n                 \n                  She smiled and his eyes filled with emotion - the moment British couple were freed by the Taliban\n                 \n                  Elderly British couple held for months by Taliban reunited with daughter\n                 \"He was hit in the head. And, then they were moved, to more of a safe house.\" But Jonathan said his parents retained their British politeness even when calling him from a payphone in the prison yard, with his dad asking: \"Is now a good time?\". \"It was totally, 'Yeah, not too bad. Where's the queue to get out of here?'\" The UK government advises British nationals not to travel to Afghanistan.  Abdul Qahar Balkhi, a spokesperson at the Taliban government's foreign ministry, said in a statement posted on X that the couple \"violated Afghan law\" and were released from prison after a court hearing. He did not say what law the couple were alleged to have broken. Sky correspondent Cordelia Lynch was at Kabul Airport as the freed couple arrived and departed.  Mr Reynolds told her: \"We are just very thankful.\" His wife added: \"We've been treated very well. We're looking forward to seeing our children. \"We are looking forward to returning to Afghanistan if we can. We are Afghan citizens.\" The couple have lived in Afghanistan for 18 years and run an organisation called Rebuild, which provides education and training programmes. They have been together since the 1960s and married in the Afghan capital in 1970."
    },
    {
        "title": "Republican senator Ted Cruz blasts 'mafioso' threats over Jimmy Kimmel suspension",
        "description": "American Senator Ted Cruz has broken ranks with fellow US conservatives and hit out at talk show host Jimmy Kimmel's suspension, saying it was \"mafioso\" behaviour.",
        "url": "https://news.sky.com/story/ted-cruz-blasts-mafioso-threats-over-jimmy-kimmel-suspension-13434390",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jimmy-kimmel-chat-show_7024780.jpg?20250919034627",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-20 00:26:00",
        "Headline": "The powerful senator said threats to broadcasters surrounding the TV star's removal from air were \"dangerous as hell\" - but now President Trump's hit back.",
        "Content": "American Senator Ted Cruz has broken ranks with fellow US conservatives and hit out at talk show host Jimmy Kimmel's suspension, saying it was \"mafioso\" behaviour. Disney-owned ABC has been widely criticised after it pulled the long-standing host of Jimmy Kimmel Live following comments in his show about the alleged gunman charged with right-wing activist Charlie Kirk's murder. Kimmel implied the suspect was a Maga Republican, despite the man's mother telling police he had \"started to lean more to the left\". As a result, Federal Communications Commission chair Brendan Carr threatened Disney and local broadcasters with investigations and regulatory action if they aired Kimmel's show - which led to dozens of local TV stations affiliated with ABC pulling it. US President Donald Trump, who appointed Carr, lauded the decision. But Mr Cruz criticised the threats as \"dangerous as hell\". \"I got to say that's right out of 'Goodfellas',\" he said, evoking the Martin Scorsese gangster movie. \"That's right out of a mafioso coming into a bar going, 'Nice bar you have here. \n                  Jonathan Pie: British satirist's free speech warning to UK after Jimmy Kimmel show taken off air\n                 \n                  US talk show hosts react to Jimmy Kimmel cancellation - as Trump issues threat\n                 \n                  Trump has a creeping control over what gets said on the airwaves and it screams censorship\n                 \"It would be a shame if something happened to it'.\" Explainer: What did Jimmy Kimmel say about Charlie Kirk? The senator, a former constitutional lawyer, then adopted a broad mafioso accent to quote Mr Carr's comments about broadcasters this week: \"We can do this the easy way, or we can do this the hard way.\" Mr Trump fired back, telling reporters in the Oval Office on Friday that he disagreed with Mr Cruz - one of the most powerful Republicans in Congress - and calling Mr Carr \"an incredible American patriot with courage.\" The Texas senator's remarks are a rare example of a prominent member of the president's own party publiclycriticising the actions of the administration, highlighting deepening concerns over free-speech rights and Mr Trump's threatened crackdowns. Prominent Democrats and civil rights groups condemned the Trump administration's pressure to punish Kimmel and others who speak negatively of the president. Read more:British satirist issues free speech warning to UK after Kimmel show taken off airUS talk show hosts react to Jimmy Kimmel cancellation Kimmel's fellow late-night hosts have rallied around him, as did former US president Barack Obama, who wrote on X: \"After years of complaining about cancel culture, the current administration has taken it to a new and dangerous level by routinely threatening regulatory action against media companies unless they muzzle or fire reporters and commentators it doesn't like. \"This is precisely the kind of government coercion that the First Amendment was designed to prevent, and media companies need to start standing up rather than capitulating it.\" Conservative activists had been angered by Kimmel's comments on his show that they were using the assassination to score \"political points\". Right-wing influencer Charlie Kirk was shot dead on 10 September as he took part in a public debate at a college campus in Utah . Tyler Robinson, 22, was charged with aggravated murder, weapon, and obstruction of justice offences."
    },
    {
        "title": "Luigi Mangione's lawyers call on judge to block the death penalty",
        "description": "Lawyers for Luigi Mangione have called on a judge to block federal prosecutors from seeking the death penalty against him.",
        "url": "https://news.sky.com/story/luigi-mangiones-lawyers-call-on-judge-to-block-the-death-penalty-13435211",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-luigi-mangione-unitedhealthcare_7022191.jpg?20250916151834",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-20 19:05:00",
        "Headline": "In a new court filing, his legal team argues federal prosecutors have \"violated Mr Mangione's constitutional and statutory rights\" and the case for the death penalty has been \"fatally prejudiced\" after comments made by US President Donald Trump.",
        "Content": "Lawyers for Luigi Mangione have called on a judge to block federal prosecutors from seeking the death penalty against him. Mangione's legal team says the 27-year-old's case has been turned into a \"Marvel movie\" after a failed bid by the US Justice Department to indict him on terrorism charges over the fatal shooting of UnitedHealthcare chief executive Brian Thompson in New York on 4 December. New York state judge Gregory Carro said there was no evidence that the killing, which took place as Mr Thompson walked into an investor conference at the New York Hilton Midtown hotel, amounted to a terrorist act. But Judge Carro upheld second-degree murder charges, which suggest there was malicious intent - but not that it was premeditated. US Attorney General Pam Bondi has called for Mangione to face capital punishment, describing the charges against him as a \"premeditated cold-blooded assassination that shocked America\". But in the new court filing, Mangione's legal team argues federal prosecutors have \"violated Mr Mangione's constitutional and statutory rights\" by \"staging a dehumanizing, unconstitutional 'perp walk' where he was televised, videotaped, and photographed clambering out of a helicopter in shackles\" on the way to his first court appearance. The legal team, led by former Manhattan prosecutor Karen Friedman Agnifilo, also claims the death penalty case has been \"fatally prejudiced\" after President Donald Trump commented on it on Fox News. Despite laws that prohibit any pre-trial commentary that could prejudice the defendant's right to a free trial, he told the network on Thursday: \"Think about Mangione. He shot someone in the back, as clear as you're looking at me or I'm looking at you.\" Read more from Sky NewsTrump throws out New York Times lawsuitFree speech warning after Kimmel taken off airSongwriter killed in small plane crash The defence team's 114-page court filing reads: \"There is a high bar to dismissing an indictment due to pretrial publicity. \"However, there has never been a situation remotely like this one where prejudice has been so great against a death-eligible defendant.\" Federal prosecutors have until 31 October to respond to the documents. Mangione has pleaded not guilty to all the state charges against him, which cannot result in the death penalty and only life imprisonment, unlike federal ones. He has also pleaded guilty to the federal charges. He is due back in court for a pre-trial hearing in the state case on 1 December and the federal case on 5 December. The 27-year-old was arrested five days after Mr Thompson was killed - when he was spotted at a McDonald's in Altoona, Pennsylvania, around 230 miles west of New York City."
    },
    {
        "title": "Armed man charged with impersonating police officer at Charlie Kirk memorial stadium",
        "description": "A man has been charged with impersonating a police officer and carrying a weapon at the stadium where a memorial is being held for Charlie Kirk on Sunday, the US Secret Service has said.&#160;",
        "url": "https://news.sky.com/story/armed-man-charged-with-impersonating-police-officer-at-charlie-kirk-memorial-stadium-13435298",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-charlie-kirk-arizona_7027170.jpg?20250920222422",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-20 21:20:00",
        "Headline": "The suspect was approached by security staff at State Farm Stadium in Arizona on Friday after \"exhibiting suspicious behaviour\".",
        "Content": "A man has been charged with impersonating a police officer and carrying a weapon at the stadium where a memorial is being held for Charlie Kirk on Sunday, the US Secret Service has said.  The suspect was approached by security staff at State Farm Stadium in Arizona on Friday after \"exhibiting suspicious behaviour\", a Secret Service spokesperson said in a statement. He \"falsely claimed to be a member of law enforcement and stated that he was armed\", the statement continued. He was then arrested by the Arizona Department of Public Safety and charged with impersonating a law enforcement officer and carrying a weapon in a prohibited place. The man was taken to Maricopa County Jail and later released on bail. Read more from Sky NewsCharlie Kirk suspect appears in courtJD Vance blames left-wing extremism for Kirk killing The memorial service is expected to draw huge crowds and set to be attended by US President Donald Trump and vice president JD Vance. State Farm Stadium is home to the American football team, the Arizona Cardinals and has previously hosted the Super Bowl. Turning Point USA co-founder Kirk, 31, was shot dead during an event at Utah Valley University on 10 September. Tyler Robinson, 22, from Utah, has been charged with aggravated murder, weapon, and obstruction of justice offences."
    },
    {
        "title": "TalkTalk Group picks bankers to spearhead break-up",
        "description": "TalkTalk Group has picked advisers to spearhead a break-up that will lead to the sale of one of Britain's biggest broadband providers.",
        "url": "https://news.sky.com/story/talktalk-group-picks-bankers-to-spearhead-break-up-13434522",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-talktalk-money-business_7026016.jpg?20250920120535",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-20 11:01:00",
        "Headline": "The parent company of the broadband supplier, which has more than 3m UK customers, is lining up PJT Partners to oversee the disposal of its remaining operations, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n TalkTalk Group has picked advisers to spearhead a break-up that will lead to the sale of one of Britain's biggest broadband providers. Sky News has learnt that PJT Partners, the investment bank, is being lined up to handle a strategic review aimed at assessing the optimal timing for a disposal of TalkTalk's remaining businesses. PJT's appointment is expected to be finalised shortly, City sources said this weekend. Founded by Sir Charles Dunstone, the entrepreneur who also helped establish The Carphone Warehouse, TalkTalk has 3.2 million residential broadband customers across the UK. That scale makes it one of the largest broadband suppliers in the country, and means that Ofcom, the telecoms industry regulator, will maintain a close eye on the company's plans. The break-up is expected to take some time to complete, and will involve the separate sales of TalkTalk's consumer operations, and PlatformX, its wholesale and network division. Within the latter unit, TalkTalk's ethernet subsidiary could also be sold on a standalone basis, according to insiders. \n                  Broadband provider TalkTalk plots £200m sale of corporate arm\n                 \n                  TalkTalk shares rise over Toscafund's takeover bid\n                 TalkTalk, which has been grappling with a heavily indebted balance sheet for some time, secured a significant boost during the summer when it agreed a £120m capital injection. The bulk of those funds came from Ares Management, an existing lender to and shareholder in the company. That new funding followed a £1.2bn refinancing completed late last year, but which failed to prevent bondholders pushing for further moves to strengthen its balance sheet. Over the last year, TalkTalk has slashed hundreds of jobs in an attempt to exert a tighter grip on costs. It also raised £50m from two disposals in March and June, comprising the sale of non-core customers to Utility Warehouse. In addition, there was also an in-principle agreement to defer cash interest payments and to capitalise those worth approximately £60m. The company's business arm is separately owned by TalkTalk's shareholders, following a deal struck in 2023. Read more:Tax rises expected as government borrowing highest in five yearsEstate agent LRG eyes £800m sale amid spectre of budget tax raid TalkTalk was taken private from the London Stock Exchange in a £1.1bn deal led by sister companies Toscafund and Penta Capital. Sir Charles, the group's executive chairman, is also a shareholder. The company is now run by chief executive James Smith. The identity of suitors for TalkTalk's remaining operations was unclear this weekend, although a number of other telecoms companies are expected to look at the consumer business. Britain's altnet sector, which comprises dozens of broadband infrastructure groups, has been struggling financially because of soaring costs and low customer take-up. On Saturday, a TalkTalk spokesman declined to comment."
    },
    {
        "title": "Estate agent LRG eyes £800m sale amid spectre of Budget tax raid",
        "description": "One of Britain's biggest estate agency groups is drawing up plans for an &#163;800m sale amid speculation that Rachel Reeves, the chancellor, is plotting a fresh tax raid on homeowners in her autumn Budget.",
        "url": "https://news.sky.com/story/estate-agent-lrg-eyes-163800m-sale-amid-spectre-of-budget-tax-raid-13434419",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-houses-for-sale-property_6984960.jpg?20250807163552",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-20 06:20:00",
        "Headline": "The American buyout firm Platinum Equity has hired bankers to explore a sale of LRG, which trades from more than 300 branches and employs roughly 3,500 people, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n One of Britain's biggest estate agency groups is drawing up plans for an £800m sale amid speculation that Rachel Reeves, the chancellor, is plotting a fresh tax raid on homeowners in her autumn Budget. Sky News has learnt that LRG, which is owned by the American buyout firm Platinum Equity, is being groomed for an auction that would take place during the coming months. Bankers at Rothschild have been appointed by Platinum to oversee talks with potential bidders. Platinum acquired LRG, which owns brands including Acorn, Chancellors and Stirling Ackroyd, in January 2022. The estate agency group, which handles residential sales and lettings, trades from more than 350 branches and employs approximately 3,500 people. City sources said this weekend that Platinum believed a valuation for the business of well over £700m was achievable in a sale. The US-based private equity investor bought LRG - then known as Leaders Romans Group - from Bowmark Capital, a smaller buyout firm. \n                  TalkTalk Group picks bankers to spearhead break-up\n                 \n                  Tax rises expected as government borrowing highest in five years - latest ONS figures\n                 \n                  Money blog: What happened when three professionals took career breaks? From 'life-changing experiences' to 1,200 rejected CVs\n                 Bidders in this auction are also likely to include financial investors. Some of LRG's brands have a long history in the UK property industry, with Portico tracing its origins as far back as 1818. The company, now run by chief executive Michael Cook, manages 73,000 properties and last year handled property sales worth £3.6bn. Although prospective bidders for LRG have already begun being sounded out, an auction of the group is likely to take several months to conclude. Industries such as banking, housing and gambling have been gripped by suggestions that the chancellor will target them in an attempt to raise tens of billions of pounds in additional revenue. Last month, house prices fell unexpectedly - albeit by just 0.1% - amid warnings from economists about the impact of speculation over a tax raid on homeowners. Reports in the last two months have suggested that Ms Reeves and her officials at the Treasury are considering measures such as an overhaul of stamp duty, a mansion tax and the ending of primary residence relief for properties above a certain value. Her Budget, which will take place in late November, is still more than two months away, suggesting that meaningful discussions with bidders for businesses such as LRG are unlikely to take place until the impact of new tax measures has been properly digested. Robert Gardner, chief executive at Nationwide, the UK's biggest building society, said reform of property taxes was overdue. \"House prices are still high compared to household incomes, making raising a deposit challenging for prospective buyers, especially given the intense cost of living pressures in recent years,\" he said earlier this month Britain's estate agency market remains relatively fragmented, with groups such as LRG spearheading myriad acquisitions of small players with fewer than a handful of branches. Among the other larger operators in the market, Dexters - which is chaired by the former J Sainsbury boss Justin King - is also backed by private equity investors in the form of Oakley Capital. Few estate agents now have their shares publicly traded, with the equity of Foxtons Group, one of London's most prominent property agents, now worth just £168m. Platinum Equity declined to comment."
    },
    {
        "title": "Ed Davey attacks Reform and Nigel Farage as he pushes for emergency measures to clear asylum backlog",
        "description": "Sir Ed Davey kicked off the Lib Dem conference by attacking Reform and Nigel Farage as he pushed for emergency measures to clear the asylum backlog in a \"humane\" way.",
        "url": "https://news.sky.com/story/ed-davey-attacks-reform-and-nigel-farage-as-he-pushes-for-emergency-measures-to-clear-asylum-backlog-13435117",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ed-davey-lib-dems_7026905.jpg?20250920182858",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-09-20 19:50:00",
        "Headline": "The Lib Dems have proposed launching Nightingale-style asylum processing centres which they said would clear the backlog within six months.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Sir Ed Davey kicked off the Lib Dem conference by attacking Reform and Nigel Farage as he pushed for emergency measures to clear the asylum backlog in a \"humane\" way. The Lib Dem leader, on the first day of his party's conference in Bournemouth, launched into their new tactic of criticising Reform with renewed vigour after a summer of Mr Farage holding headline-grabbing news conferences. He accused the Reform leader of not being a patriot after Mr Farage denigrated the UK during a speech in the US. Sir Ed also put the Lib Dems forward as the party that is \"true to British values\". He said asylum hotels could close within six months by setting up emergency processing centres modelled on the large-scale temporary Nightingale hospitals used during COVID. Under the plan, they would use the Civil Contingencies Act 2004 to allow the government additional powers to secure the funds to hire and train more asylum case workers to tackle the backlog. MP Lisa Smart, the Lib Dem home affairs spokesperson, said it would only take \"weeks\" to train up more case workers but training was key to ensure the right decisions were made and appeals could not be made, which would increase the backlog. Sir Ed told Sky News: \"We think you can stop the boats, deal with illegal immigration and close down the asylum hotels, but do it in a way that's still humane. \n                  Lib Dems toughen up immigration rhetoric as Sir Ed Davey pledges to 'stop the boats'\n                 \n                  By-elections that shook up politics – could Andy Burnham be next?\n                 \n                  Everything you need to know about being a political party member\n                 \"Our proposal is really well thought through, far more ambitious, far greater scale than we've seen from either Conservatives or Labour. And it would really show that Farage, for what he is, he's not offering real solutions.\" Read more:Lib Dems toughen up immigration rhetoricDropping Chinese spy charges 'leaves door open'  And after telling Sky News earlier in the week we need to \"stop the boats\" - a hardening of Lib Dem language - he said: \"If people have no right to be here, they should be deported. \"We just need to get on with the job. There are people there who deserve to be welcomed into our country, who are genuine asylum seekers, genuine refugees, and it's been the British tradition to welcome people who genuinely are refugees. So I think you can do both.\" Political correspondent Sir Ed Davey's all-singing, all-dancing entry to the conference was designed to promote two messages.  The first, most obviously, was to highlight his party's buoyant mood after last year's record haul of 72 MPs and a series of local election wins – quite a contrast to the increasingly public infighting amongst both the Conservatives and Labour. The second was a bid to wrest back the concept of patriotism away from what he described as the \"divisive politics\" of Reform UK. The tunes were cheerful pop classics and ticker tape rained down on the assembled activists, joyfully waving their union flags – quite a contrast to the divisive debate over the use of flags this summer. Sir Ed is adamant his party is not dancing to Farage's tune. But they are certainly turning their fire on Reform – with Lego Farage figurines labelled \"plastic patriots\", complete with MAGA hats, handed out to conference attendees. While the policies may not have changed all that much, Sir Ed's comments about the importance of deporting illegal migrants from safe countries such as Turkey and Brazil certainly sounded like tougher rhetoric than we have heard before. Less than a mile away there was a very different kind of march. Demonstrators brandishing much bigger flags made their way from Bournemouth pier to one of the town's three asylum hotels, chanting about stopping the boats, wanting their country back – and even – when the procession passed two women wearing them – banning burqas. They were met by a group of counter-protesters keen to welcome refugees (separated by several rows of police officers). Neither side was especially impressed by what the Lib Dems had to say – though counter-protesters welcomed the party's commitment to safe and legal routes, and calls for asylum seekers to be allowed to work and contribute to society.\n The Lib Dems then held a rally of their own – but the debate over asylum and patriotism is a loud one. Will they be able to cut through the noise? Ms Smart also took a strong line on flags in reaction to people hanging them all around the country in response to asylum hotels. She said she was \"relaxed\" about people flying a flag, adding: \"I'm not concerned about some of the motivations behind people plastering them in front of an asylum hotel. \"I don't think flying the flag means anything.\" While the Lib Dems may have changed their tone on immigration, they showed their signature style is still there, with Sir Ed arriving at conference leading a marching band that played classics such as Sweet Caroline and Crocodile Rock."
    },
    {
        "title": "Republican senator Ted Cruz blasts 'mafioso' threats over Jimmy Kimmel suspension",
        "description": "American Senator Ted Cruz has broken ranks with fellow US conservatives and hit out at talk show host Jimmy Kimmel's suspension, saying it was \"mafioso\" behaviour.",
        "url": "https://news.sky.com/story/ted-cruz-blasts-mafioso-threats-over-jimmy-kimmel-suspension-13434390",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jimmy-kimmel-chat-show_7024780.jpg?20250919034627",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-20 00:26:00",
        "Headline": "The powerful senator said threats to broadcasters surrounding the TV star's removal from air were \"dangerous as hell\" - but now President Trump's hit back.",
        "Content": "American Senator Ted Cruz has broken ranks with fellow US conservatives and hit out at talk show host Jimmy Kimmel's suspension, saying it was \"mafioso\" behaviour. Disney-owned ABC has been widely criticised after it pulled the long-standing host of Jimmy Kimmel Live following comments in his show about the alleged gunman charged with right-wing activist Charlie Kirk's murder. Kimmel implied the suspect was a Maga Republican, despite the man's mother telling police he had \"started to lean more to the left\". As a result, Federal Communications Commission chair Brendan Carr threatened Disney and local broadcasters with investigations and regulatory action if they aired Kimmel's show - which led to dozens of local TV stations affiliated with ABC pulling it. US President Donald Trump, who appointed Carr, lauded the decision. But Mr Cruz criticised the threats as \"dangerous as hell\". \"I got to say that's right out of 'Goodfellas',\" he said, evoking the Martin Scorsese gangster movie. \"That's right out of a mafioso coming into a bar going, 'Nice bar you have here. \n                  Jonathan Pie: British satirist's free speech warning to UK after Jimmy Kimmel show taken off air\n                 \n                  US talk show hosts react to Jimmy Kimmel cancellation - as Trump issues threat\n                 \n                  Trump has a creeping control over what gets said on the airwaves and it screams censorship\n                 \"It would be a shame if something happened to it'.\" Explainer: What did Jimmy Kimmel say about Charlie Kirk? The senator, a former constitutional lawyer, then adopted a broad mafioso accent to quote Mr Carr's comments about broadcasters this week: \"We can do this the easy way, or we can do this the hard way.\" Mr Trump fired back, telling reporters in the Oval Office on Friday that he disagreed with Mr Cruz - one of the most powerful Republicans in Congress - and calling Mr Carr \"an incredible American patriot with courage.\" The Texas senator's remarks are a rare example of a prominent member of the president's own party publiclycriticising the actions of the administration, highlighting deepening concerns over free-speech rights and Mr Trump's threatened crackdowns. Prominent Democrats and civil rights groups condemned the Trump administration's pressure to punish Kimmel and others who speak negatively of the president. Read more:British satirist issues free speech warning to UK after Kimmel show taken off airUS talk show hosts react to Jimmy Kimmel cancellation Kimmel's fellow late-night hosts have rallied around him, as did former US president Barack Obama, who wrote on X: \"After years of complaining about cancel culture, the current administration has taken it to a new and dangerous level by routinely threatening regulatory action against media companies unless they muzzle or fire reporters and commentators it doesn't like. \"This is precisely the kind of government coercion that the First Amendment was designed to prevent, and media companies need to start standing up rather than capitulating it.\" Conservative activists had been angered by Kimmel's comments on his show that they were using the assassination to score \"political points\". Right-wing influencer Charlie Kirk was shot dead on 10 September as he took part in a public debate at a college campus in Utah . Tyler Robinson, 22, was charged with aggravated murder, weapon, and obstruction of justice offences."
    }
]