[
    {
        "title": "'It's simply not safe': A thousand doctors write to MPs urging them to vote against assisted dying bill",
        "description": "More than 1,000 doctors have written to MPs urging them to vote against the assisted dying bill, calling it a \"real threat to both patients and the medical workforce\".",
        "url": "https://news.sky.com/story/its-simply-not-safe-a-thousand-doctors-write-to-mps-urging-them-to-vote-against-assisted-dying-bill-13380847",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-assisted-dying_6936985.jpg?20250608181644",
        "type": "Home",
        "Author": "Megan Harwood-Baynes, Ashish Joshi and Mark Thompson, Sky News health team",
        "Date Published": "2025-06-08 23:01:00",
        "Headline": "Supporters of the bill say it would allow terminally ill patients from England and Wales to end their lives \"on their own terms\", providing they have a life expectancy of six months or less.",
        "Content": "By Megan Harwood-Baynes, Ashish Joshi and Mark Thompson, Sky News health team  More than 1,000 doctors have written to MPs urging them to vote against the assisted dying bill, calling it a \"real threat to both patients and the medical workforce\". The bill - which is due to be voted on by MPs for a final time on 20 June - would allow terminally ill patients from England and Wales to end their lives \"on their own terms\", providing they have a life expectancy of six months or less. A separate bill is currently passing through the Scottish parliament. But doctors from across the NHS have written to MPs, warning them of their \"serious concerns\". Notable signatories include Sir John Burn, a geneticist who has led decades of cancer research, Sir Shakeel Qureshi, who was knighted for his work in paediatric cardiology, Professor Aileen Keel, the former deputy chief medical officer for Scotland, and Baroness Finlay, a Welsh doctor, professor of palliative medicine and member of the House of Lords. The letter is signed by four doctors who hold OBEs, two who have MBEs, and one CBE. The letter says that while a debate is needed on end of life care, \"this bill is not the answer\". \n                  Dr Florian Willet: Euthanasia advocate dies after being arrested over woman's 'suicide capsule' death\n                 \n                  'Deeply dangerous' assisted dying bill should be scrapped, says leading care consultant\n                 \n                  MPs criticise terminally ill Esther Rantzen's assisted dying intervention\n                 It raises concerns that not enough evidence has been heard from doctors, people with disabilities and other marginalised groups. \"This bill will widen inequalities, it provides inadequate safeguards and, in our collective view, is simply not safe,\" it goes on to say, calling it a \"deeply flawed bill\".  Read more:Why is assisted dying so controversial - and where is it already legal?Five stories that bring the assisted dying debate homeTwo terminally ill patients give opposing views on assisted dying Professor Colin Rees, a member of the Royal College of Physicians working group on assisted dying, said it was the \"single most important piece of healthcare legislation in 50 or 60 years\". \"It will have very profound consequences for the future and many doctors are really concerned that members of parliament are not hearing the views of the medical profession.\" He said many doctors who remain neutral, or who even support the principle of assisted dying, remain concerned about the bill. \"We don't think it's a bill that is safe, that protects patients, protects families, and protects the medical workforce.\" The Terminally Ill Adults (End of Life) Bill passed the House of Commons with a majority of 55 in November. Scotland's Assisted Dying for Terminally Ill Adults (Scotland Bill) pass with a 14 majority in May. But the legislation has not been without controversy, with 150 amendments made to get it through the first stage.  The bill will return to the House of Commons for a third reading this Friday. If voted through by MPs it will then proceed to the House of Lords. 'No safeguards against coercion' One of the areas of concern raised by the medics was the inability to properly identify patients at risk of coercive control. \"Vulnerable patients are at risk of coercion with women, victims of domestic abuse, and the elderly at particular risk,\" the letter says. It also warned it would widen social inequalities, with patients who do not have the resources for a comfortable death more likely to opt for assisted dying. \"People who struggle to pay for heating or care or wish to preserve their assets for their children are at high risk of choosing to die if the option is available and the alternative is more difficult.\" Data from the Annual Report of Dying With Dignity from Oregon in 2024 found 9.3% of those people who choose assisted deaths do so for financial reasons. 'Doctors get it wrong 40% of the time' Concerns have also been raised around the inaccuracies of medical prognosis. \"Research demonstrates that doctors get prognosis wrong around 40% of the time,\" the letter says. \"As such, patients may end up choosing an assisted death and losing what could have been happy and fulfilling months or years of life.\"  The bill is also a risk to families, the letter says, as it does not require doctors to speak with family members. \"A close relative may know nothing until they get a call to arrange collection of their relative's body,\" it says, adding that there is no mechanism for a family member to raise concerns about a request. The letter also addressed the potential impact on the medical workforce. Evidence from the Netherlands suggests \"doctors feel pressurised when dealing with patient requests for assisted deaths, meaning that doctors may end up having involvement despite it being against their principles, because they want to help their patients\"."
    },
    {
        "title": "'Ordering a woman to be sexually exploited is as easy as ordering a takeaway': How trafficking victims are being sold online",
        "description": "*Sarah thought she was going to a job interview to become a waitress.",
        "url": "https://news.sky.com/story/ordering-a-woman-to-be-sexually-exploited-is-as-easy-as-ordering-a-takeaway-how-trafficking-victims-are-being-sold-online-13380622",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-pimping-sex-trafficked-victim_6937101.jpg?20250609030603",
        "type": "Home",
        "Author": "Matthew Thompson, news correspondent, and Joely Santa Cruz, data journalist",
        "Date Published": "2025-06-08 23:01:00",
        "Headline": "A Sky News investigation uncovers thousands of potential indicators of sexual exploitation on two of the UK's most prominent adult service websites.",
        "Content": "By Matthew Thompson, news correspondent, and Joely Santa Cruz, data journalist   *Sarah thought she was going to a job interview to become a waitress. Warning: This story includes graphic descriptions of sexual exploitation and abuse, including rape Instead, she was lured to a strange man's flat and held against her will for six months. \"One of the very first things he did was ask for me to hand over my passport to check that I had the right to work,\" she says. \"I remember him asking me kind of odd questions, like, 'do you like sex?' \"I remember him taking me into another room within this flat and closing the door behind him, then locking the door. And then I was raped.\" She says her passport was used to create an online profile to advertise her for sex. She had no control over the adverts, no access to the accounts, and was repeatedly abused by her trafficker and the men who booked her through the website. \n                  Retired vicar admits role in 'Eunuch Maker' extreme body modification ring\n                 \n                  Hainault trial opens - as it happened: Marcus Arduini Monzo appears in court accused of killing 14-year-old Daniel Anjorin in sword attack\n                 \n                  Man convicted after burning Koran outside Turkish consulate in London\n                 \"My abuser would say: 'This man would like to see you, he's booked you, but he's requested sloppy seconds. Okay? I am going to rape you again so that when you go and see this man, you will take that to that man',\" she tells Sky News. Sarah says she was forced to take on different names to match her trafficker's rotating online personas. She ultimately escaped after threatening to scream unless her abuser let her go. \"He just glared at me, furious,\" she recalls. \"But he opened the door. That was the moment I had. That was the moment I took. I ran out and never saw him again.\" Sarah's abuser is now in prison. But the website that he used to facilitate her abuse is still operating. A Sky News investigation has uncovered thousands of potential indicators of sexual exploitation on two of the UK's most prominent adult service websites, raising serious concerns about how traffickers may be using these platforms to advertise and abuse victims like Sarah. Analysis of more than 50,000 adverts on AdultWork and Vivastreet - two of the country's largest escorting platforms - revealed a high concentration of red flags linked to organised exploitation, including repeated use of the same contact numbers, and/or duplicated advert text, across adverts for different women in different geographical locations. These patterns, highlighted by the Sex Trafficking Indication Matrix (STIM), a research tool used to identify signs of trafficking, suggest some profiles may be linked to coercive networks. In one case, the same phone number appeared in eight separate adverts for at least five different women, all listed with identical ages, nearly identical descriptions, but different photographs and spread across multiple UK regions. Neither platform is accused of criminal activity, but experts and campaigners say the scale and nature of these indicators are red flags for potential abuse. Prostitution is legal in England and Wales. But the controlling of prostitution for gain, sometimes called pimping, and the more severe crime of trafficking, are not. \"These platforms make it as easy to order a woman to be sexually exploited as it is to order a takeaway,\" said Kat Banyard, director of campaign group UK Feminista. \"There are big questions for national policing to answer about why it is that this important investigation has had to be done by Sky News, and why it wasn't national policing that was launching an investigation to uncover the scale of potential criminality on these sites.\" Over several months, Sky News used STIM indicators to assess escorting adverts across two platforms. On Vivastreet alone, more than 7,000 were linked to phone numbers that appeared multiple times - more than half the total number of listings at the time. On AdultWork, over 1,000 ads were found to contain duplicated descriptions. In one example on AdultWork, the same wording was used in 357 different listings - a sign that content may have been copied and pasted to cover for multiple individuals under a single operator. The websites told us duplication can reflect legitimate activity, such as touring sex workers using aliases. However, opponents say their structure allows abusers to hide in plain sight. Sky News can also reveal that officials at the Home Office met representatives from escorting websites 25 times between 2017 and 2024, under the previous Conservative government. Critics argue these discussions have failed to lead to meaningful safeguards or regulation. A Home Affairs Committee report in 2023 was highly critical of this kind of engagement. And in parliament, pressure is building to take stronger action. Labour MP Tonia Antoniazzi has tabled an amendment to the Policing and Crime Bill that would seek to ban such websites altogether. \"This is a thriving, multibillion-pound industry, and we're acting like there's nothing to see here,\" she says. \"It's horrific, and I think more people need to be speaking out about it - this gives parliamentarians the opportunity to discuss and debate it on the floor of the house.\" Read more from Sky NewsLife inside a dangerous tower blockMore strangulation cases recorded by police In a statement, a Vivastreet spokesperson said: \"Experts are clear that indicators that may suggest exploitation can have innocent explanations. \"For example, it is a fact that many sex workers use different names and personas, and 'touring' - moving for short periods of time to different areas to take bookings - is a well-known practice. \"We take safety extremely seriously and deploy industry-leading security measures to detect, report, and remove potentially exploitative content, including new requirements that all adult category advertisers must undergo age and ID verification.\" AdultWork said: \"Sexual exploitation is not tolerated in any form. \"We have strict internal policies in place to reinforce this and we are continually updating our internal systems for detecting accounts and requesting additional documents for evidence of legitimacy. \"We make it a priority to fully cooperate and comply with all law enforcement requests. Additionally, any indications or reports of trafficking are fully reviewed and if we find them to be suspicious, we proactively contact law enforcement.\" Whether escorting platforms can be better regulated - or whether they should be outlawed entirely - remains a point of national debate. But with mounting evidence of potential exploitation and growing political scrutiny, campaigners say inaction is no longer an option. \"These platforms are so poorly moderated and poorly regulated,\" Sarah says. \"No one can sit behind a screen and know if someone's being coerced or is at the mercy of a predator.\" *Sarah's name has been changed to protect her identity"
    },
    {
        "title": "IDF told to 'take whatever measures necessary' to stop Greta Thunberg aid boat from reaching Gaza",
        "description": "Israel's defence minister has threatened to \"take whatever measures necessary\"  to stop an aid boat carrying Greta Thunberg from reaching Gaza.",
        "url": "https://news.sky.com/story/israels-defence-minister-vows-to-stop-aid-boat-carrying-greta-thunberg-from-reaching-gaza-13380707",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-greta-thunberg-madleen_6936976.jpg?20250608174816",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-08 12:02:00",
        "Headline": "The climate campaigner is one of 12 activists aboard the vessel, which is operated by the Freedom Flotilla Coalition and aims to break Israel's sea blockade.",
        "Content": "Israel's defence minister has threatened to \"take whatever measures necessary\"  to stop an aid boat carrying Greta Thunberg from reaching Gaza. The climate campaigner, 22, is one of a dozen activists aboard the Madleen, which set sail from Sicily last Sunday on a mission aiming to break Israel's sea blockade. The activists have said they plan to reach Gaza's territorial waters as early as Sunday to deliver humanitarian aid. But in a post on X, Israel's defence minister Israel Katz said he has instructed the IDF to prevent the vessel reaching the shore and to \"take whatever measures necessary\". Addressing Thunberg and the other activists, he said: \"You should turn back - because you will not reach Gaza.\" He wrote: \"I have instructed the IDF to act so that the 'Madeleine' hate flotilla does not reach the shores of Gaza - and to take any means necessary to that end. \"To the anti-Semitic Greta and her fellow Hamas propaganda spokespeople, I say clearly: You should turn back - because you will not reach Gaza. \"Israel will act against any attempt to break the blockade or assist terrorist organizations - at sea, in the air and on land.\"  Rima Hassan, a French member of the European Parliament, who is of Palestinian descent, is also on the boat, which is operated by the Freedom Flotilla Coalition. She has been barred from entering Israel because of her opposition to Israel's policies towards Palestinians. Read more from Sky News:British surgeon on IDF in GazaTrump deploys National Guard to LA immigration 'riots'Russia claims troops reach new Ukrainian region Israel started allowing some basic aid into Gaza last month after a three-month total blockade aimed at pressuring Hamas and preventing the group from importing arms. But humanitarian workers have warned of famine unless there is an end to the blockade and the 20-month war, which was ignited by the Hamas-led attack on southern Israel on 7 Oct 2023. An attempt last month by Freedom Flotilla to reach Gaza by sea failed after another of the group's vessels was attacked by two drones while sailing in international waters off Malta. The group blamed Israel for the attack, which damaged the front section of the ship."
    },
    {
        "title": "Two men charged with murder after teenager hit by car in Sheffield",
        "description": "Two men have been charged with murder after the death of a teenager in Sheffield.",
        "url": "https://news.sky.com/story/two-men-charged-with-murder-after-teenager-hit-by-car-in-sheffield-13380840",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-abdullah-yaser-abdullah-al-yazidi_6936048.jpg?20250606180457",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-08 15:49:00",
        "Headline": "Zulkernain Ahmed, 20, and Amaan Ahmed, 26, both of Locke Drive, Sheffield, have been charged with murder. Abdullah Yaser Abdullah al Yazidi, 16, died after being hit by a car on Wednesday.",
        "Content": "Two men have been charged with murder after the death of a teenager in Sheffield. Abdullah Yaser Abdullah al Yazidi, 16, died after being hit by a car. He had only recently come to the UK from Yemen, looking \"for a better future\", his loved ones previously said.   Zulkernain Ahmed, 20, and Amaan Ahmed, 26, both of Locke Drive, Sheffield, have been charged with murder and three counts of attempted murder. They are due to appear before Sheffield Magistrates' Court on Monday. 'Innocently walking down the street' South Yorkshire Police said Abdullah was \"innocently walking\" down a street in the Darnall area of the city, just after 4.50pm on 4 June, when a car collided with him. The force said they understood a grey Audi had driven towards three electric bikes, hitting one. As the car continued following the collision with the electric bike, it then hit Abdullah, police said. According to the force, the driver failed to stop at the scene. Abdullah was taken to hospital where he later died. The rider of the electric bike, 18, suffered serious but non-life-threatening injuries and remains in hospital. Two people, a man, 46, and a woman, 45, who were previously arrested on suspicion of assisting an offender, remain on bail. A 'kind boy' Abdullah's relative, Saleh Alsirkal, runs a corner shop that the teenager popped into just before he was hit by the car on Wednesday. \"His dad brought him over to change his life, to get a better future for his son, but this has happened and destroyed everything,\" said Mr Alsirkal. Read more from Sky News:British soldier arrested on suspicion of rape in KenyaWater cremation could be offered instead of traditional funeralsBody found in search for missing woman He said Abdullah was a \"kind boy\" who just wanted to look after his family, including his three sisters and was really enjoying learning English. \"Every time he had a new word to learn, he was so excited about it,\" he said. \"It meant a lot to him and he learned quick. Sometimes he would stay in the shop just so he could talk to people. He tried to be friends with everyone.\" \"He wanted to be the main guy for the family. He was 16 years old, but he was a clever man,\" said Mr Alsirkal."
    },
    {
        "title": "Man chased on tarmac at Heathrow Airport near moving aircraft",
        "description": "A man has been filmed being chased on the tarmac at Heathrow Airport before being apprehended.",
        "url": "https://news.sky.com/story/man-chased-on-tarmac-at-heathrow-airport-near-moving-aircraft-13380928",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bigjettv-heathrow_6937057.jpg?20250608212726",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-08 20:06:00",
        "Headline": "The chase appeared to last around a minute-and-a-half before a van arrived with two people in fluorescent tops, and the man stopped running. He was then pulled to the ground.",
        "Content": " A man has been filmed being chased on the tarmac at Heathrow Airport before being apprehended. The individual, who was wearing something wide around his waist, was seen running away from at least four men within metres of moving and stationary aircraft. The pursuit appeared to last around a minute-and-a-half before a van arrived with two people in fluorescent tops, and the man stopped running.   He was then pulled to the ground. Several seconds later, a police van arrived. \n                  Heathrow chief's phone was on silent as power cut fire unfolded, inquiry reveals\n                 \n                  Cause of fire that sparked major Heathrow power outage remains unknown\n                 \n                  Heathrow bosses were warned about power supply after stolen cables turned off runway lights, MPs told\n                 The man was then put into the back of the vehicle. The video was filmed on the YouTube channel Big Jet TV. The person who took the footage also gave an ongoing commentary on the incident at the west London airport, saying: \"What's going on here? Why would there be people running across the [tarmac]? \"What's this all about? That is not right. \"That geezer's running from someone. They are chasing him. \"What are you doing mate? Get on the floor son, give yourself up.\" The person filming added: \"Mate, what is going on? \"Here we go, [there's] someone in a van. \"They've got him.\" Read more from Sky News:Emma Raducanu says she's not 'playing for money'Is Rachel Reeves the next Steve Jobs? A Heathrow spokesperson said: \"Working with partners, we have quickly resolved an incident at the airport involving an individual who accessed the airfield taxiway. \"The individual has been removed from the airport. The airport continues to operate as normal and passengers are travelling as planned.\""
    },
    {
        "title": "Emma Raducanu says she's not 'playing for money' - as women tennis stars return to Queen's",
        "description": "Tennis star Emma Raducanu has told Sky News she doesn't feel like she's \"playing for money\" and it's not her \"main motivation\".",
        "url": "https://news.sky.com/story/emma-raducanu-says-shes-not-playing-for-money-as-women-tennis-stars-return-to-queens-13380764",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-emma-raducanu-queens-club_6936879.jpg?20250608152213",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-08 14:13:00",
        "Headline": "Those in the line-up include 2025 Australian Open winner Madison Keys, former Wimbledon champions Barbora Krejcikova and Elena Rybakina, and British number one Katie Boulter, as well as former US Open winner Raducanu.",
        "Content": " Tennis star Emma Raducanu has told Sky News she doesn't feel like she's \"playing for money\" and it's not her \"main motivation\". The British number two, who is reportedly worth around £10m, was speaking as she replied to a question from sports presenter Jacquie Beltrao during a news conference ahead of a WTA 500 event starting this week in west London. Women players are returning to compete at the Queen's Club for the first time in more than 50 years, ahead of Wimbledon next month.    Those in the line-up for the inaugural HSBC Championships at Queen's include 2025 Australian Open winner Madison Keys, former Wimbledon champions Barbora Krejcikova and Elena Rybakina, and British number one Katie Boulter, as well as 2021 US Open champion Raducanu. It means a tour level women's tournament is coming to London for the first time since 1973, when Olga Morozova was crowned the last female champion at Queen's. \n                  Emma Raducanu to team up with Nick Cavaday and Mark Petchey for grasscourt season as back problem interrupts prep\n                 \n                  Emma Raducanu pulls out of GB squad to 'look after body'\n                 \n                  Miami Open: Emma Raducanu blitzes past Amanda Anisimova in straight sets to move into last eight\n                 While prize money is equal at the grand slams and some joint tour events, generally remuneration on the WTA Tour is substantially lower than on the men's ATP Tour. Raducanu, 22, told Sky's Jacquie Beltrao: \"There is obviously a big difference [in prize money] and I'm sure a lot players will kind of say their piece on it, but I just prefer not to get involved and just whatever the situation is I'll kind of roll with it, but I'm never really going to take a stand either way.\" She added: \"I don't really get involved or kind of stay in the loop with all the boards and all the decisions and stuff. I kind of just get on with it and I don't feel like I really am playing for money. \"Of course I need to sustain my team which is extremely expensive and you know... with my kind of profile, coaches and team members kind of see that. So it is a very expensive sport, but it's not my main motivator of why I play.\" Raducanu, who is managing an ongoing back issue, also said her expectations for how she does in the Queen's tournament were \"pretty low\". \"I played points for the first time today. I've had maybe like two, three days on the grass court, so it's not been much, but I just have to take it as it goes,\" she said. Why did the tournament move from Queen's in 1974? In 1974, Britain's governing body, the Lawn Tennis Association (LTA), decided to move the women's event from Queen's to Eastbourne as the London venue could not support men's and women's events at once - but in 2025 that has changed. The LTA has cited a desire to raise the profile of women's tennis and promote it to more people for the move to the capital. The organisation is committed to paying equal prize money to female players at Queen's and the Lexus Eastbourne Open by 2029. How much is the prize money for the women's event? The LTA announced last Thursday it would pay total prize money of $1.415m (approximately £1m) at Queen's, the highest for a WTA 500 event of its draw size this year. But that is still less than half of the prize pot that will be paid out to the male players the following week for the equivalent 500 tournament on the ATP Tour, where the line-up includes world number two Carlos Alcaraz of Spain. The LTA has stated an aim to achieve parity on prize money before 2029 but its rationale comes against a £4m loss made across the grass-court events it staged last year - Wimbledon is run by the All England Club - with the men's event at Queen's the only profitable tournament. Read more from Sky News:Prince William warns oceans are 'diminishing before our eyes'Trump deploys National Guard to LA immigration 'riots' 'Significant increases to prize money' Scott Lloyd, the governing body's chief executive, said: \"We are making significant increases this year to the women's prize money at Queen's and Eastbourne and want to achieve equal prize money as soon as possible. \"The LTA is committed to growing women's tennis, both at professional and grass-roots level, and this move is an important part of that commitment. \"This year fans will be able to enjoy both men's and women's tennis on the biggest stages that we can offer and we want to develop the tournaments so that the women's events deliver a path to profitability and greater visibility for the sport.\" The Queen's Club is named after Queen Victoria, its first patron, and is regarded as one of the premier Lawn Tennis and Racquets clubs in the world."
    },
    {
        "title": "The winners and losers in Rachel Reeves's spending review",
        "description": "\"It's a big deal for this government,\" says Simon Case. ",
        "url": "https://news.sky.com/story/real-risk-rachel-reevess-spending-review-will-be-about-the-departments-that-have-lost-out-13380746",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rachel-reeves-politics_6892532.jpg?20250608154208",
        "type": "Home",
        "Author": "Amanda Akass",
        "Date Published": "2025-06-08 13:44:00",
        "Headline": "The Treasury clearly wants to focus on promoting its generosity but in any process of prioritisation there are losers as well as winners.",
        "Content": "\n          Political correspondent\n              @amandaakass\n \"It's a big deal for this government,\" says Simon Case.  \"It's the clearest indication yet of what they plan to do between now and the general election, a translation of their manifesto. \"This is where you should expect the chancellor to say, on behalf of the government: 'This is what we're about'.\" As the former cabinet secretary, Mr Case was the man in charge of the civil service during the last spending review, in 2021.  On Wednesday, Rachel Reeves will unveil the Labour government's priorities for the next three years. But it's unclear whether it will provide all that much of an answer about what it's really about. Unlike the Autumn budget, when the chancellor announced her plans on where to tax and borrow to fund overall levels of spending, the spending review will set out exactly how that money is divided up between the different government departments. Since the start of the process in December those departments have been bidding for their share of the cash - setting out their proposed budgets in a negotiation which looks set to continue right up to the wire. This review is being conducted in an usual level of detail, with every single line of spending assessed, according to the chancellor, on whether it represents value for money and meets the government's priorities. Budget proposals have been scrutinised by so called \"challenge panels\" of independent experts. It's clear that health and defence will be winners in this process given pre-existing commitments to prioritise the NHS - with a boost of up to £30bn expected - and to increase defence spending. On Sunday morning, the government press release trumpeted an impressive-sounding \"£86bn boost\" to research and development (R&D), with the Science and Technology Secretary Peter Kyle sent out on the morning media round to celebrate as record levels of investment.  We're told this increased spending on the life sciences, advanced manufacturing and defence will lead to jobs and growth across the country, with every £1 in investment set to lead to a £7 economic return. But the headline figure is misleading. It's not £86bn in new funding. That £86bn has been calculated by adding together all R&D investment across government for the next three years, which will reach an annual figure of £22.5bn by 2029-30. The figure for this year was already set to be £20.4bn; so while it's a definite uplift, much of that money was already allocated. Read More:Reeves turning around UK finances 'like Steve Jobs did for Apple'Government struggles to slash foreign aid spent on asylum hotels Peter Kyle also highlighted plans for \"the most we've ever spent per pupil in our school system\". I understand the schools budget is to be boosted by £4.5bn. Again, this is clearly an uplift - but over a three-year period, that equates to just £1.5bn a year (compared with an existing budget of £63.7bn). It also has to cover the cost of extending free school meals, and the promised uplift in teachers' pay. In any process of prioritisation there are losers as well as winners. We already know about planned cuts to the Department of Work and Pensions - but other unprotected departments like the Home Office and the Department of Communities and Local Government are braced for a real spending squeeze. We've heard dire warnings about austerity 2.0, and the impact that would have on the government's crime and policing priorities, its promises around housing and immigration, and on the budgets for cash-strapped local councils. The chancellor wants to make it clear to the markets she's sticking to her fiscal rules on balancing the books for day-to-day spending. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 But the decision to loosen the rules around borrowing to fund capital investment have given her greater room to manoeuvre in funding long-term infrastructure projects. That's why we've seen her travelling around the country this week to promote the £15.6bn she's spending on regional transport projects. The Treasury team clearly wants to focus on promoting the generosity of these kind of investments, and we'll hear more in the coming days. But there's a real risk the story of this spending review will be about the departments which have lost out - and the promises which could slip as a result."
    },
    {
        "title": "Snoop Dogg says he hopes to open burger van at Celtic Park",
        "description": "Snoop Dogg says he hopes to set up a burger van at Celtic's stadium and wants to serve fans himself.",
        "url": "https://news.sky.com/story/snoop-dogg-says-he-hopes-to-open-burger-van-at-celtic-park-13380894",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-snoop-dogg-rapper_6937013.jpg?20250608200052",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-08 18:22:00",
        "Headline": "The rapper said a fast-food van at the stadium would become a foodie \"Paradise\" which is a nickname for the ground in Glasgow.",
        "Content": "Snoop Dogg says he hopes to set up a burger van at Celtic's stadium and wants to serve fans himself. The US rapper, 53, has described the football club's supporters as \"special\" and the best fans in European football. And Snoop, who played Glasgow's OVO Hydro arena in 2023, has also said he strongly identifies with the club's mascot Hoopy the Hound. He said a fast-food van at Celtic Park would become a foodie \"Paradise\" which is a nickname for the ground in the Parkhead area of the city. Snoop told the Sunday Mail: \"I would love to bring a pop-up burger [van] to a sports stadium to show fans that food at stadiums can be good. \"It's got to be Celtic Park, man. The secret to a good burger is the love in the preparation. The ground beef has got to be mixed with some secret spices, then add a good quality cheese and some maple-cured bacon. \"The Celtic fans are gonna love it, and to make sure they are just right, Snoop is going to be serving them himself.\" \n                  Body found in search for Briton who went missing during stag do in Portugal\n                 \n                  Yvonne Keenan: Glasgow foster carer jailed for abusing four children\n                 \n                  Union warns summer holiday strike action looms at Edinburgh and Glasgow airports\n                 But he said he would not be taking his culinary ventures to Rangers - Celtic's Old Firm rivals at Ibrox. The Drop It Like It's Hot star told the paper: \"Am I going to bring my burgers to Rangers as well? Nah, I think we will give that a miss.\" Read more from Sky News:Raducanu says she not 'playing for money'Is Rachel Reeves the next Steve Jobs? The musician has previously spoken of investing in Celtic, similar to Hollywood actor Ryan Reynolds's involvement with Wrexham FC. Snoop has already published a cookbook and claims to have spoken to chef Gordon Ramsay about a possible venture in Glasgow together. The keen sports fan worked as a correspondent for NBC at the Paris Olympics last year, and has launched two youth football leagues, as well as being a vocal advocate for pay equality for female athletes."
    },
    {
        "title": "Rachel Reeves turning around UK's finances 'like Steve Jobs did for Apple', claims minister",
        "description": "Rachel Reeves will turn around the economy the way Steve Jobs turned around Apple, a cabinet minister has suggested ahead of the upcoming spending review.",
        "url": "https://news.sky.com/story/rachel-reeves-turning-around-uks-finances-like-steve-jobs-did-for-apple-claims-minister-13380643",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-steve-jobs-apple_6936779.jpg?20250608110812",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-08 07:26:00",
        "Headline": "Science and Technology Secretary Peter Kyle compares the chancellor to the late Apple founder, who brought the company back from the brink of insolvency.",
        "Content": " Rachel Reeves will turn around the economy the way Steve Jobs turned around Apple, a cabinet minister has suggested ahead of the upcoming spending review. Science and Technology Secretary Peter Kyle compared the chancellor to the late Apple co-founder when asked on Sky News' Sunday Morning with Trevor Phillips where the £86bn for his department is coming from. Politics Live: Winter fuel payment cut to be dealt with 'in run up to autumn' The package, confirmed ahead of the full spending review next week, will see each region in England granted £500m to spend on science projects of their choice, including research into faster drug treatments. Asked by Trevor Phillips how the government is finding the money, Mr Kyle said: \"Rachel raised money in taxes in the autumn, we are now allocating it per department. \"But the key thing is we are going to be investing record amounts of money into the innovations of the future. \"Just bear in mind that how Apple turned itself around when Steve Jobs came back to Apple, they were 90 days from insolvency. That's the kind of situation that we had when we came into office. \"Steve Jobs turned it around by inventing the iMac, moving to a series of products like the iPod. \"Now we are starting to invest in the vaccine processes of the future, some of the high-tech solutions that are going to be high growth. We're investing in our space sector... they will create jobs in the future.\" 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 The spending review is a process used by governments to set departmental budgets for the years ahead. Asked if it will include more detail on who will receive winter fuel payments, Mr Kyle said that issue will be \"dealt with in the run-up to the autumn\". \"This is a spending review that's going to set the overall spending constraints for government for the next period, the next three years, so you're sort of talking about two separate issues at the moment,\" he said.  Scrapping universal winter fuel payments was one of the first things Labour did in government - despite it not being in their manifesto - with minsters saying it was necessary because of the financial \"blackhole\" left behind by the Tories. But following a long-drawn out backlash, Sir Keir Starmer said last month that the government would extend eligibility, which is now limited to those on pension credit. Read more: Spending review 2025 look ahead It is not clear what the new criteria will be, though Ms Reeves has said the changes will come into place before this winter. Mr Kyle also claimed the spending review will see the government invest \"the most we've ever spent per pupil in our school system\". However, he said the chancellor will stick to her self-imposed fiscal rules - which rule out borrowing for day-to-day spending - meaning that while some departments will get extra money, others are likely to face cuts."
    },
    {
        "title": "British soldier arrested on suspicion of raping woman in Kenya",
        "description": "A British soldier based at an army barracks in Kenya has been arrested on suspicion of rape.",
        "url": "https://news.sky.com/story/british-soldier-arrested-on-suspicion-of-raping-woman-in-kenya-13380683",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nanyuki-sign-kenya_6936819.jpg?20250608131527",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-08 10:07:00",
        "Headline": "The alleged incident happened last month after a group of soldiers visited a bar in Nanyuki -  the town where the body of 21-year-old Agnes Wanjiru was found in a hotel septic tank in 2012.",
        "Content": "A British soldier based at an army barracks in Kenya has been arrested on suspicion of rape. The alleged attack happened last month after a group of soldiers visited a bar in the town of Nanyuki, close to the Batuk (British Army Training Unit Kenya) camp. An investigation is being carried out by the Defence Serious Crime Command, which probes serious crimes alleged to have been carried out by British servicemen and women in the UK and overseas. Military police have questioned the bar owner along with security guards who were on duty on the night of the incident, according to The Sunday Times, which first reported the allegations. According to the paper, the owner of the bar said: \"They [the soldiers] like this place and when I meet some of them in the supermarkets, they tell me they have been banned from coming here. \"Sometimes they get too drunk and I drop them at the gate for free.\" A Ministry of Defence spokesperson said: \"We can confirm the arrest of a service person in Kenya. \"As the matter is the subject of an ongoing investigation by the Defence Serious Crime Command, we will not comment further.\" They added: \"All soldiers who visit or train at Batuk have clear direction about how to behave, on and off duty, must complete mandatory training and attend compulsory briefings on conduct. We will have zero tolerance for unacceptable behaviour. \"To ensure the highest possible standards, the Army has launched a comprehensive Service Inquiry into allegations of unacceptable behaviour by UK Service Personnel in Kenya which would violate MoD and Army policy.\" Read more from Sky News:Trump deploys National Guard to LA 'riots'Is Rachel Reeves the next Steve Jobs? The army last year launched an inquiry into the behaviour of British troops posted to the base after allegations against soldiers, including involvement in the murder of a woman in 2012. The body of 21-year-old Agnes Wanjiru, a mother of one, was found in a septic tank at the Lions Court Hotel in Nanyuki two months after she disappeared in March 2012. According to an investigation by The Sunday Times, a British soldier accused of the murder has been named by his comrades after he allegedly confessed to the killing. An inquest found sex worker Ms Wanjiru was unlawfully killed and a post-mortem examination concluded she had died as a result of stab sounds to her chest and abdomen. Defence Secretary John Healey met with her family in April during a visit to Kenya. The British Army has an agreement with Kenya to deploy up to six battalions a year for training."
    },
    {
        "title": "'Ordering a woman to be sexually exploited is as easy as ordering a takeaway': How trafficking victims are being sold online",
        "description": "*Sarah thought she was going to a job interview to become a waitress.",
        "url": "https://news.sky.com/story/ordering-a-woman-to-be-sexually-exploited-is-as-easy-as-ordering-a-takeaway-how-trafficking-victims-are-being-sold-online-13380622",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-pimping-sex-trafficked-victim_6937101.jpg?20250609030603",
        "type": "UK",
        "Author": "Matthew Thompson, news correspondent, and Joely Santa Cruz, data journalist",
        "Date Published": "2025-06-08 23:01:00",
        "Headline": "A Sky News investigation uncovers thousands of potential indicators of sexual exploitation on two of the UK's most prominent adult service websites.",
        "Content": "By Matthew Thompson, news correspondent, and Joely Santa Cruz, data journalist   *Sarah thought she was going to a job interview to become a waitress. Warning: This story includes graphic descriptions of sexual exploitation and abuse, including rape Instead, she was lured to a strange man's flat and held against her will for six months. \"One of the very first things he did was ask for me to hand over my passport to check that I had the right to work,\" she says. \"I remember him asking me kind of odd questions, like, 'do you like sex?' \"I remember him taking me into another room within this flat and closing the door behind him, then locking the door. And then I was raped.\" She says her passport was used to create an online profile to advertise her for sex. She had no control over the adverts, no access to the accounts, and was repeatedly abused by her trafficker and the men who booked her through the website. \n                  Retired vicar admits role in 'Eunuch Maker' extreme body modification ring\n                 \n                  Hainault trial opens - as it happened: Marcus Arduini Monzo appears in court accused of killing 14-year-old Daniel Anjorin in sword attack\n                 \n                  Man convicted after burning Koran outside Turkish consulate in London\n                 \"My abuser would say: 'This man would like to see you, he's booked you, but he's requested sloppy seconds. Okay? I am going to rape you again so that when you go and see this man, you will take that to that man',\" she tells Sky News. Sarah says she was forced to take on different names to match her trafficker's rotating online personas. She ultimately escaped after threatening to scream unless her abuser let her go. \"He just glared at me, furious,\" she recalls. \"But he opened the door. That was the moment I had. That was the moment I took. I ran out and never saw him again.\" Sarah's abuser is now in prison. But the website that he used to facilitate her abuse is still operating. A Sky News investigation has uncovered thousands of potential indicators of sexual exploitation on two of the UK's most prominent adult service websites, raising serious concerns about how traffickers may be using these platforms to advertise and abuse victims like Sarah. Analysis of more than 50,000 adverts on AdultWork and Vivastreet - two of the country's largest escorting platforms - revealed a high concentration of red flags linked to organised exploitation, including repeated use of the same contact numbers, and/or duplicated advert text, across adverts for different women in different geographical locations. These patterns, highlighted by the Sex Trafficking Indication Matrix (STIM), a research tool used to identify signs of trafficking, suggest some profiles may be linked to coercive networks. In one case, the same phone number appeared in eight separate adverts for at least five different women, all listed with identical ages, nearly identical descriptions, but different photographs and spread across multiple UK regions. Neither platform is accused of criminal activity, but experts and campaigners say the scale and nature of these indicators are red flags for potential abuse. Prostitution is legal in England and Wales. But the controlling of prostitution for gain, sometimes called pimping, and the more severe crime of trafficking, are not. \"These platforms make it as easy to order a woman to be sexually exploited as it is to order a takeaway,\" said Kat Banyard, director of campaign group UK Feminista. \"There are big questions for national policing to answer about why it is that this important investigation has had to be done by Sky News, and why it wasn't national policing that was launching an investigation to uncover the scale of potential criminality on these sites.\" Over several months, Sky News used STIM indicators to assess escorting adverts across two platforms. On Vivastreet alone, more than 7,000 were linked to phone numbers that appeared multiple times - more than half the total number of listings at the time. On AdultWork, over 1,000 ads were found to contain duplicated descriptions. In one example on AdultWork, the same wording was used in 357 different listings - a sign that content may have been copied and pasted to cover for multiple individuals under a single operator. The websites told us duplication can reflect legitimate activity, such as touring sex workers using aliases. However, opponents say their structure allows abusers to hide in plain sight. Sky News can also reveal that officials at the Home Office met representatives from escorting websites 25 times between 2017 and 2024, under the previous Conservative government. Critics argue these discussions have failed to lead to meaningful safeguards or regulation. A Home Affairs Committee report in 2023 was highly critical of this kind of engagement. And in parliament, pressure is building to take stronger action. Labour MP Tonia Antoniazzi has tabled an amendment to the Policing and Crime Bill that would seek to ban such websites altogether. \"This is a thriving, multibillion-pound industry, and we're acting like there's nothing to see here,\" she says. \"It's horrific, and I think more people need to be speaking out about it - this gives parliamentarians the opportunity to discuss and debate it on the floor of the house.\" Read more from Sky NewsLife inside a dangerous tower blockMore strangulation cases recorded by police In a statement, a Vivastreet spokesperson said: \"Experts are clear that indicators that may suggest exploitation can have innocent explanations. \"For example, it is a fact that many sex workers use different names and personas, and 'touring' - moving for short periods of time to different areas to take bookings - is a well-known practice. \"We take safety extremely seriously and deploy industry-leading security measures to detect, report, and remove potentially exploitative content, including new requirements that all adult category advertisers must undergo age and ID verification.\" AdultWork said: \"Sexual exploitation is not tolerated in any form. \"We have strict internal policies in place to reinforce this and we are continually updating our internal systems for detecting accounts and requesting additional documents for evidence of legitimacy. \"We make it a priority to fully cooperate and comply with all law enforcement requests. Additionally, any indications or reports of trafficking are fully reviewed and if we find them to be suspicious, we proactively contact law enforcement.\" Whether escorting platforms can be better regulated - or whether they should be outlawed entirely - remains a point of national debate. But with mounting evidence of potential exploitation and growing political scrutiny, campaigners say inaction is no longer an option. \"These platforms are so poorly moderated and poorly regulated,\" Sarah says. \"No one can sit behind a screen and know if someone's being coerced or is at the mercy of a predator.\" *Sarah's name has been changed to protect her identity"
    },
    {
        "title": "'It's simply not safe': A thousand doctors write to MPs urging them to vote against assisted dying bill",
        "description": "More than 1,000 doctors have written to MPs urging them to vote against the assisted dying bill, calling it a \"real threat to both patients and the medical workforce\".",
        "url": "https://news.sky.com/story/its-simply-not-safe-a-thousand-doctors-write-to-mps-urging-them-to-vote-against-assisted-dying-bill-13380847",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-assisted-dying_6936985.jpg?20250608181644",
        "type": "UK",
        "Author": "Megan Harwood-Baynes, Ashish Joshi and Mark Thompson, Sky News health team",
        "Date Published": "2025-06-08 23:01:00",
        "Headline": "Supporters of the bill say it would allow terminally ill patients from England and Wales to end their lives \"on their own terms\", providing they have a life expectancy of six months or less.",
        "Content": "By Megan Harwood-Baynes, Ashish Joshi and Mark Thompson, Sky News health team  More than 1,000 doctors have written to MPs urging them to vote against the assisted dying bill, calling it a \"real threat to both patients and the medical workforce\". The bill - which is due to be voted on by MPs for a final time on 20 June - would allow terminally ill patients from England and Wales to end their lives \"on their own terms\", providing they have a life expectancy of six months or less. A separate bill is currently passing through the Scottish parliament. But doctors from across the NHS have written to MPs, warning them of their \"serious concerns\". Notable signatories include Sir John Burn, a geneticist who has led decades of cancer research, Sir Shakeel Qureshi, who was knighted for his work in paediatric cardiology, Professor Aileen Keel, the former deputy chief medical officer for Scotland, and Baroness Finlay, a Welsh doctor, professor of palliative medicine and member of the House of Lords. The letter is signed by four doctors who hold OBEs, two who have MBEs, and one CBE. The letter says that while a debate is needed on end of life care, \"this bill is not the answer\". \n                  Dr Florian Willet: Euthanasia advocate dies after being arrested over woman's 'suicide capsule' death\n                 \n                  'Deeply dangerous' assisted dying bill should be scrapped, says leading care consultant\n                 \n                  MPs criticise terminally ill Esther Rantzen's assisted dying intervention\n                 It raises concerns that not enough evidence has been heard from doctors, people with disabilities and other marginalised groups. \"This bill will widen inequalities, it provides inadequate safeguards and, in our collective view, is simply not safe,\" it goes on to say, calling it a \"deeply flawed bill\".  Read more:Why is assisted dying so controversial - and where is it already legal?Five stories that bring the assisted dying debate homeTwo terminally ill patients give opposing views on assisted dying Professor Colin Rees, a member of the Royal College of Physicians working group on assisted dying, said it was the \"single most important piece of healthcare legislation in 50 or 60 years\". \"It will have very profound consequences for the future and many doctors are really concerned that members of parliament are not hearing the views of the medical profession.\" He said many doctors who remain neutral, or who even support the principle of assisted dying, remain concerned about the bill. \"We don't think it's a bill that is safe, that protects patients, protects families, and protects the medical workforce.\" The Terminally Ill Adults (End of Life) Bill passed the House of Commons with a majority of 55 in November. Scotland's Assisted Dying for Terminally Ill Adults (Scotland Bill) pass with a 14 majority in May. But the legislation has not been without controversy, with 150 amendments made to get it through the first stage.  The bill will return to the House of Commons for a third reading this Friday. If voted through by MPs it will then proceed to the House of Lords. 'No safeguards against coercion' One of the areas of concern raised by the medics was the inability to properly identify patients at risk of coercive control. \"Vulnerable patients are at risk of coercion with women, victims of domestic abuse, and the elderly at particular risk,\" the letter says. It also warned it would widen social inequalities, with patients who do not have the resources for a comfortable death more likely to opt for assisted dying. \"People who struggle to pay for heating or care or wish to preserve their assets for their children are at high risk of choosing to die if the option is available and the alternative is more difficult.\" Data from the Annual Report of Dying With Dignity from Oregon in 2024 found 9.3% of those people who choose assisted deaths do so for financial reasons. 'Doctors get it wrong 40% of the time' Concerns have also been raised around the inaccuracies of medical prognosis. \"Research demonstrates that doctors get prognosis wrong around 40% of the time,\" the letter says. \"As such, patients may end up choosing an assisted death and losing what could have been happy and fulfilling months or years of life.\"  The bill is also a risk to families, the letter says, as it does not require doctors to speak with family members. \"A close relative may know nothing until they get a call to arrange collection of their relative's body,\" it says, adding that there is no mechanism for a family member to raise concerns about a request. The letter also addressed the potential impact on the medical workforce. Evidence from the Netherlands suggests \"doctors feel pressurised when dealing with patient requests for assisted deaths, meaning that doctors may end up having involvement despite it being against their principles, because they want to help their patients\"."
    },
    {
        "title": "Two men charged with murder after teenager hit by car in Sheffield",
        "description": "Two men have been charged with murder after the death of a teenager in Sheffield.",
        "url": "https://news.sky.com/story/two-men-charged-with-murder-after-teenager-hit-by-car-in-sheffield-13380840",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-abdullah-yaser-abdullah-al-yazidi_6936048.jpg?20250606180457",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-08 15:49:00",
        "Headline": "Zulkernain Ahmed, 20, and Amaan Ahmed, 26, both of Locke Drive, Sheffield, have been charged with murder. Abdullah Yaser Abdullah al Yazidi, 16, died after being hit by a car on Wednesday.",
        "Content": "Two men have been charged with murder after the death of a teenager in Sheffield. Abdullah Yaser Abdullah al Yazidi, 16, died after being hit by a car. He had only recently come to the UK from Yemen, looking \"for a better future\", his loved ones previously said.   Zulkernain Ahmed, 20, and Amaan Ahmed, 26, both of Locke Drive, Sheffield, have been charged with murder and three counts of attempted murder. They are due to appear before Sheffield Magistrates' Court on Monday. 'Innocently walking down the street' South Yorkshire Police said Abdullah was \"innocently walking\" down a street in the Darnall area of the city, just after 4.50pm on 4 June, when a car collided with him. The force said they understood a grey Audi had driven towards three electric bikes, hitting one. As the car continued following the collision with the electric bike, it then hit Abdullah, police said. According to the force, the driver failed to stop at the scene. Abdullah was taken to hospital where he later died. The rider of the electric bike, 18, suffered serious but non-life-threatening injuries and remains in hospital. Two people, a man, 46, and a woman, 45, who were previously arrested on suspicion of assisting an offender, remain on bail. A 'kind boy' Abdullah's relative, Saleh Alsirkal, runs a corner shop that the teenager popped into just before he was hit by the car on Wednesday. \"His dad brought him over to change his life, to get a better future for his son, but this has happened and destroyed everything,\" said Mr Alsirkal. Read more from Sky News:British soldier arrested on suspicion of rape in KenyaWater cremation could be offered instead of traditional funeralsBody found in search for missing woman He said Abdullah was a \"kind boy\" who just wanted to look after his family, including his three sisters and was really enjoying learning English. \"Every time he had a new word to learn, he was so excited about it,\" he said. \"It meant a lot to him and he learned quick. Sometimes he would stay in the shop just so he could talk to people. He tried to be friends with everyone.\" \"He wanted to be the main guy for the family. He was 16 years old, but he was a clever man,\" said Mr Alsirkal."
    },
    {
        "title": "Man chased on tarmac at Heathrow Airport near moving aircraft",
        "description": "A man has been filmed being chased on the tarmac at Heathrow Airport before being apprehended.",
        "url": "https://news.sky.com/story/man-chased-on-tarmac-at-heathrow-airport-near-moving-aircraft-13380928",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bigjettv-heathrow_6937057.jpg?20250608212726",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-08 20:06:00",
        "Headline": "The chase appeared to last around a minute-and-a-half before a van arrived with two people in fluorescent tops, and the man stopped running. He was then pulled to the ground.",
        "Content": " A man has been filmed being chased on the tarmac at Heathrow Airport before being apprehended. The individual, who was wearing something wide around his waist, was seen running away from at least four men within metres of moving and stationary aircraft. The pursuit appeared to last around a minute-and-a-half before a van arrived with two people in fluorescent tops, and the man stopped running.   He was then pulled to the ground. Several seconds later, a police van arrived. \n                  Heathrow chief's phone was on silent as power cut fire unfolded, inquiry reveals\n                 \n                  Cause of fire that sparked major Heathrow power outage remains unknown\n                 \n                  Heathrow bosses were warned about power supply after stolen cables turned off runway lights, MPs told\n                 The man was then put into the back of the vehicle. The video was filmed on the YouTube channel Big Jet TV. The person who took the footage also gave an ongoing commentary on the incident at the west London airport, saying: \"What's going on here? Why would there be people running across the [tarmac]? \"What's this all about? That is not right. \"That geezer's running from someone. They are chasing him. \"What are you doing mate? Get on the floor son, give yourself up.\" The person filming added: \"Mate, what is going on? \"Here we go, [there's] someone in a van. \"They've got him.\" Read more from Sky News:Emma Raducanu says she's not 'playing for money'Is Rachel Reeves the next Steve Jobs? A Heathrow spokesperson said: \"Working with partners, we have quickly resolved an incident at the airport involving an individual who accessed the airfield taxiway. \"The individual has been removed from the airport. The airport continues to operate as normal and passengers are travelling as planned.\""
    },
    {
        "title": "British soldier arrested on suspicion of raping woman in Kenya",
        "description": "A British soldier based at an army barracks in Kenya has been arrested on suspicion of rape.",
        "url": "https://news.sky.com/story/british-soldier-arrested-on-suspicion-of-raping-woman-in-kenya-13380683",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nanyuki-sign-kenya_6936819.jpg?20250608131527",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-08 10:07:00",
        "Headline": "The alleged incident happened last month after a group of soldiers visited a bar in Nanyuki -  the town where the body of 21-year-old Agnes Wanjiru was found in a hotel septic tank in 2012.",
        "Content": "A British soldier based at an army barracks in Kenya has been arrested on suspicion of rape. The alleged attack happened last month after a group of soldiers visited a bar in the town of Nanyuki, close to the Batuk (British Army Training Unit Kenya) camp. An investigation is being carried out by the Defence Serious Crime Command, which probes serious crimes alleged to have been carried out by British servicemen and women in the UK and overseas. Military police have questioned the bar owner along with security guards who were on duty on the night of the incident, according to The Sunday Times, which first reported the allegations. According to the paper, the owner of the bar said: \"They [the soldiers] like this place and when I meet some of them in the supermarkets, they tell me they have been banned from coming here. \"Sometimes they get too drunk and I drop them at the gate for free.\" A Ministry of Defence spokesperson said: \"We can confirm the arrest of a service person in Kenya. \"As the matter is the subject of an ongoing investigation by the Defence Serious Crime Command, we will not comment further.\" They added: \"All soldiers who visit or train at Batuk have clear direction about how to behave, on and off duty, must complete mandatory training and attend compulsory briefings on conduct. We will have zero tolerance for unacceptable behaviour. \"To ensure the highest possible standards, the Army has launched a comprehensive Service Inquiry into allegations of unacceptable behaviour by UK Service Personnel in Kenya which would violate MoD and Army policy.\" Read more from Sky News:Trump deploys National Guard to LA 'riots'Is Rachel Reeves the next Steve Jobs? The army last year launched an inquiry into the behaviour of British troops posted to the base after allegations against soldiers, including involvement in the murder of a woman in 2012. The body of 21-year-old Agnes Wanjiru, a mother of one, was found in a septic tank at the Lions Court Hotel in Nanyuki two months after she disappeared in March 2012. According to an investigation by The Sunday Times, a British soldier accused of the murder has been named by his comrades after he allegedly confessed to the killing. An inquest found sex worker Ms Wanjiru was unlawfully killed and a post-mortem examination concluded she had died as a result of stab sounds to her chest and abdomen. Defence Secretary John Healey met with her family in April during a visit to Kenya. The British Army has an agreement with Kenya to deploy up to six battalions a year for training."
    },
    {
        "title": "Snoop Dogg says he hopes to open burger van at Celtic Park",
        "description": "Snoop Dogg says he hopes to set up a burger van at Celtic's stadium and wants to serve fans himself.",
        "url": "https://news.sky.com/story/snoop-dogg-says-he-hopes-to-open-burger-van-at-celtic-park-13380894",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-snoop-dogg-rapper_6937013.jpg?20250608200052",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-08 18:22:00",
        "Headline": "The rapper said a fast-food van at the stadium would become a foodie \"Paradise\" which is a nickname for the ground in Glasgow.",
        "Content": "Snoop Dogg says he hopes to set up a burger van at Celtic's stadium and wants to serve fans himself. The US rapper, 53, has described the football club's supporters as \"special\" and the best fans in European football. And Snoop, who played Glasgow's OVO Hydro arena in 2023, has also said he strongly identifies with the club's mascot Hoopy the Hound. He said a fast-food van at Celtic Park would become a foodie \"Paradise\" which is a nickname for the ground in the Parkhead area of the city. Snoop told the Sunday Mail: \"I would love to bring a pop-up burger [van] to a sports stadium to show fans that food at stadiums can be good. \"It's got to be Celtic Park, man. The secret to a good burger is the love in the preparation. The ground beef has got to be mixed with some secret spices, then add a good quality cheese and some maple-cured bacon. \"The Celtic fans are gonna love it, and to make sure they are just right, Snoop is going to be serving them himself.\" \n                  Body found in search for Briton who went missing during stag do in Portugal\n                 \n                  Yvonne Keenan: Glasgow foster carer jailed for abusing four children\n                 \n                  Union warns summer holiday strike action looms at Edinburgh and Glasgow airports\n                 But he said he would not be taking his culinary ventures to Rangers - Celtic's Old Firm rivals at Ibrox. The Drop It Like It's Hot star told the paper: \"Am I going to bring my burgers to Rangers as well? Nah, I think we will give that a miss.\" Read more from Sky News:Raducanu says she not 'playing for money'Is Rachel Reeves the next Steve Jobs? The musician has previously spoken of investing in Celtic, similar to Hollywood actor Ryan Reynolds's involvement with Wrexham FC. Snoop has already published a cookbook and claims to have spoken to chef Gordon Ramsay about a possible venture in Glasgow together. The keen sports fan worked as a correspondent for NBC at the Paris Olympics last year, and has launched two youth football leagues, as well as being a vocal advocate for pay equality for female athletes."
    },
    {
        "title": "The winners and losers in Rachel Reeves's spending review",
        "description": "\"It's a big deal for this government,\" says Simon Case. ",
        "url": "https://news.sky.com/story/real-risk-rachel-reevess-spending-review-will-be-about-the-departments-that-have-lost-out-13380746",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rachel-reeves-politics_6892532.jpg?20250608154208",
        "type": "UK",
        "Author": "Amanda Akass",
        "Date Published": "2025-06-08 13:44:00",
        "Headline": "The Treasury clearly wants to focus on promoting its generosity but in any process of prioritisation there are losers as well as winners.",
        "Content": "\n          Political correspondent\n              @amandaakass\n \"It's a big deal for this government,\" says Simon Case.  \"It's the clearest indication yet of what they plan to do between now and the general election, a translation of their manifesto. \"This is where you should expect the chancellor to say, on behalf of the government: 'This is what we're about'.\" As the former cabinet secretary, Mr Case was the man in charge of the civil service during the last spending review, in 2021.  On Wednesday, Rachel Reeves will unveil the Labour government's priorities for the next three years. But it's unclear whether it will provide all that much of an answer about what it's really about. Unlike the Autumn budget, when the chancellor announced her plans on where to tax and borrow to fund overall levels of spending, the spending review will set out exactly how that money is divided up between the different government departments. Since the start of the process in December those departments have been bidding for their share of the cash - setting out their proposed budgets in a negotiation which looks set to continue right up to the wire. This review is being conducted in an usual level of detail, with every single line of spending assessed, according to the chancellor, on whether it represents value for money and meets the government's priorities. Budget proposals have been scrutinised by so called \"challenge panels\" of independent experts. It's clear that health and defence will be winners in this process given pre-existing commitments to prioritise the NHS - with a boost of up to £30bn expected - and to increase defence spending. On Sunday morning, the government press release trumpeted an impressive-sounding \"£86bn boost\" to research and development (R&D), with the Science and Technology Secretary Peter Kyle sent out on the morning media round to celebrate as record levels of investment.  We're told this increased spending on the life sciences, advanced manufacturing and defence will lead to jobs and growth across the country, with every £1 in investment set to lead to a £7 economic return. But the headline figure is misleading. It's not £86bn in new funding. That £86bn has been calculated by adding together all R&D investment across government for the next three years, which will reach an annual figure of £22.5bn by 2029-30. The figure for this year was already set to be £20.4bn; so while it's a definite uplift, much of that money was already allocated. Read More:Reeves turning around UK finances 'like Steve Jobs did for Apple'Government struggles to slash foreign aid spent on asylum hotels Peter Kyle also highlighted plans for \"the most we've ever spent per pupil in our school system\". I understand the schools budget is to be boosted by £4.5bn. Again, this is clearly an uplift - but over a three-year period, that equates to just £1.5bn a year (compared with an existing budget of £63.7bn). It also has to cover the cost of extending free school meals, and the promised uplift in teachers' pay. In any process of prioritisation there are losers as well as winners. We already know about planned cuts to the Department of Work and Pensions - but other unprotected departments like the Home Office and the Department of Communities and Local Government are braced for a real spending squeeze. We've heard dire warnings about austerity 2.0, and the impact that would have on the government's crime and policing priorities, its promises around housing and immigration, and on the budgets for cash-strapped local councils. The chancellor wants to make it clear to the markets she's sticking to her fiscal rules on balancing the books for day-to-day spending. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 But the decision to loosen the rules around borrowing to fund capital investment have given her greater room to manoeuvre in funding long-term infrastructure projects. That's why we've seen her travelling around the country this week to promote the £15.6bn she's spending on regional transport projects. The Treasury team clearly wants to focus on promoting the generosity of these kind of investments, and we'll hear more in the coming days. But there's a real risk the story of this spending review will be about the departments which have lost out - and the promises which could slip as a result."
    },
    {
        "title": "Water cremation and human composting could be offered instead of traditional funerals",
        "description": "Water cremation and human composting could soon be offered as an alternative to traditional funerals.",
        "url": "https://news.sky.com/story/water-cremation-and-human-composting-could-be-offered-instead-of-traditional-funerals-13380664",
        "image_url": "https://e3.365dm.com/23/07/1920x1080/skynews-water-cremation-resomation_6206309.jpg?20230703132852",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-08 09:03:00",
        "Headline": "A Law Commission consultation proposes legal approval of new methods.  ",
        "Content": "Water cremation and human composting could soon be offered as an alternative to traditional funerals. A Law Commission consultation is proposing legal approval of new methods beyond burial, cremation, and the rarely used burial at sea. The paper published earlier this week highlights two methods used in other countries - alkaline hydrolysis and human composting. Alkaline hydrolysis - also known as water cremation or resomation - involves placing a person's body into woollen shroud or other organic pouch, using water, alkaline chemicals, heat and pressure to break down the tissue. The resulting liquid is checked and treated if necessary to enter the wastewater system, while remaining pieces of bone and teeth are dried and can be ground to a powder and scattered like ashes. Water cremation, which mimics the process of natural decomposition when someone is buried, takes between four and 14 hours. The method, which has been suggested as a greener alternative to traditional cremation, was used for the bodies of five dead people in 2019, as part of a study facilitated by Middlesex and Sheffield universities. Anti-apartheid campaigner Archbishop Desmond Tutu, who died in 2021, chose resomation for his own funeral in South Africa. Read more: What is water cremation?  Co-op Funeralcare said it hoped to offer the service in the UK in 2023 but backed out because of the current regulations. The firm welcomed the Law Commission review, which will run until spring next year, ending in a final report and draft Bill. New funerary methods are not currently regulated, other than by more general legislation such as environmental and planning laws. Provisional proposals suggest a legal framework to enable new methods to be regulated in the future. A Co-op Funeralcare spokesperson said: \"At Co-op Funeralcare, we are committed to serving the needs of our member-owners and clients and offering the most sustainable and affordable services. \"In 2023, we announced our ambition to pilot resomation in the UK, and we subsequently worked closely with government to explore the regulatory requirements to introduce this service across the nation. \"However, we did not proceed with this as, at the time, we were unable to find a path through the current regulatory framework. \"We welcome the Law Commission's review and encourage exploration into alternative methods that provide consumers with greater choice and deliver environmental benefits.\" The consultation paper also highlights human composting, where a body is placed into a sealed chamber, or vessel, with carbon-rich organic matter, such as straw and wood chips, to enable quicker decomposition. The process takes around two to three months and resulting soil can be returned to bereaved loved ones. Other methods involving the freezing of human remains have also been suggested, although none have them are yet viable, according to the paper."
    },
    {
        "title": "Emma Raducanu says she's not 'playing for money' - as women tennis stars return to Queen's",
        "description": "Tennis star Emma Raducanu has told Sky News she doesn't feel like she's \"playing for money\" and it's not her \"main motivation\".",
        "url": "https://news.sky.com/story/emma-raducanu-says-shes-not-playing-for-money-as-women-tennis-stars-return-to-queens-13380764",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-emma-raducanu-queens-club_6936879.jpg?20250608152213",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-08 14:13:00",
        "Headline": "Those in the line-up include 2025 Australian Open winner Madison Keys, former Wimbledon champions Barbora Krejcikova and Elena Rybakina, and British number one Katie Boulter, as well as former US Open winner Raducanu.",
        "Content": " Tennis star Emma Raducanu has told Sky News she doesn't feel like she's \"playing for money\" and it's not her \"main motivation\". The British number two, who is reportedly worth around £10m, was speaking as she replied to a question from sports presenter Jacquie Beltrao during a news conference ahead of a WTA 500 event starting this week in west London. Women players are returning to compete at the Queen's Club for the first time in more than 50 years, ahead of Wimbledon next month.    Those in the line-up for the inaugural HSBC Championships at Queen's include 2025 Australian Open winner Madison Keys, former Wimbledon champions Barbora Krejcikova and Elena Rybakina, and British number one Katie Boulter, as well as 2021 US Open champion Raducanu. It means a tour level women's tournament is coming to London for the first time since 1973, when Olga Morozova was crowned the last female champion at Queen's. \n                  Emma Raducanu to team up with Nick Cavaday and Mark Petchey for grasscourt season as back problem interrupts prep\n                 \n                  Emma Raducanu pulls out of GB squad to 'look after body'\n                 \n                  Miami Open: Emma Raducanu blitzes past Amanda Anisimova in straight sets to move into last eight\n                 While prize money is equal at the grand slams and some joint tour events, generally remuneration on the WTA Tour is substantially lower than on the men's ATP Tour. Raducanu, 22, told Sky's Jacquie Beltrao: \"There is obviously a big difference [in prize money] and I'm sure a lot players will kind of say their piece on it, but I just prefer not to get involved and just whatever the situation is I'll kind of roll with it, but I'm never really going to take a stand either way.\" She added: \"I don't really get involved or kind of stay in the loop with all the boards and all the decisions and stuff. I kind of just get on with it and I don't feel like I really am playing for money. \"Of course I need to sustain my team which is extremely expensive and you know... with my kind of profile, coaches and team members kind of see that. So it is a very expensive sport, but it's not my main motivator of why I play.\" Raducanu, who is managing an ongoing back issue, also said her expectations for how she does in the Queen's tournament were \"pretty low\". \"I played points for the first time today. I've had maybe like two, three days on the grass court, so it's not been much, but I just have to take it as it goes,\" she said. Why did the tournament move from Queen's in 1974? In 1974, Britain's governing body, the Lawn Tennis Association (LTA), decided to move the women's event from Queen's to Eastbourne as the London venue could not support men's and women's events at once - but in 2025 that has changed. The LTA has cited a desire to raise the profile of women's tennis and promote it to more people for the move to the capital. The organisation is committed to paying equal prize money to female players at Queen's and the Lexus Eastbourne Open by 2029. How much is the prize money for the women's event? The LTA announced last Thursday it would pay total prize money of $1.415m (approximately £1m) at Queen's, the highest for a WTA 500 event of its draw size this year. But that is still less than half of the prize pot that will be paid out to the male players the following week for the equivalent 500 tournament on the ATP Tour, where the line-up includes world number two Carlos Alcaraz of Spain. The LTA has stated an aim to achieve parity on prize money before 2029 but its rationale comes against a £4m loss made across the grass-court events it staged last year - Wimbledon is run by the All England Club - with the men's event at Queen's the only profitable tournament. Read more from Sky News:Prince William warns oceans are 'diminishing before our eyes'Trump deploys National Guard to LA immigration 'riots' 'Significant increases to prize money' Scott Lloyd, the governing body's chief executive, said: \"We are making significant increases this year to the women's prize money at Queen's and Eastbourne and want to achieve equal prize money as soon as possible. \"The LTA is committed to growing women's tennis, both at professional and grass-roots level, and this move is an important part of that commitment. \"This year fans will be able to enjoy both men's and women's tennis on the biggest stages that we can offer and we want to develop the tournaments so that the women's events deliver a path to profitability and greater visibility for the sport.\" The Queen's Club is named after Queen Victoria, its first patron, and is regarded as one of the premier Lawn Tennis and Racquets clubs in the world."
    },
    {
        "title": "Rachel Reeves turning around UK's finances 'like Steve Jobs did for Apple', claims minister",
        "description": "Rachel Reeves will turn around the economy the way Steve Jobs turned around Apple, a cabinet minister has suggested ahead of the upcoming spending review.",
        "url": "https://news.sky.com/story/rachel-reeves-turning-around-uks-finances-like-steve-jobs-did-for-apple-claims-minister-13380643",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-steve-jobs-apple_6936779.jpg?20250608110812",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-08 07:26:00",
        "Headline": "Science and Technology Secretary Peter Kyle compares the chancellor to the late Apple founder, who brought the company back from the brink of insolvency.",
        "Content": " Rachel Reeves will turn around the economy the way Steve Jobs turned around Apple, a cabinet minister has suggested ahead of the upcoming spending review. Science and Technology Secretary Peter Kyle compared the chancellor to the late Apple co-founder when asked on Sky News' Sunday Morning with Trevor Phillips where the £86bn for his department is coming from. Politics Live: Winter fuel payment cut to be dealt with 'in run up to autumn' The package, confirmed ahead of the full spending review next week, will see each region in England granted £500m to spend on science projects of their choice, including research into faster drug treatments. Asked by Trevor Phillips how the government is finding the money, Mr Kyle said: \"Rachel raised money in taxes in the autumn, we are now allocating it per department. \"But the key thing is we are going to be investing record amounts of money into the innovations of the future. \"Just bear in mind that how Apple turned itself around when Steve Jobs came back to Apple, they were 90 days from insolvency. That's the kind of situation that we had when we came into office. \"Steve Jobs turned it around by inventing the iMac, moving to a series of products like the iPod. \"Now we are starting to invest in the vaccine processes of the future, some of the high-tech solutions that are going to be high growth. We're investing in our space sector... they will create jobs in the future.\" 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 The spending review is a process used by governments to set departmental budgets for the years ahead. Asked if it will include more detail on who will receive winter fuel payments, Mr Kyle said that issue will be \"dealt with in the run-up to the autumn\". \"This is a spending review that's going to set the overall spending constraints for government for the next period, the next three years, so you're sort of talking about two separate issues at the moment,\" he said.  Scrapping universal winter fuel payments was one of the first things Labour did in government - despite it not being in their manifesto - with minsters saying it was necessary because of the financial \"blackhole\" left behind by the Tories. But following a long-drawn out backlash, Sir Keir Starmer said last month that the government would extend eligibility, which is now limited to those on pension credit. Read more: Spending review 2025 look ahead It is not clear what the new criteria will be, though Ms Reeves has said the changes will come into place before this winter. Mr Kyle also claimed the spending review will see the government invest \"the most we've ever spent per pupil in our school system\". However, he said the chancellor will stick to her self-imposed fiscal rules - which rule out borrowing for day-to-day spending - meaning that while some departments will get extra money, others are likely to face cuts."
    },
    {
        "title": "IDF told to 'take whatever measures necessary' to stop Greta Thunberg aid boat from reaching Gaza",
        "description": "Israel's defence minister has threatened to \"take whatever measures necessary\"  to stop an aid boat carrying Greta Thunberg from reaching Gaza.",
        "url": "https://news.sky.com/story/israels-defence-minister-vows-to-stop-aid-boat-carrying-greta-thunberg-from-reaching-gaza-13380707",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-greta-thunberg-madleen_6936976.jpg?20250608174816",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-08 12:02:00",
        "Headline": "The climate campaigner is one of 12 activists aboard the vessel, which is operated by the Freedom Flotilla Coalition and aims to break Israel's sea blockade.",
        "Content": "Israel's defence minister has threatened to \"take whatever measures necessary\"  to stop an aid boat carrying Greta Thunberg from reaching Gaza. The climate campaigner, 22, is one of a dozen activists aboard the Madleen, which set sail from Sicily last Sunday on a mission aiming to break Israel's sea blockade. The activists have said they plan to reach Gaza's territorial waters as early as Sunday to deliver humanitarian aid. But in a post on X, Israel's defence minister Israel Katz said he has instructed the IDF to prevent the vessel reaching the shore and to \"take whatever measures necessary\". Addressing Thunberg and the other activists, he said: \"You should turn back - because you will not reach Gaza.\" He wrote: \"I have instructed the IDF to act so that the 'Madeleine' hate flotilla does not reach the shores of Gaza - and to take any means necessary to that end. \"To the anti-Semitic Greta and her fellow Hamas propaganda spokespeople, I say clearly: You should turn back - because you will not reach Gaza. \"Israel will act against any attempt to break the blockade or assist terrorist organizations - at sea, in the air and on land.\"  Rima Hassan, a French member of the European Parliament, who is of Palestinian descent, is also on the boat, which is operated by the Freedom Flotilla Coalition. She has been barred from entering Israel because of her opposition to Israel's policies towards Palestinians. Read more from Sky News:British surgeon on IDF in GazaTrump deploys National Guard to LA immigration 'riots'Russia claims troops reach new Ukrainian region Israel started allowing some basic aid into Gaza last month after a three-month total blockade aimed at pressuring Hamas and preventing the group from importing arms. But humanitarian workers have warned of famine unless there is an end to the blockade and the 20-month war, which was ignited by the Hamas-led attack on southern Israel on 7 Oct 2023. An attempt last month by Freedom Flotilla to reach Gaza by sea failed after another of the group's vessels was attacked by two drones while sailing in international waters off Malta. The group blamed Israel for the attack, which damaged the front section of the ship."
    },
    {
        "title": "Colombian presidential candidate Miguel Uribe Turbay in 'critical condition' after attempted assassination - as 15-year-old suspect arrested",
        "description": "A 15 year-old-boy has been arrested after a Colombian senator running to be the country's next president was shot and \"critically\" injured at a campaign rally in Bogota, authorities have said.",
        "url": "https://news.sky.com/story/colombian-presidential-candidate-miguel-uribe-turbay-in-critical-condition-after-attempted-assassination-13380625",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-miguel-uribe-turbay_6936711.jpg?20250608074024",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-08 03:51:00",
        "Headline": "Senator Miguel Uribe Turbay, 39, was targeted during a campaign event in a park in the Fontibon area of the Colombian capital Bogota.",
        "Content": " A 15 year-old-boy has been arrested after a Colombian senator running to be the country's next president was shot and \"critically\" injured at a campaign rally in Bogota, authorities have said. Senator Miguel Uribe Turbay, 39, was targeted during the campaign event in a park in the Fontibon area of the Colombian capital, according to the Attorney General's office. He suffered two gunshot wounds when armed assailants shot him from behind and appeared to be bleeding from his head as he was helped by aides and people in the crowd, in a video posted on social media. According to a medical report at the Santa Fe Foundation hospital, he was admitted there in a \"critical condition\" and is still undergoing a \"neurosurgical and peripheral vascular procedure\". His wife Maria Claudia Tarazone wrote on X that he is \"fighting for his life\" and urged Colombians to pray for him. She later said he survived an initial operation for the injuries. Ms Tarazone said: \"Miguel came out of surgery, he made it. Every hour is a critical hour. He fought his first battle, and it went well. This will take time.\" The hospital said Mr Uribe Turbay had procedures on his head and his left thigh, and remained in intensive care as doctors try to stabilise his condition. Two other people were injured in the attack but the nature of their injuries has not been made public. A suspect, a 15-year-old boy, was arrested at the scene with a firearm and is being treated for a leg injury, police chief General Carlos Triana said. The government is offering a $730,000 (£540,000) reward for information and President Gustavo Petro said the investigation will focus on who ordered the attack. \"For now there is nothing more than hypothesis,\" he said, adding that failures in security protocols would also be looked into. Mr Uribe Turbay, who announced his presidential bid for the right-wing Democratic Center Party in March, was accompanied by a team of 21 people at the time of the shooting, his office said, including councilman Andres Barrios. He was hoping to run in the presidential elections taking place on 31 May next year - and succeed Mr Petro, the country's first leftist leader. His mother, who was a journalist, was kidnapped and killed in 1991 during one of the most violent periods in Colombia's history. Read more from Sky NewsGazans pray in rubble at start of EidThai hostage's body retrieved by IsraelInvestigators end search for missing toddler His party described it as an \"unacceptable act of violence\", while US secretary of state Marco Rubio condemned it in the \"strongest possible terms\". Writing on X, Mr Rubio also urged Colombia's current president to \"dial back the inflammatory rhetoric and protect Colombian officials\". Former Colombian president Alvaro Uribe, who is not related to Mr Uribe Turbay, said the gunman had \"attacked the hope of the country, a great husband, son, brother, and a great colleague\". He cancelled a planned trip to France due to the \"seriousness of the events\", his office said in a statement. Messages of support poured in from elsewhere in Latin America, with Chilean President Gabriel Boric saying: \"There is no room or justification for violence in a democracy.\" Ecuadorian President Daniel Noboa added: \"We condemn all forms of violence and intolerance.\""
    },
    {
        "title": "British soldier arrested on suspicion of raping woman in Kenya",
        "description": "A British soldier based at an army barracks in Kenya has been arrested on suspicion of rape.",
        "url": "https://news.sky.com/story/british-soldier-arrested-on-suspicion-of-raping-woman-in-kenya-13380683",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nanyuki-sign-kenya_6936819.jpg?20250608131527",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-08 10:07:00",
        "Headline": "The alleged incident happened last month after a group of soldiers visited a bar in Nanyuki -  the town where the body of 21-year-old Agnes Wanjiru was found in a hotel septic tank in 2012.",
        "Content": "A British soldier based at an army barracks in Kenya has been arrested on suspicion of rape. The alleged attack happened last month after a group of soldiers visited a bar in the town of Nanyuki, close to the Batuk (British Army Training Unit Kenya) camp. An investigation is being carried out by the Defence Serious Crime Command, which probes serious crimes alleged to have been carried out by British servicemen and women in the UK and overseas. Military police have questioned the bar owner along with security guards who were on duty on the night of the incident, according to The Sunday Times, which first reported the allegations. According to the paper, the owner of the bar said: \"They [the soldiers] like this place and when I meet some of them in the supermarkets, they tell me they have been banned from coming here. \"Sometimes they get too drunk and I drop them at the gate for free.\" A Ministry of Defence spokesperson said: \"We can confirm the arrest of a service person in Kenya. \"As the matter is the subject of an ongoing investigation by the Defence Serious Crime Command, we will not comment further.\" They added: \"All soldiers who visit or train at Batuk have clear direction about how to behave, on and off duty, must complete mandatory training and attend compulsory briefings on conduct. We will have zero tolerance for unacceptable behaviour. \"To ensure the highest possible standards, the Army has launched a comprehensive Service Inquiry into allegations of unacceptable behaviour by UK Service Personnel in Kenya which would violate MoD and Army policy.\" Read more from Sky News:Trump deploys National Guard to LA 'riots'Is Rachel Reeves the next Steve Jobs? The army last year launched an inquiry into the behaviour of British troops posted to the base after allegations against soldiers, including involvement in the murder of a woman in 2012. The body of 21-year-old Agnes Wanjiru, a mother of one, was found in a septic tank at the Lions Court Hotel in Nanyuki two months after she disappeared in March 2012. According to an investigation by The Sunday Times, a British soldier accused of the murder has been named by his comrades after he allegedly confessed to the killing. An inquest found sex worker Ms Wanjiru was unlawfully killed and a post-mortem examination concluded she had died as a result of stab sounds to her chest and abdomen. Defence Secretary John Healey met with her family in April during a visit to Kenya. The British Army has an agreement with Kenya to deploy up to six battalions a year for training."
    },
    {
        "title": "'The only people I've ever seen in Gaza with weapons are the IDF,' says British surgeon",
        "description": "A British surgeon has told Sky News she has never treated or seen anyone in a Gaza hospital in military uniform - and the only people she has seen with weapons are the IDF.",
        "url": "https://news.sky.com/story/the-only-people-ive-ever-seen-in-gaza-with-weapons-are-the-idf-says-british-surgeon-13380662",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-children_6930584.jpg?20250529172404",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-08 08:55:00",
        "Headline": "NHS doctor Victoria Rose says she never saw armed Palestinians in Gaza hospitals, though Israel claims Hamas uses them for command centres.",
        "Content": " A British surgeon has told Sky News she has never treated or seen anyone in a Gaza hospital in military uniform - and the only people she has seen with weapons are the IDF. Dr Victoria Rose, a NHS plastic surgeon who has experience working in Gaza, said conditions there are now the worst they've ever been. \"There's been a real escalation in the bombing campaign,\" she told Sunday Morning with Trevor Phillips. \"The population is on their knees.\" Hospitals in Gaza have frequently come under Israeli military (IDF) fire - and sometimes find themselves besieged - in the ongoing war following Hamas's October 2023 attacks on Israel. Medical facilities are usually protected during conflicts under international law, but Israel has repeatedly claimed that Hamas uses them for command centres. Asked about Israel's allegations, Dr Rose said: \"I've never treated or seen anyone - in any of the hospitals that I've worked in - in military uniform or with a weapon. \"The only people I've ever seen in Gaza with military uniforms and weapons are the IDF.\" Read more:Gazans pray in rubble at start of EidBodies of couple taken by Hamas recovered by IDF  Dr Rose told Sky News about the impact of the war on hospital staff: \"Lots of my Palestinian colleagues were telling me that they would rather die than carry on with this war.\" It comes as a controversial humanitarian organisation backed by Israel and the US said it did not distribute any food in Gaza on Saturday, accusing Hamas of making threats that \"made it impossible\" to operate. Hamas denied the claims.  The Israeli blockade on aid going into Gaza has severely affected the population, she said, leaving them malnourished and without the nutrients they need. Speaking about her last visit to a hospital in the enclave, she said: \"Infection rates were soaring... We were seeing a lot of avoidable deaths, a lot of small children dying from sepsis that would have been prevented if they'd been in in the Western world.\" Despite a limited lifting of the blockade by Israel - the head of the UN called it a \"teaspoon\" - the aid situation in Gaza remains dire. The Gaza Humanitarian Foundation (GHF), which is endorsed by Israel and the US, took over responsibility for distributing aid in Gaza, but has been criticised for lack of experience, organisation and faces allegations of assisting in ethnic cleansing by luring Palestinians to the south of the enclave if they want food.  The Hamas-run Gaza government media office said on Saturday the GHF operation has \"utterly failed on all levels\" and that Hamas was ready to help secure aid deliveries by a separate long-running UN-led humanitarian operation. A Hamas source told Reuters the group's armed wing would deploy snipers on Sunday to prevent armed gangs looting food shipments."
    },
    {
        "title": "Prince William warns world's oceans are 'diminishing before our eyes' in call for urgent action",
        "description": "Prince William has warned the world's oceans are \"diminishing before our eyes\" and called on the world to \"think big\" on how to revive them.",
        "url": "https://news.sky.com/story/prince-william-warns-worlds-oceans-are-diminishing-before-our-eyes-in-call-for-urgent-action-13380695",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-william-climate_6936810.jpg?20250608130214",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-08 11:16:00",
        "Headline": "Speaking in Monaco, the Prince of Wales calls on the world to \"think big\" on how to revive the Earth's seas and oceans.",
        "Content": " Prince William has warned the world's oceans are \"diminishing before our eyes\" and called on the world to \"think big\" on how to revive them. Speaking at the Blue Economy and Finance Forum in Monaco on Sunday, he said everyone is responsible for change - both negative and positive. \"What once seemed an abundant resource is diminishing before our eyes,\" he said. \"We all stand to be impacted.\" It comes as he teamed up with Sir David Attenborough in a social media video to talk about the harmful effects of over-fishing, pollution and temperature rise on our marine environment.  \"This challenge is like none that we have faced before,\" the royal continued. \"But I remain an optimist. I believe that urgency and optimism have the power to bring about the action needed to change the course of history.\" \n                  Essex set to be the home of Europe's largest low-carbon horticulture site\n                 \n                  Nigeria floods: At least 110 dead as heavy flooding submerges thousands of houses\n                 \n                  More than 40% of Europe slides into drought, including pockets of Greece, southern Italy and Spain\n                 The Prince of Wales is also the founder and president of the Earthshot Prize, a global award that celebrates environmental initiatives. Finalists for this year's award were due to attend the event. He ended his speech with a call to action intended to go further than just Monaco or even Europe. \"Halfway through this decisive decade, I call on all of you to think big in your actions. \"Let us act together with urgency and optimism while we still have the chance. \"For the future of our planet.  For the future generations. We must listen to the words of Sir David Attenborough: 'If we save the sea, we save our world'.\" Read more:More than 40% of Europe slides into droughtJust Stop Oil activists jailed for plotting to disrupt airport To coincide with the event, and to attract a greater audience, a YouTube video was posted by Kensington Palace, showing William and Sir David Attenborough laughing together as Sir David tried on his first-ever diving helmet. But their conversation soon turned to more serious matters when they discussed Sir David's new film, Oceans, and the horrific examples of damage uncovered."
    },
    {
        "title": "Trump seizes opportunity to deploy federal force in California",
        "description": "The tension on the streets of Los Angeles reflects a widening gulf between California's political leaders and the federal government.",
        "url": "https://news.sky.com/story/trump-seizes-opportunity-to-deploy-federal-force-in-california-13380626",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-la-immigration-protests_6936698.jpg?20250608060136",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-06-08 04:55:00",
        "Headline": "Presidents usually roll out the National Guard in consultation with state governors. Not this time.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n The tension on the streets of Los Angeles reflects a widening gulf between California's political leaders and the federal government. The state's Democratic governor, Gavin Newsom, accused the White House of \"sowing chaos\" as \"an excuse to escalate\". His comments came after President Trump's border czar, Tom Homan, confirmed their intention to deploy the National Guard. Presidents usually roll out the National Guard in consultation with state governors. Not this time. Donald Trump seized the opportunity to use federal force - ordering 2,000 guardsmen on to the streets.  Defence secretary Pete Hegseth went further, announcing that active-duty Marines stationed nearby had been placed on \"high alert\" for mobilisation. Posting on X, Governor Newsom responded: \"The Secretary of Defence is now threatening to deploy active-duty Marines on American soil against its own citizens. This is deranged behaviour.\" Read more from Sky News:Man wrongly deported returns to US to face chargesMinute-by-minute guide to Trump-Musk fall-outProud Boys $100m lawsuit over 6 January convictions Smarting from his spat with Elon Musk, the president weighed on the LA protests before attending a mixed martial arts fight in New Jersey. \"If the Mayor and Governor can't do their jobs, we will step in and solve the problem,\" he posted on his Truth Social platform. But there is no problem to solve, according to Los Angeles Police Department, reporting the demonstrations now \"peaceful\"."
    },
    {
        "title": "Snoop Dogg says he hopes to open burger van at Celtic Park",
        "description": "Snoop Dogg says he hopes to set up a burger van at Celtic's stadium and wants to serve fans himself.",
        "url": "https://news.sky.com/story/snoop-dogg-says-he-hopes-to-open-burger-van-at-celtic-park-13380894",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-snoop-dogg-rapper_6937013.jpg?20250608200052",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-08 18:22:00",
        "Headline": "The rapper said a fast-food van at the stadium would become a foodie \"Paradise\" which is a nickname for the ground in Glasgow.",
        "Content": "Snoop Dogg says he hopes to set up a burger van at Celtic's stadium and wants to serve fans himself. The US rapper, 53, has described the football club's supporters as \"special\" and the best fans in European football. And Snoop, who played Glasgow's OVO Hydro arena in 2023, has also said he strongly identifies with the club's mascot Hoopy the Hound. He said a fast-food van at Celtic Park would become a foodie \"Paradise\" which is a nickname for the ground in the Parkhead area of the city. Snoop told the Sunday Mail: \"I would love to bring a pop-up burger [van] to a sports stadium to show fans that food at stadiums can be good. \"It's got to be Celtic Park, man. The secret to a good burger is the love in the preparation. The ground beef has got to be mixed with some secret spices, then add a good quality cheese and some maple-cured bacon. \"The Celtic fans are gonna love it, and to make sure they are just right, Snoop is going to be serving them himself.\" \n                  Body found in search for Briton who went missing during stag do in Portugal\n                 \n                  Yvonne Keenan: Glasgow foster carer jailed for abusing four children\n                 \n                  Union warns summer holiday strike action looms at Edinburgh and Glasgow airports\n                 But he said he would not be taking his culinary ventures to Rangers - Celtic's Old Firm rivals at Ibrox. The Drop It Like It's Hot star told the paper: \"Am I going to bring my burgers to Rangers as well? Nah, I think we will give that a miss.\" Read more from Sky News:Raducanu says she not 'playing for money'Is Rachel Reeves the next Steve Jobs? The musician has previously spoken of investing in Celtic, similar to Hollywood actor Ryan Reynolds's involvement with Wrexham FC. Snoop has already published a cookbook and claims to have spoken to chef Gordon Ramsay about a possible venture in Glasgow together. The keen sports fan worked as a correspondent for NBC at the Paris Olympics last year, and has launched two youth football leagues, as well as being a vocal advocate for pay equality for female athletes."
    },
    {
        "title": "Buyout firms circle corporate intelligence firm G3 ",
        "description": "A corporate intelligence firm which employs Sir John Sawers, the former head of MI6, is closing in on a deal to sell a big stake to a buyout firm.",
        "url": "https://news.sky.com/story/buyout-firms-circle-corporate-intelligence-firm-g3-13380757",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-john-sawers-mi6_6848529.png?20250608150549",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-08 14:02:00",
        "Headline": "Oakley Capital is among the private equity groups which have been holding talks about an investment in a fast-growing advisory firm which helps clients manage commercial risks, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A corporate intelligence firm which employs Sir John Sawers, the former head of MI6, is closing in on a deal to sell a big stake to a buyout firm. Sky News has learnt that G3, which was founded in 2004 and advises clients on a range of risks affecting their businesses, has been in detailed talks in recent weeks with private equity suitors including Oakley Capital and KKR. Precise details of a transaction were unclear on Sunday, although one source suggested that a deal was likely in the coming days, and could value the business at between £200m and £250m. They said that Oakley Capital - founded by the entrepreneur Peter Dubens - had emerged as the most likely investor, although a deal had yet to be agreed. Bridgepoint, another London-based private equity firm, had also expressed an interest in G3, the source added. G3 already has some external investment, having struck a deal with All Seas Capital in 2022, according to the latter's website. The firm - which files accounts under the name G3 Good Governance Group - advises companies, private equity firms, sovereign wealth funds and pension funds on areas of commercial risk such as cybersecurity, reported a 27% rise in revenue in 2023. \n                  River Island owners draw up rescue plan for high street chain\n                 \n                  Spending Review 2025: Faster drug treatments and longer-lasting batteries to come from £86bn science and tech package\n                 \n                  Weekend Money: Renowned chef talks about life after being conned out of £300,000 by his own mum\n                 During that year, the latest for which accounts are available, it recorded earnings before interest, tax, depreciation and amortisation of nearly £9m. Sir John, who stepped down as the head of MI6 in 2014, was named chairman of G3's advisory board last year. Oakley Capital declined to comment, while G3 could not be reached for comment this weekend."
    },
    {
        "title": "Minister dismisses US misgivings over Chinese 'super embassy' in London - as Tories warn of 'espionage base'",
        "description": "A minister has dismissed reported US misgivings about plans for a Chinese \"super embassy\" near London's financial districts.",
        "url": "https://news.sky.com/story/minister-dismisses-us-misgivings-over-chinese-super-embassy-in-london-as-tories-warn-of-espionage-base-13380671",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-chinese-embassy-mega_6936787.jpg?20250608113825",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-08 09:31:00",
        "Headline": "Peter Kyle said security concerns will be taken care of \"assiduously\" - but the  Tories say the new embassy could become a base for China's \"pan-European espionage activities\".",
        "Content": " A minister has dismissed reported US misgivings about plans for a Chinese \"super embassy\" near London's financial districts. Peter Kyle told Sky News' Sunday Morning with Trevor Phillips that security concerns will be \"taken care of assiduously in the planning process\". Politics live: Winter fuel payment cut to be dealt with 'in run up to autumn' According to The Sunday Times, the White House has warned Downing Street against the proposed massive embassy at Royal Mint Court. The site is between financial hubs in the City of London and Canary Wharf and close to three data centres, raising concerns about espionage risk. Asked for the government's view on the risk, Mr Kyle said: \"These issues will be taken care of assiduously in the planning process. \"But just to reassure people, we deal with embassies and these sorts of infrastructure issues all the time. \"We are very experienced and we are very aware of these sorts of issues constantly, not just when new buildings are being done, but all the time.\" He added that America and Britain \"share intelligence iteratively\" and if they raise security concerns through the planning process \"we will have a fulsome response for them\". However, shadow home secretary Chris Philp said he shared the US's concerns. He told Trevor Phillips: \"I agree with the United States. We think it is a security risk in the government. \"The Conservatives were very clear. We should not be allowing the Chinese to build the super embassy. It is likely to become a base for their pan-European espionage activities.\" He added that underneath the sites are cables connecting the City of London to Canary Wharf and these could be intercepted. Sky News has contacted the Chinese embassy for comment. Read More: Diplomatic win for UK hosting US-China trade talks China has been attempting to revise plans for the Royal Mint building, opposite the Tower of London, since purchasing it in 2018. The proposal for the embassy, which would be China's largest in Europe, was previously rejected by Tower Hamlets council in 2022. However, Beijing resubmitted it in August after Labour won the election, and the plans were \"called in\" by Angela Rayner, the deputy prime minister and housing secretary. It means that an inspector will be appointed to carry out an inquiry into the proposal, but the decision ultimately rests with central government rather than the local authority. Two large protests were held at the site in February and March, which organisers claimed involved thousands of people."
    },
    {
        "title": "The winners and losers in Rachel Reeves's spending review",
        "description": "\"It's a big deal for this government,\" says Simon Case. ",
        "url": "https://news.sky.com/story/real-risk-rachel-reevess-spending-review-will-be-about-the-departments-that-have-lost-out-13380746",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rachel-reeves-politics_6892532.jpg?20250608154208",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2025-06-08 13:44:00",
        "Headline": "The Treasury clearly wants to focus on promoting its generosity but in any process of prioritisation there are losers as well as winners.",
        "Content": "\n          Political correspondent\n              @amandaakass\n \"It's a big deal for this government,\" says Simon Case.  \"It's the clearest indication yet of what they plan to do between now and the general election, a translation of their manifesto. \"This is where you should expect the chancellor to say, on behalf of the government: 'This is what we're about'.\" As the former cabinet secretary, Mr Case was the man in charge of the civil service during the last spending review, in 2021.  On Wednesday, Rachel Reeves will unveil the Labour government's priorities for the next three years. But it's unclear whether it will provide all that much of an answer about what it's really about. Unlike the Autumn budget, when the chancellor announced her plans on where to tax and borrow to fund overall levels of spending, the spending review will set out exactly how that money is divided up between the different government departments. Since the start of the process in December those departments have been bidding for their share of the cash - setting out their proposed budgets in a negotiation which looks set to continue right up to the wire. This review is being conducted in an usual level of detail, with every single line of spending assessed, according to the chancellor, on whether it represents value for money and meets the government's priorities. Budget proposals have been scrutinised by so called \"challenge panels\" of independent experts. It's clear that health and defence will be winners in this process given pre-existing commitments to prioritise the NHS - with a boost of up to £30bn expected - and to increase defence spending. On Sunday morning, the government press release trumpeted an impressive-sounding \"£86bn boost\" to research and development (R&D), with the Science and Technology Secretary Peter Kyle sent out on the morning media round to celebrate as record levels of investment.  We're told this increased spending on the life sciences, advanced manufacturing and defence will lead to jobs and growth across the country, with every £1 in investment set to lead to a £7 economic return. But the headline figure is misleading. It's not £86bn in new funding. That £86bn has been calculated by adding together all R&D investment across government for the next three years, which will reach an annual figure of £22.5bn by 2029-30. The figure for this year was already set to be £20.4bn; so while it's a definite uplift, much of that money was already allocated. Read More:Reeves turning around UK finances 'like Steve Jobs did for Apple'Government struggles to slash foreign aid spent on asylum hotels Peter Kyle also highlighted plans for \"the most we've ever spent per pupil in our school system\". I understand the schools budget is to be boosted by £4.5bn. Again, this is clearly an uplift - but over a three-year period, that equates to just £1.5bn a year (compared with an existing budget of £63.7bn). It also has to cover the cost of extending free school meals, and the promised uplift in teachers' pay. In any process of prioritisation there are losers as well as winners. We already know about planned cuts to the Department of Work and Pensions - but other unprotected departments like the Home Office and the Department of Communities and Local Government are braced for a real spending squeeze. We've heard dire warnings about austerity 2.0, and the impact that would have on the government's crime and policing priorities, its promises around housing and immigration, and on the budgets for cash-strapped local councils. The chancellor wants to make it clear to the markets she's sticking to her fiscal rules on balancing the books for day-to-day spending. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 But the decision to loosen the rules around borrowing to fund capital investment have given her greater room to manoeuvre in funding long-term infrastructure projects. That's why we've seen her travelling around the country this week to promote the £15.6bn she's spending on regional transport projects. The Treasury team clearly wants to focus on promoting the generosity of these kind of investments, and we'll hear more in the coming days. But there's a real risk the story of this spending review will be about the departments which have lost out - and the promises which could slip as a result."
    },
    {
        "title": "Rachel Reeves turning around UK's finances 'like Steve Jobs did for Apple', claims minister",
        "description": "Rachel Reeves will turn around the economy the way Steve Jobs turned around Apple, a cabinet minister has suggested ahead of the upcoming spending review.",
        "url": "https://news.sky.com/story/rachel-reeves-turning-around-uks-finances-like-steve-jobs-did-for-apple-claims-minister-13380643",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-steve-jobs-apple_6936779.jpg?20250608110812",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-08 07:26:00",
        "Headline": "Science and Technology Secretary Peter Kyle compares the chancellor to the late Apple founder, who brought the company back from the brink of insolvency.",
        "Content": " Rachel Reeves will turn around the economy the way Steve Jobs turned around Apple, a cabinet minister has suggested ahead of the upcoming spending review. Science and Technology Secretary Peter Kyle compared the chancellor to the late Apple co-founder when asked on Sky News' Sunday Morning with Trevor Phillips where the £86bn for his department is coming from. Politics Live: Winter fuel payment cut to be dealt with 'in run up to autumn' The package, confirmed ahead of the full spending review next week, will see each region in England granted £500m to spend on science projects of their choice, including research into faster drug treatments. Asked by Trevor Phillips how the government is finding the money, Mr Kyle said: \"Rachel raised money in taxes in the autumn, we are now allocating it per department. \"But the key thing is we are going to be investing record amounts of money into the innovations of the future. \"Just bear in mind that how Apple turned itself around when Steve Jobs came back to Apple, they were 90 days from insolvency. That's the kind of situation that we had when we came into office. \"Steve Jobs turned it around by inventing the iMac, moving to a series of products like the iPod. \"Now we are starting to invest in the vaccine processes of the future, some of the high-tech solutions that are going to be high growth. We're investing in our space sector... they will create jobs in the future.\" 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 The spending review is a process used by governments to set departmental budgets for the years ahead. Asked if it will include more detail on who will receive winter fuel payments, Mr Kyle said that issue will be \"dealt with in the run-up to the autumn\". \"This is a spending review that's going to set the overall spending constraints for government for the next period, the next three years, so you're sort of talking about two separate issues at the moment,\" he said.  Scrapping universal winter fuel payments was one of the first things Labour did in government - despite it not being in their manifesto - with minsters saying it was necessary because of the financial \"blackhole\" left behind by the Tories. But following a long-drawn out backlash, Sir Keir Starmer said last month that the government would extend eligibility, which is now limited to those on pension credit. Read more: Spending review 2025 look ahead It is not clear what the new criteria will be, though Ms Reeves has said the changes will come into place before this winter. Mr Kyle also claimed the spending review will see the government invest \"the most we've ever spent per pupil in our school system\". However, he said the chancellor will stick to her self-imposed fiscal rules - which rule out borrowing for day-to-day spending - meaning that while some departments will get extra money, others are likely to face cuts."
    },
    {
        "title": "'It's simply not safe': A thousand doctors write to MPs urging them to vote against assisted dying bill",
        "description": "More than 1,000 doctors have written to MPs urging them to vote against the assisted dying bill, calling it a \"real threat to both patients and the medical workforce\".",
        "url": "https://news.sky.com/story/its-simply-not-safe-a-thousand-doctors-write-to-mps-urging-them-to-vote-against-assisted-dying-bill-13380847",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-assisted-dying_6936985.jpg?20250608181644",
        "type": "Politics",
        "Author": "Megan Harwood-Baynes, Ashish Joshi and Mark Thompson, Sky News health team",
        "Date Published": "2025-06-08 23:01:00",
        "Headline": "Supporters of the bill say it would allow terminally ill patients from England and Wales to end their lives \"on their own terms\", providing they have a life expectancy of six months or less.",
        "Content": "By Megan Harwood-Baynes, Ashish Joshi and Mark Thompson, Sky News health team  More than 1,000 doctors have written to MPs urging them to vote against the assisted dying bill, calling it a \"real threat to both patients and the medical workforce\". The bill - which is due to be voted on by MPs for a final time on 20 June - would allow terminally ill patients from England and Wales to end their lives \"on their own terms\", providing they have a life expectancy of six months or less. A separate bill is currently passing through the Scottish parliament. But doctors from across the NHS have written to MPs, warning them of their \"serious concerns\". Notable signatories include Sir John Burn, a geneticist who has led decades of cancer research, Sir Shakeel Qureshi, who was knighted for his work in paediatric cardiology, Professor Aileen Keel, the former deputy chief medical officer for Scotland, and Baroness Finlay, a Welsh doctor, professor of palliative medicine and member of the House of Lords. The letter is signed by four doctors who hold OBEs, two who have MBEs, and one CBE. The letter says that while a debate is needed on end of life care, \"this bill is not the answer\". \n                  Dr Florian Willet: Euthanasia advocate dies after being arrested over woman's 'suicide capsule' death\n                 \n                  'Deeply dangerous' assisted dying bill should be scrapped, says leading care consultant\n                 \n                  MPs criticise terminally ill Esther Rantzen's assisted dying intervention\n                 It raises concerns that not enough evidence has been heard from doctors, people with disabilities and other marginalised groups. \"This bill will widen inequalities, it provides inadequate safeguards and, in our collective view, is simply not safe,\" it goes on to say, calling it a \"deeply flawed bill\".  Read more:Why is assisted dying so controversial - and where is it already legal?Five stories that bring the assisted dying debate homeTwo terminally ill patients give opposing views on assisted dying Professor Colin Rees, a member of the Royal College of Physicians working group on assisted dying, said it was the \"single most important piece of healthcare legislation in 50 or 60 years\". \"It will have very profound consequences for the future and many doctors are really concerned that members of parliament are not hearing the views of the medical profession.\" He said many doctors who remain neutral, or who even support the principle of assisted dying, remain concerned about the bill. \"We don't think it's a bill that is safe, that protects patients, protects families, and protects the medical workforce.\" The Terminally Ill Adults (End of Life) Bill passed the House of Commons with a majority of 55 in November. Scotland's Assisted Dying for Terminally Ill Adults (Scotland Bill) pass with a 14 majority in May. But the legislation has not been without controversy, with 150 amendments made to get it through the first stage.  The bill will return to the House of Commons for a third reading this Friday. If voted through by MPs it will then proceed to the House of Lords. 'No safeguards against coercion' One of the areas of concern raised by the medics was the inability to properly identify patients at risk of coercive control. \"Vulnerable patients are at risk of coercion with women, victims of domestic abuse, and the elderly at particular risk,\" the letter says. It also warned it would widen social inequalities, with patients who do not have the resources for a comfortable death more likely to opt for assisted dying. \"People who struggle to pay for heating or care or wish to preserve their assets for their children are at high risk of choosing to die if the option is available and the alternative is more difficult.\" Data from the Annual Report of Dying With Dignity from Oregon in 2024 found 9.3% of those people who choose assisted deaths do so for financial reasons. 'Doctors get it wrong 40% of the time' Concerns have also been raised around the inaccuracies of medical prognosis. \"Research demonstrates that doctors get prognosis wrong around 40% of the time,\" the letter says. \"As such, patients may end up choosing an assisted death and losing what could have been happy and fulfilling months or years of life.\"  The bill is also a risk to families, the letter says, as it does not require doctors to speak with family members. \"A close relative may know nothing until they get a call to arrange collection of their relative's body,\" it says, adding that there is no mechanism for a family member to raise concerns about a request. The letter also addressed the potential impact on the medical workforce. Evidence from the Netherlands suggests \"doctors feel pressurised when dealing with patient requests for assisted deaths, meaning that doctors may end up having involvement despite it being against their principles, because they want to help their patients\"."
    },
    {
        "title": "Prince William warns world's oceans are 'diminishing before our eyes' in call for urgent action",
        "description": "Prince William has warned the world's oceans are \"diminishing before our eyes\" and called on the world to \"think big\" on how to revive them.",
        "url": "https://news.sky.com/story/prince-william-warns-worlds-oceans-are-diminishing-before-our-eyes-in-call-for-urgent-action-13380695",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-william-climate_6936810.jpg?20250608130214",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-08 11:16:00",
        "Headline": "Speaking in Monaco, the Prince of Wales calls on the world to \"think big\" on how to revive the Earth's seas and oceans.",
        "Content": " Prince William has warned the world's oceans are \"diminishing before our eyes\" and called on the world to \"think big\" on how to revive them. Speaking at the Blue Economy and Finance Forum in Monaco on Sunday, he said everyone is responsible for change - both negative and positive. \"What once seemed an abundant resource is diminishing before our eyes,\" he said. \"We all stand to be impacted.\" It comes as he teamed up with Sir David Attenborough in a social media video to talk about the harmful effects of over-fishing, pollution and temperature rise on our marine environment.  \"This challenge is like none that we have faced before,\" the royal continued. \"But I remain an optimist. I believe that urgency and optimism have the power to bring about the action needed to change the course of history.\" \n                  Essex set to be the home of Europe's largest low-carbon horticulture site\n                 \n                  Nigeria floods: At least 110 dead as heavy flooding submerges thousands of houses\n                 \n                  More than 40% of Europe slides into drought, including pockets of Greece, southern Italy and Spain\n                 The Prince of Wales is also the founder and president of the Earthshot Prize, a global award that celebrates environmental initiatives. Finalists for this year's award were due to attend the event. He ended his speech with a call to action intended to go further than just Monaco or even Europe. \"Halfway through this decisive decade, I call on all of you to think big in your actions. \"Let us act together with urgency and optimism while we still have the chance. \"For the future of our planet.  For the future generations. We must listen to the words of Sir David Attenborough: 'If we save the sea, we save our world'.\" Read more:More than 40% of Europe slides into droughtJust Stop Oil activists jailed for plotting to disrupt airport To coincide with the event, and to attract a greater audience, a YouTube video was posted by Kensington Palace, showing William and Sir David Attenborough laughing together as Sir David tried on his first-ever diving helmet. But their conversation soon turned to more serious matters when they discussed Sir David's new film, Oceans, and the horrific examples of damage uncovered."
    },
    {
        "title": "Snoop Dogg says he hopes to open burger van at Celtic Park",
        "description": "Snoop Dogg says he hopes to set up a burger van at Celtic's stadium and wants to serve fans himself.",
        "url": "https://news.sky.com/story/snoop-dogg-says-he-hopes-to-open-burger-van-at-celtic-park-13380894",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-snoop-dogg-rapper_6937013.jpg?20250608200052",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-08 18:22:00",
        "Headline": "The rapper said a fast-food van at the stadium would become a foodie \"Paradise\" which is a nickname for the ground in Glasgow.",
        "Content": "Snoop Dogg says he hopes to set up a burger van at Celtic's stadium and wants to serve fans himself. The US rapper, 53, has described the football club's supporters as \"special\" and the best fans in European football. And Snoop, who played Glasgow's OVO Hydro arena in 2023, has also said he strongly identifies with the club's mascot Hoopy the Hound. He said a fast-food van at Celtic Park would become a foodie \"Paradise\" which is a nickname for the ground in the Parkhead area of the city. Snoop told the Sunday Mail: \"I would love to bring a pop-up burger [van] to a sports stadium to show fans that food at stadiums can be good. \"It's got to be Celtic Park, man. The secret to a good burger is the love in the preparation. The ground beef has got to be mixed with some secret spices, then add a good quality cheese and some maple-cured bacon. \"The Celtic fans are gonna love it, and to make sure they are just right, Snoop is going to be serving them himself.\" \n                  Body found in search for Briton who went missing during stag do in Portugal\n                 \n                  Yvonne Keenan: Glasgow foster carer jailed for abusing four children\n                 \n                  Union warns summer holiday strike action looms at Edinburgh and Glasgow airports\n                 But he said he would not be taking his culinary ventures to Rangers - Celtic's Old Firm rivals at Ibrox. The Drop It Like It's Hot star told the paper: \"Am I going to bring my burgers to Rangers as well? Nah, I think we will give that a miss.\" Read more from Sky News:Raducanu says she not 'playing for money'Is Rachel Reeves the next Steve Jobs? The musician has previously spoken of investing in Celtic, similar to Hollywood actor Ryan Reynolds's involvement with Wrexham FC. Snoop has already published a cookbook and claims to have spoken to chef Gordon Ramsay about a possible venture in Glasgow together. The keen sports fan worked as a correspondent for NBC at the Paris Olympics last year, and has launched two youth football leagues, as well as being a vocal advocate for pay equality for female athletes."
    }
]