[
    {
        "title": "Israel kills journalist it claims was a Hamas 'terrorist'",
        "description": "Five Al Jazeera employees have been killed in an Israeli strike in Gaza - including a journalist who feared he was going to be assassinated.",
        "url": "https://news.sky.com/story/journalist-killed-in-israeli-strike-feared-his-own-assassination-as-idf-claims-he-was-a-terrorist-13409945",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sharif-gaza_6987707.jpg?20250810221948",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-10 22:29:00",
        "Headline": "Anas al Sharif, 28, died alongside four of his colleagues from the Al Jazeera network.",
        "Content": "Five Al Jazeera employees have been killed in an Israeli strike in Gaza - including a journalist who feared he was going to be assassinated. Anas al Sharif died alongside four of his colleagues from the network: Mohammed Qreiqeh, Ibrahim Zaher, Mohammed Noufal and Moamen Aliwa. The Committee to Protect Journalists (CPJ) had recently expressed \"grave\" concerns about al Sharif's safety, and claimed he was \"being targeted by an Israeli military smear campaign\". Israel Defence Forces confirmed the strike - and alleged al Sharif was a \"terrorist\" who \"served as the head of a terrorist cell in the Hamas terrorist organisation\". It claimed he was \"responsible for advancing rocket attacks against Israeli civilians and IDF troops\". In a statement, Al Jazeera called it a \"targeted assassination\" - and \"yet another blatant and premeditated attack on press freedom\". Last month, al Sharif said he lived with \"the feeling that I could be bombed and martyred at any moment\" because his coverage of Israel's operations \"harms them and damages their image in the world\". As of 5 August, at least 186 journalists and media workers have been killed in Gaza - but foreign reporters have been barred from covering the war independently since the latest conflict began in 2023. The Hamas-run government has described Israel's killing of these five Al Jazeera journalists as \"brutal and heinous\". A statement added: \"The assassination was premeditated and deliberate, following a deliberate, direct targeting of the journalists' tent near al Shifa Hospital in Gaza City. \"The targeting of journalists and media institutions by Israeli aircraft is a full-fledged war crime aimed at silencing the truth and obliterating the traces of genocidal crimes.\" Read more:Netanyahu vows to defeat HamasUK joins four countries in condemning Israel's plan for new Gaza operation  Following Anas al Sharif's death, a post described as his \"last will and testament\" was posted on X. It read: \"If these words of mine reach you, know that Israel has succeeded in killing me and silencing my voice.\" The 28-year-old added that he laments being able to fulfil his dream of seeing his son and daughter grow up - and alleged he had witnessed children \"crushed by thousands of tonnes of Israeli bombs and missiles\". \"Do not forget Gaza ... and do not forget me in your prayers for forgiveness and acceptance,\" he wrote. The CPJ reported that his father was killed by an Israeli airstrike on their family home in December 2023 after the journalist received telephone threats from Israeli army officers instructing him to cease coverage. Israel shut down the Al Jazeera television network in the country in May last year."
    },
    {
        "title": "Israel's PM tries to get on front foot in propaganda war he knows he is losing",
        "description": "Israel's prime minister added more detail to his deeply controversial plans for military escalation in Gaza at a news conference with foreign media yesterday - despite the condemnation of the UN Security Council, which met in an emergency session and urged him to rethink.",
        "url": "https://news.sky.com/story/defiant-netanyahu-sets-out-plan-for-military-escalation-in-gaza-and-describes-photographs-of-starving-babies-as-fake-news-13409910",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-israel-netanyahu_6987755.jpg?20250811005415",
        "type": "Home",
        "Author": "Diana Magnay",
        "Date Published": "2025-08-10 23:49:00",
        "Headline": "At a news briefing on Sunday, the Israeli prime minister added more detail to his deeply controversial plans for military escalation in Gaza. ",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n  Israel's prime minister added more detail to his deeply controversial plans for military escalation in Gaza at a news conference with foreign media yesterday - despite the condemnation of the UN Security Council, which met in an emergency session and urged him to rethink. Benjamin Netanyahu spoke of a \"fairly short timetable\" to establish designated \"safe zones\" for the one million or so set to be displaced from Gaza City. He also vowed to seize and dismantle Hamas's final strongholds there - in the central refugee camps, and in al Mawasi, along Gaza's southwestern coast.  This, per Netanyahu, is the only way to destroy the terror group, which he claimed \"subjugates Gazans, steals their food and shoots them when they try to move to safety\". Al Mawasi is already home to a significant displaced population, most of whom live in tents cramped up against the Mediterranean Sea, in what is already a designated humanitarian zone. If members of Hamas live among them, rooting them out will be hugely complicated and will involve significant civilian casualties. If the residents of Gaza City can't evacuate south to al Mawasi, where will they go? Netanyahu's plan is to set up more aid distribution sites through the controversial Gaza Humanitarian Foundation (GHF) and to flood Gaza with food. \n                  Desperation only grows in Gaza, as crowds swell at protests in Israel\n                 \n                  Does Netanyahu want a 'forever war' in Gaza? \n                 \n                  Has Trump broken from Netanyahu over Gaza?\n                 He claimed his policy was not one of forced starvation - describing particular photos of starving babies as \"fake news\", and accusing the media of painting a false picture. \"The only ones who are being deliberately starved in Gaza are our hostages,\" the prime minister claimed.  I asked Netanyahu how he would go about preventing the kinds of daily killings taking place at aid distribution points in the months since GHF has been operating. Doctors Without Borders has described these incidents as deliberately orchestrated. The prime minister said increasing the amount of aid heading into the Strip was the answer. \"And by the way, a lot of the firing was done by Hamas seeking to have a response by our forces,\" he added. \"And very often they didn't, they held back. They stayed their own fire even though their own lives were on the line.\" Read more:Israeli soldier dies by suicideThe danger of aid airdrops revealed   This was Israel's prime minister trying to get on the front foot in a propaganda war he acknowledged he was losing. He was loath to admit the presence of famine in Gaza. It took two questions before he acknowledged there was \"deprivation\", even if he would not be drawn on whether his 11-week total blockade of the strip earlier this year had played any role. He recognises that the appalled response of the international community to the human cost of this war, and the accusations of war crimes and genocide which Israel so vehemently rejects, are a terrible look. This was his attempt to reclaim the narrative."
    },
    {
        "title": "More than 500 people arrested after Palestine Action protest - with almost half aged 60 and above",
        "description": "The number of people arrested after a protest in London on Saturday supporting banned group Palestine Action has risen to 532, police have said.",
        "url": "https://news.sky.com/story/more-than-500-people-arrested-after-palestine-action-protest-with-about-a-half-aged-60-and-above-13409747",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-palestine-action-rally_6987411.jpg?20250810160219",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-10 14:47:00",
        "Headline": "Some 522 arrests were for displaying a placard in support of a proscribed organisation contrary to Section 13 of the Terrorism Act 2000. As of 9pm on Saturday, the number was put at 466.",
        "Content": " The number of people arrested after a protest in London on Saturday supporting banned group Palestine Action has risen to 532, police have said. Around half of them (259) were aged 60 and above - including almost 100 people who were in their 70s. Some 522 arrests were for displaying a placard in support of a proscribed organisation contrary to Section 13 of the Terrorism Act 2000, according to the Metropolitan Police. War in Gaza latest As of 9pm on Saturday, the number was put at 466. Hundreds of people attended the demonstration in Parliament Square, organised by Defend Our Juries, with the Metropolitan Police warning it would arrest anyone expressing backing for Palestine Action. Membership of, or support for, Palestine Action is a criminal offence punishable by up to 14 years in prison under the Terrorism Act. In a post on X shortly after 6.45pm on Sunday, Defend Our Juries said every person arrested in the square had been released from police custody, and that none had been charged. One of the arrests took place as the Palestine Coalition march formed in Russell Square, while 521 were at the protest. Of those arrested, the biggest number (147) was in the 60-69 age group, while 97 people were aged between 70 and 79, and 15 others were between 80-89. Six were aged 17-19, sixty-five were in the 20-29 age group, 55 were aged 30-39, 45 were aged 40-49 and 89 were in the 50-59 age group. The average age of those arrested was 54, while some 263 of those arrested were male, 261 were female and eight either defined themselves as non-binary or did not disclose their gender. Among the arrests, six were for assaults on officers (none were seriously injured), one was for \"obstructing a constable in the execution of his/her duty\", two were for breaching Section 14 Public Order Act conditions, and one was for a racially aggravated public order offence. Anyone who was arrested as part of the operation was taken to one of two prisoner processing points in the Westminster area. Those whose details could be confirmed were released on bail to appear at a police station at a future date. They were given conditions not to attend future demonstrations related to Palestine Action. Those who refused to provide their details at the prisoner processing points and those who were found to have been arrested while already on bail, were taken to one of a number of Met Police custody suites. Read more from Sky News:Four members of UK family die in Portugal crashUK bracing for another heatwave Charity Amnesty International described the mass arrests under UK terrorism law as \"deeply concerning\". The crowd, sat on the grass inside Parliament Square, could be seen writing \"I oppose genocide, I support Palestine Action\" on white placards at 1pm, with the vast majority remaining silent. Meanwhile on Sunday, hundreds of people joined a march on Downing Street to urge the release of those being held in Gaza by Palestinian militant group Hamas. A scuffle broke out after at least two men shouted \"Free Palestine\" in front of the march. One man was seen being bundled to the ground close to Trafalgar Square after being surrounded by around a dozen people. Another man was seen being moved away by police officers after he began shouting."
    },
    {
        "title": "Huge fire breaks out on Edinburgh landmark Arthur's Seat",
        "description": "A huge fire has broken out on Arthur's Seat with flames and smoke visible from across Edinburgh.",
        "url": "https://news.sky.com/story/huge-fire-breaks-out-on-edinburgh-landmark-arthurs-seat-13409787",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-edinburgh-fire_6987621.jpg?20250810195658",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-10 16:16:00",
        "Headline": "The Scottish Fire and Rescue Service said on Sunday afternoon that crews are in attendance at the blaze.",
        "Content": " A huge fire has broken out on Arthur's Seat with flames and smoke visible from across Edinburgh. The Scottish Fire and Rescue Service (SFRS) said on Sunday afternoon that crews were in attendance at the blaze. The service it was alerted to the fire at 4.05pm on Sunday, adding that it is \"affecting a large area of gorse\", a type of shrub. It said four appliances and specialist resources are at the scene. Arthur's Seat is in Holyrood Park, just a short distance from Edinburgh's historic Old Town, and climbing the hill to enjoy views of the city is a popular activity for tourists and locals alike. Reports suggest people could be seen running to safety as the fire spread. Police Scotland has advised motorists and pedestrians to avoid the area. \n                  Oasis gig at Murrayfield in Edinburgh beats Taylor Swift for most 'ground-shaking' concert\n                 \n                  Jewish comedian Rachel Creeger says she has new venue for Edinburgh Fringe show\n                 \n                  Why the Oasis reunion tour is 'catastrophic' for Edinburgh Fringe performers \n                 The cause of the blaze is currently unclear. \"There are no reported casualties at this time and crews remain at the scene,\" an SFRS spokesperson said on Sunday evening. Edinburgh is especially busy this month thanks to the return of annual festivals including the Fringe. This weekend has also seen Oasis fans descend on the Scottish capital as Liam and Noel Gallagher's band performed two nights at Murrayfield stadium."
    },
    {
        "title": "Benjamin Netanyahu vows to defeat Hamas as he condemns 'global campaign of lies' over starving Gazans",
        "description": "Benjamin Netanyahu has said Israel has \"no choice but to finish the job\" against Hamas due to the militant group's \"refusal to lay down its arms\".",
        "url": "https://news.sky.com/story/benjamin-netanyahu-vows-to-defeat-hamas-as-he-condemns-global-campaign-of-lies-over-starving-gazans-13409732",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-netanyahu-israel_6987378.jpg?20250810154142",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-10 14:37:00",
        "Headline": "The Israeli PM also repeated the allegation that Hamas has been looting aid trucks and claimed uncollected food has been \"rotting\" at the border, blaming the UN for not distributing it. ",
        "Content": " Benjamin Netanyahu has said Israel has \"no choice but to finish the job\" against Hamas due to the militant group's \"refusal to lay down its arms\". The Israeli prime minister made the comment in a news briefing for foreign journalists on Sunday, where he also denied starving Gazans and claimed there is a \"global campaign of lies\" against Israel. \"Given Hamas's refusal to lay down its arms, Israel has no choice but to finish the job and complete the defeat of Hamas,\" he said. Gaza latest: UK condemns Israel's plan to expand its military operation  Mr Netanyahu said there are \"two remaining [Hamas] strongholds\" in Gaza that he intends to \"dismantle\", claiming this is \"the best way to end the war\". Israel's security cabinet approved a full military takeover of Gaza City on Friday. It already controls around 75% of Gaza and has largely sealed its borders. Mr Netanyahu also addressed global concerns about a lack of aid being allowed into Gaza - alleging some photographs of starving children are fake. The Israeli leader said: \"The purpose of this news conference is to puncture the lies and spread the truth.\" Singling out three recent photographs, Mr Netanyahu claimed the Gazan children in them appear emaciated because they have medical conditions. \"I'm looking right now into the possibility of a governmental suit against the New York Times because this is outrageous,\" he said. Many aid organisations have said the enclave is on the verge of famine and Palestinian officials recently said at least 100 people have died of malnutrition, including 80 children. Mr Netanyahu said: \"If we had a starvation policy, no one in Gaza would have survived after two years of war.\" He also repeated the allegation that Hamas has been looting aid trucks and claimed uncollected food has been \"rotting\" at the border, blaming the UN for not distributing it. Responding to a question from Sky News international correspondent Diana Magnay, Mr Netanyahu said \"hundreds\" of aid trucks are entering Gaza to relieve \"deprivation\". He said the price of food in Gaza is now \"plummeting\" due to Israel's \"humanitarian surge\". The Israeli prime minister called on other countries to carry out more aid drops, despite the United Nations condemning them as dangerous. IDF to 'bring foreign journalists' into Gaza, Israeli PM says Mr Netanyahu claimed \"more foreign journalists\" are going to be let into Gaza. Israel has largely banned foreign journalists from going into the enclave for the length of its war against Hamas, aside from on just a handful of occasions, when Israeli soldiers have accompanied reporters. \"We have decided and I've ordered and directed the military to bring in foreign journalists, more foreign journalists, a lot. There's a problem of assuring security, but I think it can be done,\" Mr Netanyahu said. But he seemed to suggest the military would accompany journalists - who have been pushing for unsupervised access to the Gaza Strip. Read more:Gaza seen from aboveIsraeli soldier dies by suicide  The war in Gaza began on 7 October 2023 when Hamas killed about 1,200 people - mostly civilians - and abducted 251 others in its attack. Most of the hostages have been released in ceasefires or other deals. It is believed Hamas is still holding 50 captives, with 20 believed to be alive. Israel's retaliatory offensive has killed more than 61,000 Palestinians, according to Gaza's Hamas-run health ministry, which does not differentiate between militants and civilians in its count."
    },
    {
        "title": "Man dies after tractor drives through field and crashes into parked cars",
        "description": "A man has died after a tractor drove across fields and crashed into parked cars after a vintage car show in Gloucestershire.",
        "url": "https://news.sky.com/story/man-dies-after-tractor-drives-through-field-and-crashes-into-parked-cars-13409554",
        "image_url": "https://e3.365dm.com/23/03/1920x1080/skynews-police-tape-cordon_6091628.jpg?20230317102817",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-10 08:38:00",
        "Headline": "A man in his 20s, believed to have been driving the tractor, was arrested on suspicion of causing death by dangerous driving and driving while unfit through alcohol, police said.",
        "Content": "A man has died after a tractor drove across fields and crashed into parked cars after a vintage car show in Gloucestershire. Emergency services were called to the site of the Severn Vale Vintage Club annual show in Fiddington, near Tewkesbury, at 11.25pm on Saturday. A man in his 50s was pronounced dead at the scene, while a passenger sustained \"serious injuries\" and was given first aid by a member of the public, Gloucestershire Police said. The man's next of kin has been informed. A man in his 20s, believed to have been driving the tractor, was arrested on suspicion of causing death by dangerous driving and driving while unfit through alcohol, the force said in a statement. The car show was cancelled on Sunday as a result of the incident, according to its website."
    },
    {
        "title": "More than 500 people arrested after Palestine Action protest - with almost half aged 60 and above",
        "description": "The number of people arrested after a protest in London on Saturday supporting banned group Palestine Action has risen to 532, police have said.",
        "url": "https://news.sky.com/story/more-than-500-people-arrested-after-palestine-action-protest-with-about-a-half-aged-60-and-above-13409747",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-palestine-action-rally_6987411.jpg?20250810160219",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-10 14:47:00",
        "Headline": "Some 522 arrests were for displaying a placard in support of a proscribed organisation contrary to Section 13 of the Terrorism Act 2000. As of 9pm on Saturday, the number was put at 466.",
        "Content": " The number of people arrested after a protest in London on Saturday supporting banned group Palestine Action has risen to 532, police have said. Around half of them (259) were aged 60 and above - including almost 100 people who were in their 70s. Some 522 arrests were for displaying a placard in support of a proscribed organisation contrary to Section 13 of the Terrorism Act 2000, according to the Metropolitan Police. War in Gaza latest As of 9pm on Saturday, the number was put at 466. Hundreds of people attended the demonstration in Parliament Square, organised by Defend Our Juries, with the Metropolitan Police warning it would arrest anyone expressing backing for Palestine Action. Membership of, or support for, Palestine Action is a criminal offence punishable by up to 14 years in prison under the Terrorism Act. In a post on X shortly after 6.45pm on Sunday, Defend Our Juries said every person arrested in the square had been released from police custody, and that none had been charged. One of the arrests took place as the Palestine Coalition march formed in Russell Square, while 521 were at the protest. Of those arrested, the biggest number (147) was in the 60-69 age group, while 97 people were aged between 70 and 79, and 15 others were between 80-89. Six were aged 17-19, sixty-five were in the 20-29 age group, 55 were aged 30-39, 45 were aged 40-49 and 89 were in the 50-59 age group. The average age of those arrested was 54, while some 263 of those arrested were male, 261 were female and eight either defined themselves as non-binary or did not disclose their gender. Among the arrests, six were for assaults on officers (none were seriously injured), one was for \"obstructing a constable in the execution of his/her duty\", two were for breaching Section 14 Public Order Act conditions, and one was for a racially aggravated public order offence. Anyone who was arrested as part of the operation was taken to one of two prisoner processing points in the Westminster area. Those whose details could be confirmed were released on bail to appear at a police station at a future date. They were given conditions not to attend future demonstrations related to Palestine Action. Those who refused to provide their details at the prisoner processing points and those who were found to have been arrested while already on bail, were taken to one of a number of Met Police custody suites. Read more from Sky News:Four members of UK family die in Portugal crashUK bracing for another heatwave Charity Amnesty International described the mass arrests under UK terrorism law as \"deeply concerning\". The crowd, sat on the grass inside Parliament Square, could be seen writing \"I oppose genocide, I support Palestine Action\" on white placards at 1pm, with the vast majority remaining silent. Meanwhile on Sunday, hundreds of people joined a march on Downing Street to urge the release of those being held in Gaza by Palestinian militant group Hamas. A scuffle broke out after at least two men shouted \"Free Palestine\" in front of the march. One man was seen being bundled to the ground close to Trafalgar Square after being surrounded by around a dozen people. Another man was seen being moved away by police officers after he began shouting."
    },
    {
        "title": "Four members of UK family die in crash on holiday in Portugal",
        "description": "Four members of a UK family have died in a car crash while they were on holiday in Portugal.",
        "url": "https://news.sky.com/story/four-members-of-uk-family-die-in-crash-on-holiday-in-portugal-13409543",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-serrano-family-thetford_6987141.jpg?20250810114323",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-10 07:51:00",
        "Headline": "A mother, father and their twin sons died when the car they were travelling in collided with another vehicle near Faro in southern Portugal. Two other people died in the crash, including the 19-year-old girlfriend of one of the sons.",
        "Content": "Four members of a UK family have died in a car crash while they were on holiday in Portugal. Domingos Serrano, 55, Maria Serrano, 51, and their twin sons Domingos and Afonso, both 20, died when the car they were travelling in collided with another vehicle in Castro Verde, southern Portugal, according to the Municipal Council for Mourao. Two others died in the crash - the 19-year-old girlfriend of one of the sons, and the 26-year-old driver of the other car, its statement added. The Serrano family were living in Thetford, Norwich, but were not British nationals, Sky News understands. They were travelling from Faro to Mourao for their \"usual and deserved vacation\", according to the Mourao authorities, who declared two days of mourning. In a statement, they said: \"In the car there were four occupants, of Mouranese nature, and a young woman with affinity to the family. \"Residents in England, follow from Faro to Mourão, for the usual and deserved vacation. \"It is with great regret that the Municipality announces this information, offering its condolences to the families and friends of the victims.\" Read more from Sky NewsMan dies after tractor driven into carsHorse rider dies after falling at competitionThree arrested after two drive in crash 'Massive void' Thetford Town Youth Football Club paid tribute to the family in a Facebook post, confirming the twins played for the team. \"Thetford Town Football Club would like to pass on our sincere condolences to the Serrano family and the local Portuguese community after the recent tragedy while on holiday,\" it read. \"Afonso and [Domingos] were both an integral part of our U18's team in recent years, both brothers sadly passed away in Portugal with their parents and friends in a tragic car accident. \"The loss of this lovely family will leave a massive void in the local community.\""
    },
    {
        "title": "Prince Harry considering starting new charity after Sentebale row",
        "description": "Prince Harry is considering starting a new charity after a highly-publicised dispute saw him exit his Sentebale charity, a spokesperson has said.",
        "url": "https://news.sky.com/story/prince-harry-considering-starting-new-charity-after-sentebale-row-13409887",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-harry-sussex_6987649.jpg?20250810203012",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-10 19:08:00",
        "Headline": "A public war of words has played out since the Duke of Sussex quit as a patron of Sentebale in March, amid a battle between the board chairwoman and trustees. ",
        "Content": "Prince Harry is considering starting a new charity after a highly-publicised dispute saw him exit his Sentebale charity, a spokesperson has said. The Duke of Sussex stepped down as a Sentebale patron in March in support of trustees who resigned in opposition to the board chairwoman, Dr Sophie Chandauka, who previously accused Harry of bullying and harassment - claims a source close to the former trustees described as \"completely baseless\". Sentebale works to support the health and wellbeing of young people, especially those with HIV and AIDS, in Botswana and Lesotho.   It was co-founded by Harry and Prince Seeiso of Lesotho in 2006. Seeiso also stepped down as patron in March. In a report published on Tuesday, the Charity Commission criticised all sides for making the fallout public with interviews and statements, but the war of words has continued.  On Sunday, a spokesperson for Harry said: \"The duke remains absolutely committed to continuing the work he started, supporting the children and young people of Lesotho and Botswana, nearly 20 years ago. \"In what form that support takes - no decisions have been made. \"All options remain on the table; whether that be starting a new charity or working to support pre-existing charities operating in the same sector in the region.\" The charity regulator, which cannot investigate individual allegations of bullying, said it found no evidence of systemic bullying or harassment at Sentebale, including misogyny or misogynoir. The trustees who resigned said in a statement they were \"gravely concerned for the future of the charity\" as they felt the commission had \"chosen to ignore key concerns and irrefutable evidence raised with them regarding the leadership and oversight of Sentebale's chair\". Read more:Harry's charity row explainedDuke follows in Diana's footsteps In response to the findings, Sentebale said in a statement: \"The Charity Commission is explicitly clear, including in its public guidance, that it is not the commission's responsibility to adjudicate or mediate internal disputes. This would include individual allegations of bullying, harassment, misogyny, misogynoir etc. \"As a result, the commission has not investigated any individual allegations and therefore has not made any findings in relation to individuals, including Prince Harry. \"The issues not investigated by the commission can and may be dealt with through avenues more appropriate than the commission.\""
    },
    {
        "title": "Huge fire breaks out on Edinburgh landmark Arthur's Seat",
        "description": "A huge fire has broken out on Arthur's Seat with flames and smoke visible from across Edinburgh.",
        "url": "https://news.sky.com/story/huge-fire-breaks-out-on-edinburgh-landmark-arthurs-seat-13409787",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-edinburgh-fire_6987621.jpg?20250810195658",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-10 16:16:00",
        "Headline": "The Scottish Fire and Rescue Service said on Sunday afternoon that crews are in attendance at the blaze.",
        "Content": " A huge fire has broken out on Arthur's Seat with flames and smoke visible from across Edinburgh. The Scottish Fire and Rescue Service (SFRS) said on Sunday afternoon that crews were in attendance at the blaze. The service it was alerted to the fire at 4.05pm on Sunday, adding that it is \"affecting a large area of gorse\", a type of shrub. It said four appliances and specialist resources are at the scene. Arthur's Seat is in Holyrood Park, just a short distance from Edinburgh's historic Old Town, and climbing the hill to enjoy views of the city is a popular activity for tourists and locals alike. Reports suggest people could be seen running to safety as the fire spread. Police Scotland has advised motorists and pedestrians to avoid the area. \n                  Oasis gig at Murrayfield in Edinburgh beats Taylor Swift for most 'ground-shaking' concert\n                 \n                  Jewish comedian Rachel Creeger says she has new venue for Edinburgh Fringe show\n                 \n                  Why the Oasis reunion tour is 'catastrophic' for Edinburgh Fringe performers \n                 The cause of the blaze is currently unclear. \"There are no reported casualties at this time and crews remain at the scene,\" an SFRS spokesperson said on Sunday evening. Edinburgh is especially busy this month thanks to the return of annual festivals including the Fringe. This weekend has also seen Oasis fans descend on the Scottish capital as Liam and Noel Gallagher's band performed two nights at Murrayfield stadium."
    },
    {
        "title": "Electronic tags and 'tougher' unpaid work will reduce prison overcrowding, govt claims ",
        "description": "Increases in the use of electronic tagging and \"toughening up\" unpaid work will help reduce prison overcrowding, according to the Ministry of Justice.",
        "url": "https://news.sky.com/story/electronic-tags-and-tougher-unpaid-work-will-reduce-prison-overcrowding-govt-claims-13409495",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-train-unpaid-work_6987015.jpg?20250810030959",
        "type": "UK",
        "Author": "Frazer Maude",
        "Date Published": "2025-08-10 00:11:00",
        "Headline": "At a railway near Peterborough, offenders help re-lay track. It's hard work - and the supervisor thinks that's part of why those assigned to the project don't often end up there twice.",
        "Content": "\n          North of England correspondent\n              @frazeratsky\n  Increases in the use of electronic tagging and \"toughening up\" unpaid work will help reduce prison overcrowding, according to the Ministry of Justice. The independent review of the current sentencing framework published in February called for an increased focus on utilising punishment outside of prison to reduce reoffending, freeing up capacity in jails. In response, Justice Secretary Shabana Mahmood says she's determined to toughen community punishment - and make sure unpaid work truly pays back communities harmed by crime. The work done by offenders at the Nene Valley Railway near Peterborough is certainly tough. A group of low to medium-risk offenders have been sent to help re-lay track for the charity that runs the heritage railway, famous for being home to the engine that inspired Rev W Awdry's Thomas The Tank Engine. \"We've been working with the probation service for over 20 years,\" says Michael Purcell, chair of the Nene Valley Railway. \"Most of the work here is done by volunteers, and many of them are quite old. \"So to have a team of younger workers that can come here and do the physical work under an experienced supervisor as a community service is massively helpful to us.\" Visually, there are echoes of the prison chain gangs of old. But the hard labour involved in this unpaid work is very much a part of contemporary plans to reduce reoffending. The Ministry of Justice says its analysis indicates that community-based sentences are more effective at reducing reoffending than custodial sentences lasting under a year. Supervising the work on the railway is Michael Barry, who believes the hard work gives the offenders on the programme a feeling of achievement. \"You do notice that the men and women who come to work here don't tend to come back,\" Mr Berry explains. \"I've been supervising groups here for 20 years, and many of the offenders who have worked here seem to have gone back to working. \"So I do believe it helps people return to work after offending.\" Read more from Sky News:Hundreds detained at Palestine Action protestCrews battle wildfire near BournemouthSecond arrest after man found dead on bench The MoJ says being tough on crime means always having the prison capacity to incarcerate the most dangerous offenders. And it says that as well as \"toughening up\" unpaid work, probation funding will be increased by up to £700m (nearly 45%), allowing it to \"substantially boost\" the number of offenders on electronic monitoring. The MoJ has also said an increase in the use of curfews and exclusion zones, where offenders are prohibited from visiting certain areas, will help reduce prison overcrowding. A spokesperson added: \"Offenders should be made to give back to the communities they've harmed. That is why we are toughening up unpaid work as a punishment so it can continue to act as a deterrent and make our streets safer. \"Projects like Nene Valley are a great example of how hard work ensures offenders pay for their crimes. We want to see more projects like this and are talking with councils and businesses to put more offenders to work.\""
    },
    {
        "title": "Prince Andrew has no public future - and lack of royal status 'annoys him', author claims",
        "description": "The author of a new book about Prince Andrew has called for \"more accountability from the Royal Family and more transparency\" after encountering what he claims was considerable secrecy while researching his book.",
        "url": "https://news.sky.com/story/author-of-new-prince-andrew-book-what-most-annoys-him-is-his-lack-of-a-royal-status-13409503",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-prince-andrew-easter-sunday_6891672.jpg?20250810043136",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-10 03:21:00",
        "Headline": "Andrew Lownie's new book - Entitled: The Rise And Fall Of The House Of York - comes as polls suggest Prince Andrew is the most unpopular royal in the country.",
        "Content": "The author of a new book about Prince Andrew has called for \"more accountability from the Royal Family and more transparency\" after encountering what he claims was considerable secrecy while researching his book. Andrew Lownie has spent four years working on Entitled: The Rise And Fall Of The House Of York - a book unauthorised by Prince Andrew - and submitted hundreds of Freedom of Information requests to government departments. However, he has revealed to Sky News that all of his applications for information about Prince Andrew and his official work were knocked back. The royal household and the royal archive are already exempt from FOI requests. Speaking ahead of the book's publication, which has already attracted considerable attention because of more lurid claims about the duke, Mr Lownie told Sky News: \"Clearly there are details that people have picked up on and run with. And you know, that's inevitable in these sort of books.\" But he added: \"If they're to earn our trust and support, they have to show that they are not hiding things - that they are behaving well.\" Mr Lownie said he was given a catalogue of reasons by the likes of the Foreign Office and the Department for Business and Trade as to why they couldn't help with information about Prince Andrew's public work as a trade envoy in the 2000s. Sky News was shown a selection of those response letters. \"They blame everything from security reasons, to cost and man hours, to data protection, to my questions being too broad,\" the author said. But Mr Lownie believes it's in the interest of the Windsors to be more open if they want to guarantee long-term backing from the public, and he hopes his book may trigger more calls for greater transparency. Read more UK news:Met Police make 'most arrests in a decade' at protestMajor incident as crews battle wildfire near Bournemouth It comes as a new YouGov report found that Prince Andrew remains the most unpopular royal in the country, with 87% of people having a negative view of him. According to the survey, just 5% of people have a favourable view of the Duke of York. The poll also found the royals are less popular with a younger audience. Only 36% of 18 to 24-years-olds believe the monarchy is good for the country, compared with about 60% of Britons overall. The generational difference is underlined given 81% of over-65s think Britain should continue to have a monarchy, but this falls with each age group to just 41% of 18 to 24s. Stories about Prince Andrew continue to attract a huge amount of attention and regularly still make him a difficult distraction for the Royal Family. Mr Lownie says he got no sense of any appetite to reintroduce him into public life while doing his research. \"I don't think he has any public future. I would say his private future is pretty limited too. I mean, he lives in Royal Lodge [on the Windsor Estate], he plays golf, watches TV, and presumably sees his grandchildren ... he's living the life of a retired man.\" But according to one member of staff, the removal of his royal and military titles has stung more than Prince Andrew has publicly shown. \"What most annoys him is his lack of a royal status,\" Mr Lownie added. \"That's what really sort of gave him his whole sense of identity. And that's, you know, it's not being able to put on his uniforms and strut around and being self-important.\" Buckingham Palace has not made any comments on the book as the Duke of York is no longer a working royal. Sky News approached the Duke of York's office but received no response."
    },
    {
        "title": "Israel kills journalist it claims was a Hamas 'terrorist'",
        "description": "Five Al Jazeera employees have been killed in an Israeli strike in Gaza - including a journalist who feared he was going to be assassinated.",
        "url": "https://news.sky.com/story/journalist-killed-in-israeli-strike-feared-his-own-assassination-as-idf-claims-he-was-a-terrorist-13409945",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sharif-gaza_6987707.jpg?20250810221948",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-10 22:29:00",
        "Headline": "Anas al Sharif, 28, died alongside four of his colleagues from the Al Jazeera network.",
        "Content": "Five Al Jazeera employees have been killed in an Israeli strike in Gaza - including a journalist who feared he was going to be assassinated. Anas al Sharif died alongside four of his colleagues from the network: Mohammed Qreiqeh, Ibrahim Zaher, Mohammed Noufal and Moamen Aliwa. The Committee to Protect Journalists (CPJ) had recently expressed \"grave\" concerns about al Sharif's safety, and claimed he was \"being targeted by an Israeli military smear campaign\". Israel Defence Forces confirmed the strike - and alleged al Sharif was a \"terrorist\" who \"served as the head of a terrorist cell in the Hamas terrorist organisation\". It claimed he was \"responsible for advancing rocket attacks against Israeli civilians and IDF troops\". In a statement, Al Jazeera called it a \"targeted assassination\" - and \"yet another blatant and premeditated attack on press freedom\". Last month, al Sharif said he lived with \"the feeling that I could be bombed and martyred at any moment\" because his coverage of Israel's operations \"harms them and damages their image in the world\". As of 5 August, at least 186 journalists and media workers have been killed in Gaza - but foreign reporters have been barred from covering the war independently since the latest conflict began in 2023. The Hamas-run government has described Israel's killing of these five Al Jazeera journalists as \"brutal and heinous\". A statement added: \"The assassination was premeditated and deliberate, following a deliberate, direct targeting of the journalists' tent near al Shifa Hospital in Gaza City. \"The targeting of journalists and media institutions by Israeli aircraft is a full-fledged war crime aimed at silencing the truth and obliterating the traces of genocidal crimes.\" Read more:Netanyahu vows to defeat HamasUK joins four countries in condemning Israel's plan for new Gaza operation  Following Anas al Sharif's death, a post described as his \"last will and testament\" was posted on X. It read: \"If these words of mine reach you, know that Israel has succeeded in killing me and silencing my voice.\" The 28-year-old added that he laments being able to fulfil his dream of seeing his son and daughter grow up - and alleged he had witnessed children \"crushed by thousands of tonnes of Israeli bombs and missiles\". \"Do not forget Gaza ... and do not forget me in your prayers for forgiveness and acceptance,\" he wrote. The CPJ reported that his father was killed by an Israeli airstrike on their family home in December 2023 after the journalist received telephone threats from Israeli army officers instructing him to cease coverage. Israel shut down the Al Jazeera television network in the country in May last year."
    },
    {
        "title": "Israel's PM tries to get on front foot in propaganda war he knows he is losing",
        "description": "Israel's prime minister added more detail to his deeply controversial plans for military escalation in Gaza at a news conference with foreign media yesterday - despite the condemnation of the UN Security Council, which met in an emergency session and urged him to rethink.",
        "url": "https://news.sky.com/story/defiant-netanyahu-sets-out-plan-for-military-escalation-in-gaza-and-describes-photographs-of-starving-babies-as-fake-news-13409910",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-israel-netanyahu_6987755.jpg?20250811005415",
        "type": "World",
        "Author": "Diana Magnay",
        "Date Published": "2025-08-10 23:49:00",
        "Headline": "At a news briefing on Sunday, the Israeli prime minister added more detail to his deeply controversial plans for military escalation in Gaza. ",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n  Israel's prime minister added more detail to his deeply controversial plans for military escalation in Gaza at a news conference with foreign media yesterday - despite the condemnation of the UN Security Council, which met in an emergency session and urged him to rethink. Benjamin Netanyahu spoke of a \"fairly short timetable\" to establish designated \"safe zones\" for the one million or so set to be displaced from Gaza City. He also vowed to seize and dismantle Hamas's final strongholds there - in the central refugee camps, and in al Mawasi, along Gaza's southwestern coast.  This, per Netanyahu, is the only way to destroy the terror group, which he claimed \"subjugates Gazans, steals their food and shoots them when they try to move to safety\". Al Mawasi is already home to a significant displaced population, most of whom live in tents cramped up against the Mediterranean Sea, in what is already a designated humanitarian zone. If members of Hamas live among them, rooting them out will be hugely complicated and will involve significant civilian casualties. If the residents of Gaza City can't evacuate south to al Mawasi, where will they go? Netanyahu's plan is to set up more aid distribution sites through the controversial Gaza Humanitarian Foundation (GHF) and to flood Gaza with food. \n                  Desperation only grows in Gaza, as crowds swell at protests in Israel\n                 \n                  Does Netanyahu want a 'forever war' in Gaza? \n                 \n                  Has Trump broken from Netanyahu over Gaza?\n                 He claimed his policy was not one of forced starvation - describing particular photos of starving babies as \"fake news\", and accusing the media of painting a false picture. \"The only ones who are being deliberately starved in Gaza are our hostages,\" the prime minister claimed.  I asked Netanyahu how he would go about preventing the kinds of daily killings taking place at aid distribution points in the months since GHF has been operating. Doctors Without Borders has described these incidents as deliberately orchestrated. The prime minister said increasing the amount of aid heading into the Strip was the answer. \"And by the way, a lot of the firing was done by Hamas seeking to have a response by our forces,\" he added. \"And very often they didn't, they held back. They stayed their own fire even though their own lives were on the line.\" Read more:Israeli soldier dies by suicideThe danger of aid airdrops revealed   This was Israel's prime minister trying to get on the front foot in a propaganda war he acknowledged he was losing. He was loath to admit the presence of famine in Gaza. It took two questions before he acknowledged there was \"deprivation\", even if he would not be drawn on whether his 11-week total blockade of the strip earlier this year had played any role. He recognises that the appalled response of the international community to the human cost of this war, and the accusations of war crimes and genocide which Israel so vehemently rejects, are a terrible look. This was his attempt to reclaim the narrative."
    },
    {
        "title": "Desperation only grows in Gaza, as crowds swell at protests in Israel",
        "description": "As if life in Gaza wasn't hard enough, there is now a heatwave - compounding the problems of minimal water, food and the basics you need to keep a family alive.",
        "url": "https://news.sky.com/story/desperation-as-gaza-suffers-through-heatwave-and-a-sense-of-hopelessness-in-tel-aviv-13409496",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-composite_6987008.jpg?20250810015125",
        "type": "World",
        "Author": "Diana Magnay",
        "Date Published": "2025-08-10 00:31:00",
        "Headline": "In Tel Aviv, the crowds have swelled these past two Saturdays. One protester tells Sky News: \"I feel like a hostage in my own country, as though no one listens to me - 80% of the citizens don't want it anymore.\"",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n  As if life in Gaza wasn't hard enough, there is now a heatwave - compounding the problems of minimal water, food and the basics you need to keep a family alive. To keep your children halfway clean, when you've been displaced over and over again, forced to live under tarpaulin rammed up against your neighbours. \"We suffer greatly, especially because we live in tents,\" says Riham Akel, who was displaced from the north and now lives in Gaza City. \"They are made of cloth and plastic that do not protect us from the heat. In addition, there is no electricity, drinking water or water for washing, no fans or air conditioning.\" Given Israel's planned takeover of Gaza City - and the evacuation of the 800,000 or so people now living there - it's likely she'll be forced to move again. In Hostages Square in Tel Aviv, the crowds have swelled these past two Saturdays - almost doubling after Hamas published propaganda videos showing two of the remaining hostages starving in captivity - and now this week, Benjamin Netanyahu's decision to push ahead with full security control of the Gaza Strip. People here just want it to stop. Yael said: \"I feel like a hostage in my own country, as though no one listens to me - 80% of the citizens don't want it anymore.\" \"When you talk about the government it's not only Gaza,\" says David Solomon. \"They are trying to undermine the democracy in Israel, they're trying willingly to destroy the whole of Israel, they don't care just for another year or two of their survival.\" There are also calls for IDF soldiers to refuse to carry out Netanyahu's plan to take over Gaza City. Another major point of contention is what many see as the failure of the International Red Cross to bring food to the hostages. Food for the Palestinians in Gaza is not much discussed, except for a small group on the fringes. \"We believe that the Israeli public is ignorant on purpose,\" says Gilad Melzer - holding up a sign saying \"Stop Genocide\" with a photo of a starving child. \"Some of it wants to stay ignorant and some, the government wants to keep them ignorant of what is going on in Gaza and they're ignorant as well of what is going on in the occupied territories.\" Read more:UK condemns Israel's new operation in GazaWhy IDF likely faces an impossible taskLife and colour stripped from bustling port city  Benjamin Netanyahu seems to have made up his mind, though. He will ramp up the fight, despite international outcry, despite the opposition of his military leadership and despite the tens of thousands who rally each week in Hostages Square, hoping someone in government will bother to listen. There is a sense of hopelessness here - that the solidarity of numbers still makes so little difference."
    },
    {
        "title": "Gaza 'injured his soul': Israeli soldier died by suicide two days before he was due to return to duty",
        "description": "When your son is risking his life fighting in Gaza, you don't expect to hear news he's been killed on a rest period at home.",
        "url": "https://news.sky.com/story/he-never-left-gaza-in-his-mind-israeli-soldier-died-by-suicide-after-being-ordered-to-return-13409097",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-lockwood-eliran-mizrahi_6986550.jpg?20250809153039",
        "type": "World",
        "Author": "Sally Lockwood",
        "Date Published": "2025-08-10 01:27:00",
        "Headline": "Eliran's mother told Sky News her son returned from Gaza a changed man and she fears there will be many more suicides among Israeli soldiers.",
        "Content": "\n          Sky correspondent\n              @sallylockwood\n  When your son is risking his life fighting in Gaza, you don't expect to hear news he's been killed on a rest period at home. Eliran Mizrahi had served 187 days as a reservist in Gaza since 8 October, before he died by suicide in June last year. His mother Jenny has turned Eliran's childhood bedroom into a shrine. The 40-year-old's combat vest hanging on the wall still has sand in it from Gaza. The cap he was wearing when he died, sits just above it on a shelf laden with memories of his life. Israel is seeing a wave of soldiers like Eliran taking their own lives - five died by suicide just last month. IDF (Israel Defence Forces) investigations have found it is what they have seen and done in Gaza that are the cause, according to reports by the Israeli public broadcaster. Eliran's mother told Sky News her son returned from Gaza a changed man and she fears there will be many more suicides among Israeli soldiers. \"He never left Gaza in his mind,\" says Jenny. \"When he came back he couldn't go back to work. He was a great father with a lot of patience. And he lost his patience with his children, with people. \"He was very silent. He didn't sleep at night, he had nightmares. We didn't know anything about it. He didn't speak. Whenever we asked him he said everything is okay.\" Jenny describes Eliran as someone who was happy and friends with everyone. A father of four \"with a big heart\" and a big smile. But his experience of the war \"injured his soul\". Initially, he was deployed to clear bodies of people slaughtered by Hamas at the Nova Festival on 7 October and then deployed to Gaza a day later. Eliran was active on social media and shared videos of his time in Gaza. He was commander of a unit of D9 bulldozers that destroyed buildings and tunnel shafts. After his death, his D9 partner, Guy Zaken, told a parliamentary committee they were often shot at and they ran over hundreds of bodies. Yet they filmed themselves smiling and singing to send to their families. Eliran shared some of those videos on social media. Israel has levelled vast parts of Gaza. Eliran's actions were part of a systematic campaign the UN says has damaged or destroyed over 90% of Gaza's homes. Human rights experts warn this could be a war crime. Eliran was pulled out of Gaza after he sustained knee injuries in an RPG (rocket-propelled grenade) attack on his bulldozer. 'The bodies and the blood' He was later diagnosed with PTSD (post-traumatic stress disorder) - we don't know the cause of his trauma but in the end he couldn't live with it. Two days before he was due to return to active duty, he took his own life. \"What he saw over there in Gaza injured his soul. You see all the bodies over there and all the blood. It hurts your soul,\" says Eliran's mother. Israeli media is reporting at least 18 soldiers have taken their own lives so far this year. Thousands are suffering with PTSD. And more and more reservists are quietly refusing to turn up for duty. The IDF says supporting its service members is a top priority and it invests significant resources in doing so, including deploying mental health officers in all military units. Tuly Flint was one of those officers. A clinical social worker and expert in trauma therapy in his professional life, and a lieutenant colonel in the military reserves, he was deployed to offer psychological support to troops who served in Gaza. Last year, after treating many soldiers and becoming exposed to the extreme suffering of Gazans, Tuly came to the conclusion the war had no purpose and it was a crime against humanity. So he refused to continue to serve in the IDF. \"At the beginning of the war what we usually saw was simple PTSD. People who talk about the horrors they saw in the first few weeks with the massacre of Hamas,\" says Tuly. \"But since the second month of the war, people started talking about what takes place on the Palestinian side. \"Even people that were not talking about Palestinians' rights, or anything like that, they started talking about the fact that they saw bodies of children, of old people, of women.\" Read more from Sky News:Desperation in Gaza, and hopelessness in Tel AvivUK and allies condemns Israel's new Gaza operation 'You think, are they lying to me' I asked Tuly how soldiers feel hearing Benjamin Netanyahu's narrative that there is no starvation in Gaza - that the images we see are a lie. The Israeli military bears witness to what is happening in Gaza in a way most of the world, including international journalists, still can't. \"When you hear your government and your commanders telling things that are not true, you start thinking, are they lying to me also?\" says Tuly. \"When you hear your prime minister lying about things that you saw in Gaza, things that you did ... people talk about torching houses, people talk about a 'deadline' - not a metaphor - a deadline when people cross they will be killed no matter if they are children or women ... they see people starving and they also see the chaos.\"  After nearly two years of war, the human cost is weighing heavily on Israeli society. A majority of Israelis now believe that only a deal, not military pressure, will bring the remaining hostages home. And the humanitarian crisis unfolding just across the border is becoming a source of public unease. Former military and intelligence chiefs are also now against the war. The Commanders for Israel's Security group (CIS) has argued, in its professional judgement, \"Hamas no longer poses a strategic threat to Israel\" - and has written to Donald Trump asking him to compel Benjamin Netanyahu to end the war. Tuly Flint says there's an erosion of trust between soldiers and those leading them. \"When you come back home and you hear so many people - former chiefs of staff, former heads of the security bodies of Israel - saying 'this war has no aim anymore' ... you say to yourself: 'I hear from former chiefs of staff that I'm killing hostages by waging war and my government is still sending me there?' \"When you see the pictures that you've seen with your own eyes and your government says 'no this is a lie, no this is propaganda', this makes you distrust everyone. And when you distrust everyone, why would you ask for help?\" The mental and moral burden on soldiers could be about to grow. Despite strong objections from the IDF's chief of staff, Israel is expanding military operations in Gaza with plans to take control of the entire territory. We understand that references to suicide in any context can be difficult for some people. We provide details of support available from the Samaritans where any such references are included. You can find these here: call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Four members of UK family die in crash on holiday in Portugal",
        "description": "Four members of a UK family have died in a car crash while they were on holiday in Portugal.",
        "url": "https://news.sky.com/story/four-members-of-uk-family-die-in-crash-on-holiday-in-portugal-13409543",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-serrano-family-thetford_6987141.jpg?20250810114323",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-10 07:51:00",
        "Headline": "A mother, father and their twin sons died when the car they were travelling in collided with another vehicle near Faro in southern Portugal. Two other people died in the crash, including the 19-year-old girlfriend of one of the sons.",
        "Content": "Four members of a UK family have died in a car crash while they were on holiday in Portugal. Domingos Serrano, 55, Maria Serrano, 51, and their twin sons Domingos and Afonso, both 20, died when the car they were travelling in collided with another vehicle in Castro Verde, southern Portugal, according to the Municipal Council for Mourao. Two others died in the crash - the 19-year-old girlfriend of one of the sons, and the 26-year-old driver of the other car, its statement added. The Serrano family were living in Thetford, Norwich, but were not British nationals, Sky News understands. They were travelling from Faro to Mourao for their \"usual and deserved vacation\", according to the Mourao authorities, who declared two days of mourning. In a statement, they said: \"In the car there were four occupants, of Mouranese nature, and a young woman with affinity to the family. \"Residents in England, follow from Faro to Mourão, for the usual and deserved vacation. \"It is with great regret that the Municipality announces this information, offering its condolences to the families and friends of the victims.\" Read more from Sky NewsMan dies after tractor driven into carsHorse rider dies after falling at competitionThree arrested after two drive in crash 'Massive void' Thetford Town Youth Football Club paid tribute to the family in a Facebook post, confirming the twins played for the team. \"Thetford Town Football Club would like to pass on our sincere condolences to the Serrano family and the local Portuguese community after the recent tragedy while on holiday,\" it read. \"Afonso and [Domingos] were both an integral part of our U18's team in recent years, both brothers sadly passed away in Portugal with their parents and friends in a tragic car accident. \"The loss of this lovely family will leave a massive void in the local community.\""
    },
    {
        "title": "Mo Salah criticises UEFA tribute to 'Palestinian Pele' - and asks: 'Can you tell us how he died?'",
        "description": "Liverpool forward Mo Salah has criticised UEFA for not revealing how a footballer known as \"Palestinian Pele\" died as it paid tribute to him in a social media post.",
        "url": "https://news.sky.com/story/mo-salah-criticises-uefa-tribute-to-palestinian-pele-suleiman-al-obeid-13409501",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-salah-liverpool_6964109.jpg?20250713172909",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-10 03:13:00",
        "Headline": "UEFA had posted a tribute to al Obeid without mentioning reports that he was killed by an \"Israeli airstrike targeting civilians\" in Gaza.",
        "Content": "Liverpool forward Mo Salah has criticised UEFA for not revealing how a footballer known as \"Palestinian Pele\" died as it paid tribute to him in a social media post. The Palestine Football Association said on Wednesday that Suleiman al Obeid, 41, was killed by an \"Israeli airstrike targeting civilians\" while he waited for humanitarian aid in the southern Gaza Strip on Wednesday. In a brief post on the social media platform X on Friday, UEFA called the former national team member \"a talent who gave hope to countless children, even in the darkest of times\". Salah, an Egyptian forward who is a devout Muslim, responded: \"Can you tell us how he died, where, and why?\" UEFA has told Sky Sports it will not be commenting on the Liverpool footballer's post. Read more from Sky News:Hundreds detained at Palestine Action protestCrews battle wildfire near BournemouthSecond arrest after man found dead on bench Salah, one of the Premier League's biggest stars, is arguably the most prominent Arab sportsman in the world. He has previously advocated for humanitarian aid to be allowed into Gaza in the nearly two-year-old war.  The United Nations says more than 1,000 people have been killed near aid distribution sites and aid convoys in Gaza since the launch of the Gaza Humanitarian Foundation, a US and Israel-backed aid distribution system, in late May. In a tribute on its website, the Palestine Football Association said al Obeid had two sons and three daughters. It added that the footballer was born in Gaza City and played for clubs based in both Gaza and the West Bank."
    },
    {
        "title": "Benjamin Netanyahu vows to defeat Hamas as he condemns 'global campaign of lies' over starving Gazans",
        "description": "Benjamin Netanyahu has said Israel has \"no choice but to finish the job\" against Hamas due to the militant group's \"refusal to lay down its arms\".",
        "url": "https://news.sky.com/story/benjamin-netanyahu-vows-to-defeat-hamas-as-he-condemns-global-campaign-of-lies-over-starving-gazans-13409732",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-netanyahu-israel_6987378.jpg?20250810154142",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-10 14:37:00",
        "Headline": "The Israeli PM also repeated the allegation that Hamas has been looting aid trucks and claimed uncollected food has been \"rotting\" at the border, blaming the UN for not distributing it. ",
        "Content": " Benjamin Netanyahu has said Israel has \"no choice but to finish the job\" against Hamas due to the militant group's \"refusal to lay down its arms\". The Israeli prime minister made the comment in a news briefing for foreign journalists on Sunday, where he also denied starving Gazans and claimed there is a \"global campaign of lies\" against Israel. \"Given Hamas's refusal to lay down its arms, Israel has no choice but to finish the job and complete the defeat of Hamas,\" he said. Gaza latest: UK condemns Israel's plan to expand its military operation  Mr Netanyahu said there are \"two remaining [Hamas] strongholds\" in Gaza that he intends to \"dismantle\", claiming this is \"the best way to end the war\". Israel's security cabinet approved a full military takeover of Gaza City on Friday. It already controls around 75% of Gaza and has largely sealed its borders. Mr Netanyahu also addressed global concerns about a lack of aid being allowed into Gaza - alleging some photographs of starving children are fake. The Israeli leader said: \"The purpose of this news conference is to puncture the lies and spread the truth.\" Singling out three recent photographs, Mr Netanyahu claimed the Gazan children in them appear emaciated because they have medical conditions. \"I'm looking right now into the possibility of a governmental suit against the New York Times because this is outrageous,\" he said. Many aid organisations have said the enclave is on the verge of famine and Palestinian officials recently said at least 100 people have died of malnutrition, including 80 children. Mr Netanyahu said: \"If we had a starvation policy, no one in Gaza would have survived after two years of war.\" He also repeated the allegation that Hamas has been looting aid trucks and claimed uncollected food has been \"rotting\" at the border, blaming the UN for not distributing it. Responding to a question from Sky News international correspondent Diana Magnay, Mr Netanyahu said \"hundreds\" of aid trucks are entering Gaza to relieve \"deprivation\". He said the price of food in Gaza is now \"plummeting\" due to Israel's \"humanitarian surge\". The Israeli prime minister called on other countries to carry out more aid drops, despite the United Nations condemning them as dangerous. IDF to 'bring foreign journalists' into Gaza, Israeli PM says Mr Netanyahu claimed \"more foreign journalists\" are going to be let into Gaza. Israel has largely banned foreign journalists from going into the enclave for the length of its war against Hamas, aside from on just a handful of occasions, when Israeli soldiers have accompanied reporters. \"We have decided and I've ordered and directed the military to bring in foreign journalists, more foreign journalists, a lot. There's a problem of assuring security, but I think it can be done,\" Mr Netanyahu said. But he seemed to suggest the military would accompany journalists - who have been pushing for unsupervised access to the Gaza Strip. Read more:Gaza seen from aboveIsraeli soldier dies by suicide  The war in Gaza began on 7 October 2023 when Hamas killed about 1,200 people - mostly civilians - and abducted 251 others in its attack. Most of the hostages have been released in ceasefires or other deals. It is believed Hamas is still holding 50 captives, with 20 believed to be alive. Israel's retaliatory offensive has killed more than 61,000 Palestinians, according to Gaza's Hamas-run health ministry, which does not differentiate between militants and civilians in its count."
    },
    {
        "title": "Man who killed police officer 'blamed COVID jab for making him depressed and suicidal'",
        "description": "A man who opened fire on the headquarters of America's national public health agency - leaving a police officer dead - had blamed the COVID vaccine for making him depressed and suicidal.",
        "url": "https://news.sky.com/story/man-who-killed-police-officer-blamed-covid-jab-for-making-him-depressed-and-suicidal-13409504",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-georgis-shooting-atlanta_6987028.jpg?20250810050118",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-10 03:29:00",
        "Headline": "America's health secretary Robert F. Kennedy Jr, who has spread distrust of the COVID-19 vaccine, has faced calls to resign after the shooting.",
        "Content": "A man who opened fire on the headquarters of America's national public health agency - leaving a police officer dead - had blamed the COVID vaccine for making him depressed and suicidal. Patrick Joseph White, a 30-year-old from Georgia, had tried to enter the Centers for Disease Control and Prevention (CDC) headquarters in Atlanta but was stopped by guards, a law enforcement official said. They added that White then drove to a pharmacy across the street before opening fire late on Friday afternoon. He was armed with five guns - including at least one long gun. DeKalb County Police Officer David Rose, who had three children, was shot dead while responding to the incident. White also died, but authorities haven't said whether he was killed by police or if he killed himself. His father had contacted police and identified his son as the possible gunman. White's father also said his son had been upset over the death of his dog and had become fixated on the COVID-19 vaccine. Health and Human Services Secretary Robert F. Kennedy Jr, whose scepticism of vaccines has been a cornerstone of his career, voiced support for CDC employees yesterday. But some laid-off CDC employees said Mr Kennedy shares responsibility for the violence and should resign. Mr Kennedy has a history as a leader in the anti-vaccine movement, but he reached new prominence by spreading distrust of COVID-19 vaccines. For example, he called it \"criminal medical malpractice\" to give these jabs to children. He said after the shooting: \"We are deeply saddened by the tragic shooting at CDC's Atlanta campus that took the life of officer David Rose. \"We know how shaken our public health colleagues feel today. No one should face violence while working to protect the health of others.\" Sarah Boim, a former CDC communications staffer who was fired this year during a wave of terminations, said the shooting was the \"physical embodiment of the narrative that has taken over, attacking science, and attacking our federal workers\". White's 'distrust of COVID vaccines' A neighbour of White told The Atlanta Journal-Constitution that the gunman spoke with her multiple times about his distrust of COVID-19 jabs. Nancy Hoalst, who lives on the same street as White's family, said he seemed like a \"good guy\" but he would bring up vaccines even in unrelated conversations. \"He was very unsettled, and he very deeply believed that vaccines hurt him and were hurting other people.\" Ms Hoalst told the Atlanta newspaper. \"He emphatically believed that.\" However, she said she never believed White would be violent and added: \"I had no idea he thought he would take it out on the CDC.\""
    },
    {
        "title": "O2 arena lease snapped up by pensions giant Rothesay",
        "description": "The long-term lease to the O2, London's best-known live entertainment venue, has been sold to Britain's biggest pensions insurance specialist.",
        "url": "https://news.sky.com/story/o2-arena-lease-snapped-up-by-pensions-giant-rothesay-13409596",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-anticyclonic-gloom_6742508.jpg?20250529115830",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-10 11:22:00",
        "Headline": "The long-term lease to London's best-known entertainment venue has been sold by Cambridge University's Trinity College in a deal said to be worth about £90m, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The long-term lease to the O2, London's best-known live entertainment venue, has been sold to Britain's biggest pensions insurance specialist. Sky News understands a deal was signed last week for Rothesay, the title sponsor of England's home Test cricket matches, to acquire the landmark's 999-year lease for about £90m. The agreement, which is likely to be announced within days, comes more than two months after Sky News reported that Rothesay was the frontrunner to clinch a deal. Rothesay has become one of Britain's most successful specialist insurers, having been established in 2007.  It now protects the pensions of more than one million people in Britain and makes more than £300m in pension payouts every month. The auction of the O2 lease kicked off several months ago, when Cambridge University's wealthiest college, Trinity, instructed advisers to launch a sale process. Trinity College, which ranks among Britain's biggest landowners, acquired the site in 2009 for a reported £24m. The O2, which shrugged off its 'white elephant' status in the aftermath of its disastrous debut as the Millennium Dome in 2000, has since become one of the world's leading entertainment venues. Read more from Sky NewsCarlyle to seize control of Very GroupMartin Sorrell approached about S4 Capital deal Operated by Anschutz Entertainment Group (AEG), it has played host to a wide array of music, theatrical, and sporting events over nearly a quarter of a century. Trinity College, which was founded by Henry VIII in 1546, bought the O2 lease from Lend Lease and Quintain, the property companies that had taken control of the Millennium Dome site in 2002 for nothing. In a joint statement issued in response to an enquiry from Sky News, Rothesay and Trinity College Cambridge said they were \"pleased to confirm that Rothesay will be the long-term owner of The O2 arena, following a competitive auction process for the lease of this London landmark\". A spokesperson for Rothesay said separately: \"Prestigious and high-quality property assets like the O2 form an important part of Rothesay's investment strategy, providing the predictable and dependable returns which create real security for the one million-plus pensions we protect.\""
    },
    {
        "title": "'We will send you packing': Govt vows to deport foreign criminals immediately after sentencing ",
        "description": "Foreign criminals will be deported from the UK immediately after they are sentenced, the justice secretary has said.",
        "url": "https://news.sky.com/story/we-will-send-you-packing-govt-vows-to-deport-foreign-criminals-immediately-after-sentencing-13409497",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pentonville-prison_6826287.jpg?20250212080857",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-10 01:32:00",
        "Headline": "The announcement goes further than a change to the law in June meaning prisoners face deportation 30% into their sentence rather than the current 50%.",
        "Content": "Foreign criminals will be deported from the UK immediately after they are sentenced, the justice secretary has said. The law change proposed by Shabana Mahmood could save taxpayers an average of £54,000 a year per prison place. The changes would apply to prisoners serving fixed-term \"determinate\" sentences.  Authorities would also retain their power not to deport a criminal but instead keep them in custody - with examples including if an offender is planning further crimes against the UK's interests or national security. The justice secretary's announcement goes further than a change to the law in June - expected to come into force in September - meaning prisoners face deportation 30% into their sentence rather than the current 50%. The government will need parliament to greenlight its proposal to bring this down to 0%. Foreign national offenders make up around 12% of the prison population.  Ms Mahmood said: \"Our message is clear - if you abuse our hospitality and break our laws, we will send you packing.\" She added: \"Deportations are up under this government, and with this new law they will happen earlier than ever before.\" Almost 5,200 foreign national offenders have been deported since July 2024, a 14% increase on the 12 months prior, according to the government. Read more:Inside one of Britain's most overcrowded prisonsPrison system came 'within days of collapse'Prisoners to be moved to lower security jail According to a Labour source, the previous Conservative government relied on prison transfer agreements with other countries to deport foreign national offenders, in deals which allow inmates to serve their custodial sentence in their \"home\" country. This saw 945 prisoners sent to jails abroad between 2010 and 2023, equal to fewer than two criminals per week.  Conservative shadow justice secretary Robert Jenrick said: \"In Starmer's topsy-turvy world, investors are fleeing the country in their droves while record numbers of violent and sexual offenders from abroad are put up in our prisons. It's a farce. \"Yet again Starmer has refused to confront our broken human rights laws. \"He needs to grow a backbone and change them so we can actually deport these individuals. \"The safety of the British public is infinitely more important than the 'rights' of sick foreign criminals. \"If countries won't take back their nationals, Starmer should suspend visas and foreign aid. His soft-touch approach isn't working.\""
    }
]