[
    {
        "title": "Zelenskyy is 'untrustworthy crook and punk', says ex-Trump aide",
        "description": "Volodymyr Zelenskyy has been called a \"crook\" and a \"punk\" by a former top aide to Donald Trump.",
        "url": "https://news.sky.com/story/zelenskyy-is-untrustworthy-crook-and-punk-says-ex-trump-aide-13321486",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-steve-bannon-donald-trump-aide_6846487.jpg?20250304225746",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-04 20:14:00",
        "Headline": "Steve Bannon insisted the US president is \"going out of his way to be a peacemaker\" and Volodymyr Zelenskyy \"had his shot\" but pushed the US too far for security guarantees.",
        "Content": " Volodymyr Zelenskyy has been called a \"crook\" and a \"punk\" by a former top aide to Donald Trump. Steve Bannon also told Sky's Ali Fortescue he thinks the US president should pull out of a planned minerals deal with Ukraine. In a wide-ranging interview on the Politics Hub, the ex-chief strategist said Mr Trump's efforts to improve relations with Russia is a \"brilliant\" move. Mr Bannon said the UK and Europe need to \"wake up\" and realise they do not have to be worried about Russia invading the rest of Europe, as they do not have the army to do it. \"The rapprochement of the United States with Russia breaks the control of the Chinese Community Party... it's a brilliant stroke.\" Follow latest: Zelenskyy's olive branch to Trump He added the EU \"will come along with it\" and insisted Mr Trump is \"going out of his way to be a peacemaker\". \n                  The most significant part of Volodymyr Zelenskyy's olive branch offering to Donald Trump\n                 \n                  Zelenskyy says Ukraine 'ready to come to negotiating table' - after US pauses military aid\n                 \n                  Trump may have talked America into recession before a trade tariff was even imposed\n                 But he was clear about whether the leader should agree to sign a deal with Ukraine's president for rare minerals, which was supposed to happen on Friday until the pair had a heated row in the Oval Office. \"Absolutely not. He [Zelenskyy] had his shot. Zelenskyy is untrustworthy. He's a crook and a punk. And he showed what a punk he was in the Oval Office the other day,\" said Mr Bannon. He suggested the row was prompted by Mr Zelenskyy trying to get security guarantees from the US, something the American public would not accept. 👉 Follow Trump 100 on your podcast app 👈 Minerals deal a 'gift' to Ukraine \"They told him, time and time and time again, do not bring up security guarantees. A security guarantee means... American troops and that will never happen,\" said Mr Bannon. He also said the deal was unnecessary and only a \"very general framework\" anyway, which risked tying the US to the \"future reconstruction of the country\". \"We don't need a rare earth deal. The United States doesn't need rare earths from Ukraine. That was a total gift to him and the Ukrainian people.\" However, sources have told the Reuters news agency that Mr Trump is planning to announce the US and Ukraine's minerals agreement during his address to Congress on Tuesday. Read more from Sky News:JD Vance denies insulting British troopsZelenskyy tries to mend US relationsUkraine Q&A: How long can Ukraine hold on? Mr Trump has paused military aid to Kyiv in the most dramatic step yet in his pivot towards closer ties with Russia. 'Let EU underwrite Ukraine security' Mr Bannon also took aim at European nations, saying defence spending was insufficient: \"Let them [the EU] step up and let them underwrite the security of Ukraine.\" In particular he described the UK's commitment to spend 2.5% of GDP on defence as \"nothing\". He also criticised Britain's combat capabilities saying the economy \"can't afford it\", adding the \"bond market already turfed out Liz Truss\". He said the \"reality\" is that much of NATO did not spend enough on defence, has \"faked\" for decades its capability to take on Russia, and the military alliance would struggle to put up \"two combat divisions\". Mr Bannon also accused \"much of the British establishment\" of being in business with the Chinese Communist Party. In terms of UK politics, he says he is \"a Nigel Farage guy and believes in Reform\". Mr Farage is close to the US president but has had to be slightly more reserved in his praise of him of late - knowing British public opinion is very much behind Mr Zelenskyy and Ukraine."
    },
    {
        "title": "The most significant part of Volodymyr Zelenskyy's olive branch offering to Donald Trump",
        "description": "Ukraine's president is offering an olive branch to Donald Trump with a dramatic public message aimed at mending their relationship and ending Russia's war.",
        "url": "https://news.sky.com/story/the-most-significant-part-of-volodymyr-zelenskyys-olive-branch-offering-to-donald-trump-13321407",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donetsk-ukraine-russia-war-invasion_6839032.jpg?20250304190400",
        "type": "Home",
        "Author": "Deborah Haynes",
        "Date Published": "2025-03-04 17:02:00",
        "Headline": "The Ukraine leader described Friday's Oval Office bust-up with the US president as \"regrettable\", adding that now \"is time to make things right\".",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  Ukraine's president is offering an olive branch to Donald Trump with a dramatic public message aimed at mending their relationship and ending Russia's war. Volodymyr Zelenskyy chose social media - the US leader's favourite mode of communication - to make his point. He did not go so far as to apologise for a fiery bust-up with Mr Trump at the Oval Office last Friday - a move that some members of the US administration have called for, even though it was the American president and his deputy JD Vance who laid into Mr Zelenskyy. Instead, he described the encounter as \"regrettable\", saying it \"did not go the way it was supposed to be\" and it was \"time to make things right\". Most significantly though was his spelling out of a vision for the first stage of how Russia's war with Ukraine could end. Pushing back on false claims by Trump allies such as Elon Musk that Mr Zelenskyy wants an endless war, he said that Ukraine is committed to peace and is ready to come to the negotiating table as soon as possible. Crucially, he said: \"We are ready to work fast to end the war, and the first stages could be the release of prisoners and truce in the sky - ban on missiles, long-ranged drones, bombs on energy and other civilian infrastructure - and truce in the sea immediately, if Russia will do the same.\" \n                  Zelenskyy is 'untrustworthy crook and punk', says ex-Trump aide\n                 \n                  Zelenskyy says Ukraine 'ready to come to negotiating table' - after US pauses military aid\n                 \n                  Trump may have talked America into recession before a trade tariff was even imposed\n                 Appealing to the US president's ego, he praised Mr Trump's \"strong leadership\" and repeated his gratitude for past American support - again responding to criticism from the American commander in chief and his team that he is not showing enough gratitude. 👉 Follow Trump 100 on your podcast app 👈 He also said Kyiv was ready to sign a key minerals deal with Washington - something else Mr Trump is seeking. This message appears to be an attempt by Mr Zelenskyy to steer his relationship with Mr Trump back on track and to map out his idea for an end to the war - a conflict that Ukraine did not seek but which was brought to its land by Russia's invading forces. Read more from Sky News:Trump: Dealmaker or blackmailer?Canada warns 'no winners in a trade war'US may have slumped into recession Key now will be how the US president responds. Will Mr Zelenskyy's expression of regret and clear wish to end the war provide enough of an off-ramp for Mr Trump to defuse the row and - for the sake of Ukraine's ability to defend itself - switch back on the flow of military assistance to the country? Another major factor, of course, is how Vladimir Putin reacts and whether he could countenance a limited ceasefire in a war that he started and - unlike Mr Zelenskyy - appears to have no genuine desire to halt."
    },
    {
        "title": "Ousted PM Sheikh Hasina will stand trial for crimes against humanity, Bangladesh's interim leader says",
        "description": "The interim leader of Bangladesh, Muhammad Yunus, has told Sky News that former prime minister Sheikh Hasina will stand trial for crimes against humanity.",
        "url": "https://news.sky.com/story/ousted-pm-sheikh-hasina-will-stand-trial-for-crimes-against-humanity-bangladeshs-interim-leader-says-13321285",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-muhammad-yunus-bangladesh_6846217.jpg?20250304170817",
        "type": "Home",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-03-04 13:42:00",
        "Headline": "A trial will take place over ousted PM Sheikh Hasina's 'war on terror', whether she is present in Bangladesh or in absentia, the country's interim leader tells Sky News' Asia correspondent Cordelia Lynch.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  The interim leader of Bangladesh, Muhammad Yunus, has told Sky News that former prime minister Sheikh Hasina will stand trial for crimes against humanity. Ms Hasina is accused of overseeing a system of enforced disappearances during her time in government, as well as the mass killing of protesters in July and August last year. Speaking to Sky News, Professor Yunus said: \"A trial will be taking place. Not only her, but also all the people who are associated with her - her family members, her clients or associates.\" Ms Hasina, who was toppled by the protests and is currently in exile in India, is accused of overseeing a network of secret detention centres where it's alleged her political opponents were interrogated, tortured and some killed - all under the banner of a \"war on terror\". Bangladesh has issued two arrest warrants for her. Professor Yunus said they had sent \"formal letters\" but received \"no official response\" from New Delhi. He insisted, however, that Ms Hasina would face the court, whether physically present in Bangladesh or in absentia, in India. Read more: Inside Bangladesh's secret prisons \n                  UK investigators may assist with Bangladeshi probes into alleged corruption\n                 \n                  Electrocuted on their genitals, mouths sewn up, nails ripped off: Inside Bangladesh's 'death squad' jails\n                 \n                  Electrocuted, beaten, and left to die: The horrors of Bangladesh's 'death squad' jails  \n                 Professor Yunus recently visited one of the now infamous secret jails, code-named the 'House of Mirrors'. The economics professor, known as the 'banker to the poor' and now chief adviser of Bangladesh, said he was beyond shocked at what he saw. \"This is just the ugliest thing that you can see, you can feel, or you can observe,\" he said. Ms Hasina is accused of using her security forces and police to oversee the abduction, torture and murder of hundreds of activists. She denies the allegations and says she's being politically persecuted. Ms Hasina, her close aides and many of those accused of overseeing a network of as many as 800 secret jails have fled Bangladesh. Professor Yunus said the number and range of people involved in the alleged crimes was \"taking time\" to work through. \"Everybody was involved in it all,\" he said. \"The whole government was involved in it. So you cannot distinguish who was really and enthusiastically doing it, who was doing it under orders and who was not quite supportive but carrying out those kinds of things.\" Ms Hasina, the military and police are also accused of a violent crackdown on protesters in July and August which the UN estimates killed as many as 1,400 people in the days before the former prime minister fled. Professor Yunus tried to manage expectations around how quickly the families of victims will see justice, and whether that will happen under his watch.  Elections for a new government in the country could happen as early as December. \"Some will get punished, some will still be under the process, some will still be untraceable,\" he said. Investigations into alleged corruption The chief adviser has had a large in-tray to deal with since taking over a country in turmoil, including anti-corruption probes into those connected to Ms Hasina. British Labour MP Tulip Siddiq, who is Ms Hasina's niece, is one of those being investigated by Bangladesh's Anti-Corruption Commission (ACC). Professor Yunus said the case against her was \"serious\", that she had a large amount of \"wealth left behind\" in the country and \"everything\" would be looked at. Ms Siddiq resigned as anti-corruption minister in January after being named in the investigation in Bangladesh. A spokesperson for the London MP said she \"totally denies the claims\" and had \"not been contacted on these matters\". Managing refugee crisis The influx of Rohingya refugees into Bangladesh is another challenge for Professor Yunus's leadership. There's been a sharp rise in the number of the mainly Muslim minority fleeing Myanmar into Bangladesh after escalating violence in the country's long-running civil war. Professor Yunus said they were now in talks with rebel groups in Myanmar about the possibility of a \"safe zone\" to eventually help the Rohingya refugees to return to their homeland. He also acknowledged big problems in Cox's Bazar in Bangladesh, home to the largest refugee camp in the world, where an estimated one million Rohingya refugees have fled to - and where \"violence, drugs and paramilitary activities\" are rife. The tension, Professor Yunus said, \"will not disappear\"."
    },
    {
        "title": "VE Day: Britons urged to celebrate 80th anniversary with street parties as flypast, processions and concerts planned",
        "description": "The celebrations for the 80th VE Day anniversary have been announced, as Britons have been urged to organise street parties to mark the occasion.",
        "url": "https://news.sky.com/story/ve-day-britons-urged-to-celebrate-80th-anniversary-with-street-parties-as-flypast-processions-and-concerts-planned-13321693",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-ve-day-ww2-second-world-war_6846506.jpg?20250304230850",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-04 23:01:00",
        "Headline": "Victory in Europe Day, known as VE Day, is celebrated on 8 May to mark the day the Allies formally accepted Germany's surrender in 1945.",
        "Content": "The celebrations for the 80th VE Day anniversary have been announced, as Britons have been urged to organise street parties to mark the occasion. Victory in Europe Day, known as VE Day, is celebrated on 8 May each year to mark the day the Allies formally accepted Germany's surrender in 1945. To kick off the landmark celebrations on 5 May, the Cenotaph will be draped in Union flags for the first time since it was unveiled by King George IV in 1920, and a flypast and military procession in London will take place. The flypast will involve current and historic aircraft and the Red Arrows. Then, over the following days, a series of events will be held, such as landmarks being lit up and an installation of 30,000 ceramic poppies at the Tower of London, leading up to the anniversary day itself. Commemorating the newsflash announcement on the evening of 7 May 1945, that the following day would be VE Day, the Parliament Choir will host an anniversary concert in Westminster Hall. On 8 May, a service will take place at Westminster Abbey, with events concluding with a concert, which will see more than 10,000 members of the public at Horse Guards Parade. \n                  Plea to 'stop and reflect' on cost of war ahead of VE Day 80th anniversary\n                 \n                  VE Day: Ross Kemp urges people to take part in 80th anniversary to thank surviving veterans\n                 \n                  Queen says 'streets are filled with love' in VE Day message during lockdown\n                 Culture Secretary Lisa Nandy said the anniversary offered \"important opportunities for communities to come together\". She added the anniversary would be a chance to \"hear our veterans' stories first hand, to reflect and remember, and ensure that their stories of sacrifice and service are remembered for generations to come\". Brendan Cox, co-founder of the Together Coalition, which is organising the VEDay80 community campaign, said the celebrations were a chance to \"reach out to neighbours, friends and our wider communities\". Read more from Sky News:Boy shot dead near Tube stationMum charged with daughter's murderCourt backlog 'unmanageable' Bank holiday street parties and barbecues will be organised by the coalition and the first day of events includes a street party on the surviving warship HMS Belfast. Bruno Peek, pageant master of the commemoration, said: \"We encourage everyone to take part - raise the VE Day flag at 9am, gather in streets, gardens, town halls, clubs and pubs. Let this be a day of joy, reflection, and celebration.\" Then, on 15 August, a further series of events will be held to mark the end of the Second World War between the US and Japan."
    },
    {
        "title": "Boy, 16, shot dead in south London",
        "description": "A teenage boy has been shot dead in south London.",
        "url": "https://news.sky.com/story/boy-16-shot-dead-in-south-london-13321412",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-paradise-road-south_6846289.jpg?20250304193526",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-04 17:24:00",
        "Headline": "No arrests have been made, the Met Police said, adding it was working to identify the 16-year-old victim and inform his next of kin.",
        "Content": "A teenage boy has been shot dead in south London. The Metropolitan Police said the 16-year-old was killed on Paradise Road, near Stockwell Tube Station. Officers were called to the scene around 3.20pm on Tuesday to reports of a shooting. Despite the best efforts of paramedics from the London Ambulance Service and London's Air Ambulance, the teenager was pronounced dead at the scene. In a statement, the Met Police said that no arrests had been made and it had launched a murder investigation. Officers were also working to identify the teenager and contact his next of kin. 'Enormously shocking incident' Superintendent Gabriel Cameron said: \"This is an enormously shocking incident which I imagine will cause huge distress to the local community. \"Our thoughts are with the young boy's family at this devastating time. \"Local officers are on the scene gathering CCTV and speaking to witnesses to piece together what has happened. \"They will be supported by specialist homicide investigators shortly.\" Read more from Sky News:Anyone working for Iran in UK must registerComedy 'super producer' dies after accident abroad'Corrupt' ex-prison officer jailed He added that police would work \"around the clock\" to find the perpetrators."
    },
    {
        "title": "Court backlog at unmanageable levels, says report, as victims suffer from poor mental health in wait for trials",
        "description": "The backlog of cases in crown courts is at unmanageable levels and is actively harming victims and causing undue stress, the victims' commissioner says.",
        "url": "https://news.sky.com/story/court-backlog-at-unmanageable-levels-says-report-as-victims-suffer-from-poor-mental-health-in-wait-for-trials-13321354",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-court-justice-system_6846294.jpg?20250304194351",
        "type": "Home",
        "Author": "Ashna Hurynag",
        "Date Published": "2025-03-04 16:02:00",
        "Headline": "There are 73,105 outstanding criminal cases waiting to be dealt with in crown courts in England and Wales, according to the Ministry of Justice.",
        "Content": "\n          News correspondent\n              @ashnahurynag\n The backlog of cases in crown courts is at unmanageable levels and is actively harming victims and causing undue stress, the victims' commissioner says. In a damning 73-page report, Baroness Newlove described the disruption to victims' lives and how many suffer from poor mental health and a reliance on drugs and alcohol to cope. \"They've gone to report a horrendous crime happening to them, but in the process they have been retraumatised by the very system they thought would protect them,\" the commissioner said. \"In the length of time it's actually taken to get a court trial - to have to turn to alcohol, to have to turn to drugs as a coping mechanism says everything about a system that is failing, not just on its knees. \"To see that some were also self-harming and some were suicidal. That cannot be right.\" Bella, whose name Sky News has changed, is a victim of abuse. She first reported her former partner for abuse in 2014. He was charged eight years later, in 2022, with a catalogue of offences including rape, sexual assault and coercive control. \n                  Scrapping jury trials for some offences may be only way to clear court backlog, says CPS watchdog chief\n                 \n                  Reducing number of jury trials being considered by government to clear courts backlog\n                 \n                  Lord Timpson having 'conversations' about public sector hiring more ex-prisoners\n                 But the trial only went ahead last year. 'I couldn't cope' \"It really affected my mental health,\" Bella says. \"It's cost me many jobs because I couldn't go to work when decisions were being made with the police. It affected me in ways where I just couldn't cope - I had to get support with my son. They changed the police officers who I had trust in. It's affected me in so many ways.\" Almost half of the victims - 48% - have had their trial date postponed at least once, but this often happens multiple times. There are 73,105 outstanding criminal cases waiting to be dealt with in crown courts in England and Wales, according to the Ministry of Justice. Delays are 'a further injustice' Sky News has spoken to survivors who only found out their trial had been delayed on the day. Adjournments can even span several years. \"Victims are trapped in a cycle of delay, frustration and despair,\" says Baroness Newlove. \"For those who have already endured profound trauma, the drawn-out process is not just a setback - it is a further injustice.\" Read more: Inside the UK's 'wild west' court system Despite the delays, Bella urged survivors not to give up, saying: \"It nearly broke me a few times. My parents, my friends said to me, it's going to kill you, but despite the impact it's having on you mentally, you need to not give up. Because you will get justice.\" Bella's abuser was found guilty of actual bodily harm and coercive control. He has now been jailed. The report follows Sky News' ongoing coverage of the backlog. We have spoken to multiple victims of crime who have had painful waits for their day in court, as well as several victim services, that say they struggle to keep morale up. The Director of Public Prosecutions, Stephen Parkinson, previously told Sky News the delays were \"totally unacceptable\" and tackling the wait for justice was his \"highest priority\". A Ministry of Justice spokesperson said: \"This government inherited a record and rising courts backlog - that's why we've asked Sir Brian Leveson to propose once-in-a-generation reform to deliver swifter justice for victims. \"We've already funded an additional 2,500 sitting days, raising court capacity to the highest in almost 10 years and are committed to working with our partners to deliver longer-term reform. We will not stop until we have a system that protects victims, supports their journey to justice and holds perpetrators to account.\""
    },
    {
        "title": "Mum charged with murder of two-year-old daughter Annabel Mackey",
        "description": "A 42-year-old woman has been charged with the murder of her two-year-old daughter, who died after being found unresponsive in a pond.",
        "url": "https://news.sky.com/story/mum-charged-with-murder-of-two-year-old-daughter-annabel-mackey-13321421",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-annabel-mackey-mackey_6846249.jpg?20250304182742",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-04 18:33:00",
        "Headline": "Annabel Mackey went missing from her home on 10 September 2023 and was found a short time later at Kingsley Pond.",
        "Content": "A 42-year-old woman has been charged with the murder of her two-year-old daughter, who died after being found unresponsive in a pond. Annabel Mackey, two, went missing from her home in Kingsley, Hampshire, on 10 September 2023. The youngster was found a short time later unresponsive at Kingsley Pond. She was taken to hospital in a serious condition, but died the following afternoon. Alice Mackey, of Gibbs Lane, Oakhanger, has been charged with her murder. Mackey was remanded into custody to appear at Basingstoke Magistrates' Court on Wednesday. In a statement, Annabel's father paid tribute to his daughter, describing her as a \"beautiful, positive and very happy little girl\". Read more from Sky News:Boy, 16, shot dead in south LondonInside Bangladesh's 'death squad' jails'Megaberg' the size of Gloucestershire runs aground He said: \"She had an incredibly pure and caring nature that we miss so much. She loved story time, dogs and her dolly. \"She enjoyed singing songs and nursery rhymes and had a very sweet tooth. \"Annabel loved to laugh, she brought so much happiness into our lives. She was dearly loved by her family and friends. \"The world needs more people like Annabel to spread positivity and kindness. \"Annabel, I love you so much, you are a shining star and you will be loved forever.\""
    },
    {
        "title": "Scientists trying to bring back the woolly mammoth create a woolly mouse",
        "description": "Scientists trying to bring back the woolly mammoth have created a woolly mouse.",
        "url": "https://news.sky.com/story/scientists-trying-to-bring-back-the-woolly-mammoth-create-a-woolly-mouse-13321512",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-genetically-mice-colossal-biosciences_6845949.jpg?20250304131850",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-04 20:50:00",
        "Headline": "Biotech company Colossal Biosciences unveiled plans in 2021 to revive the woolly mammoth - and later the dodo bird.",
        "Content": "Scientists trying to bring back the woolly mammoth have created a woolly mouse. Colossal Biosciences unveiled plans in 2021 to revive the woolly mammoth - and later the dodo bird - attracting investors, headlines and critics alike. The Texas-based biotech company has since focused on identifying the key traits of extinct animals with the goal of genetically engineering them into living animals, according to chief executive Ben Lamm. Read more: Why 'de-extincting' the mammoth won't be like Jurassic Park Alongside bringing back species that went extinct, the company hopes their work can be used to help with conservation efforts. But other scientists have mixed views of their work and whether it will be helpful. On Tuesday, Colossal Biosciences said its researchers had edited seven genes in mice embryos to create a mouse with long, thick, woolly hair. They nicknamed the extra-furry rodent a \"colossal woolly mouse.\" The company now plans to genetically modify Asian elephants to give them woolly mammoth traits - but critics have argued that this is different from actually bringing a species back from extinction. \"You're not actually resurrecting anything - you're not bringing back the ancient past,\" said Christopher Preston, a wildlife and environment expert at the University of Montana, who was not involved in the research. He added: \"You might be able to alter the hair pattern of an Asian elephant or adapt it to the cold, but it's not bringing back a woolly mammoth. It's changing an Asian elephant.\" The results have not yet been published in a journal or vetted by independent scientists. The feat \"is technologically pretty cool,\" said Vincent Lynch, a biologist at the University of Buffalo, who was not involved in the research. Alongside the mouse being given different hair, in a press release, Colossal Biosciences said the rodent had also gained the woolly mammoth's accelerated fat metabolism. Both were said to be likely related to cold tolerance. These genetic variations were already present in some living mice, the company's chief scientist Beth Shapiro said, adding: \"We put them all together in a single mouse.\" Read more from Sky News:Smoke bombs thrown in Serbia's parliament'Stalker' threatens to kill during live streamInside Bangladesh's 'death squad' jails The company said it focused first on mice to confirm the process worked before potentially moving onto the embryos of Asian elephants - the closest living relative of woolly mammoths. However, as Asian elephants are an endangered species, there will be a lot of red tape before any plans can move forward, Mr Lamm admitted."
    },
    {
        "title": "Boy, 16, shot dead in south London",
        "description": "A teenage boy has been shot dead in south London.",
        "url": "https://news.sky.com/story/boy-16-shot-dead-in-south-london-13321412",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-paradise-road-south_6846289.jpg?20250304193526",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-04 17:24:00",
        "Headline": "No arrests have been made, the Met Police said, adding it was working to identify the 16-year-old victim and inform his next of kin.",
        "Content": "A teenage boy has been shot dead in south London. The Metropolitan Police said the 16-year-old was killed on Paradise Road, near Stockwell Tube Station. Officers were called to the scene around 3.20pm on Tuesday to reports of a shooting. Despite the best efforts of paramedics from the London Ambulance Service and London's Air Ambulance, the teenager was pronounced dead at the scene. In a statement, the Met Police said that no arrests had been made and it had launched a murder investigation. Officers were also working to identify the teenager and contact his next of kin. 'Enormously shocking incident' Superintendent Gabriel Cameron said: \"This is an enormously shocking incident which I imagine will cause huge distress to the local community. \"Our thoughts are with the young boy's family at this devastating time. \"Local officers are on the scene gathering CCTV and speaking to witnesses to piece together what has happened. \"They will be supported by specialist homicide investigators shortly.\" Read more from Sky News:Anyone working for Iran in UK must registerComedy 'super producer' dies after accident abroad'Corrupt' ex-prison officer jailed He added that police would work \"around the clock\" to find the perpetrators."
    },
    {
        "title": "Mum charged with murder of two-year-old daughter Annabel Mackey",
        "description": "A 42-year-old woman has been charged with the murder of her two-year-old daughter, who died after being found unresponsive in a pond.",
        "url": "https://news.sky.com/story/mum-charged-with-murder-of-two-year-old-daughter-annabel-mackey-13321421",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-annabel-mackey-mackey_6846249.jpg?20250304182742",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-04 18:33:00",
        "Headline": "Annabel Mackey went missing from her home on 10 September 2023 and was found a short time later at Kingsley Pond.",
        "Content": "A 42-year-old woman has been charged with the murder of her two-year-old daughter, who died after being found unresponsive in a pond. Annabel Mackey, two, went missing from her home in Kingsley, Hampshire, on 10 September 2023. The youngster was found a short time later unresponsive at Kingsley Pond. She was taken to hospital in a serious condition, but died the following afternoon. Alice Mackey, of Gibbs Lane, Oakhanger, has been charged with her murder. Mackey was remanded into custody to appear at Basingstoke Magistrates' Court on Wednesday. In a statement, Annabel's father paid tribute to his daughter, describing her as a \"beautiful, positive and very happy little girl\". Read more from Sky News:Boy, 16, shot dead in south LondonInside Bangladesh's 'death squad' jails'Megaberg' the size of Gloucestershire runs aground He said: \"She had an incredibly pure and caring nature that we miss so much. She loved story time, dogs and her dolly. \"She enjoyed singing songs and nursery rhymes and had a very sweet tooth. \"Annabel loved to laugh, she brought so much happiness into our lives. She was dearly loved by her family and friends. \"The world needs more people like Annabel to spread positivity and kindness. \"Annabel, I love you so much, you are a shining star and you will be loved forever.\""
    },
    {
        "title": "Kyle Clifford: Killer 'raped ex-partner' during triple murder of BBC commentator's family, trial hears",
        "description": "A former soldier raped his ex-girlfriend \"out of spite\" 13 days after she dumped him during the triple murder of a BBC racing commentator's family, a court has heard.",
        "url": "https://news.sky.com/story/kyle-clifford-killer-raped-ex-partner-during-triple-murder-of-bbc-commentators-family-trial-hears-13321372",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-loise-hannah-carol-hunt_6623073.jpg?20240710153929",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2025-03-04 17:30:00",
        "Headline": "Kyle Clifford, 26, has admitted murdering BBC racing commentator John Hunt's wife Carole Hunt, and his daughters Louise Hunt and Hannah Hunt, but denies the rape of ex-partner Louise.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n A former soldier raped his ex-girlfriend \"out of spite\" 13 days after she dumped him during the triple murder of a BBC racing commentator's family, a court has heard. Kyle Clifford, 26, has admitted murdering 25-year-old Louise Hunt, along with her mother Carol Hunt, 61, and her sister Hannah Hunt, 28, at their family home in Bushey, Hertfordshire, on 9 July last year. He has also admitted possession of the knife used to kill Mrs Hunt and the crossbow used to shoot her daughters, as well false imprisonment of Louise - who was tied up with duct tape - but denies rape. Clifford had checked BBC racing commentator John Hunt, who has one surviving daughter Amy, was not at home before launching the four-hour attack, Cambridge Crown Court heard. Prosecutor Alison Morgan KC said he \"committed extreme acts of violence\" against his former partner and her family members after Louise ended their 18-month relationship on 26 June. Clifford had hidden relationships with two other women from her, and her friends and family had supported the break-up having described him as \"disrespectful, rude and arrogant,\" the court heard. Jurors were told he started planning two days later, buying a length of rope, and later searched online for crossbows and airguns at the same time he was looking for a video of a Wandsworth prison officer engaged in sexual activity with an inmate. Ms Morgan said it showed a \"very clear indication of the violence intended through the use of weapons and his sexual preoccupation\". Clifford bought duct tape, a crossbow, bolts and a cocking device, as well as a 10-inch butchery knife, which he had in his car when he drove from his home in Enfield, north London, to the Hunt family home on 9 July. He knocked on the door just after 2.30pm, telling Mrs Hunt he was \"just dropping off some of Louise's stuff\" in what was described as a \"ruse\" to get inside. Clifford also had a \"thank you\" card addressed to Carol and John Hunt, which was later found unopened. \"Your family have shown me so much love and kindness and I'm so grateful for everything,\" it said. Audio captured by the doorbell camera captured a long female scream followed by a shorter scream, banging sounds and noise of a commotion, over the next three minutes as Clifford carried out a \"brutal knife attack\" on Mrs Hunt, the court heard. He then returned to his car to get the crossbow, waiting for Louise Hunt, who was working in her garden dog grooming pod, for an hour. The prosecutor said screams, male shouting and banging suggest she was \"quickly in fear of what she saw\" or \"quickly restrained\" as Clifford taped her ankles and hands behind her back and covered her mouth. The court heard he checked her phone to see who she had been in contact with and what she had been looking at, using the device to message her father: \"What time are you home?\" Mr Hunt replied: \"Late, I'm afraid. Everything OK sweetness?\" A \"loud whooshing noise\" is heard on CCTV played to the jury as the crossbow is fired to kill Louise when her sister Hannah Hunt returns home from her job as a beautician hours later. She went upstairs before realising Clifford was in the house, and raised voices can be heard. Hannah says \"Kyle, I swear to god\" and he says \"Calm down. Stop, stop, stop\", while there is another \"whooshing sound\" as a crossbow bolt is fired. Hannah messaged her boyfriend asking him to call police and saying: \"HE'S TYING US UP\". She is heard to say: \"Oh my god,\" as she found her mother and sister. Read more from Sky News:'Corrupt' ex-prison officer jailedBoy, 16, shot dead in south London Hannah managed to call police while injured and was found collapsed in the doorway when emergency services arrived but died shortly after. Ms Morgan said: \"The prosecution's case is that the defendant planned a terrible attack on Louise Hunt and her family, enraged by her rejection of him. \"That attack included an act of sexual violence, committed out of spite, when she was restrained and unable to escape him.\" Clifford drove to Enfield, where he lived, before going to a cemetery, where he was found the next day in a wooded area by armed police officers. He shot himself with the crossbow and was taken to hospital, where he was first interviewed in September, making comments including \"sorry\" and \"what I have done is atrocious\". Clifford, who now uses a wheelchair because he is paralysed from the waist down, has chosen not to attend his trial, while friends and family members of the victims, including Mr Hunt are in the public gallery. His defence barrister Phil Bradley KC said Clifford's case is that he last had consensual sex with Louise on 23 June - the day they returned from his friend's wedding described as a \"catalyst\" for the break-up. \"The central issue for you to decide is whether the scientific findings can be explained by consensual sexual activity on 23 June or by rape on 9 July,\" he told the jury. But Ms Morgan told the jury the scientific evidence shows the explanation is \"completely untenable\". The trial continues on Wednesday."
    },
    {
        "title": "Court backlog at unmanageable levels, says report, as victims suffer from poor mental health in wait for trials",
        "description": "The backlog of cases in crown courts is at unmanageable levels and is actively harming victims and causing undue stress, the victims' commissioner says.",
        "url": "https://news.sky.com/story/court-backlog-at-unmanageable-levels-says-report-as-victims-suffer-from-poor-mental-health-in-wait-for-trials-13321354",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-court-justice-system_6846294.jpg?20250304194351",
        "type": "UK",
        "Author": "Ashna Hurynag",
        "Date Published": "2025-03-04 16:02:00",
        "Headline": "There are 73,105 outstanding criminal cases waiting to be dealt with in crown courts in England and Wales, according to the Ministry of Justice.",
        "Content": "\n          News correspondent\n              @ashnahurynag\n The backlog of cases in crown courts is at unmanageable levels and is actively harming victims and causing undue stress, the victims' commissioner says. In a damning 73-page report, Baroness Newlove described the disruption to victims' lives and how many suffer from poor mental health and a reliance on drugs and alcohol to cope. \"They've gone to report a horrendous crime happening to them, but in the process they have been retraumatised by the very system they thought would protect them,\" the commissioner said. \"In the length of time it's actually taken to get a court trial - to have to turn to alcohol, to have to turn to drugs as a coping mechanism says everything about a system that is failing, not just on its knees. \"To see that some were also self-harming and some were suicidal. That cannot be right.\" Bella, whose name Sky News has changed, is a victim of abuse. She first reported her former partner for abuse in 2014. He was charged eight years later, in 2022, with a catalogue of offences including rape, sexual assault and coercive control. \n                  Scrapping jury trials for some offences may be only way to clear court backlog, says CPS watchdog chief\n                 \n                  Reducing number of jury trials being considered by government to clear courts backlog\n                 \n                  Lord Timpson having 'conversations' about public sector hiring more ex-prisoners\n                 But the trial only went ahead last year. 'I couldn't cope' \"It really affected my mental health,\" Bella says. \"It's cost me many jobs because I couldn't go to work when decisions were being made with the police. It affected me in ways where I just couldn't cope - I had to get support with my son. They changed the police officers who I had trust in. It's affected me in so many ways.\" Almost half of the victims - 48% - have had their trial date postponed at least once, but this often happens multiple times. There are 73,105 outstanding criminal cases waiting to be dealt with in crown courts in England and Wales, according to the Ministry of Justice. Delays are 'a further injustice' Sky News has spoken to survivors who only found out their trial had been delayed on the day. Adjournments can even span several years. \"Victims are trapped in a cycle of delay, frustration and despair,\" says Baroness Newlove. \"For those who have already endured profound trauma, the drawn-out process is not just a setback - it is a further injustice.\" Read more: Inside the UK's 'wild west' court system Despite the delays, Bella urged survivors not to give up, saying: \"It nearly broke me a few times. My parents, my friends said to me, it's going to kill you, but despite the impact it's having on you mentally, you need to not give up. Because you will get justice.\" Bella's abuser was found guilty of actual bodily harm and coercive control. He has now been jailed. The report follows Sky News' ongoing coverage of the backlog. We have spoken to multiple victims of crime who have had painful waits for their day in court, as well as several victim services, that say they struggle to keep morale up. The Director of Public Prosecutions, Stephen Parkinson, previously told Sky News the delays were \"totally unacceptable\" and tackling the wait for justice was his \"highest priority\". A Ministry of Justice spokesperson said: \"This government inherited a record and rising courts backlog - that's why we've asked Sir Brian Leveson to propose once-in-a-generation reform to deliver swifter justice for victims. \"We've already funded an additional 2,500 sitting days, raising court capacity to the highest in almost 10 years and are committed to working with our partners to deliver longer-term reform. We will not stop until we have a system that protects victims, supports their journey to justice and holds perpetrators to account.\""
    },
    {
        "title": "VE Day: Britons urged to celebrate 80th anniversary with street parties as flypast, processions and concerts planned",
        "description": "The celebrations for the 80th VE Day anniversary have been announced, as Britons have been urged to organise street parties to mark the occasion.",
        "url": "https://news.sky.com/story/ve-day-britons-urged-to-celebrate-80th-anniversary-with-street-parties-as-flypast-processions-and-concerts-planned-13321693",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-ve-day-ww2-second-world-war_6846506.jpg?20250304230850",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-04 23:01:00",
        "Headline": "Victory in Europe Day, known as VE Day, is celebrated on 8 May to mark the day the Allies formally accepted Germany's surrender in 1945.",
        "Content": "The celebrations for the 80th VE Day anniversary have been announced, as Britons have been urged to organise street parties to mark the occasion. Victory in Europe Day, known as VE Day, is celebrated on 8 May each year to mark the day the Allies formally accepted Germany's surrender in 1945. To kick off the landmark celebrations on 5 May, the Cenotaph will be draped in Union flags for the first time since it was unveiled by King George IV in 1920, and a flypast and military procession in London will take place. The flypast will involve current and historic aircraft and the Red Arrows. Then, over the following days, a series of events will be held, such as landmarks being lit up and an installation of 30,000 ceramic poppies at the Tower of London, leading up to the anniversary day itself. Commemorating the newsflash announcement on the evening of 7 May 1945, that the following day would be VE Day, the Parliament Choir will host an anniversary concert in Westminster Hall. On 8 May, a service will take place at Westminster Abbey, with events concluding with a concert, which will see more than 10,000 members of the public at Horse Guards Parade. \n                  Plea to 'stop and reflect' on cost of war ahead of VE Day 80th anniversary\n                 \n                  VE Day: Ross Kemp urges people to take part in 80th anniversary to thank surviving veterans\n                 \n                  Queen says 'streets are filled with love' in VE Day message during lockdown\n                 Culture Secretary Lisa Nandy said the anniversary offered \"important opportunities for communities to come together\". She added the anniversary would be a chance to \"hear our veterans' stories first hand, to reflect and remember, and ensure that their stories of sacrifice and service are remembered for generations to come\". Brendan Cox, co-founder of the Together Coalition, which is organising the VEDay80 community campaign, said the celebrations were a chance to \"reach out to neighbours, friends and our wider communities\". Read more from Sky News:Boy shot dead near Tube stationMum charged with daughter's murderCourt backlog 'unmanageable' Bank holiday street parties and barbecues will be organised by the coalition and the first day of events includes a street party on the surviving warship HMS Belfast. Bruno Peek, pageant master of the commemoration, said: \"We encourage everyone to take part - raise the VE Day flag at 9am, gather in streets, gardens, town halls, clubs and pubs. Let this be a day of joy, reflection, and celebration.\" Then, on 15 August, a further series of events will be held to mark the end of the Second World War between the US and Japan."
    },
    {
        "title": "Matt Lucas apologises to Millie Bobby Brown after actress hits out at 'bullying'",
        "description": "Comedian Matt Lucas has apologised to actress Millie Bobby Brown after he posted a Little Britain catchphrase alongside photographs of the 21-year-old on social media.&#160;",
        "url": "https://news.sky.com/story/matt-lucas-apologises-to-millie-bobby-brown-after-actress-hits-out-at-bullying-13321243",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-millie-bobby-brown_6845936.jpg?20250304130227",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-04 12:28:00",
        "Headline": "The comedian, 50, wrote \"no but yeah but\" - a phrase used by delinquent teenager Vicky Pollard in Little Britain - on an X post of pictures of the Stranger Things star.",
        "Content": "Comedian Matt Lucas has apologised to actress Millie Bobby Brown after he posted a Little Britain catchphrase alongside photographs of the 21-year-old on social media.  Lucas, 50, wrote \"no but yeah but\", a phrase used by delinquent teenager Vicky Pollard in the sketch comedy series he co-created, on an X post that reshared pictures of the Stranger Things star. The photos show Brown in Los Angeles wearing hoop earrings and a pink top, which Lucas said had prompted him to point out \"the similarity by posting one of her [Vicky's] catchphrases\". The apology came after an Instagram post from Brown in which she hit out at negative comments and \"bullying\" about her appearance on social media and in news articles. Lucas said: \"Dear Millie, I just saw your post and wanted to respond, and provide some context. Nearly 25 years ago I co-wrote and appeared in a sketch show called Little Britain. \"There was a character in it called Vicky Pollard, who had blonde hair and always wore a pink top, and in the photo you had blonde hair and wore a pink top so I pointed out the similarity by posting one of her catchphrases. \"I thought you looked terrific and I was mortified when the press wrote that I 'slammed' you, firstly because that's not my style, and secondly because I think you're brilliant. \"I would not have posted it if I had thought it would have upset you but I realise it has and for that I apologise.\" Little Britain, which also starred David Walliams, began as a radio show in 2000 and moved to TV in 2003, running for three series. Read more from Sky News:Dolly Parton's husband of 60 years diesWhat we learnt from Meghan's new showComedy 'super producer' dies after accident abroad In her video, Brown said: \"I want to take a moment to address something that I think is bigger than just me, something that affects every young woman who grows up under public scrutiny. \"I think this is very necessary to talk about. I started in this industry when I was 10 years old. I grew up in front of the world, and, for some reason, people can't seem to grow with me. \"Instead, they act like I'm supposed to stay frozen in time, like I should still look the way I did on Stranger Things season one. And because I don't, I'm now a target.\" She quoted headlines from articles, among them references to Lucas's comments, which she said were \"amplifying an insult rather than questioning why a grown man is mocking a young woman's appearance\". \"This isn't journalism. This is bullying. The fact that adult writers are spending their time dissecting my face, my body, my choices, is disturbing. \"The fact that some of these articles are written by women makes it even worse. We always talk about supporting and uplifting young women but, when it comes down to it, it seems a lot easier to tear them down for clicks,\" she added. \"Disillusioned people can't handle seeing a girl become a woman on her terms, not their own. I refuse to apologise for growing up. I refuse to make myself smaller to fit the unrealistic expectations of people who can't handle seeing a girl become a woman. \"I will not be shamed for how I look, how I dress, or how I present myself. We have become a society where it's so much easier to criticise than it is to pay a compliment.\" She ended her post by saying: \"Let's do better. Not just for me, but for every young girl who deserves to grow up without the fear of being torn apart for simply existing.\" Celebrities including Sex And The City's Sarah Jessica Parker, as well as singers Pixie Lott and Lily Allen, left messages of support for the young actress. Brown became a household name after starring as Eleven in the hit Netflix series Stranger Things. The fifth and final series of the show, which started in 2016, is due to air this year. The British actress also landed the title role as mystery-solving sleuth Enola Holmes in the 2020 film and its sequel two years later. Brown, who married Jake Bongiovi, the son of rock star Jon Bon Jovi, last year, has been promoting the new Russo Brothers film, The Electric State, in which she stars alongside Chris Pratt."
    },
    {
        "title": "Bill to limit harms of smartphone use among children to be published",
        "description": "A bill that aims to protect children from the damaging effects of smartphones will be published on Thursday before MPs vote on it later this week.",
        "url": "https://news.sky.com/story/bill-to-limit-harms-of-smartphone-use-among-children-to-be-published-13321277",
        "image_url": "https://e3.365dm.com/19/02/1920x1080/skynews-smartphones-phones_4565186.jpg?20190202030939",
        "type": "UK",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-03-04 13:26:00",
        "Headline": "MPs are due to debate and vote on the Safer Phones Bill, which aims to raise the age of \"internet adulthood\" from 13 to 16.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n A bill that aims to protect children from the damaging effects of smartphones will be published on Thursday before MPs vote on it later this week. The Safer Phones Bill, put forward by backbench Labour MP Josh MacAlister, will have its second reading in the Commons on Friday - the first opportunity parliament has to debate its principles before deciding whether it should proceed further. Last October, Sky News reported that Mr MacAlister, a former teacher, had dropped plans to ban smartphones from schools because the government did not support the measure on the grounds that headteachers already have the power to ban phones - although it is not upheld in law. Politics latest: JD Vance hits back at troops claims Instead, supporters of the bill hope the move will encourage the government to back other elements in it, including strengthened powers for regulator Ofcom to protect children from apps that are designed to be addictive and an increase in the \"internet adulthood\" age - when children can create social media profiles and email accounts - from 13 to 16. A supporter of the bill told Sky News the focus now was on securing these reforms with the hope that if the government is unable to commit to increase the internet adulthood age now, that it would pledge to do so in the future through the Online Safety Act. The act, which was passed under the previous Conservative government, requires providers of online services to minimise the extent of illegal and harmful content. \n                  Man who died on motorway had been arrested 'after being confronted by online paedophile hunters'\n                 \n                  Grooming gangs scandal timeline: What happened, what inquiries there were and how Starmer was involved - after Elon Musk's accusations\n                 \n                  Father calls for industry changes after baby dies during 'hands-free' breastfeeding\n                 The regulator has said its duty around illegal harms will become enforceable around March this year, but the act is not expected to be implemented in full until 2026. One measure supporters hope could be on the table is a government commitment to review the act to see if Ofcom is using its powers effectively. One backer of the bill told Sky News: \"Ofcom is about to get new powers which are untested.  \"We want to keep the issue alive - we know how popular it is among parents and parliament needs to catch up, frankly.\" Under the previous Tory government, schools in England were issued with guidance intended to stop the use of mobile phones in the classroom. However, the guidance was non-statutory, leaving it up to individual schools to set their own policy. Last year, a study by the Policy Exchange thinktank found that schools which effectively ban mobile phones get better GCSE results than those with \"laxer policies\". Read more:Call for tougher measures on under-16 mobile phone useLabour MP goes public to oppose family farms tax The centre-right thinktank also said in its report that secondary schools in England where such a ban was in place were more than twice as likely to be rated outstanding by Ofsted as the national average. However, an investigation by the University of Birmingham last month found that restricting mobile phones at school does not improve grades or mental wellbeing. The study found that students' levels of sleep, exercise and academic record did not differ between schools with and without phone bans, and that restrictive policies did not lower the overall time young people spend on their phones each day. The debate over smartphone and social media use for children and teenagers had been reignited following Australia's decision to bans under 16s from having social media accounts. The legislation is set to come into force in November 2025 and will force platforms to take reasonable steps to ensure age-verification protections are in place."
    },
    {
        "title": "Oakwood Theme Park: Wales' largest theme park shuts after 'unrelenting economic challenges'",
        "description": "The largest theme park in Wales has closed with immediate effect, after nearly 40 years.",
        "url": "https://news.sky.com/story/wales-largest-theme-park-shuts-after-unrelenting-economic-challenges-13321604",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-oakwood-theme-park_6846429.jpg?20250304222141",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-04 22:01:00",
        "Headline": "Spanish firm Aspro Parks, which operated Oakwood Theme Park in Pembrokeshire, said it was sad to close \"a much-loved destination for generations and a rite of passage for many young visitors\".",
        "Content": "The largest theme park in Wales has closed with immediate effect, after nearly 40 years. Aspro Parks, which owns Oakwood Theme Park in Narberth, Pembrokeshire, said it reached the \"difficult decision\" due to financial challenges and declining visitor numbers. The firm said it has invested more than £25m since the park in southwest Wales was saved from closure in 2008. Aspro Parks said the decision was based on \"unrelenting economic challenges ahead, increases in costs, affecting all areas of the operation from ride parts to electricity costs, food and beverage inflation, increases in NLW [National Living Wage] and changes to national insurance thresholds\". \"Unfortunately, we could no longer see a sustainable way forward and will seek to improve our other parks using the assets and where possible team elsewhere,\" it said in a statement. Oakwood opened in the late 1980s and later built four large rides: Megafobia, Vertigo, Speed, along with Hydro - which was renamed as Drenched after a fatal accident in 2004. A 16-year-old girl died after falling around 100ft (30m) from the top of the ride, and a 10-year-old boy was also injured. But a coroner ruled out unlawful killing in the inquest and gave a narrative verdict. In 2008, the then owners were fined £250,000 and ordered to pay £80,000 costs when it was revealed that basic safety procedures were widely ignored by staff overseeing the ride. The Spanish-owned company says it employs more than 2,000 people at 68 leisure parks and attractions in Spain, the UK, France, Finland, Portugal, Switzerland, Belgium, the Netherlands, Germany, and Austria. Read more from Sky News:Teenage boy shot dead in LondonMum charged daughter's murderCourt backlog 'unmanageable' The sites include aquariums in Cheshire, Portsmouth, Newquay, Fife, Bristol, and Tynemouth, as well as in Hastings, where the firm also owns ancient caves and a castle attraction in the town. Aspro said: \"In the entire history of Aspro we have never closed any park or attraction. \"We are aware that Oakwood has been a much-loved destination for generations and a rite of passage for many young visitors. It is for this reason we feel such a sense of sadness.\" It is not clear how many people are employed at the site in Pembrokeshire or how many jobs could be lost as a result of the closure."
    },
    {
        "title": "Anybody working for Iran in UK must register or face jail, government announces",
        "description": "Anybody who works for - or is a proxy of - the Iranian state will have to register their presence in the UK or face jail time. ",
        "url": "https://news.sky.com/story/anybody-working-for-iran-in-uk-must-register-or-face-jail-government-announces-13321312",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-iran-israel_6730752.jpg?20241028065931",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-04 14:29:00",
        "Headline": "Iran is the first foreign power to be placed on the enhanced tier of the Foreign Influence Registration Scheme.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Anybody who works for - or is a proxy of - the Iranian state will have to register their presence in the UK or face jail time.  Security minister Dan Jarvis said Iran, including its IRGC intelligence services and the Ministry of Intelligence and Security, is being placed on the \"enhanced tier\" of the Foreign Influence Registration Scheme (FIRS). That means any members of the Iranian state, or anybody acting on behalf of the state, carrying out \"political influence activities\" in the UK will have to register themselves with the scheme. Failure to register is a criminal offence and can mean up to five years in jail. Politics latest: US vice president hits back amid British troops row Iran is the first foreign power to be placed on the enhanced tier of the scheme, which has two levels aimed at strengthening the resilience of the UK's political system against covert foreign influence. The first level is a \"political influence\" tier, involving communications with senior decision makers such as UK ministers, MPs and senior civil servants. Mr Jarvis said the scheme, which he called \"a critical disruptive tool for the UK\", will be up and running by the summer.  State threat reviewer to look at counter-terror laws He also announced Jonathan Hall KC, the UK's independent state threat and terrorism legislation reviewer, has been asked to review the sections of the UK's counter-terrorism framework that could be applied to \"modern day state threats, such as those in Iran\". Mr Hall will look at how the UK proscribes state and state-linked bodies to provide \"more flexibility than is offered under the existing powers\". The IRGC has been sanctioned by the UK but is not a proscribed terror group. The government has faced multiple calls for it to be proscribed. The security minister also announced all 45 UK police forces are being offered training and guidance on state threats activity by counter terrorism policing so they \"know what to do and what to look for\". Iran targeting Jewish and Israeli people In October, the head of MI5 revealed the security service had foiled 20 Iran-backed plots in the UK since the beginning of 2022. Mr Jarvis said the Iranian state has been targeting Jewish and Israeli people in the UK, as well as UK-based Persian-language media critical of Iran. The minister said Iran is trying to \"stifle criticism through intimidation and fear\". \"These threats are unacceptable,\" he said. \"They must and will be defended against at every turn.\" Read more:Starmer's four-point peace plan for UkraineUK to defend Ukraine peace deal with 'coalition of willing' Britons criminally liable if working with foreign power He added threats from Iran are not just physical in nature, with the National Cyber Security Centre seeing \"malicious\" cyber activity conducted by Iranian state-affiliated actors targeting the UK. Mr Jarvis reminded MPs the National Security Act 2023 gave police new powers such as the ability to arrest anybody assisting foreign intelligence services, with a maximum penalty of 14 years in prison. He said the UK security profession, including private investigators, has recently been issued guidance about how the National Security Act applies to them, emphasising how they may be criminally liable if they are working for any foreign power. The minister said the government is exploring further sanctions against other Iranian-linked criminals, and the National Crime Agency will target anyone who assists the IRGC and others to launder their money."
    },
    {
        "title": "Channel 4 News admits output featured Hamas official's son also linked to BBC documentary on Gaza",
        "description": "Channel 4 News has admitted the son of a Hamas official featured in parts of its daily coverage of the Israel-Hamas war.",
        "url": "https://news.sky.com/story/channel-4-news-admits-output-featured-hamas-officials-son-also-linked-to-bbc-documentary-on-gaza-13321414",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-channel-4-channel-four_6846256.jpg?20250304185310",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-04 17:54:00",
        "Headline": "Channel 4 insists it is \"proud of its duly impartial coverage\" throughout the conflict in Gaza adding that it \"has upheld the highest editorial standards\".",
        "Content": "Channel 4 News has admitted the son of a Hamas official featured in parts of its daily coverage of the Israel-Hamas war. The appearance of the son of Ayman Alyazouri - who has worked as Hamas's deputy minister of agriculture - follows an ongoing controversy within the BBC. The BBC's chair Samir Shah told MPs on Tuesday that a BBC documentary which included 13-year-old Abdullah al Yazouri was a \"really, really bad moment\" and \"a dagger to the heart\" to the organisation's impartiality. On Tuesday, Channel 4 issued a statement to confirm Abdullah has also appeared in \"three short news segments for the programme\", although it represented only a \"handful of minutes across hundreds of hours\" of output. \"Abdullah al Yazouri did categorically not appear in any documentary broadcast on Channel 4\" but did appear \"alongside other voices, including Israeli voices, as part of wider packaging and reporting... and in line with our principles of due impartiality,\" the broadcaster said. Channel 4 said no payment was made to the boy or any of his family members, and that, once the foreign reporting team became aware of the role the boy's father held, they \"took a decision not to feature him again\". \"Action was taken to provide additional context to the archived online copy of the reports in which Abdullah features. \n                  BBC apologises over controversial Gaza documentary, with chairman calling it 'a dagger to the heart'\n                 \n                  BBC bosses questioned by MPs after Gaza documentary controversy\n                 \n                  Government calls 'urgent meeting' with BBC over controversial Gaza documentary\n                 \"Where context could not be added, namely to social media, the content was removed in line with standard editorial procedures.\" The broadcaster added it is \"proud of its duly impartial coverage throughout the conflict\" in Gaza and \"has upheld the highest editorial standards\". Read more from Sky News:Thoughts on Meghan's new Netflix seriesOlivier Awards: Nominations are outLittle Britain star issues apology Last year, Channel 4 News was named news programme of the year at the annual Royal Television Society (RTS) awards. RTS said the broadcaster had assured it that no video material featuring Abdullah al Yazouri was featured in their awards entries and it \"had no plans to revoke the awards\". Last week, the BBC issued an apology and removed the documentary Gaza: How To Survive A Warzone from iPlayer, saying it had \"identified serious flaws\" in the making of the programme, which included Abdullah as narrator. A statement from the corporation added that a full \"fact-finding review\" will be undertaken, and that it has \"no plans to broadcast the programme again in its current form or return it to iPlayer\". Last week, Culture Secretary Lisa Nandy called an \"urgent meeting\" with the corporation over the film."
    },
    {
        "title": "Zelenskyy is 'untrustworthy crook and punk', says ex-Trump aide",
        "description": "Volodymyr Zelenskyy has been called a \"crook\" and a \"punk\" by a former top aide to Donald Trump.",
        "url": "https://news.sky.com/story/zelenskyy-is-untrustworthy-crook-and-punk-says-ex-trump-aide-13321486",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-steve-bannon-donald-trump-aide_6846487.jpg?20250304225746",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-04 20:14:00",
        "Headline": "Steve Bannon insisted the US president is \"going out of his way to be a peacemaker\" and Volodymyr Zelenskyy \"had his shot\" but pushed the US too far for security guarantees.",
        "Content": " Volodymyr Zelenskyy has been called a \"crook\" and a \"punk\" by a former top aide to Donald Trump. Steve Bannon also told Sky's Ali Fortescue he thinks the US president should pull out of a planned minerals deal with Ukraine. In a wide-ranging interview on the Politics Hub, the ex-chief strategist said Mr Trump's efforts to improve relations with Russia is a \"brilliant\" move. Mr Bannon said the UK and Europe need to \"wake up\" and realise they do not have to be worried about Russia invading the rest of Europe, as they do not have the army to do it. \"The rapprochement of the United States with Russia breaks the control of the Chinese Community Party... it's a brilliant stroke.\" Follow latest: Zelenskyy's olive branch to Trump He added the EU \"will come along with it\" and insisted Mr Trump is \"going out of his way to be a peacemaker\". \n                  The most significant part of Volodymyr Zelenskyy's olive branch offering to Donald Trump\n                 \n                  Zelenskyy says Ukraine 'ready to come to negotiating table' - after US pauses military aid\n                 \n                  Trump may have talked America into recession before a trade tariff was even imposed\n                 But he was clear about whether the leader should agree to sign a deal with Ukraine's president for rare minerals, which was supposed to happen on Friday until the pair had a heated row in the Oval Office. \"Absolutely not. He [Zelenskyy] had his shot. Zelenskyy is untrustworthy. He's a crook and a punk. And he showed what a punk he was in the Oval Office the other day,\" said Mr Bannon. He suggested the row was prompted by Mr Zelenskyy trying to get security guarantees from the US, something the American public would not accept. 👉 Follow Trump 100 on your podcast app 👈 Minerals deal a 'gift' to Ukraine \"They told him, time and time and time again, do not bring up security guarantees. A security guarantee means... American troops and that will never happen,\" said Mr Bannon. He also said the deal was unnecessary and only a \"very general framework\" anyway, which risked tying the US to the \"future reconstruction of the country\". \"We don't need a rare earth deal. The United States doesn't need rare earths from Ukraine. That was a total gift to him and the Ukrainian people.\" However, sources have told the Reuters news agency that Mr Trump is planning to announce the US and Ukraine's minerals agreement during his address to Congress on Tuesday. Read more from Sky News:JD Vance denies insulting British troopsZelenskyy tries to mend US relationsUkraine Q&A: How long can Ukraine hold on? Mr Trump has paused military aid to Kyiv in the most dramatic step yet in his pivot towards closer ties with Russia. 'Let EU underwrite Ukraine security' Mr Bannon also took aim at European nations, saying defence spending was insufficient: \"Let them [the EU] step up and let them underwrite the security of Ukraine.\" In particular he described the UK's commitment to spend 2.5% of GDP on defence as \"nothing\". He also criticised Britain's combat capabilities saying the economy \"can't afford it\", adding the \"bond market already turfed out Liz Truss\". He said the \"reality\" is that much of NATO did not spend enough on defence, has \"faked\" for decades its capability to take on Russia, and the military alliance would struggle to put up \"two combat divisions\". Mr Bannon also accused \"much of the British establishment\" of being in business with the Chinese Communist Party. In terms of UK politics, he says he is \"a Nigel Farage guy and believes in Reform\". Mr Farage is close to the US president but has had to be slightly more reserved in his praise of him of late - knowing British public opinion is very much behind Mr Zelenskyy and Ukraine."
    },
    {
        "title": "Zelenskyy says Ukraine 'ready to come to negotiating table' - after US pauses military aid",
        "description": "Volodymyr Zelenskyy has said Ukraine is \"ready to come to the negotiating table as soon as possible\" in the search for a \"lasting\" peace with Russia.",
        "url": "https://news.sky.com/story/donald-trump-pauses-military-aid-to-ukraine-us-media-reports-13321048",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-ukrane-russia_6844809.jpg?20250303080030",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-04 16:10:00",
        "Headline": "The fallout from last week's argument in the Oval Office has ratcheted up significantly, with the US suspending arms exports to Kyiv for an as-yet unknown period.",
        "Content": " Volodymyr Zelenskyy has said Ukraine is \"ready to come to the negotiating table as soon as possible\" in the search for a \"lasting\" peace with Russia. The Ukrainian president made the statement on social media hours after Donald Trump's White House announced it was pausing US military aid to Kyiv. He also said he was \"ready to sign\" a deal giving the US access to minerals in Ukraine - which has been a sticking point between the countries in the last week, with Kyiv seeking security guarantees in return. It comes after vice president JD Vance said a potential European peacekeeping force in Ukraine would be \"20,000 troops from some random country that hasn't fought a war in 30 or 40 years\" - sparking anger from a number of UK politicians. Ukraine war latest: White House meeting 'regrettable', says Zelenskyy  The Ukrainian president stopped short of saying sorry in the statement, but outlined how the first stages of a possible peace deal might work. He also reiterated how grateful he was for American support for Ukraine, after Mr Vance criticised him, claiming he had not shown enough gratitude during his explosive White House visit. \n                  Zelenskyy is 'untrustworthy crook and punk', says ex-Trump aide\n                 \n                  The most significant part of Volodymyr Zelenskyy's olive branch offering to Donald Trump\n                 \n                  Trump may have talked America into recession before a trade tariff was even imposed\n                 Mr Zelenskyy added: \"Our meeting in Washington, at the White House on Friday, did not go the way it was supposed to be. \"It is regrettable that it happened this way. It is time to make things right. \"We would like future cooperation and communication to be constructive.\" Trump 'focused on peace' - but attacks Zelenskyy again Earlier, a White House official, speaking anonymously, said: \"President [Trump] has been clear that he is focused on peace. \"We need our partners to be committed to that goal as well. We are pausing and reviewing our aid to ensure that it is contributing to a solution.\" There was no indication about the possible length of the pause, and there's been no comment so far from Ukraine. It comes after the astonishing clash between the two leaders - as well as Mr Vance - in the Oval Office on Friday. Mr Trump's berating of Mr Zelenskyy was condemned by many and has led to a show of support from European leaders as they try to formulate their own way forward. The US president attacked the Ukrainian leader again on Monday, telling reporters he should be \"more appreciative\". Writing on Truth Social, Mr Trump also said Mr Zelenskyy had made \"the worst statement that could have been made\" after he commented that peace was still \"very, very far away\". \"America will not put up with it for much longer!\" he posted. \"It is what I was saying, this guy doesn't want there to be peace as long as he has America's backing,\" the president added. Mr Zelenskyy then posted on X that Ukraine was \"working together with America and our European partners and very much hope on US support on the path to peace\". \"Peace is needed as soon as possible,\" he said. By David Blevins, US correspondent President Trump's decision to pause military aid to Ukraine marks a significant shift in US foreign policy, one previously considered unthinkable. This blow to Ukraine's defences in the face of Russian aggression will be music to the ears of President Putin. US military aid has kept Ukraine in this David and Goliath battle for three years.\n It has funded what military analysts simplify as \"the big stuff\" of battle – artillery, anti-tank weapons, rockets and armoured vehicles. Trump’s decision to push pause disregards efforts by Keir Starmer and other European leaders to devise a peace plan.\n Those already questioning Europe's reliance on the US for defence will conclude they have been given the answer.  But the decision sets President Trump up for a potential confrontation with Republicans, who had approved the funding, in Congress.\n White House sources say he wants President Zelenskyy to go on TV and apologise for the jaw-dropping showdown last Friday. But the Ukrainian president feels he has no apology to make for expressing his doubt about Russia's commitment to peace. Earlier, Trump side-stepped a question about a Kremlin diplomat claiming the US administration and Moscow were now aligned on foreign policy.\n This weakening of Ukraine's defence capability moves that question front and centre as he prepares to address Congress on Tuesday. Despite the diplomatic crisis, Mr Trump has said a deal is still possible. An agreement giving the US access to Ukraine's rare earth metals was meant to have been signed by the two presidents on Friday. It was billed as an important step in a future peace deal - and part payback for aid already received. However, the dramatic falling out has thrown that into jeopardy. Mr Zelenskyy wants the metals deal to include guarantees on halting Russia should it break the terms of any peace agreement. Zelenskyy showed 'lack of respect' Mr Vance suggested on Monday that the metals pact was the best way to secure a lasting end to the war. \"If you want real security guarantees, if you want to actually ensure that Vladimir Putin does not invade Ukraine again, the very best security guarantee is to give Americans economic upside in the future of Ukraine,\" Mr Vance told Fox News. \"That is a way better security guarantee than 20,000 troops from some random country that hasn't fought a war in 30 or 40 years,\" he added.  Mr Vance said Mr Zelenskyy had shown a \"lack of respect\" and \"a certain sense of entitlement\" in Friday's trip to Washington. He repeated that the door was still open if he altered his approach, but told Fox News he \"still isn't there\". European and world leaders - who met Mr Zelenskyy at the weekend - have discussed a potential \"coalition of the willing\" to deploy peacekeepers and deter further Russian aggression. UK Prime Minister Sir Keir Starmer said Britain was prepared to put \"boots on the ground and planes in the air\" under the plan - but it's unclear who else might participate.  Read more:Long-range drones 'weakening Russia's combat ability'Zelenskyy: 'I am exchangeable for NATO membership'The coalition that could secure peace in UkraineTrump's fine line between negotiating and blackmailing He told MPs on Monday that Britain must \"lead from the front\" on supporting Ukraine and the \"security of our continent, the security of our country\". However, the prime minister believes any international deployment of troops must have a US \"backstop\" deterrent to be taken seriously by Russia. America has given around €64bn (£53bn) of military aid to Ukraine, compared with €62bn (£51.3bn) from European nations (including Britain). The overall US total is €114bn (£94bn) and the European one €132bn (£109bn). This includes humanitarian aid and other financial assistance to keep the country running. Following the weekend summit, the UK also pledged £1.6bn in finance for Ukraine to buy another 5,000 air defence missiles."
    },
    {
        "title": "Ousted PM Sheikh Hasina will stand trial for crimes against humanity, Bangladesh's interim leader says",
        "description": "The interim leader of Bangladesh, Muhammad Yunus, has told Sky News that former prime minister Sheikh Hasina will stand trial for crimes against humanity.",
        "url": "https://news.sky.com/story/ousted-pm-sheikh-hasina-will-stand-trial-for-crimes-against-humanity-bangladeshs-interim-leader-says-13321285",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-muhammad-yunus-bangladesh_6846217.jpg?20250304170817",
        "type": "World",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-03-04 13:42:00",
        "Headline": "A trial will take place over ousted PM Sheikh Hasina's 'war on terror', whether she is present in Bangladesh or in absentia, the country's interim leader tells Sky News' Asia correspondent Cordelia Lynch.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  The interim leader of Bangladesh, Muhammad Yunus, has told Sky News that former prime minister Sheikh Hasina will stand trial for crimes against humanity. Ms Hasina is accused of overseeing a system of enforced disappearances during her time in government, as well as the mass killing of protesters in July and August last year. Speaking to Sky News, Professor Yunus said: \"A trial will be taking place. Not only her, but also all the people who are associated with her - her family members, her clients or associates.\" Ms Hasina, who was toppled by the protests and is currently in exile in India, is accused of overseeing a network of secret detention centres where it's alleged her political opponents were interrogated, tortured and some killed - all under the banner of a \"war on terror\". Bangladesh has issued two arrest warrants for her. Professor Yunus said they had sent \"formal letters\" but received \"no official response\" from New Delhi. He insisted, however, that Ms Hasina would face the court, whether physically present in Bangladesh or in absentia, in India. Read more: Inside Bangladesh's secret prisons \n                  UK investigators may assist with Bangladeshi probes into alleged corruption\n                 \n                  Electrocuted on their genitals, mouths sewn up, nails ripped off: Inside Bangladesh's 'death squad' jails\n                 \n                  Electrocuted, beaten, and left to die: The horrors of Bangladesh's 'death squad' jails  \n                 Professor Yunus recently visited one of the now infamous secret jails, code-named the 'House of Mirrors'. The economics professor, known as the 'banker to the poor' and now chief adviser of Bangladesh, said he was beyond shocked at what he saw. \"This is just the ugliest thing that you can see, you can feel, or you can observe,\" he said. Ms Hasina is accused of using her security forces and police to oversee the abduction, torture and murder of hundreds of activists. She denies the allegations and says she's being politically persecuted. Ms Hasina, her close aides and many of those accused of overseeing a network of as many as 800 secret jails have fled Bangladesh. Professor Yunus said the number and range of people involved in the alleged crimes was \"taking time\" to work through. \"Everybody was involved in it all,\" he said. \"The whole government was involved in it. So you cannot distinguish who was really and enthusiastically doing it, who was doing it under orders and who was not quite supportive but carrying out those kinds of things.\" Ms Hasina, the military and police are also accused of a violent crackdown on protesters in July and August which the UN estimates killed as many as 1,400 people in the days before the former prime minister fled. Professor Yunus tried to manage expectations around how quickly the families of victims will see justice, and whether that will happen under his watch.  Elections for a new government in the country could happen as early as December. \"Some will get punished, some will still be under the process, some will still be untraceable,\" he said. Investigations into alleged corruption The chief adviser has had a large in-tray to deal with since taking over a country in turmoil, including anti-corruption probes into those connected to Ms Hasina. British Labour MP Tulip Siddiq, who is Ms Hasina's niece, is one of those being investigated by Bangladesh's Anti-Corruption Commission (ACC). Professor Yunus said the case against her was \"serious\", that she had a large amount of \"wealth left behind\" in the country and \"everything\" would be looked at. Ms Siddiq resigned as anti-corruption minister in January after being named in the investigation in Bangladesh. A spokesperson for the London MP said she \"totally denies the claims\" and had \"not been contacted on these matters\". Managing refugee crisis The influx of Rohingya refugees into Bangladesh is another challenge for Professor Yunus's leadership. There's been a sharp rise in the number of the mainly Muslim minority fleeing Myanmar into Bangladesh after escalating violence in the country's long-running civil war. Professor Yunus said they were now in talks with rebel groups in Myanmar about the possibility of a \"safe zone\" to eventually help the Rohingya refugees to return to their homeland. He also acknowledged big problems in Cox's Bazar in Bangladesh, home to the largest refugee camp in the world, where an estimated one million Rohingya refugees have fled to - and where \"violence, drugs and paramilitary activities\" are rife. The tension, Professor Yunus said, \"will not disappear\"."
    },
    {
        "title": "The most significant part of Volodymyr Zelenskyy's olive branch offering to Donald Trump",
        "description": "Ukraine's president is offering an olive branch to Donald Trump with a dramatic public message aimed at mending their relationship and ending Russia's war.",
        "url": "https://news.sky.com/story/the-most-significant-part-of-volodymyr-zelenskyys-olive-branch-offering-to-donald-trump-13321407",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donetsk-ukraine-russia-war-invasion_6839032.jpg?20250304190400",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2025-03-04 17:02:00",
        "Headline": "The Ukraine leader described Friday's Oval Office bust-up with the US president as \"regrettable\", adding that now \"is time to make things right\".",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  Ukraine's president is offering an olive branch to Donald Trump with a dramatic public message aimed at mending their relationship and ending Russia's war. Volodymyr Zelenskyy chose social media - the US leader's favourite mode of communication - to make his point. He did not go so far as to apologise for a fiery bust-up with Mr Trump at the Oval Office last Friday - a move that some members of the US administration have called for, even though it was the American president and his deputy JD Vance who laid into Mr Zelenskyy. Instead, he described the encounter as \"regrettable\", saying it \"did not go the way it was supposed to be\" and it was \"time to make things right\". Most significantly though was his spelling out of a vision for the first stage of how Russia's war with Ukraine could end. Pushing back on false claims by Trump allies such as Elon Musk that Mr Zelenskyy wants an endless war, he said that Ukraine is committed to peace and is ready to come to the negotiating table as soon as possible. Crucially, he said: \"We are ready to work fast to end the war, and the first stages could be the release of prisoners and truce in the sky - ban on missiles, long-ranged drones, bombs on energy and other civilian infrastructure - and truce in the sea immediately, if Russia will do the same.\" \n                  Zelenskyy is 'untrustworthy crook and punk', says ex-Trump aide\n                 \n                  Zelenskyy says Ukraine 'ready to come to negotiating table' - after US pauses military aid\n                 \n                  Trump may have talked America into recession before a trade tariff was even imposed\n                 Appealing to the US president's ego, he praised Mr Trump's \"strong leadership\" and repeated his gratitude for past American support - again responding to criticism from the American commander in chief and his team that he is not showing enough gratitude. 👉 Follow Trump 100 on your podcast app 👈 He also said Kyiv was ready to sign a key minerals deal with Washington - something else Mr Trump is seeking. This message appears to be an attempt by Mr Zelenskyy to steer his relationship with Mr Trump back on track and to map out his idea for an end to the war - a conflict that Ukraine did not seek but which was brought to its land by Russia's invading forces. Read more from Sky News:Trump: Dealmaker or blackmailer?Canada warns 'no winners in a trade war'US may have slumped into recession Key now will be how the US president responds. Will Mr Zelenskyy's expression of regret and clear wish to end the war provide enough of an off-ramp for Mr Trump to defuse the row and - for the sake of Ukraine's ability to defend itself - switch back on the flow of military assistance to the country? Another major factor, of course, is how Vladimir Putin reacts and whether he could countenance a limited ceasefire in a war that he started and - unlike Mr Zelenskyy - appears to have no genuine desire to halt."
    },
    {
        "title": "Trump treads fine line between striking a deal and blackmailing Ukraine",
        "description": "Is this the art of the deal or the art of blackmail?",
        "url": "https://news.sky.com/story/trump-treads-fine-line-between-striking-a-deal-and-blackmailing-ukraine-13321092",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-volodymyr-zelenskyy_6842373.jpg?20250228152557",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-03-04 07:25:00",
        "Headline": "Donald Trump has paused US military aid to Ukraine, days after his very public row with its president Volodymyr Zelenskyy.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  Is this the art of the deal or the art of blackmail? US President Donald Trump's evening announcement to suspend US military aid to Ukraine came after a weekend through which the question had been: \"He wouldn't actually do that, would he?\" But given his actions over the past 43 days, his rhetoric during the campaign, and his truly transactional negotiating style, the answer was always to be \"of course he would\". It still doesn't make the move any less dramatic. Follow live: Trump decision 'devastating' and 'music to Putin's ears'  As late as Monday afternoon in the White House, the president claimed he hadn't discussed the prospect of cutting or pausing American military weapons shipments to Ukraine. But it was clear his anger and animosity against Volodymyr Zelenskyy after the Friday showdown had been growing. And just an hour or two later on Monday, after a meeting with his defence and security officials (who are all wholly aligned to his thinking, unlike those in his first administration) he had paused all military aid. Sources both sides of the Atlantic have told me this is just the latest step in his game of brinkmanship. The White House emphasis on \"pause\" is important and hints at the moves they expect Zelenskyy now to make. 👉 Follow Trump 100 on your podcast app 👈 President Trump is determined to pressure President Zelenskyy to sign his minerals deal - the first step in his peace plan, which he eventually expects will culminate in Ukraine and Russia around a negotiating table. He has not explained quite how this happens or what concessions Russian President Vladimir Putin might be asked to make. In the immediate term, Trump wants to be able to hail the mineral deal as a massive win for the American people as a material return for the money they sent to fund Ukraine's war, and as the first step to peace in Ukraine. So much of this is about a domestic trumpeting of his successes as he sees them. He had hoped to do that tonight at his address to a joint session of Congress. Zelenskyy is resisting not because he doesn't want peace but because he wants American commitments that it has his back militarily if he is to enter into peace talks with an unreliable Putin which will require him to make concessions. He wants American security guarantees. All of Europe wants those, while committing to spending more on defence themselves. They are alarmed that Trump won't give them yet. Read more from Sky News:Trump confirms Mexico and Canada tariffsCan Europe save Ukraine? Every European leader was privately appalled by Trump's treatment of Zelenskyy last Friday. But some European diplomats have told me they think Zelenskyy took the bait when he could have reacted differently. Zelenskyy's friends in Europe may now be quietly telling him to shift position, mend the rift with Trump, sign his deal, commit to a ceasefire and then work, with them, to push Trump on the security guarantees. In Trump's brutally transactional world where, like it or not, he holds the cards, it may be the only way."
    },
    {
        "title": "Ukraine military aid: What's at stake as Trump halts supplies",
        "description": "The Trump administration's decision to suspend all US military aid to Ukraine has put billions of dollars' worth of weapons and equipment in limbo. Sky News examines the scale of US military aid so far and what's now at risk.",
        "url": "https://news.sky.com/story/ukraine-military-aid-whats-at-stake-as-trump-halts-supplies-13321318",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-zelenskyy-ukraine-trump_6846067.jpg?20250304145901",
        "type": "World",
        "Author": "Ben van der Merwe, Saywah Mahmood and Sophia Massam, Data and Forensics Unit",
        "Date Published": "2025-03-04 14:55:00",
        "Headline": "The move blocks billions of dollars in crucial shipments of ammunition, vehicles, and equipment, some of which were agreed to under Joe Biden.",
        "Content": "By Ben van der Merwe, Saywah Mahmood and Sophia Massam, Data and Forensics Unit  The Trump administration's decision to suspend all US military aid to Ukraine has put billions of dollars' worth of weapons and equipment in limbo. Sky News examines the scale of US military aid so far and what's now at risk. The US has sent $21bn of military aid to Ukraine since the war began. \"Roughly half [of military equipment sent to Ukraine] is provided by the Americans,\" says former UK Ministry of Defence analyst Paul Moorcraft. \"But it's the high-end stuff - whether it's intelligence, satellites or tanks. This will cripple the Ukrainian armed forces within about two months.\" Among those key pieces of equipment is the US-made HIMARS, a medium-range rocket launcher. Ukrainian President Volodomyr Zelenskyy praised the weapon following his country's 2022 counteroffensive, saying: \"HIMARS and other precision weapons are turning the course of war in our favour.\" Together with the US-made ATACMS, a supersonic ballistic missile, the HIMARS has allowed Ukraine to strike logistics hubs and airfields deep inside Russian-held territory. The US has supplied 32 of the 35 HIMARS systems known to have been delivered to Ukraine. Sky News military analyst Sean Bell says that these two systems, along with US-supplied Howitzer artillery, are the most crucial pieces of equipment for Ukraine's efforts to hold the front line. Heavy weaponry is crucial The war in Ukraine has become dominated by ground warfare, with the result that heavy weaponry such as tanks and artillery have become particularly important. The US has allocatedi $14.6bn worth of heavy weaponry to Ukraine since the war began. That's by far the largest amount given by any individual country, but significantly smaller than the amount given by the EU as a whole ($18.9bn). However, Ukraine has relied heavily on the US for certain types of equipment, particularly armoured vehicles and tanks. Over the course of 2024, the US announced that it would send 5,168 heavy weapons to Ukraine, including Stryker and M113 armoured personnel carriers and counter-artillery radars. It is unclear how many have actually been received by Ukraine, as the US has not publicly acknowledged delivery of any of the items. The US deliveries have also included at least 7,000 Javelin anti-tank missiles. The missiles were first delivered to Ukraine during President Trump's first term in office in 2017, before Russia's full-scale invasion of the country. President Zelenskyy highlighted the weapons in a social media post on Tuesday, writing: \"We remember the moment when things changed when President Trump provided Ukraine with Javelins. We are grateful for this.\" Moorcraft says that high-end equipment, such as the US-made Abrams tanks and Bradley fighting vehicles, require frequent repairs using spare parts that only the US can provide. It also remains unclear whether the US plans to cut Ukraine off from Starlink, the satellite-based communications network owned by Elon Musk. Last month, it was reported that the US had threatened to cut Ukraine off from the network if President Zelenskyy did not agree to sign a deal over the country's critical minerals. The deal collapsed last week after a visit by Mr Zelenskyy to the White House ended in acrimony. \"If Elon Musk shuts down Starlink, that's going to be extremely bad news,\" says Mark Laity, a former NATO spokesperson. \"The Ukrainian communication system is very based on the secure Starlink, and the Americans are paying for a lot of that.\" Ukraine is losing equipment as the fighting continues Without continued weapons deliveries, Ukraine's capabilities will degrade over time as equipment is damaged, destroyed or captured. In the six weeks since Mr Trump's inauguration, defence analytics firm Oryx has verified the loss of hundreds of Ukrainian vehicles, including 57 tanks. Among those are items for which Ukraine is heavily reliant on the US, such as the M777 Howitzer. Since the war began, the US has supplied 126 of the 152 M777s received by Ukraine. At least 98 of Ukraine's M777s are known to have been lost in combat. Ukraine may have to ration its supplies \"Most things that the US supply can be replaced in terms of systems,\" says former NATO spokesperson Mark Laity. \"The problem is we don't have enough of them.\" European countries have long spent less on their militaries than the US. In 2023, the continent spent just 1.6% of its GDP on defence - less than half of what the US spent (3.9%). The UK and France, the only two countries to have pledged their forces to a hypothetical peacekeeping force, have a combined 515 combat-capable aircraft. The US alone has an estimated 3,093, according to the International Institute for Strategic Studies. The UK was forced to cut back its donations to Ukraine in mid-2023, after the Ministry of Defence assessed that continued donations would pose \"unacceptable risks to the UK's military readiness\". Mark Laity expects that one of the most immediate effects of Mr Trump's decision will be that Ukraine begins to ration its remaining stockpiles of ammunition, including air defence munitions used to defend against nightly Russian drone attacks. The US-made PATRIOT missile systems have proven critical in limiting the damage from these strikes. \"They will probably have to be more sparing with air defence systems,\" says Laity. \"They may well let certain targets get hit, because they've got to protect the high-value assets.\" The US has allocated at least two PATRIOT missile systems for Ukraine, though it is unconfirmed how many have been delivered. Ukraine is known to operate at least four PATRIOT systems - three given by Germany, and one from Romania. Sky News military analyst Sean Bell says the \"inevitable consequence\" of such rationing would be \"a higher death toll among Ukrainian civilians\". Russia's use of long-range drones against Ukrainian cities has escalated in recent months. Over the course of February, Ukraine's air force reported attacks by 3,902 Russian drones - compared to just 328 in June. Laity says these attacks are designed primarily to use up Ukraine's stocks of air defence munitions. \"If you were the Russians, what you were now going to do is probably try to redouble these attacks in order to wear down the Ukrainians quicker,\" says Laity. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open-source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Kim Jong Un's sister threatens response to US aircraft carrier's deployment in South Korea",
        "description": "The sister of North Korean leader Kim Jong Un has threatened the Trump administration with retaliatory action for stepping up \"provocations\" with the deployment of a US aircraft carrier to South Korea.",
        "url": "https://news.sky.com/story/kim-jong-uns-sister-threatens-response-to-us-aircraft-carriers-deployment-in-south-korea-13321195",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-kim-jong-un-kim-yo-jing_6845834.jpg?20250304111852",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-04 10:59:00",
        "Headline": "The warning from Kim Yo Jong follows the arrival of the USS Carl Vinson and its strike group at the South Korean port of Busan  - which she condemned as \"confrontation hysteria of the US and its stooges\".",
        "Content": "The sister of North Korean leader Kim Jong Un has threatened the Trump administration with retaliatory action for stepping up \"provocations\" with the deployment of a US aircraft carrier to South Korea. The warning from Kim Yo Jong, a powerful official in her brother's regime, implies North Korea will likely ramp up weapons testing activities and maintain its confrontational posture against the US. In a statement carried by state media, she accused the US of showing \"its most hostile and confrontational will\" to North Korea. It follows the deployments of the USS Carl Vinson and other powerful US military assets this week, as well as joint US-South Korean military drills this year. She said her country would deliver a \"threatening\" response to the arrival of the US aircraft carrier in the region which she condemned as the \"confrontation hysteria of the US and its stooges\". \"The DPRK is also planning to carefully examine the option for increasing the actions threatening the security of the enemy at the strategic level to cope with the fact that the deployment of US strategic assets in the Korean Peninsula has become a vicious habit and adversely affects the security of the DPRK,\" she said, using the acronym of North Korea's official name, the Democratic People's Republic of Korea. Observers and experts said the statement suggests North Korea may test launch powerful missiles designed to strike the US mainland or American military bases in the region. The USS Carl Vinson and its strike group arrived at the South Korean port of Busan on Sunday, the latest temporary deployment of a US strategic asset. The move aimed to illustrate the strength of the US-South Korean military alliance in the face of North Korean threats. The US carrier's arrival came four days after North Korea conducted cruise missile tests - its fourth missile launch event this year. It comes despite US President Donald Trump saying he would contact Kim Jong Un to revive diplomacy. North Korea has not responded to Mr Trump's comments. Read more from Sky News:Trump pauses US military aid to UkraineTrump confirms Mexico and Canada tariffs Mr Kim and Mr Trump met three times between 2018 and 2019 during the US president's first term in office to discuss the future of North Korea's nuclear programme. Their high-stakes diplomacy eventually collapsed due to wrangling over US-led economic sanctions on North Korea."
    },
    {
        "title": "World's largest iceberg runs aground in South Georgia and blocks off key penguin feeding ground",
        "description": "After nearly 40 years at sea, the world's largest iceberg has run aground on the remote British overseas territory of South Georgia, one of the biologically rich habitats on Earth home to millions of penguins, seals and endangered albatross.",
        "url": "https://news.sky.com/story/worlds-largest-iceberg-runs-aground-in-south-georgia-and-blocks-off-key-penguin-feeding-ground-13321250",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-iceberg-a23a-rrs-sir-david-attenborough_6845918.jpg?20250304123942",
        "type": "World",
        "Author": "Tom Clarke",
        "Date Published": "2025-03-04 12:36:00",
        "Headline": "The so-called A23a iceberg, the world's largest, has run aground in South Georgia after almost 40 years at sea, threatening important penguin colonies.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n After nearly 40 years at sea, the world's largest iceberg has run aground on the remote British overseas territory of South Georgia, one of the biologically rich habitats on Earth home to millions of penguins, seals and endangered albatross. The vast \"megaberg\" named A23a covers 1,200 square miles - roughly the size of Gloucestershire. Now it has grounded it is expected to break up, threatening to prevent penguins and other sea-life from accessing crucial feeding grounds and the fishing vessels operating in the area. Last week as it approached South Georgia it was moving \"very fast,\" according to Dr Andrew Meijers, an oceanographer at the British Antarctic Survey in Cambridge. \"It was covering 30km a day, fairly ripping along for an iceberg,\" he said. Then on Friday it suddenly stopped, its corner snagging the seafloor about 40 miles off the southwest coast of South Georgia.  The stress of the collision, tides and currents are likely to speed the breakup of the 'berg in the warmer waters - 1,200 miles from Antarctica where it began its long, slow journey. A23a broke off from Antarctica's Filchner-Ronne ice shelf in 1986, carrying a Soviet research station Druzhnaya built on it into the Wedell Sea. The 'berg barely moved for 20 years, then in 2020 began drifting slowly north. It spent six months last year spinning in a revolving ocean current in the Southern Ocean before finally breaking free in the New Year on a collision course with South Georgia. Apart from a handful of visiting scientists and officials representing the Falkland Islands-based government of South Georgia, the island is uninhabited - by people at least. \"This area is extremely important for penguins,\" said Peter Fretwell, a geospatial information scientist also at the British Antarctic Survey. Several million penguins including macaroni, chinstrap, gentoo and king penguins call South Georgia home. As do several species of albatross, elephant seals and fur seals. The ocean around the islands is also increasingly important for whales, now returning after hunting them was banned. The iceberg is blocking a vast area of ocean that is an important feeding ground for macaroni penguins - South Georgia is home to one of the world's largest colonies. As it melts, A23a will be releasing millions of gallons of fresh water into the ocean each day. Because fresh water floats on top of heavier seawater, it has the potential to force nutrients - and therefore the shrimp-like krill penguins feed on - deeper into the water column. \"If it's very clean water, it will introduce a halo of low-productivity around the iceberg,\" said Mr Fretwell. However, the opposite could also happen. Some icebergs carry a lot of sediment with them, scraped from the rocks of Antarctica. Once released into the ocean this sediment can add nutrients to the water - potentially boosting the amount of food available for penguins. Megabergs of this size are rare, too few for scientists to know if they're becoming more common or not. However, they're emblematic of a clear warming trend in the Antarctic that is causing the increasingly rapid melting of its ice sheets, which are the world's largest. The continent is losing around 150 billion tonnes of water in the form of ice a year, half carried away as icebergs, the rest due to ice melting directly off the continent itself. A key concern is whether all that fresh water will disrupt what is effectively our planet's cooling system. The Antarctic Circumpolar Current - a conveyor belt of cold water running around Antarctica - is the single most important system that removes rising levels of heat from our atmosphere. Warm air from the rest of the planet heats the surface waters, and currents then draw this warmer water down, replacing it with cooler water from the depths of the ocean. \"It does all of the heavy lifting in terms of trapping heat from global warming,\" said Dr Meijers. Microscopic plants - phytoplankton - in the region also absorb the most planet-warming carbon dioxide, which is, like the warmer water, carried deep into the oceans and stored there. A recent study suggests fresh water from melting icebergs and the Antarctic continent is already slowing this circumpolar current and may reduce its speed by 20% by 2050. A potentially worrying \"positive feedback\" that could further exacerbate global warming."
    },
    {
        "title": "Zelenskyy says Ukraine 'ready to come to negotiating table' - after US pauses military aid",
        "description": "Volodymyr Zelenskyy has said Ukraine is \"ready to come to the negotiating table as soon as possible\" in the search for a \"lasting\" peace with Russia.",
        "url": "https://news.sky.com/story/donald-trump-pauses-military-aid-to-ukraine-us-media-reports-13321048",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-ukrane-russia_6844809.jpg?20250303080030",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-04 16:10:00",
        "Headline": "The fallout from last week's argument in the Oval Office has ratcheted up significantly, with the US suspending arms exports to Kyiv for an as-yet unknown period.",
        "Content": " Volodymyr Zelenskyy has said Ukraine is \"ready to come to the negotiating table as soon as possible\" in the search for a \"lasting\" peace with Russia. The Ukrainian president made the statement on social media hours after Donald Trump's White House announced it was pausing US military aid to Kyiv. He also said he was \"ready to sign\" a deal giving the US access to minerals in Ukraine - which has been a sticking point between the countries in the last week, with Kyiv seeking security guarantees in return. It comes after vice president JD Vance said a potential European peacekeeping force in Ukraine would be \"20,000 troops from some random country that hasn't fought a war in 30 or 40 years\" - sparking anger from a number of UK politicians. Ukraine war latest: White House meeting 'regrettable', says Zelenskyy  The Ukrainian president stopped short of saying sorry in the statement, but outlined how the first stages of a possible peace deal might work. He also reiterated how grateful he was for American support for Ukraine, after Mr Vance criticised him, claiming he had not shown enough gratitude during his explosive White House visit. \n                  Zelenskyy is 'untrustworthy crook and punk', says ex-Trump aide\n                 \n                  The most significant part of Volodymyr Zelenskyy's olive branch offering to Donald Trump\n                 \n                  Trump may have talked America into recession before a trade tariff was even imposed\n                 Mr Zelenskyy added: \"Our meeting in Washington, at the White House on Friday, did not go the way it was supposed to be. \"It is regrettable that it happened this way. It is time to make things right. \"We would like future cooperation and communication to be constructive.\" Trump 'focused on peace' - but attacks Zelenskyy again Earlier, a White House official, speaking anonymously, said: \"President [Trump] has been clear that he is focused on peace. \"We need our partners to be committed to that goal as well. We are pausing and reviewing our aid to ensure that it is contributing to a solution.\" There was no indication about the possible length of the pause, and there's been no comment so far from Ukraine. It comes after the astonishing clash between the two leaders - as well as Mr Vance - in the Oval Office on Friday. Mr Trump's berating of Mr Zelenskyy was condemned by many and has led to a show of support from European leaders as they try to formulate their own way forward. The US president attacked the Ukrainian leader again on Monday, telling reporters he should be \"more appreciative\". Writing on Truth Social, Mr Trump also said Mr Zelenskyy had made \"the worst statement that could have been made\" after he commented that peace was still \"very, very far away\". \"America will not put up with it for much longer!\" he posted. \"It is what I was saying, this guy doesn't want there to be peace as long as he has America's backing,\" the president added. Mr Zelenskyy then posted on X that Ukraine was \"working together with America and our European partners and very much hope on US support on the path to peace\". \"Peace is needed as soon as possible,\" he said. By David Blevins, US correspondent President Trump's decision to pause military aid to Ukraine marks a significant shift in US foreign policy, one previously considered unthinkable. This blow to Ukraine's defences in the face of Russian aggression will be music to the ears of President Putin. US military aid has kept Ukraine in this David and Goliath battle for three years.\n It has funded what military analysts simplify as \"the big stuff\" of battle – artillery, anti-tank weapons, rockets and armoured vehicles. Trump’s decision to push pause disregards efforts by Keir Starmer and other European leaders to devise a peace plan.\n Those already questioning Europe's reliance on the US for defence will conclude they have been given the answer.  But the decision sets President Trump up for a potential confrontation with Republicans, who had approved the funding, in Congress.\n White House sources say he wants President Zelenskyy to go on TV and apologise for the jaw-dropping showdown last Friday. But the Ukrainian president feels he has no apology to make for expressing his doubt about Russia's commitment to peace. Earlier, Trump side-stepped a question about a Kremlin diplomat claiming the US administration and Moscow were now aligned on foreign policy.\n This weakening of Ukraine's defence capability moves that question front and centre as he prepares to address Congress on Tuesday. Despite the diplomatic crisis, Mr Trump has said a deal is still possible. An agreement giving the US access to Ukraine's rare earth metals was meant to have been signed by the two presidents on Friday. It was billed as an important step in a future peace deal - and part payback for aid already received. However, the dramatic falling out has thrown that into jeopardy. Mr Zelenskyy wants the metals deal to include guarantees on halting Russia should it break the terms of any peace agreement. Zelenskyy showed 'lack of respect' Mr Vance suggested on Monday that the metals pact was the best way to secure a lasting end to the war. \"If you want real security guarantees, if you want to actually ensure that Vladimir Putin does not invade Ukraine again, the very best security guarantee is to give Americans economic upside in the future of Ukraine,\" Mr Vance told Fox News. \"That is a way better security guarantee than 20,000 troops from some random country that hasn't fought a war in 30 or 40 years,\" he added.  Mr Vance said Mr Zelenskyy had shown a \"lack of respect\" and \"a certain sense of entitlement\" in Friday's trip to Washington. He repeated that the door was still open if he altered his approach, but told Fox News he \"still isn't there\". European and world leaders - who met Mr Zelenskyy at the weekend - have discussed a potential \"coalition of the willing\" to deploy peacekeepers and deter further Russian aggression. UK Prime Minister Sir Keir Starmer said Britain was prepared to put \"boots on the ground and planes in the air\" under the plan - but it's unclear who else might participate.  Read more:Long-range drones 'weakening Russia's combat ability'Zelenskyy: 'I am exchangeable for NATO membership'The coalition that could secure peace in UkraineTrump's fine line between negotiating and blackmailing He told MPs on Monday that Britain must \"lead from the front\" on supporting Ukraine and the \"security of our continent, the security of our country\". However, the prime minister believes any international deployment of troops must have a US \"backstop\" deterrent to be taken seriously by Russia. America has given around €64bn (£53bn) of military aid to Ukraine, compared with €62bn (£51.3bn) from European nations (including Britain). The overall US total is €114bn (£94bn) and the European one €132bn (£109bn). This includes humanitarian aid and other financial assistance to keep the country running. Following the weekend summit, the UK also pledged £1.6bn in finance for Ukraine to buy another 5,000 air defence missiles."
    },
    {
        "title": "Zelenskyy is 'untrustworthy crook and punk', says ex-Trump aide",
        "description": "Volodymyr Zelenskyy has been called a \"crook\" and a \"punk\" by a former top aide to Donald Trump.",
        "url": "https://news.sky.com/story/zelenskyy-is-untrustworthy-crook-and-punk-says-ex-trump-aide-13321486",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-steve-bannon-donald-trump-aide_6846487.jpg?20250304225746",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-04 20:14:00",
        "Headline": "Steve Bannon insisted the US president is \"going out of his way to be a peacemaker\" and Volodymyr Zelenskyy \"had his shot\" but pushed the US too far for security guarantees.",
        "Content": " Volodymyr Zelenskyy has been called a \"crook\" and a \"punk\" by a former top aide to Donald Trump. Steve Bannon also told Sky's Ali Fortescue he thinks the US president should pull out of a planned minerals deal with Ukraine. In a wide-ranging interview on the Politics Hub, the ex-chief strategist said Mr Trump's efforts to improve relations with Russia is a \"brilliant\" move. Mr Bannon said the UK and Europe need to \"wake up\" and realise they do not have to be worried about Russia invading the rest of Europe, as they do not have the army to do it. \"The rapprochement of the United States with Russia breaks the control of the Chinese Community Party... it's a brilliant stroke.\" Follow latest: Zelenskyy's olive branch to Trump He added the EU \"will come along with it\" and insisted Mr Trump is \"going out of his way to be a peacemaker\". \n                  The most significant part of Volodymyr Zelenskyy's olive branch offering to Donald Trump\n                 \n                  Zelenskyy says Ukraine 'ready to come to negotiating table' - after US pauses military aid\n                 \n                  Trump may have talked America into recession before a trade tariff was even imposed\n                 But he was clear about whether the leader should agree to sign a deal with Ukraine's president for rare minerals, which was supposed to happen on Friday until the pair had a heated row in the Oval Office. \"Absolutely not. He [Zelenskyy] had his shot. Zelenskyy is untrustworthy. He's a crook and a punk. And he showed what a punk he was in the Oval Office the other day,\" said Mr Bannon. He suggested the row was prompted by Mr Zelenskyy trying to get security guarantees from the US, something the American public would not accept. 👉 Follow Trump 100 on your podcast app 👈 Minerals deal a 'gift' to Ukraine \"They told him, time and time and time again, do not bring up security guarantees. A security guarantee means... American troops and that will never happen,\" said Mr Bannon. He also said the deal was unnecessary and only a \"very general framework\" anyway, which risked tying the US to the \"future reconstruction of the country\". \"We don't need a rare earth deal. The United States doesn't need rare earths from Ukraine. That was a total gift to him and the Ukrainian people.\" However, sources have told the Reuters news agency that Mr Trump is planning to announce the US and Ukraine's minerals agreement during his address to Congress on Tuesday. Read more from Sky News:JD Vance denies insulting British troopsZelenskyy tries to mend US relationsUkraine Q&A: How long can Ukraine hold on? Mr Trump has paused military aid to Kyiv in the most dramatic step yet in his pivot towards closer ties with Russia. 'Let EU underwrite Ukraine security' Mr Bannon also took aim at European nations, saying defence spending was insufficient: \"Let them [the EU] step up and let them underwrite the security of Ukraine.\" In particular he described the UK's commitment to spend 2.5% of GDP on defence as \"nothing\". He also criticised Britain's combat capabilities saying the economy \"can't afford it\", adding the \"bond market already turfed out Liz Truss\". He said the \"reality\" is that much of NATO did not spend enough on defence, has \"faked\" for decades its capability to take on Russia, and the military alliance would struggle to put up \"two combat divisions\". Mr Bannon also accused \"much of the British establishment\" of being in business with the Chinese Communist Party. In terms of UK politics, he says he is \"a Nigel Farage guy and believes in Reform\". Mr Farage is close to the US president but has had to be slightly more reserved in his praise of him of late - knowing British public opinion is very much behind Mr Zelenskyy and Ukraine."
    },
    {
        "title": "The most significant part of Volodymyr Zelenskyy's olive branch offering to Donald Trump",
        "description": "Ukraine's president is offering an olive branch to Donald Trump with a dramatic public message aimed at mending their relationship and ending Russia's war.",
        "url": "https://news.sky.com/story/the-most-significant-part-of-volodymyr-zelenskyys-olive-branch-offering-to-donald-trump-13321407",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donetsk-ukraine-russia-war-invasion_6839032.jpg?20250304190400",
        "type": "US",
        "Author": "Deborah Haynes",
        "Date Published": "2025-03-04 17:02:00",
        "Headline": "The Ukraine leader described Friday's Oval Office bust-up with the US president as \"regrettable\", adding that now \"is time to make things right\".",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  Ukraine's president is offering an olive branch to Donald Trump with a dramatic public message aimed at mending their relationship and ending Russia's war. Volodymyr Zelenskyy chose social media - the US leader's favourite mode of communication - to make his point. He did not go so far as to apologise for a fiery bust-up with Mr Trump at the Oval Office last Friday - a move that some members of the US administration have called for, even though it was the American president and his deputy JD Vance who laid into Mr Zelenskyy. Instead, he described the encounter as \"regrettable\", saying it \"did not go the way it was supposed to be\" and it was \"time to make things right\". Most significantly though was his spelling out of a vision for the first stage of how Russia's war with Ukraine could end. Pushing back on false claims by Trump allies such as Elon Musk that Mr Zelenskyy wants an endless war, he said that Ukraine is committed to peace and is ready to come to the negotiating table as soon as possible. Crucially, he said: \"We are ready to work fast to end the war, and the first stages could be the release of prisoners and truce in the sky - ban on missiles, long-ranged drones, bombs on energy and other civilian infrastructure - and truce in the sea immediately, if Russia will do the same.\" \n                  Zelenskyy is 'untrustworthy crook and punk', says ex-Trump aide\n                 \n                  Zelenskyy says Ukraine 'ready to come to negotiating table' - after US pauses military aid\n                 \n                  Trump may have talked America into recession before a trade tariff was even imposed\n                 Appealing to the US president's ego, he praised Mr Trump's \"strong leadership\" and repeated his gratitude for past American support - again responding to criticism from the American commander in chief and his team that he is not showing enough gratitude. 👉 Follow Trump 100 on your podcast app 👈 He also said Kyiv was ready to sign a key minerals deal with Washington - something else Mr Trump is seeking. This message appears to be an attempt by Mr Zelenskyy to steer his relationship with Mr Trump back on track and to map out his idea for an end to the war - a conflict that Ukraine did not seek but which was brought to its land by Russia's invading forces. Read more from Sky News:Trump: Dealmaker or blackmailer?Canada warns 'no winners in a trade war'US may have slumped into recession Key now will be how the US president responds. Will Mr Zelenskyy's expression of regret and clear wish to end the war provide enough of an off-ramp for Mr Trump to defuse the row and - for the sake of Ukraine's ability to defend itself - switch back on the flow of military assistance to the country? Another major factor, of course, is how Vladimir Putin reacts and whether he could countenance a limited ceasefire in a war that he started and - unlike Mr Zelenskyy - appears to have no genuine desire to halt."
    },
    {
        "title": "Jay-Z sues woman who accused him of rape before dropping claim",
        "description": "Jay-Z has sued the woman who accused him of raping her, in a now-withdrawn complaint.",
        "url": "https://news.sky.com/story/jay-z-sues-woman-who-accused-him-of-rape-before-dropping-claim-13321556",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-jay-z-hip-hop-lawsuit_6846394.jpg?20250304214838",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-04 21:45:00",
        "Headline": "Last month, a woman who had accused Jay-Z and Sean 'Diddy' Combs of raping her withdrew her lawsuit.",
        "Content": "Jay-Z has sued the woman who accused him of raping her, in a now-withdrawn complaint. Sky News' US partner NBC News reported the 55-year-old music mogul had launched a defamation lawsuit against the woman. The American rapper reportedly said the woman and the lawyers representing her \"were soullessly motivated by greed, in abject disregard of the truth\" and alleged that they caused harm to his personal and professional reputation. Jay-Z, whose legal name is Shawn Carter, is reported to have filed the lawsuit in a federal court in Alabama, where the woman, referred to in the lawsuit only as \"Jane Doe\", lives. The initial allegation made by the woman centred on Jay-Z and Sean 'Diddy' Combs. It was withdrawn with prejudice last month - meaning it cannot be brought back to court. At the time the lawsuit was withdrawn, Jay-Z said: \"Today is a victory. These frivolous, fictitious and appalling allegations have been dismissed. \"The fictional tale they created was laughable, if not for the seriousness of the claims. I would not wish this experience on anyone.\" In her lawsuit, in New York, the woman originally accused Carter and Combs of raping her at an after party following the 2000 MTV Music Video Awards. His lawsuit cited inconsistencies in the woman's account that were reported by NBC News. This reportedly included claiming her father had picked her up for a ride home, but him saying he didn't recall making the drive - of more than five hours - at the time. She also claimed to speak to musician Benji Madden at the party, but a representative for Madden said that neither Benji nor his brother Joel attended the 2000 VMAs and that they were on tour in the Midwest at the time, NBC News added. Jay-Z is seeking a jury trial and unspecified damages. However, in a separate legal filing Monday, the woman said she was sticking with her story, NBC News reported. Read more from Sky News:Another broadcaster featured Hamas official's sonDolly Parton's husband of nearly 60 years diesComedy 'super producer' dies after accident abroad Combs is currently in prison awaiting a scheduled 5 May criminal trial on racketeering and sex trafficking charges. He still faces dozens of other civil lawsuits by women and men who have accused him of sexual assault and other misconduct. Combs has pleaded not guilty in the criminal case and has maintained his innocence in all the cases."
    },
    {
        "title": "Trump may have talked America into recession before a trade tariff was even imposed",
        "description": "This is an incredibly fast-moving story, to the extent that by the time you read this, the latest decision or news on tariffs between the US and its North American neighbours (not to mention China) will have shifted on.",
        "url": "https://news.sky.com/story/trump-may-have-talked-america-into-recession-before-a-trade-tariff-was-even-imposed-13321315",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-stock-market-new-york_6846204.jpg?20250304164618",
        "type": "US",
        "Author": "Ed Conway",
        "Date Published": "2025-03-04 14:42:00",
        "Headline": "There is evidence to suggest a sharp slowdown in the US economy amid all the threats of global trade wars emanating from Mr Trump before he even re-entered the White House.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  This is an incredibly fast-moving story, to the extent that by the time you read this, the latest decision or news on tariffs between the US and its North American neighbours (not to mention China) will have shifted on. So perhaps the best thing we can do here is to give you some context on how big a deal the imposition of tariffs here would be. The key thing to remember is that North America has been, in effect, a free trade zone for decades. Goods move back and forth across the borders so frequently that the number of crossings is almost incalculable. Consider an example highlighted by the Wall Street Journal recently. It pointed out that a piston - a component of a car component, might cross the border, back and forth between Canada and the US and Mexico, six times before it actually reaches a customer. Money latest: 'Everything showers' costing Gen Z extra £140 Right now, it doesn't incur any fees on each of those crossings; tariffs change that picture - and completely change the economics of making stuff. Now, there are some deeper long-term discussions that could be had about the merits of making a car in one place versus another, but in the short run, the implication of these tariffs will be inflation. That's almost inescapable. \n                  Zelenskyy is 'untrustworthy crook and punk', says ex-Trump aide\n                 \n                  The most significant part of Volodymyr Zelenskyy's olive branch offering to Donald Trump\n                 \n                  Zelenskyy says Ukraine 'ready to come to negotiating table' - after US pauses military aid\n                 If it suddenly costs 25% more to bring a piston across from Canada into the US then imagine extrapolating that into every single component making that journey each day: it means the price of many goods goes up. How many? That's hard to say, but consider that between them, Canada, Mexico and China account for around 40% of all US imports. They account for almost 60% of energy imports. So while the objective of these tariffs might be (we still don't really have a clear picture since various different administration figures give various different explanations) to rebuild American manufacturing, it takes years to get factories built. In the intervening period, tariffs spell higher costs for American consumers. Read more: How Trump's tariffs could cost consumers, even if he spares UK And the upshot of those higher costs is lower economic activity. Not long ago, most of the high-frequency economic measures were suggesting the US economy remained robust. But in recent weeks, high-frequency measures of activity have suggested the US economy is facing a very sharp slowdown. Indeed, the \"GDPNow\" Nowcast measure from the Atlanta Fed recently pointed to the US economy contracting at an annualised rate of 2.8% in the first quarter of the year. In other words, America may now be in recession. Not, perhaps, the start Donald Trump would have hoped for. But having inflicted so much disruption and uncertainty on manufacturers and consumers via his tariff policy, it surely can't come as too much of a surprise."
    },
    {
        "title": "Trump treads fine line between striking a deal and blackmailing Ukraine",
        "description": "Is this the art of the deal or the art of blackmail?",
        "url": "https://news.sky.com/story/trump-treads-fine-line-between-striking-a-deal-and-blackmailing-ukraine-13321092",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-volodymyr-zelenskyy_6842373.jpg?20250228152557",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-03-04 07:25:00",
        "Headline": "Donald Trump has paused US military aid to Ukraine, days after his very public row with its president Volodymyr Zelenskyy.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  Is this the art of the deal or the art of blackmail? US President Donald Trump's evening announcement to suspend US military aid to Ukraine came after a weekend through which the question had been: \"He wouldn't actually do that, would he?\" But given his actions over the past 43 days, his rhetoric during the campaign, and his truly transactional negotiating style, the answer was always to be \"of course he would\". It still doesn't make the move any less dramatic. Follow live: Trump decision 'devastating' and 'music to Putin's ears'  As late as Monday afternoon in the White House, the president claimed he hadn't discussed the prospect of cutting or pausing American military weapons shipments to Ukraine. But it was clear his anger and animosity against Volodymyr Zelenskyy after the Friday showdown had been growing. And just an hour or two later on Monday, after a meeting with his defence and security officials (who are all wholly aligned to his thinking, unlike those in his first administration) he had paused all military aid. Sources both sides of the Atlantic have told me this is just the latest step in his game of brinkmanship. The White House emphasis on \"pause\" is important and hints at the moves they expect Zelenskyy now to make. 👉 Follow Trump 100 on your podcast app 👈 President Trump is determined to pressure President Zelenskyy to sign his minerals deal - the first step in his peace plan, which he eventually expects will culminate in Ukraine and Russia around a negotiating table. He has not explained quite how this happens or what concessions Russian President Vladimir Putin might be asked to make. In the immediate term, Trump wants to be able to hail the mineral deal as a massive win for the American people as a material return for the money they sent to fund Ukraine's war, and as the first step to peace in Ukraine. So much of this is about a domestic trumpeting of his successes as he sees them. He had hoped to do that tonight at his address to a joint session of Congress. Zelenskyy is resisting not because he doesn't want peace but because he wants American commitments that it has his back militarily if he is to enter into peace talks with an unreliable Putin which will require him to make concessions. He wants American security guarantees. All of Europe wants those, while committing to spending more on defence themselves. They are alarmed that Trump won't give them yet. Read more from Sky News:Trump confirms Mexico and Canada tariffsCan Europe save Ukraine? Every European leader was privately appalled by Trump's treatment of Zelenskyy last Friday. But some European diplomats have told me they think Zelenskyy took the bait when he could have reacted differently. Zelenskyy's friends in Europe may now be quietly telling him to shift position, mend the rift with Trump, sign his deal, commit to a ceasefire and then work, with them, to push Trump on the security guarantees. In Trump's brutally transactional world where, like it or not, he holds the cards, it may be the only way."
    },
    {
        "title": "Scientists trying to bring back the woolly mammoth create a woolly mouse",
        "description": "Scientists trying to bring back the woolly mammoth have created a woolly mouse.",
        "url": "https://news.sky.com/story/scientists-trying-to-bring-back-the-woolly-mammoth-create-a-woolly-mouse-13321512",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-genetically-mice-colossal-biosciences_6845949.jpg?20250304131850",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-04 20:50:00",
        "Headline": "Biotech company Colossal Biosciences unveiled plans in 2021 to revive the woolly mammoth - and later the dodo bird.",
        "Content": "Scientists trying to bring back the woolly mammoth have created a woolly mouse. Colossal Biosciences unveiled plans in 2021 to revive the woolly mammoth - and later the dodo bird - attracting investors, headlines and critics alike. The Texas-based biotech company has since focused on identifying the key traits of extinct animals with the goal of genetically engineering them into living animals, according to chief executive Ben Lamm. Read more: Why 'de-extincting' the mammoth won't be like Jurassic Park Alongside bringing back species that went extinct, the company hopes their work can be used to help with conservation efforts. But other scientists have mixed views of their work and whether it will be helpful. On Tuesday, Colossal Biosciences said its researchers had edited seven genes in mice embryos to create a mouse with long, thick, woolly hair. They nicknamed the extra-furry rodent a \"colossal woolly mouse.\" The company now plans to genetically modify Asian elephants to give them woolly mammoth traits - but critics have argued that this is different from actually bringing a species back from extinction. \"You're not actually resurrecting anything - you're not bringing back the ancient past,\" said Christopher Preston, a wildlife and environment expert at the University of Montana, who was not involved in the research. He added: \"You might be able to alter the hair pattern of an Asian elephant or adapt it to the cold, but it's not bringing back a woolly mammoth. It's changing an Asian elephant.\" The results have not yet been published in a journal or vetted by independent scientists. The feat \"is technologically pretty cool,\" said Vincent Lynch, a biologist at the University of Buffalo, who was not involved in the research. Alongside the mouse being given different hair, in a press release, Colossal Biosciences said the rodent had also gained the woolly mammoth's accelerated fat metabolism. Both were said to be likely related to cold tolerance. These genetic variations were already present in some living mice, the company's chief scientist Beth Shapiro said, adding: \"We put them all together in a single mouse.\" Read more from Sky News:Smoke bombs thrown in Serbia's parliament'Stalker' threatens to kill during live streamInside Bangladesh's 'death squad' jails The company said it focused first on mice to confirm the process worked before potentially moving onto the embryos of Asian elephants - the closest living relative of woolly mammoths. However, as Asian elephants are an endangered species, there will be a lot of red tape before any plans can move forward, Mr Lamm admitted."
    },
    {
        "title": "Brian Glenn: The right-wing reporter and trusted Trump ally who quizzed Zelenskyy on his clothing",
        "description": "Until last week, the name Brian Glenn was relatively unknown.",
        "url": "https://news.sky.com/story/brian-glenn-the-right-wing-reporter-and-trusted-trump-ally-who-quizzed-zelenskyy-on-his-clothing-13321220",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-brian-glenn-trump_6846156.jpg?20250304161656",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-04 11:33:00",
        "Headline": "The US reporter went viral on social media after questioning Ukrainian President Volodymyr Zelenskyy about his choice of outfit at last week's heated Oval Office meeting with Donald Trump.",
        "Content": "Until last week, the name Brian Glenn was relatively unknown. The US reporter went viral on social media after questioning Ukrainian President Volodymyr Zelenskyy about his choice of outfit at last week's heated Oval Office meeting with Donald Trump. His question seemed to set the meeting, which ended with vice president JD Vance claiming Mr Zelenskyy had been \"disrespectful\" to the US, off on a bad footing. Ukraine war latest: Follow live updates  Since then, Glenn has continued to be viewed favourably by the president, with Real America's Voice, the right-wing streaming channel he works for, being granted access to the White House press pool alongside CNN. It comes as reporters from Reuters, the Associated Press, HuffPost and German newspaper Der Tagesspiegel were denied access to cover Mr Trump's first cabinet meeting. \n                  Zelenskyy is 'untrustworthy crook and punk', says ex-Trump aide\n                 \n                  The most significant part of Volodymyr Zelenskyy's olive branch offering to Donald Trump\n                 \n                  Zelenskyy says Ukraine 'ready to come to negotiating table' - after US pauses military aid\n                 On Tuesday, the Trump administration announced the White House would determine which media outlets would cover the president in smaller spaces such as the Oval Office. The White House Correspondents' Association has traditionally coordinated the rotation of the presidential press pool. But who is Mr Glenn, what has his career looked like so far, and what has the reaction to that question been like?  A trusted Trump ally Glenn is currently the chief White House correspondent for Real America's Voice. The right-wing streaming channel has supported numerous conspiracy theories in the past and helps distribute former Trump adviser Stephen K Bannon's War Room podcast, after he was barred from YouTube, Spotify and other mainstream platforms. Before joining Real America's Voice, Glenn was programme director of the Right Wing Broadcasting Network - a media company founded by Joe Seales in 2015. It was here that he became one of Mr Trump's trusted reporters, gaining one-on-one interviews with the president during the election and Christina Bobb, one of Mr Trump's attorneys, regularly appeared on Glenn's show during last year's hush money trial. The channel became the primary source for MAGA supporters to watch all Trump rallies, with Glenn at the forefront. \"No one gets to interview Trump any more. Brian has done the most Trump interviews of anyone over the last four years,\" Ron Filipkowski, a Florida defence attorney and anti-Trump online influencer, told Politico last year. \"He [Mr Trump] always goes to Brian - he'll find him in any gaggle.\" MAGA America's favourite couple  Away from reporting, Glenn is in a relationship with Republican US representative Marjorie Taylor Greene, who is often referred to by just her initials, MTG. Ms Taylor Greene, who was elected to Congress in 2020 and quickly became a powerful - and vocal - player in the Republican Party, confirmed she and Glenn were romantically linked during a CBS interview in 2023, where she said he had been a \"great resource\" with dealing with the media. Similarly to Glenn, she is a staunch ally of Mr Trump, whose political style she emulates. He even referred to himself as the other half of \"MAGA America's favourite couple\" during an interview with Politico. 'Why don't you wear a suit?' Before meeting Mr Trump in the Oval Office, Mr Zelenskyy was advised to wear a suit, according to reports, advice that he did not take. Deciding instead to wear an all black military-style uniform instead, Mr Trump became irritated, according to two sources who spoke to Axios. Mr Trump even greeted Mr Zelenskyy at the entrance to the West Wing, saying with a handshake: \"You're all dressed up today.\" 👉 Follow Trump 100 on your podcast app 👈 But it was Glenn asking the Ukrainian leader why he does not wear a suit and if he even owns one that appeared to cause an initial awkwardness during the meeting. Responding to criticism over the question, Glenn wrote on X later the same day that he has \"extreme empathy for the people of Ukraine\" - but that dressing as Mr Zelenskyy did \"reflects his inner disrespect for not only our country, the president and the US citizens\". He wrote: \"Moments after my exchange with President Zelenskyy, we began to hear a slightly different tone/mood from him when engaging with President Trump and VP JD Vance as his attire in-fact did begin to reflect his overall attitude towards the negotiations. \"So yes, you can judge a book by its cover. With that said, I pray for an ending to this war and peace in that region.\"  Mr Zelenskyy has said his choice of clothing is a show of solidarity with soldiers fighting on Ukraine's frontlines. In a statement on Tuesday, he said the meeting in Washington \"did not go the way it was supposed\", adding that it was \"time to make things right\". Glenn's girlfriend, Ms Taylor Greene also posted a video of the interaction, saying she was \"proud\" of him. She added: \"Zelenskyy has so much disrespect for America that he can't even wear a suit in the Oval Office when he comes to beg for money from our President!!\" Death threats and phone calls After the incident in the Oval Office, Glenn said he received thousands of comments on social media. \"I know by the thousands and tens of thousands of comments I have got on social media, death threats, phone calls. I don't know how they got my number,\" he told BBC's Newsnight on Monday. \"I think the world took it as a snarky comment, that wasn't really my intention. My intention was to really see if he understood the level of respect that people have when they go into the Oval Office.\" Many social media users were quick to point out that Elon Musk did not wear a suit during his recent visit to the Oval Office, but Glenn said Mr Zelenskyy's wardrobe choices mattered more than those of the tech mogul - now part of the Trump administration - because Ukraine has taken billions of dollars worth of aid to help the war effort. \"The war is not in the West Wing, in the Oval Office or in Washington, the war is back in Ukraine,\" Glenn added. \"President Trump wants nothing more than peace in that region.\""
    },
    {
        "title": "Kim Jong Un's sister threatens response to US aircraft carrier's deployment in South Korea",
        "description": "The sister of North Korean leader Kim Jong Un has threatened the Trump administration with retaliatory action for stepping up \"provocations\" with the deployment of a US aircraft carrier to South Korea.",
        "url": "https://news.sky.com/story/kim-jong-uns-sister-threatens-response-to-us-aircraft-carriers-deployment-in-south-korea-13321195",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-kim-jong-un-kim-yo-jing_6845834.jpg?20250304111852",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-04 10:59:00",
        "Headline": "The warning from Kim Yo Jong follows the arrival of the USS Carl Vinson and its strike group at the South Korean port of Busan  - which she condemned as \"confrontation hysteria of the US and its stooges\".",
        "Content": "The sister of North Korean leader Kim Jong Un has threatened the Trump administration with retaliatory action for stepping up \"provocations\" with the deployment of a US aircraft carrier to South Korea. The warning from Kim Yo Jong, a powerful official in her brother's regime, implies North Korea will likely ramp up weapons testing activities and maintain its confrontational posture against the US. In a statement carried by state media, she accused the US of showing \"its most hostile and confrontational will\" to North Korea. It follows the deployments of the USS Carl Vinson and other powerful US military assets this week, as well as joint US-South Korean military drills this year. She said her country would deliver a \"threatening\" response to the arrival of the US aircraft carrier in the region which she condemned as the \"confrontation hysteria of the US and its stooges\". \"The DPRK is also planning to carefully examine the option for increasing the actions threatening the security of the enemy at the strategic level to cope with the fact that the deployment of US strategic assets in the Korean Peninsula has become a vicious habit and adversely affects the security of the DPRK,\" she said, using the acronym of North Korea's official name, the Democratic People's Republic of Korea. Observers and experts said the statement suggests North Korea may test launch powerful missiles designed to strike the US mainland or American military bases in the region. The USS Carl Vinson and its strike group arrived at the South Korean port of Busan on Sunday, the latest temporary deployment of a US strategic asset. The move aimed to illustrate the strength of the US-South Korean military alliance in the face of North Korean threats. The US carrier's arrival came four days after North Korea conducted cruise missile tests - its fourth missile launch event this year. It comes despite US President Donald Trump saying he would contact Kim Jong Un to revive diplomacy. North Korea has not responded to Mr Trump's comments. Read more from Sky News:Trump pauses US military aid to UkraineTrump confirms Mexico and Canada tariffs Mr Kim and Mr Trump met three times between 2018 and 2019 during the US president's first term in office to discuss the future of North Korea's nuclear programme. Their high-stakes diplomacy eventually collapsed due to wrangling over US-led economic sanctions on North Korea."
    },
    {
        "title": "Twitch creators warn other women after 'stalker' threatens to kill them during live video stream",
        "description": "Three Twitch creators have issued a warning to others on the platform after a \"stalker\" followed and then threatened to kill them during a live video stream.",
        "url": "https://news.sky.com/story/twitch-creators-warn-other-women-after-stalker-threatens-to-kill-them-during-live-video-stream-13321201",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-valkyrae-emiru-cinna_6846089.jpg?20250304152204",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-04 10:59:00",
        "Headline": "Cinna, Valkyrae and Emiru, who have more than 3.6 million Twitch followers between them, were walking along Santa Monica Pier when they were first approached by the man - who then reappeared around 20 minutes later before becoming aggressive. ",
        "Content": "Three Twitch creators have issued a warning to others on the platform after a \"stalker\" followed and then threatened to kill them during a live video stream. Cinna, Valkyrae and Emiru, who have more than 3.6 million Twitch followers between them, were filming as part of a week-long marathon stream event they called \"Sisathon\" on Sunday night. The livestream showed them walking towards Pacific Park on Santa Monica Pier, California, when they were approached by a man in a grey hoodie who said his name was Russell. He stopped them and asked for a photo before Cinna, 28, said: \"Yeah of course.\" The man then asked if he can \"hang out with them\" before the Twitch streamer, whose real name is Brittany Lynn Watts, said they can't because they are on a \"time limit\". The women then continued walking into the amusement park before the man appeared to head off in the other direction. However, around 20 minutes later, the livestream showed the moment the women walked past the same man, who was now wearing different clothes, as he was crouched down next to one of the rides. \n                  Trump: 'American dream is surging' and we're 'just getting started'\n                 \n                  Zelenskyy says Ukraine 'ready to come to negotiating table' - after US pauses military aid\n                 \n                  Zelenskyy is 'untrustworthy crook and punk', says ex-Trump aide\n                 The Twitch streamers looked concerned as the man asked Emiru, whose real name is Emily Schunk, for her phone number. The 27-year-old quickly replied that she didn't have a phone before the man told the group: \"I'm going to keep following her (Emiru).\" The women then walked off before looking frightened when he caught up with them minutes later. The man was off-camera as Cinna said \"get away from her\" and stood between him and Emiru. Valkyrae, whose real name is Rachell Marie Hofstetter, then started calling for security before the women screamed as the man ran towards them and shouted: \"I'll kill you right now, I'll kill you right now.\" The Twitch streamers then fled from the park before the video cut out. In a separate video posted on Cinna's Twitch account on Monday, the streamer and Valkyrae gave a lengthy account of their ordeal. Cinna told her followers: \"We are very much in shock and we need you guys to know, that clip does not do it justice for how scary it was.\" She added that Emiru is \"safe\" but needs time to \"process it and stuff\". \"It is an attempt on our life and we are taking it very seriously,\" Cinna told her followers. She continued: \"He said he was going to kill us, he kept trying to get something out of his pocket. We had to run into a store screaming that somebody was going to kill us.\" Cinna added: \"For those of you who don't know, we know he's a stalker. When he was behind us, he pulled up Emmy's TikToks.\" Valkyrae posted on X after the ordeal that they were \"OK\" and had been with the police. She also shared a post criticising people who accused the women of staging what happened. Read more from Sky News:Trump pauses US military aid to UkraineHow mobile games profit from misogynistic tropesInside Bangladesh's 'death squad' jails Valkyrae wrote on X: \"I hope other women and streamers learn from seeing this interaction and also be aware that this can happen to anybody.\" Meanwhile, Emiru said in a post on X on Monday: \"I wish I could say this was some kind of one in a million incident, but the truth is, it is not. This is what life is like for girls. I hope if anything, people see what happened and realize how much of a reality it is for women and content creators as a whole.\" Santa Monica Police is said to have carried out a search for the suspect but were unable to find him. The force has reportedly said it is \"aware of the video footage\" and is \"reviewing the information that has been shared publicly\". Sky News has contacted Santa Monica Police for comment."
    },
    {
        "title": "Trump may have talked America into recession before a trade tariff was even imposed",
        "description": "This is an incredibly fast-moving story, to the extent that by the time you read this, the latest decision or news on tariffs between the US and its North American neighbours (not to mention China) will have shifted on.",
        "url": "https://news.sky.com/story/trump-may-have-talked-america-into-recession-before-a-trade-tariff-was-even-imposed-13321315",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-stock-market-new-york_6846204.jpg?20250304164618",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-03-04 14:42:00",
        "Headline": "There is evidence to suggest a sharp slowdown in the US economy amid all the threats of global trade wars emanating from Mr Trump before he even re-entered the White House.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  This is an incredibly fast-moving story, to the extent that by the time you read this, the latest decision or news on tariffs between the US and its North American neighbours (not to mention China) will have shifted on. So perhaps the best thing we can do here is to give you some context on how big a deal the imposition of tariffs here would be. The key thing to remember is that North America has been, in effect, a free trade zone for decades. Goods move back and forth across the borders so frequently that the number of crossings is almost incalculable. Consider an example highlighted by the Wall Street Journal recently. It pointed out that a piston - a component of a car component, might cross the border, back and forth between Canada and the US and Mexico, six times before it actually reaches a customer. Money latest: 'Everything showers' costing Gen Z extra £140 Right now, it doesn't incur any fees on each of those crossings; tariffs change that picture - and completely change the economics of making stuff. Now, there are some deeper long-term discussions that could be had about the merits of making a car in one place versus another, but in the short run, the implication of these tariffs will be inflation. That's almost inescapable. \n                  Zelenskyy is 'untrustworthy crook and punk', says ex-Trump aide\n                 \n                  The most significant part of Volodymyr Zelenskyy's olive branch offering to Donald Trump\n                 \n                  Zelenskyy says Ukraine 'ready to come to negotiating table' - after US pauses military aid\n                 If it suddenly costs 25% more to bring a piston across from Canada into the US then imagine extrapolating that into every single component making that journey each day: it means the price of many goods goes up. How many? That's hard to say, but consider that between them, Canada, Mexico and China account for around 40% of all US imports. They account for almost 60% of energy imports. So while the objective of these tariffs might be (we still don't really have a clear picture since various different administration figures give various different explanations) to rebuild American manufacturing, it takes years to get factories built. In the intervening period, tariffs spell higher costs for American consumers. Read more: How Trump's tariffs could cost consumers, even if he spares UK And the upshot of those higher costs is lower economic activity. Not long ago, most of the high-frequency economic measures were suggesting the US economy remained robust. But in recent weeks, high-frequency measures of activity have suggested the US economy is facing a very sharp slowdown. Indeed, the \"GDPNow\" Nowcast measure from the Atlanta Fed recently pointed to the US economy contracting at an annualised rate of 2.8% in the first quarter of the year. In other words, America may now be in recession. Not, perhaps, the start Donald Trump would have hoped for. But having inflicted so much disruption and uncertainty on manufacturers and consumers via his tariff policy, it surely can't come as too much of a surprise."
    },
    {
        "title": "The new employment rights you will get - and the one you won't",
        "description": "Protections for workers will be strengthened, the government has said, as it unveiled hundreds of amendments to the employment rights bill.",
        "url": "https://news.sky.com/story/the-new-employment-rights-you-will-get-and-the-one-you-wont-13321272",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-workers-employment-bill_6711913.jpg?20241009213948",
        "type": "Business",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-04 13:25:00",
        "Headline": "Labour went into last year's general election on a manifesto promising to change the UK's \"outdated employment laws\".",
        "Content": "\n          Political reporter\n              @alixculbertson\n Protections for workers will be strengthened, the government has said, as it unveiled hundreds of amendments to the employment rights bill. Labour fought the 2024 general election on a manifesto promising to change the UK's \"outdated employment laws\". A central policy in Sir Keir Starmer's manifesto has not made it into the bill, meaning people will not have a right to \"switch off\" outside work hours. Deputy prime minister Angela Rayner said the government has had \"really constructive dialogue\" with trade unions and business, and hinted they may bring in the \"switch off\" right through another mechanism. The policy would allow workers to ignore work-related emails and calls outside office hours, including the right to refuse to take on extra work at the weekends. Ms Rayner said the amendments show the government is \"proudly pro-business and pro-worker\". Politics latest: Ex-ministers who served in army hit out at Vance \n                  JD Vance denies insulting British troops over 'random country' jibe\n                 \n                  Everything you need to know about Sir Keir Starmer's four-point peace plan for Ukraine\n                 \n                  In full: Tuesday's Politics Hub\n                 However, employers are concerned that the new employment laws will push costs up further, in addition to the increase in taxes and the minimum wage coming in from April. The 250 amendments also do not include any changes where employers had raised their biggest concerns, including the introduction of day one protection against unfair dismissal, a large upgrade of union rights and a near-ban on the use of \"fire and rehire\" tactics. Here are the main amendments explained: Ban on zero-hours contracts for agency workers Agency workers will be included in a new law, meaning workers should be able to access a contract that guarantees a minimum number of hours every week. The government said this will ensure agency work does not become a loophole to end zero-hours contracts. It will offer \"increased security\" for workers to receive \"reasonable notice\" of shifts and proportionate pay when shifts are cancelled, curtailed or moved at short notice. Unions welcomed the amendment but the Recruitment and Employment Confederation, which represents agency workers, said the change should not \"undermine\" the \"flexibility\" that zero-hour contracts offer some workers. Statutory sick pay for all workers from day one Employees earning below £123 a week - about 1.3 million people - unable to work due to sickness will receive the lowest of either 80% of their average weekly earnings or the current rate of statutory sick pay. They will receive sick pay from the first day of sickness absence, instead of the current fourth day. The government said this will mean people can take time off to recover, instead of dropping out of work entirely, and reduce infection spread to boost productivity. However, the British Chambers of Commerce said allowing sick pay from day one could lead to higher absenteeism that smaller firms may struggle with. Read more:Employment Rights Bill could cost business up to £5bn a yearGiving workers right to switch off may boost economy - No 10 Increased period of protection for collective redundancy Employment tribunals will be able to grant employees 180 days of pay, instead of 90, if their employer fails to meet redundancy consultation requirements. The government said this will \"enhance the deterrent\" against employers ignoring their obligations to consult on collective redundancies and will ensure they do not benefit financially from not consulting properly. A 'modern framework' for industrial relations The legal framework in which trade unions operate will be updated so it aligns with \"modern work practices\". Industrial relations will be \"underpinned by collaboration, proportionality, accountability\" to balance the interests of workers, businesses and the wider public, the government said. It added further details will be revealed later.  'Umbrella company' workers to have same rights as others People paid through umbrella companies - used by recruitment agencies to pay temporary workers - will have the same rights and protections as those employed directly by a recruitment agency. Enforcement action will be able to be taken against umbrella companies who do not comply. The Employment Rights Bill has been through its first and second readings, and the committee stage, where it is scrutinised by a committee of cross-party MPs. It is now heading to the report stage on 11 March, where all MPs can debate the amendments before it goes to the third reading, when MPs will vote on the bill."
    },
    {
        "title": "Ares and Farallon eye control of builders' merchant IBMG",
        "description": "Lenders to one of Britain's biggest networks of builders' merchants are angling to take control of the company amid talks with its private equity backer over new funding requirements.",
        "url": "https://news.sky.com/story/ares-and-farallon-to-take-control-of-builders-merchant-ibmg-13321207",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-worcester-construction_6774588.jpg?20241213071037",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-04 11:18:00",
        "Headline": "The two lenders to Independent Builders Merchant Group could take ownership of the business following talks with private equity backer Cairngorm Capital, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Lenders to one of Britain's biggest networks of builders' merchants are angling to take control of the company amid talks with its private equity backer over new funding requirements. Sky News has learnt that Ares Management Corporation and Farallon Capital Europe, two major investment firms, could move to take ownership of Independent Builders Merchant Group (IBMG) in the coming weeks. City sources said on Tuesday that a deal for Ares and Farallon to take over IBMG was likely to be implemented through a restructuring of the company's debt, rather than any form of insolvency event. Money blog: Oil price tumbles as Saudi and Russia act Interpath Advisory is working with IBMG on the process, according to the sources. IBMG was founded with financial backing from Cairngorm Capital, a private equity firm, in 2018, and has grown since then through more than 20 acquisitions. According to Cairngorm's website - where IBMG is listed as a 'realised investment', which a spokesperson for the firm said was \"in error\" - IBMG now has more than 170 branches across the south of England. \n                  Canadian PM criticises Trump over tariffs - and sends bold message to Americans\n                 \n                  Money blog: People told to stop using Boots paracetamol 'immediately' after batch wrongly labelled\n                 \n                  Trump may have talked America into recession before a trade tariff was even imposed\n                 It employs more than 2,000 people and recorded revenues of approximately £650m in its latest financial year. IBMG operates through several divisions, including plumbing and heating, roofing and timber processing and distribution. The company announced in April 2024 that it had secured new capital from Ares and Farallon but said at the time that this would be with \"the continued support of Cairngorm Capital\". Cairngorm Capital said: \"Interpath has been appointed by IBMG's shareholders to work on appropriate cost reduction initiatives, necessitated by the difficult cost environment that IBMG is operating in. \"Cairngorm Capital remains a majority shareholder although it has realised some of its investment.\" Ares, Farallon and Interpath declined to comment."
    },
    {
        "title": "Boots recall mislabelled packs of paracetamol - as customers urged to 'immediately' stop using tablet",
        "description": "People have been told to \"immediately\" stop using packets of paracetamol from Boots after a packaging error. ",
        "url": "https://news.sky.com/story/boots-recall-mislabelled-packs-of-paracetamol-as-customers-urged-to-immediately-stop-using-tablet-13321381",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-boots-recall-paracetamol_6846197.jpg?20250304163748",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-03-04 16:35:00",
        "Headline": "The affected foil blister packs of 16 tablets were incorrectly packaged as \"Aspirin 300mg Dispersible Tablets\" despite being 500mg paracetamol tablets.",
        "Content": "People have been told to \"immediately\" stop using packets of paracetamol from Boots after a packaging error.  The affected foil blister packs of 16 tablets inside paracetamol boxes were incorrectly packaged as \"Aspirin 300mg Dispersible Tablets\" despite actually being 500mg paracetamol tablets. The UK Medicines and Healthcare products Regulatory Agency (MHRA) urged customers to check if their packs have the batch number 241005 on the bottom of the box. \"If affected, they should stop using the product immediately and return it to a Boots store for a full refund, with or without receipt,\" the agency said.  The MHRA said customers should not keep the box, even if the error is known, as it could lead to an incorrect dose being taken. Customers should also alert others if the tablets were brought for someone else. Boots also posted on its official Facebook page to warn customers of the recall. It added the supplier, Aspar Pharmaceuticals Limited, confirmed the tablets in the blister packs are paracetamol and not aspirin, and are conducting a \"full investigation\" into the issue. Read more from Sky News:Matt Lucas apologises to Millie Bobby Brown'Corrupt' ex-prison officer jailed Dr Stephanie Millican, MHRA deputy director benefit risk evaluation, said it is \"vitally important\" to check the packaging. \"If the batch number is 241005, you should stop using the product and return it to a Boots store for a full refund,\" she said. \"If you are unsure which pack you have purchased or have taken Boots Paracetamol 500mg Tablets and experienced any side effects, seek advice from a healthcare professional.\""
    },
    {
        "title": "JD Vance denies insulting British troops over 'random country' jibe",
        "description": "JD Vance has hit back at criticism after saying a potential peacekeeping force in Ukraine would be \"20,000 troops from some random country that hasn't fought a war in 30 or 40 years\".",
        "url": "https://news.sky.com/story/jd-vance-denies-insulting-british-troops-over-random-country-jibe-13321190",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-jd-vance-vp-debate_6703635.jpg?20241002021729",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-03-04 10:50:00",
        "Headline": "Senior politicians interpret JD Vance's dismissal of peacekeeping troops as a dig at the UK and France - but the US vice president insists he was not referring to these two allies.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n JD Vance has hit back at criticism after saying a potential peacekeeping force in Ukraine would be \"20,000 troops from some random country that hasn't fought a war in 30 or 40 years\". The US vice president was accused of \"disrespecting\" British forces who served alongside the US in Iraq and Afghanistan, with a former veterans minister branding him a \"clown\" who needs to \"check his privilege\". Politics latest: Trump stopping aid to Ukraine is 'profoundly worrying' Although the UK and France are the only countries to have pledged troops to a potential peacekeeping force, Mr Vance said the suggestion he was referring to those two allies is \"absurdly dishonest\". \"I don't even mention the UK or France in the clip, both of whom have fought bravely alongside the US over the last 20 years, and beyond,\" he said in a post on X. \"There are many countries who are volunteering (privately or publicly) support who have neither the battlefield experience nor the military equipment to do anything meaningful.\" Mr Vance made the initial comments to Fox News on Tuesday, saying the only security guarantee Donald Trump will provide for Ukraine is a minerals deal. He said: \"The president knows that if you want real US security guarantees, if you want to actually ensure that Vladimir Putin does not invade Ukraine again, the very best security guarantee is to give Americans economic upside in the future of Ukraine. \"That is a way better security guarantee than 20,000 troops from some random country that hasn't fought a war in 30 or 40 years.\" Several British politicians interpreted this as a dig at the UK and France, who have led the idea of a \"coalition of the willing\" to provide boots on the ground in Ukraine in the event of a ceasefire. James Cartlidge, the shadow defence secretary, accused Mr Vance of \"ignoring the service and sacrifice\" of personnel from the two countries that fought in Afghanistan after 9/11. He said that is the only time NATO's Article 5 has been invoked, which holds that members of the alliance will come to the defence of an ally under attack. He added: \"Britain and France came to their aid deploying 1,000s of personnel to Afghanistan, including numerous parliamentary colleagues, past & present. It's deeply disrespectful to ignore such service & sacrifice.\"  Former Tory veterans minister Johnny Mercer called Mr Vance a \"clown\" who \"needs to check his privilege\". Helen Maguire, the Lib Dem's defence spokesperson who also served in the army before her career in politics, accused Mr Trump's deputy of \"erasing the hundreds of British troops who gave their lives in Iraq and Afghanistan from history\". She said: \"Six of my own regiment, the Royal Military Police, didn't return home from Iraq. This is a sinister attempt to deny that reality. Vance has demeaned his office.\" Speaking after Mr Vance clarified his remarks, a Downing Street spokesperson said the US vice president was \"talking about other countries\" when asked if he should apologise. They added Prime Minister Sir Keir Starmer \"is full of admiration for British troops who fought alongside the US and others in wars and their courage and bravery\". Read more:Trump pauses US military aid to UkraineTrump confirms Mexico and Canada tariffs Tory leader Kemi Badenoch told GB News \"a lot of people are getting carried away\". \"They're saying loads of things and getting quite animated, let's keep cool heads,\" she said. \"I believe President Trump and JD Vance want peace, they're looking after their national interest, we need to do so as well.\" It is not the first time Mr Vance has riled the UK, after previously attacking it over free speech and saying the UK is \"Islamist under Labour\". JD Vance seems to save some of his most incendiary comments about other countries for the UK. Donald Trump's vice president has regularly caused outrage among MPs, most recently with what many saw as a perceived dig at British troops.\n\n During last year's presidential election campaign, Mr Vance suggested Labour's victory here made Britain the \"first truly Islamist country\" with nuclear weapons.\n\n Recalling a conversation about who might be \"the first truly Islamist country that will get a nuclear weapon\", he said rather than it being somewhere like Iran, he settled on the UK \"since Labour just took over\".\n\n Mr Vance also used a landmark speech at the Munich Security Conference to criticise the UK and Europe over free speech, saying there had been a \"backslide away from conscience rights\" that had put \"basic liberties of religious Britons, in particular, in the crosshairs\".\n\n He doubled down on those remarks during Sir Keir Starmer's meeting with Donald Trump in the Oval Office last week, claiming the government's stance is something that affects US tech companies and, therefore, American citizens. Sir Keir interjected, saying \"we've had free speech for a very long time, it will last a long time, and we are very proud of that\".\n\n The row comes after the Trump administration paused military aid to Ukraine following an extraordinary showdown between the US President and Ukrainian President Volodymyr Zelenskyy. The falling out has thrown into jeopardy the prospect of a minerals deal, which would give the US access to Ukraine's deposits of rare earth minerals. Mr Trump has suggested this would deter Russia from invading Ukraine again if a peace deal is struck - but Sir Keir said yesterday that it would not be enough on its own. The prime minister told MPs on Monday that Britain must \"lead from the front\" on supporting Ukraine and Europe must \"do the heavy lifting to support peace on our continent\". However, he said \"to succeed, this effort must also have strong US backing\"."
    },
    {
        "title": "Everything you need to know about Sir Keir Starmer's four-point peace plan for Ukraine",
        "description": "Sir Keir Starmer has declared that a \"coalition of the willing\" will come together and draw up a peace plan to end the war in Ukraine.",
        "url": "https://news.sky.com/story/everything-you-need-to-know-about-sir-keir-starmers-four-point-peace-plan-for-ukraine-13321230",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-keir-starmer-downing-street_6845244.jpg?20250303152204",
        "type": "Politics",
        "Author": "Faith Ridler",
        "Date Published": "2025-03-04 11:51:00",
        "Headline": "The prime minister sets out a four-point plan for peace in Ukraine after his international security summit took place on Sunday.",
        "Content": "\n          Politics reporter\n              @FaithLRidler\n  Sir Keir Starmer has declared that a \"coalition of the willing\" will come together and draw up a peace plan to end the war in Ukraine. The prime minister said this will be presented to US President Donald Trump for his support, after he clashed publicly with Ukrainian President Volodymyr Zelenskyy in the White House last week. Sir Keir unveiled his four-point plan for peace in the Commons on Monday, the day after European leaders - plus Canada and Turkey - hurriedly gathered in London for talks on the Ukraine war. Politics latest: JD Vance hits back at claims he disrespected British troops  He said this so-called \"coalition of the willing\" would enforce any peace deal in the war-torn country, and announced a plan for Kyiv to use £1.6bn of UK export finance to buy 5,000 more air defence missiles. Washington has since paused military aid to Kyiv, with no indication of how long this could last. Here, Sky News explains everything you need to know about Europe's plan for peace. What is Sir Keir Starmer's four-point plan? The prime minister has warned there are more tough choices to come on the war in Ukraine, insisting the UK must \"lead from the front\" when it comes to securing peace in Europe. He did just that over the weekend, when 19 leaders gathered at Lancaster House to discuss building a lasting peace. Led by the UK and France, the initiative could see troops from a number of European and NATO countries deployed to Ukraine as peacekeepers in order to deter Russian President Vladimir Putin from rearming and attacking again in the future. At its heart is a four-point plan, which was agreed by attendees of the security summit: 1. Any lasting peace must guarantee Ukraine's sovereignty and security 2. Military aid to Ukraine must remain, while increasing the economic pressure on Russia 3. If a peace deal is reached, Ukraine's defences must continue to be boosted 4. European leaders will join forces in a \"coalition of the willing\" to devise a peace plan for Ukraine. This will be presented to the US  What is the 'coalition of the willing'? The final point of Sir Keir's plan points to a \"coalition of the willing\", which will come together to devise a peace plan for Ukraine. This could see troops from a number of European and NATO countries deployed to Ukraine as peacekeepers in order to deter Putin from invading in the future. Sir Keir said Europe \"must do the heavy lifting\" on defence and indicated several countries had expressed interest in being part of the coalition. Read more:The 'coalition of the willing' that could secure peace in UkraineBritain must 'lead from the front' in Ukraine This approach would allow NATO members to act in a group but not under the NATO umbrella, avoiding vetoes from member states who do not approve or do not wish to be involved. It is not yet entirely clear who the \"coalition of the willing\" are, though the UK and France are likely involved. It is also likely the Baltic states - Estonia, Lithuania and Latvia - will sign up to the initiative."
    },
    {
        "title": "Anybody working for Iran in UK must register or face jail, government announces",
        "description": "Anybody who works for - or is a proxy of - the Iranian state will have to register their presence in the UK or face jail time. ",
        "url": "https://news.sky.com/story/anybody-working-for-iran-in-uk-must-register-or-face-jail-government-announces-13321312",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-iran-israel_6730752.jpg?20241028065931",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-04 14:29:00",
        "Headline": "Iran is the first foreign power to be placed on the enhanced tier of the Foreign Influence Registration Scheme.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Anybody who works for - or is a proxy of - the Iranian state will have to register their presence in the UK or face jail time.  Security minister Dan Jarvis said Iran, including its IRGC intelligence services and the Ministry of Intelligence and Security, is being placed on the \"enhanced tier\" of the Foreign Influence Registration Scheme (FIRS). That means any members of the Iranian state, or anybody acting on behalf of the state, carrying out \"political influence activities\" in the UK will have to register themselves with the scheme. Failure to register is a criminal offence and can mean up to five years in jail. Politics latest: US vice president hits back amid British troops row Iran is the first foreign power to be placed on the enhanced tier of the scheme, which has two levels aimed at strengthening the resilience of the UK's political system against covert foreign influence. The first level is a \"political influence\" tier, involving communications with senior decision makers such as UK ministers, MPs and senior civil servants. Mr Jarvis said the scheme, which he called \"a critical disruptive tool for the UK\", will be up and running by the summer.  State threat reviewer to look at counter-terror laws He also announced Jonathan Hall KC, the UK's independent state threat and terrorism legislation reviewer, has been asked to review the sections of the UK's counter-terrorism framework that could be applied to \"modern day state threats, such as those in Iran\". Mr Hall will look at how the UK proscribes state and state-linked bodies to provide \"more flexibility than is offered under the existing powers\". The IRGC has been sanctioned by the UK but is not a proscribed terror group. The government has faced multiple calls for it to be proscribed. The security minister also announced all 45 UK police forces are being offered training and guidance on state threats activity by counter terrorism policing so they \"know what to do and what to look for\". Iran targeting Jewish and Israeli people In October, the head of MI5 revealed the security service had foiled 20 Iran-backed plots in the UK since the beginning of 2022. Mr Jarvis said the Iranian state has been targeting Jewish and Israeli people in the UK, as well as UK-based Persian-language media critical of Iran. The minister said Iran is trying to \"stifle criticism through intimidation and fear\". \"These threats are unacceptable,\" he said. \"They must and will be defended against at every turn.\" Read more:Starmer's four-point peace plan for UkraineUK to defend Ukraine peace deal with 'coalition of willing' Britons criminally liable if working with foreign power He added threats from Iran are not just physical in nature, with the National Cyber Security Centre seeing \"malicious\" cyber activity conducted by Iranian state-affiliated actors targeting the UK. Mr Jarvis reminded MPs the National Security Act 2023 gave police new powers such as the ability to arrest anybody assisting foreign intelligence services, with a maximum penalty of 14 years in prison. He said the UK security profession, including private investigators, has recently been issued guidance about how the National Security Act applies to them, emphasising how they may be criminally liable if they are working for any foreign power. The minister said the government is exploring further sanctions against other Iranian-linked criminals, and the National Crime Agency will target anyone who assists the IRGC and others to launder their money."
    },
    {
        "title": "Bill to limit harms of smartphone use among children to be published",
        "description": "A bill that aims to protect children from the damaging effects of smartphones will be published on Thursday before MPs vote on it later this week.",
        "url": "https://news.sky.com/story/bill-to-limit-harms-of-smartphone-use-among-children-to-be-published-13321277",
        "image_url": "https://e3.365dm.com/19/02/1920x1080/skynews-smartphones-phones_4565186.jpg?20190202030939",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-03-04 13:26:00",
        "Headline": "MPs are due to debate and vote on the Safer Phones Bill, which aims to raise the age of \"internet adulthood\" from 13 to 16.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n A bill that aims to protect children from the damaging effects of smartphones will be published on Thursday before MPs vote on it later this week. The Safer Phones Bill, put forward by backbench Labour MP Josh MacAlister, will have its second reading in the Commons on Friday - the first opportunity parliament has to debate its principles before deciding whether it should proceed further. Last October, Sky News reported that Mr MacAlister, a former teacher, had dropped plans to ban smartphones from schools because the government did not support the measure on the grounds that headteachers already have the power to ban phones - although it is not upheld in law. Politics latest: JD Vance hits back at troops claims Instead, supporters of the bill hope the move will encourage the government to back other elements in it, including strengthened powers for regulator Ofcom to protect children from apps that are designed to be addictive and an increase in the \"internet adulthood\" age - when children can create social media profiles and email accounts - from 13 to 16. A supporter of the bill told Sky News the focus now was on securing these reforms with the hope that if the government is unable to commit to increase the internet adulthood age now, that it would pledge to do so in the future through the Online Safety Act. The act, which was passed under the previous Conservative government, requires providers of online services to minimise the extent of illegal and harmful content. \n                  Man who died on motorway had been arrested 'after being confronted by online paedophile hunters'\n                 \n                  Grooming gangs scandal timeline: What happened, what inquiries there were and how Starmer was involved - after Elon Musk's accusations\n                 \n                  Father calls for industry changes after baby dies during 'hands-free' breastfeeding\n                 The regulator has said its duty around illegal harms will become enforceable around March this year, but the act is not expected to be implemented in full until 2026. One measure supporters hope could be on the table is a government commitment to review the act to see if Ofcom is using its powers effectively. One backer of the bill told Sky News: \"Ofcom is about to get new powers which are untested.  \"We want to keep the issue alive - we know how popular it is among parents and parliament needs to catch up, frankly.\" Under the previous Tory government, schools in England were issued with guidance intended to stop the use of mobile phones in the classroom. However, the guidance was non-statutory, leaving it up to individual schools to set their own policy. Last year, a study by the Policy Exchange thinktank found that schools which effectively ban mobile phones get better GCSE results than those with \"laxer policies\". Read more:Call for tougher measures on under-16 mobile phone useLabour MP goes public to oppose family farms tax The centre-right thinktank also said in its report that secondary schools in England where such a ban was in place were more than twice as likely to be rated outstanding by Ofsted as the national average. However, an investigation by the University of Birmingham last month found that restricting mobile phones at school does not improve grades or mental wellbeing. The study found that students' levels of sleep, exercise and academic record did not differ between schools with and without phone bans, and that restrictive policies did not lower the overall time young people spend on their phones each day. The debate over smartphone and social media use for children and teenagers had been reignited following Australia's decision to bans under 16s from having social media accounts. The legislation is set to come into force in November 2025 and will force platforms to take reasonable steps to ensure age-verification protections are in place."
    },
    {
        "title": "Budget 2025: Welsh government plans approved - but what do they mean for Wales?",
        "description": "The Welsh government's budget has been approved by Senedd members in a vote on Tuesday.",
        "url": "https://news.sky.com/story/budget-2025-welsh-government-plans-approved-but-what-do-they-mean-for-wales-13321151",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-wales-cardiff_6845807.jpg?20250304104733",
        "type": "Politics",
        "Author": "Tomos Evans",
        "Date Published": "2025-03-04 09:45:00",
        "Headline": "Labour hold exactly half of the Senedd's 60 seats so had to strike a deal with the sole Lib Dem member to get their plans through.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n The Welsh government's budget has been approved by Senedd members in a vote on Tuesday. Every year, the government sets out its spending plans for Wales in funds devolved from the UK government, which then have to be agreed by a majority of members. Labour has exactly half the number of seats in the chamber, 30 out of 60, since the last election in 2021. After the election, Labour had entered into a co-operation agreement with Plaid Cymru which involved the Welsh nationalist party supporting the government on a number of key policies. But the deal came to an abrupt end last year due to concerns about a controversial £200k donation to then first minister Vaughan Gething and government delays to policies such as council tax reform. So without their coalition partners, Labour were looking to borrow a vote to get them over the line. The final budget vote passed on Tuesday, 29 votes to 28, after the Labour government struck a deal with the Welsh parliament's sole Liberal Democrat member, Jane Dodds, who agreed to abstain. \n                  Oakwood Theme Park: Wales' largest theme park shuts after 'unrelenting economic challenges'\n                 \n                  Sophie Evans: Man jailed for life for murdering son's girlfriend after school run\n                 \n                  Woman admits killing six-year-old son in Swansea\n                 In exchange for her abstention, the Welsh government announced a number of investments, including a £1 bus ticket pilot scheme for under 21s. The agreement also includes a commitment to ban greyhound racing in Wales. 'Demanding better' The £26bn budget has allocated funding for areas such as health, housing and education for the next financial year, taking Wales into 2026 when voters will next go to the polls to vote for their representatives in the Senedd. Welsh finance secretary Mark Drakeford said: \"Passing this budget is a significant moment for Wales - it unlocks a real uplift in funding for the services that matter most to people, after some very tough years. \"We have secured a financial package that will strengthen our NHS, reduce waiting times, support schools and help communities across Wales thrive, making a real difference to people's lives.\" Welsh Lib Dem leader Ms Dodds said she agreed with \"those who are demanding better from their government\", but said she was not prepared to see Wales's public services \"lose £5bn worth of funding\" if the budget vote failed. The Welsh Conservatives' shadow finance secretary Sam Rowlands said his party \"would instead focus on putting money back into Welsh people's pockets\", including the creation of a Welsh Winter Fuel Allowance. Plaid Cymru's finance spokesperson Heledd Fychan said Wales needed \"fresh thinking\" and that her party had \"long-term solutions to improve [the] NHS\" and \"grow [the] economy\". Read more:Senedd members could lose their seats under new plansCould Wales be about to see seismic political shift? At the next election, the number of Senedd members will increase from 60 to 90, with a more proportional voting system adopted. And with just over a year to go, politicians of every party will be keener than ever to make their case for Wales."
    },
    {
        "title": "The new employment rights you will get - and the one you won't",
        "description": "Protections for workers will be strengthened, the government has said, as it unveiled hundreds of amendments to the employment rights bill.",
        "url": "https://news.sky.com/story/the-new-employment-rights-you-will-get-and-the-one-you-wont-13321272",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-workers-employment-bill_6711913.jpg?20241009213948",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-04 13:25:00",
        "Headline": "Labour went into last year's general election on a manifesto promising to change the UK's \"outdated employment laws\".",
        "Content": "\n          Political reporter\n              @alixculbertson\n Protections for workers will be strengthened, the government has said, as it unveiled hundreds of amendments to the employment rights bill. Labour fought the 2024 general election on a manifesto promising to change the UK's \"outdated employment laws\". A central policy in Sir Keir Starmer's manifesto has not made it into the bill, meaning people will not have a right to \"switch off\" outside work hours. Deputy prime minister Angela Rayner said the government has had \"really constructive dialogue\" with trade unions and business, and hinted they may bring in the \"switch off\" right through another mechanism. The policy would allow workers to ignore work-related emails and calls outside office hours, including the right to refuse to take on extra work at the weekends. Ms Rayner said the amendments show the government is \"proudly pro-business and pro-worker\". Politics latest: Ex-ministers who served in army hit out at Vance \n                  JD Vance denies insulting British troops over 'random country' jibe\n                 \n                  Everything you need to know about Sir Keir Starmer's four-point peace plan for Ukraine\n                 \n                  In full: Tuesday's Politics Hub\n                 However, employers are concerned that the new employment laws will push costs up further, in addition to the increase in taxes and the minimum wage coming in from April. The 250 amendments also do not include any changes where employers had raised their biggest concerns, including the introduction of day one protection against unfair dismissal, a large upgrade of union rights and a near-ban on the use of \"fire and rehire\" tactics. Here are the main amendments explained: Ban on zero-hours contracts for agency workers Agency workers will be included in a new law, meaning workers should be able to access a contract that guarantees a minimum number of hours every week. The government said this will ensure agency work does not become a loophole to end zero-hours contracts. It will offer \"increased security\" for workers to receive \"reasonable notice\" of shifts and proportionate pay when shifts are cancelled, curtailed or moved at short notice. Unions welcomed the amendment but the Recruitment and Employment Confederation, which represents agency workers, said the change should not \"undermine\" the \"flexibility\" that zero-hour contracts offer some workers. Statutory sick pay for all workers from day one Employees earning below £123 a week - about 1.3 million people - unable to work due to sickness will receive the lowest of either 80% of their average weekly earnings or the current rate of statutory sick pay. They will receive sick pay from the first day of sickness absence, instead of the current fourth day. The government said this will mean people can take time off to recover, instead of dropping out of work entirely, and reduce infection spread to boost productivity. However, the British Chambers of Commerce said allowing sick pay from day one could lead to higher absenteeism that smaller firms may struggle with. Read more:Employment Rights Bill could cost business up to £5bn a yearGiving workers right to switch off may boost economy - No 10 Increased period of protection for collective redundancy Employment tribunals will be able to grant employees 180 days of pay, instead of 90, if their employer fails to meet redundancy consultation requirements. The government said this will \"enhance the deterrent\" against employers ignoring their obligations to consult on collective redundancies and will ensure they do not benefit financially from not consulting properly. A 'modern framework' for industrial relations The legal framework in which trade unions operate will be updated so it aligns with \"modern work practices\". Industrial relations will be \"underpinned by collaboration, proportionality, accountability\" to balance the interests of workers, businesses and the wider public, the government said. It added further details will be revealed later.  'Umbrella company' workers to have same rights as others People paid through umbrella companies - used by recruitment agencies to pay temporary workers - will have the same rights and protections as those employed directly by a recruitment agency. Enforcement action will be able to be taken against umbrella companies who do not comply. The Employment Rights Bill has been through its first and second readings, and the committee stage, where it is scrutinised by a committee of cross-party MPs. It is now heading to the report stage on 11 March, where all MPs can debate the amendments before it goes to the third reading, when MPs will vote on the bill."
    },
    {
        "title": "BBC apologises over controversial Gaza documentary, with chairman calling it 'a dagger to the heart'",
        "description": "The BBC has called the ongoing controversy over a documentary on Gaza a \"really, really bad moment\", admitting the film's failings are \"a dagger to the heart\" of the corporation's impartiality.",
        "url": "https://news.sky.com/story/bbc-apologises-over-controversial-gaza-documentary-with-chairman-calling-it-a-dagger-to-the-heart-13321236",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bbc-broadcasting-house_6842109.jpg?20250228111317",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-04 12:07:00",
        "Headline": "Gaza: How To Survive A Warzone featured narration from the son of Hamas's deputy minister of agriculture. Consequently, it's been pulled from iPlayer.",
        "Content": "The BBC has called the ongoing controversy over a documentary on Gaza a \"really, really bad moment\", admitting the film's failings are \"a dagger to the heart\" of the corporation's impartiality. Gaza: How To Survive A Warzone was pulled from iPlayer and will not be broadcast on channels again after it emerged that the child narrator is the son of Ayman Alyazouri, who has worked as Hamas's deputy minister of agriculture. Last week, Culture Secretary Lisa Nandy called an \"urgent meeting\" with the corporation over the film. BBC director-general Tim Davie and BBC chairman Samir Shah were questioned by MPs during a Culture, Media and Sport Select Committee meeting on Tuesday. Mr Shah told committee members: \"This is a really, really bad moment. It's is a dagger to the heart of the BBC claim to be impartial and to be trustworthy.\" He said questions over \"what went wrong\" were asked \"on day one\" following the programme's transmission. He went on: \"To my shock, I think that we found that there were serious failings on both sides, on the independent production side as well, as well as on the BBC side.\" \n                  Channel 4 News admits output featured Hamas official's son also linked to BBC documentary on Gaza\n                 \n                  BBC bosses questioned by MPs after Gaza documentary controversy\n                 \n                  Government calls 'urgent meeting' with BBC over controversial Gaza documentary\n                 Mr Shah said an interim report commissioned by the BBC found \"it wasn't so much the processes were at fault as people weren't doing their job\". Mr Shah said he believed the problem was confined to this programme, adding: \"On this story we're examining the how and why, the compliance that determines did not take place.\" However, he also said he thought a review into how the BBC covers stories in the Middle East should also be carried out independently. Tim Davie said there was \"a lot of frustration and disappointment\" over the film, adding: \"We're very sorry to the audience.\" Read more:Starmer faces calls for UK's role in Gaza war to be scrutinisedHamas rejects Israeli request to extend first phase of Gaza ceasefire deal 'We were not told' How To Survive A Warzone was made by independent production company Hoyo Films, and features 13-year-old Abdullah al Yazouri, who speaks about life in Gaza during the war between Israel and Hamas. Mr Davie said there were specific questions asked around Abdullah's father, and the BBC \"found out that we were not told\". He went on: \"At that point, quite quickly, I lost trust in that film. Therefore, I took the decision quite quickly to take it off iPlayer while we do this deep dive.\" Mr Davie said removing the film from iPlayer had been \"a very tough decision\". Discussing whether or not the family involved in the film had been paid for their work, he said: \"As I understand it today, the BBC has only made one payment. This was for a licence fee, to the programme maker.\" He said an initial assessment of the economics had showed \"that there was a small payment to the sister… It's totally normal payment because the boy recorded the narration. He went to a studio to do it.\" Describing the fallout as \"damaging\", Mr Davie said he believes \"overall trust in BBC News remains very high\". He went on: \"We're not losing all context here. This was a serious failing. But we have trust numbers that we're very proud of, we're the most trusted brand in the world. And part of what we do to earn that trust… is actually be highly transparent and go through enormous processes when we fail like this to show how we're going to fix it.\"  Mr Davie says he has \"fast-tracked\" the review \"out of the news department\", where it will be overseen by Peter Johnson, BBC Director, Editorial Complaints and Reviews. Media watchdog Ofcom sent a letter to the BBC flagging their \"ongoing concerns\" about the \"nature and gravity\" of the documentary on Monday, which Mr Shah said he \"welcomed\". The Metropolitan Police said: \"Officers from the Met's Counter Terrorism Command are currently assessing whether any police action is required\" in relation to the documentary. Complaints from both sides Hoyo Films said in a statement: \"We are co-operating fully with the BBC and Peter Johnston (director of editorial complaints and reviews) to help understand where mistakes have been made. \"We feel this remains an important story to tell, and that our contributors - who have no say in the war - should have their voices heard.\" Last week, protesters gathered outside Broadcasting House in London claiming the BBC had aired Hamas propaganda. The BBC also faced criticism in pulling the documentary, with Gary Lineker, Anita Rani, Riz Ahmed and Miriam Margoyles among more than 500 media figures who had condemned the action. In an open letter addressed to Mr Davie, Dr Shah and outgoing chief content officer Charlotte Moore, hundreds of TV and film professionals and journalists called the decision to remove the documentary \"politically motivated censorship\". Following the committee session, Artists for Palestine UK, the group that published the letter, accused Mr Davie and Mr Shah of \"throwing Palestinian children under the bus\", questioning how the corporation would safeguard the young people who appeared in the documentary. In a statement, the charity Campaign Against Antisemitism accused the BBC of \"marking its own homework\", adding: \"No other broadcaster would be permitted this latitude, and no other regulated industry would allow this.\" They also called for the licence fee to be suspended pending an independent investigation into the documentary."
    },
    {
        "title": "World's largest iceberg runs aground in South Georgia and blocks off key penguin feeding ground",
        "description": "After nearly 40 years at sea, the world's largest iceberg has run aground on the remote British overseas territory of South Georgia, one of the biologically rich habitats on Earth home to millions of penguins, seals and endangered albatross.",
        "url": "https://news.sky.com/story/worlds-largest-iceberg-runs-aground-in-south-georgia-and-blocks-off-key-penguin-feeding-ground-13321250",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-iceberg-a23a-rrs-sir-david-attenborough_6845918.jpg?20250304123942",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-03-04 12:36:00",
        "Headline": "The so-called A23a iceberg, the world's largest, has run aground in South Georgia after almost 40 years at sea, threatening important penguin colonies.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n After nearly 40 years at sea, the world's largest iceberg has run aground on the remote British overseas territory of South Georgia, one of the biologically rich habitats on Earth home to millions of penguins, seals and endangered albatross. The vast \"megaberg\" named A23a covers 1,200 square miles - roughly the size of Gloucestershire. Now it has grounded it is expected to break up, threatening to prevent penguins and other sea-life from accessing crucial feeding grounds and the fishing vessels operating in the area. Last week as it approached South Georgia it was moving \"very fast,\" according to Dr Andrew Meijers, an oceanographer at the British Antarctic Survey in Cambridge. \"It was covering 30km a day, fairly ripping along for an iceberg,\" he said. Then on Friday it suddenly stopped, its corner snagging the seafloor about 40 miles off the southwest coast of South Georgia.  The stress of the collision, tides and currents are likely to speed the breakup of the 'berg in the warmer waters - 1,200 miles from Antarctica where it began its long, slow journey. A23a broke off from Antarctica's Filchner-Ronne ice shelf in 1986, carrying a Soviet research station Druzhnaya built on it into the Wedell Sea. The 'berg barely moved for 20 years, then in 2020 began drifting slowly north. It spent six months last year spinning in a revolving ocean current in the Southern Ocean before finally breaking free in the New Year on a collision course with South Georgia. Apart from a handful of visiting scientists and officials representing the Falkland Islands-based government of South Georgia, the island is uninhabited - by people at least. \"This area is extremely important for penguins,\" said Peter Fretwell, a geospatial information scientist also at the British Antarctic Survey. Several million penguins including macaroni, chinstrap, gentoo and king penguins call South Georgia home. As do several species of albatross, elephant seals and fur seals. The ocean around the islands is also increasingly important for whales, now returning after hunting them was banned. The iceberg is blocking a vast area of ocean that is an important feeding ground for macaroni penguins - South Georgia is home to one of the world's largest colonies. As it melts, A23a will be releasing millions of gallons of fresh water into the ocean each day. Because fresh water floats on top of heavier seawater, it has the potential to force nutrients - and therefore the shrimp-like krill penguins feed on - deeper into the water column. \"If it's very clean water, it will introduce a halo of low-productivity around the iceberg,\" said Mr Fretwell. However, the opposite could also happen. Some icebergs carry a lot of sediment with them, scraped from the rocks of Antarctica. Once released into the ocean this sediment can add nutrients to the water - potentially boosting the amount of food available for penguins. Megabergs of this size are rare, too few for scientists to know if they're becoming more common or not. However, they're emblematic of a clear warming trend in the Antarctic that is causing the increasingly rapid melting of its ice sheets, which are the world's largest. The continent is losing around 150 billion tonnes of water in the form of ice a year, half carried away as icebergs, the rest due to ice melting directly off the continent itself. A key concern is whether all that fresh water will disrupt what is effectively our planet's cooling system. The Antarctic Circumpolar Current - a conveyor belt of cold water running around Antarctica - is the single most important system that removes rising levels of heat from our atmosphere. Warm air from the rest of the planet heats the surface waters, and currents then draw this warmer water down, replacing it with cooler water from the depths of the ocean. \"It does all of the heavy lifting in terms of trapping heat from global warming,\" said Dr Meijers. Microscopic plants - phytoplankton - in the region also absorb the most planet-warming carbon dioxide, which is, like the warmer water, carried deep into the oceans and stored there. A recent study suggests fresh water from melting icebergs and the Antarctic continent is already slowing this circumpolar current and may reduce its speed by 20% by 2050. A potentially worrying \"positive feedback\" that could further exacerbate global warming."
    },
    {
        "title": "Scientists trying to bring back the woolly mammoth create a woolly mouse",
        "description": "Scientists trying to bring back the woolly mammoth have created a woolly mouse.",
        "url": "https://news.sky.com/story/scientists-trying-to-bring-back-the-woolly-mammoth-create-a-woolly-mouse-13321512",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-genetically-mice-colossal-biosciences_6845949.jpg?20250304131850",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-04 20:50:00",
        "Headline": "Biotech company Colossal Biosciences unveiled plans in 2021 to revive the woolly mammoth - and later the dodo bird.",
        "Content": "Scientists trying to bring back the woolly mammoth have created a woolly mouse. Colossal Biosciences unveiled plans in 2021 to revive the woolly mammoth - and later the dodo bird - attracting investors, headlines and critics alike. The Texas-based biotech company has since focused on identifying the key traits of extinct animals with the goal of genetically engineering them into living animals, according to chief executive Ben Lamm. Read more: Why 'de-extincting' the mammoth won't be like Jurassic Park Alongside bringing back species that went extinct, the company hopes their work can be used to help with conservation efforts. But other scientists have mixed views of their work and whether it will be helpful. On Tuesday, Colossal Biosciences said its researchers had edited seven genes in mice embryos to create a mouse with long, thick, woolly hair. They nicknamed the extra-furry rodent a \"colossal woolly mouse.\" The company now plans to genetically modify Asian elephants to give them woolly mammoth traits - but critics have argued that this is different from actually bringing a species back from extinction. \"You're not actually resurrecting anything - you're not bringing back the ancient past,\" said Christopher Preston, a wildlife and environment expert at the University of Montana, who was not involved in the research. He added: \"You might be able to alter the hair pattern of an Asian elephant or adapt it to the cold, but it's not bringing back a woolly mammoth. It's changing an Asian elephant.\" The results have not yet been published in a journal or vetted by independent scientists. The feat \"is technologically pretty cool,\" said Vincent Lynch, a biologist at the University of Buffalo, who was not involved in the research. Alongside the mouse being given different hair, in a press release, Colossal Biosciences said the rodent had also gained the woolly mammoth's accelerated fat metabolism. Both were said to be likely related to cold tolerance. These genetic variations were already present in some living mice, the company's chief scientist Beth Shapiro said, adding: \"We put them all together in a single mouse.\" Read more from Sky News:Smoke bombs thrown in Serbia's parliament'Stalker' threatens to kill during live streamInside Bangladesh's 'death squad' jails The company said it focused first on mice to confirm the process worked before potentially moving onto the embryos of Asian elephants - the closest living relative of woolly mammoths. However, as Asian elephants are an endangered species, there will be a lot of red tape before any plans can move forward, Mr Lamm admitted."
    },
    {
        "title": "Bill to limit harms of smartphone use among children to be published",
        "description": "A bill that aims to protect children from the damaging effects of smartphones will be published on Thursday before MPs vote on it later this week.",
        "url": "https://news.sky.com/story/bill-to-limit-harms-of-smartphone-use-among-children-to-be-published-13321277",
        "image_url": "https://e3.365dm.com/19/02/1920x1080/skynews-smartphones-phones_4565186.jpg?20190202030939",
        "type": "Technology",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-03-04 13:26:00",
        "Headline": "MPs are due to debate and vote on the Safer Phones Bill, which aims to raise the age of \"internet adulthood\" from 13 to 16.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n A bill that aims to protect children from the damaging effects of smartphones will be published on Thursday before MPs vote on it later this week. The Safer Phones Bill, put forward by backbench Labour MP Josh MacAlister, will have its second reading in the Commons on Friday - the first opportunity parliament has to debate its principles before deciding whether it should proceed further. Last October, Sky News reported that Mr MacAlister, a former teacher, had dropped plans to ban smartphones from schools because the government did not support the measure on the grounds that headteachers already have the power to ban phones - although it is not upheld in law. Politics latest: JD Vance hits back at troops claims Instead, supporters of the bill hope the move will encourage the government to back other elements in it, including strengthened powers for regulator Ofcom to protect children from apps that are designed to be addictive and an increase in the \"internet adulthood\" age - when children can create social media profiles and email accounts - from 13 to 16. A supporter of the bill told Sky News the focus now was on securing these reforms with the hope that if the government is unable to commit to increase the internet adulthood age now, that it would pledge to do so in the future through the Online Safety Act. The act, which was passed under the previous Conservative government, requires providers of online services to minimise the extent of illegal and harmful content. \n                  Man who died on motorway had been arrested 'after being confronted by online paedophile hunters'\n                 \n                  Grooming gangs scandal timeline: What happened, what inquiries there were and how Starmer was involved - after Elon Musk's accusations\n                 \n                  Father calls for industry changes after baby dies during 'hands-free' breastfeeding\n                 The regulator has said its duty around illegal harms will become enforceable around March this year, but the act is not expected to be implemented in full until 2026. One measure supporters hope could be on the table is a government commitment to review the act to see if Ofcom is using its powers effectively. One backer of the bill told Sky News: \"Ofcom is about to get new powers which are untested.  \"We want to keep the issue alive - we know how popular it is among parents and parliament needs to catch up, frankly.\" Under the previous Tory government, schools in England were issued with guidance intended to stop the use of mobile phones in the classroom. However, the guidance was non-statutory, leaving it up to individual schools to set their own policy. Last year, a study by the Policy Exchange thinktank found that schools which effectively ban mobile phones get better GCSE results than those with \"laxer policies\". Read more:Call for tougher measures on under-16 mobile phone useLabour MP goes public to oppose family farms tax The centre-right thinktank also said in its report that secondary schools in England where such a ban was in place were more than twice as likely to be rated outstanding by Ofsted as the national average. However, an investigation by the University of Birmingham last month found that restricting mobile phones at school does not improve grades or mental wellbeing. The study found that students' levels of sleep, exercise and academic record did not differ between schools with and without phone bans, and that restrictive policies did not lower the overall time young people spend on their phones each day. The debate over smartphone and social media use for children and teenagers had been reignited following Australia's decision to bans under 16s from having social media accounts. The legislation is set to come into force in November 2025 and will force platforms to take reasonable steps to ensure age-verification protections are in place."
    },
    {
        "title": "Twitch creators warn other women after 'stalker' threatens to kill them during live video stream",
        "description": "Three Twitch creators have issued a warning to others on the platform after a \"stalker\" followed and then threatened to kill them during a live video stream.",
        "url": "https://news.sky.com/story/twitch-creators-warn-other-women-after-stalker-threatens-to-kill-them-during-live-video-stream-13321201",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-valkyrae-emiru-cinna_6846089.jpg?20250304152204",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-04 10:59:00",
        "Headline": "Cinna, Valkyrae and Emiru, who have more than 3.6 million Twitch followers between them, were walking along Santa Monica Pier when they were first approached by the man - who then reappeared around 20 minutes later before becoming aggressive. ",
        "Content": "Three Twitch creators have issued a warning to others on the platform after a \"stalker\" followed and then threatened to kill them during a live video stream. Cinna, Valkyrae and Emiru, who have more than 3.6 million Twitch followers between them, were filming as part of a week-long marathon stream event they called \"Sisathon\" on Sunday night. The livestream showed them walking towards Pacific Park on Santa Monica Pier, California, when they were approached by a man in a grey hoodie who said his name was Russell. He stopped them and asked for a photo before Cinna, 28, said: \"Yeah of course.\" The man then asked if he can \"hang out with them\" before the Twitch streamer, whose real name is Brittany Lynn Watts, said they can't because they are on a \"time limit\". The women then continued walking into the amusement park before the man appeared to head off in the other direction. However, around 20 minutes later, the livestream showed the moment the women walked past the same man, who was now wearing different clothes, as he was crouched down next to one of the rides. \n                  Trump: 'American dream is surging' and we're 'just getting started'\n                 \n                  Zelenskyy says Ukraine 'ready to come to negotiating table' - after US pauses military aid\n                 \n                  Zelenskyy is 'untrustworthy crook and punk', says ex-Trump aide\n                 The Twitch streamers looked concerned as the man asked Emiru, whose real name is Emily Schunk, for her phone number. The 27-year-old quickly replied that she didn't have a phone before the man told the group: \"I'm going to keep following her (Emiru).\" The women then walked off before looking frightened when he caught up with them minutes later. The man was off-camera as Cinna said \"get away from her\" and stood between him and Emiru. Valkyrae, whose real name is Rachell Marie Hofstetter, then started calling for security before the women screamed as the man ran towards them and shouted: \"I'll kill you right now, I'll kill you right now.\" The Twitch streamers then fled from the park before the video cut out. In a separate video posted on Cinna's Twitch account on Monday, the streamer and Valkyrae gave a lengthy account of their ordeal. Cinna told her followers: \"We are very much in shock and we need you guys to know, that clip does not do it justice for how scary it was.\" She added that Emiru is \"safe\" but needs time to \"process it and stuff\". \"It is an attempt on our life and we are taking it very seriously,\" Cinna told her followers. She continued: \"He said he was going to kill us, he kept trying to get something out of his pocket. We had to run into a store screaming that somebody was going to kill us.\" Cinna added: \"For those of you who don't know, we know he's a stalker. When he was behind us, he pulled up Emmy's TikToks.\" Valkyrae posted on X after the ordeal that they were \"OK\" and had been with the police. She also shared a post criticising people who accused the women of staging what happened. Read more from Sky News:Trump pauses US military aid to UkraineHow mobile games profit from misogynistic tropesInside Bangladesh's 'death squad' jails Valkyrae wrote on X: \"I hope other women and streamers learn from seeing this interaction and also be aware that this can happen to anybody.\" Meanwhile, Emiru said in a post on X on Monday: \"I wish I could say this was some kind of one in a million incident, but the truth is, it is not. This is what life is like for girls. I hope if anything, people see what happened and realize how much of a reality it is for women and content creators as a whole.\" Santa Monica Police is said to have carried out a search for the suspect but were unable to find him. The force has reportedly said it is \"aware of the video footage\" and is \"reviewing the information that has been shared publicly\". Sky News has contacted Santa Monica Police for comment."
    },
    {
        "title": "Tattoos may be linked to increased risk of cancer, study suggests",
        "description": "Tattoos may be linked to an increased risk of cancer, according to a new study.",
        "url": "https://news.sky.com/story/tattoos-may-be-linked-to-increased-risk-of-cancer-study-suggests-13321253",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tattoos-artist-studio_6845975.jpg?20250304133642",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-04 12:37:00",
        "Headline": "Researchers at the University of South Denmark have found tattoo ink does not just remain where it is injected but also accumulates in the lymph nodes.",
        "Content": "Tattoos may be linked to an increased risk of cancer, according to a new study. Researchers at the University of South Denmark and the University of Helsinki have found tattoo ink may increase the risk of skin and lymphoma cancers. The research team says this is because tattoo ink accumulates in the lymph nodes and does not just remain where it is injected. Lymph nodes are small structures which help to protect the body against potentially harmful substances. The university researchers are concerned that tattoo ink may trigger an inflammation in the lymph nodes, which could lead to abnormal cell growth and an increased risk of cancer over time. A quarter (26%) of the British public have tattoos, according to a 2022 YouGov survey. Last year, Wales brought in new rules for tattoo artists and body piercers with a UK-first licensing scheme. \n                  Breast cancer cases and deaths set to surge, study suggests\n                 \n                  'Life-saving' simple blood test could transform and personalise cancer care if trial succeeds\n                 \n                  Cancer death rates 'almost 60% higher' in deprived areas\n                 The team at the University of South Denmark (SDU) have access to information from more than 5,900 Danish twins, as part of survey results from the Danish Twin Tattoo Cohort. Having analysed tattoo patterns and cancer diagnoses, the study found higher occurrence of both skin and lymphoma cancers in those with tattoos. \"The unique aspect of our approach is that we can compare twin pairs where one has cancer, but they otherwise share many genetic and environmental factors,\" said Jacob von Bornemann Hjelmborg, professor of biostatistics at SDU. The study also suggests the size of the tattoo can have an impact, and the rate for lymphoma is particularly high for tattoos defined as bigger than a palm. The rate was nearly three times higher for individuals with large tattoos compared to those without any. Read more from Sky News:Comedy 'super producer' dies after accident abroadWhat we learned from Meghan's new Netflix show \"This suggests that the bigger the tattoo and the longer it has been there, the more ink accumulates in the lymph nodes,\" Signe Bedsted Clemmensen, assistant professor of biostatistics at SDU, added. Researchers plan to conduct further research into whether particular ink colours have varying impacts and whether certain types of lymphomas are more linked to tattoos than others."
    },
    {
        "title": "Jay-Z sues woman who accused him of rape before dropping claim",
        "description": "Jay-Z has sued the woman who accused him of raping her, in a now-withdrawn complaint.",
        "url": "https://news.sky.com/story/jay-z-sues-woman-who-accused-him-of-rape-before-dropping-claim-13321556",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-jay-z-hip-hop-lawsuit_6846394.jpg?20250304214838",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-04 21:45:00",
        "Headline": "Last month, a woman who had accused Jay-Z and Sean 'Diddy' Combs of raping her withdrew her lawsuit.",
        "Content": "Jay-Z has sued the woman who accused him of raping her, in a now-withdrawn complaint. Sky News' US partner NBC News reported the 55-year-old music mogul had launched a defamation lawsuit against the woman. The American rapper reportedly said the woman and the lawyers representing her \"were soullessly motivated by greed, in abject disregard of the truth\" and alleged that they caused harm to his personal and professional reputation. Jay-Z, whose legal name is Shawn Carter, is reported to have filed the lawsuit in a federal court in Alabama, where the woman, referred to in the lawsuit only as \"Jane Doe\", lives. The initial allegation made by the woman centred on Jay-Z and Sean 'Diddy' Combs. It was withdrawn with prejudice last month - meaning it cannot be brought back to court. At the time the lawsuit was withdrawn, Jay-Z said: \"Today is a victory. These frivolous, fictitious and appalling allegations have been dismissed. \"The fictional tale they created was laughable, if not for the seriousness of the claims. I would not wish this experience on anyone.\" In her lawsuit, in New York, the woman originally accused Carter and Combs of raping her at an after party following the 2000 MTV Music Video Awards. His lawsuit cited inconsistencies in the woman's account that were reported by NBC News. This reportedly included claiming her father had picked her up for a ride home, but him saying he didn't recall making the drive - of more than five hours - at the time. She also claimed to speak to musician Benji Madden at the party, but a representative for Madden said that neither Benji nor his brother Joel attended the 2000 VMAs and that they were on tour in the Midwest at the time, NBC News added. Jay-Z is seeking a jury trial and unspecified damages. However, in a separate legal filing Monday, the woman said she was sticking with her story, NBC News reported. Read more from Sky News:Another broadcaster featured Hamas official's sonDolly Parton's husband of nearly 60 years diesComedy 'super producer' dies after accident abroad Combs is currently in prison awaiting a scheduled 5 May criminal trial on racketeering and sex trafficking charges. He still faces dozens of other civil lawsuits by women and men who have accused him of sexual assault and other misconduct. Combs has pleaded not guilty in the criminal case and has maintained his innocence in all the cases."
    },
    {
        "title": "Olivier Awards: Adrien Brody gets first nomination days after Oscar win",
        "description": "Nominations for the Olivier Awards, British theatre's most prestigious honours, have been announced.",
        "url": "https://news.sky.com/story/olivier-awards-adrien-brody-gets-first-nomination-days-after-oscar-win-13321406",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-the-fear-of-13-adrien-brody_6846220.jpg?20250304170926",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-03-04 17:00:00",
        "Headline": "The full list of nominations have been announced for Olivier Awards 2025, with stars including Adrien Brody, Lesley Manville, Ben Whishaw and Billy Crudup all up for British theatre’s top prize.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Nominations for the Olivier Awards, British theatre's most prestigious honours, have been announced. Following his second Oscar win at the weekend, Adrien Brody is nominated for best actor, for his performance in The Fear Of 13 - a play based on the real-life story of a man who spent 22 years on death row for a rape and murder that he did not commit. Fellow US stars Billy Crudup and John Lithgow are up against him in the category, along with UK stars Paapa Essiedu and Mark Strong. Brody, Crudup, Essiedu and Lithgow are all first-time nominees. In the best actress category, The Crown star Lesley Manville is up against Meera Syal, Indira Varma, Heather Agyepong and Rosie Sheehy. Manville and Varma both nominated for playing the same role in different productions of the Greek mythology classic Oedipus Fiddler On The Roof is this year's most nominated production, with 13 nods. \n                  Oscars 2025: Anora sweeps the Academy Awards with five awards including best picture\n                 \n                  Oscars backstage: Six highlights from the Academy Awards winners room\n                 \n                  Oscars 2025: The full list of winning films and stars\n                 It's up for best musical revival, with old favourites including Oliver!, Hello Dolly and Starlight Express. In the musical theatre performing categories, John Dagleish is up for best actor for his role in The Curious Case Of Benjamin Button, a decade after his last win. He's up against Myles Frost, Simon Lipkin, Jamie Muscato and Adam Dannheisser. Four-time Olivier winner Imelda Staunton is up for best actress in a musical for her role in Hello Dolly!, her 14th Olivier nomination and her eighth in the category. She's competing against Lara Pulver, Chumisa Dornford-May, Lauren Drew and Clare Foster. Best new play includes Brody's The Fear Of 13, along with Kyoto, Shifters, Giant and The Years. Giant and The Years are tied for most nominated play this year with five apiece. Gina McKee is nominated for best actress in a supporting role, alongside Romola Garai who is double nominated in the same category for her roles in Giant and The Years. Actress Sharon D Clarke makes up the category. And in best supporting actor, Ben Whishaw will be battling it out against Jorge Bosch, Tom Edden, and Elliot Levey. Sunset Boulevard was the big winner at last year's Olivier Awards, taking home seven gongs and equalling the record for the most prizes for a musical at the ceremony. The 2025 Olivier Awards will take place on Sunday 6 April at the Royal Albert Hall, hosted by Beverley Knight and Billy Porter. Full list of nominations: Mastercard Best New Musical The Curious Case Of Benjamin Button, music & lyrics by Darren Clark, book & lyrics by Jethro Compton at Ambassadors Theatre MJ The Musical, book by Lynn Nottage at Prince Edward Theatre Natasha, Pierre & The Great Comet Of 1812, music, lyrics & book by Dave Malloy at Donmar Warehouse Why Am I So Single?, music, lyrics & book by Toby Marlow & Lucy Moss at Garrick Theatre Blue-i Theatre Technology Award for Best Set Design Jon Bausor for Set Design, Toby Olié & Daisy Beattie for Puppetry Design and Satoshi Kuriyama for Projection Design for Spirited Away at London Coliseum Frankie Bradshaw for Set Design for Ballet Shoes at National Theatre - Olivier Es Devlin for Set Design for Coriolanus at National Theatre - Olivier Tom Scutt for Set Design for Fiddler On The Roof at Regent's Park Open Air Theatre White Light Award for Best Lighting Design Paule Constable & Ben Jacobs for Oliver! at Gielgud Theatre Howard Hudson for Natasha, Pierre & The Great Comet Of 1812 at Donmar Warehouse Howard Hudson for Starlight Express at Troubadour Wembley Park Theatre Aideen Malone for Fiddler On The Roof at Regent's Park Open Air Theatre TAIT Award for Best New Opera ProductionDuke Bluebeard's Castle by English National Opera at London Coliseum Festen by The Royal Opera at Royal Opera House L'Olimpiade by Irish National Opera & The Royal Opera at Royal Opera House The Tales Of Hoffmann by The Royal Opera at Royal Opera House Outstanding Achievement in Opera Aigul Akhmetshina for her performance in Carmen at Royal Opera House Allan Clayton for his performance in Festen at Royal Opera House Jung Young-doo for his direction of Lear at Barbican Theatre Best Family Show Brainiac Live at Marylebone Theatre Maddie Moate's Very Curious Christmas at Apollo Theatre The Nutcracker at Polka Theatre Rough Magic at Shakespeare's Globe - Sam Wanamaker Playhouse Best New Production in Affiliate Theatre Animal Farm at Theatre Royal Stratford East by George Orwell, adapted by Tatty Hennessy Boys On The Verge Of Tears by Sam Grabiner at Soho Theatre English by Sanaz Toossi at Kiln Theatre Now, I See by Lanre Malaolu at Theatre Royal Stratford East What We Talk About When We Talk About Anne Frank by Nathan Englander at Marylebone Theatre Best New Dance Production Assembly Hall by Kidd Pivot, Crystal Pite & Jonathon Young at Sadler's Wells Frontiers: Choreographers Of Canada - Pite/Kudelka/Portner by The National Ballet Of Canada at Sadler's Wells Theatre Of Dreams by Hofesh Shechter Company at Sadler's Wells An Untitled Love by A.I.M by Kyle Abraham at Sadler's Wells Outstanding Achievement in Dance Sarah Chun for her performance in Three Short Ballets at Royal Opera House - Linbury Theatre Tom Visser for his lighting design of Angels' Atlas as part of Frontiers: Choreographers Of Canada - Pite/Kudelka/Portner at Sadler's Wells Eva Yerbabuena for her performance in Yerbagüena at Sadler's Wells Best Actor in a Supporting Role Jorge Bosch for Kyoto at @sohoplace Tom Edden for Waiting For Godot at Theatre Royal Haymarket Elliot Levey for Giant at Jerwood Theatre Downstairs at Royal Court Theatre Ben Whishaw for Bluets at Jerwood Theatre Downstairs at Royal Court Theatre Best Actress in a Supporting Role Sharon D Clarke for The Importance Of Being Earnest at National Theatre - Lyttelton Romola Garai for Giant at Jerwood Theatre Downstairs at Royal Court Theatre Romola Garai for The Years at Almeida Theatre & Harold Pinter Theatre Gina McKee for The Years at Almeida Theatre & Harold Pinter Theatre Gillian Lynne Award for Best Theatre Choreographer Matthew Bourne for Oliver! at Gielgud Theatre Julia Cheng for Fiddler On The Roof at Regent's Park Open Air Theatre Hofesh Shechter for Oedipus at The Old Vic Christopher Wheeldon for MJ The Musical at Prince Edward Theatre Best Costume Design Hugh Durrant for Robin Hood at The London Palladium Sachiko Nakahara for Spirited Away at London Coliseum Tom Scutt for Fiddler On The Roof at Regent's Park Open Air Theatre Gabriella Slade for Starlight Express at Troubadour Wembley Park Theatre d&b audiotechnik Award for Best Sound Design Nick Lidster for Fiddler On The Roof at Regent's Park Open Air Theatre Christopher Shutt for Oedipus at The Old Vic Thijs van Vuure for The Years at Almeida Theatre & Harold Pinter Theatre Koichi Yamamoto for Spirited Away at London Coliseum Outstanding Musical Contribution Mark Aspinall for Musical Supervision & Additional Orchestrations for Fiddler On The Roof at Regent's Park Open Air Theatre Darren Clark for Music Supervision, Orchestrations & Arrangements and Mark Aspinall for Musical Direction, Music Supervision, Orchestrations & Arrangements for The Curious Case Of Benjamin Button at Ambassadors Theatre Dave Malloy for Orchestrations and Nicholas Skilbeck for Musical Supervision for Natasha, Pierre & The Great Comet Of 1812 at Donmar Warehouse Asaf Zohar for Compositions and Gavin Sutherland for Dance Arrangements & Orchestration for Ballet Shoes at National Theatre - Olivier Best Actress in a Supporting Role in a Musical Liv Andrusier for Fiddler On The Roof at Regent's Park Open Air Theatre Amy Di Bartolomeo for The Devil Wears Prada at Dominion Theatre Beverley Klein for Fiddler On The Roof at Regent's Park Open Air Theatre Maimuna Memon for Natasha, Pierre & The Great Comet Of 1812 at Donmar Warehouse Best Actor in a Supporting Role in a Musical Andy Nyman for Hello, Dolly! at The London Palladium Raphael Papo for Fiddler On The Roof at Regent's Park Open Air Theatre Layton Williams for Titanique at Criterion Theatre Tom Xander for Mean Girls at Savoy Theatre Noël Coward Award for Best New Entertainment or Comedy Play Ballet Shoes adapted by Kendall Feaver at National Theatre - Olivier Inside No 9 Stage/Fright by Steve Pemberton & Reece Shearsmith at Wyndham's Theatre Spirited Away adapted by John Caird & co-adapted by Maoko Imai at London Coliseum Titanique by Tye Blue, Marla Mindelle & Constantine Rousouli at Criterion Theatre Sir Peter Hall Award for Best Director Eline Arbo for The Years at Almeida Theatre & Harold Pinter Theatre Jordan Fein for Fiddler On The Roof at Regent's Park Open Air Theatre Nicholas Hytner for Giant at Jerwood Theatre Downstairs at Royal Court Theatre Robert Icke for Oedipus at Wyndham's Theatre Best Actress Heather Agyepong for Shifters at Duke of York's Theatre Lesley Manville for Oedipus at Wyndham's Theatre Rosie Sheehy for Machinal at The Old Vic Meera Syal for A Tupperware Of Ashes at National Theatre - Dorfman Indira Varma for Oedipus at The Old Vic Best Actor Adrien Brody for The Fear Of 13 at Donmar Warehouse Billy Crudup for Harry Clarke at Ambassadors Theatre Paapa Essiedu for Death Of England: Delroy at @sohoplace John Lithgow for Giant at Jerwood Theatre Downstairs at Royal Court Theatre Mark Strong for Oedipus at Wyndham's Theatre Cunard Best Revival The Importance Of Being Earnest by Oscar Wilde at National Theatre - Lyttelton Machinal by Sophie Treadwell at The Old Vic Oedipus by Robert Icke at Wyndham's Theatre Waiting For Godot by Samuel Beckett at Theatre Royal Haymarket Piper-Heidsieck Award for Best Musical Revival Fiddler On The Roof, music by Jerry Bock, lyrics by Sheldon Harnick, book by Joseph Stein at Regent's Park Open Air Theatre Hello, Dolly!, music & lyrics by Jerry Herman, book by Michael Stewart at The London Palladium Oliver!, book, music & lyrics by Lionel Bart, new material & revisions by Cameron Mackintosh at Gielgud Theatre Starlight Express, music by Andrew Lloyd Webber, lyrics by Richard Stilgoe at Troubadour Wembley Park Theatre Best Actor in a Musical John Dagleish for The Curious Case Of Benjamin Button at Ambassadors Theatre Adam Dannheisser for Fiddler On The Roof at Regent's Park Open Air Theatre Myles Frost for MJ The Musical at Prince Edward Theatre Simon Lipkin for Oliver! at Gielgud Theatre Jamie Muscato for Natasha, Pierre & The Great Comet Of 1812 at Donmar Warehouse Best Actress in a Musical Chumisa Dornford-May for Natasha, Pierre & The Great Comet Of 1812 at Donmar Warehouse Lauren Drew for Titanique at Criterion Theatre Clare Foster for The Curious Case Of Benjamin Button at Ambassadors Theatre Lara Pulver for Fiddler On The Roof at Regent's Park Open Air Theatre Imelda Staunton for Hello, Dolly! at The London Palladium The Londoner Award for Best New Play The Fear Of 13 by Lindsey Ferrentino at Donmar Warehouse Giant by Mark Rosenblatt at Jerwood Theatre Downstairs at Royal Court Theatre Kyoto by Joe Murphy & Joe Robertson at @sohoplace Shifters by Benedict Lombe at Duke of York's Theatre The Years adapted by Eline Arbo, in an English version by Stephanie Bain at Almeida Theatre & Harold Pinter Theatre"
    },
    {
        "title": "Channel 4 News admits output featured Hamas official's son also linked to BBC documentary on Gaza",
        "description": "Channel 4 News has admitted the son of a Hamas official featured in parts of its daily coverage of the Israel-Hamas war.",
        "url": "https://news.sky.com/story/channel-4-news-admits-output-featured-hamas-officials-son-also-linked-to-bbc-documentary-on-gaza-13321414",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-channel-4-channel-four_6846256.jpg?20250304185310",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-04 17:54:00",
        "Headline": "Channel 4 insists it is \"proud of its duly impartial coverage\" throughout the conflict in Gaza adding that it \"has upheld the highest editorial standards\".",
        "Content": "Channel 4 News has admitted the son of a Hamas official featured in parts of its daily coverage of the Israel-Hamas war. The appearance of the son of Ayman Alyazouri - who has worked as Hamas's deputy minister of agriculture - follows an ongoing controversy within the BBC. The BBC's chair Samir Shah told MPs on Tuesday that a BBC documentary which included 13-year-old Abdullah al Yazouri was a \"really, really bad moment\" and \"a dagger to the heart\" to the organisation's impartiality. On Tuesday, Channel 4 issued a statement to confirm Abdullah has also appeared in \"three short news segments for the programme\", although it represented only a \"handful of minutes across hundreds of hours\" of output. \"Abdullah al Yazouri did categorically not appear in any documentary broadcast on Channel 4\" but did appear \"alongside other voices, including Israeli voices, as part of wider packaging and reporting... and in line with our principles of due impartiality,\" the broadcaster said. Channel 4 said no payment was made to the boy or any of his family members, and that, once the foreign reporting team became aware of the role the boy's father held, they \"took a decision not to feature him again\". \"Action was taken to provide additional context to the archived online copy of the reports in which Abdullah features. \n                  BBC apologises over controversial Gaza documentary, with chairman calling it 'a dagger to the heart'\n                 \n                  BBC bosses questioned by MPs after Gaza documentary controversy\n                 \n                  Government calls 'urgent meeting' with BBC over controversial Gaza documentary\n                 \"Where context could not be added, namely to social media, the content was removed in line with standard editorial procedures.\" The broadcaster added it is \"proud of its duly impartial coverage throughout the conflict\" in Gaza and \"has upheld the highest editorial standards\". Read more from Sky News:Thoughts on Meghan's new Netflix seriesOlivier Awards: Nominations are outLittle Britain star issues apology Last year, Channel 4 News was named news programme of the year at the annual Royal Television Society (RTS) awards. RTS said the broadcaster had assured it that no video material featuring Abdullah al Yazouri was featured in their awards entries and it \"had no plans to revoke the awards\". Last week, the BBC issued an apology and removed the documentary Gaza: How To Survive A Warzone from iPlayer, saying it had \"identified serious flaws\" in the making of the programme, which included Abdullah as narrator. A statement from the corporation added that a full \"fact-finding review\" will be undertaken, and that it has \"no plans to broadcast the programme again in its current form or return it to iPlayer\". Last week, Culture Secretary Lisa Nandy called an \"urgent meeting\" with the corporation over the film."
    },
    {
        "title": "BBC apologises over controversial Gaza documentary, with chairman calling it 'a dagger to the heart'",
        "description": "The BBC has called the ongoing controversy over a documentary on Gaza a \"really, really bad moment\", admitting the film's failings are \"a dagger to the heart\" of the corporation's impartiality.",
        "url": "https://news.sky.com/story/bbc-apologises-over-controversial-gaza-documentary-with-chairman-calling-it-a-dagger-to-the-heart-13321236",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bbc-broadcasting-house_6842109.jpg?20250228111317",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-04 12:07:00",
        "Headline": "Gaza: How To Survive A Warzone featured narration from the son of Hamas's deputy minister of agriculture. Consequently, it's been pulled from iPlayer.",
        "Content": "The BBC has called the ongoing controversy over a documentary on Gaza a \"really, really bad moment\", admitting the film's failings are \"a dagger to the heart\" of the corporation's impartiality. Gaza: How To Survive A Warzone was pulled from iPlayer and will not be broadcast on channels again after it emerged that the child narrator is the son of Ayman Alyazouri, who has worked as Hamas's deputy minister of agriculture. Last week, Culture Secretary Lisa Nandy called an \"urgent meeting\" with the corporation over the film. BBC director-general Tim Davie and BBC chairman Samir Shah were questioned by MPs during a Culture, Media and Sport Select Committee meeting on Tuesday. Mr Shah told committee members: \"This is a really, really bad moment. It's is a dagger to the heart of the BBC claim to be impartial and to be trustworthy.\" He said questions over \"what went wrong\" were asked \"on day one\" following the programme's transmission. He went on: \"To my shock, I think that we found that there were serious failings on both sides, on the independent production side as well, as well as on the BBC side.\" \n                  Channel 4 News admits output featured Hamas official's son also linked to BBC documentary on Gaza\n                 \n                  BBC bosses questioned by MPs after Gaza documentary controversy\n                 \n                  Government calls 'urgent meeting' with BBC over controversial Gaza documentary\n                 Mr Shah said an interim report commissioned by the BBC found \"it wasn't so much the processes were at fault as people weren't doing their job\". Mr Shah said he believed the problem was confined to this programme, adding: \"On this story we're examining the how and why, the compliance that determines did not take place.\" However, he also said he thought a review into how the BBC covers stories in the Middle East should also be carried out independently. Tim Davie said there was \"a lot of frustration and disappointment\" over the film, adding: \"We're very sorry to the audience.\" Read more:Starmer faces calls for UK's role in Gaza war to be scrutinisedHamas rejects Israeli request to extend first phase of Gaza ceasefire deal 'We were not told' How To Survive A Warzone was made by independent production company Hoyo Films, and features 13-year-old Abdullah al Yazouri, who speaks about life in Gaza during the war between Israel and Hamas. Mr Davie said there were specific questions asked around Abdullah's father, and the BBC \"found out that we were not told\". He went on: \"At that point, quite quickly, I lost trust in that film. Therefore, I took the decision quite quickly to take it off iPlayer while we do this deep dive.\" Mr Davie said removing the film from iPlayer had been \"a very tough decision\". Discussing whether or not the family involved in the film had been paid for their work, he said: \"As I understand it today, the BBC has only made one payment. This was for a licence fee, to the programme maker.\" He said an initial assessment of the economics had showed \"that there was a small payment to the sister… It's totally normal payment because the boy recorded the narration. He went to a studio to do it.\" Describing the fallout as \"damaging\", Mr Davie said he believes \"overall trust in BBC News remains very high\". He went on: \"We're not losing all context here. This was a serious failing. But we have trust numbers that we're very proud of, we're the most trusted brand in the world. And part of what we do to earn that trust… is actually be highly transparent and go through enormous processes when we fail like this to show how we're going to fix it.\"  Mr Davie says he has \"fast-tracked\" the review \"out of the news department\", where it will be overseen by Peter Johnson, BBC Director, Editorial Complaints and Reviews. Media watchdog Ofcom sent a letter to the BBC flagging their \"ongoing concerns\" about the \"nature and gravity\" of the documentary on Monday, which Mr Shah said he \"welcomed\". The Metropolitan Police said: \"Officers from the Met's Counter Terrorism Command are currently assessing whether any police action is required\" in relation to the documentary. Complaints from both sides Hoyo Films said in a statement: \"We are co-operating fully with the BBC and Peter Johnston (director of editorial complaints and reviews) to help understand where mistakes have been made. \"We feel this remains an important story to tell, and that our contributors - who have no say in the war - should have their voices heard.\" Last week, protesters gathered outside Broadcasting House in London claiming the BBC had aired Hamas propaganda. The BBC also faced criticism in pulling the documentary, with Gary Lineker, Anita Rani, Riz Ahmed and Miriam Margoyles among more than 500 media figures who had condemned the action. In an open letter addressed to Mr Davie, Dr Shah and outgoing chief content officer Charlotte Moore, hundreds of TV and film professionals and journalists called the decision to remove the documentary \"politically motivated censorship\". Following the committee session, Artists for Palestine UK, the group that published the letter, accused Mr Davie and Mr Shah of \"throwing Palestinian children under the bus\", questioning how the corporation would safeguard the young people who appeared in the documentary. In a statement, the charity Campaign Against Antisemitism accused the BBC of \"marking its own homework\", adding: \"No other broadcaster would be permitted this latitude, and no other regulated industry would allow this.\" They also called for the licence fee to be suspended pending an independent investigation into the documentary."
    },
    {
        "title": "With Love, Meghan: What we learnt from Duchess of Sussex's new Netflix series",
        "description": "The Duchess of Sussex's lifestyle series premiered this morning - in which she talks about her familiy's life in California, her time spent living in Argentina and her love of food. ",
        "url": "https://news.sky.com/story/with-love-meghan-what-we-learnt-from-duchess-of-sussexs-new-netflix-series-13321162",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-with-love-meghan-meghan_6845694.jpg?20250304093039",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-04 09:56:00",
        "Headline": "Meghan's new Netflix series sees her invite friends over, where they talk about her personal \"tips and tricks\". From her first jobs growing up to what she was like on the Suits set, here are some things we learnt about the duchess.",
        "Content": " The Duchess of Sussex's lifestyle series premiered this morning - in which she talks about her familiy's life in California, her time spent living in Argentina and her love of food.  With Love, Meghan - an eight-part series on Netflix - had been delayed from a January release due to the Los Angeles wildfires. The episodes, which last about 30 minutes each, feature a host of celebrity friends along with a few cameos from her husband, Prince Harry. From her first jobs growing up to what she was like on the Suits set, here are some things we learnt about the duchess.  'I'm Sussex now' One of Meghan's guests is The Office star Mindy Kaling, who she bonds with over their lives as toddlers' mums while putting together a tea party in the garden. \n                  With Love, Meghan: Questions remain about how royal couple's new life is working out - and show needs to succeed\n                 \n                  Meghan shares rare picture of Lilibet as she unveils renamed lifestyle brand As Ever\n                 \n                  Meghan's Valentine's Day message to Harry after William and Kate share romantic photo\n                 As they put sandwiches together for the tea, Meghan talks about her love of Jack In The Box - a classic US fast-food chain, to which Kaling responds: \"I don't think anyone in the world knows that Meghan Markle has eaten Jack In The Box and loves it.\" The duchess laughs and says: \"It's funny, you keep saying Meghan Markle, you know, I'm Sussex now. \"You have kids, and you go, 'now I share my name with my children'... I didn't know how meaningful it would be to me, but it just means so much to go 'this is our family name, our little family name'.\" Similarities with Archie During episode four, the duchess goes on a hike with her friend Delfina Blaquier, who is married to Argentinian polo star Nacho Figueras, and together they have a picnic with homemade focaccia bread. The duchess reveals how she passed time during her childhood - and the similar traits her son, Archie, has: \"As a kid, I was taking a bag of tea from the drawer in my house, putting it in a mason jar or probably an empty jar that once held spaghetti sauce and putting it in the sun, and sitting there... waiting for it to change colour. \"Funny enough, which Archie does now.\" Speaking to two of her friends as they prepare to cook fish, Meghan says that Archie caught two big trout while fishing on holiday last year, presenting the family with the opportunity to salt bake them together. Asked if the kids enjoyed it, Meghan says: \"They loved it. It was very sweet.\" Days before the show aired, in an interview with People magazine, the duchess said Archie had told her, \"Mama, don't work too hard\", during filming. She added the five-year-old helped with the clapperboard while visiting the set with his sister Lilibet and Harry. Life in Argentina Meghan and Argentinian photographer and businesswoman Blaquier met through their husbands. \"The moment we met, we bonded over our love of the outdoors and being in nature. We always hike together whenever she’s in town. And sometimes we let our husbands join us,\" Meghan says. Reflecting on when they first met, Meghan says: \"What's so funny is, I remember when we first met, and you were like: 'Wait a minute, you speak Argentinian Spanish?' But it’s such a pretty language because it sounds so musical.\" Her friend says: \"When you started speaking Spanish and I recognised the Argentinian, I was blown away, because I didn’t know that...\" \"That I’d lived there,\" Meghan responds. 👉 Listen to Sky News Daily on your podcast app 👈 The duchess took an internship at the US Embassy in Buenos Aires in Argentina on graduation while she studied theatre and international relations at Northwestern University in Illinois. She adds: \"When I lived in Argentina, I think the reason I loved it so much is because it reminded me of California in a lot of ways. Where you have the mountains and you have this joy of life and the joy of being outside. \"I was only there for a few months interning at the US Embassy, but I loved it.\" First jobs in doughnut and yoghurt shops - and some more childhood memories In episode five, as Meghan hosts long-time friends, former Suits co-star Abigail Spencer and Kelly McKee Zajfen, she says that her first job was at Humphrey Yogart, a frozen yoghurt shop in Los Angeles playfully named after actor Humphrey Bogart. That came after she told chef Roy Choi in episode three, as she presented him with doughnuts she prepared for him, that she once had a job at a doughnut shop. \"Doughnuts in general just remind me of my childhood,\" she said. \"I once had a job at a little donut shop called Little Orbit Donuts. They made tiny, tiny, little mini donuts.\" She said she often helped them sell at craft venues, adding that doughnuts generally were a big part of her childhood. \"Growing up, driving down Highland to get to school, there was always a Yum Yum Donuts right there.\" \"Highland and Melrose,\" Choi clarifies. \"Exactly… is it still there?\" When Choi says it is, she responds: \"Oh my god. I should go back in.\" In another episode, Kaling asks whether Meghan began cooking at home or picked it up later. Meghan replies: \"I was a latch-key kid so I grew up with a lot of fast food and also a lot of TV tray dinners. \"It feels like such a different time but that was so normal with the microwavable kids meals.\" Meghan also recalls her \"many years\" as a Girl Scout, telling Delfina Blaquier: \"I started as a Daisy, which is when you’re five or six, and I sold a lot of cookies, and my mum was my troop leader. \"To get kids out in nature, that in and of itself is worth its weight in gold. And it just breeds curiosity, and you never forget that stuff you learned.\" Life in Montecito house The lifestyle show, which was filmed in a California farmhouse rather than in her Montecito house, features her describing her every day life - including how it is a \"daily\" task to pick fruit when it's in season at her home. Episode one Hello Honey! features Meghan's friend Daniel Martin as she prepares a \"thoughtful guest basket\". It begins with her harvesting honey from bees, saying: \"The biggest thing is keeping a low tone - talk in our bee voice.\" With the help of a beekeeper, she talks about \"trying to stay in the calm of it because it's beautiful to be this connected\". Royal correspondent It felt like I was watching a series of those social media reels of things you feel you should do but never have time to, like baking, making my house look nice, creating handmade gifts, as Meghan \"With Love\" showed herself to be the most dedicated hostess. Making bath salts for her friend, decorating a cake, cooking pasta and crafting candles, in only episode one, I felt exhausted by 8.30am. But this was the Duchess of Sussex's chance to welcome us into her new life… well sort of, because they are her bee hives, but it's not her house. Watching from the other side of the Atlantic, I couldn't help but think the tone isn't for a British crowd. Read in full here Harry is the king of eggs When asked by Kaling about how best to season eggs, the duchess says: \"I have a family, a husband, who no matter what meal is put in front of him before he tastes it puts salt on, so I try to under salt.\" Harry himself, it is later revealed, is something of an egg connoisseur. Speaking to two close friends in a later episode, she says \"H\" is a \"great cook\" and makes \"the best scrambled eggs\". She further praises him by saying he generally makes \"a really good breakfast\". Bacon was the subject of discussions on more than one occasion during the series, with Meghan saying that whenever she cooks it the kitchen \"becomes full of husband and three dogs\". \"It’s not my perfume that’s bringing them all in,\" she jokes. What the duchess was like during Suits Meghan's days of playing paralegal Rachel Zane in popular drama Suits came to an end in 2018, the year she married Harry. But she has clearly remained close with co-star Abigail Spencer, who played Dana Scott. In episode five, as the pair sat in Meghan's garden alongside Kelly McKee Zajfen, Spencer reflected on what Meghan was like during the Suits days. She said Meghan was \"the head of morale on the show\", to which Meghan thanked her and added: \"I liked to plan fun for everyone.\" Heart-warming moments of Meghan with beloved beagle  The whole series ends with a tribute to Meghan's late dog, Guy, who featured prominently in several episodes. One morning, the duchess is seen making bone-shaped peanut butter biscuits for the rescue beagle, who died shortly after filming wrapped, saying you can make them with leftover bacon from breakfast. She admitted there was \"never\" any leftovers in her house because \"we eat a lot of it\" - another reference to the Sussexes love of bacon. \"I would do anything for Guy, and he knows it,\" she then says. \"He can have whatever he wants 'cause he is whatever kind of guy you need him to be depending on the day. My sweet Guy, my silly Guy, my saucy little Guy. Always my spoiled Guy.\" Later, as she hands him a peanut butter cookie, she adds: \"They provide us with unconditional love, so they get unconditional peanut butter dog biscuits. Why not?\" The Sussexes also have two other dogs - another rescue beagle named Mia and a black Labrador called Pula, who is seen trying to steal some of Meghan and her guests' food at various points during the series.  Meghan's 'next chapter' In the eighth and final episode, called Feels Like Home, Meghan prepares for Prince Harry to make an appearance. She is putting together a brunch for family and friends to celebrate the \"next chapter\" in her life. Sharing details of how she envisages the so-called \"next chapter\", Meghan, wearing a blue maxi dress and putting the finishing touches to a spread of food outdoors, says: \"Of course, my husband will be here, my mum will be here, my best friend since college, my community having a brunch in the sunshine with the people that I love, celebrating this next chapter of my life.\""
    },
    {
        "title": "With Love, Meghan: Questions remain about how royal couple's new life is working out - and show needs to succeed",
        "description": "It felt like I was watching a series of those social media reels of things you feel you should do but never have time to, like baking, making my house look nice, creating handmade gifts, as Meghan \"With Love\" showed herself to be the most dedicated hostess.",
        "url": "https://news.sky.com/story/with-love-meghan-questions-remain-about-how-royal-couples-new-life-is-working-out-and-show-needs-to-succeed-13321326",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-duchess-of-sussex-meghan_6845688.jpg?20250304093030",
        "type": "Entertainment",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-03-04 15:08:00",
        "Headline": "The overly perfect presentation of the food and flower arrangements, the saccharine, some may say cheesy, delivery is not usually our cup of tea. But that doesn't mean it won't land well.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  It felt like I was watching a series of those social media reels of things you feel you should do but never have time to, like baking, making my house look nice, creating handmade gifts, as Meghan \"With Love\" showed herself to be the most dedicated hostess. Making bath salts for her friend, decorating a cake, cooking pasta and crafting candles, in only episode one, I felt exhausted by 8.30am. But this was the Duchess of Sussex's chance to welcome us into her new life… well sort of, because they are her bee hives, but it's not her house. Watching from the other side of the Atlantic, I couldn't help but think the tone isn't for a British crowd. The overly perfect presentation of the food and flower arrangements, the saccharine, some may say cheesy, delivery not usually our cup of tea. But that doesn't mean it won't land well. Just look at the popularity of social media accounts that promote this kind of aspirational lifestyle. And never forget that love her or loathe her, people will want to watch a project that's had so much promotion. \n                  With Love, Meghan: What we learnt from Duchess of Sussex's new Netflix series\n                 \n                  Meghan shares rare picture of Lilibet as she unveils renamed lifestyle brand As Ever\n                 \n                  Meghan's Valentine's Day message to Harry after William and Kate share romantic photo\n                 During the eight 30-minute episodes, which feature a host of her friends and celebrity chefs, it was striking that Meghan couldn't seem happier or more upbeat. Show is no Oprah interview It certainly feels a world away from the other big TV events we've seen involving the couple in recent years, like that Oprah interview and the doom and gloom of the Netflix documentary about them stepping away from royal life. Careful questions from her friends about her old lifestyle blog, The Tig, or her childhood, are clearly designed to help Meghan remind us of what her old life was like and references to Harry or the children allow her to talk about family life now. 👉 Listen to Sky News Daily on your podcast app 👈 The references to the royal bit in the middle are more subtle, although you still sense the odd dig, suggestions it restricted her creativity, and Meghan again talking about needing time to heal. Read more from Sky News:Little Britain star issues apologyBBC comments on Gaza documentary Don't call her Meghan Markle But despite the negative feelings towards her royal life, don't call her Meghan Markle anymore, she appears to give a friend a gentle ticking off for that, \"you know I'm Sussex now\". Funnily enough, it's five years ago this week that they were carrying out their last official royal engagements before leaving for Canada. Still, we're left with questions about how their new life is working out and - financially - this show with Netflix is one thing that needs to succeed."
    },
    {
        "title": "Matt Lucas apologises to Millie Bobby Brown after actress hits out at 'bullying'",
        "description": "Comedian Matt Lucas has apologised to actress Millie Bobby Brown after he posted a Little Britain catchphrase alongside photographs of the 21-year-old on social media.&#160;",
        "url": "https://news.sky.com/story/matt-lucas-apologises-to-millie-bobby-brown-after-actress-hits-out-at-bullying-13321243",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-millie-bobby-brown_6845936.jpg?20250304130227",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-04 12:28:00",
        "Headline": "The comedian, 50, wrote \"no but yeah but\" - a phrase used by delinquent teenager Vicky Pollard in Little Britain - on an X post of pictures of the Stranger Things star.",
        "Content": "Comedian Matt Lucas has apologised to actress Millie Bobby Brown after he posted a Little Britain catchphrase alongside photographs of the 21-year-old on social media.  Lucas, 50, wrote \"no but yeah but\", a phrase used by delinquent teenager Vicky Pollard in the sketch comedy series he co-created, on an X post that reshared pictures of the Stranger Things star. The photos show Brown in Los Angeles wearing hoop earrings and a pink top, which Lucas said had prompted him to point out \"the similarity by posting one of her [Vicky's] catchphrases\". The apology came after an Instagram post from Brown in which she hit out at negative comments and \"bullying\" about her appearance on social media and in news articles. Lucas said: \"Dear Millie, I just saw your post and wanted to respond, and provide some context. Nearly 25 years ago I co-wrote and appeared in a sketch show called Little Britain. \"There was a character in it called Vicky Pollard, who had blonde hair and always wore a pink top, and in the photo you had blonde hair and wore a pink top so I pointed out the similarity by posting one of her catchphrases. \"I thought you looked terrific and I was mortified when the press wrote that I 'slammed' you, firstly because that's not my style, and secondly because I think you're brilliant. \"I would not have posted it if I had thought it would have upset you but I realise it has and for that I apologise.\" Little Britain, which also starred David Walliams, began as a radio show in 2000 and moved to TV in 2003, running for three series. Read more from Sky News:Dolly Parton's husband of 60 years diesWhat we learnt from Meghan's new showComedy 'super producer' dies after accident abroad In her video, Brown said: \"I want to take a moment to address something that I think is bigger than just me, something that affects every young woman who grows up under public scrutiny. \"I think this is very necessary to talk about. I started in this industry when I was 10 years old. I grew up in front of the world, and, for some reason, people can't seem to grow with me. \"Instead, they act like I'm supposed to stay frozen in time, like I should still look the way I did on Stranger Things season one. And because I don't, I'm now a target.\" She quoted headlines from articles, among them references to Lucas's comments, which she said were \"amplifying an insult rather than questioning why a grown man is mocking a young woman's appearance\". \"This isn't journalism. This is bullying. The fact that adult writers are spending their time dissecting my face, my body, my choices, is disturbing. \"The fact that some of these articles are written by women makes it even worse. We always talk about supporting and uplifting young women but, when it comes down to it, it seems a lot easier to tear them down for clicks,\" she added. \"Disillusioned people can't handle seeing a girl become a woman on her terms, not their own. I refuse to apologise for growing up. I refuse to make myself smaller to fit the unrealistic expectations of people who can't handle seeing a girl become a woman. \"I will not be shamed for how I look, how I dress, or how I present myself. We have become a society where it's so much easier to criticise than it is to pay a compliment.\" She ended her post by saying: \"Let's do better. Not just for me, but for every young girl who deserves to grow up without the fear of being torn apart for simply existing.\" Celebrities including Sex And The City's Sarah Jessica Parker, as well as singers Pixie Lott and Lily Allen, left messages of support for the young actress. Brown became a household name after starring as Eleven in the hit Netflix series Stranger Things. The fifth and final series of the show, which started in 2016, is due to air this year. The British actress also landed the title role as mystery-solving sleuth Enola Holmes in the 2020 film and its sequel two years later. Brown, who married Jake Bongiovi, the son of rock star Jon Bon Jovi, last year, has been promoting the new Russo Brothers film, The Electric State, in which she stars alongside Chris Pratt."
    },
    {
        "title": "Dolly Parton's husband of nearly 60 years dies",
        "description": "Dolly Parton's husband - who she married in a secret ceremony aged just 20 - has died.",
        "url": "https://news.sky.com/story/dolly-partons-husband-of-nearly-60-years-dies-13321063",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-dolly-parton-carl-dean_6845574.jpg?20250304051010",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-04 04:47:00",
        "Headline": "The couple met outside a Nashville laundrette where she said a tall, handsome man swept her off her feet",
        "Content": "Dolly Parton's husband - who she married in a secret ceremony aged just 20 - has died. The country music star's website said Carl Dean died on Monday in Nashville. Parton said in a statement: \"Carl and I spent many wonderful years together. Words can't do justice to the love we shared for over 60 years. Thank you for your prayers and sympathy.\" Dean was the inspiration behind Jolene, one of her biggest hits. She said she wrote the song after a flirty bank clerk seemed to take an interest in him. \"She got this terrible crush on my husband,\" Parton told NPR in 2008. \"And he just loved going to the bank because she paid him so much attention. \n                  Taylor Swift donates $5m to help feed those affected by Hurricane Milton\n                 \n                  Dolly Parton recruited by Ryan Reynolds after learning about Welsh heritage\n                 \n                  Beyonce releases tracklist for upcoming country album\n                 \"It was kinda like a running joke between us... So it's really an innocent song all around, but sounds like a dreadful one.\" The pair met outside the Wishy Washy launderette, where Parton was doing her washing, the day she moved to Nashville at age 18. \"I was surprised and delighted that while he talked to me, he looked at my face (a rare thing for me),\" Parton said in 2016. \"He seemed to be genuinely interested in finding out who I was and what I was about.\" Read more from Sky News:The Oscars moments everyone's talking aboutMorgan Freeman makes emotional tribute to Hackman Parton said her record company had asked her to wait to get married but the couple tied the knot two years later, in May 1966. Only her mother, the preacher and his wife were in attendance at the ceremony - held out of state so local papers wouldn't report it. Dean owned a paving business and famously shunned the limelight, so was very rarely seen in public with the star. \"A lot of people say there's no Carl Dean, that he's just somebody I made up to keep other people off me,\" Parton joked in a 1984 interview with AP. The couple never had any children, but he is survived by his brother and sister."
    },
    {
        "title": "Bill Dare: Spitting Image producer dies after accident abroad",
        "description": "Comedy writer Bill Dare, - who worked on shows including Spitting Image and Dead Ringers - has died after an accident overseas, his agent said.",
        "url": "https://news.sky.com/story/bill-dare-spitting-image-producer-dies-after-accident-abroad-13321173",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-bill-dare-producer_6845713.jpg?20250304133427",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-04 10:12:00",
        "Headline": "Celebrities including David Baddiel, Jon Culshaw, Tracy-Ann Oberman and Mark Steel pay tribute to comedy writer Bill Dare, who worked on Spitting Image, Dead Ringers and The Now Show.",
        "Content": "Comedy writer Bill Dare, - who worked on shows including Spitting Image and Dead Ringers - has died after an accident overseas, his agent said. Described as a \"super producer\" by his peers, Dare, 64, worked on eight series of hugely popular satire puppet show Spitting Image. Airing on ITV during the 1980s and 1990s, the show delighted in lampooning public figures including politicians, celebrities and royalty, winning BAFTAs and Emmys. It was rebooted in 2020. Dare also created Dead Ringers, a comedy impressions show broadcast on BBC Radio 4. He also produced The Now Show, a satirical take on the news which ran on Radio 4 from 1998 to 2024. Dare worked on a wide range of comedy shows during his career, including the radio production of The Mary Whitehouse Experience in the late 1980s and early 1990s. He had also written several novels. In a statement released on Monday, his agent JFL Agency confirmed he died at the weekend. A spokesperson said: \"We are shocked and greatly saddened to have to announce the death of our brilliant client Bill Dare, who died at the weekend following an accident overseas. \"Our thoughts are with his wife Lucy, daughter Rebecca, and with all of Bill's family and friends who will be devastated by his loss. \"Bill was a truly legendary producer and writer, and his comedy instincts were second to none.\" Colleagues were quick to pay tribute and reflect on his talent. Impressionist Jon Culshaw wrote on X: \"It's impossible to express the unreal sense of loss at the passing of the incredible Bill Dare. The wisest comedy alchemist and the dearest, dearest friend. Much love to Lucy and all Bill's family and friends. We shall all miss him more than we can say.\" David Baddiel posted on the social media platform: \"Just heard that the original producer of The Mary Whitehouse Experience on radio, Bill Dare, has died. Bill was an amazing creative force. I owe him much. RIP.\" Former EastEnders actress Tracy-Ann Oberman said she was \"devastated\" and that her \"entire comedy career was down to Bill\". She wrote: \"When I was on the BBC Radio 4 rep company early on in career - I ran into Bill in the corridors - He asked if I was good at accents. I said yes. \"He cast me in a sketch show. I had to do about 15 different accents. We recorded in front of a live audience at Broadcasting House - afterwards Bill said 'Why have I never met you - you're going to have a big career'. \"He was incredibly loyal and supportive and really opened a path for me into the R4 comedy world and then TV having come out of the RSC and theatre it was all new. I will always be grateful. Fly high Bill.\" Comedian and writer Mark Steel wrote: \"This is so grim. Bill was a compassionate hearty soul with the ability to be beautifully grumpy, a marvellously thoughtful comic mind. \"He'd argue but always listen and you'd always laugh, he made a million shows and wanted them all to matter and would have made a million more.\" Have I Got News for You writer Pete Sinclair said: \"I am utterly devastated by Bill's death. I still can't believe it. He was a comedy genius. A hugely talented writer as well as a brilliant producer. A close friend and co-writer. I cannot begin to say how much I'll miss him.\" Read more from Sky News:Dolly Parton's husband of nearly 60 years diesWith Love, Meghan: What we learnt from new Netflix seriesThe Crown actor 'told to attend police interview' Julia McKenzie, comedy commissioner for Radio 4, said: \"I am so terribly sorry to hear this tragic news and my thoughts are with Bill's wife, family and friends. \"Bill has been a huge part of Radio 4 comedy for decades, as a writer and producer, and listeners will have heard his legendary name at the end of many of their favourite shows. \"Bill was a comedy obsessive, and very instinctive about making the funniest choices when it came to writing, directing and editing. \"He cared so much about his work that in the production booth during Dead Ringers you'd see him crouched over the script, utterly focused on the show. \"He was funny and very dry in person, amusingly cynical when he needed to be and always pushed to keep the comedy he made, and particularly satire, spiky. \"I've known and worked with him for 18 years and like many I can't believe he has gone, he will leave a big hole in the comedy world and in our hearts.\""
    },
    {
        "title": "The Crown actor Khalid Abdalla 'told to attend police interview' over pro-Palestinian protest",
        "description": "The Crown actor Khalid Abdalla says he has been told to attend a police interview in relation to a pro-Palestinian protest in January.",
        "url": "https://news.sky.com/story/the-crown-actor-khalid-abdalla-told-to-attend-police-interview-over-pro-palestinian-protest-13321103",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-khalid-abdalla_6845640.jpg?20250304080628",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-04 07:40:00",
        "Headline": "The 44-year-old actor said the \"right to protest\" is under attack in the UK after he received a letter \"summoning\" him to an interview.",
        "Content": "The Crown actor Khalid Abdalla says he has been told to attend a police interview in relation to a pro-Palestinian protest in January. Abdalla, who played Dodi Fayed in the popular Netflix series, wrote in an Instagram post that he had received a letter from the Metropolitan Police on Thursday. The 44-year-old said that others, \"including Stephen Kapos, an 87-year-old Holocaust survivor\", had also received letters \"summoning\" them to interviews. Abdalla said it relates to the Palestine Solidarity Campaign protest which took place on Whitehall on 18 January. The actor, who also appeared in the 2024 thriller The Day Of The Jackal, added that it \"remains to be seen\" if he and the others will be charged.  He also says that the \"right to protest\" is under attack in the UK and it \"requires us all to defend it\". \"I will not be making further comment on the 18th January protest for legal reasons\", he wrote. A Metropolitan Police spokesperson said: \"As part of our ongoing investigation into alleged breaches of Public Order Act conditions on Saturday, January 18, we have invited a further eight people to be interviewed under caution at a police station. \"While we are aware of names being attributed to those who have been invited for interview, we do not confirm the identity of anyone under investigation.\" Abdalla, who was born in the UK to Egyptian parents, has attended several pro-Palestinian demonstrations and shared posts on social media calling for Western nations to \"stop arming Israel\". Read more from Sky News:Trump pauses US military aid to UkraineHow mobile games profit from misogynistic tropesInside Bangladesh's 'death squad' jails The day after the 18 January protest, former Labour leader Jeremy Corbyn was interviewed under caution by police, Sky News understands. Mr Corbyn, who wrote on social media that he attended to give a speech and lay flowers for children killed in Gaza, voluntarily went to a police station in the capital. The Met Police said on the day of the demonstration that the \"static\" protest would be contained on Whitehall after organisers had initially planned to march past the BBC and near a synagogue. However, the force later accused demonstrators of forcing their way through police lines and entering Trafalgar Square. Mr Corbyn disputed the police's version of events and said police had allowed protesters through the line. The demonstration came as Israel and Hamas agreed to a ceasefire and hostage release deal following the 15-month-long war in Gaza."
    },
    {
        "title": "Scientists trying to bring back the woolly mammoth create a woolly mouse",
        "description": "Scientists trying to bring back the woolly mammoth have created a woolly mouse.",
        "url": "https://news.sky.com/story/scientists-trying-to-bring-back-the-woolly-mammoth-create-a-woolly-mouse-13321512",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-genetically-mice-colossal-biosciences_6845949.jpg?20250304131850",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-03-04 20:50:00",
        "Headline": "Biotech company Colossal Biosciences unveiled plans in 2021 to revive the woolly mammoth - and later the dodo bird.",
        "Content": "Scientists trying to bring back the woolly mammoth have created a woolly mouse. Colossal Biosciences unveiled plans in 2021 to revive the woolly mammoth - and later the dodo bird - attracting investors, headlines and critics alike. The Texas-based biotech company has since focused on identifying the key traits of extinct animals with the goal of genetically engineering them into living animals, according to chief executive Ben Lamm. Read more: Why 'de-extincting' the mammoth won't be like Jurassic Park Alongside bringing back species that went extinct, the company hopes their work can be used to help with conservation efforts. But other scientists have mixed views of their work and whether it will be helpful. On Tuesday, Colossal Biosciences said its researchers had edited seven genes in mice embryos to create a mouse with long, thick, woolly hair. They nicknamed the extra-furry rodent a \"colossal woolly mouse.\" The company now plans to genetically modify Asian elephants to give them woolly mammoth traits - but critics have argued that this is different from actually bringing a species back from extinction. \"You're not actually resurrecting anything - you're not bringing back the ancient past,\" said Christopher Preston, a wildlife and environment expert at the University of Montana, who was not involved in the research. He added: \"You might be able to alter the hair pattern of an Asian elephant or adapt it to the cold, but it's not bringing back a woolly mammoth. It's changing an Asian elephant.\" The results have not yet been published in a journal or vetted by independent scientists. The feat \"is technologically pretty cool,\" said Vincent Lynch, a biologist at the University of Buffalo, who was not involved in the research. Alongside the mouse being given different hair, in a press release, Colossal Biosciences said the rodent had also gained the woolly mammoth's accelerated fat metabolism. Both were said to be likely related to cold tolerance. These genetic variations were already present in some living mice, the company's chief scientist Beth Shapiro said, adding: \"We put them all together in a single mouse.\" Read more from Sky News:Smoke bombs thrown in Serbia's parliament'Stalker' threatens to kill during live streamInside Bangladesh's 'death squad' jails The company said it focused first on mice to confirm the process worked before potentially moving onto the embryos of Asian elephants - the closest living relative of woolly mammoths. However, as Asian elephants are an endangered species, there will be a lot of red tape before any plans can move forward, Mr Lamm admitted."
    }
]