[
    {
        "title": "Gunfire and explosions followed by unsettling silence: Sky News reports from inside Gaza City",
        "description": "There is a loud boom, the noise of an explosion, followed by the rat-a-tat of automatic gunfire. ",
        "url": "https://news.sky.com/story/gunfire-and-explosions-followed-by-unsettling-silence-sky-news-reports-from-inside-gaza-city-13444271",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-parsons-gaza-city-apc_7041395.jpg?20251004151804",
        "type": "Home",
        "Author": "Adam Parsons",
        "Date Published": "2025-10-04 16:30:00",
        "Headline": "In spite of a tentative acceptance by Hamas of parts of President Trump's peace deal, in Gaza City, says Adam Parsons, the concept of peace feels almost unthinkable. ",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  There is a loud boom, the noise of an explosion, followed by the rat-a-tat of automatic gunfire.  Another explosion, more distant. A sign on the wall warns people against snipers. And all around us is the rubble of destruction. Welcome to Tel al-Hawa, once one of the most affluent suburbs of Gaza City. Now wrecked, uninhabitable and destroyed. Like so much of Gaza - and like all the places we drove through to get here - it is a wasteland. Buildings reduced to rubble, with a layer of dust covering everything. The only people you see are Israeli soldiers. Throughout my day in Gaza, I didn't see a single Gazan. Partly that's because we were there with the Israeli military, who controlled all our movements. \n                  Trump says Gaza ceasefire will begin 'immediately' when Hamas confirms deal\n                 \n                  Nearly 500 arrested in London as pro-Palestine protest goes ahead despite pleas\n                 \n                  Why Trump accepted the Hamas peace plan response\n                 They also censored our broadcast material, all of which had to be submitted to a military officer to be scrutinised. In our case, this simply meant demands to blur soldiers' faces, obscure some technology and conceal sensitive information, but it is a form of control over journalists. Partly it's because places like this have been so completely wrecked that everyone has fled. I came here on Friday afternoon, along with journalists from a variety of media outlets from around the world. There was no sign that, a few hours later, Hamas would offer a response to the Trump peace plan, nor that there would be a surge of global optimism. Because here, amid the dust and debris, everything is bleak and threatening. Everywhere you look there is devastation. The filaments of war are everywhere. Gaza latest: World leaders welcome Hamas response to US peace deal The soundscape is military. There are the roars of explosions, bursts of gunfire, the buzz of drones, the clatter of troops crunching through rubble and the roar of the engines that power tanks and armoured personnel carriers (APCs). But every now and then there is silence. No birdsong, no gentle chatter. Nothing. It is unsettling. The proof that people ever lived here is strewn around, as if a plane has crashed. There are scraps of everyday life - a milk carton, a phone cable, a shoe. A red toy car. And curiously, amid all this horror, there is a bouquet of red roses. They are artificial, of course, but they lie in the street, dusty and forgotten. What were they for? A party, a wedding? Or just to brighten up a home that has now been blown away. Booby traps, snipers on roofs We spoke to Israeli military officials, who told us they had only recently taken control of this area. The picture they paint of Hamas fighters is that of a depleted fighting force, reduced to maybe 2,000 people, including young and inexperienced conscripts. Their tactics are those of a guerrilla force - snipers on roofs, booby traps, improvised explosive devices. \"But it can work. We had a soldier killed very near here a couple of weeks ago. And Hamas - they are brave,\" he says. \"It is hard for us to have fought for two years, but it is harder for Hamas than us. We are strong enough to finish this war, bring the hostages back, eliminate Hamas and ensure 7 October can never happen again.\" Read more:Guns, cash and American aid: Israel's support for Gaza militia revealedWhy Trump accepted the Hamas peace plan response The military has occupied a building that was once either a large house or perhaps a series of apartments. Some of the rooms are simply forgotten, others are used by the IDF for offices, meals or meetings. At the top of the building is a room with a large picture window. It looks out towards the Jordanian Hospital - the only building here, and I think the only building I saw throughout my visit that is unscathed. The soldiers show us drone footage from inside the hospital campus, revealing a tunnel opening. Twenty metres below the ground, they say, was a Hamas workshop for designing and building missiles and rockets. \"It's very significant,\" one of the soldiers tells me, his face obscured by a balaclava. \"The weapons manufactured here are being fired at our civilians. To find it here, under the compound with the hospital, shows how Hamas is using civilians to hide behind. \"We cannot attack that,\" - he points at the hospital - \"we don't want to hurt the people there. It's very significant to us as Israelis and also to the citizens of Gaza, who are being used by Hamas.\" An IDF official told me the hospital had also been used to \"accommodate\" between 50 and 80 Hamas fighters, and said Jordanian Hospital officials \"definitely knew\" about these people. We later put these allegations to a Jordanian official source, who described the hospital's work as \"purely a humanitarian mission\" that \"has been providing treatment for tens of thousands of Gazans since 2009\". \"Jordan has no knowledge of the presence of tunnels under the location of the Tel al-Hawa hospital. Gaza is riddled with tunnels. \"There was no access into the hospital from any underground tunnels. Over its 16 years of operation, no fighters were present within the hospital's premises.\" There are many stories of Israeli reserve soldiers saying they are both weary and wary, reluctant to sign up for another tour of duty. Looking out over the hellish landscape of this shattered town, I could understand why some would think twice before rushing back. Yet Richard Hecht did. Formerly the spokesperson for the IDF, Hecht, whose family moved from Glasgow to Israel when he was a boy, had been called at 11pm the previous evening and asked to accompany us. We talked, with dust billowing around us at a military compound on the outskirts of Gaza City. \"I hope this war comes to an end, and it would stop in a matter of moments if Hamas returned our hostages,\" he told me. \"But the IDF is very determined - we want our hostages back. We are doing everything we can because we have to fight Hamas. What alternative do we have? We need to obliterate this group.\" I suggest to him Israel's military action now looks wildly disproportionate, especially bearing in mind they believe Hamas to now have only a couple of thousand fighters. More than 65,000 people have been killed in Gaza, half of them women and children. And many, including a UN commission, have claimed this is genocide. Hecht bristles. \"That is an atrocious thing to say. Genocide has intent, it entails intent. It is an atrocious accusation and I cannot connect it. We are fighting Hamas. We are not fighting Palestinians.\" We have to leave. This town is regarded as an active conflict zone, and the regular chorus of gunfire and explosions testifies to that. We clamber back into the APC, crewed by two men in their early 20s. One drives, the other stands up, using a hatch to access a machine gun based on the roof. He beckons me up to see the view. Around us, a line of military vehicles. A digger comes into view, and then a plume of dust flies up as the APC reverses. I look down and see hundreds of spent casings around the machine gun. I point at them, and he nods slowly. We drive away. The dust envelopes the vehicles again, and we leave Gaza City behind us. As we head back towards the border, to the gates that divide a war zone from Israeli towns and kibbutzim, we see a huge plume of smoke rising a mile or two away. In Gaza, the concept of peace feels almost unthinkable."
    },
    {
        "title": "Trump says Gaza ceasefire will begin 'immediately' when Hamas confirms deal",
        "description": "Donald Trump has said a ceasefire in Gaza will begin \"immediately\" after Hamas agrees to a new US plan to end the war.",
        "url": "https://news.sky.com/story/trump-says-gaza-ceasefire-will-begin-immediately-when-hamas-confirms-deal-13444804",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-us-president_7042203.jpg?20251004220833",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-04 19:18:00",
        "Headline": "The US president has said Israel has \"agreed to the initial withdrawal line\" and \"when Hamas confirms\", the ceasefire will start, Israeli hostages will be released and a prisoner exchange will begin.",
        "Content": " Donald Trump has said a ceasefire in Gaza will begin \"immediately\" after Hamas agrees to a new US plan to end the war. The US president said Israel had \"agreed to the initial withdrawal line\" and \"when Hamas confirms\", the ceasefire will start, Israeli hostages will be released and a prisoner exchange will begin. In a post on his Truth Social platform, Mr Trump said it would \"create the conditions for the next phase of withdrawal, which will bring us close to the end of this 3,000-year catastrophe\". It came as Hamas accused the Israeli government of lying about reducing its military operations, accusing it of continuing to \"commit its horrific crimes and massacres\" against Palestinians in Gaza, claiming 70 people had been killed by strikes since Saturday morning. The group said it \"exposes the false claims of the war criminal Netanyahu's government regarding scaling back military operations against defenceless civilians\". It comes after Israeli Prime Minister Benjamin Netanyahu has said he hopes to announce the release of all hostages from Gaza \"in the coming days\".  Mr Netanyahu made the remarks as indirect talks with Hamas continue in Egypt on a new US plan to end the war. Speaking after Hamas said it had accepted some elements of the plan, Mr Netanyahu said he had sent the delegation to Egypt \"to finalise technical details\", adding that \"our goal is to contain these negotiations to a timeframe of a few days\". Donald Trump has welcomed Hamas's statement, but on Saturday warned the group \"must move quickly, or else all bets will be off\". Read more:Why Trump accepted the Hamas peace plan responseSky News investigation reveals Israel's support for Gaza militia  Trump orders Israel to stop bombing Gaza Earlier in the day, Israel's army said the country's leaders had instructed it to prepare for the first phase of the US plan to end the war in Gaza. Israel has moved to a defensive-only position in Gaza and will not actively strike, one official said, adding that no forces have been removed from the territory. It came hours after Mr Trump ordered Israel to stop bombing Gaza after Hamas said it accepted some elements of his plan.  What's in the peace plan? Mr Trump's proposed plan to end the war has widespread international support and on Friday, Mr Netanyahu's office said Israel was committed to bringing the conflict to an end. Under the plan, Hamas would release the remaining 48 hostages, of which around 20 are believed to still be alive, within three days. It would also give up power in Gaza and disarm. In return, Israel would end its offensive and withdraw from much of Gaza, as well as release hundreds of Palestinian prisoners and allow an influx of humanitarian aid and eventual reconstruction. Hamas has said it is willing to release the hostages and hand over power to other Palestinians, but argued other aspects of the plan require further consultations among Palestinians. Its statement did not address the issue of Hamas demilitarising, which is a key part of the deal. Warning 'extremists on both sides' could sabotage peace plan A group representing some families of hostages said the prospect of seeing their loved ones return \"has never been closer\" and they appealed to Mr Trump to keep pushing \"with full force\". They warned \"extremists on both sides\" would try to sabotage the plan. The war began when Hamas attacked Israel on 7 October 2023, killing 1,200 people and taking 251 hostage. Since then, at least 67,000 Palestinians have been killed in Israel's war with Hamas in Gaza, according to the enclave's Hamas-run health ministry, which does not differentiate between civilians and combatants in its count, but says women and children make up around half of the dead."
    },
    {
        "title": "'I don't want to bury them': A month on from one of the worst earthquakes Afghanistan has seen",
        "description": "It is a breathtaking and, at points, pretty perilous journey through the remote mountainous region of eastern Afghanistan.",
        "url": "https://news.sky.com/story/i-dont-want-to-bury-them-a-month-on-from-one-of-the-worst-earthquakes-afghanistan-has-seen-13443561",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-afghanistan-wadir-earthquake_7040300.jpg?20251003160255",
        "type": "Home",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-10-04 23:01:00",
        "Headline": "The earthquake killed some 2,000 people and was one of the worst Afghanistan has seen, and it came at an already desperate time for Afghans. A month on, Sky News has seen the aftermath.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  It is a breathtaking and, at points, pretty perilous journey through the remote mountainous region of eastern Afghanistan. We're trying to reach the Mazar Dara valley, where an earthquake wiped out whole villages. The force of the quake ripped apart roads, cut off communities and buried multiple generations. It's slow going - navigating around sheer drops on a road scattered with rocks and boulders. But after three hours, we start to see the first signs of the disaster that, within minutes, plunged this region into darkness. We are driving into Wadir, a village in Nurgal District, where everyone we meet has lost someone. The earthquake, which struck around midnight, killed many in their sleep here, especially women and children. Standing by a makeshift graveyard peppered with white flags and gravestones, we meet little Rahmanullah. He's eight but looks much younger, and his glassy eyes look heavy with grief. His fragile, tiny hands point to the grave where his six-year-old brother Abouzar is buried. He was sleeping alongside him. The only reason Rahmanullah survived was because his older sibling, Saied Rahman, was able to pull him out. \n                  Taliban internet blackout has created an extreme scenario in Afghanistan with far-reaching consequences\n                 \n                  Internet blackout across Afghanistan in Taliban crackdown\n                 \n                  Afghanistan internet ban 'extinguishing the only light that still reaches us'\n                 \"I was asleep when I heard a crash,\" Rahmanullah tells me. \"My brother said 'it's an earthquake, get up, or the building will fall on you'. \"He took my hand and pulled me out, put me on some wood, and said, 'get out quick'.\" Rahmanullah takes us up a steep hill to show us what remains of his home. On the edge of a vast drop, it is now a mound of rubble - only a broken bed and shoes left behind. The earthquake killed some 2,000 people and was one of the worst Afghanistan has seen. And it came at an already desperate time for Afghans - with an economic crisis, rising unemployment, drought and malnutrition. In Afghanistan, there has been a seemingly endless cycle of hunger and displacement. Compounding those problems since the Taliban took control in 2021, aid has dropped off a cliff. This year, the US cut almost all of its funding to the country, and it's had a massive impact. The demise of the US Agency for International Development this year has forced the closure of 400 health facilities and left hundreds of thousands of Afghans without consistent access to food. Nearly everyone we spoke to in this region praised the speed and effectiveness of the Taliban response - the government sending in helicopters to evacuate the injured and the dead. White tents have sprouted up next to each affected village too - a sign international aid was able to get to these far-flung communities against the odds. But winter is coming, and sickness is starting to spread. In Andarlackhak, we meet Ajeebah. She's keen to speak to us in private, in the tent she now calls home. She married at 10 years old and went on to have 10 children. But five of them died in the quake - three-year-old Shabhana, seven-year-old Wali Khan, nine-year-old twins Razimah and Nasreen, and 13-year-old Saleha. Their mother is clearly still processing the immense, almost unimaginable loss. \"I don't want to bury them. What could I do?\" she says. \"I can't keep them outside. But I don't want to put them in a graveyard.\" Outside, dozens of children are playing, many orphaned by the disaster. Read more from Cordelia Lynch:The red pill explosion fuelling a secret detox ritualWhy many in Vietnam now have a positive view of Americans Malnutrition is a major issue in Afghanistan and keeping these children fed will be an overwhelming burden in the months ahead. With women unable to work under the Taliban and a struggling economy, families were already in dire straits. Mohammad Salem, who's 45, has injured his foot. And he's deeply worried about the months ahead. \"We don't have anything for winter,\" he said. \"The snow is coming, and our children are living in tents. \"They're lying in the dirt. We don't have any shelter for the future. Everything we had is destroyed.\" The Taliban forbids physical contact between men and women who are not family members, even in emergencies. That raised fears some women would be left without help. However, the villagers we spoke to praised the rescue efforts and said female aid workers were able to reach them. But what hangs over every community in these deep and now scarred valleys is the fear of the hardships to come and the realisation that their communities, their families, have been changed forever."
    },
    {
        "title": " Prince William 'cares deeply about tradition' but Earthshot Prize shows he's not afraid to modernise",
        "description": "A close adviser to Prince William has told Sky News William \"does care deeply about tradition\" but his Earthshot Prize shows he's not afraid to modernise to make sure his work \"makes sense\" for the generation he will serve.",
        "url": "https://news.sky.com/story/prince-william-cares-deeply-about-tradition-but-earthshot-prize-shows-hes-not-afraid-to-modernise-13444363",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-william-wales_7041639.jpg?20251004164448",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-10-04 14:48:00",
        "Headline": "After a TV interview hinted the Prince of Wales wanted to make 'change' when he becomes king, a trusted adviser tells Sky News how he believes that will manifest.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  A close adviser to Prince William has told Sky News William \"does care deeply about tradition\" but his Earthshot Prize shows he's not afraid to modernise to make sure his work \"makes sense\" for the generation he will serve. Marking a month to go until the fifth Earthshot Prize awards takes place in Rio de Janeiro in Brazil, Jason Knauf, the new chief executive, says it shows \"the sort of leader that Prince William wants to be, both now and in the future\" but also the huge impact his influence can have on issues like the climate crisis. Mr Knauf has become a close confidante of the Prince, having worked with him for ten years, and being there right at the beginning of the Earthshot journey, \"when this thing was percolating, and he really pushed us to make it something special\". But after discussions this week about the \"change\" William wants to make when he's monarch, Mr Knauf told us the Prince doesn't want to just shake things up for the sake of it. \"He does care deeply about tradition, about his family's legacy of service, and I think Earthshot is a really good example of how you're going to see that maintained in the future, but done in a way that makes sense for the time\", he said, adding: \"That's what his grandmother did. \"That's what his father's been doing. Updating the tradition for the generation that they serve\". Explaining how in the early days they looked closely at other examples of past royal prizes or initiatives, such as the Duke of Edinburgh Award, for inspiration, Mr Knauf said: \"You know, we didn't just create this thing in a vacuum. It was about what kind of difference could his leadership make? \n                  Prince William has 'the best day of my life' spraying pond water at journalists\n                 \n                  Prince William calls for better support for wildlife conservationists on South Africa visit\n                 \n                  Prince William lands in South Africa for 'milestone' Earthshot awards after weekend of royal criticism\n                 \"And one of the things about the royal family for generations, has been recognising the work of others. \"You know, whether that's through the honours system, recognising people in arts and community service or whatever it might be, all this is doing is taking something that's really traditional and putting a modern twist on it\". Last week, a TV programme was released in which Prince William admitted, during an interview with Hollywood star Eugene Levy, that \"change is on my agenda\" when he becomes King.  This weekend, the finalists for the fifth Earthshot awards are announced, with four weeks to go until the ceremony takes place in Rio. The prize recognises innovators coming up with solutions to the world's most pressing environmental problems. Among this year's finalists in the running for the five £1m prizes are Matter, a British company whose simple washing machine filters remove the greatest cause of microplastics in our ocean; the world's first fully 'upcycled skyscraper' in Australia, a Chinese company working on mobile phone waste, and the country of Barbados for its environmental focus. Read more from Sky News:Radioactive issues could still derail momentum for Gaza peaceDetails emerge of synagogue attacker's life For the first time, the awards will take place in the same country, in the same week as the UN climate change conference COP30. Addressing whether the positive message of Earthshot will be overshadowed by the inevitable split opinions on tackling the climate crisis that will come out of the conference in Belem, Mr Knauf said: \"The news around political disagreement and all of that stuff will be out there, but that's one of the reasons we created the prize, directly to challenge that pessimism and negativity, to say we need to get on with this work. \"Showing world leaders that big things are happening in their regions and in their countries and in their backyards should remind them that, actually, this isn't something that's theoretical. \"The actual solutions that we need really, really do exist\". Prince William will travel to Brazil on 3 November for engagements in Rio, highlighting environmental issues, as well as attending the awards on 5 November at the iconic Museum of Tomorrow. In a video posted on his social media, the Prince explains how he continues to do this for his children, saying: \"The Earthshot Prize was founded because this decade matters. \"2030 is a threshold by which future generations will judge us; it is the point at which our actions, or lack of them, will have shaped forever the trajectory of our planet.\""
    },
    {
        "title": "Police given extra time to question four arrested over Manchester synagogue terror attack",
        "description": "Police have been granted extra time to question four people who were arrested in connection with the terrorist attack on a synagogue in Manchester.",
        "url": "https://news.sky.com/story/police-given-extra-time-to-question-four-arrested-over-manchester-synagogue-terror-attack-13444878",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-synagogue-manchester_7042231.jpg?20251005020104",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-04 23:55:00",
        "Headline": "Three men remain in hospital after the car and knife attack at the Heaton Park Hebrew Congregation Synagogue on Thursday.",
        "Content": "Police have been granted extra time to question four people who were arrested in connection with the terrorist attack on a synagogue in Manchester. Three men remain in hospital after the car and knife attack at the Heaton Park Hebrew Congregation Synagogue on Thursday. Jihad al Shamie, 35, who was on bail for an alleged rape, was shot by police as he launched the attack on Yom Kippur, the holiest day in the Jewish calendar. Adrian Daulby, 53, is believed to have been shot dead by police while trying to stop al Shamie from entering the synagogue. He died alongside Melvin Cravitz, 66, a worshipper who helped prevent the attacker from entering the place of worship. Counter Terrorism Policing North West (CTPNW) is leading the police operation and has been granted warrants allowing them to detain four people who were arrested on suspicion of preparing terrorist acts for a further five days. The warrants relate to two men, aged 30 and 32, and two women, aged 46 and 61. Greater Manchester Police (GMP) said the investigation was \"continuing at pace\" with \"significant resources\" mobilised in order to \"establish the full picture into what has happened\". The force said three men remain in hospital with serious injuries, including a security guard with car-impact injuries and a Community Security Trust (CST) worker with stab wounds. On Friday, the police watchdog, which is investigating the incident, said it was examining the use of lethal force by GMP firearms officers, including \"whether police may have caused or contributed to the death\" of Mr Daulby. Read more:Tributes to 'kind and heroic' victims of Manchester attackWhat we know about Manchester attacker  Nearly 500 arrested as pro-Palestine protest goes ahead despite pleas It comes as 492 people were arrested over protests supporting the proscribed group Palestine Action in Trafalgar Square on Saturday. The demonstration went ahead despite Sir Keir Starmer, other politicians and police bosses calling on organisers to reconsider. The Board of Deputies of British Jews called for those who attended the demonstration arrested under the Terrorism Act to also be investigated for stirring up racial hatred. The board is set to hold an event in the same location on Sunday afternoon to reflect on the two-year anniversary of the 7 October Hamas attack.  On Friday, the head of counter-terrorism policing, Laurence Taylor, said a \"suspicious device\" attached to al Shamie's torso was fake and police believed he \"may have been influenced by extreme Islamist ideology\". He added: \"Based on some fast-time assessments conducted on our systems, this individual does not appear to be known to counter-terrorism policing, however, he does have a non-CT (counter-terror) related criminal history. \"This includes a recent arrest for rape, which resulted in him being bailed.\""
    },
    {
        "title": "Conservative Party pledges £1.6bn ICE-style 'removals force' to detain and deport illegal migrants",
        "description": "The Conservatives are pledging to create a new \"removals force\" to detain and remove 150,000 a year as part of a broad plan to tackle illegal immigration to the UK.",
        "url": "https://news.sky.com/story/conservative-party-pledges-16316bn-ice-style-removals-force-to-detain-and-deport-illegal-migrants-13444647",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ice-hearings-federal-agents-involed-in_7042232.jpg?20251005020837",
        "type": "Home",
        "Author": "Ben Bloch at Conservative Party conference in Manchester",
        "Date Published": "2025-10-04 17:15:00",
        "Headline": "The pledge is part of the Conservative Party's broad new plans to stop illegal migration to the UK, set to be unveiled by Kemi Badenoch on the first day of their annual conference on Sunday.",
        "Content": "By Ben Bloch at Conservative Party conference in Manchester   The Conservatives are pledging to create a new \"removals force\" to detain and remove 150,000 a year as part of a broad plan to tackle illegal immigration to the UK. Modelled on the \"successful approach\" of the US Immigration and Customs Enforcement (ICE) agency, this new force would be given \"sweeping new powers\", and over £1bn in new funding. The pledge is part of the Conservative Party's broad new plans to stop illegal migration to the UK, set to be unveiled by Kemi Badenoch on the first day of their annual conference on Sunday, where reducing immigration and creating \"Strong Borders\" will be one of the key themes. The new \"removals force\" that she will unveil will replace the existing Home Office Immigration Enforcement (IE) and will be given broad new powers, including being able to use facial recognition without warning in order to spot illegal immigrants.  👉Listen to Politics at Sam and Anne's on your podcast app👈 It will be given funding of £1.6bn a year, up from the existing £820m a year, to increase the number of removals annually from 34,000 to 150,000 - which would represent \"at least 750,000 removals\" across a five-year parliament. The Tories say this increase in funding would come from the closure of asylum hotels and \"tackling the wider costs of our out-of-control asylum system\". \n                  A subdued Tory conference could be a chance for Badenoch to turn her fortunes around - but will she?\n                 \n                  Data leaked to Sky News shows Tory conference might be set for smaller crowd this year\n                 \n                  ECHR move shows Tories are under pressure like never before\n                 However, ICE in the US has been heavily criticised by politicians and the public in recent months, with the agency accused of arresting both legal migrants and US citizens and targeting people based on their race. Expanding the use of live facial recognition technology is also likely to attract criticism from within the Tory Party itself, on the grounds of it being a threat to individual freedom and privacy.  Tories to withdraw from multiple conventions In addition to confirming plans to leave the European Convention on Human Rights (ECHR), announced on Saturday, Ms Badenoch will also vow to fully repeal the Human Rights Act, and leave the Council of Europe Convention on Action Against Trafficking in Human Beings. This, the Tories say, would \"end the legal blocks that allow illegal immigrants, and in some cases foreign criminals, to stay in the UK based on flimsy claims\".  A radical overhaul of the asylum system would see refugee status granted only to those threatened by a foreign government, and those fleeing conflict or \"less tolerant\" laws on religion or sexuality would not be eligible, with the party saying \"few people will qualify\". The plan will also see the immigration tribunal abolished, with all decisions on migration taken by the Home Office with only limited rights of appeal in cases where officials have acted without statutory authority. Immigration cases will be denied legal aid, with the Tories accusing solicitors of having \"defrauded\" the UK by \"coaching\" applicants and arguing there is \"no need for lawyers\" as people \"should simply tell the truth about their circumstances\".  'Labour is fixing the Tories' mess' The plans come as Ms Badenoch faces continued pressure on her right flank from Reform UK, which has already pledged to leave the ECHR and deport up to 600,000 people over five years if it comes to power. But the party leader said the plans put forward by Nigel Farage's party are \"nothing but announcements that fall apart on arrivals\". She also said the Labour government offers \"failed gimmicks\", adding: \"Our Stronger Borders plan is serious and credible and backed by a comprehensive legal analysis. That is the difference the next Conservative government will deliver.\" A Labour Party spokesperson said: \"The Conservatives' message on immigration is: we got everything wrong, we won't apologise, now trust us. \"It won't wash - Kemi Badenoch's party enabled record high net migration as removals plummeted, opened over 400 asylum hotels and wasted £700 million of taxpayers' money to send just four volunteers to Rwanda. \"This Labour government is fixing the Tories' mess by smashing the people-smuggling gangs running the vile small boats trade, closing asylum hotels, deporting foreign criminals and signing international returns deals to bring order to Britain's borders.\" Hear more about the plans from shadow home secretary Chris Philp, live at the Conservative Party Conference in Manchester on Sunday Morning With Trevor Phillips from 8.30am."
    },
    {
        "title": "A subdued Tory conference could be a chance for Badenoch to turn her fortunes around - but will she?",
        "description": "Conservative Party conferences of old were packed out events bustling with ministers, MPs, lobbyists and members.",
        "url": "https://news.sky.com/story/a-subdued-tory-conference-could-be-a-chance-for-badenoch-to-turn-her-fortunes-around-but-will-she-13442956",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kemi-badenoch-immigration_7041947.jpg?20251004184928",
        "type": "Home",
        "Author": "Alix Culbertson",
        "Date Published": "2025-10-04 23:01:00",
        "Headline": "It is the first Conservative autumn conference with Kemi Badenoch as leader.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Conservative Party conferences of old were packed out events bustling with ministers, MPs, lobbyists and members. Roll on just over a year after their biggest defeat ever, and the Tories' gathering in Manchester, from 5-8 October, will be a more sober affair. Despite their recent loss, last year's conference was anything but subdued as it was turned into a hustings for their new leader to replace Rishi Sunak. Cue: a bit of a bun fight. A month later, Kemi Badenoch was crowned leader. So this conference not only marks a year after that abysmal result but also nearly a year of Ms Badenoch in charge. A series of policy announcements are expected throughout the conference, with the first today being an eye-catching vow to create an ICE-style \"removals force\" to tackle illegal immigration to the UK, which follows her pledge to leave the European Convention on Human Rights (ECHR). \"Stronger borders\" is one of the two key themes of this conference, along with \"stronger economy\" - slogans set to feature on banners throughout the conference venue. It is part of her bid to scrape back her party's position in the polls as Nigel Farage's continues to lead in the national polls. \n                  Data leaked to Sky News shows Tory conference might be set for smaller crowd this year\n                 \n                  Conservative Party pledges £1.6bn ICE-style 'removals force' to detain and deport illegal migrants\n                 \n                  ECHR move shows Tories are under pressure like never before\n                 Just three weeks before this year's gathering, one of her ministers, Danny Kruger, became the first serving Tory MP to defect to Reform. Eleven former Conservative cabinet members, ministers and MPs had switched to Reform this year ahead of Mr Kruger. Ex-health minister Maria Caulfield defected after Mr Kruger. Sub-optimal for Badenoch, but an issue she has brushed off, accusing them of \"running away rather than solving problems\". The threat of Reform, which has led the polls for weeks, dominated the Lib Dem and Labour conferences but, if PMQs is anything to go by, there is no guarantee Ms Badenoch will put Mr Farage's party at the forefront of her two conference speeches. Rather than just the traditional leader's speech at the end of the conference, Ms Badenoch will deliver an additional one today, in which she will set out the party's broad new plan to tackle illegal migration. Some 34,401 people have crossed the Channel in small boats so far this year, according to PA news agency analysis of Home Office figures, putting 2025 on course to break the record for most arrivals in a single year. The traditional end-of-conference speech will still take place on Wednesday, as she seeks to grab headlines and cut through the electorate in a way she has failed to do so far. Also overshadowing the party as they head to Manchester is the High Court ruling that a PPE company linked to Tory peer Baroness Michelle Mone must repay the government £122m for breaching a contract for medical gowns during COVID. Ms Badenoch said Lady Mone had brought \"embarrassment and shame to the party\" and should have the \"book thrown at her\". Read more:What happens when an MP defects to another party?Badenoch branded 'delusional' as she makes 'serious offer' to help PM  The Tory leader has faced criticism over her leadership style, initially because she carried out very few media interviews. But she has said this was because the party was close to bankruptcy when she took over. \"I basically inherited a distressed asset and my first job was to just make sure we didn't go bust,\" she told The Spectator this week. \"Most of my first three to six months were spent on that. I just couldn't get out there much. The opportunity cost was perhaps not doing much media.\" But she has since failed to unify the party, which was illustrated by another disastrous result in the May 2025 local elections. And the latest results from a bimonthly YouGov poll, which tracks her performance as Tory leader, show Conservative voters have their lowest opinion of her since she became leader, with 38% thinking she should remain as leader. The highest number of Tory members (39%) now think she should stand down and let someone else take over - a rise of 10% since July. So, this conference is an opportunity to get members - and MPs - behind her. One of those MPs who has been unsubtle about his ambition to replace her is shadow justice secretary Robert Jenrick, who lost out to Ms Badenoch in the leadership race. Ms Badenoch has brushed off his attempts to outshine her, saying many of the views he offers so readily beyond his brief \"are my thoughts repackaged\". \"I don't mind that he says what he thinks,\" she told The Spectator. \"The advantage of having a leadership contest is that you've kind of already said what you think. \"Repeating it, which is what Rob tends to do, is not new information.\" Also, days before the conference starts, former Conservative prime minister Baroness Theresa May gave a rare public rebuke of Ms Badenoch after the Tory leader pledged to replace the UK's world-leading Climate Change Act with a strategy for \"cheap and reliable energy\". Baroness May said she is \"deeply disappointed by this retrograde step\" and that to row back on the strategy to tackle climate change \"would be a catastrophic mistake\". The Tory conference could be a chance for Ms Badenoch to turn her fortunes around, but she will have to work at getting her MPs - and Tory members (those who are left) - behind her and the party she promised to \"renew\" and to \"prepare over the course of the next few years for government\"."
    },
    {
        "title": "Nearly 500 arrested in London as pro-Palestine protest goes ahead despite pleas",
        "description": "Nearly 500 people have been arrested over protests supporting the proscribed group Palestine Action, as demonstrators defied calls to reconsider in the wake of the Manchester synagogue terror attack.",
        "url": "https://news.sky.com/story/nearly-500-arrested-in-london-as-pro-palestine-protest-goes-ahead-despite-pleas-13444490",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-gaza-protest-palestine_7041184.jpg?20251004140249",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-04 16:11:00",
        "Headline": "Two days after the synagogue attack in Manchester, hundreds of people gathered in London's Trafalgar Square to call on the government to reverse the ban on the proscribed group Palestine Action.",
        "Content": " Nearly 500 people have been arrested over protests supporting the proscribed group Palestine Action, as demonstrators defied calls to reconsider in the wake of the Manchester synagogue terror attack. Two days after the attack in Crumpsall, crowds of people gathered in central London on Saturday to call on the government to reverse the ban on the proscribed group. Organisers of the protest, Defend Our Juries, said 1,000 people attended the event to \"oppose genocide and the Palestine Action ban\". The Metropolitan Police said 492 people had been arrested, with the youngest being 18 and the eldest 89. The force said 297 remain in custody and the rest have been bailed. Before the demonstration even began, six people were arrested for unfurling banners which read \"I oppose genocide\" and \"I support Palestine Action\" on Westminster Bridge. The bulk of the arrests were made in Trafalgar Square, where protesters held placards showing their support for Palestine Action, which was added to the UK's list of proscribed terrorist groups in July. The Met said a different group of protesters also gathered in Whitehall before trying to make their way to Trafalgar Square.  Many of those arrested throughout the day were older individuals. Pictures showed people with walking sticks or in wheelchairs being supported by police, while others were physically carried to a processing pen after failing to cooperate with officers. One protester, 62-year-old Mike Higgins, who is blind and uses a wheelchair, told the PA news agency: \"We are going to win this battle, by the way, there's no doubt about that. The problem for me is that I want to win it now to try and bring an end to the suffering in Palestine.\" The Metropolitan Police had urged the Defend Our Juries group to postpone the event in light of the synagogue attack. Chief of the Metropolitan Police, Sir Mark Rowley, said he was worried resources would be stretched and the ability of the force to protect communities would be compromised as a result of the protest. In a statement on X on Saturday morning, Sir Keir Starmer also said anyone thinking of protesting should \"recognise and respect the grief of British Jews\", while Jewish figures called the action \"phenomenally tone deaf\". In a letter to Ade Adelekan, the deputy assistant commissioner of the Metropolitan Police, Defend Our Juries said the protest would continue as planned as \"the protection of our democracy and the prevention of countless deaths are critical issues\". Read more:Tributes to 'kind and heroic' victims of Manchester attackWhat we know about Manchester attacker The controversial decision drew criticism from policing minister Sarah Jones, who said many of those attending the event \"want to be arrested, that is their aim\". She said: \"We believe in people's rights to protest. This protest here in London is a different order of event because people are supporting a proscribed organisation and the police have to step in, in that case.\" A similar event held by the group, Greater Manchester Friends of Palestine, took place earlier on Saturday in Manchester. Instead of marching in support of Palestine Action, the event was to \"honour the names of Palestinian children brutally killed by Israel in Gaza\". A crowd of around 100 pro-Palestinian supporters gathered outside the city's Cathedral to listen to speakers before moving en masse to St Peter's Square. People were heard chanting \"Free Palestine!\" while a small group of counter-protesters marched in front shouting \"release the hostages\". Greater Manchester Police (GMP) did not say if any arrests were made.  Away from the protests, GMP said four of the six people arrested in connection to the synagogue terror attack will remain in custody for up to another five days. The force said the custody extension applies to two men, aged 30 and 32, and two women, aged 61 and 46. An 18-year-old woman and a 43-year-old man have been released and will face no further action. GMP said all six people had been arrested on suspicion of commission, preparation and instigation of acts of terrorism."
    },
    {
        "title": "The crucial issues that could destroy efforts for peace in Gaza",
        "description": "The speed with which the diplomacy is moving is dizzying but the question remains whether or not it will lead to concrete developments, or instead become mired in quicksand like so many previous peace processes in the Middle East.",
        "url": "https://news.sky.com/story/radioactive-issues-could-still-derail-gaza-ceasefire-despite-momentum-for-peace-13444095",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-gaza-israel-hamas-trump_7041047.jpg?20251004130237",
        "type": "Home",
        "Author": "Alex Rossi",
        "Date Published": "2025-10-04 12:07:00",
        "Headline": "Hamas has responded to Donald Trump's peace plan and says it agrees to release all remaining Israeli hostages being held in Gaza.",
        "Content": "\n          International correspondent\n              @alexrossiSKY\n  The speed with which the diplomacy is moving is dizzying but the question remains whether or not it will lead to concrete developments, or instead become mired in quicksand like so many previous peace processes in the Middle East. I think the first thing is to be clear that within what's referred to as Trump's peace plan there are essentially two component parts. The first bit is about achieving a ceasefire and bringing back the hostages, the second is about achieving a comprehensive peace in the wider region and the distant prospect of Palestinian statehood. Read more: Gaza latest as world leaders welcome Hamas response It goes without saying that ushering in a ceasefire, while not easy, is far more achievable than resolving the Israel-Palestine conflict completely. But what is clear is that this is a significant moment. What we do know is that Hamas has said it will accept parts of the plan. \n                  Gunfire and explosions followed by unsettling silence: Sky News reports from inside Gaza City\n                 \n                  Trump gives Hamas fresh ultimatum as he says confirmation of deal would trigger immediate ceasefire\n                 \n                  Trump tells Israel 'stop bombing Gaza' - as Hamas agrees to release Israeli hostages, and to parts of peace deal \n                 It means there's now real momentum building around the proposal.  After nearly two years of intense and devastating fighting, the region could finally be moving towards a lasting ceasefire - possibly very soon - along with the release of the remaining hostages. In many ways Hamas had no choice but to accept the deal - it was under extreme pressure, not just from the US but also Arab countries. However the statement issued by the group has a number of caveats and it's unclear whether the US and, to a certain extent Israel, will tolerate any real substantive negotiations. Senior Hamas sources have already said it's unrealistic that the hostages can be released in the next 72 hours: there are too many things - like where exactly the Israeli forces withdraw to - that need to be resolved. Another key issue that stands out is that of disarmament. Hamas's statement avoids any promise to give up its weapons, even though the plan demands it. For Israel and the United States, that's non-negotiable. Hamas also knows that once it's released the hostages it has little if any leverage at all and effectively this deal relies on them trusting the word of Donald Trump - a big ask. And these are just the bits to get to the ceasefire. On the wider issues Trump's twenty-point plan may be ambitious but it is also vague. It leaves many questions unanswered about borders, reconstruction, governance, and security as well as Palestinian self-determination. All radioactive issues that have destroyed previous efforts for peace. Real progress going forward will depend on detailed negotiations and genuine good faith from all sides, something that's often been missing. Even so, there have already been some striking developments. For the first time, a US president has commanded Israel to halt its bombing of Gaza, and the Israeli military has reportedly shifted into a defensive stance.  It's a remarkable display of how Trump's personal influence and power is reshaping the course of this war. For now then, this looks like the beginning of the end of active fighting, but not yet a comprehensive peace. It may though be the closest the region has come in years to something that could lead that to that destination."
    },
    {
        "title": "British teenager dies in car crash three months after being released from Dubai jail",
        "description": "A British teenager who was jailed in Dubai for having a sexual relationship with a 17-year-old has been killed in a car crash.",
        "url": "https://news.sky.com/story/british-teenager-dies-in-car-crash-three-months-after-being-released-from-dubai-jail-13443997",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-marcus-fakana-sky-dubai_6773113.png?20241211112448",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-04 08:53:00",
        "Headline": "Marcus Fakana, 19, died in hospital in the early hours of Friday following a police pursuit in Tottenham, north London. ",
        "Content": "A British teenager who was jailed in Dubai for having a sexual relationship with a 17-year-old has been killed in a car crash. Marcus Fakana, 19, died in hospital in the early hours of Friday following a police pursuit in Tottenham, north London. He had been a passenger in the car. His death comes just three months after he was released from jail in Dubai, in the United Arab Emirates (UAE). The Metropolitan Police said its officers were attempting to stop a \"vehicle of interest\" on Pretoria Road at roughly 12.52am on Friday, and after a short pursuit, police temporarily lost sight of the vehicle. Officers then drove onto The Roundway and found the vehicle had been involved in a crash with another vehicle. Police said they delivered \"immediate first aid\" at the scene before paramedics arrived, as a 19-year-old passenger had suffered \"significant injuries\". He was taken to hospital but died a short time later. \n                  Police given extra time to question four arrested over Manchester synagogue terror attack\n                 \n                  Nearly 500 arrested in London as pro-Palestine protest goes ahead despite pleas\n                 \n                   Prince William 'cares deeply about tradition' but Earthshot Prize shows he's not afraid to modernise\n                 Read more from Sky News:Why Trump accepted the Hamas peace plan responseWho is Sarah Mullally, the first ever female Archbishop of Canterbury? Marwaan Mohamed Huseen, of Argyle Road, Tottenham, has been charged with causing death by dangerous driving, driving without insurance, driving without a licence and failing to stop. He will appear at Highbury Corner Magistrates' Court on Saturday. Mr Fakana returned to the UK in July after receiving a pardon from Dubai ruler Sheikh Mohammed bin Rashid al Maktoum. Radha Sterling, chief executive of campaign group Detained in Dubai, told PA: \"Marcus spent the majority of this year in a Dubai prison which no doubt caused him long lasting mental anguish. \"It's sad that of all of 2025, he was only free for the three months from the 3rd of July until the 3rd of October.\" Mr Fakana had been with his parents in the UAE from the end of August 2024 when a \"holiday romance blossomed\" with another Londoner, who has since turned 18, Detained in Dubai previously said. He was arrested at his hotel last year after the girl's mother reported the relationship to Dubai police after she allegedly found their pictures and chats. In Dubai, the age of consent is 18. Ms Sterling added: \"(Mr Fakana's) loss is a painful reminder of how precious life is and how unnecessary imprisonment robs people of time they can never regain. \"Every day of freedom matters.\""
    },
    {
        "title": "Police given extra time to question four arrested over Manchester synagogue terror attack",
        "description": "Police have been granted extra time to question four people who were arrested in connection with the terrorist attack on a synagogue in Manchester.",
        "url": "https://news.sky.com/story/police-given-extra-time-to-question-four-arrested-over-manchester-synagogue-terror-attack-13444878",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-synagogue-manchester_7042231.jpg?20251005020104",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-04 23:55:00",
        "Headline": "Three men remain in hospital after the car and knife attack at the Heaton Park Hebrew Congregation Synagogue on Thursday.",
        "Content": "Police have been granted extra time to question four people who were arrested in connection with the terrorist attack on a synagogue in Manchester. Three men remain in hospital after the car and knife attack at the Heaton Park Hebrew Congregation Synagogue on Thursday. Jihad al Shamie, 35, who was on bail for an alleged rape, was shot by police as he launched the attack on Yom Kippur, the holiest day in the Jewish calendar. Adrian Daulby, 53, is believed to have been shot dead by police while trying to stop al Shamie from entering the synagogue. He died alongside Melvin Cravitz, 66, a worshipper who helped prevent the attacker from entering the place of worship. Counter Terrorism Policing North West (CTPNW) is leading the police operation and has been granted warrants allowing them to detain four people who were arrested on suspicion of preparing terrorist acts for a further five days. The warrants relate to two men, aged 30 and 32, and two women, aged 46 and 61. Greater Manchester Police (GMP) said the investigation was \"continuing at pace\" with \"significant resources\" mobilised in order to \"establish the full picture into what has happened\". The force said three men remain in hospital with serious injuries, including a security guard with car-impact injuries and a Community Security Trust (CST) worker with stab wounds. On Friday, the police watchdog, which is investigating the incident, said it was examining the use of lethal force by GMP firearms officers, including \"whether police may have caused or contributed to the death\" of Mr Daulby. Read more:Tributes to 'kind and heroic' victims of Manchester attackWhat we know about Manchester attacker  Nearly 500 arrested as pro-Palestine protest goes ahead despite pleas It comes as 492 people were arrested over protests supporting the proscribed group Palestine Action in Trafalgar Square on Saturday. The demonstration went ahead despite Sir Keir Starmer, other politicians and police bosses calling on organisers to reconsider. The Board of Deputies of British Jews called for those who attended the demonstration arrested under the Terrorism Act to also be investigated for stirring up racial hatred. The board is set to hold an event in the same location on Sunday afternoon to reflect on the two-year anniversary of the 7 October Hamas attack.  On Friday, the head of counter-terrorism policing, Laurence Taylor, said a \"suspicious device\" attached to al Shamie's torso was fake and police believed he \"may have been influenced by extreme Islamist ideology\". He added: \"Based on some fast-time assessments conducted on our systems, this individual does not appear to be known to counter-terrorism policing, however, he does have a non-CT (counter-terror) related criminal history. \"This includes a recent arrest for rape, which resulted in him being bailed.\""
    },
    {
        "title": "Nearly 500 arrested in London as pro-Palestine protest goes ahead despite pleas",
        "description": "Nearly 500 people have been arrested over protests supporting the proscribed group Palestine Action, as demonstrators defied calls to reconsider in the wake of the Manchester synagogue terror attack.",
        "url": "https://news.sky.com/story/nearly-500-arrested-in-london-as-pro-palestine-protest-goes-ahead-despite-pleas-13444490",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-gaza-protest-palestine_7041184.jpg?20251004140249",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-04 16:11:00",
        "Headline": "Two days after the synagogue attack in Manchester, hundreds of people gathered in London's Trafalgar Square to call on the government to reverse the ban on the proscribed group Palestine Action.",
        "Content": " Nearly 500 people have been arrested over protests supporting the proscribed group Palestine Action, as demonstrators defied calls to reconsider in the wake of the Manchester synagogue terror attack. Two days after the attack in Crumpsall, crowds of people gathered in central London on Saturday to call on the government to reverse the ban on the proscribed group. Organisers of the protest, Defend Our Juries, said 1,000 people attended the event to \"oppose genocide and the Palestine Action ban\". The Metropolitan Police said 492 people had been arrested, with the youngest being 18 and the eldest 89. The force said 297 remain in custody and the rest have been bailed. Before the demonstration even began, six people were arrested for unfurling banners which read \"I oppose genocide\" and \"I support Palestine Action\" on Westminster Bridge. The bulk of the arrests were made in Trafalgar Square, where protesters held placards showing their support for Palestine Action, which was added to the UK's list of proscribed terrorist groups in July. The Met said a different group of protesters also gathered in Whitehall before trying to make their way to Trafalgar Square.  Many of those arrested throughout the day were older individuals. Pictures showed people with walking sticks or in wheelchairs being supported by police, while others were physically carried to a processing pen after failing to cooperate with officers. One protester, 62-year-old Mike Higgins, who is blind and uses a wheelchair, told the PA news agency: \"We are going to win this battle, by the way, there's no doubt about that. The problem for me is that I want to win it now to try and bring an end to the suffering in Palestine.\" The Metropolitan Police had urged the Defend Our Juries group to postpone the event in light of the synagogue attack. Chief of the Metropolitan Police, Sir Mark Rowley, said he was worried resources would be stretched and the ability of the force to protect communities would be compromised as a result of the protest. In a statement on X on Saturday morning, Sir Keir Starmer also said anyone thinking of protesting should \"recognise and respect the grief of British Jews\", while Jewish figures called the action \"phenomenally tone deaf\". In a letter to Ade Adelekan, the deputy assistant commissioner of the Metropolitan Police, Defend Our Juries said the protest would continue as planned as \"the protection of our democracy and the prevention of countless deaths are critical issues\". Read more:Tributes to 'kind and heroic' victims of Manchester attackWhat we know about Manchester attacker The controversial decision drew criticism from policing minister Sarah Jones, who said many of those attending the event \"want to be arrested, that is their aim\". She said: \"We believe in people's rights to protest. This protest here in London is a different order of event because people are supporting a proscribed organisation and the police have to step in, in that case.\" A similar event held by the group, Greater Manchester Friends of Palestine, took place earlier on Saturday in Manchester. Instead of marching in support of Palestine Action, the event was to \"honour the names of Palestinian children brutally killed by Israel in Gaza\". A crowd of around 100 pro-Palestinian supporters gathered outside the city's Cathedral to listen to speakers before moving en masse to St Peter's Square. People were heard chanting \"Free Palestine!\" while a small group of counter-protesters marched in front shouting \"release the hostages\". Greater Manchester Police (GMP) did not say if any arrests were made.  Away from the protests, GMP said four of the six people arrested in connection to the synagogue terror attack will remain in custody for up to another five days. The force said the custody extension applies to two men, aged 30 and 32, and two women, aged 61 and 46. An 18-year-old woman and a 43-year-old man have been released and will face no further action. GMP said all six people had been arrested on suspicion of commission, preparation and instigation of acts of terrorism."
    },
    {
        "title": " Prince William 'cares deeply about tradition' but Earthshot Prize shows he's not afraid to modernise",
        "description": "A close adviser to Prince William has told Sky News William \"does care deeply about tradition\" but his Earthshot Prize shows he's not afraid to modernise to make sure his work \"makes sense\" for the generation he will serve.",
        "url": "https://news.sky.com/story/prince-william-cares-deeply-about-tradition-but-earthshot-prize-shows-hes-not-afraid-to-modernise-13444363",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-william-wales_7041639.jpg?20251004164448",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-10-04 14:48:00",
        "Headline": "After a TV interview hinted the Prince of Wales wanted to make 'change' when he becomes king, a trusted adviser tells Sky News how he believes that will manifest.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  A close adviser to Prince William has told Sky News William \"does care deeply about tradition\" but his Earthshot Prize shows he's not afraid to modernise to make sure his work \"makes sense\" for the generation he will serve. Marking a month to go until the fifth Earthshot Prize awards takes place in Rio de Janeiro in Brazil, Jason Knauf, the new chief executive, says it shows \"the sort of leader that Prince William wants to be, both now and in the future\" but also the huge impact his influence can have on issues like the climate crisis. Mr Knauf has become a close confidante of the Prince, having worked with him for ten years, and being there right at the beginning of the Earthshot journey, \"when this thing was percolating, and he really pushed us to make it something special\". But after discussions this week about the \"change\" William wants to make when he's monarch, Mr Knauf told us the Prince doesn't want to just shake things up for the sake of it. \"He does care deeply about tradition, about his family's legacy of service, and I think Earthshot is a really good example of how you're going to see that maintained in the future, but done in a way that makes sense for the time\", he said, adding: \"That's what his grandmother did. \"That's what his father's been doing. Updating the tradition for the generation that they serve\". Explaining how in the early days they looked closely at other examples of past royal prizes or initiatives, such as the Duke of Edinburgh Award, for inspiration, Mr Knauf said: \"You know, we didn't just create this thing in a vacuum. It was about what kind of difference could his leadership make? \n                  Prince William has 'the best day of my life' spraying pond water at journalists\n                 \n                  Prince William calls for better support for wildlife conservationists on South Africa visit\n                 \n                  Prince William lands in South Africa for 'milestone' Earthshot awards after weekend of royal criticism\n                 \"And one of the things about the royal family for generations, has been recognising the work of others. \"You know, whether that's through the honours system, recognising people in arts and community service or whatever it might be, all this is doing is taking something that's really traditional and putting a modern twist on it\". Last week, a TV programme was released in which Prince William admitted, during an interview with Hollywood star Eugene Levy, that \"change is on my agenda\" when he becomes King.  This weekend, the finalists for the fifth Earthshot awards are announced, with four weeks to go until the ceremony takes place in Rio. The prize recognises innovators coming up with solutions to the world's most pressing environmental problems. Among this year's finalists in the running for the five £1m prizes are Matter, a British company whose simple washing machine filters remove the greatest cause of microplastics in our ocean; the world's first fully 'upcycled skyscraper' in Australia, a Chinese company working on mobile phone waste, and the country of Barbados for its environmental focus. Read more from Sky News:Radioactive issues could still derail momentum for Gaza peaceDetails emerge of synagogue attacker's life For the first time, the awards will take place in the same country, in the same week as the UN climate change conference COP30. Addressing whether the positive message of Earthshot will be overshadowed by the inevitable split opinions on tackling the climate crisis that will come out of the conference in Belem, Mr Knauf said: \"The news around political disagreement and all of that stuff will be out there, but that's one of the reasons we created the prize, directly to challenge that pessimism and negativity, to say we need to get on with this work. \"Showing world leaders that big things are happening in their regions and in their countries and in their backyards should remind them that, actually, this isn't something that's theoretical. \"The actual solutions that we need really, really do exist\". Prince William will travel to Brazil on 3 November for engagements in Rio, highlighting environmental issues, as well as attending the awards on 5 November at the iconic Museum of Tomorrow. In a video posted on his social media, the Prince explains how he continues to do this for his children, saying: \"The Earthshot Prize was founded because this decade matters. \"2030 is a threshold by which future generations will judge us; it is the point at which our actions, or lack of them, will have shaped forever the trajectory of our planet.\""
    },
    {
        "title": "British teenager dies in car crash three months after being released from Dubai jail",
        "description": "A British teenager who was jailed in Dubai for having a sexual relationship with a 17-year-old has been killed in a car crash.",
        "url": "https://news.sky.com/story/british-teenager-dies-in-car-crash-three-months-after-being-released-from-dubai-jail-13443997",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-marcus-fakana-sky-dubai_6773113.png?20241211112448",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-04 08:53:00",
        "Headline": "Marcus Fakana, 19, died in hospital in the early hours of Friday following a police pursuit in Tottenham, north London. ",
        "Content": "A British teenager who was jailed in Dubai for having a sexual relationship with a 17-year-old has been killed in a car crash. Marcus Fakana, 19, died in hospital in the early hours of Friday following a police pursuit in Tottenham, north London. He had been a passenger in the car. His death comes just three months after he was released from jail in Dubai, in the United Arab Emirates (UAE). The Metropolitan Police said its officers were attempting to stop a \"vehicle of interest\" on Pretoria Road at roughly 12.52am on Friday, and after a short pursuit, police temporarily lost sight of the vehicle. Officers then drove onto The Roundway and found the vehicle had been involved in a crash with another vehicle. Police said they delivered \"immediate first aid\" at the scene before paramedics arrived, as a 19-year-old passenger had suffered \"significant injuries\". He was taken to hospital but died a short time later. \n                  Police given extra time to question four arrested over Manchester synagogue terror attack\n                 \n                  Nearly 500 arrested in London as pro-Palestine protest goes ahead despite pleas\n                 \n                   Prince William 'cares deeply about tradition' but Earthshot Prize shows he's not afraid to modernise\n                 Read more from Sky News:Why Trump accepted the Hamas peace plan responseWho is Sarah Mullally, the first ever female Archbishop of Canterbury? Marwaan Mohamed Huseen, of Argyle Road, Tottenham, has been charged with causing death by dangerous driving, driving without insurance, driving without a licence and failing to stop. He will appear at Highbury Corner Magistrates' Court on Saturday. Mr Fakana returned to the UK in July after receiving a pardon from Dubai ruler Sheikh Mohammed bin Rashid al Maktoum. Radha Sterling, chief executive of campaign group Detained in Dubai, told PA: \"Marcus spent the majority of this year in a Dubai prison which no doubt caused him long lasting mental anguish. \"It's sad that of all of 2025, he was only free for the three months from the 3rd of July until the 3rd of October.\" Mr Fakana had been with his parents in the UAE from the end of August 2024 when a \"holiday romance blossomed\" with another Londoner, who has since turned 18, Detained in Dubai previously said. He was arrested at his hotel last year after the girl's mother reported the relationship to Dubai police after she allegedly found their pictures and chats. In Dubai, the age of consent is 18. Ms Sterling added: \"(Mr Fakana's) loss is a painful reminder of how precious life is and how unnecessary imprisonment robs people of time they can never regain. \"Every day of freedom matters.\""
    },
    {
        "title": "Green Party membership overtakes Liberal Democrats under Polanski",
        "description": "The Green Party now has more members than the Liberal Democrats, despite having 68 fewer MPs in parliament.",
        "url": "https://news.sky.com/story/green-party-membership-overtakes-liberal-democrats-under-polanski-13444030",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-zack-polanski-bournemouth_7040167.jpg?20251003141551",
        "type": "UK",
        "Author": "Will Charley",
        "Date Published": "2025-10-04 10:31:00",
        "Headline": "Around 20,000 people have joined the Green Party in the past few months, and new leader Zack Polanski says he has \"undoubtedly\" had a role in this success.",
        "Content": "\n          Political reporter\n              @WillCharley1\n The Green Party now has more members than the Liberal Democrats, despite having 68 fewer MPs in parliament. Rachel Millward, the party's deputy leader, announced the achievement to members on the second day of the party's annual conference in Bournemouth this morning. It's believed to be only the second time this has happened, with the last time being more than a decade ago - in January 2015. The Greens have revealed they now have more than 83,500 members, to the Lib Dems 83,174.  This is despite Sir Ed Davey's party having 72 MPs in parliament, while the Greens have just four representatives in the Commons. Around 20,000 new members have joined the Green Party in recent months, leading to a surge in membership of about 20%. Polanski: 'I have undoubtedly accelerated the party's rise' \n                  Palestine Action proscription must be 'withdrawn', says Green Party leader Zack Polanski\n                 \n                  The Green Party might be small but it's thinking big - can it make a dent in Reform's rise?\n                 \n                  What's Zack Polanski's story?\n                 It follows the election of new leader Zack Polanski at the beginning of September. Mr Polanski, who is not an MP, ran on a platform of bringing about a mass-movement within the party through the form of \"eco-populism\". Mr Polanski has stated his public ambition is for the party to win more than 30 MPs at the next general election in four years time, and to win himself a seat in parliament. Announcing the rise in membership, Ms Millward said: \"We are now officially the fastest growing political movement in Britain today! \"As of right now, I can confirm we are bigger than the Liberal Democrats.\" This was met with a standing ovation from members, one of several that the deputy leader received during her speech. Speaking to Sky News following his deputy's speech to the conference, Mr Polanski said: \"It's phenomenally exciting. It marks a real moment. It's really striking to me that since I launched my leadership campaign back in May, membership went up 33% and is still going up.\" Challenged if he believes the sudden rise in membership is entirely down to his own leadership abilities, Mr Polanski responded: \"This is a team effort. \"I think for a long time the party's had a very clear direction. I think, undoubtedly, I've accelerated that in terms of the bold politics message, but I know the entire party is on board with that.\" The Green Party leader used his keynote speech to members on Friday to set out plans for a wealth tax on the assets of the richest 1% \"to reduce inequality\" and end \"rip off Britain\". He also called the conflict in Gaza a genocide - a long-standing Green Party policy - and insisted \"we will not be silent\". On Saturday, deputy leaders Ms Millward and Mothin Ali addressed members in the morning and, at lunchtime, hundreds of supporters gathered on the beach in Bournemouth in support of Palestinians in Gaza. Holding up a large red banner that stretched far down the beach, Mr Polanski asked the government where its \"red line\" was for Israel. Members led several chants from the beach, including the controversial phrase: \"From the River to the sea, Palestine will be free.\" This evening, Mr Polanski will record a live episode of his podcast, Bold Politics, with left-wing commentator, Owen Jones. Lib Dems: 'Sir Ed Davey is the most popular and the most trusted' The Liberal Democrats' website boasts a membership of \"more than 90,000 people\", but Sky News understands that this figure is out of date and incorrect. The 83,174 number comes from the most recently published set of the party's accounts, which cover up to the end of last year. It is thought membership of the party may have dropped since. Responding to being overtaken by the Greens, a spokesperson for the party said: \"Across the country it's the Liberal Democrats who are on the up, after making record gains at the local elections in May, winning more seats than Labour and the Conservatives for the first time ever. \"Ed Davey is the most popular party leader, and the most trusted on NHS and care, because we're focused on the issues that really matter.\" The Lib Dems held their party conference earlier this year, where Sir Ed used speeches to attack Reform UK, US President Donald Trump and tech titan Elon Musk."
    },
    {
        "title": "Conservative Party pledges £1.6bn ICE-style 'removals force' to detain and deport illegal migrants",
        "description": "The Conservatives are pledging to create a new \"removals force\" to detain and remove 150,000 a year as part of a broad plan to tackle illegal immigration to the UK.",
        "url": "https://news.sky.com/story/conservative-party-pledges-16316bn-ice-style-removals-force-to-detain-and-deport-illegal-migrants-13444647",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ice-hearings-federal-agents-involed-in_7042232.jpg?20251005020837",
        "type": "UK",
        "Author": "Ben Bloch at Conservative Party conference in Manchester",
        "Date Published": "2025-10-04 17:15:00",
        "Headline": "The pledge is part of the Conservative Party's broad new plans to stop illegal migration to the UK, set to be unveiled by Kemi Badenoch on the first day of their annual conference on Sunday.",
        "Content": "By Ben Bloch at Conservative Party conference in Manchester   The Conservatives are pledging to create a new \"removals force\" to detain and remove 150,000 a year as part of a broad plan to tackle illegal immigration to the UK. Modelled on the \"successful approach\" of the US Immigration and Customs Enforcement (ICE) agency, this new force would be given \"sweeping new powers\", and over £1bn in new funding. The pledge is part of the Conservative Party's broad new plans to stop illegal migration to the UK, set to be unveiled by Kemi Badenoch on the first day of their annual conference on Sunday, where reducing immigration and creating \"Strong Borders\" will be one of the key themes. The new \"removals force\" that she will unveil will replace the existing Home Office Immigration Enforcement (IE) and will be given broad new powers, including being able to use facial recognition without warning in order to spot illegal immigrants.  👉Listen to Politics at Sam and Anne's on your podcast app👈 It will be given funding of £1.6bn a year, up from the existing £820m a year, to increase the number of removals annually from 34,000 to 150,000 - which would represent \"at least 750,000 removals\" across a five-year parliament. The Tories say this increase in funding would come from the closure of asylum hotels and \"tackling the wider costs of our out-of-control asylum system\". \n                  A subdued Tory conference could be a chance for Badenoch to turn her fortunes around - but will she?\n                 \n                  Data leaked to Sky News shows Tory conference might be set for smaller crowd this year\n                 \n                  ECHR move shows Tories are under pressure like never before\n                 However, ICE in the US has been heavily criticised by politicians and the public in recent months, with the agency accused of arresting both legal migrants and US citizens and targeting people based on their race. Expanding the use of live facial recognition technology is also likely to attract criticism from within the Tory Party itself, on the grounds of it being a threat to individual freedom and privacy.  Tories to withdraw from multiple conventions In addition to confirming plans to leave the European Convention on Human Rights (ECHR), announced on Saturday, Ms Badenoch will also vow to fully repeal the Human Rights Act, and leave the Council of Europe Convention on Action Against Trafficking in Human Beings. This, the Tories say, would \"end the legal blocks that allow illegal immigrants, and in some cases foreign criminals, to stay in the UK based on flimsy claims\".  A radical overhaul of the asylum system would see refugee status granted only to those threatened by a foreign government, and those fleeing conflict or \"less tolerant\" laws on religion or sexuality would not be eligible, with the party saying \"few people will qualify\". The plan will also see the immigration tribunal abolished, with all decisions on migration taken by the Home Office with only limited rights of appeal in cases where officials have acted without statutory authority. Immigration cases will be denied legal aid, with the Tories accusing solicitors of having \"defrauded\" the UK by \"coaching\" applicants and arguing there is \"no need for lawyers\" as people \"should simply tell the truth about their circumstances\".  'Labour is fixing the Tories' mess' The plans come as Ms Badenoch faces continued pressure on her right flank from Reform UK, which has already pledged to leave the ECHR and deport up to 600,000 people over five years if it comes to power. But the party leader said the plans put forward by Nigel Farage's party are \"nothing but announcements that fall apart on arrivals\". She also said the Labour government offers \"failed gimmicks\", adding: \"Our Stronger Borders plan is serious and credible and backed by a comprehensive legal analysis. That is the difference the next Conservative government will deliver.\" A Labour Party spokesperson said: \"The Conservatives' message on immigration is: we got everything wrong, we won't apologise, now trust us. \"It won't wash - Kemi Badenoch's party enabled record high net migration as removals plummeted, opened over 400 asylum hotels and wasted £700 million of taxpayers' money to send just four volunteers to Rwanda. \"This Labour government is fixing the Tories' mess by smashing the people-smuggling gangs running the vile small boats trade, closing asylum hotels, deporting foreign criminals and signing international returns deals to bring order to Britain's borders.\" Hear more about the plans from shadow home secretary Chris Philp, live at the Conservative Party Conference in Manchester on Sunday Morning With Trevor Phillips from 8.30am."
    },
    {
        "title": "Data leaked to Sky News shows Tory conference might be set for smaller crowd this year",
        "description": "Will as many people as last year come to Tory conference? I have a leak that helps explore this - and it reveals the party itself is expecting fewer.",
        "url": "https://news.sky.com/story/data-leaked-to-sky-news-shows-tory-conference-might-be-set-for-smaller-crowd-this-year-13444674",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-tory-conservative-conference_7041985.png?20251004191651",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-10-04 17:50:00",
        "Headline": "The Conservative Party conference begins on Sunday October 5 and is billed as \"the party’s biggest political event of the year\". ",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Will as many people as last year come to Tory conference? I have a leak that helps explore this - and it reveals the party itself is expecting fewer. Normally you don't get any detailed breakdowns of conference data - who is coming and in what category. But I've been shared an early cut of the numbers from this year. What you can see above is a screenshot of the data sent to the party board. I am told this table is from 11 August and shows the then-current attendance figures which were sent to the Conservative Party board. They revealed numbers due to be coming to Manchester this week, lagging on last year. You can see that at that stage, there are more than 1,000 fewer members due to come to conference than had been listed in early August 2024. Indeed, the party's target is markedly lower. There are also fewer Young Conservatives, though by a much smaller margin. However, the number of commercial guests is up on last year, as is donors, known as 'Treasurer's Guests', although the number planning to attend Business Day on Monday is down. \n                  A subdued Tory conference could be a chance for Badenoch to turn her fortunes around - but will she?\n                 \n                  Conservative Party pledges £1.6bn ICE-style 'removals force' to detain and deport illegal migrants\n                 \n                  ECHR move shows Tories are under pressure like never before\n                 The 'Margaret Thatcher 100th,' a commemoration of her life, is a new event to mark the centenary of the former Conservative prime minister's birth which is on 13 October. I'm told the current number of members coming to Manchester is 3,500, although that is calculated on a different basis to these - and includes Young Conservatives. Strength Another source told me the number of members coming to conference - calculated on the above basis - is around 2,800 but it was not possible to verify that. A Conservative spokesman said: \"This out-of-date report does not reflect the strength of Conservative Party conference 2025. \"There are thousands of members - many new to the party - hundreds of businesses, and many other delegates attending to hear Kemi Badenoch's bold new vision for the country. \"This conference the Conservatives will demonstrate they are the only party that can be trusted to deliver a stronger economy and stronger borders for the country.\" In response to the leaked data, Reform UK posted on X, \"The Conservative Party is finished.\""
    },
    {
        "title": "French air traffic controllers call off strike - sparing disruption for thousands of travellers",
        "description": "French air traffic controllers have called off their upcoming strikes, sparing travellers across Europe from disruption. ",
        "url": "https://news.sky.com/story/french-air-traffic-controllers-call-off-strike-sparing-disruption-for-thousands-of-travellers-13444182",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-istock-uk-eu-gates_6921373.jpg?20250519121550",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-04 13:06:00",
        "Headline": "The strikes could have meant 600 flights were cancelled a day, impacting 100,000 passengers, Europe's largest airline said. ",
        "Content": "French air traffic controllers have called off their upcoming strikes, sparing travellers across Europe from disruption.  The SNCTA (syndicat majoritaire des controleurs aeriens) union said it was halting its forthcoming industrial action from Tuesday to Thursday, 7 to 9 October, following agreements and the French prime minister's postponement of the French finance bill parliamentary debate. The union has pushed for better pay and conditions. Travellers across the UK were expected to face disruption from the industrial action - as stoppages by French air traffic staff mean flights over the country are rerouted or cancelled. The head of Europe's biggest airline estimated the latest strikes could have meant 100,000 passengers had their flights cancelled, equating to about 600 flights a day. Read more:Baroness Mone: I have no wish to rejoin Lords as Conservative peerReeves seeks outsider to run Britain's banking watchdog The UK would be particularly impacted, Ryanair's chief executive Michael O'Leary said. \n                  Airlines furious after another technical glitch cancels flights\n                 \n                  Boeing passenger jet catches fire after engine fault forces American Airlines flight to divert to Denver\n                 \n                  Plane makes emergency landing after pilot dies on Turkish Airlines flight\n                 \"The UK is the country whose flights get cancelled most because of the geographic proximity to France.\" The airline has long campaigned for flights across French airspace to be protected amid walkouts, saying failure to do so was a breach of European Union laws. Journeys to and from France should be impacted rather than trips for UK passengers heading to popular destinations in Spain and Greece, the airline has said. French air traffic controllers also staged walkouts in July in their quest for better pay and conditions. Due to this action, Ryanair said it axed 170 services and EasyJet said it cancelled 274 flights."
    },
    {
        "title": "A subdued Tory conference could be a chance for Badenoch to turn her fortunes around - but will she?",
        "description": "Conservative Party conferences of old were packed out events bustling with ministers, MPs, lobbyists and members.",
        "url": "https://news.sky.com/story/a-subdued-tory-conference-could-be-a-chance-for-badenoch-to-turn-her-fortunes-around-but-will-she-13442956",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kemi-badenoch-immigration_7041947.jpg?20251004184928",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-10-04 23:01:00",
        "Headline": "It is the first Conservative autumn conference with Kemi Badenoch as leader.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Conservative Party conferences of old were packed out events bustling with ministers, MPs, lobbyists and members. Roll on just over a year after their biggest defeat ever, and the Tories' gathering in Manchester, from 5-8 October, will be a more sober affair. Despite their recent loss, last year's conference was anything but subdued as it was turned into a hustings for their new leader to replace Rishi Sunak. Cue: a bit of a bun fight. A month later, Kemi Badenoch was crowned leader. So this conference not only marks a year after that abysmal result but also nearly a year of Ms Badenoch in charge. A series of policy announcements are expected throughout the conference, with the first today being an eye-catching vow to create an ICE-style \"removals force\" to tackle illegal immigration to the UK, which follows her pledge to leave the European Convention on Human Rights (ECHR). \"Stronger borders\" is one of the two key themes of this conference, along with \"stronger economy\" - slogans set to feature on banners throughout the conference venue. It is part of her bid to scrape back her party's position in the polls as Nigel Farage's continues to lead in the national polls. \n                  Data leaked to Sky News shows Tory conference might be set for smaller crowd this year\n                 \n                  Conservative Party pledges £1.6bn ICE-style 'removals force' to detain and deport illegal migrants\n                 \n                  ECHR move shows Tories are under pressure like never before\n                 Just three weeks before this year's gathering, one of her ministers, Danny Kruger, became the first serving Tory MP to defect to Reform. Eleven former Conservative cabinet members, ministers and MPs had switched to Reform this year ahead of Mr Kruger. Ex-health minister Maria Caulfield defected after Mr Kruger. Sub-optimal for Badenoch, but an issue she has brushed off, accusing them of \"running away rather than solving problems\". The threat of Reform, which has led the polls for weeks, dominated the Lib Dem and Labour conferences but, if PMQs is anything to go by, there is no guarantee Ms Badenoch will put Mr Farage's party at the forefront of her two conference speeches. Rather than just the traditional leader's speech at the end of the conference, Ms Badenoch will deliver an additional one today, in which she will set out the party's broad new plan to tackle illegal migration. Some 34,401 people have crossed the Channel in small boats so far this year, according to PA news agency analysis of Home Office figures, putting 2025 on course to break the record for most arrivals in a single year. The traditional end-of-conference speech will still take place on Wednesday, as she seeks to grab headlines and cut through the electorate in a way she has failed to do so far. Also overshadowing the party as they head to Manchester is the High Court ruling that a PPE company linked to Tory peer Baroness Michelle Mone must repay the government £122m for breaching a contract for medical gowns during COVID. Ms Badenoch said Lady Mone had brought \"embarrassment and shame to the party\" and should have the \"book thrown at her\". Read more:What happens when an MP defects to another party?Badenoch branded 'delusional' as she makes 'serious offer' to help PM  The Tory leader has faced criticism over her leadership style, initially because she carried out very few media interviews. But she has said this was because the party was close to bankruptcy when she took over. \"I basically inherited a distressed asset and my first job was to just make sure we didn't go bust,\" she told The Spectator this week. \"Most of my first three to six months were spent on that. I just couldn't get out there much. The opportunity cost was perhaps not doing much media.\" But she has since failed to unify the party, which was illustrated by another disastrous result in the May 2025 local elections. And the latest results from a bimonthly YouGov poll, which tracks her performance as Tory leader, show Conservative voters have their lowest opinion of her since she became leader, with 38% thinking she should remain as leader. The highest number of Tory members (39%) now think she should stand down and let someone else take over - a rise of 10% since July. So, this conference is an opportunity to get members - and MPs - behind her. One of those MPs who has been unsubtle about his ambition to replace her is shadow justice secretary Robert Jenrick, who lost out to Ms Badenoch in the leadership race. Ms Badenoch has brushed off his attempts to outshine her, saying many of the views he offers so readily beyond his brief \"are my thoughts repackaged\". \"I don't mind that he says what he thinks,\" she told The Spectator. \"The advantage of having a leadership contest is that you've kind of already said what you think. \"Repeating it, which is what Rob tends to do, is not new information.\" Also, days before the conference starts, former Conservative prime minister Baroness Theresa May gave a rare public rebuke of Ms Badenoch after the Tory leader pledged to replace the UK's world-leading Climate Change Act with a strategy for \"cheap and reliable energy\". Baroness May said she is \"deeply disappointed by this retrograde step\" and that to row back on the strategy to tackle climate change \"would be a catastrophic mistake\". The Tory conference could be a chance for Ms Badenoch to turn her fortunes around, but she will have to work at getting her MPs - and Tory members (those who are left) - behind her and the party she promised to \"renew\" and to \"prepare over the course of the next few years for government\"."
    },
    {
        "title": "Gunfire and explosions followed by unsettling silence: Sky News reports from inside Gaza City",
        "description": "There is a loud boom, the noise of an explosion, followed by the rat-a-tat of automatic gunfire. ",
        "url": "https://news.sky.com/story/gunfire-and-explosions-followed-by-unsettling-silence-sky-news-reports-from-inside-gaza-city-13444271",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-parsons-gaza-city-apc_7041395.jpg?20251004151804",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-10-04 16:30:00",
        "Headline": "In spite of a tentative acceptance by Hamas of parts of President Trump's peace deal, in Gaza City, says Adam Parsons, the concept of peace feels almost unthinkable. ",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  There is a loud boom, the noise of an explosion, followed by the rat-a-tat of automatic gunfire.  Another explosion, more distant. A sign on the wall warns people against snipers. And all around us is the rubble of destruction. Welcome to Tel al-Hawa, once one of the most affluent suburbs of Gaza City. Now wrecked, uninhabitable and destroyed. Like so much of Gaza - and like all the places we drove through to get here - it is a wasteland. Buildings reduced to rubble, with a layer of dust covering everything. The only people you see are Israeli soldiers. Throughout my day in Gaza, I didn't see a single Gazan. Partly that's because we were there with the Israeli military, who controlled all our movements. \n                  Trump says Gaza ceasefire will begin 'immediately' when Hamas confirms deal\n                 \n                  Nearly 500 arrested in London as pro-Palestine protest goes ahead despite pleas\n                 \n                  Why Trump accepted the Hamas peace plan response\n                 They also censored our broadcast material, all of which had to be submitted to a military officer to be scrutinised. In our case, this simply meant demands to blur soldiers' faces, obscure some technology and conceal sensitive information, but it is a form of control over journalists. Partly it's because places like this have been so completely wrecked that everyone has fled. I came here on Friday afternoon, along with journalists from a variety of media outlets from around the world. There was no sign that, a few hours later, Hamas would offer a response to the Trump peace plan, nor that there would be a surge of global optimism. Because here, amid the dust and debris, everything is bleak and threatening. Everywhere you look there is devastation. The filaments of war are everywhere. Gaza latest: World leaders welcome Hamas response to US peace deal The soundscape is military. There are the roars of explosions, bursts of gunfire, the buzz of drones, the clatter of troops crunching through rubble and the roar of the engines that power tanks and armoured personnel carriers (APCs). But every now and then there is silence. No birdsong, no gentle chatter. Nothing. It is unsettling. The proof that people ever lived here is strewn around, as if a plane has crashed. There are scraps of everyday life - a milk carton, a phone cable, a shoe. A red toy car. And curiously, amid all this horror, there is a bouquet of red roses. They are artificial, of course, but they lie in the street, dusty and forgotten. What were they for? A party, a wedding? Or just to brighten up a home that has now been blown away. Booby traps, snipers on roofs We spoke to Israeli military officials, who told us they had only recently taken control of this area. The picture they paint of Hamas fighters is that of a depleted fighting force, reduced to maybe 2,000 people, including young and inexperienced conscripts. Their tactics are those of a guerrilla force - snipers on roofs, booby traps, improvised explosive devices. \"But it can work. We had a soldier killed very near here a couple of weeks ago. And Hamas - they are brave,\" he says. \"It is hard for us to have fought for two years, but it is harder for Hamas than us. We are strong enough to finish this war, bring the hostages back, eliminate Hamas and ensure 7 October can never happen again.\" Read more:Guns, cash and American aid: Israel's support for Gaza militia revealedWhy Trump accepted the Hamas peace plan response The military has occupied a building that was once either a large house or perhaps a series of apartments. Some of the rooms are simply forgotten, others are used by the IDF for offices, meals or meetings. At the top of the building is a room with a large picture window. It looks out towards the Jordanian Hospital - the only building here, and I think the only building I saw throughout my visit that is unscathed. The soldiers show us drone footage from inside the hospital campus, revealing a tunnel opening. Twenty metres below the ground, they say, was a Hamas workshop for designing and building missiles and rockets. \"It's very significant,\" one of the soldiers tells me, his face obscured by a balaclava. \"The weapons manufactured here are being fired at our civilians. To find it here, under the compound with the hospital, shows how Hamas is using civilians to hide behind. \"We cannot attack that,\" - he points at the hospital - \"we don't want to hurt the people there. It's very significant to us as Israelis and also to the citizens of Gaza, who are being used by Hamas.\" An IDF official told me the hospital had also been used to \"accommodate\" between 50 and 80 Hamas fighters, and said Jordanian Hospital officials \"definitely knew\" about these people. We later put these allegations to a Jordanian official source, who described the hospital's work as \"purely a humanitarian mission\" that \"has been providing treatment for tens of thousands of Gazans since 2009\". \"Jordan has no knowledge of the presence of tunnels under the location of the Tel al-Hawa hospital. Gaza is riddled with tunnels. \"There was no access into the hospital from any underground tunnels. Over its 16 years of operation, no fighters were present within the hospital's premises.\" There are many stories of Israeli reserve soldiers saying they are both weary and wary, reluctant to sign up for another tour of duty. Looking out over the hellish landscape of this shattered town, I could understand why some would think twice before rushing back. Yet Richard Hecht did. Formerly the spokesperson for the IDF, Hecht, whose family moved from Glasgow to Israel when he was a boy, had been called at 11pm the previous evening and asked to accompany us. We talked, with dust billowing around us at a military compound on the outskirts of Gaza City. \"I hope this war comes to an end, and it would stop in a matter of moments if Hamas returned our hostages,\" he told me. \"But the IDF is very determined - we want our hostages back. We are doing everything we can because we have to fight Hamas. What alternative do we have? We need to obliterate this group.\" I suggest to him Israel's military action now looks wildly disproportionate, especially bearing in mind they believe Hamas to now have only a couple of thousand fighters. More than 65,000 people have been killed in Gaza, half of them women and children. And many, including a UN commission, have claimed this is genocide. Hecht bristles. \"That is an atrocious thing to say. Genocide has intent, it entails intent. It is an atrocious accusation and I cannot connect it. We are fighting Hamas. We are not fighting Palestinians.\" We have to leave. This town is regarded as an active conflict zone, and the regular chorus of gunfire and explosions testifies to that. We clamber back into the APC, crewed by two men in their early 20s. One drives, the other stands up, using a hatch to access a machine gun based on the roof. He beckons me up to see the view. Around us, a line of military vehicles. A digger comes into view, and then a plume of dust flies up as the APC reverses. I look down and see hundreds of spent casings around the machine gun. I point at them, and he nods slowly. We drive away. The dust envelopes the vehicles again, and we leave Gaza City behind us. As we head back towards the border, to the gates that divide a war zone from Israeli towns and kibbutzim, we see a huge plume of smoke rising a mile or two away. In Gaza, the concept of peace feels almost unthinkable."
    },
    {
        "title": "Trump says Gaza ceasefire will begin 'immediately' when Hamas confirms deal",
        "description": "Donald Trump has said a ceasefire in Gaza will begin \"immediately\" after Hamas agrees to a new US plan to end the war.",
        "url": "https://news.sky.com/story/trump-says-gaza-ceasefire-will-begin-immediately-when-hamas-confirms-deal-13444804",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-us-president_7042203.jpg?20251004220833",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-04 19:18:00",
        "Headline": "The US president has said Israel has \"agreed to the initial withdrawal line\" and \"when Hamas confirms\", the ceasefire will start, Israeli hostages will be released and a prisoner exchange will begin.",
        "Content": " Donald Trump has said a ceasefire in Gaza will begin \"immediately\" after Hamas agrees to a new US plan to end the war. The US president said Israel had \"agreed to the initial withdrawal line\" and \"when Hamas confirms\", the ceasefire will start, Israeli hostages will be released and a prisoner exchange will begin. In a post on his Truth Social platform, Mr Trump said it would \"create the conditions for the next phase of withdrawal, which will bring us close to the end of this 3,000-year catastrophe\". It came as Hamas accused the Israeli government of lying about reducing its military operations, accusing it of continuing to \"commit its horrific crimes and massacres\" against Palestinians in Gaza, claiming 70 people had been killed by strikes since Saturday morning. The group said it \"exposes the false claims of the war criminal Netanyahu's government regarding scaling back military operations against defenceless civilians\". It comes after Israeli Prime Minister Benjamin Netanyahu has said he hopes to announce the release of all hostages from Gaza \"in the coming days\".  Mr Netanyahu made the remarks as indirect talks with Hamas continue in Egypt on a new US plan to end the war. Speaking after Hamas said it had accepted some elements of the plan, Mr Netanyahu said he had sent the delegation to Egypt \"to finalise technical details\", adding that \"our goal is to contain these negotiations to a timeframe of a few days\". Donald Trump has welcomed Hamas's statement, but on Saturday warned the group \"must move quickly, or else all bets will be off\". Read more:Why Trump accepted the Hamas peace plan responseSky News investigation reveals Israel's support for Gaza militia  Trump orders Israel to stop bombing Gaza Earlier in the day, Israel's army said the country's leaders had instructed it to prepare for the first phase of the US plan to end the war in Gaza. Israel has moved to a defensive-only position in Gaza and will not actively strike, one official said, adding that no forces have been removed from the territory. It came hours after Mr Trump ordered Israel to stop bombing Gaza after Hamas said it accepted some elements of his plan.  What's in the peace plan? Mr Trump's proposed plan to end the war has widespread international support and on Friday, Mr Netanyahu's office said Israel was committed to bringing the conflict to an end. Under the plan, Hamas would release the remaining 48 hostages, of which around 20 are believed to still be alive, within three days. It would also give up power in Gaza and disarm. In return, Israel would end its offensive and withdraw from much of Gaza, as well as release hundreds of Palestinian prisoners and allow an influx of humanitarian aid and eventual reconstruction. Hamas has said it is willing to release the hostages and hand over power to other Palestinians, but argued other aspects of the plan require further consultations among Palestinians. Its statement did not address the issue of Hamas demilitarising, which is a key part of the deal. Warning 'extremists on both sides' could sabotage peace plan A group representing some families of hostages said the prospect of seeing their loved ones return \"has never been closer\" and they appealed to Mr Trump to keep pushing \"with full force\". They warned \"extremists on both sides\" would try to sabotage the plan. The war began when Hamas attacked Israel on 7 October 2023, killing 1,200 people and taking 251 hostage. Since then, at least 67,000 Palestinians have been killed in Israel's war with Hamas in Gaza, according to the enclave's Hamas-run health ministry, which does not differentiate between civilians and combatants in its count, but says women and children make up around half of the dead."
    },
    {
        "title": "'I don't want to bury them': A month on from one of the worst earthquakes Afghanistan has seen",
        "description": "It is a breathtaking and, at points, pretty perilous journey through the remote mountainous region of eastern Afghanistan.",
        "url": "https://news.sky.com/story/i-dont-want-to-bury-them-a-month-on-from-one-of-the-worst-earthquakes-afghanistan-has-seen-13443561",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-afghanistan-wadir-earthquake_7040300.jpg?20251003160255",
        "type": "World",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-10-04 23:01:00",
        "Headline": "The earthquake killed some 2,000 people and was one of the worst Afghanistan has seen, and it came at an already desperate time for Afghans. A month on, Sky News has seen the aftermath.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  It is a breathtaking and, at points, pretty perilous journey through the remote mountainous region of eastern Afghanistan. We're trying to reach the Mazar Dara valley, where an earthquake wiped out whole villages. The force of the quake ripped apart roads, cut off communities and buried multiple generations. It's slow going - navigating around sheer drops on a road scattered with rocks and boulders. But after three hours, we start to see the first signs of the disaster that, within minutes, plunged this region into darkness. We are driving into Wadir, a village in Nurgal District, where everyone we meet has lost someone. The earthquake, which struck around midnight, killed many in their sleep here, especially women and children. Standing by a makeshift graveyard peppered with white flags and gravestones, we meet little Rahmanullah. He's eight but looks much younger, and his glassy eyes look heavy with grief. His fragile, tiny hands point to the grave where his six-year-old brother Abouzar is buried. He was sleeping alongside him. The only reason Rahmanullah survived was because his older sibling, Saied Rahman, was able to pull him out. \n                  Taliban internet blackout has created an extreme scenario in Afghanistan with far-reaching consequences\n                 \n                  Internet blackout across Afghanistan in Taliban crackdown\n                 \n                  Afghanistan internet ban 'extinguishing the only light that still reaches us'\n                 \"I was asleep when I heard a crash,\" Rahmanullah tells me. \"My brother said 'it's an earthquake, get up, or the building will fall on you'. \"He took my hand and pulled me out, put me on some wood, and said, 'get out quick'.\" Rahmanullah takes us up a steep hill to show us what remains of his home. On the edge of a vast drop, it is now a mound of rubble - only a broken bed and shoes left behind. The earthquake killed some 2,000 people and was one of the worst Afghanistan has seen. And it came at an already desperate time for Afghans - with an economic crisis, rising unemployment, drought and malnutrition. In Afghanistan, there has been a seemingly endless cycle of hunger and displacement. Compounding those problems since the Taliban took control in 2021, aid has dropped off a cliff. This year, the US cut almost all of its funding to the country, and it's had a massive impact. The demise of the US Agency for International Development this year has forced the closure of 400 health facilities and left hundreds of thousands of Afghans without consistent access to food. Nearly everyone we spoke to in this region praised the speed and effectiveness of the Taliban response - the government sending in helicopters to evacuate the injured and the dead. White tents have sprouted up next to each affected village too - a sign international aid was able to get to these far-flung communities against the odds. But winter is coming, and sickness is starting to spread. In Andarlackhak, we meet Ajeebah. She's keen to speak to us in private, in the tent she now calls home. She married at 10 years old and went on to have 10 children. But five of them died in the quake - three-year-old Shabhana, seven-year-old Wali Khan, nine-year-old twins Razimah and Nasreen, and 13-year-old Saleha. Their mother is clearly still processing the immense, almost unimaginable loss. \"I don't want to bury them. What could I do?\" she says. \"I can't keep them outside. But I don't want to put them in a graveyard.\" Outside, dozens of children are playing, many orphaned by the disaster. Read more from Cordelia Lynch:The red pill explosion fuelling a secret detox ritualWhy many in Vietnam now have a positive view of Americans Malnutrition is a major issue in Afghanistan and keeping these children fed will be an overwhelming burden in the months ahead. With women unable to work under the Taliban and a struggling economy, families were already in dire straits. Mohammad Salem, who's 45, has injured his foot. And he's deeply worried about the months ahead. \"We don't have anything for winter,\" he said. \"The snow is coming, and our children are living in tents. \"They're lying in the dirt. We don't have any shelter for the future. Everything we had is destroyed.\" The Taliban forbids physical contact between men and women who are not family members, even in emergencies. That raised fears some women would be left without help. However, the villagers we spoke to praised the rescue efforts and said female aid workers were able to reach them. But what hangs over every community in these deep and now scarred valleys is the fear of the hardships to come and the realisation that their communities, their families, have been changed forever."
    },
    {
        "title": "One dead and several injured after 'savage' Russian drone strike on Ukrainian railway station, Zelenskyy says",
        "description": "At least one person has died, and several others injured, in a Russian drone strike on a Ukrainian railway station, the country's state emergency services has said.",
        "url": "https://news.sky.com/story/at-least-30-injured-after-savage-russian-drone-strike-on-ukrainian-railway-station-zelenskyy-says-13444010",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-strike-train-ukraine_7041132.png?20251004134534",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-04 09:32:00",
        "Headline": "The strike on the railway station and train comes a day after what officials described as the biggest attack on Ukraine's natural gas facilities since Russia's land, air and sea invasion started in February 2022.",
        "Content": " At least one person has died, and several others injured, in a Russian drone strike on a Ukrainian railway station, the country's state emergency services has said. Two trains were hit when Shostka station, in the Sumy region, was targeted on Saturday, the head of Ukraine's railways, Oleksandr Pertsovskyi, said in a Facebook post. Earlier, Ukrainian President Volodymyr Zelenskyy described the attack as \"savage\". He said there were at least 30 victims, but this number was revised by Ukraine's state emergency services. It said one person died and seven people, including three children, were injured in the attack. Local prosecutors said the person who had died was a 71-year-old man who was found in one of the train carriages. \"In the Shostka community, the enemy attacked a railway station, causing one of the passenger cars to catch fire. \"While extinguishing the fire, rescuers came under repeated fire, but fortunately none of them were injured,\" the emergency services said. \n                  Sky News joins NATO air patrol designed to deter Russia from pushing boundaries\n                 \n                  Germany should 'get power to shoot down drones', official says - as Vladimir Putin denies involvement in airspace violations\n                 \n                  Princess Anne makes surprise Ukraine visit - and leaves a personal tribute\n                 It said the fire caused by the attack was eventually extinguished. Sumy regional governor Oleh Hryhorov said a train heading to Kyiv had been hit and that medics and rescuers were working on the scene. Mr Zelenskyy and the governor posted pictures from the scene that show a passenger carriage on fire. The head of the local district administration, Oksana Tarasiuk, told Ukraine's public broadcaster the strikes were a \"despicable attack aimed at stopping communication with our frontline communities\". While Mr Zelenskyy's top aide, Andriy Yermak, accused Russia of deliberately targeting the station and train, saying it was carrying out a \"war against civilians\". Moscow has stepped up its air strike campaign on Ukraine's railway infrastructure, hitting it almost every day over the last two months. Read more from Sky News:Why Trump accepted the Hamas peace plan responseJapan set for first female prime minister They have also targeted energy infrastructure with a massive bombardment on Ukraine's gas production facilities earlier this week. Overnight into Saturday, Russian drones and missiles pounded Ukraine's power grid, a Ukrainian energy firm said. The strike damaged energy facilities near Chernihiv, a northern city west of Shostka that lies close to the Russian border, and sparked blackouts set to affect some 50,000 households, according to regional operator Chernihivoblenergo. On Friday, Ukraine's natural gas facilities run by the state-owned Naftogaz Group suffered the biggest attack since the war started in February 2022. Russia fired a total of 381 drones and 35 missiles at Ukraine on Friday, according to Ukraine's air force, in what officials said was an attempt to wreck the Ukrainian power grid ahead of winter."
    },
    {
        "title": "Nearly 500 arrested in London as pro-Palestine protest goes ahead despite pleas",
        "description": "Nearly 500 people have been arrested over protests supporting the proscribed group Palestine Action, as demonstrators defied calls to reconsider in the wake of the Manchester synagogue terror attack.",
        "url": "https://news.sky.com/story/nearly-500-arrested-in-london-as-pro-palestine-protest-goes-ahead-despite-pleas-13444490",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-gaza-protest-palestine_7041184.jpg?20251004140249",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-04 16:11:00",
        "Headline": "Two days after the synagogue attack in Manchester, hundreds of people gathered in London's Trafalgar Square to call on the government to reverse the ban on the proscribed group Palestine Action.",
        "Content": " Nearly 500 people have been arrested over protests supporting the proscribed group Palestine Action, as demonstrators defied calls to reconsider in the wake of the Manchester synagogue terror attack. Two days after the attack in Crumpsall, crowds of people gathered in central London on Saturday to call on the government to reverse the ban on the proscribed group. Organisers of the protest, Defend Our Juries, said 1,000 people attended the event to \"oppose genocide and the Palestine Action ban\". The Metropolitan Police said 492 people had been arrested, with the youngest being 18 and the eldest 89. The force said 297 remain in custody and the rest have been bailed. Before the demonstration even began, six people were arrested for unfurling banners which read \"I oppose genocide\" and \"I support Palestine Action\" on Westminster Bridge. The bulk of the arrests were made in Trafalgar Square, where protesters held placards showing their support for Palestine Action, which was added to the UK's list of proscribed terrorist groups in July. The Met said a different group of protesters also gathered in Whitehall before trying to make their way to Trafalgar Square.  Many of those arrested throughout the day were older individuals. Pictures showed people with walking sticks or in wheelchairs being supported by police, while others were physically carried to a processing pen after failing to cooperate with officers. One protester, 62-year-old Mike Higgins, who is blind and uses a wheelchair, told the PA news agency: \"We are going to win this battle, by the way, there's no doubt about that. The problem for me is that I want to win it now to try and bring an end to the suffering in Palestine.\" The Metropolitan Police had urged the Defend Our Juries group to postpone the event in light of the synagogue attack. Chief of the Metropolitan Police, Sir Mark Rowley, said he was worried resources would be stretched and the ability of the force to protect communities would be compromised as a result of the protest. In a statement on X on Saturday morning, Sir Keir Starmer also said anyone thinking of protesting should \"recognise and respect the grief of British Jews\", while Jewish figures called the action \"phenomenally tone deaf\". In a letter to Ade Adelekan, the deputy assistant commissioner of the Metropolitan Police, Defend Our Juries said the protest would continue as planned as \"the protection of our democracy and the prevention of countless deaths are critical issues\". Read more:Tributes to 'kind and heroic' victims of Manchester attackWhat we know about Manchester attacker The controversial decision drew criticism from policing minister Sarah Jones, who said many of those attending the event \"want to be arrested, that is their aim\". She said: \"We believe in people's rights to protest. This protest here in London is a different order of event because people are supporting a proscribed organisation and the police have to step in, in that case.\" A similar event held by the group, Greater Manchester Friends of Palestine, took place earlier on Saturday in Manchester. Instead of marching in support of Palestine Action, the event was to \"honour the names of Palestinian children brutally killed by Israel in Gaza\". A crowd of around 100 pro-Palestinian supporters gathered outside the city's Cathedral to listen to speakers before moving en masse to St Peter's Square. People were heard chanting \"Free Palestine!\" while a small group of counter-protesters marched in front shouting \"release the hostages\". Greater Manchester Police (GMP) did not say if any arrests were made.  Away from the protests, GMP said four of the six people arrested in connection to the synagogue terror attack will remain in custody for up to another five days. The force said the custody extension applies to two men, aged 30 and 32, and two women, aged 61 and 46. An 18-year-old woman and a 43-year-old man have been released and will face no further action. GMP said all six people had been arrested on suspicion of commission, preparation and instigation of acts of terrorism."
    },
    {
        "title": "The crucial issues that could destroy efforts for peace in Gaza",
        "description": "The speed with which the diplomacy is moving is dizzying but the question remains whether or not it will lead to concrete developments, or instead become mired in quicksand like so many previous peace processes in the Middle East.",
        "url": "https://news.sky.com/story/radioactive-issues-could-still-derail-gaza-ceasefire-despite-momentum-for-peace-13444095",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-gaza-israel-hamas-trump_7041047.jpg?20251004130237",
        "type": "World",
        "Author": "Alex Rossi",
        "Date Published": "2025-10-04 12:07:00",
        "Headline": "Hamas has responded to Donald Trump's peace plan and says it agrees to release all remaining Israeli hostages being held in Gaza.",
        "Content": "\n          International correspondent\n              @alexrossiSKY\n  The speed with which the diplomacy is moving is dizzying but the question remains whether or not it will lead to concrete developments, or instead become mired in quicksand like so many previous peace processes in the Middle East. I think the first thing is to be clear that within what's referred to as Trump's peace plan there are essentially two component parts. The first bit is about achieving a ceasefire and bringing back the hostages, the second is about achieving a comprehensive peace in the wider region and the distant prospect of Palestinian statehood. Read more: Gaza latest as world leaders welcome Hamas response It goes without saying that ushering in a ceasefire, while not easy, is far more achievable than resolving the Israel-Palestine conflict completely. But what is clear is that this is a significant moment. What we do know is that Hamas has said it will accept parts of the plan. \n                  Gunfire and explosions followed by unsettling silence: Sky News reports from inside Gaza City\n                 \n                  Trump gives Hamas fresh ultimatum as he says confirmation of deal would trigger immediate ceasefire\n                 \n                  Trump tells Israel 'stop bombing Gaza' - as Hamas agrees to release Israeli hostages, and to parts of peace deal \n                 It means there's now real momentum building around the proposal.  After nearly two years of intense and devastating fighting, the region could finally be moving towards a lasting ceasefire - possibly very soon - along with the release of the remaining hostages. In many ways Hamas had no choice but to accept the deal - it was under extreme pressure, not just from the US but also Arab countries. However the statement issued by the group has a number of caveats and it's unclear whether the US and, to a certain extent Israel, will tolerate any real substantive negotiations. Senior Hamas sources have already said it's unrealistic that the hostages can be released in the next 72 hours: there are too many things - like where exactly the Israeli forces withdraw to - that need to be resolved. Another key issue that stands out is that of disarmament. Hamas's statement avoids any promise to give up its weapons, even though the plan demands it. For Israel and the United States, that's non-negotiable. Hamas also knows that once it's released the hostages it has little if any leverage at all and effectively this deal relies on them trusting the word of Donald Trump - a big ask. And these are just the bits to get to the ceasefire. On the wider issues Trump's twenty-point plan may be ambitious but it is also vague. It leaves many questions unanswered about borders, reconstruction, governance, and security as well as Palestinian self-determination. All radioactive issues that have destroyed previous efforts for peace. Real progress going forward will depend on detailed negotiations and genuine good faith from all sides, something that's often been missing. Even so, there have already been some striking developments. For the first time, a US president has commanded Israel to halt its bombing of Gaza, and the Israeli military has reportedly shifted into a defensive stance.  It's a remarkable display of how Trump's personal influence and power is reshaping the course of this war. For now then, this looks like the beginning of the end of active fighting, but not yet a comprehensive peace. It may though be the closest the region has come in years to something that could lead that to that destination."
    },
    {
        "title": "Why Trump accepted the Hamas peace plan response",
        "description": "We are in the endgame. Nearly exactly two years since the Hamas attacks of 7 October 2023, it looks like we are on the brink of a breakthrough.",
        "url": "https://news.sky.com/story/if-hamas-and-israel-agree-on-a-peace-deal-it-will-be-donald-trumps-success-13443923",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-gaza_7040790.jpg?20251004044430",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-10-04 03:20:00",
        "Headline": "The diplomacy of the past 12 hours has been head-spinning and uniquely Trumpian. It is the consequence of his unorthodox style, his ability to call the shots and crucially his willingness to do so now.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  We are in the endgame. Nearly exactly two years since the Hamas attacks of 7 October 2023, it looks like we are on the brink of a breakthrough. The diplomacy of the past 12 hours has been head-spinning and uniquely Trumpian. Assuming everything holds, this is Donald Trump's success. It is the consequence of his unorthodox style, his ability to call the shots and crucially his willingness to do so now. The tragedy is that it could have happened many months ago. But that doesn't make it any less significant a moment now. Word came from Hamas late afternoon on Friday Washington time that the group had responded to Mr Trump's 20-point plan for peace in Gaza, which he unveiled at the White House on Monday. Follow live updates on developments throughout the day  Within minutes, the US president had posted the Hamas response on his own social media. It was clear from the wording of the Hamas statement that it was by no means an unequivocal acceptance of the 20-point plan. But then, via his press secretary, again on social media, a clear indication that the US president was reading the Hamas statement as an acceptance of his deal even though, in black and white, it falls short of that. \"President Trump responds to Hamas' acceptance of his Peace Plan,\" Karoline Leavitt wrote. Hamas had basically said \"yes, but\" to Mr Trump's 20-point plan, and yet intriguingly Mr Trump was choosing to take it as an acceptance of his plan. Then, moments later, the president spelt it out, again on social media, and with game-changing demands - not for Hamas, but for Israel. A remarkable statement \"Based on the Statement just issued by Hamas, I believe they are ready for a lasting PEACE. Israel must immediately stop the bombing of Gaza, so that we can get the Hostages out safely and quickly! Right now, it's far too dangerous to do that. We are already in discussions on details to be worked out. This is not about Gaza alone, this is about long sought PEACE in the Middle East.\" This was a remarkable statement and represents a huge moment. Neither Mr Trump, nor Joe Biden before him, has ever asked this of Israel before. The American president was telling Israel to stop; to stand its military down and to bring this war to an end. Extraordinary. Read more:Sky News investigation reveals Israel's support for Gaza militiaPraise and fury for Trump's Gaza peace deal For the first time in this two-year war, Israeli Prime Minister Benjamin Netanyahu is in a corner. President Trump has put him there. Mr Trump and his team know that the Hamas response does not yet commit to disarmament and it does not yet agree to fully disband - both conditions of the 20-point plan. But Hamas does commit to releasing all the hostages now. And for Mr Trump, who wants this over, that's enough. The word from Israel overnight is that Mr Netanyahu did not expect the US president to take this position because he sees the Hamas response as a rejection of the 20-point plan. On Monday, Mr Netanyahu said Mr Trump was the best friend Israel had ever had. But Mr Trump is not an ideologue. He is pragmatic, he is a deal-maker, he wants to further his Abraham Accords, he wants to be a winner, and he wants the Nobel Peace Prize. He can also see where the chips are falling. His 20-point plan has unanimous support across Europe and among Muslim majority countries, which all seem to accept that Hamas as an organisation is over. Israeli attack on Hamas in Qatar was pivot point Public opinion is also a factor. The number of Americans with an unfavourable view of Israel and its Gaza policy has been steadily rising. President Trump's own view of Mr Netanyahu's Israel has also evolved. The two men have never actually been close. And the Israeli attack on Hamas negotiators in Qatar last month really angered Mr Trump and his advisors. They saw it as a clear undermining of the Gaza negotiations. It was a pivot point for Mr Trump. The diplomacy behind the scenes, through the Qatari government mediators and others, has been intense, particularly this past week. The challenge has been to persuade the military wing of Hamas, in Gaza, to get to the position outlined in their statement.  Mr Trump's Middle East envoy, Steve Witkoff, told me on Monday: \"I am hopeful, I really am. All the stakeholders in this want to see it happen and the president believes it is going to happen and he is dug in.\" I was sceptical. Maybe I was wrong to be. Still, there are huge immediate challenges in the hours and days ahead. But the overnight news that the Israeli Defence Forces have shifted to defensive operations is a huge development. There is a genuine momentum for peace right now. This could be the moment."
    },
    {
        "title": "Japan set for first female prime minister",
        "description": "Japan could be about to have its first female prime minister, as a woman is elected leader of the governing party. ",
        "url": "https://news.sky.com/story/japan-set-for-first-female-prime-minister-13443998",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sanae-takaichi-liberal-democratic-party_7040883.jpg?20251004101013",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-04 09:02:00",
        "Headline": "Ms Takaichi was a heavy metal drummer, but said she has thrown away her work-life balance, and \"will work, work, work\" with Margaret Thatcher her hero. ",
        "Content": "Japan could be about to have its first female prime minister, as a woman is elected leader of the governing party.  Sanae Takaichi has been selected as the head of the conservative Liberal Democratic Party (LDP). The LDP is Japan's governing party, and the largest in its House of Representatives, which selects the national leader. The result is particularly notable as the country scores low on gender equality measures. Gaza latest: Trump tells Israel to 'stop bombing Gaza' It scores lowest in the G7 group of industrialised nations in the World Economic Forum's latest global gender gap report, ranking 118 out of 148 countries. Ms Takaichi was the only woman in the contest and won on a platform of cutting taxes and increasing subsidies. \n                  Japan could be hours away from running out of Asahi\n                 \n                  Japan's prime minister Shigeru Ishiba resigns\n                 \n                  Elderly woman conned by romance scammer posing as stranded astronaut\n                 Her campaign also involved populist promises such as cracking down on rule-breaking visitors and immigrants. The first official campaign speech began with a story about tourists reportedly kicking sacred deer in her hometown of Nara. Visitor numbers to the island have reached record highs in recent years. What next? Japan could have its first female leader as soon as 15 October when a parliamentary vote is expected. Split opposition parties mean it's likely LDP's candidate will be chosen. Gender equality could be boosted as Ms Takaichi promised to form a cabinet with women's representation \"not particularly lower than Nordic countries\". Nordic countries are typically ranked highly for gender equality. \"I wouldn't appoint women just because they're women,\" Ms Takaichi said. \"But the plan is to pick far more women who are capable and willing to serve the nation.\" Just 10% of outgoing prime minister Shigeru Ishiba's 20 cabinet members are women. Who is Sanae Takaichi? Ms Takaichi has said Britain's first female prime minister Margaret Thatcher is her hero. She played drums in a heavy metal band while at university but said in her victory speech she has \"thrown away my own work-life balance and I will work, work, work\"."
    },
    {
        "title": "Trump says Gaza ceasefire will begin 'immediately' when Hamas confirms deal",
        "description": "Donald Trump has said a ceasefire in Gaza will begin \"immediately\" after Hamas agrees to a new US plan to end the war.",
        "url": "https://news.sky.com/story/trump-says-gaza-ceasefire-will-begin-immediately-when-hamas-confirms-deal-13444804",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-us-president_7042203.jpg?20251004220833",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-04 19:18:00",
        "Headline": "The US president has said Israel has \"agreed to the initial withdrawal line\" and \"when Hamas confirms\", the ceasefire will start, Israeli hostages will be released and a prisoner exchange will begin.",
        "Content": " Donald Trump has said a ceasefire in Gaza will begin \"immediately\" after Hamas agrees to a new US plan to end the war. The US president said Israel had \"agreed to the initial withdrawal line\" and \"when Hamas confirms\", the ceasefire will start, Israeli hostages will be released and a prisoner exchange will begin. In a post on his Truth Social platform, Mr Trump said it would \"create the conditions for the next phase of withdrawal, which will bring us close to the end of this 3,000-year catastrophe\". It came as Hamas accused the Israeli government of lying about reducing its military operations, accusing it of continuing to \"commit its horrific crimes and massacres\" against Palestinians in Gaza, claiming 70 people had been killed by strikes since Saturday morning. The group said it \"exposes the false claims of the war criminal Netanyahu's government regarding scaling back military operations against defenceless civilians\". It comes after Israeli Prime Minister Benjamin Netanyahu has said he hopes to announce the release of all hostages from Gaza \"in the coming days\".  Mr Netanyahu made the remarks as indirect talks with Hamas continue in Egypt on a new US plan to end the war. Speaking after Hamas said it had accepted some elements of the plan, Mr Netanyahu said he had sent the delegation to Egypt \"to finalise technical details\", adding that \"our goal is to contain these negotiations to a timeframe of a few days\". Donald Trump has welcomed Hamas's statement, but on Saturday warned the group \"must move quickly, or else all bets will be off\". Read more:Why Trump accepted the Hamas peace plan responseSky News investigation reveals Israel's support for Gaza militia  Trump orders Israel to stop bombing Gaza Earlier in the day, Israel's army said the country's leaders had instructed it to prepare for the first phase of the US plan to end the war in Gaza. Israel has moved to a defensive-only position in Gaza and will not actively strike, one official said, adding that no forces have been removed from the territory. It came hours after Mr Trump ordered Israel to stop bombing Gaza after Hamas said it accepted some elements of his plan.  What's in the peace plan? Mr Trump's proposed plan to end the war has widespread international support and on Friday, Mr Netanyahu's office said Israel was committed to bringing the conflict to an end. Under the plan, Hamas would release the remaining 48 hostages, of which around 20 are believed to still be alive, within three days. It would also give up power in Gaza and disarm. In return, Israel would end its offensive and withdraw from much of Gaza, as well as release hundreds of Palestinian prisoners and allow an influx of humanitarian aid and eventual reconstruction. Hamas has said it is willing to release the hostages and hand over power to other Palestinians, but argued other aspects of the plan require further consultations among Palestinians. Its statement did not address the issue of Hamas demilitarising, which is a key part of the deal. Warning 'extremists on both sides' could sabotage peace plan A group representing some families of hostages said the prospect of seeing their loved ones return \"has never been closer\" and they appealed to Mr Trump to keep pushing \"with full force\". They warned \"extremists on both sides\" would try to sabotage the plan. The war began when Hamas attacked Israel on 7 October 2023, killing 1,200 people and taking 251 hostage. Since then, at least 67,000 Palestinians have been killed in Israel's war with Hamas in Gaza, according to the enclave's Hamas-run health ministry, which does not differentiate between civilians and combatants in its count, but says women and children make up around half of the dead."
    },
    {
        "title": "Why Trump accepted the Hamas peace plan response",
        "description": "We are in the endgame. Nearly exactly two years since the Hamas attacks of 7 October 2023, it looks like we are on the brink of a breakthrough.",
        "url": "https://news.sky.com/story/if-hamas-and-israel-agree-on-a-peace-deal-it-will-be-donald-trumps-success-13443923",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-gaza_7040790.jpg?20251004044430",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-10-04 03:20:00",
        "Headline": "The diplomacy of the past 12 hours has been head-spinning and uniquely Trumpian. It is the consequence of his unorthodox style, his ability to call the shots and crucially his willingness to do so now.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  We are in the endgame. Nearly exactly two years since the Hamas attacks of 7 October 2023, it looks like we are on the brink of a breakthrough. The diplomacy of the past 12 hours has been head-spinning and uniquely Trumpian. Assuming everything holds, this is Donald Trump's success. It is the consequence of his unorthodox style, his ability to call the shots and crucially his willingness to do so now. The tragedy is that it could have happened many months ago. But that doesn't make it any less significant a moment now. Word came from Hamas late afternoon on Friday Washington time that the group had responded to Mr Trump's 20-point plan for peace in Gaza, which he unveiled at the White House on Monday. Follow live updates on developments throughout the day  Within minutes, the US president had posted the Hamas response on his own social media. It was clear from the wording of the Hamas statement that it was by no means an unequivocal acceptance of the 20-point plan. But then, via his press secretary, again on social media, a clear indication that the US president was reading the Hamas statement as an acceptance of his deal even though, in black and white, it falls short of that. \"President Trump responds to Hamas' acceptance of his Peace Plan,\" Karoline Leavitt wrote. Hamas had basically said \"yes, but\" to Mr Trump's 20-point plan, and yet intriguingly Mr Trump was choosing to take it as an acceptance of his plan. Then, moments later, the president spelt it out, again on social media, and with game-changing demands - not for Hamas, but for Israel. A remarkable statement \"Based on the Statement just issued by Hamas, I believe they are ready for a lasting PEACE. Israel must immediately stop the bombing of Gaza, so that we can get the Hostages out safely and quickly! Right now, it's far too dangerous to do that. We are already in discussions on details to be worked out. This is not about Gaza alone, this is about long sought PEACE in the Middle East.\" This was a remarkable statement and represents a huge moment. Neither Mr Trump, nor Joe Biden before him, has ever asked this of Israel before. The American president was telling Israel to stop; to stand its military down and to bring this war to an end. Extraordinary. Read more:Sky News investigation reveals Israel's support for Gaza militiaPraise and fury for Trump's Gaza peace deal For the first time in this two-year war, Israeli Prime Minister Benjamin Netanyahu is in a corner. President Trump has put him there. Mr Trump and his team know that the Hamas response does not yet commit to disarmament and it does not yet agree to fully disband - both conditions of the 20-point plan. But Hamas does commit to releasing all the hostages now. And for Mr Trump, who wants this over, that's enough. The word from Israel overnight is that Mr Netanyahu did not expect the US president to take this position because he sees the Hamas response as a rejection of the 20-point plan. On Monday, Mr Netanyahu said Mr Trump was the best friend Israel had ever had. But Mr Trump is not an ideologue. He is pragmatic, he is a deal-maker, he wants to further his Abraham Accords, he wants to be a winner, and he wants the Nobel Peace Prize. He can also see where the chips are falling. His 20-point plan has unanimous support across Europe and among Muslim majority countries, which all seem to accept that Hamas as an organisation is over. Israeli attack on Hamas in Qatar was pivot point Public opinion is also a factor. The number of Americans with an unfavourable view of Israel and its Gaza policy has been steadily rising. President Trump's own view of Mr Netanyahu's Israel has also evolved. The two men have never actually been close. And the Israeli attack on Hamas negotiators in Qatar last month really angered Mr Trump and his advisors. They saw it as a clear undermining of the Gaza negotiations. It was a pivot point for Mr Trump. The diplomacy behind the scenes, through the Qatari government mediators and others, has been intense, particularly this past week. The challenge has been to persuade the military wing of Hamas, in Gaza, to get to the position outlined in their statement.  Mr Trump's Middle East envoy, Steve Witkoff, told me on Monday: \"I am hopeful, I really am. All the stakeholders in this want to see it happen and the president believes it is going to happen and he is dug in.\" I was sceptical. Maybe I was wrong to be. Still, there are huge immediate challenges in the hours and days ahead. But the overnight news that the Israeli Defence Forces have shifted to defensive operations is a huge development. There is a genuine momentum for peace right now. This could be the moment."
    },
    {
        "title": "WSL Football bosses hire Goldman to kick off financing review",
        "description": "Football chiefs are to bring in Wall Street's best-known investment bank to explore options for financing the growth of women's football in England.",
        "url": "https://news.sky.com/story/wsl-football-bosses-hire-goldman-to-kick-off-financing-review-13443987",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-manchester-united-maya-le-tissier_7040868.jpg?20251004094811",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-04 08:37:00",
        "Headline": "The board of English women's football's top two divisions is bringing in the Wall Street giant Goldman Sachs to examine options to fund the growth of the sport, Sky News can reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Football chiefs are to bring in Wall Street's best-known investment bank to explore options for financing the growth of women's football in England. Sky News has learnt that the board of the WSL are close to hiring Goldman Sachs to evaluate opportunities for raising new funding. The project is at a very early stage, with further details on the potential outcome unclear this weekend. The possibility of selling a stake in the WSL and the rebranded Championship - now known as WSL2 - has been explored in the past, and could be reviewed again as executives seek to capitalise on the sport's profile. The England women's team made history during the summer by retaining their European Championships title after a penalty shootout in the final against Spain. In the last few months, both Chelsea and West Ham United have sold stakes in their women's teams to external investors, with the former striking a deal with the husband of former tennis superstar Serena Williams. Read more:Baroness Mone: I have no wish to rejoin Lords as Conservative peerReeves seeks outsider to run Britain's banking watchdog \n                  Ex-Arsenal academy player Billy Vigar dies from 'significant brain injury' suffered playing for Chichester City\n                 \n                  New football watchdog to hold first summit despite European clubs clash\n                 \n                  England star Alessia Russo teams up with Sky in push to get more girls into playing football\n                 Deloitte, the accountancy firm which has been involved in a string of prominent recent sports deals, including the sale of stakes in the eight Hundred cricket franchises, is also said to be being lined up to work with the WSL Football board. A WSL Football spokesman told Sky News: \"Like any responsible business with ambition, WSL Football is working in collaboration with member clubs to explore long-term growth strategies that can accelerate the positive momentum within the women's game.\" The spokesman declined to comment on the involvement of Goldman Sachs or Deloitte. News of the review comes with the WSL and WSL2 seasons well under way. On Friday night, Chelsea surrendered their 100% record at the top of the WSL when Manchester United came from behind to draw with the Londoners. In the WSL2, Birmingham City and Charlton Athletic lead the race for promotion to the top tier. The WSL Football board, which is chaired by media veteran Dawn Airey and run by chief executive Nikki Doucet, has secured a string of lucrative commercial and broadcast partnerships in the last 12 months. These have included deals with British Gas and Nike, as well as a three-year title sponsorship extension with Barclays. On the broadcast front, it struck a record £65m domestic TV rights agreement with Sky Sports - which shares a parent company with Sky News - and the BBC. According to Deloitte's annual review of football finance, the 12 WSL clubs generated aggregate revenue of £65m in 2023-24, a 34% increase on the prior season's figure of £48m. This rise was, according to the report, driven by revenue growth at Arsenal and Chelsea, although every top-flight club recorded double-digit increases in total revenue. In attendance terms, WSL's average and cumulative crowds in 2024-25 were slightly down, but this was offset by increases in attendances at second-tier matches, meaning that across the two divisions, last season was flat with an overall cumulative attendance of just over 1.1 million. The impending appointment of Goldman comes four-and-a-half years after rival investment bank Rothschild was hired to undertake a similar review, with the sale of a stake to private equity investors under consideration for months before being abandoned. Goldman Sachs declined to comment."
    },
    {
        "title": "French air traffic controllers call off strike - sparing disruption for thousands of travellers",
        "description": "French air traffic controllers have called off their upcoming strikes, sparing travellers across Europe from disruption. ",
        "url": "https://news.sky.com/story/french-air-traffic-controllers-call-off-strike-sparing-disruption-for-thousands-of-travellers-13444182",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-istock-uk-eu-gates_6921373.jpg?20250519121550",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-04 13:06:00",
        "Headline": "The strikes could have meant 600 flights were cancelled a day, impacting 100,000 passengers, Europe's largest airline said. ",
        "Content": "French air traffic controllers have called off their upcoming strikes, sparing travellers across Europe from disruption.  The SNCTA (syndicat majoritaire des controleurs aeriens) union said it was halting its forthcoming industrial action from Tuesday to Thursday, 7 to 9 October, following agreements and the French prime minister's postponement of the French finance bill parliamentary debate. The union has pushed for better pay and conditions. Travellers across the UK were expected to face disruption from the industrial action - as stoppages by French air traffic staff mean flights over the country are rerouted or cancelled. The head of Europe's biggest airline estimated the latest strikes could have meant 100,000 passengers had their flights cancelled, equating to about 600 flights a day. Read more:Baroness Mone: I have no wish to rejoin Lords as Conservative peerReeves seeks outsider to run Britain's banking watchdog The UK would be particularly impacted, Ryanair's chief executive Michael O'Leary said. \n                  Airlines furious after another technical glitch cancels flights\n                 \n                  Boeing passenger jet catches fire after engine fault forces American Airlines flight to divert to Denver\n                 \n                  Plane makes emergency landing after pilot dies on Turkish Airlines flight\n                 \"The UK is the country whose flights get cancelled most because of the geographic proximity to France.\" The airline has long campaigned for flights across French airspace to be protected amid walkouts, saying failure to do so was a breach of European Union laws. Journeys to and from France should be impacted rather than trips for UK passengers heading to popular destinations in Spain and Greece, the airline has said. French air traffic controllers also staged walkouts in July in their quest for better pay and conditions. Due to this action, Ryanair said it axed 170 services and EasyJet said it cancelled 274 flights."
    },
    {
        "title": "Reeves seeks outsider to run Britain's banking watchdog",
        "description": "Rachel Reeves, the chancellor, is seeking a heavyweight outsider to run Britain's main banking watchdog, with a senior Barclays executive expected to be among the top contenders for the job.",
        "url": "https://news.sky.com/story/reeves-seeks-outsider-to-run-britains-banking-watchdog-13443978",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-conference-rachel-reeves_7035694.jpg?20250929073647",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-04 08:18:00",
        "Headline": "Katharine Braddick, a senior Barclays executive, is a potential candidate to head the Prudential Regulation Authority as the chancellor prepares to kick off a search within days, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Rachel Reeves, the chancellor, is seeking a heavyweight outsider to run Britain's main banking watchdog, with a senior Barclays executive expected to be among the top contenders for the job. Sky News has learnt that the Treasury is to advertise the post of chief executive of the Prudential Regulation Authority (PRA), which oversees financial services firms such as banks and insurers, within days. One source said the recruitment process could kick off as early as next week. The process, which will run for several months, will lead to the appointment of a successor to Sam Woods, a long-serving official who has served two terms in the role. This weekend, it emerged that Katharine Braddick, a former senior Treasury civil servant who joined Barclays in 2022, is expected to be among the applicants for the role. Whitehall insiders said Ms Braddick would be a strong contender for the post if she decided to apply. Read more:Baroness Mone: I have no wish to rejoin Lords as Conservative peer \n                  Farage and Tice right to scrutinise one of Bank of England's most radical monetary experiments in history\n                 \n                  The big story from Bank of England is an easing in tightening to avert massive losses\n                 \n                  Bank of England leaves interest rate unchanged and slows quantitative tightening \n                 A former director-general, financial services at the Treasury, Ms Braddick has been Barclays' group head of strategic policy and advisor to the bank's chief executive for three-and-a-half years. Prior to the Treasury, she worked at the Financial Services Authority and was heavily involved in political negotiations on financial services legislation relating to Brexit. Barclays declined to comment on Ms Braddick's behalf on Saturday. In response to an enquiry from Sky News, a Treasury spokesperson said: \"Growing the economy is the Chancellor's number one mission. \"Every regulator has a part to play by regulating for growth not just risk.\" The chancellor is said to be keen to identify candidates from outside Britain's existing regulatory set-up to head the PRA. A small number of internal candidates is thought to include David Bailey, the Bank of England's executive director for prudential policy. Ms Reeves's apparent desire for an outsider comes amid a wider push for Britain's economic watchdogs to remove red tape and reorient themselves towards growth-focused policies. Earlier this year, Nikhil Rathi, chief executive of the Financial Conduct Authority, was appointed to a second term in charge following intensive discussions about the body's five-year strategy. Since then, both the FCA and PRA have removed rules relating to diversity and inclusion in the financial sector, while the former abandoned a plan to 'name and shame' companies which were the subject of enforcement investigations. The Payment Systems Regulator (PSR) was abolished earlier this year as part of the government's drive to reduce unnecessary regulation. The search for the next PRA boss will get underway less than two months before the chancellor delivers an autumn Budget in which she is expected to have to raise tens of billions of pounds through additional tax rises. Mr Woods' next move will be closely watched in the City. He has been seen as a potential candidate to succeed Andrew Bailey when the Bank of England governor's term runs out in 2028, although it is unclear whether he covets the job. As CEO of the PRA, Mr Woods is also a deputy governor of the Bank of England, a member of the Bank's Court of Directors, and a director of the FCA. The chancellor has shown a willingness to recruit from outside the Treasury, appointing Bank of America investment banking veteran Jim O'Neil as second permanent secretary to the Treasury earlier this year. Mr O'Neil had also served as the head of UK Financial Investments, the agency set up to manage taxpayers' stakes in Britain's bailed-out banks."
    },
    {
        "title": "A subdued Tory conference could be a chance for Badenoch to turn her fortunes around - but will she?",
        "description": "Conservative Party conferences of old were packed out events bustling with ministers, MPs, lobbyists and members.",
        "url": "https://news.sky.com/story/a-subdued-tory-conference-could-be-a-chance-for-badenoch-to-turn-her-fortunes-around-but-will-she-13442956",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kemi-badenoch-immigration_7041947.jpg?20251004184928",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-10-04 23:01:00",
        "Headline": "It is the first Conservative autumn conference with Kemi Badenoch as leader.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Conservative Party conferences of old were packed out events bustling with ministers, MPs, lobbyists and members. Roll on just over a year after their biggest defeat ever, and the Tories' gathering in Manchester, from 5-8 October, will be a more sober affair. Despite their recent loss, last year's conference was anything but subdued as it was turned into a hustings for their new leader to replace Rishi Sunak. Cue: a bit of a bun fight. A month later, Kemi Badenoch was crowned leader. So this conference not only marks a year after that abysmal result but also nearly a year of Ms Badenoch in charge. A series of policy announcements are expected throughout the conference, with the first today being an eye-catching vow to create an ICE-style \"removals force\" to tackle illegal immigration to the UK, which follows her pledge to leave the European Convention on Human Rights (ECHR). \"Stronger borders\" is one of the two key themes of this conference, along with \"stronger economy\" - slogans set to feature on banners throughout the conference venue. It is part of her bid to scrape back her party's position in the polls as Nigel Farage's continues to lead in the national polls. \n                  Data leaked to Sky News shows Tory conference might be set for smaller crowd this year\n                 \n                  Conservative Party pledges £1.6bn ICE-style 'removals force' to detain and deport illegal migrants\n                 \n                  ECHR move shows Tories are under pressure like never before\n                 Just three weeks before this year's gathering, one of her ministers, Danny Kruger, became the first serving Tory MP to defect to Reform. Eleven former Conservative cabinet members, ministers and MPs had switched to Reform this year ahead of Mr Kruger. Ex-health minister Maria Caulfield defected after Mr Kruger. Sub-optimal for Badenoch, but an issue she has brushed off, accusing them of \"running away rather than solving problems\". The threat of Reform, which has led the polls for weeks, dominated the Lib Dem and Labour conferences but, if PMQs is anything to go by, there is no guarantee Ms Badenoch will put Mr Farage's party at the forefront of her two conference speeches. Rather than just the traditional leader's speech at the end of the conference, Ms Badenoch will deliver an additional one today, in which she will set out the party's broad new plan to tackle illegal migration. Some 34,401 people have crossed the Channel in small boats so far this year, according to PA news agency analysis of Home Office figures, putting 2025 on course to break the record for most arrivals in a single year. The traditional end-of-conference speech will still take place on Wednesday, as she seeks to grab headlines and cut through the electorate in a way she has failed to do so far. Also overshadowing the party as they head to Manchester is the High Court ruling that a PPE company linked to Tory peer Baroness Michelle Mone must repay the government £122m for breaching a contract for medical gowns during COVID. Ms Badenoch said Lady Mone had brought \"embarrassment and shame to the party\" and should have the \"book thrown at her\". Read more:What happens when an MP defects to another party?Badenoch branded 'delusional' as she makes 'serious offer' to help PM  The Tory leader has faced criticism over her leadership style, initially because she carried out very few media interviews. But she has said this was because the party was close to bankruptcy when she took over. \"I basically inherited a distressed asset and my first job was to just make sure we didn't go bust,\" she told The Spectator this week. \"Most of my first three to six months were spent on that. I just couldn't get out there much. The opportunity cost was perhaps not doing much media.\" But she has since failed to unify the party, which was illustrated by another disastrous result in the May 2025 local elections. And the latest results from a bimonthly YouGov poll, which tracks her performance as Tory leader, show Conservative voters have their lowest opinion of her since she became leader, with 38% thinking she should remain as leader. The highest number of Tory members (39%) now think she should stand down and let someone else take over - a rise of 10% since July. So, this conference is an opportunity to get members - and MPs - behind her. One of those MPs who has been unsubtle about his ambition to replace her is shadow justice secretary Robert Jenrick, who lost out to Ms Badenoch in the leadership race. Ms Badenoch has brushed off his attempts to outshine her, saying many of the views he offers so readily beyond his brief \"are my thoughts repackaged\". \"I don't mind that he says what he thinks,\" she told The Spectator. \"The advantage of having a leadership contest is that you've kind of already said what you think. \"Repeating it, which is what Rob tends to do, is not new information.\" Also, days before the conference starts, former Conservative prime minister Baroness Theresa May gave a rare public rebuke of Ms Badenoch after the Tory leader pledged to replace the UK's world-leading Climate Change Act with a strategy for \"cheap and reliable energy\". Baroness May said she is \"deeply disappointed by this retrograde step\" and that to row back on the strategy to tackle climate change \"would be a catastrophic mistake\". The Tory conference could be a chance for Ms Badenoch to turn her fortunes around, but she will have to work at getting her MPs - and Tory members (those who are left) - behind her and the party she promised to \"renew\" and to \"prepare over the course of the next few years for government\"."
    },
    {
        "title": "Conservative Party pledges £1.6bn ICE-style 'removals force' to detain and deport illegal migrants",
        "description": "The Conservatives are pledging to create a new \"removals force\" to detain and remove 150,000 a year as part of a broad plan to tackle illegal immigration to the UK.",
        "url": "https://news.sky.com/story/conservative-party-pledges-16316bn-ice-style-removals-force-to-detain-and-deport-illegal-migrants-13444647",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ice-hearings-federal-agents-involed-in_7042232.jpg?20251005020837",
        "type": "Politics",
        "Author": "Ben Bloch at Conservative Party conference in Manchester",
        "Date Published": "2025-10-04 17:15:00",
        "Headline": "The pledge is part of the Conservative Party's broad new plans to stop illegal migration to the UK, set to be unveiled by Kemi Badenoch on the first day of their annual conference on Sunday.",
        "Content": "By Ben Bloch at Conservative Party conference in Manchester   The Conservatives are pledging to create a new \"removals force\" to detain and remove 150,000 a year as part of a broad plan to tackle illegal immigration to the UK. Modelled on the \"successful approach\" of the US Immigration and Customs Enforcement (ICE) agency, this new force would be given \"sweeping new powers\", and over £1bn in new funding. The pledge is part of the Conservative Party's broad new plans to stop illegal migration to the UK, set to be unveiled by Kemi Badenoch on the first day of their annual conference on Sunday, where reducing immigration and creating \"Strong Borders\" will be one of the key themes. The new \"removals force\" that she will unveil will replace the existing Home Office Immigration Enforcement (IE) and will be given broad new powers, including being able to use facial recognition without warning in order to spot illegal immigrants.  👉Listen to Politics at Sam and Anne's on your podcast app👈 It will be given funding of £1.6bn a year, up from the existing £820m a year, to increase the number of removals annually from 34,000 to 150,000 - which would represent \"at least 750,000 removals\" across a five-year parliament. The Tories say this increase in funding would come from the closure of asylum hotels and \"tackling the wider costs of our out-of-control asylum system\". \n                  A subdued Tory conference could be a chance for Badenoch to turn her fortunes around - but will she?\n                 \n                  Data leaked to Sky News shows Tory conference might be set for smaller crowd this year\n                 \n                  ECHR move shows Tories are under pressure like never before\n                 However, ICE in the US has been heavily criticised by politicians and the public in recent months, with the agency accused of arresting both legal migrants and US citizens and targeting people based on their race. Expanding the use of live facial recognition technology is also likely to attract criticism from within the Tory Party itself, on the grounds of it being a threat to individual freedom and privacy.  Tories to withdraw from multiple conventions In addition to confirming plans to leave the European Convention on Human Rights (ECHR), announced on Saturday, Ms Badenoch will also vow to fully repeal the Human Rights Act, and leave the Council of Europe Convention on Action Against Trafficking in Human Beings. This, the Tories say, would \"end the legal blocks that allow illegal immigrants, and in some cases foreign criminals, to stay in the UK based on flimsy claims\".  A radical overhaul of the asylum system would see refugee status granted only to those threatened by a foreign government, and those fleeing conflict or \"less tolerant\" laws on religion or sexuality would not be eligible, with the party saying \"few people will qualify\". The plan will also see the immigration tribunal abolished, with all decisions on migration taken by the Home Office with only limited rights of appeal in cases where officials have acted without statutory authority. Immigration cases will be denied legal aid, with the Tories accusing solicitors of having \"defrauded\" the UK by \"coaching\" applicants and arguing there is \"no need for lawyers\" as people \"should simply tell the truth about their circumstances\".  'Labour is fixing the Tories' mess' The plans come as Ms Badenoch faces continued pressure on her right flank from Reform UK, which has already pledged to leave the ECHR and deport up to 600,000 people over five years if it comes to power. But the party leader said the plans put forward by Nigel Farage's party are \"nothing but announcements that fall apart on arrivals\". She also said the Labour government offers \"failed gimmicks\", adding: \"Our Stronger Borders plan is serious and credible and backed by a comprehensive legal analysis. That is the difference the next Conservative government will deliver.\" A Labour Party spokesperson said: \"The Conservatives' message on immigration is: we got everything wrong, we won't apologise, now trust us. \"It won't wash - Kemi Badenoch's party enabled record high net migration as removals plummeted, opened over 400 asylum hotels and wasted £700 million of taxpayers' money to send just four volunteers to Rwanda. \"This Labour government is fixing the Tories' mess by smashing the people-smuggling gangs running the vile small boats trade, closing asylum hotels, deporting foreign criminals and signing international returns deals to bring order to Britain's borders.\" Hear more about the plans from shadow home secretary Chris Philp, live at the Conservative Party Conference in Manchester on Sunday Morning With Trevor Phillips from 8.30am."
    },
    {
        "title": "Kemi Badenoch says Tories will quit ECHR if they win next election",
        "description": "The Conservative Party will leave a key human rights treaty if it wins the election, its leader Kemi Badenoch has said. ",
        "url": "https://news.sky.com/story/kemi-badenoch-says-tories-will-quit-echr-if-they-win-next-election-13443937",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kemi-badenoch-conservative_7039754.jpg?20251003084523",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-04 06:20:00",
        "Headline": "The treaty, founded in the wake of the Second World War and driven by Sir Winston Churchill, has become a contentious issue as concerns rise about immigration.",
        "Content": " The Conservative Party will leave a key human rights treaty if it wins the election, its leader Kemi Badenoch has said.  Ms Badenoch announced the policy to leave the European Convention on Human Rights (ECHR) ahead of the Conservative Party's conference next week. Despite many Tory MPs having expressed displeasure with the treaty, and the court that upholds treaty rights in recent years, it had not been party policy for the UK to exit it. The move follows a review on the impact of the UK's ECHR membership conducted by shadow attorney general David Wolfson. Lord Wolfson's nearly 200-page report said the ECHR had impacted government policy in numerous areas. The report said this includes limiting government's ability to address immigration issues, potentially hampering restrictions on climate change policy, and impacting government ability to prioritise British citizens for social housing and public services. Read more:Baroness Mone: I have no wish to rejoin Lords as Conservative peer \n                  A subdued Tory conference could be a chance for Badenoch to turn her fortunes around - but will she?\n                 \n                  Data leaked to Sky News shows Tory conference might be set for smaller crowd this year\n                 \n                  Conservative Party pledges £1.6bn ICE-style 'removals force' to detain and deport illegal migrants\n                 But leaving the ECHR would \"not be a panacea to all the issues that have arisen in recent years\", Lord Wolfson said. It comes after the Reform Party in August said they would take the UK out of the ECHR if elected. The Conservatives have increasingly come under threat from Reform and are being trailed in the polls by them. What is the ECHR? The ECHR was established in the 1950s, drafted in the aftermath of the Second World War and the Holocaust, to protect people from serious human rights violations, with Sir Winston Churchill as a driving force. It's 18 sections guarantee rights such as the right to life, the prohibition of torture, the right to a fair trial, the right to private and family life and the right to freedom of expression. It has been used to halt the deportation of migrants in 13 out of 29 UK cases since 1980. A political issue Leaving the ECHR could breach the 1998 Good Friday Agreement, the peace settlement deal between the British and Irish governments on how Northern Ireland should be governed. The Northern Ireland Affairs Committee of MPs heard evidence on potential impacts to the country. In a May 2024 letter to the Northern Ireland secretary at the time, the committee chair Sir Robert Buckland said it heard evidence the government would knowingly be in breach of the Belfast/Good Friday Agreement by withdrawing. Labour has in recent days said it was considering how Article 3, the prohibition on torture, and Article 8,the right to respect for private and family life, are interpreted. The sections have been used to halt deportation attempts. The Liberal Democrats and Greens are in favour of the ECHR. A general election is not expected until 2029."
    },
    {
        "title": "Green Party membership overtakes Liberal Democrats under Polanski",
        "description": "The Green Party now has more members than the Liberal Democrats, despite having 68 fewer MPs in parliament.",
        "url": "https://news.sky.com/story/green-party-membership-overtakes-liberal-democrats-under-polanski-13444030",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-zack-polanski-bournemouth_7040167.jpg?20251003141551",
        "type": "Politics",
        "Author": "Will Charley",
        "Date Published": "2025-10-04 10:31:00",
        "Headline": "Around 20,000 people have joined the Green Party in the past few months, and new leader Zack Polanski says he has \"undoubtedly\" had a role in this success.",
        "Content": "\n          Political reporter\n              @WillCharley1\n The Green Party now has more members than the Liberal Democrats, despite having 68 fewer MPs in parliament. Rachel Millward, the party's deputy leader, announced the achievement to members on the second day of the party's annual conference in Bournemouth this morning. It's believed to be only the second time this has happened, with the last time being more than a decade ago - in January 2015. The Greens have revealed they now have more than 83,500 members, to the Lib Dems 83,174.  This is despite Sir Ed Davey's party having 72 MPs in parliament, while the Greens have just four representatives in the Commons. Around 20,000 new members have joined the Green Party in recent months, leading to a surge in membership of about 20%. Polanski: 'I have undoubtedly accelerated the party's rise' \n                  Palestine Action proscription must be 'withdrawn', says Green Party leader Zack Polanski\n                 \n                  The Green Party might be small but it's thinking big - can it make a dent in Reform's rise?\n                 \n                  What's Zack Polanski's story?\n                 It follows the election of new leader Zack Polanski at the beginning of September. Mr Polanski, who is not an MP, ran on a platform of bringing about a mass-movement within the party through the form of \"eco-populism\". Mr Polanski has stated his public ambition is for the party to win more than 30 MPs at the next general election in four years time, and to win himself a seat in parliament. Announcing the rise in membership, Ms Millward said: \"We are now officially the fastest growing political movement in Britain today! \"As of right now, I can confirm we are bigger than the Liberal Democrats.\" This was met with a standing ovation from members, one of several that the deputy leader received during her speech. Speaking to Sky News following his deputy's speech to the conference, Mr Polanski said: \"It's phenomenally exciting. It marks a real moment. It's really striking to me that since I launched my leadership campaign back in May, membership went up 33% and is still going up.\" Challenged if he believes the sudden rise in membership is entirely down to his own leadership abilities, Mr Polanski responded: \"This is a team effort. \"I think for a long time the party's had a very clear direction. I think, undoubtedly, I've accelerated that in terms of the bold politics message, but I know the entire party is on board with that.\" The Green Party leader used his keynote speech to members on Friday to set out plans for a wealth tax on the assets of the richest 1% \"to reduce inequality\" and end \"rip off Britain\". He also called the conflict in Gaza a genocide - a long-standing Green Party policy - and insisted \"we will not be silent\". On Saturday, deputy leaders Ms Millward and Mothin Ali addressed members in the morning and, at lunchtime, hundreds of supporters gathered on the beach in Bournemouth in support of Palestinians in Gaza. Holding up a large red banner that stretched far down the beach, Mr Polanski asked the government where its \"red line\" was for Israel. Members led several chants from the beach, including the controversial phrase: \"From the River to the sea, Palestine will be free.\" This evening, Mr Polanski will record a live episode of his podcast, Bold Politics, with left-wing commentator, Owen Jones. Lib Dems: 'Sir Ed Davey is the most popular and the most trusted' The Liberal Democrats' website boasts a membership of \"more than 90,000 people\", but Sky News understands that this figure is out of date and incorrect. The 83,174 number comes from the most recently published set of the party's accounts, which cover up to the end of last year. It is thought membership of the party may have dropped since. Responding to being overtaken by the Greens, a spokesperson for the party said: \"Across the country it's the Liberal Democrats who are on the up, after making record gains at the local elections in May, winning more seats than Labour and the Conservatives for the first time ever. \"Ed Davey is the most popular party leader, and the most trusted on NHS and care, because we're focused on the issues that really matter.\" The Lib Dems held their party conference earlier this year, where Sir Ed used speeches to attack Reform UK, US President Donald Trump and tech titan Elon Musk."
    },
    {
        "title": "Data leaked to Sky News shows Tory conference might be set for smaller crowd this year",
        "description": "Will as many people as last year come to Tory conference? I have a leak that helps explore this - and it reveals the party itself is expecting fewer.",
        "url": "https://news.sky.com/story/data-leaked-to-sky-news-shows-tory-conference-might-be-set-for-smaller-crowd-this-year-13444674",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-tory-conservative-conference_7041985.png?20251004191651",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-10-04 17:50:00",
        "Headline": "The Conservative Party conference begins on Sunday October 5 and is billed as \"the party’s biggest political event of the year\". ",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Will as many people as last year come to Tory conference? I have a leak that helps explore this - and it reveals the party itself is expecting fewer. Normally you don't get any detailed breakdowns of conference data - who is coming and in what category. But I've been shared an early cut of the numbers from this year. What you can see above is a screenshot of the data sent to the party board. I am told this table is from 11 August and shows the then-current attendance figures which were sent to the Conservative Party board. They revealed numbers due to be coming to Manchester this week, lagging on last year. You can see that at that stage, there are more than 1,000 fewer members due to come to conference than had been listed in early August 2024. Indeed, the party's target is markedly lower. There are also fewer Young Conservatives, though by a much smaller margin. However, the number of commercial guests is up on last year, as is donors, known as 'Treasurer's Guests', although the number planning to attend Business Day on Monday is down. \n                  A subdued Tory conference could be a chance for Badenoch to turn her fortunes around - but will she?\n                 \n                  Conservative Party pledges £1.6bn ICE-style 'removals force' to detain and deport illegal migrants\n                 \n                  ECHR move shows Tories are under pressure like never before\n                 The 'Margaret Thatcher 100th,' a commemoration of her life, is a new event to mark the centenary of the former Conservative prime minister's birth which is on 13 October. I'm told the current number of members coming to Manchester is 3,500, although that is calculated on a different basis to these - and includes Young Conservatives. Strength Another source told me the number of members coming to conference - calculated on the above basis - is around 2,800 but it was not possible to verify that. A Conservative spokesman said: \"This out-of-date report does not reflect the strength of Conservative Party conference 2025. \"There are thousands of members - many new to the party - hundreds of businesses, and many other delegates attending to hear Kemi Badenoch's bold new vision for the country. \"This conference the Conservatives will demonstrate they are the only party that can be trusted to deliver a stronger economy and stronger borders for the country.\" In response to the leaked data, Reform UK posted on X, \"The Conservative Party is finished.\""
    },
    {
        "title": "Reeves seeks outsider to run Britain's banking watchdog",
        "description": "Rachel Reeves, the chancellor, is seeking a heavyweight outsider to run Britain's main banking watchdog, with a senior Barclays executive expected to be among the top contenders for the job.",
        "url": "https://news.sky.com/story/reeves-seeks-outsider-to-run-britains-banking-watchdog-13443978",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-conference-rachel-reeves_7035694.jpg?20250929073647",
        "type": "Politics",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-04 08:18:00",
        "Headline": "Katharine Braddick, a senior Barclays executive, is a potential candidate to head the Prudential Regulation Authority as the chancellor prepares to kick off a search within days, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Rachel Reeves, the chancellor, is seeking a heavyweight outsider to run Britain's main banking watchdog, with a senior Barclays executive expected to be among the top contenders for the job. Sky News has learnt that the Treasury is to advertise the post of chief executive of the Prudential Regulation Authority (PRA), which oversees financial services firms such as banks and insurers, within days. One source said the recruitment process could kick off as early as next week. The process, which will run for several months, will lead to the appointment of a successor to Sam Woods, a long-serving official who has served two terms in the role. This weekend, it emerged that Katharine Braddick, a former senior Treasury civil servant who joined Barclays in 2022, is expected to be among the applicants for the role. Whitehall insiders said Ms Braddick would be a strong contender for the post if she decided to apply. Read more:Baroness Mone: I have no wish to rejoin Lords as Conservative peer \n                  Farage and Tice right to scrutinise one of Bank of England's most radical monetary experiments in history\n                 \n                  The big story from Bank of England is an easing in tightening to avert massive losses\n                 \n                  Bank of England leaves interest rate unchanged and slows quantitative tightening \n                 A former director-general, financial services at the Treasury, Ms Braddick has been Barclays' group head of strategic policy and advisor to the bank's chief executive for three-and-a-half years. Prior to the Treasury, she worked at the Financial Services Authority and was heavily involved in political negotiations on financial services legislation relating to Brexit. Barclays declined to comment on Ms Braddick's behalf on Saturday. In response to an enquiry from Sky News, a Treasury spokesperson said: \"Growing the economy is the Chancellor's number one mission. \"Every regulator has a part to play by regulating for growth not just risk.\" The chancellor is said to be keen to identify candidates from outside Britain's existing regulatory set-up to head the PRA. A small number of internal candidates is thought to include David Bailey, the Bank of England's executive director for prudential policy. Ms Reeves's apparent desire for an outsider comes amid a wider push for Britain's economic watchdogs to remove red tape and reorient themselves towards growth-focused policies. Earlier this year, Nikhil Rathi, chief executive of the Financial Conduct Authority, was appointed to a second term in charge following intensive discussions about the body's five-year strategy. Since then, both the FCA and PRA have removed rules relating to diversity and inclusion in the financial sector, while the former abandoned a plan to 'name and shame' companies which were the subject of enforcement investigations. The Payment Systems Regulator (PSR) was abolished earlier this year as part of the government's drive to reduce unnecessary regulation. The search for the next PRA boss will get underway less than two months before the chancellor delivers an autumn Budget in which she is expected to have to raise tens of billions of pounds through additional tax rises. Mr Woods' next move will be closely watched in the City. He has been seen as a potential candidate to succeed Andrew Bailey when the Bank of England governor's term runs out in 2028, although it is unclear whether he covets the job. As CEO of the PRA, Mr Woods is also a deputy governor of the Bank of England, a member of the Bank's Court of Directors, and a director of the FCA. The chancellor has shown a willingness to recruit from outside the Treasury, appointing Bank of America investment banking veteran Jim O'Neil as second permanent secretary to the Treasury earlier this year. Mr O'Neil had also served as the head of UK Financial Investments, the agency set up to manage taxpayers' stakes in Britain's bailed-out banks."
    },
    {
        "title": " Prince William 'cares deeply about tradition' but Earthshot Prize shows he's not afraid to modernise",
        "description": "A close adviser to Prince William has told Sky News William \"does care deeply about tradition\" but his Earthshot Prize shows he's not afraid to modernise to make sure his work \"makes sense\" for the generation he will serve.",
        "url": "https://news.sky.com/story/prince-william-cares-deeply-about-tradition-but-earthshot-prize-shows-hes-not-afraid-to-modernise-13444363",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-william-wales_7041639.jpg?20251004164448",
        "type": "Technology",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-10-04 14:48:00",
        "Headline": "After a TV interview hinted the Prince of Wales wanted to make 'change' when he becomes king, a trusted adviser tells Sky News how he believes that will manifest.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  A close adviser to Prince William has told Sky News William \"does care deeply about tradition\" but his Earthshot Prize shows he's not afraid to modernise to make sure his work \"makes sense\" for the generation he will serve. Marking a month to go until the fifth Earthshot Prize awards takes place in Rio de Janeiro in Brazil, Jason Knauf, the new chief executive, says it shows \"the sort of leader that Prince William wants to be, both now and in the future\" but also the huge impact his influence can have on issues like the climate crisis. Mr Knauf has become a close confidante of the Prince, having worked with him for ten years, and being there right at the beginning of the Earthshot journey, \"when this thing was percolating, and he really pushed us to make it something special\". But after discussions this week about the \"change\" William wants to make when he's monarch, Mr Knauf told us the Prince doesn't want to just shake things up for the sake of it. \"He does care deeply about tradition, about his family's legacy of service, and I think Earthshot is a really good example of how you're going to see that maintained in the future, but done in a way that makes sense for the time\", he said, adding: \"That's what his grandmother did. \"That's what his father's been doing. Updating the tradition for the generation that they serve\". Explaining how in the early days they looked closely at other examples of past royal prizes or initiatives, such as the Duke of Edinburgh Award, for inspiration, Mr Knauf said: \"You know, we didn't just create this thing in a vacuum. It was about what kind of difference could his leadership make? \n                  Prince William has 'the best day of my life' spraying pond water at journalists\n                 \n                  Prince William calls for better support for wildlife conservationists on South Africa visit\n                 \n                  Prince William lands in South Africa for 'milestone' Earthshot awards after weekend of royal criticism\n                 \"And one of the things about the royal family for generations, has been recognising the work of others. \"You know, whether that's through the honours system, recognising people in arts and community service or whatever it might be, all this is doing is taking something that's really traditional and putting a modern twist on it\". Last week, a TV programme was released in which Prince William admitted, during an interview with Hollywood star Eugene Levy, that \"change is on my agenda\" when he becomes King.  This weekend, the finalists for the fifth Earthshot awards are announced, with four weeks to go until the ceremony takes place in Rio. The prize recognises innovators coming up with solutions to the world's most pressing environmental problems. Among this year's finalists in the running for the five £1m prizes are Matter, a British company whose simple washing machine filters remove the greatest cause of microplastics in our ocean; the world's first fully 'upcycled skyscraper' in Australia, a Chinese company working on mobile phone waste, and the country of Barbados for its environmental focus. Read more from Sky News:Radioactive issues could still derail momentum for Gaza peaceDetails emerge of synagogue attacker's life For the first time, the awards will take place in the same country, in the same week as the UN climate change conference COP30. Addressing whether the positive message of Earthshot will be overshadowed by the inevitable split opinions on tackling the climate crisis that will come out of the conference in Belem, Mr Knauf said: \"The news around political disagreement and all of that stuff will be out there, but that's one of the reasons we created the prize, directly to challenge that pessimism and negativity, to say we need to get on with this work. \"Showing world leaders that big things are happening in their regions and in their countries and in their backyards should remind them that, actually, this isn't something that's theoretical. \"The actual solutions that we need really, really do exist\". Prince William will travel to Brazil on 3 November for engagements in Rio, highlighting environmental issues, as well as attending the awards on 5 November at the iconic Museum of Tomorrow. In a video posted on his social media, the Prince explains how he continues to do this for his children, saying: \"The Earthshot Prize was founded because this decade matters. \"2030 is a threshold by which future generations will judge us; it is the point at which our actions, or lack of them, will have shaped forever the trajectory of our planet.\""
    },
    {
        "title": "Oasis guitarist 'Bonehead' taking break from reunion tour as he reveals prostate cancer diagnosis",
        "description": "Oasis guitarist Paul \"Bonehead\" Arthurs has announced he has prostate cancer and will have to take a \"planned break\" from the band's current reunion tour.",
        "url": "https://news.sky.com/story/oasis-guitarist-bonehead-taking-break-from-reunion-tour-as-he-reveals-prostate-cancer-diagnosis-13443914",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-paul-bonehead-arthurs_7040783.jpg?20251004023022",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-04 01:11:00",
        "Headline": "The 60-year-old said he was \"really sad\" to miss Oasis shows in South Korea, Japan and Australia, but assured fans he is \"feeling good and will be back ready to go in time for South America\".",
        "Content": "Oasis guitarist Paul \"Bonehead\" Arthurs has announced he has prostate cancer and will have to take a \"planned break\" from the band's current reunion tour. The band, fronted by brothers Noel and Liam Gallagher, finished the triumphant UK leg of the comeback shows last month, with dates in South Korea, Japan, Australia and South America coming up throughout October and November. Arthurs, a co-founder of the Manchester group, shared the news in a post on Instagram. \"Early this year I was diagnosed with prostate cancer,\" he said. \"The good news is I'm responding really well to treatment, which meant I could be part of this incredible tour. \"Now, I am having to take a planned break for the next phase of my care, so I'll be missing the gigs in Seoul, Tokyo, Melbourne and Sydney.\" The 60-year-old said he was \"really sad\" to miss these Oasis shows but assured fans he is \"feeling good and will be back ready to go in time for South America\". He told fans to \"have an amazing time\" at the gigs this month, \"and I'll see you back onstage with the band in November\". Sharing Arthurs' post, a message on the official Oasis Instagram account said: \"Wishing you all the best with your treatment… we'll see you back on stage in South America.\" The announcement comes following a previous diagnosis of tonsil cancer in 2022. Back then, Arthurs had to take a break from performing with Liam Gallagher at his solo shows, before being given the \"all-clear\" after treatment. The guitarist first started playing music with Liam Gallagher in The Rain, the band which later became Oasis. He left in 1999 but continued to work with Liam over the years, including in his band Beady Eye and on his subsequent solo work. Read more:Sean 'Diddy' Combs sentenced to more than four yearsLawsuit over Nirvana album art featuring naked baby thrown out  The highlight of the summer for fans Oasis announced their reunion in August last year, 15 years on from their infamous split after Noel walked out in 2009. The shows started in Cardiff in July and have been the highlight of the summer for thousands of fans who thought they would never see the previously feuding Gallagher brothers on stage together again. It is rumoured they will continue their run of shows next year, which marks 30 years since they played two sell-out nights at Knebworth Park to an estimated 250,000 people. In response to Arthurs' announcement, Chiara De Biase, from Prostate Cancer UK, said that by openly sharing his experience, he is \"raising lifesaving awareness among men across the UK and around the world\". She added: \"Prostate cancer often doesn't have symptoms at the early stages, but the earlier you find it, the easier it is to treat.\""
    }
]