[
    {
        "title": "England and Scotland fans discover where their opening World Cup games will be played",
        "description": "England and Scotland fans have found out where their World Cup group games will be played when the tournament kicks off in June.",
        "url": "https://news.sky.com/story/england-and-scotland-fans-discover-where-their-opening-world-cup-games-will-be-played-13480055",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-world-cup-fifa_7100245.jpg?20251203220018",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-06 14:29:00",
        "Headline": "Fans are expected to rush to sort their travel and accommodation plans now that they know where and when the matches take place.",
        "Content": " England and Scotland fans have found out where their World Cup group games will be played when the tournament kicks off in June. England, who are in Group L, will begin their tournament against Croatia in Dallas at 4pm EST (9pm BST) on 17 June. They will then go on to face Ghana in Boston at 4pm EST (9pm BST) on 23 June and Panama at the Met Life Stadium in New Jersey at 5pm EST (10pm BST) on 27 June. Scotland are in Group C, and their first match will be against Haiti in Boston at 9pm EST on 13 June (2am BST 14 June).  They will go up against Morocco also in Boston at 6pm EST (11pm BST) on 19 June and then Brazil in Miami at 6pm EST (11pm BST) on 24 June. Fans are expected to rush to sort their travel and accommodation plans now that they know where and when the matches take place. Read more:Unapologetically political - a World Cup draw like no other Wales and Northern Ireland have yet to find out if they will qualify. Wales must face a play-off against Bosnia and Herzegovina in Cardiff, then either Italy or Northern Ireland, if they are victorious. If they beat these play-off opponents, they will secure their place in Group B alongside Canada, Qatar and Switzerland. The World Cup final will be a 3pm EST (8pm BST) kick-off in New Jersey, New York, on 19 July. However, Northern Ireland will also be vying to guarantee their spot in the same group if they can beat Italy and then either Wales or Bosnia and Herzegovina."
    },
    {
        "title": "Up to 8,000 people could need hospital care before flu wave reaches peak, health leaders warn",
        "description": "Health leaders are warning that up to 8,000 people could be taken to hospital before a flu wave currently gripping the country reaches its peak.&#160;",
        "url": "https://news.sky.com/story/up-to-8000-people-could-need-hospital-care-before-flu-wave-reaches-peak-health-leaders-warn-13480326",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-doctor-hospital_7021674.jpg?20250915210836",
        "type": "Home",
        "Author": "Ashish Joshi",
        "Date Published": "2025-12-06 18:40:00",
        "Headline": "Flu season has come early and hit harder. A mutated, stronger strain of the virus is driving this wave and the peak is nowhere in sight.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n  Health leaders are warning that up to 8,000 people could be taken to hospital before a flu wave currently gripping the country reaches its peak.  A new strain of the flu virus is believed to be much more infectious than previous strains and has already led to a record number of patients needing urgent hospital care. The UK Health Security Agency (UKHSA) said it is seeing the flu among younger patients and fears the virus will now spread to older, more vulnerable patients. Dr Jamie Lopez Berbnal, consultant epidemiologist at the UKHSA, told Sky News: \"The new strain circulating has evolved a bit more rapidly than normal. \"And that could mean that there's a bit less immunity in the population from what we normally see in a flu season. \"And that could mean that the flu virus spreads a bit more than usual. And that's something that we've started to see already, in particular in children and young adults. \"But we're now starting to see flu take out a bit more in older adults, who tend to be more vulnerable to flu as well.\" \n                  Weight loss jabs conditionally backed to tackle obesity by World Health Organization\n                 \n                  World Aids Day: More HIV testing can help end new cases in England by 2030, says Streeting\n                 \n                  NHS Tayside 'destroyed vital logbooks' linked to disgraced surgeon Sam Eljamel, inquiry hears\n                 Read more from Sky News:Sky News goes inside hospital struggling with winter pressureWhy is flu season worse this year? More than 17 million flu jabs have been administered in England so far. But that's not enough. Flu season has come early and hit harder. A mutated, stronger strain of the virus is driving this wave and the peak is nowhere in sight. The NHS said that unlike a cold, flu symptoms can come on very quickly and can include a sudden high temperature that appears within a few hours. With a cold, a high temperature would appear gradually. Flu can cause a headache, dry cough and aching body - while a cold mainly affects your nose and throat. And flu can leave you feeling too exhausted to carry on as normal - unlike a cold, which leaves you feeling tired. In children, flu symptoms can include an earache and a drop in energy. Professor Julian Redhead, national director for urgent care for NHS England, said this flu season would be a \"big challenge\" for the health service. \"I think it's going to be a big challenge for us as we go forward because it just increases the pressure. \"I mean, at the moment we've got around, say 1,500, maybe 2,000 patients in hospital with flu and the predictions are that it will rise to somewhere between 5,000 and 8,000. \"So you can see the pressure that will be put on the system will be very large and that's why we're concerned.\" Professor Redhead also warned people not to underestimate the virus. Even for normally healthy people the effects of flu could be quite serious. He said: \"Anyone can be at risk of severe flu and it does carry complications, which people won't necessarily recognise because it can affect the heart and lungs and things like this. \"Clearly, it's the most vulnerable population that we're really worried about and what happens for them, is they can get bacterial infections on top of the flu and end up with things like pneumonia, which can be really, really serious. \"And we see patients going into ITU in these circumstances every year and that puts pressure into the ITU systems as well. \"So yes, it can be dangerous. It is mainly the very old and very young, where we see the complications. \"But remember that the increase at the moment is very much in the younger population and the danger is it then transmits into the older, more vulnerable population and that's what we want to try to prevent.\""
    },
    {
        "title": "King and Queen choose 20th wedding anniversary portrait for Christmas card",
        "description": "The King and Queen have released their Christmas card for this year, featuring a portrait of the royal couple arm in arm as they celebrated their 20th anniversary.",
        "url": "https://news.sky.com/story/king-and-queen-choose-20th-wedding-anniversary-portrait-for-christmas-card-13480145",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-queen-king-christmas_7103265.jpg?20251206211408",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-06 16:15:00",
        "Headline": "The photograph was taken earlier this year as the couple visited Villa Wolkonsky, the British ambassador's residence in Rome, Italy.",
        "Content": "The King and Queen have released their Christmas card for this year, featuring a portrait of the royal couple arm in arm as they celebrated their 20th anniversary. The photograph was taken earlier this year as the couple visited Villa Wolkonsky, the British ambassador's residence in Rome, Italy. It is framed inside the card by a dark red border, with the printed message in a matching colour on the opposite side reading \"Wishing you a very Happy Christmas and New Year\". Charles and Camilla's wedding anniversary on 9 April came on the same day they met Pope Francis, who died less than two weeks later at the age of 88. In the image, taken by royal photographer Chris Jackson, Camilla is wearing a white and beige coat dress by Anna Valentine and a lily of the valley brooch, while the King is dressed in a blue pinstripe suit with a grey tie and a silk handkerchief in his chest pocket. The Christmas card is the couple's fourth since Charles ascended to the throne. Hundreds of copies are sent out every year to family, friends, world leaders, diplomats, charities and organisations. \n                  Celebrities join the Princess of Wales for a carol service to thank Britain's volunteers\n                 \n                  Melania Trump unveils White House Christmas decorations\n                 \n                  Is Die Hard a Christmas film? The public have spoken - and you might not like the result \n                 For last year's Christmas card, Charles and Camilla chose a picture of them smiling in the Buckingham Palace garden. Read more:Watch: King's full speech at state banquetAndrew Mountbatten-Windsor officially stripped of two more titles The year before that, the card showed the royal couple in the Throne Room at the Palace following the coronation. The picture, by Hugo Burnand, showed Charles wearing the Imperial State Crown, coronation tunic and the robe of estate, with Camilla wearing Queen Mary's Crown.  On Friday, the Prince and Princess of Wales and their children attended the Together at Christmas carol service, where they were joined by Hollywood stars including Kate Winslet and singer Katie Melua. But the focus of Kate's annual service at Westminster Abbey was the UK's local communities and the princess took the time beforehand to thank volunteers from across the country."
    },
    {
        "title": "At least 23 people dead after fire at nightclub in Goa, India",
        "description": "At least 23 people have been killed after a fire at a nightclub in Goa, India.",
        "url": "https://news.sky.com/story/at-least-23-people-dead-after-fire-in-goa-india-13480407",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-breaking-breaking-news_7042253.png?20251023123455",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-06 22:41:00",
        "Headline": "An official has ordered an inquiry into the deadly fire, while Indian Prime Minister Narendra Modi said the incident was \"deeply saddening\".",
        "Content": " At least 23 people have been killed after a fire at a nightclub in Goa, India. Dr Pramod Sawant, Goa's chief minister, said a \"major fire incident at Arpora has taken the lives of 23 people\". \"I am deeply grieved and offer my heartfelt condolences to all the bereaved families in this hour of unimaginable loss,\" he said. Local media reported the fire took place in a nightclub around midnight on Saturday. The majority of victims are believed to be staff at the club - although some tourists are thought to be among those killed, local media reports. Videos on social media showed emergency services lining up to help the injured - some of whom were taken to nearby hospitals. Authorities worked through the night to bring the situation under control and all bodies have been recovered, the state's police chief told reporters, according to Reuters news agency. \n                  Russia hits Ukraine with missile and drone attack - as Zelenskyy notes 'substantive call' with US officials\n                 \n                  Gaza ceasefire negotiations at 'critical moment', says Qatar PM\n                 \n                  Paramilitary drone attack in southern Sudan kills at least 50 people, including 33 children\n                 India's Prime Minister Narendra Modi said the deadly fire was \"deeply saddening\". He said he had spoken with Goa's chief minister and that \"the state government is providing all possible assistance to those affected\". Dr Sawant said he has \"ordered an inquiry\" to discover what happened after visiting the site. \"The inquiry will examine the exact cause of the fire and whether fire safety norms and building rules were followed,\" he said. \"Those found responsible will face most stringent action under the law - any negligence will be dealt with firmly.\" Goa, a small state on India's western coast, is a popular tourist destination, attracting millions of tourists every year."
    },
    {
        "title": "Russia hits Ukraine with missile and drone attack - as Zelenskyy notes 'substantive call' with US officials",
        "description": "Russia launched a massive missile and drone attack on Ukraine overnight into Saturday, as President Volodymyr Zelenskyy said he had a \"substantive phone call\" with US officials aimed at ending the nearly four-year war.",
        "url": "https://news.sky.com/story/russia-hits-ukraine-with-massive-missile-and-drone-attack-amid-peace-talks-13480113",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ukraine-russia_7102449.jpg?20251206105515",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-06 15:39:00",
        "Headline": "The two sides also noted any \"real progress toward any agreement\" ultimately will depend \"on Russia's readiness to show serious commitment to long-term peace.\"",
        "Content": "Russia launched a massive missile and drone attack on Ukraine overnight into Saturday, as President Volodymyr Zelenskyy said he had a \"substantive phone call\" with US officials aimed at ending the nearly four-year war. Ukrainian and US officials noted any \"real progress toward any agreement\" ultimately would depend \"on Russia's readiness to show serious commitment to long-term peace.\" \"Ukraine is determined to keep working in good faith with the American side to genuinely achieve peace,\" Zelenskyy wrote on social media. It comes after Russia launched 653 drones and 51 missiles in its attack on Ukraine, triggering air raid alerts across the country overnight into Saturday, Ukraine's air force said.  Ukrainian forces shot down and neutralised 585 drones and 30 missiles, the air force said, adding that 29 locations were struck. At least eight people were wounded in the attacks, Ukraine's minister of internal affairs Ihor Klymenko said. Russia conducted a \"massive missile-drone attack\" on power stations and other energy infrastructure in several regions, Ukraine's national energy operator Ukrenergo said on Instagram. Ukraine's Zaporizhzhia nuclear power plant temporarily lost all off-site power overnight, the International Atomic Energy Agency said. The plant is in an area that has been under Russian control since early in Moscow's invasion of Ukraine. It is not in service, but needs reliable power to cool its six shutdown reactors and spent fuel in order to avoid any catastrophic nuclear incidents. Read more from Sky News:Young Germans fear return to conscriptionGiving up territory would be 'unjust', says Kyiv armed forces chief Zelenskyy condemns 'meaningless' strikes The Ukrainian president condemned the strikes as \"meaningless\" from a military point of view. He said energy facilities were the main targets, but a drone strike had \"burned down\" a train station in the city of Fastiv, in the Kyiv region. \"The Russians' goal is to hurt millions of Ukrainians, and they have sunk so low that they are launching missiles at peaceful cities on St. Nicholas Day,\" he said. \"That is why additional pressure is needed. Sanctions must work, and so must our air defence, which means we must continue to support those who defend our lives.\" Ukraine strikes oil refinery Meanwhile, Russia's defence ministry said its air defences had shot down 116 Ukrainian drones over Russian territory overnight. The General Staff of the Ukrainian Armed Forces said Ukrainian forces had struck Russia's Ryazan Oil Refinery, while Russian Telegram news channel Astra shared footage appearing to show a fire breaking out and plumes of smoke rising above the refinery. Over the last few months, Ukraine has used long-range drones to target Russian refineries in an attempt to deprive Moscow of the oil export revenue it needs to continue the war. Kyiv and its Western allies say Russia is trying to cripple Ukraine's power grid and deny civilians access to heat, light and running water in winter, which Ukrainian officials call \"weaponising\" the cold."
    },
    {
        "title": "Nigel Farage sang antisemitic songs to Jewish classmates, former Dulwich pupil claims",
        "description": "Nigel Farage sang antisemitic songs to Jewish schoolmates - and had a \"big issue with anyone called Patel\", a former schoolfriend has claimed.",
        "url": "https://news.sky.com/story/nigel-farage-sang-antisemitic-songs-to-jewish-classmates-former-dulwich-pupil-claims-13479621",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nigel-farage-reform_7100997.jpg?20251204151817",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-06 05:00:00",
        "Headline": "Two former Dulwich pupils have spoken to Sky News about their time at the school with Nigel Farage.",
        "Content": " Nigel Farage sang antisemitic songs to Jewish schoolmates - and had a \"big issue with anyone called Patel\", a former schoolfriend has claimed. Jean-Pierre Lihou, 61, was initially friends with the Reform UK leader when he arrived at Dulwich College in the 1970s, at the time when Mr Farage is accused of saying antisemitic and other racist remarks by more than a dozen pupils. But Mr Lihou, who is half-German and said he went for a couple of sleepovers at Mr Farage's parent's house, told Sky News' Amanda Akass that it \"soon become obvious he was not quite the same person I thought he was\". Warning: This article contains references to antisemitic slurs which readers may find offensive Another former pupil, Stefan Benarroch, who was in the year below Mr Farage and is Jewish, said that Mr Farage was \"not a kid\" when he made alleged antisemitic remarks and his behaviour was \"unacceptable in any era\". Mr Farage has said he \"never directly racially abused anybody\" at Dulwich and said there is a \"strong political element\" to the allegations coming out 49 years later. Reform's deputy leader Richard Tice has called the ex-classmates \"liars\". A Reform UK spokesman accused Sky News of \"scraping the barrel\" and being \"desperate to stop us winning the next election\". 'People were hurt by it' Mr Lihou told Sky News Mr Farage used to direct antisemitic songs at his Jewish friend Peter Ettedgui, who is one of the main former classmates to have spoken out against the Reform leader. \"He used to sing: 'Gas them all, gas them out, gas them all, into the chambers they crawl' - and the rest of those horrible words,\" he said. \"You think, when somebody is obviously distressed by that, why do you keep doing it? The humour wears off... when you see this, and because I'm German I'm particularly sensitive to anyone making that kind of analogy.\" Mr Lihou also said Mr Farage used to \"pass comment on anyone that wasn't white, particularly Indians\". He said: \"He had a great big issue with anyone called Patel because I think the school had at one point more Patels than Smiths. That seemed to irk him. \"Anybody who wasn't white, he was likely to have a comment pretty much throughout my school life, especially Jewish people. I think that was the worst thing because you could obviously see that people were hurt by it.\" 'He was truly ghastly' Mr Benarroch, who was also friends with Mr Ettedgui, told Sky News: \"His behaviour as a teenager was unacceptable by any standards and in any era. He was truly ghastly at Dulwich College.\" He said he would never have come across Mr Farage \"had I not been a Jew\". \"He and his minions - and one of his minions, in particular, was my tormentor at Dulwich - they would spot us coming out of Jewish prayers on a Friday,\" he added. \"So his behaviour at 16, 17, 18 - and you are a man at 18, you're technically an adult - was truly appalling. So we're not talking about a kid here.\" The property developer said the racism allegations are \"not just about Nigel Farage as a teenager, this is also about Nigel Farage as an adult\". \"His behaviour as a teenager was unacceptable by any standards and in any era. He was truly ghastly at Dulwich College,\" he added.  'These things don't leave you' Mr Benarroch, who is no longer a practising Jew, added: \"I was terrified of his bullies, he had these guys hanging around with him who were instructed to have a go at us as these young, nice Jewish boys. \"I don't recall ever having direct contact with Nigel Farage, but certainly I was very much a witness to his tormenting of others, especially Peter Ettudgui. \"He [Mr Farage] was so extreme, these things don't leave you, they don't leave your body, as such.\" On Thursday, Mr Farage launched into a tirade at the BBC after one of its reporters asked about the claims, with the politician reading out a letter he said was from someone he went to school with. He quoted the unnamed Jewish pupil as saying there was \"plenty of macho, tongue-in-cheek schoolboy banter\" and said sometimes it \"was offensive, but never with malice\". Political correspondent Allegations about Nigel Farage's schooldays have hit the headlines since the early days of the Brexit campaign in 2013. He has always dismissed such claims as 'politically motivated' and insisted recently he has 'never directly racially abused anybody'. But now with the prospect of Prime Minister Farage looking ever more likely - former classmates have decided now is the moment to speak up about their concerns, almost fifty years later. The allegations are deeply shocking. The problem for Farage is that far from going away – the story is only getting bigger. Reform have hit back against our story in bullish fashion, accusing Sky News of scraping the barrel in a desperate attempt to stop Reform UK winning the next election. Of course, the question of who will win the next election isn't down to journalists – but voters. Read more Read more: Farage dismisses school racism claims as 'banter in a playground'Farage needs to explain 'racist' comment allegations, says PM 'It was not schoolboy banter' Mr Benarroch rejected Mr Farage's claim it was just \"schoolboy banter\" and said he has continued to show the same views, just in a less obvious way. \"You tell that [that it was banter] to the guys, to Peter who had 'Hitler should have gassed you' said to him,\" he said. \"Peter Ettedgui was tormented by Nigel Farage. \"The point I'm making is, he's a grown man now. He's a highly intelligent politician with nuance when it suits him, and so clearly he's not going around saying 'Hitler should have gassed you all', obviously.\" The former Dulwich student said Mr Farage had \"kept the most disgraceful company imaginable\" in the US during the 2010s on radio and TV shows.  He specifically named Rick Wiles, a far-right American conspiracy theorist whose YouTube channel was banned in 2020 after calling Donald Trump's impeachment a \"Jew coup\". Mr Benarroch, who said he is not part of any political party, said \"there is no political motivation\" behind his allegations, but accused Reform and Mr Farage of making \"a political statement\" by calling them liars. On Thursday, Mr Farage said he had received multiple letters from former pupils in support of him. He said a letter from a Jewish schoolmate, said: \"While there was plenty of macho tongue-in-cheek schoolboy banter, it was humour, and yes, sometimes it was offensive... but never with malice. \"I never heard him [Farage] racially abuse anyone.\" A Reform UK spokesman \"accused Sky News of scraping the barrel\". He said: \"This ridiculous interview has nothing to do with Nigel Farage himself but apparently someone who knew him at school almost 50 years ago. \"Sky News are desperate to stop us winning the next election.\""
    },
    {
        "title": "Gaza ceasefire negotiations at 'critical moment', says Qatar PM",
        "description": "Negotiations on a lasting ceasefire deal for Gaza are at a \"critical moment\", the prime minister of Qatar, which has played a key role in brokering the deal, has said.",
        "url": "https://news.sky.com/story/gaza-ceasefire-negotiations-at-critical-moment-says-qatar-pm-13480180",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-qatar-forum_7103052.jpg?20251206175756",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-06 16:38:00",
        "Headline": "The first stage of a ceasefire deal was agreed in October, but violence in Gaza has not stopped. On Saturday alone, seven people were reportedly killed.",
        "Content": "Negotiations on a lasting ceasefire deal for Gaza are at a \"critical moment\", the prime minister of Qatar, which has played a key role in brokering the deal, has said. Sheikh Mohammed bin Abdulrahman said a definitive ceasefire could only happen with a full withdrawal of Israeli troops from the besieged enclave. The first stage of a ceasefire deal was agreed in October, but violence in Gaza has not stopped. On Saturday alone, seven people were reportedly killed. Palestinian local health authorities said the victims were from Beit Lahiya, Jabalia and Zeitoun in northern Gaza and included a 70-year-old woman who was killed by a drone strike.  The Israeli military said that in two separate incidents on Saturday, forces deployed in northern Gaza behind the so-called yellow line of withdrawal agreed in the ceasefire had fired on Palestinian militants who crossed the line, killing three. The military was unaware of any drone strike, a spokesperson said. The long-sought ceasefire - and the second one after a first deal fell apart earlier this year - began on 11 October after Israel and Hamas agreed to the first phase of Donald Trump's 20-point peace plan. \n                  12-year-old girl from Gaza receives vital brain operation after Israeli bombing near her home\n                 \n                  Gaza longs for normality, but quasi-anarchy reigns and Hamas is once again exerting control\n                 \n                  Anti-Hamas militia leader Yasser Abu Shabab killed in Gaza Strip - reports\n                 Despite accusations by both sides of violations, talks on the next phase of the ceasefire deal began almost two weeks ago, with Turkish, Qatari and Egyptian officials meeting in Cairo to discuss the second part of the agreement, including deploying a stabilisation force and body to govern Gaza and oversee reconstruction.  Read more:Two brothers killed in Israeli drone strike on GazaGaza child has vital operation \"We are at a critical moment. It's not yet there. So what we have just done is a pause,\" PM al-Thani said during a panel discussion at the Doha Forum conference in Qatar. \"We cannot consider it yet a ceasefire. A ceasefire cannot be completed unless there is a full withdrawal of the Israeli forces - (until) there is stability back in Gaza, people can go in and out - which is not the case today.\" On Thursday, an Israeli delegation held talks in Cairo with mediators on the return of the body of the last hostage held in Gaza, which would complete an initial part of Mr Trump's plan to bring an end to the two-year war. Since the truce started, Hamas has returned all 20 living hostages and 27 bodies in exchange for around 2,000 Palestinian detainees and convicted prisoners."
    },
    {
        "title": "Crumble and custard thrown at State Crown display case in Tower of London",
        "description": "Part of the Tower of London has been closed following reports of criminal damage to a display case containing the Imperial State Crown, part of the Crown Jewels.",
        "url": "https://news.sky.com/story/tower-of-london-closed-after-display-case-containing-state-crown-defaced-13479937",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-take-back-power-crown-jewels_7102582.jpg?20251206133656",
        "type": "Home",
        "Author": "Bethany Minelle, news reporter",
        "Date Published": "2025-12-06 11:30:00",
        "Headline": "The State Crown forms part of the Crown Jewels, a priceless collection considered to be the most famous of the nation's treasures.",
        "Content": "By Bethany Minelle, news reporter  Part of the Tower of London has been closed following reports of criminal damage to a display case containing the Imperial State Crown, part of the Crown Jewels. Police said four protesters had been arrested following the incident just before 10am on Saturday. They said it was reported that food had been thrown onto the case before two protesters left the scene. Footage of the incident appears to show one demonstrator removing the large foil tray of apple crumble from a bag and slamming it against the glass. Meanwhile, another pours a tub of bright yellow custard on the front of the case. They then held up a sign which read \"Democracy has crumbled - Tax the rich\". Police said in a statement: \"Officers worked closely with City of London Police and security officers and four people have been arrested on suspicion of criminal damage. They have taken into custody. \n                  Nursery worker, 45, pleads guilty to 26 sexual offences against children\n                 \n                  Man killed in Christmas Day 'trail of carnage', court told\n                 \n                  JPMorgan Chase unveils plans to build new £10bn 'landmark tower' in London - double the size of The Shard\n                 \"The Tower has been closed to the public while the police investigation continues.\" The Metropolitan Police later said only the Jewel House at the Tower had been closed to the public while investigations continued. A spokesperson for Historic Royal Palaces confirmed The Crown Jewels had not been damaged. Take Back Power - which describes itself as a new non-violent civil resistance group - claims it was responsible. The Imperial State Crown is built on a gold frame, with silver gem mounts housing 2868 diamonds, 269 pearls, 17 sapphires and 11 emeralds. Fitted with a purple velvet cap and ermine band, some of the stones are famous in their own right, named the \"Stuart Sapphire\" and \"Black Prince's Ruby\". It was originally made for King George VI in 1937, but is still used for major royal events, including the annual State Opening of Parliament. It forms part of the Crown Jewels - a priceless collection which includes orbs, sceptres and crowns - and is considered to be the most famous of the nation's treasures."
    },
    {
        "title": "Scotland's 2am kick off 'difficult' for kids but 'pubs will do a roaring trade', says manager Clarke",
        "description": "At least for the Tartan Army travelling to the United States the World Cup schedule is favourable. ",
        "url": "https://news.sky.com/story/scotlands-2am-kick-off-difficult-for-kids-but-pubs-will-do-a-roaring-trade-says-manager-clarke-13480394",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-scotland-world-cup_7102136.jpg?20251205185940",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-12-06 21:40:00",
        "Headline": "FIFA stretched out the World Cup draw into an additional day in Washington, adding a second half with another show that revealed the exact schedule for teams.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  At least for the Tartan Army travelling to the United States the World Cup schedule is favourable.  Less so for the fans staying in Scotland - with England benefitting from more social kickoff times to watch from home. FIFA stretched out the World Cup draw into an additional day in Washington, adding a second half with another show that revealed the exact schedule for teams. Fans can start planning their trips for the first World Cup to be spread across three countries. But England and Scotland will only play in Canada or Mexico depending on their progress in the tournament - with FIFA deciding their entire group stages in June should be played in the United States after a complex night of deciding between venue options and kickoff times. Scotland's group stage is all on the east coast of the US with the first two matches in Boston in a 60,000-plus capacity stadium used by the NFL's New England Patriots. But while the second Group C game against Morocco is at 6pm (11pm in Scotland), the opener against Haiti is at 9pm which is 2am at home. \n                  Donald Trump may get the one thing he craves more than anything today\n                 \n                  Is Trump's latest peace deal a total sham?\n                 \n                  Trump 'never rules anything out' to ensure World Cup's safety, key aide tells Sky News\n                 \"I'm sure the pubs will do a roaring trade,\" Scotland manager Steve Clarke told Sky News. \"Good for the adults. They'll be able to stay up late and watch it. \"Maybe a little bit more difficult for the kids but I'm sure a lot of Scottish kids will be sleeping in the morning after watching the games.\" Conditions should be cooler in Boston than Miami where the temperature is likely to be 20C and rising even at 6pm for the clash with Brazil - which is at 11pm BST. Clarke said: \"We've got to go out and find a suitable base, get ourselves settled in and make sure we've got everything right for the players so that they can perform during the maximum. That's the next job.\" Every England game will be finished for viewers at home by midnight. The Club World Cup last summer showed how heat and thunderstorms can pose health challenges and even delay matches. The potential for fierce 30C summer heat at 3pm (9pm BST) will be avoided for England in Dallas for the opener against Croatia because the 70,000-seat Cowboys stadium is climate-controlled inside. \"England has always been on our list, we hope we get England here,\" Monica Paul, executive director of the Dallas Sports Commission, told Sky News. \"We love the tradition and history of what soccer means to the English fans. So really ready to welcome them to Dallas. \"I think we're going to have enough beer, but we'll start working on that now too as well as positioning our pubs to welcome all those English fans.\" Read more:Unapologetically political - a World Cup draw like no otherEngland and Scotland's World Cup match schedule revealed It's also a 9pm kickoff back in England for the second Group L match against Ghana - 4pm in Boston. Could Ghana benefit from Scotland fans sticking around Boston from their match against Morocco four days earlier, a day before they'd need to be in Miami? England complete the group against Panama, kicking off at 5pm in New Jersey - 10pm at home. It's the stadium where they hope to return for the final on 19 July. It's the biggest, longest World Cup with the jump from 32 to 48 teams requiring 104 matches rather than 64 previously. It will take 64 matches just to complete the group stage. Fans can start saving up cash and hope they are not priced out by dynamic pricing but secure fixed-priced tickets. And Saturday in FIFA world was fully in football mode with Donald Trump sitting out the second leg of the draw ceremony. Additional reporting by Tyrone Francis"
    },
    {
        "title": "US national parks drop free admission on MLK Day and Juneteenth, but add Trump's birthday",
        "description": "Americans will be able to visit national parks for free on Donald Trump's birthday next year, but will no longer be able to do so on Martin Luther King Jr Day or Juneteenth.",
        "url": "https://news.sky.com/story/us-national-parks-drop-free-admission-on-mlk-day-and-juneteenth-but-add-trumps-birthday-13480382",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-us-national-parks-north-cascades_7103318.jpg?20251206221620",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-06 21:14:00",
        "Headline": "The Department of the Interior has released a list of what it calls \"resident-only patriotic fee-free days\" for next year.",
        "Content": "Americans will be able to visit national parks for free on Donald Trump's birthday next year, but will no longer be able to do so on Martin Luther King Jr Day or Juneteenth. The Department of the Interior has released a list of what it calls \"resident-only patriotic fee-free days\" for next year. Mr Trump's birthday, which falls on the Flag Day national holiday, has been added to the list, as has the Fourth of July weekend and President Theodore Roosevelt's birthday. However, Martin Luther King Day and Juneteenth have been removed. Juneteenth was recognised in 2021 under Joe Biden's administration and commemorates the end of slavery in the US. Also removed are the anniversary of the Great American Outdoors Act in August and the National Public Lands Day in September. \"President Trump's leadership always puts American families first,\" the US interior secretary Doug Burgum said. \"These policies ensure that US taxpayers, who already support the National Park System, continue to enjoy affordable access, while international visitors contribute their fair share to maintaining and improving our parks for future generations.\" Read more from Sky News:White House: Europe 'unrecognisable in 20 years or less'Trump awarded FIFA peace prize at World Cup draw The department said it was also introducing \"America-first entry free policies\", which means US residents will continue to \"enjoy affordable pricing\" while international visitors \"will pay a higher rate to help support the care and maintenance of America's parks\". It said the annual pass will cost $80 (£60) for US residents and $250 (£187) for nonresidents, with nonresidents without an annual pass paying a $100 (£75) per person fee to enter 11 of the most visited national parks, in addition to the standard entrance fee. Trump renames US Institute of Peace after himself The decision to make his birthday a 'free' day comes after Mr Trump's name was added to the sign on the headquarters building of the United States Institute of Peace in Washington DC. The State Department shared a photo of the building's new facade and called Mr Trump \"the greatest dealmaker in our nation's history\". He has also unsuccessfully put himself forward for the Nobel Peace Prize, sought to put his name on the planned NFL stadium in Washington DC, and had a new children's savings programme named after him."
    },
    {
        "title": "England and Scotland fans discover where their opening World Cup games will be played",
        "description": "England and Scotland fans have found out where their World Cup group games will be played when the tournament kicks off in June.",
        "url": "https://news.sky.com/story/england-and-scotland-fans-discover-where-their-opening-world-cup-games-will-be-played-13480055",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-world-cup-fifa_7100245.jpg?20251203220018",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-06 14:29:00",
        "Headline": "Fans are expected to rush to sort their travel and accommodation plans now that they know where and when the matches take place.",
        "Content": " England and Scotland fans have found out where their World Cup group games will be played when the tournament kicks off in June. England, who are in Group L, will begin their tournament against Croatia in Dallas at 4pm EST (9pm BST) on 17 June. They will then go on to face Ghana in Boston at 4pm EST (9pm BST) on 23 June and Panama at the Met Life Stadium in New Jersey at 5pm EST (10pm BST) on 27 June. Scotland are in Group C, and their first match will be against Haiti in Boston at 9pm EST on 13 June (2am BST 14 June).  They will go up against Morocco also in Boston at 6pm EST (11pm BST) on 19 June and then Brazil in Miami at 6pm EST (11pm BST) on 24 June. Fans are expected to rush to sort their travel and accommodation plans now that they know where and when the matches take place. Read more:Unapologetically political - a World Cup draw like no other Wales and Northern Ireland have yet to find out if they will qualify. Wales must face a play-off against Bosnia and Herzegovina in Cardiff, then either Italy or Northern Ireland, if they are victorious. If they beat these play-off opponents, they will secure their place in Group B alongside Canada, Qatar and Switzerland. The World Cup final will be a 3pm EST (8pm BST) kick-off in New Jersey, New York, on 19 July. However, Northern Ireland will also be vying to guarantee their spot in the same group if they can beat Italy and then either Wales or Bosnia and Herzegovina."
    },
    {
        "title": "Up to 8,000 people could need hospital care before flu wave reaches peak, health leaders warn",
        "description": "Health leaders are warning that up to 8,000 people could be taken to hospital before a flu wave currently gripping the country reaches its peak.&#160;",
        "url": "https://news.sky.com/story/up-to-8000-people-could-need-hospital-care-before-flu-wave-reaches-peak-health-leaders-warn-13480326",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-doctor-hospital_7021674.jpg?20250915210836",
        "type": "UK",
        "Author": "Ashish Joshi",
        "Date Published": "2025-12-06 18:40:00",
        "Headline": "Flu season has come early and hit harder. A mutated, stronger strain of the virus is driving this wave and the peak is nowhere in sight.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n  Health leaders are warning that up to 8,000 people could be taken to hospital before a flu wave currently gripping the country reaches its peak.  A new strain of the flu virus is believed to be much more infectious than previous strains and has already led to a record number of patients needing urgent hospital care. The UK Health Security Agency (UKHSA) said it is seeing the flu among younger patients and fears the virus will now spread to older, more vulnerable patients. Dr Jamie Lopez Berbnal, consultant epidemiologist at the UKHSA, told Sky News: \"The new strain circulating has evolved a bit more rapidly than normal. \"And that could mean that there's a bit less immunity in the population from what we normally see in a flu season. \"And that could mean that the flu virus spreads a bit more than usual. And that's something that we've started to see already, in particular in children and young adults. \"But we're now starting to see flu take out a bit more in older adults, who tend to be more vulnerable to flu as well.\" \n                  Weight loss jabs conditionally backed to tackle obesity by World Health Organization\n                 \n                  World Aids Day: More HIV testing can help end new cases in England by 2030, says Streeting\n                 \n                  NHS Tayside 'destroyed vital logbooks' linked to disgraced surgeon Sam Eljamel, inquiry hears\n                 Read more from Sky News:Sky News goes inside hospital struggling with winter pressureWhy is flu season worse this year? More than 17 million flu jabs have been administered in England so far. But that's not enough. Flu season has come early and hit harder. A mutated, stronger strain of the virus is driving this wave and the peak is nowhere in sight. The NHS said that unlike a cold, flu symptoms can come on very quickly and can include a sudden high temperature that appears within a few hours. With a cold, a high temperature would appear gradually. Flu can cause a headache, dry cough and aching body - while a cold mainly affects your nose and throat. And flu can leave you feeling too exhausted to carry on as normal - unlike a cold, which leaves you feeling tired. In children, flu symptoms can include an earache and a drop in energy. Professor Julian Redhead, national director for urgent care for NHS England, said this flu season would be a \"big challenge\" for the health service. \"I think it's going to be a big challenge for us as we go forward because it just increases the pressure. \"I mean, at the moment we've got around, say 1,500, maybe 2,000 patients in hospital with flu and the predictions are that it will rise to somewhere between 5,000 and 8,000. \"So you can see the pressure that will be put on the system will be very large and that's why we're concerned.\" Professor Redhead also warned people not to underestimate the virus. Even for normally healthy people the effects of flu could be quite serious. He said: \"Anyone can be at risk of severe flu and it does carry complications, which people won't necessarily recognise because it can affect the heart and lungs and things like this. \"Clearly, it's the most vulnerable population that we're really worried about and what happens for them, is they can get bacterial infections on top of the flu and end up with things like pneumonia, which can be really, really serious. \"And we see patients going into ITU in these circumstances every year and that puts pressure into the ITU systems as well. \"So yes, it can be dangerous. It is mainly the very old and very young, where we see the complications. \"But remember that the increase at the moment is very much in the younger population and the danger is it then transmits into the older, more vulnerable population and that's what we want to try to prevent.\""
    },
    {
        "title": "King and Queen choose 20th wedding anniversary portrait for Christmas card",
        "description": "The King and Queen have released their Christmas card for this year, featuring a portrait of the royal couple arm in arm as they celebrated their 20th anniversary.",
        "url": "https://news.sky.com/story/king-and-queen-choose-20th-wedding-anniversary-portrait-for-christmas-card-13480145",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-queen-king-christmas_7103265.jpg?20251206211408",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-06 16:15:00",
        "Headline": "The photograph was taken earlier this year as the couple visited Villa Wolkonsky, the British ambassador's residence in Rome, Italy.",
        "Content": "The King and Queen have released their Christmas card for this year, featuring a portrait of the royal couple arm in arm as they celebrated their 20th anniversary. The photograph was taken earlier this year as the couple visited Villa Wolkonsky, the British ambassador's residence in Rome, Italy. It is framed inside the card by a dark red border, with the printed message in a matching colour on the opposite side reading \"Wishing you a very Happy Christmas and New Year\". Charles and Camilla's wedding anniversary on 9 April came on the same day they met Pope Francis, who died less than two weeks later at the age of 88. In the image, taken by royal photographer Chris Jackson, Camilla is wearing a white and beige coat dress by Anna Valentine and a lily of the valley brooch, while the King is dressed in a blue pinstripe suit with a grey tie and a silk handkerchief in his chest pocket. The Christmas card is the couple's fourth since Charles ascended to the throne. Hundreds of copies are sent out every year to family, friends, world leaders, diplomats, charities and organisations. \n                  Celebrities join the Princess of Wales for a carol service to thank Britain's volunteers\n                 \n                  Melania Trump unveils White House Christmas decorations\n                 \n                  Is Die Hard a Christmas film? The public have spoken - and you might not like the result \n                 For last year's Christmas card, Charles and Camilla chose a picture of them smiling in the Buckingham Palace garden. Read more:Watch: King's full speech at state banquetAndrew Mountbatten-Windsor officially stripped of two more titles The year before that, the card showed the royal couple in the Throne Room at the Palace following the coronation. The picture, by Hugo Burnand, showed Charles wearing the Imperial State Crown, coronation tunic and the robe of estate, with Camilla wearing Queen Mary's Crown.  On Friday, the Prince and Princess of Wales and their children attended the Together at Christmas carol service, where they were joined by Hollywood stars including Kate Winslet and singer Katie Melua. But the focus of Kate's annual service at Westminster Abbey was the UK's local communities and the princess took the time beforehand to thank volunteers from across the country."
    },
    {
        "title": "Nigel Farage sang antisemitic songs to Jewish classmates, former Dulwich pupil claims",
        "description": "Nigel Farage sang antisemitic songs to Jewish schoolmates - and had a \"big issue with anyone called Patel\", a former schoolfriend has claimed.",
        "url": "https://news.sky.com/story/nigel-farage-sang-antisemitic-songs-to-jewish-classmates-former-dulwich-pupil-claims-13479621",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nigel-farage-reform_7100997.jpg?20251204151817",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-06 05:00:00",
        "Headline": "Two former Dulwich pupils have spoken to Sky News about their time at the school with Nigel Farage.",
        "Content": " Nigel Farage sang antisemitic songs to Jewish schoolmates - and had a \"big issue with anyone called Patel\", a former schoolfriend has claimed. Jean-Pierre Lihou, 61, was initially friends with the Reform UK leader when he arrived at Dulwich College in the 1970s, at the time when Mr Farage is accused of saying antisemitic and other racist remarks by more than a dozen pupils. But Mr Lihou, who is half-German and said he went for a couple of sleepovers at Mr Farage's parent's house, told Sky News' Amanda Akass that it \"soon become obvious he was not quite the same person I thought he was\". Warning: This article contains references to antisemitic slurs which readers may find offensive Another former pupil, Stefan Benarroch, who was in the year below Mr Farage and is Jewish, said that Mr Farage was \"not a kid\" when he made alleged antisemitic remarks and his behaviour was \"unacceptable in any era\". Mr Farage has said he \"never directly racially abused anybody\" at Dulwich and said there is a \"strong political element\" to the allegations coming out 49 years later. Reform's deputy leader Richard Tice has called the ex-classmates \"liars\". A Reform UK spokesman accused Sky News of \"scraping the barrel\" and being \"desperate to stop us winning the next election\". 'People were hurt by it' Mr Lihou told Sky News Mr Farage used to direct antisemitic songs at his Jewish friend Peter Ettedgui, who is one of the main former classmates to have spoken out against the Reform leader. \"He used to sing: 'Gas them all, gas them out, gas them all, into the chambers they crawl' - and the rest of those horrible words,\" he said. \"You think, when somebody is obviously distressed by that, why do you keep doing it? The humour wears off... when you see this, and because I'm German I'm particularly sensitive to anyone making that kind of analogy.\" Mr Lihou also said Mr Farage used to \"pass comment on anyone that wasn't white, particularly Indians\". He said: \"He had a great big issue with anyone called Patel because I think the school had at one point more Patels than Smiths. That seemed to irk him. \"Anybody who wasn't white, he was likely to have a comment pretty much throughout my school life, especially Jewish people. I think that was the worst thing because you could obviously see that people were hurt by it.\" 'He was truly ghastly' Mr Benarroch, who was also friends with Mr Ettedgui, told Sky News: \"His behaviour as a teenager was unacceptable by any standards and in any era. He was truly ghastly at Dulwich College.\" He said he would never have come across Mr Farage \"had I not been a Jew\". \"He and his minions - and one of his minions, in particular, was my tormentor at Dulwich - they would spot us coming out of Jewish prayers on a Friday,\" he added. \"So his behaviour at 16, 17, 18 - and you are a man at 18, you're technically an adult - was truly appalling. So we're not talking about a kid here.\" The property developer said the racism allegations are \"not just about Nigel Farage as a teenager, this is also about Nigel Farage as an adult\". \"His behaviour as a teenager was unacceptable by any standards and in any era. He was truly ghastly at Dulwich College,\" he added.  'These things don't leave you' Mr Benarroch, who is no longer a practising Jew, added: \"I was terrified of his bullies, he had these guys hanging around with him who were instructed to have a go at us as these young, nice Jewish boys. \"I don't recall ever having direct contact with Nigel Farage, but certainly I was very much a witness to his tormenting of others, especially Peter Ettudgui. \"He [Mr Farage] was so extreme, these things don't leave you, they don't leave your body, as such.\" On Thursday, Mr Farage launched into a tirade at the BBC after one of its reporters asked about the claims, with the politician reading out a letter he said was from someone he went to school with. He quoted the unnamed Jewish pupil as saying there was \"plenty of macho, tongue-in-cheek schoolboy banter\" and said sometimes it \"was offensive, but never with malice\". Political correspondent Allegations about Nigel Farage's schooldays have hit the headlines since the early days of the Brexit campaign in 2013. He has always dismissed such claims as 'politically motivated' and insisted recently he has 'never directly racially abused anybody'. But now with the prospect of Prime Minister Farage looking ever more likely - former classmates have decided now is the moment to speak up about their concerns, almost fifty years later. The allegations are deeply shocking. The problem for Farage is that far from going away – the story is only getting bigger. Reform have hit back against our story in bullish fashion, accusing Sky News of scraping the barrel in a desperate attempt to stop Reform UK winning the next election. Of course, the question of who will win the next election isn't down to journalists – but voters. Read more Read more: Farage dismisses school racism claims as 'banter in a playground'Farage needs to explain 'racist' comment allegations, says PM 'It was not schoolboy banter' Mr Benarroch rejected Mr Farage's claim it was just \"schoolboy banter\" and said he has continued to show the same views, just in a less obvious way. \"You tell that [that it was banter] to the guys, to Peter who had 'Hitler should have gassed you' said to him,\" he said. \"Peter Ettedgui was tormented by Nigel Farage. \"The point I'm making is, he's a grown man now. He's a highly intelligent politician with nuance when it suits him, and so clearly he's not going around saying 'Hitler should have gassed you all', obviously.\" The former Dulwich student said Mr Farage had \"kept the most disgraceful company imaginable\" in the US during the 2010s on radio and TV shows.  He specifically named Rick Wiles, a far-right American conspiracy theorist whose YouTube channel was banned in 2020 after calling Donald Trump's impeachment a \"Jew coup\". Mr Benarroch, who said he is not part of any political party, said \"there is no political motivation\" behind his allegations, but accused Reform and Mr Farage of making \"a political statement\" by calling them liars. On Thursday, Mr Farage said he had received multiple letters from former pupils in support of him. He said a letter from a Jewish schoolmate, said: \"While there was plenty of macho tongue-in-cheek schoolboy banter, it was humour, and yes, sometimes it was offensive... but never with malice. \"I never heard him [Farage] racially abuse anyone.\" A Reform UK spokesman \"accused Sky News of scraping the barrel\". He said: \"This ridiculous interview has nothing to do with Nigel Farage himself but apparently someone who knew him at school almost 50 years ago. \"Sky News are desperate to stop us winning the next election.\""
    },
    {
        "title": "Charlton Athletic fan dies and match abandoned after medical emergency at ground",
        "description": "A Charlton Athletic fan died after a medical emergency at their ground, the football club have said.",
        "url": "https://news.sky.com/story/charlton-athletic-fan-dies-and-match-abandoned-after-medical-emergency-at-ground-13480109",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-charlton-athletic-the-valley_7102817.jpg?20251206160214",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-06 15:32:00",
        "Headline": "No subtitle found",
        "Content": "A Charlton Athletic fan died after a medical emergency at their ground, the football club have said. The side's EFL Championship match against Portsmouth at The Valley, a lunchtime kick-off, was halted in the 12th minute while the supporter initially received treatment, and was subsequently postponed. The score was 0-0. In a statement, Charlton Athletic said it was \"devastated\", and thanked the staff and first responders who did everything they could during the incident. \"The club are grateful to supporters in attendance and the Portsmouth players and staff for their patience and understanding as this tragedy unfolded. \"Everyone at the club sends their heartfelt condolences to the supporter's family and friends at this incredibly difficult time.\" Charlton Athletic captain Greg Docherty paid tribute to the fan on X: \"Absolutely devastating news… from all of the players at the club our thoughts are with his family and friends through this extremely difficult time,\" followed by a broken heart emoji. Both clubs said information on when the match would be rescheduled will be announced in due course. Portsmouth also paid tribute on its website, saying it was also \"devastated\". \"Our thoughts and deepest condolences are with their family and friends at this difficult time,\" said Portsmouth in a statement on their website. The EFL posted on X: \"Our deepest condolences go out to the supporter's family, friends and all @CAFCofficial at this incredibly difficult time,\" followed by a love heart emoji."
    },
    {
        "title": "Elderly woman killed in hit-and-run crash on way to shops in Liverpool",
        "description": "An elderly woman has died after being hit by a car on her way to a local shop.",
        "url": "https://news.sky.com/story/elderly-woman-killed-in-hit-and-run-crash-on-way-to-shops-in-liverpool-13479992",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-liverpool-fazakerley_7102491.png?20251206115839",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-06 11:45:00",
        "Headline": "Police make a direct appeal to the driver after the woman, who was walking to her local shop in Fazakerley was killed on Friday afternoon.",
        "Content": "An elderly woman has died after being hit by a car on her way to a local shop. The woman, aged 81, was hit by a dark-coloured car, which failed to stop, in Longmoor Lane, Fazakerley, Liverpool, at about 4.15pm on Friday. Officers said the woman died a short time later in Aintree Hospital after suffering serious injuries. Merseyside Police are searching for the driver.  The road was cordoned off while forensic examinations were carried out, but was reopened by Saturday morning. \"The 81-year-old victim had only popped out to shops, and now her family are trying to come to terms with her loss,\" said Superintendent Siobhan Russell. \n                  Four years after Sarah Everard's murder, women still feel unsafe on Britain's streets\n                 \n                  Your Party: Old infighting habits die hard at new left-wing party's acrimonious Liverpool conference\n                 \n                  Paul Doyle in tears as he admits driving into fans at Liverpool FC trophy parade\n                 \"Specialist officers are providing them with support at this tragic time.\" Meanwhile, police are appealing to anyone who has any footage of the incident, including from CCTV, doorbells and dashcams. \"At this stage of the investigation, the full circumstances of the incident are still being established, and I would like to take this opportunity for the driver of the car to search their conscience and come forward,\" said Ms Russell. \"I would also like to appeal to anyone who has any information which could help us identify the driver to come forward.\" She said officers were searching for the car, which may have suffered damage from the crash and may have been parked up or abandoned. Anyone who may have information on the crash can call Merseyside Police on 0151 777 5747, or email SCIU@merseyside.police.uk quoting 0620 of December 5."
    },
    {
        "title": "Scotland's 2am kick off 'difficult' for kids but 'pubs will do a roaring trade', says manager Clarke",
        "description": "At least for the Tartan Army travelling to the United States the World Cup schedule is favourable. ",
        "url": "https://news.sky.com/story/scotlands-2am-kick-off-difficult-for-kids-but-pubs-will-do-a-roaring-trade-says-manager-clarke-13480394",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-scotland-world-cup_7102136.jpg?20251205185940",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-12-06 21:40:00",
        "Headline": "FIFA stretched out the World Cup draw into an additional day in Washington, adding a second half with another show that revealed the exact schedule for teams.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  At least for the Tartan Army travelling to the United States the World Cup schedule is favourable.  Less so for the fans staying in Scotland - with England benefitting from more social kickoff times to watch from home. FIFA stretched out the World Cup draw into an additional day in Washington, adding a second half with another show that revealed the exact schedule for teams. Fans can start planning their trips for the first World Cup to be spread across three countries. But England and Scotland will only play in Canada or Mexico depending on their progress in the tournament - with FIFA deciding their entire group stages in June should be played in the United States after a complex night of deciding between venue options and kickoff times. Scotland's group stage is all on the east coast of the US with the first two matches in Boston in a 60,000-plus capacity stadium used by the NFL's New England Patriots. But while the second Group C game against Morocco is at 6pm (11pm in Scotland), the opener against Haiti is at 9pm which is 2am at home. \n                  Donald Trump may get the one thing he craves more than anything today\n                 \n                  Is Trump's latest peace deal a total sham?\n                 \n                  Trump 'never rules anything out' to ensure World Cup's safety, key aide tells Sky News\n                 \"I'm sure the pubs will do a roaring trade,\" Scotland manager Steve Clarke told Sky News. \"Good for the adults. They'll be able to stay up late and watch it. \"Maybe a little bit more difficult for the kids but I'm sure a lot of Scottish kids will be sleeping in the morning after watching the games.\" Conditions should be cooler in Boston than Miami where the temperature is likely to be 20C and rising even at 6pm for the clash with Brazil - which is at 11pm BST. Clarke said: \"We've got to go out and find a suitable base, get ourselves settled in and make sure we've got everything right for the players so that they can perform during the maximum. That's the next job.\" Every England game will be finished for viewers at home by midnight. The Club World Cup last summer showed how heat and thunderstorms can pose health challenges and even delay matches. The potential for fierce 30C summer heat at 3pm (9pm BST) will be avoided for England in Dallas for the opener against Croatia because the 70,000-seat Cowboys stadium is climate-controlled inside. \"England has always been on our list, we hope we get England here,\" Monica Paul, executive director of the Dallas Sports Commission, told Sky News. \"We love the tradition and history of what soccer means to the English fans. So really ready to welcome them to Dallas. \"I think we're going to have enough beer, but we'll start working on that now too as well as positioning our pubs to welcome all those English fans.\" Read more:Unapologetically political - a World Cup draw like no otherEngland and Scotland's World Cup match schedule revealed It's also a 9pm kickoff back in England for the second Group L match against Ghana - 4pm in Boston. Could Ghana benefit from Scotland fans sticking around Boston from their match against Morocco four days earlier, a day before they'd need to be in Miami? England complete the group against Panama, kicking off at 5pm in New Jersey - 10pm at home. It's the stadium where they hope to return for the final on 19 July. It's the biggest, longest World Cup with the jump from 32 to 48 teams requiring 104 matches rather than 64 previously. It will take 64 matches just to complete the group stage. Fans can start saving up cash and hope they are not priced out by dynamic pricing but secure fixed-priced tickets. And Saturday in FIFA world was fully in football mode with Donald Trump sitting out the second leg of the draw ceremony. Additional reporting by Tyrone Francis"
    },
    {
        "title": "Prostate cancer treatment with potential for fewer side effects to be trialled in UK",
        "description": "A groundbreaking trial for a prostate cancer treatment has been launched in the UK, with the hope of reducing the side effects.",
        "url": "https://news.sky.com/story/prostate-cancer-treatment-with-potential-for-fewer-side-effects-to-be-trialled-in-uk-13479965",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-prostate-cancer-brca_7094466.jpg?20251128130222",
        "type": "UK",
        "Author": "Bethany Minelle, news reporter",
        "Date Published": "2025-12-06 09:21:00",
        "Headline": "The therapy - which involves a robotic-assisted, high-pressure water jet - is less invasive than traditional surgery.",
        "Content": "By Bethany Minelle, news reporter  A groundbreaking trial for a prostate cancer treatment has been launched in the UK, with the hope of reducing the side effects. Backed by the government-funded National Institute for Health and Care Research (NIHR), the trial will examine whether Aquablation - a therapy using robotics, AI and real-time imaging - works as well or better than traditional surgery. Currently, the entire prostate gland is removed in a bid to cure men of prostate cancer, in a procedure called radical prostatectomy. It is only suitable for men whose cancer has not spread outside of the prostate gland or has spread to the area just outside the gland, and carries a risk of serious side effects, such as infection, erectile dysfunction and urinary problems.  With Aquablation, which is less invasive, experts hope to minimise these issues. The new therapy, which involves a robotic-assisted, high-pressure water jet, allows surgeons to map the entire prostate in real time with ultrasound. \n                  Why prostate cancer is expected to be left as the only major cancer without national screening\n                 \n                  Prostate cancer: NHS screening programme could come one step closer today\n                 \n                  Calls grow for national screening programme for prostate cancer\n                 Using the technique, medics find cancerous tissue to remove while avoiding surrounding nerves and muscles associated with erectile function and the bladder. Aquablation is currently used in some centres to treat benign prostatic hyperplasia (BPH).  An 'incredibly exciting' alternative surgical treatment The new trial - which is sponsored by US company Procept BioRobotics - is being run in seven countries. The four UK centres are the Royal Marsden, Guy's and St Thomas' NHS Foundation Trust, the Royal Free London NHS Foundation Trust and Norfolk and Norwich University Hospitals NHS Foundation Trust. Overall, 280 patients will be recruited globally, all with early-stage, localised prostate cancer who have already decided to have surgery. Philip Charlesworth, consultant urological surgeon at the Royal Marsden, said: \"For men with prostate cancer confined to the prostate, curative options are excellent, however we are becoming increasingly focused on the side effects of the cancer treatment and how we can embrace new technology to maintain a man's quality-of-life following their surgery. \"This trial is measuring Aquablation therapy, which uses a robotic approach to surgically remove the cancer, and to preserve a man's ability to remain continent and maintain sexual activity.\" Calling the trial \"an incredibly exciting prospect for the future of prostate cancer care\", he said positive results could lead to the addition of \"an alternative surgical treatment option for patients with localised prostate cancer across the globe\". Other potential treatments for localised prostate cancer include active surveillance or monitoring of the cancer and radiation. Cases on the rise Figures from Prostate Cancer UK suggest about one in eight men will have the cancer in their lifetime. A total of 58,218 men were diagnosed with prostate cancer in England last year - an increase of almost 9% compared with 2023. Last month, scientific advisers said prostate cancer screening should not be made routinely available for the vast majority of men in the UK, telling the government they would be \"likely to cause more harm than good\". For now, the committee will put forward only a recommendation to screen men with BRCA1 and BRCA2 genetic mutations - which puts them at far higher risk of prostate cancer - every two years, between the ages of 45 and 61. Health Secretary Wes Streeting said he was \"surprised\" by the decision. In recent months, there has been growing pressure for screening from high-profile public figures such as Olympian Sir Chris Hoy and former Sky News presenter Dermot Murnaghan. Both have been diagnosed with advanced prostate cancer. Former prime minister Lord Cameron had also backed the campaign for screening after revealing he had been treated for prostate cancer."
    },
    {
        "title": "Crumble and custard thrown at State Crown display case in Tower of London",
        "description": "Part of the Tower of London has been closed following reports of criminal damage to a display case containing the Imperial State Crown, part of the Crown Jewels.",
        "url": "https://news.sky.com/story/tower-of-london-closed-after-display-case-containing-state-crown-defaced-13479937",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-take-back-power-crown-jewels_7102582.jpg?20251206133656",
        "type": "UK",
        "Author": "Bethany Minelle, news reporter",
        "Date Published": "2025-12-06 11:30:00",
        "Headline": "The State Crown forms part of the Crown Jewels, a priceless collection considered to be the most famous of the nation's treasures.",
        "Content": "By Bethany Minelle, news reporter  Part of the Tower of London has been closed following reports of criminal damage to a display case containing the Imperial State Crown, part of the Crown Jewels. Police said four protesters had been arrested following the incident just before 10am on Saturday. They said it was reported that food had been thrown onto the case before two protesters left the scene. Footage of the incident appears to show one demonstrator removing the large foil tray of apple crumble from a bag and slamming it against the glass. Meanwhile, another pours a tub of bright yellow custard on the front of the case. They then held up a sign which read \"Democracy has crumbled - Tax the rich\". Police said in a statement: \"Officers worked closely with City of London Police and security officers and four people have been arrested on suspicion of criminal damage. They have taken into custody. \n                  Nursery worker, 45, pleads guilty to 26 sexual offences against children\n                 \n                  Man killed in Christmas Day 'trail of carnage', court told\n                 \n                  JPMorgan Chase unveils plans to build new £10bn 'landmark tower' in London - double the size of The Shard\n                 \"The Tower has been closed to the public while the police investigation continues.\" The Metropolitan Police later said only the Jewel House at the Tower had been closed to the public while investigations continued. A spokesperson for Historic Royal Palaces confirmed The Crown Jewels had not been damaged. Take Back Power - which describes itself as a new non-violent civil resistance group - claims it was responsible. The Imperial State Crown is built on a gold frame, with silver gem mounts housing 2868 diamonds, 269 pearls, 17 sapphires and 11 emeralds. Fitted with a purple velvet cap and ermine band, some of the stones are famous in their own right, named the \"Stuart Sapphire\" and \"Black Prince's Ruby\". It was originally made for King George VI in 1937, but is still used for major royal events, including the annual State Opening of Parliament. It forms part of the Crown Jewels - a priceless collection which includes orbs, sceptres and crowns - and is considered to be the most famous of the nation's treasures."
    },
    {
        "title": "Piers Morgan's Uncensored nears £100m valuation after stake sale",
        "description": "Piers Morgan, the broadcaster and journalist, is raising tens of millions of dollars of funding from heavyweight investors as he seeks to turn Uncensored, his YouTube-based venture, into a broad-based global media business.",
        "url": "https://news.sky.com/story/piers-morgan8217s-uncensored-nears-163100m-valuation-after-stake-sale-13479949",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-piers-morgan-broadcaster_7101776.jpg?20251205130745",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-06 07:27:00",
        "Headline": "The US-based merchant bank Raine and Greek media mogul Theo Kyriakou are among the backers of the former Mirror editor and CNN anchor as he raises funds to grow the Uncensored media brand, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n  Piers Morgan, the broadcaster and journalist, is raising tens of millions of dollars of funding from heavyweight investors as he seeks to turn Uncensored, his YouTube-based venture, into a broad-based global media business. Sky News can exclusively reveal that Mr Morgan is in the process of finalising a roughly $30m (£22.5m) fundraising for Uncensored that will give it a pre-money valuation of about $130m (£97m). The new investors are understood to include The Raine Group, the New York-based merchant bank, and Theo Kyriakou, the media mogul behind Greece's Antenna Group, owner of a stake in London-based digital venture The News Movement. Michael Kassan, a marketing veteran, is understood to be advising the business on advertising-related matters and may also invest in a personal capacity, according to insiders. A number of family offices from around the world are also said to be in talks to become shareholders in Uncensored. Joe Ravitch, the prominent American banker and Raine co-founder who has advised in recent years on the sale of Chelsea and Manchester United football clubs, is said to be joining the Uncensored board as part of the capital-raising. The move comes nearly a year after Mr Morgan announced his departure from Rupert Murdoch's British empire through a deal which handed him full control and ownership of his Uncensored YouTube channel. \n                  TalkTV to be taken off air after two years to focus on streaming - as GB News reports heavy losses\n                 \n                  Piers Morgan leaving TalkTV to focus on YouTube channel\n                 \n                  Ex-Mirror journalist says he was asked to give Coronation Street star flowers containing listening device\n                 Allies of Mr Morgan said this weekend that some details of the fundraising were likely to be confirmed publicly in the coming days. While the size of his personal stake in the business was unclear this weekend, insiders said the crystallisation of a $130m valuation would mean that Mr Morgan's economic interest was, on paper, worth tens of millions of pounds. \"The ambition is to grow this into a billion dollar company within a few years,\" said one person close to the discussions with investors. \"With the scale of audiences now being driven to digital channels and the commercial opportunities there, that is definitely achievable.\" The former Mirror editor, whose career has also encompassed stints at ITV, with CNN in the US and Mr Murdoch's global media conglomerates News Corporation and Fox, is now drawing up plans to transform Uncensored into a more diverse digital media group. This is expected to include the launch of a series of 'verticals' attached to the Uncensored brand, including channels dedicated to subjects such as history, sport and technology. Mr Morgan is already said to be in talks with prominent figures to spearhead some of these new strands, with a chief executive also expected to be recruited to drive the growth of the overall Uncensored business. His appetite to establish a YouTube-based global media network has been driven by the scale of the global audiences he has drawn to some of his recent work, including interviews with the footballer Cristiano Ronaldo and the former world tennis number one Novak Djokovic. Both of those athletes have collaborated with Mr Morgan by posting parts of their exchanges on social media platforms, attracting hundreds of millions of views. Mr Morgan's access to President Donald Trump, whom he has interviewed on several occasions, is also likely to be a factor in the timing of Uncensored's expansion strategy. While many 'legacy' news and media networks remain hamstrung by inflated cost bases, Mr Morgan's decision to go it alone and focus on developing the Uncensored brand reflects his belief that the news and media industries are ripe for disintermediation by channels tied to prominent, and sometimes controversial, individual journalists and presenters. The Piers Morgan Uncensored YouTube channel has 4.3 million subscribers, roughly half of whom are from the US. Of the remaining 50%, however, only a minority are British, with a significant number based in the Middle East, South Africa and parts of Asia. This has fuelled Mr Morgan's view that there is journalistic and commercial mileage in creating content on issues which historically might have struggled to generate a significant international audience - such as ongoing military and political tension between India and Pakistan, and the white farmer 'genocide' furore in South Africa. Under the deal he struck with Mr Murdoch in January this year, Mr Morgan has a four-year revenue-sharing agreement that involves News UK receiving a slice of the advertising revenue generated by Piers Morgan Uncensored until 2029. Mr Morgan had returned to Mr Murdoch's media empire in January 2022 with a three-year agreement that included writing regular columns for The Sun and New York Post, as well as presenting shows on the company's now-folded television channel, Talk TV. He also recently released a book, Woke Is Dead, which was published by Mr Murdoch's books subsidiary, Harper Collins. As part of his new arrangements, Mr Morgan also signed a deal with Red Seat Ventures, a US-based agency which partners with prominent media figures and influencers to help them exploit commercial opportunities through sponsorship and other revenue streams. Among those Red Seat has worked with are Megyn Kelly, the American commentator, and Tucker Carlson, the former Fox News presenter. While many well-known American news media figures are followed because of their partisanship and affiliations to either the political left or right, Mr Morgan has positioned himself as a 'ringmaster' who is not ideologically hidebound. His plans come at a time of continuing upheaval in the global media industry, with Netflix agreeing a landmark $83bn deal this week to buy the Hollywood studio Warner Bros. In the UK, Sky, the Comcast-owned immediate parent company of Sky News, is in talks to acquire ITV's broadcasting business, while the Daily Telegraph newspaper could soon find itself as a stablemate of the Daily Mail if a proposed £500m deal is successful. Meanwhile, Reach, the London-listed newspaper publisher which owns the Daily Express and the Daily Mirror, now has a market valuation of just £176m - less than double that of Mr Morgan's new standalone digital media company. When Sky News revealed Mr Morgan's move to separate from News UK earlier this year, he said: \"Owning the [Uncensored] brand allows my team and I the freedom to focus exclusively on building Uncensored into a standalone business, editorially and commercially, and in time, widening it from just me and my content. \"It's clear from the… US election that YouTube is an increasingly powerful and influential media platform, and Uncensored is one of the fastest-growing shows on it in the world. \"I'm very excited about the potential for Uncensored.\" This weekend, he added: \"I am very excited that some of the most experienced and successful players in the global media industry, like Joe, Michael and Theo, share my ambitious vision for Uncensored. \"This is the future of modern media.\""
    },
    {
        "title": "Russia hits Ukraine with missile and drone attack - as Zelenskyy notes 'substantive call' with US officials",
        "description": "Russia launched a massive missile and drone attack on Ukraine overnight into Saturday, as President Volodymyr Zelenskyy said he had a \"substantive phone call\" with US officials aimed at ending the nearly four-year war.",
        "url": "https://news.sky.com/story/russia-hits-ukraine-with-massive-missile-and-drone-attack-amid-peace-talks-13480113",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ukraine-russia_7102449.jpg?20251206105515",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-06 15:39:00",
        "Headline": "The two sides also noted any \"real progress toward any agreement\" ultimately will depend \"on Russia's readiness to show serious commitment to long-term peace.\"",
        "Content": "Russia launched a massive missile and drone attack on Ukraine overnight into Saturday, as President Volodymyr Zelenskyy said he had a \"substantive phone call\" with US officials aimed at ending the nearly four-year war. Ukrainian and US officials noted any \"real progress toward any agreement\" ultimately would depend \"on Russia's readiness to show serious commitment to long-term peace.\" \"Ukraine is determined to keep working in good faith with the American side to genuinely achieve peace,\" Zelenskyy wrote on social media. It comes after Russia launched 653 drones and 51 missiles in its attack on Ukraine, triggering air raid alerts across the country overnight into Saturday, Ukraine's air force said.  Ukrainian forces shot down and neutralised 585 drones and 30 missiles, the air force said, adding that 29 locations were struck. At least eight people were wounded in the attacks, Ukraine's minister of internal affairs Ihor Klymenko said. Russia conducted a \"massive missile-drone attack\" on power stations and other energy infrastructure in several regions, Ukraine's national energy operator Ukrenergo said on Instagram. Ukraine's Zaporizhzhia nuclear power plant temporarily lost all off-site power overnight, the International Atomic Energy Agency said. The plant is in an area that has been under Russian control since early in Moscow's invasion of Ukraine. It is not in service, but needs reliable power to cool its six shutdown reactors and spent fuel in order to avoid any catastrophic nuclear incidents. Read more from Sky News:Young Germans fear return to conscriptionGiving up territory would be 'unjust', says Kyiv armed forces chief Zelenskyy condemns 'meaningless' strikes The Ukrainian president condemned the strikes as \"meaningless\" from a military point of view. He said energy facilities were the main targets, but a drone strike had \"burned down\" a train station in the city of Fastiv, in the Kyiv region. \"The Russians' goal is to hurt millions of Ukrainians, and they have sunk so low that they are launching missiles at peaceful cities on St. Nicholas Day,\" he said. \"That is why additional pressure is needed. Sanctions must work, and so must our air defence, which means we must continue to support those who defend our lives.\" Ukraine strikes oil refinery Meanwhile, Russia's defence ministry said its air defences had shot down 116 Ukrainian drones over Russian territory overnight. The General Staff of the Ukrainian Armed Forces said Ukrainian forces had struck Russia's Ryazan Oil Refinery, while Russian Telegram news channel Astra shared footage appearing to show a fire breaking out and plumes of smoke rising above the refinery. Over the last few months, Ukraine has used long-range drones to target Russian refineries in an attempt to deprive Moscow of the oil export revenue it needs to continue the war. Kyiv and its Western allies say Russia is trying to cripple Ukraine's power grid and deny civilians access to heat, light and running water in winter, which Ukrainian officials call \"weaponising\" the cold."
    },
    {
        "title": "At least 23 people dead after fire at nightclub in Goa, India",
        "description": "At least 23 people have been killed after a fire at a nightclub in Goa, India.",
        "url": "https://news.sky.com/story/at-least-23-people-dead-after-fire-in-goa-india-13480407",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-breaking-breaking-news_7042253.png?20251023123455",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-06 22:41:00",
        "Headline": "An official has ordered an inquiry into the deadly fire, while Indian Prime Minister Narendra Modi said the incident was \"deeply saddening\".",
        "Content": " At least 23 people have been killed after a fire at a nightclub in Goa, India. Dr Pramod Sawant, Goa's chief minister, said a \"major fire incident at Arpora has taken the lives of 23 people\". \"I am deeply grieved and offer my heartfelt condolences to all the bereaved families in this hour of unimaginable loss,\" he said. Local media reported the fire took place in a nightclub around midnight on Saturday. The majority of victims are believed to be staff at the club - although some tourists are thought to be among those killed, local media reports. Videos on social media showed emergency services lining up to help the injured - some of whom were taken to nearby hospitals. Authorities worked through the night to bring the situation under control and all bodies have been recovered, the state's police chief told reporters, according to Reuters news agency. \n                  Russia hits Ukraine with missile and drone attack - as Zelenskyy notes 'substantive call' with US officials\n                 \n                  Gaza ceasefire negotiations at 'critical moment', says Qatar PM\n                 \n                  Paramilitary drone attack in southern Sudan kills at least 50 people, including 33 children\n                 India's Prime Minister Narendra Modi said the deadly fire was \"deeply saddening\". He said he had spoken with Goa's chief minister and that \"the state government is providing all possible assistance to those affected\". Dr Sawant said he has \"ordered an inquiry\" to discover what happened after visiting the site. \"The inquiry will examine the exact cause of the fire and whether fire safety norms and building rules were followed,\" he said. \"Those found responsible will face most stringent action under the law - any negligence will be dealt with firmly.\" Goa, a small state on India's western coast, is a popular tourist destination, attracting millions of tourists every year."
    },
    {
        "title": "Gaza ceasefire negotiations at 'critical moment', says Qatar PM",
        "description": "Negotiations on a lasting ceasefire deal for Gaza are at a \"critical moment\", the prime minister of Qatar, which has played a key role in brokering the deal, has said.",
        "url": "https://news.sky.com/story/gaza-ceasefire-negotiations-at-critical-moment-says-qatar-pm-13480180",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-qatar-forum_7103052.jpg?20251206175756",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-06 16:38:00",
        "Headline": "The first stage of a ceasefire deal was agreed in October, but violence in Gaza has not stopped. On Saturday alone, seven people were reportedly killed.",
        "Content": "Negotiations on a lasting ceasefire deal for Gaza are at a \"critical moment\", the prime minister of Qatar, which has played a key role in brokering the deal, has said. Sheikh Mohammed bin Abdulrahman said a definitive ceasefire could only happen with a full withdrawal of Israeli troops from the besieged enclave. The first stage of a ceasefire deal was agreed in October, but violence in Gaza has not stopped. On Saturday alone, seven people were reportedly killed. Palestinian local health authorities said the victims were from Beit Lahiya, Jabalia and Zeitoun in northern Gaza and included a 70-year-old woman who was killed by a drone strike.  The Israeli military said that in two separate incidents on Saturday, forces deployed in northern Gaza behind the so-called yellow line of withdrawal agreed in the ceasefire had fired on Palestinian militants who crossed the line, killing three. The military was unaware of any drone strike, a spokesperson said. The long-sought ceasefire - and the second one after a first deal fell apart earlier this year - began on 11 October after Israel and Hamas agreed to the first phase of Donald Trump's 20-point peace plan. \n                  12-year-old girl from Gaza receives vital brain operation after Israeli bombing near her home\n                 \n                  Gaza longs for normality, but quasi-anarchy reigns and Hamas is once again exerting control\n                 \n                  Anti-Hamas militia leader Yasser Abu Shabab killed in Gaza Strip - reports\n                 Despite accusations by both sides of violations, talks on the next phase of the ceasefire deal began almost two weeks ago, with Turkish, Qatari and Egyptian officials meeting in Cairo to discuss the second part of the agreement, including deploying a stabilisation force and body to govern Gaza and oversee reconstruction.  Read more:Two brothers killed in Israeli drone strike on GazaGaza child has vital operation \"We are at a critical moment. It's not yet there. So what we have just done is a pause,\" PM al-Thani said during a panel discussion at the Doha Forum conference in Qatar. \"We cannot consider it yet a ceasefire. A ceasefire cannot be completed unless there is a full withdrawal of the Israeli forces - (until) there is stability back in Gaza, people can go in and out - which is not the case today.\" On Thursday, an Israeli delegation held talks in Cairo with mediators on the return of the body of the last hostage held in Gaza, which would complete an initial part of Mr Trump's plan to bring an end to the two-year war. Since the truce started, Hamas has returned all 20 living hostages and 27 bodies in exchange for around 2,000 Palestinian detainees and convicted prisoners."
    },
    {
        "title": "Paramilitary drone attack in southern Sudan kills at least 50 people, including 33 children",
        "description": "At least 50 people, including 33 children, have been killed in southern Sudan after a drone attack by paramilitary forces hit a nursery in South Kordofan state.",
        "url": "https://news.sky.com/story/paramilitary-drone-attack-in-southern-sudan-kills-at-least-50-people-including-33-children-13480056",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-babanusa-sudan_7098253.jpg?20251206144226",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-06 14:02:00",
        "Headline": "Humanitarian groups in Sudan have reported further strikes on paramedics responding to the attack, and a nearby civilian site",
        "Content": "At least 50 people, including 33 children, have been killed in southern Sudan after a drone attack by paramilitary forces hit a nursery in South Kordofan state. Sudan Doctors' Network says paramedics on the scene in the town of Kalogi were also targeted by the Rapid Support Forces (RSF) in a \"second unexpected attack\". Rights group Emergency Lawyers reported a \"third civilian site\" near the previous two attacks was also targeted. The death toll is expected to be higher, but communication blackouts have made it difficult to confirm the full number of casualties. Emergency Lawyers says the strikes are a \"flagrant violation of international humanitarian law, including the protection of civilians, especially children, and vital civilian infrastructure.\" UNICEF has urged both parties to stop the attacks immediately and allow safe access for humanitarian aid. \"Killing children in their school is a horrific violation of children's rights,\" said UNICEF representative for Sudan Sheldon Yett. \"Children should never pay the price of conflict.\" Read more from Sky NewsRSF says it has captured Babanusa in West KordofanSudan 'epicentre of suffering in the world'Sudan's paramilitary forces agree to US-led humanitarian ceasefire proposal The attack on the nursery is among the latest in the two-year conflict between the RSF and Sudan's military, where the focus has recently shifted to the oil-rich Kordofan states. Hundreds of civilians have been killed in the last few weeks as fighting shifted from Darfur, following the RSF's violent takeover of the city of Al Fashir, which was marked with civilians being executed, rapes, sexual assaults and other atrocities. Thousands managed to escape the violence, but thousands more are trapped or feared killed. Meanwhile, Sudanese military aerial strikes last weekend killed at least 48 people, mostly civilians, in South Kordofan. The RSF has also accused the military of carrying out a drone strike on the border with Chad, posting a video showing billowing black smoke. The Associated Press has been unable to verify the video or whether there were any casualties, while Sudan's military also hasn't commented. The RSF and the Sudanese military have been fighting for power over the country since 2023, which has seen more than 40,000 people killed, according to the World Health Organisation, although the real death toll is expected to be higher. 12 million people have been displaced."
    },
    {
        "title": "Young Germans react to voluntary military service plans",
        "description": "Germany's parliament has voted to reintroduce voluntary military service, but getting Gen Z recruits could prove tricky.",
        "url": "https://news.sky.com/story/young-germans-react-to-voluntary-military-service-plans-13479929",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-germany-robbins_7102341.jpg?20251206025419",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-12-06 02:31:00",
        "Headline": "Under new plans, all 18-year-olds will be sent a questionnaire about their fitness and willingness to serve.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n  Germany's parliament has voted to reintroduce voluntary military service, but getting Gen Z recruits could prove tricky. Across the country, students gathered to demonstrate against what they fear will be a return to conscription. In Berlin, they held signs saying, \"You can't have our lives if we don't eat your lies\" and \"peace is power\". While most demonstrators were in their late teens or twenties, some parents also turned out with their younger children. One mother held a placard declaring: \"You can't have my son\". The new plan means from January, all 18-year-olds will be sent a questionnaire about their fitness and willingness to serve. Men must fill it in, while for women it will be voluntary. \n                  France reveals new national military service amid fears of Russian threat\n                 \n                  Europe's 28-point counter proposal to US-Russia peace plan for Ukraine in full\n                 \n                  Vaccine reminder as mpox strain spreads in Europe\n                 In the future, if the numbers of volunteers are too low, then parliament could trigger conscription at times of war or in emergencies. It's an idea which horrifies many in the crowd. \"None of us want to die for a country that doesn't really care about us,\" Levi tells me. He says the government has ignored their calls for climate protections and better social conditions, so he feels no allegiance to them. I ask: \"If Germany was attacked, who do you think should defend it if Gen Z don't want to?\" \"Why don't the people that started the war do it? I don't see why the older people shouldn't go to war. I mean, a lot of them already were in the army,\" he replies. 17-year-old Sara agrees, declaring: \"I would not be willing to die for any country.\" \"I don't think it's right to send children or anyone against their will into the military, because war is just wrong,\" she says. \"I'm never going to join the military and if Germany is attacked, I'll just go somewhere else where there's no war.\" While the government says the system will be voluntary for as long as possible, from 2027 all 18-year-old men will have to have a medical examination so the government can see who is fit to serve. German defence minister Boris Pistorius says the mandatory medical is needed so that in the event of an attack, Germany would not waste time confirming \"who is operationally capable as a homeland protector and who is not\". The move is a massive cultural shift for Germany, which suspended mandatory military conscription on 1 July 2011. \"From my friends no one wants to volunteer because we don't want to fight for a problem that's not really ours. We didn't start the problems, they [the government] did,\" says Silas.  The change is a direct reaction to Russia's invasion of Ukraine Despite Moscow's denials, NATO's chief has warned Russia could be able to attack a member country in the next four to five years. I ask 19-year-old Lola if she's thinks Russia is a threat? \"It could be, maybe. However, I think there are more important issues, especially like social ones, than war,\" she says. Her friend, 28-year-old Balthasar, goes further, saying: \"A country being able to attack isn't the same as a country planning to attack. \"The track record of Russia has been to attempt at least diplomatic resolution, cooperation, and I think those are the right approaches to take in international politics, opposed to sabre-rattling, which the German government has resorted to.\" The German chancellor, Friedrich Merz, has said he wants to build the strongest army in Europe. Germany currently has around 184,000 soldiers and wants to boost that by over 80,000 in the next decade. Read more from Sky News:Irish police investigating drone sightings during Zelenskyy visitGiving up Ukrainian territory would be 'unjust peace' Volunteers are being offered incentives like a monthly wage of more than €2,000 (£1,750). Despite this, a survey earlier this year found 81% of Gen Z wouldn't fight for Germany. In contrast, many of the older generation supported conscription. At the Berlin protest, 17-year-old Valentin was the only person we met who reluctantly agreed to fight. \"When we are attacked, then yes [I would fight], but when we are attacking other countries, then no,\" he says. Germany isn't the only country looking for reinforcements, last month France announced a new military service for over-18s. Currently, 10 EU countries already have compulsory military service. While others like Belgium, the Netherlands and Germany are opting for voluntary schemes. The German plan still must be signed off by parliament's upper house later this month before it's expected to start in January."
    },
    {
        "title": "White House: Europe 'unrecognisable in 20 years or less'",
        "description": "President Trump's \"America First\" agenda has been spelt out in a new White House National Security Strategy that should make stark reading for allies and foes of the United States alike.",
        "url": "https://news.sky.com/story/white-house-europe-unrecognisable-in-20-years-or-less-13479931",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-white-house_7057281.jpg?20251021125226",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-12-06 05:28:00",
        "Headline": "A new White House National Security Strategy gives us an insight into how President Trump views the world, and the US's place within it.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n President Trump's \"America First\" agenda has been spelt out in a new White House National Security Strategy that should make stark reading for allies and foes of the United States alike. The new 33-page document outlines an upending of American foreign policy objectives and priorities which have stood largely unchanged through different administrations stretching back decades. The document says American strategy went \"astray\" over many years. It seeks to reframe America's strategic interests as being far narrower now than at any time in its modern history. Among the key points, the document says: • Europe faces \"civilizational erasure\" and could be \"unrecognisable in 20 years or less\" • \"Certain NATO members will become majority non-European\" within a few decades • America will \"shift away\" from the \"burden\" of the Middle East seeing it now as a \"source and destination of international investment\" •​​​​​​​ In the Western hemisphere, America should pursue a policy of \"enlist and expand… restoring American pre-eminence\" •​​​​​​​ In Africa, American policy focus should be on trade not \"providing and spreading liberal ideology\" In black-and-white, the text articulates a dramatic strategic shift which has been playing out at lightning speed over the past year. The document underlines the end of the concept of America as an arbiter of the democratic rules-based order. \"American foreign policy elites convinced themselves that permanent American domination of the entire world was in the best interests of our country. Yet the affairs of other countries are our concern only if their activities directly threaten our interests,\" the paper says. Every US administration publishes at least one National Security Strategy during a presidential term. The focus of this one is starkly different from that published by President Biden in 2022. It's also notably different from the document which President Trump published during his first term. His 2017 paper cast the world as a contest between \"repressive regimes\" and \"free societies\". This new one places the necessity to do trade above the imposition of values. \"We seek good relations and peaceful commercial relations with the nations of the world without imposing on them democratic or other social change that differs widely from their traditions and histories.\" US correspondent Despite watching much of what's in here play out in real-time over the past year, it's nonetheless remarkable to see it written down in a policy document. It is America's stunning and swift foreign policy revolution in black-and-white. For Europe, the document is acutely relevant. Trump's America seeks to destroy the EU as an entity, it is ambivalent (at best) about NATO and it seeks to influence and disrupt politics across the continent. It is a clarifying moment (or at least is should be) for Europe's governments - who should recognize the glaring realities: First, America the ally has gone - they are on their own. Second, the policy objectives outlined in this document, if realised, play directly into Vladimir Putin's hands.  Mass migration and Europe The new document is highly critical of mass migration. It warns that uncontrolled migration is destroying the concept of nation states which could impact America's strategic alliances and the countries it counts as reliable allies. The paper is particularly critical of Europe, of the European Union as a concept and of individual European nations. \"Should present trends continue, the continent will be unrecognizable in 20 years or less,\" the paper says. It continues: \"As such, it is far from obvious whether certain European countries will have economies and militaries strong enough to remain reliable allies. \"Many of these nations are currently doubling down on their present path. We want Europe to remain European, to regain its civilizational self-confidence, and to abandon its failed focus on regulatory suffocation.\" The document's language around the politics of governing parties across Europe is particularly stark. Regarding Ukraine, the document says: \"The Trump Administration finds itself at odds with European officials who hold unrealistic expectations for the war perched in unstable minority governments, many of which trample on basic principles of democracy to suppress opposition. \"A large European majority wants peace, yet that desire is not translated into policy, in large measure because of those government's subversion of democratic processes.\" 👉 Tap to follow Trump100 wherever you get your podcasts👈 The document outlines how his administration will seek to support \"patriotic European parties\". This is entirely in line with President Trump's rhetoric but still represents a major departure from the longstanding principle of not interfering in the politics of allies. It says: \"American diplomacy should continue to stand up for genuine democracy, freedom of expression, and unapologetic celebrations of European nations' individual character and history. \"America encourages its political allies in Europe to promote this revival of spirit, and the growing influence of patriotic European parties indeed gives cause for great optimism.\" Ukraine and Russia On European-Russia relations, the document raises the prospect of war but curiously does not presume that such a conflict would involve America. \"Managing European relations with Russia will require significant US diplomatic engagement, both to reestablish conditions of strategic stability across the Eurasian landmass, and to mitigate the risk of conflict between Russia and European states.\" Read more from Sky News:Germany introduces controversial military service lawNetflix agrees $72bn deal for Warner Bros studios By contrast, President Biden's National Security Strategy, published in 2022, underlined repeatedly the \"iron-clad\" commitment the United States had to Europe's security. Chinese risk and opportunity  The document presents Asia and the Indo-Pacific region as a source of opportunity for strategic and economic cooperation. \"President Trump is building alliances and strengthening partnerships in the Indo-Pacific that will be the bedrock of security and prosperity long into the future…\" And specifically on China, the paper presents a goal of \"economic vitality\" achieved through a balanced economic relationship between the two countries combined with an \"ongoing focus on deterrence to prevent war\". Deterrence would be achieved, it outlines, by maintaining preeminent military strength over China. It says: \"This combined approach can become a virtuous cycle as strong American deterrence opens up space for more disciplined economic action, while more disciplined economic action leads to greater American resources to sustain deterrence in the long term.\" Hemispheres of influence  In line with President Trump's focus on spheres of influence, particular focus is given to the western hemisphere. There are clear references to the impact of drugs from south and central America into the US and more subtle references to control of the arctic. \"The United States will reassert and enforce the Monroe Doctrine to restore American pre-eminence in the Western Hemisphere, and to protect our homeland and our access to key geographies throughout the region,\" the paper says. It continues: \"We will deny non-Hemispheric competitors the ability to position forces or other threatening capabilities, or to own or control strategically vital assets, in our hemisphere.\""
    },
    {
        "title": "Twelve killed in shooting at South African bar, including young children, police say",
        "description": "At least 12 people have been killed, including a three-year-old boy, in a shooting at an illegal bar in the South African city of Pretoria, police say.",
        "url": "https://news.sky.com/story/at-least-11-killed-in-shooting-in-south-african-bar-including-young-children-police-say-13479982",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-saulsville-hostel-pretoria_7103253.jpg?20251206205202",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-06 10:58:00",
        "Headline": "South Africa has one of the highest murder rates in the world, averaging about 60 a day.",
        "Content": "At least 12 people have been killed, including a three-year-old boy, in a shooting at an illegal bar in the South African city of Pretoria, police say. The mass shooting took place in the tavern - known locally as a \"shebeen\" - in the early hours of Saturday morning in the Saulsville township. A manhunt was launched for three suspects who were not identified. Another 13 people were also wounded during the incident. Officers did not give details of their ages. The South African Police Service said in a statement: \"Three minors are among those deceased, which include three and 12-year-old boys [and a] 16-year-old female.\" Police spokesperson Brigadier Athlenda Mathe told national broadcaster SABC: \"We are told that at least three unknown gunmen entered this hostel where a group of people were drinking and they started randomly shooting.\" She said the motive for the killings was not clear. The shootings happened at around 4.15am, she said, but police were not alerted until 6am. \n                  'Disingenuous thread' of the G20 - the communities shut out of South Africa's summit\n                 \n                  Donald Trump announces dramatic drop in US refugee intake, with most of them white South Africans\n                 \n                  At least 42 people killed as bus crashes on mountain road in South Africa\n                 South Africa has one of the highest murder rates in the world, averaging about 60 a day. The country has relatively strict gun ownership laws, but many killings are committed with illegal guns, authorities say. There have been several mass shootings at bars in recent years. Police said 18 people were killed - 15 of them women - in mass shootings at two separate houses in the same road in a rural part of Eastern Cape province in September last year. Seven men were arrested for those shootings and face multiple charges of murder, while police recovered three AK-style assault rifles they believe were used in the shootings. In another mass shooting in 2022, 16 people were killed in the Johannesburg township of Soweto."
    },
    {
        "title": "Unapologetically political - a World Cup draw like no other",
        "description": "This was a World Cup draw like no other. Crafted less for the teams but for one man.",
        "url": "https://news.sky.com/story/crafted-for-one-man-this-was-a-world-cup-draw-like-no-other-13479928",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump-gianni-infantino_7102119.jpg?20251205180932",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2025-12-06 02:33:00",
        "Headline": "No subtitle found",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  This was a World Cup draw like no other. Crafted less for the teams but for one man. The choice of venue. The creation of a new trophy. The closing music act. Donald Trump was lavished with the adulation he craves by FIFA President Gianni Infantino and feels others unfairly deny him. Knowing how much being overlooked by the Nobel Committee hurt the US president, there was Mr Infantino with FIFA's newly-created Peace Prize to hand over. And a medal for Mr Trump to wear. \"This is truly one of the great honours of my life,\" he said. \"And beyond awards, Gianni and I were discussing this. We saved millions and millions of lives.\" This was all on the stage in front of an audience who turned up to find out who they will be playing at the World Cup. England handed an undaunting route past Croatia, Panama and Ghana. Scotland paired with newcomers Haiti before tricky reunions from their last men's World Cup in 1998 against Brazil and Morocco. \n                  US national parks drop free admission on MLK Day and Juneteenth, but add Trump's birthday\n                 \n                  White House: Europe 'unrecognisable in 20 years or less'\n                 \n                  Donald Trump awarded FIFA peace prize at World Cup draw\n                 But the show before the draw could even begin - presided over by Rio Ferdinand - took almost as long as a football match, at 87 minutes after the noon kick-off was delayed. There was a walk of self-promotion to complete - \"I guess they have to wait\" - before taking his seat in the Kennedy Center. Or the Trump Kennedy Center as the president takes to calling the venue picked 1.5 miles from the White House.  \"It was falling apart,\" he said, delaying the walk into the auditorium. \"And now it's, it's pretty much back.\" Mr Infantino could only watch on, beaming, at his friend. \"We had a dead country,\" Mr Trump went on, \"and now we have the hottest country anywhere in the world\". There was the awkwardness of being reminded, before receiving the peace accolade, about threats to launch military strikes on Venezuela to stop the drugs trade. \"I did settle eight wars, and we have a ninth coming,\" he swatted away the question. \"Which nobody's ever done before. But I want to really save lives. I don't need prizes.\" But FIFA knew how much he wanted more gold for the collection with the prize. More on this story:What draw means for England, Scotland, Wales, Northern Ireland and Republic of Ireland And for all the mockery and disdain targeted at FIFA, how many sports would relish having the US president spend several hours attending a procedural event determining the placing of teams in groups for a tournament? How many would dish out the same flattery to secure direct lines to the leader of the nation staging their championship? Many have benefited from Mr Trump's stardust and swagger being attached to this spectacle. Even Port Vale's most famous fan - Robbie Williams - secured a walk-on role, exceeding his profile this side of the Pond. And the Village People are reaping the rewards of becoming the unlikeliest of Trump hype acts. The festivities ended with eyes fixed back up to the presidential seating and the YMCA dance being performed. This was an afternoon that dispelled any pretence that FIFA keeps a distance from politics. It was unapologetically political. But few speak out in the FIFA world as the redistributed wealth keeps rolling back in their direction. It would be easy to forget this isn't entirely America's World Cup. They're sharing hosting with Canada and Mexico. Read more from Sky News:Netflix agrees blockbuster $72bn deal for Warner Bros studiosSeveral sites go down after Cloudfare outage  And eventually the spotlight was ceded to their leaders - very briefly - as Mexican President Claudia Sheinbaum and Canadian Prime Minister Mark Carney drew out their countries' names. But it did live up to FIFA's mantra that football can unite the world. The neighbours were brought together here on a snowy day in Washington. And tensions - often stoked by Mr Trump with Canada and Mexico - thawed in the name of football."
    },
    {
        "title": "US national parks drop free admission on MLK Day and Juneteenth, but add Trump's birthday",
        "description": "Americans will be able to visit national parks for free on Donald Trump's birthday next year, but will no longer be able to do so on Martin Luther King Jr Day or Juneteenth.",
        "url": "https://news.sky.com/story/us-national-parks-drop-free-admission-on-mlk-day-and-juneteenth-but-add-trumps-birthday-13480382",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-us-national-parks-north-cascades_7103318.jpg?20251206221620",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-06 21:14:00",
        "Headline": "The Department of the Interior has released a list of what it calls \"resident-only patriotic fee-free days\" for next year.",
        "Content": "Americans will be able to visit national parks for free on Donald Trump's birthday next year, but will no longer be able to do so on Martin Luther King Jr Day or Juneteenth. The Department of the Interior has released a list of what it calls \"resident-only patriotic fee-free days\" for next year. Mr Trump's birthday, which falls on the Flag Day national holiday, has been added to the list, as has the Fourth of July weekend and President Theodore Roosevelt's birthday. However, Martin Luther King Day and Juneteenth have been removed. Juneteenth was recognised in 2021 under Joe Biden's administration and commemorates the end of slavery in the US. Also removed are the anniversary of the Great American Outdoors Act in August and the National Public Lands Day in September. \"President Trump's leadership always puts American families first,\" the US interior secretary Doug Burgum said. \"These policies ensure that US taxpayers, who already support the National Park System, continue to enjoy affordable access, while international visitors contribute their fair share to maintaining and improving our parks for future generations.\" Read more from Sky News:White House: Europe 'unrecognisable in 20 years or less'Trump awarded FIFA peace prize at World Cup draw The department said it was also introducing \"America-first entry free policies\", which means US residents will continue to \"enjoy affordable pricing\" while international visitors \"will pay a higher rate to help support the care and maintenance of America's parks\". It said the annual pass will cost $80 (£60) for US residents and $250 (£187) for nonresidents, with nonresidents without an annual pass paying a $100 (£75) per person fee to enter 11 of the most visited national parks, in addition to the standard entrance fee. Trump renames US Institute of Peace after himself The decision to make his birthday a 'free' day comes after Mr Trump's name was added to the sign on the headquarters building of the United States Institute of Peace in Washington DC. The State Department shared a photo of the building's new facade and called Mr Trump \"the greatest dealmaker in our nation's history\". He has also unsuccessfully put himself forward for the Nobel Peace Prize, sought to put his name on the planned NFL stadium in Washington DC, and had a new children's savings programme named after him."
    },
    {
        "title": "White House: Europe 'unrecognisable in 20 years or less'",
        "description": "President Trump's \"America First\" agenda has been spelt out in a new White House National Security Strategy that should make stark reading for allies and foes of the United States alike.",
        "url": "https://news.sky.com/story/white-house-europe-unrecognisable-in-20-years-or-less-13479931",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-white-house_7057281.jpg?20251021125226",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-12-06 05:28:00",
        "Headline": "A new White House National Security Strategy gives us an insight into how President Trump views the world, and the US's place within it.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n President Trump's \"America First\" agenda has been spelt out in a new White House National Security Strategy that should make stark reading for allies and foes of the United States alike. The new 33-page document outlines an upending of American foreign policy objectives and priorities which have stood largely unchanged through different administrations stretching back decades. The document says American strategy went \"astray\" over many years. It seeks to reframe America's strategic interests as being far narrower now than at any time in its modern history. Among the key points, the document says: • Europe faces \"civilizational erasure\" and could be \"unrecognisable in 20 years or less\" • \"Certain NATO members will become majority non-European\" within a few decades • America will \"shift away\" from the \"burden\" of the Middle East seeing it now as a \"source and destination of international investment\" •​​​​​​​ In the Western hemisphere, America should pursue a policy of \"enlist and expand… restoring American pre-eminence\" •​​​​​​​ In Africa, American policy focus should be on trade not \"providing and spreading liberal ideology\" In black-and-white, the text articulates a dramatic strategic shift which has been playing out at lightning speed over the past year. The document underlines the end of the concept of America as an arbiter of the democratic rules-based order. \"American foreign policy elites convinced themselves that permanent American domination of the entire world was in the best interests of our country. Yet the affairs of other countries are our concern only if their activities directly threaten our interests,\" the paper says. Every US administration publishes at least one National Security Strategy during a presidential term. The focus of this one is starkly different from that published by President Biden in 2022. It's also notably different from the document which President Trump published during his first term. His 2017 paper cast the world as a contest between \"repressive regimes\" and \"free societies\". This new one places the necessity to do trade above the imposition of values. \"We seek good relations and peaceful commercial relations with the nations of the world without imposing on them democratic or other social change that differs widely from their traditions and histories.\" US correspondent Despite watching much of what's in here play out in real-time over the past year, it's nonetheless remarkable to see it written down in a policy document. It is America's stunning and swift foreign policy revolution in black-and-white. For Europe, the document is acutely relevant. Trump's America seeks to destroy the EU as an entity, it is ambivalent (at best) about NATO and it seeks to influence and disrupt politics across the continent. It is a clarifying moment (or at least is should be) for Europe's governments - who should recognize the glaring realities: First, America the ally has gone - they are on their own. Second, the policy objectives outlined in this document, if realised, play directly into Vladimir Putin's hands.  Mass migration and Europe The new document is highly critical of mass migration. It warns that uncontrolled migration is destroying the concept of nation states which could impact America's strategic alliances and the countries it counts as reliable allies. The paper is particularly critical of Europe, of the European Union as a concept and of individual European nations. \"Should present trends continue, the continent will be unrecognizable in 20 years or less,\" the paper says. It continues: \"As such, it is far from obvious whether certain European countries will have economies and militaries strong enough to remain reliable allies. \"Many of these nations are currently doubling down on their present path. We want Europe to remain European, to regain its civilizational self-confidence, and to abandon its failed focus on regulatory suffocation.\" The document's language around the politics of governing parties across Europe is particularly stark. Regarding Ukraine, the document says: \"The Trump Administration finds itself at odds with European officials who hold unrealistic expectations for the war perched in unstable minority governments, many of which trample on basic principles of democracy to suppress opposition. \"A large European majority wants peace, yet that desire is not translated into policy, in large measure because of those government's subversion of democratic processes.\" 👉 Tap to follow Trump100 wherever you get your podcasts👈 The document outlines how his administration will seek to support \"patriotic European parties\". This is entirely in line with President Trump's rhetoric but still represents a major departure from the longstanding principle of not interfering in the politics of allies. It says: \"American diplomacy should continue to stand up for genuine democracy, freedom of expression, and unapologetic celebrations of European nations' individual character and history. \"America encourages its political allies in Europe to promote this revival of spirit, and the growing influence of patriotic European parties indeed gives cause for great optimism.\" Ukraine and Russia On European-Russia relations, the document raises the prospect of war but curiously does not presume that such a conflict would involve America. \"Managing European relations with Russia will require significant US diplomatic engagement, both to reestablish conditions of strategic stability across the Eurasian landmass, and to mitigate the risk of conflict between Russia and European states.\" Read more from Sky News:Germany introduces controversial military service lawNetflix agrees $72bn deal for Warner Bros studios By contrast, President Biden's National Security Strategy, published in 2022, underlined repeatedly the \"iron-clad\" commitment the United States had to Europe's security. Chinese risk and opportunity  The document presents Asia and the Indo-Pacific region as a source of opportunity for strategic and economic cooperation. \"President Trump is building alliances and strengthening partnerships in the Indo-Pacific that will be the bedrock of security and prosperity long into the future…\" And specifically on China, the paper presents a goal of \"economic vitality\" achieved through a balanced economic relationship between the two countries combined with an \"ongoing focus on deterrence to prevent war\". Deterrence would be achieved, it outlines, by maintaining preeminent military strength over China. It says: \"This combined approach can become a virtuous cycle as strong American deterrence opens up space for more disciplined economic action, while more disciplined economic action leads to greater American resources to sustain deterrence in the long term.\" Hemispheres of influence  In line with President Trump's focus on spheres of influence, particular focus is given to the western hemisphere. There are clear references to the impact of drugs from south and central America into the US and more subtle references to control of the arctic. \"The United States will reassert and enforce the Monroe Doctrine to restore American pre-eminence in the Western Hemisphere, and to protect our homeland and our access to key geographies throughout the region,\" the paper says. It continues: \"We will deny non-Hemispheric competitors the ability to position forces or other threatening capabilities, or to own or control strategically vital assets, in our hemisphere.\""
    },
    {
        "title": "Piers Morgan's Uncensored nears £100m valuation after stake sale",
        "description": "Piers Morgan, the broadcaster and journalist, is raising tens of millions of dollars of funding from heavyweight investors as he seeks to turn Uncensored, his YouTube-based venture, into a broad-based global media business.",
        "url": "https://news.sky.com/story/piers-morgan8217s-uncensored-nears-163100m-valuation-after-stake-sale-13479949",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-piers-morgan-broadcaster_7101776.jpg?20251205130745",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-06 07:27:00",
        "Headline": "The US-based merchant bank Raine and Greek media mogul Theo Kyriakou are among the backers of the former Mirror editor and CNN anchor as he raises funds to grow the Uncensored media brand, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n  Piers Morgan, the broadcaster and journalist, is raising tens of millions of dollars of funding from heavyweight investors as he seeks to turn Uncensored, his YouTube-based venture, into a broad-based global media business. Sky News can exclusively reveal that Mr Morgan is in the process of finalising a roughly $30m (£22.5m) fundraising for Uncensored that will give it a pre-money valuation of about $130m (£97m). The new investors are understood to include The Raine Group, the New York-based merchant bank, and Theo Kyriakou, the media mogul behind Greece's Antenna Group, owner of a stake in London-based digital venture The News Movement. Michael Kassan, a marketing veteran, is understood to be advising the business on advertising-related matters and may also invest in a personal capacity, according to insiders. A number of family offices from around the world are also said to be in talks to become shareholders in Uncensored. Joe Ravitch, the prominent American banker and Raine co-founder who has advised in recent years on the sale of Chelsea and Manchester United football clubs, is said to be joining the Uncensored board as part of the capital-raising. The move comes nearly a year after Mr Morgan announced his departure from Rupert Murdoch's British empire through a deal which handed him full control and ownership of his Uncensored YouTube channel. \n                  TalkTV to be taken off air after two years to focus on streaming - as GB News reports heavy losses\n                 \n                  Piers Morgan leaving TalkTV to focus on YouTube channel\n                 \n                  Ex-Mirror journalist says he was asked to give Coronation Street star flowers containing listening device\n                 Allies of Mr Morgan said this weekend that some details of the fundraising were likely to be confirmed publicly in the coming days. While the size of his personal stake in the business was unclear this weekend, insiders said the crystallisation of a $130m valuation would mean that Mr Morgan's economic interest was, on paper, worth tens of millions of pounds. \"The ambition is to grow this into a billion dollar company within a few years,\" said one person close to the discussions with investors. \"With the scale of audiences now being driven to digital channels and the commercial opportunities there, that is definitely achievable.\" The former Mirror editor, whose career has also encompassed stints at ITV, with CNN in the US and Mr Murdoch's global media conglomerates News Corporation and Fox, is now drawing up plans to transform Uncensored into a more diverse digital media group. This is expected to include the launch of a series of 'verticals' attached to the Uncensored brand, including channels dedicated to subjects such as history, sport and technology. Mr Morgan is already said to be in talks with prominent figures to spearhead some of these new strands, with a chief executive also expected to be recruited to drive the growth of the overall Uncensored business. His appetite to establish a YouTube-based global media network has been driven by the scale of the global audiences he has drawn to some of his recent work, including interviews with the footballer Cristiano Ronaldo and the former world tennis number one Novak Djokovic. Both of those athletes have collaborated with Mr Morgan by posting parts of their exchanges on social media platforms, attracting hundreds of millions of views. Mr Morgan's access to President Donald Trump, whom he has interviewed on several occasions, is also likely to be a factor in the timing of Uncensored's expansion strategy. While many 'legacy' news and media networks remain hamstrung by inflated cost bases, Mr Morgan's decision to go it alone and focus on developing the Uncensored brand reflects his belief that the news and media industries are ripe for disintermediation by channels tied to prominent, and sometimes controversial, individual journalists and presenters. The Piers Morgan Uncensored YouTube channel has 4.3 million subscribers, roughly half of whom are from the US. Of the remaining 50%, however, only a minority are British, with a significant number based in the Middle East, South Africa and parts of Asia. This has fuelled Mr Morgan's view that there is journalistic and commercial mileage in creating content on issues which historically might have struggled to generate a significant international audience - such as ongoing military and political tension between India and Pakistan, and the white farmer 'genocide' furore in South Africa. Under the deal he struck with Mr Murdoch in January this year, Mr Morgan has a four-year revenue-sharing agreement that involves News UK receiving a slice of the advertising revenue generated by Piers Morgan Uncensored until 2029. Mr Morgan had returned to Mr Murdoch's media empire in January 2022 with a three-year agreement that included writing regular columns for The Sun and New York Post, as well as presenting shows on the company's now-folded television channel, Talk TV. He also recently released a book, Woke Is Dead, which was published by Mr Murdoch's books subsidiary, Harper Collins. As part of his new arrangements, Mr Morgan also signed a deal with Red Seat Ventures, a US-based agency which partners with prominent media figures and influencers to help them exploit commercial opportunities through sponsorship and other revenue streams. Among those Red Seat has worked with are Megyn Kelly, the American commentator, and Tucker Carlson, the former Fox News presenter. While many well-known American news media figures are followed because of their partisanship and affiliations to either the political left or right, Mr Morgan has positioned himself as a 'ringmaster' who is not ideologically hidebound. His plans come at a time of continuing upheaval in the global media industry, with Netflix agreeing a landmark $83bn deal this week to buy the Hollywood studio Warner Bros. In the UK, Sky, the Comcast-owned immediate parent company of Sky News, is in talks to acquire ITV's broadcasting business, while the Daily Telegraph newspaper could soon find itself as a stablemate of the Daily Mail if a proposed £500m deal is successful. Meanwhile, Reach, the London-listed newspaper publisher which owns the Daily Express and the Daily Mirror, now has a market valuation of just £176m - less than double that of Mr Morgan's new standalone digital media company. When Sky News revealed Mr Morgan's move to separate from News UK earlier this year, he said: \"Owning the [Uncensored] brand allows my team and I the freedom to focus exclusively on building Uncensored into a standalone business, editorially and commercially, and in time, widening it from just me and my content. \"It's clear from the… US election that YouTube is an increasingly powerful and influential media platform, and Uncensored is one of the fastest-growing shows on it in the world. \"I'm very excited about the potential for Uncensored.\" This weekend, he added: \"I am very excited that some of the most experienced and successful players in the global media industry, like Joe, Michael and Theo, share my ambitious vision for Uncensored. \"This is the future of modern media.\""
    },
    {
        "title": "Millionaire former Tory donor defects to Reform",
        "description": "Millionaire Tory donor Malcolm Offord has defected to Reform UK, saying he would be campaigning \"tirelessly\" to \"remove this rotten SNP government\".",
        "url": "https://news.sky.com/story/millionaire-former-tory-donor-defects-to-reform-13480083",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nigel-farage-reform_7102849.jpg?20251206161703",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-06 14:38:00",
        "Headline": "Lord Malcolm Offord said he was quitting the Conservative Party as he found it was \"parochial not political\", while he wanted to restore Scotland to a \"prosperous, happy, healthy country\".",
        "Content": " Millionaire Tory donor Malcolm Offord has defected to Reform UK, saying he would be campaigning \"tirelessly\" to \"remove this rotten SNP government\". Nigel Farage announced the former Conservative life peer's defection during a rally in the Scottish town of Falkirk, where regular anti-immigration protests have taken place outside the Cladhan Hotel - which is being used to house asylum seekers. Mr Farage, Reform UK's leader, said he was \"delighted\" to welcome Greenock-born Lord Offord to Reform, describing his defection as \"a brave and historic act\". He added: \"He will take Reform UK Scotland to a new level.\" During a speech, Lord Offord, who previously donated nearly £150,000 to the Tories, said he would be quitting the Conservative Party and giving up his place in the House of Lords as he prepares to campaign for a seat in Holyrood in May. The 61-year-old said he wanted to restore Scotland to a \"prosperous, happy, healthy country\". \"Scotland needs Reform and Reform is coming to Scotland,\" he told the rally. Read more:Nigel Farage dismisses school racism claims as 'banter in a playground'Farage allegations are deeply shocking - but will they deter voters? \"Today I can announce that I am resigning from the Conservative Party. Today I am joining Reform UK and today I announce my intention to stand for Reform in the Holyrood election in May next year. \"And that means that from today, for the next five months, day and night, I shall be campaigning with all of you tirelessly for two objectives. \"The first objective is to remove this rotten SNP government after 18 years, and the second is to present a positive vision for Scotland inside the UK, to restore Scotland to being a prosperous, proud, healthy and happy country.\" The latest defection comes as Mr Farage finds himself at the centre of allegations of racism dating back to his time in school.  Sky News reported on Saturday that a former schoolfriend of Mr Farage claimed he sang antisemitic songs to Jewish schoolmates - and had a \"big issue with anyone called Patel\". Jean-Pierre Lihou, 61, was initially friends with the Reform UK leader when he arrived at Dulwich College in the 1970s, at the time when Mr Farage is accused of saying antisemitic and other racist remarks by more than a dozen pupils. Mr Farage has said he \"never directly racially abused anybody\" at Dulwich and said there is a \"strong political element\" to the allegations coming out 49 years later. Reform's deputy leader Richard Tice has called the ex-classmates \"liars\". A Reform UK spokesman accused Sky News of \"scraping the barrel\" and being \"desperate to stop us winning the next election\"."
    },
    {
        "title": "Nigel Farage sang antisemitic songs to Jewish classmates, former Dulwich pupil claims",
        "description": "Nigel Farage sang antisemitic songs to Jewish schoolmates - and had a \"big issue with anyone called Patel\", a former schoolfriend has claimed.",
        "url": "https://news.sky.com/story/nigel-farage-sang-antisemitic-songs-to-jewish-classmates-former-dulwich-pupil-claims-13479621",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nigel-farage-reform_7100997.jpg?20251204151817",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-06 05:00:00",
        "Headline": "Two former Dulwich pupils have spoken to Sky News about their time at the school with Nigel Farage.",
        "Content": " Nigel Farage sang antisemitic songs to Jewish schoolmates - and had a \"big issue with anyone called Patel\", a former schoolfriend has claimed. Jean-Pierre Lihou, 61, was initially friends with the Reform UK leader when he arrived at Dulwich College in the 1970s, at the time when Mr Farage is accused of saying antisemitic and other racist remarks by more than a dozen pupils. But Mr Lihou, who is half-German and said he went for a couple of sleepovers at Mr Farage's parent's house, told Sky News' Amanda Akass that it \"soon become obvious he was not quite the same person I thought he was\". Warning: This article contains references to antisemitic slurs which readers may find offensive Another former pupil, Stefan Benarroch, who was in the year below Mr Farage and is Jewish, said that Mr Farage was \"not a kid\" when he made alleged antisemitic remarks and his behaviour was \"unacceptable in any era\". Mr Farage has said he \"never directly racially abused anybody\" at Dulwich and said there is a \"strong political element\" to the allegations coming out 49 years later. Reform's deputy leader Richard Tice has called the ex-classmates \"liars\". A Reform UK spokesman accused Sky News of \"scraping the barrel\" and being \"desperate to stop us winning the next election\". 'People were hurt by it' Mr Lihou told Sky News Mr Farage used to direct antisemitic songs at his Jewish friend Peter Ettedgui, who is one of the main former classmates to have spoken out against the Reform leader. \"He used to sing: 'Gas them all, gas them out, gas them all, into the chambers they crawl' - and the rest of those horrible words,\" he said. \"You think, when somebody is obviously distressed by that, why do you keep doing it? The humour wears off... when you see this, and because I'm German I'm particularly sensitive to anyone making that kind of analogy.\" Mr Lihou also said Mr Farage used to \"pass comment on anyone that wasn't white, particularly Indians\". He said: \"He had a great big issue with anyone called Patel because I think the school had at one point more Patels than Smiths. That seemed to irk him. \"Anybody who wasn't white, he was likely to have a comment pretty much throughout my school life, especially Jewish people. I think that was the worst thing because you could obviously see that people were hurt by it.\" 'He was truly ghastly' Mr Benarroch, who was also friends with Mr Ettedgui, told Sky News: \"His behaviour as a teenager was unacceptable by any standards and in any era. He was truly ghastly at Dulwich College.\" He said he would never have come across Mr Farage \"had I not been a Jew\". \"He and his minions - and one of his minions, in particular, was my tormentor at Dulwich - they would spot us coming out of Jewish prayers on a Friday,\" he added. \"So his behaviour at 16, 17, 18 - and you are a man at 18, you're technically an adult - was truly appalling. So we're not talking about a kid here.\" The property developer said the racism allegations are \"not just about Nigel Farage as a teenager, this is also about Nigel Farage as an adult\". \"His behaviour as a teenager was unacceptable by any standards and in any era. He was truly ghastly at Dulwich College,\" he added.  'These things don't leave you' Mr Benarroch, who is no longer a practising Jew, added: \"I was terrified of his bullies, he had these guys hanging around with him who were instructed to have a go at us as these young, nice Jewish boys. \"I don't recall ever having direct contact with Nigel Farage, but certainly I was very much a witness to his tormenting of others, especially Peter Ettudgui. \"He [Mr Farage] was so extreme, these things don't leave you, they don't leave your body, as such.\" On Thursday, Mr Farage launched into a tirade at the BBC after one of its reporters asked about the claims, with the politician reading out a letter he said was from someone he went to school with. He quoted the unnamed Jewish pupil as saying there was \"plenty of macho, tongue-in-cheek schoolboy banter\" and said sometimes it \"was offensive, but never with malice\". Political correspondent Allegations about Nigel Farage's schooldays have hit the headlines since the early days of the Brexit campaign in 2013. He has always dismissed such claims as 'politically motivated' and insisted recently he has 'never directly racially abused anybody'. But now with the prospect of Prime Minister Farage looking ever more likely - former classmates have decided now is the moment to speak up about their concerns, almost fifty years later. The allegations are deeply shocking. The problem for Farage is that far from going away – the story is only getting bigger. Reform have hit back against our story in bullish fashion, accusing Sky News of scraping the barrel in a desperate attempt to stop Reform UK winning the next election. Of course, the question of who will win the next election isn't down to journalists – but voters. Read more Read more: Farage dismisses school racism claims as 'banter in a playground'Farage needs to explain 'racist' comment allegations, says PM 'It was not schoolboy banter' Mr Benarroch rejected Mr Farage's claim it was just \"schoolboy banter\" and said he has continued to show the same views, just in a less obvious way. \"You tell that [that it was banter] to the guys, to Peter who had 'Hitler should have gassed you' said to him,\" he said. \"Peter Ettedgui was tormented by Nigel Farage. \"The point I'm making is, he's a grown man now. He's a highly intelligent politician with nuance when it suits him, and so clearly he's not going around saying 'Hitler should have gassed you all', obviously.\" The former Dulwich student said Mr Farage had \"kept the most disgraceful company imaginable\" in the US during the 2010s on radio and TV shows.  He specifically named Rick Wiles, a far-right American conspiracy theorist whose YouTube channel was banned in 2020 after calling Donald Trump's impeachment a \"Jew coup\". Mr Benarroch, who said he is not part of any political party, said \"there is no political motivation\" behind his allegations, but accused Reform and Mr Farage of making \"a political statement\" by calling them liars. On Thursday, Mr Farage said he had received multiple letters from former pupils in support of him. He said a letter from a Jewish schoolmate, said: \"While there was plenty of macho tongue-in-cheek schoolboy banter, it was humour, and yes, sometimes it was offensive... but never with malice. \"I never heard him [Farage] racially abuse anyone.\" A Reform UK spokesman \"accused Sky News of scraping the barrel\". He said: \"This ridiculous interview has nothing to do with Nigel Farage himself but apparently someone who knew him at school almost 50 years ago. \"Sky News are desperate to stop us winning the next election.\""
    },
    {
        "title": "Nigel Farage racism allegations are deeply shocking - but will they deter voters?",
        "description": "Allegations about Nigel Farage's schooldays have hit the headlines since the early days of the Brexit campaign in 2013.",
        "url": "https://news.sky.com/story/nigel-farage-racism-allegations-are-deeply-shocking-but-will-they-deter-voters-13479939",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-nigel-farage-westminster_7078075.jpg?20251206094931",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2025-12-06 07:11:00",
        "Headline": "Reform UK leader Nigel Farage says he \"never directly racially abused anybody\" at Dulwich College and says there is a \"strong political element\" to the allegations coming out.",
        "Content": "\n          Political correspondent\n              @amandaakass\n Allegations about Nigel Farage's schooldays have hit the headlines since the early days of the Brexit campaign in 2013. He has always dismissed such claims as \"politically motivated\" and insisted recently he has \"never directly racially abused anybody\". But now, with the prospect of Prime Minister Farage looking ever more likely, former classmates have decided it is the moment to speak up about their concerns, almost 50 years later.   Warning: This article contains references to antisemitic slurs which readers may find offensive The allegations are deeply shocking. Jean-Pierre Lihou told me Farage used to sing a sickening song about the Nazi gas chambers, which began \"gas them all, gas them out, gas them all, into the chambers they crawl\". Lihou claims Farage said non-white pupils should be sent home and had a particular issue with the fact that at one point the school had more pupils with the surname Patel than Smith. Stefan Benarroch, meanwhile, told my colleague Ali Fortescue he witnessed Farage \"tormenting others\" and was himself \"terrified\" by Farage's \"gang of bullies\" who he claims \"were instructed to have a go at us as these young, nice Jewish boys\" on their way back from Friday prayers. The Guardian - whose investigation last month prompted a renewed focus on the issue - reports that 28 former teachers and pupils have come forward to report witnessing antisemitic or racist behaviour from him.  A group of Holocaust survivors are now calling on Farage to either admit whether he said the words he's accused of saying, and apologise, or accuse those who said he did of lying. His political opponents - battered for so long in the polls by Reform UK - are keen to pile on the pressure too. Both Labour and the Liberal Democrats have urged him to \"come clean\" and apologise. The Tories have also argued that if it's true, Farage should say sorry, though Kemi Badenoch has certainly been more nuanced in her response than other political rivals, making the point that what most people may say as teenagers is very different from what they would say as adults. Read more:Farage dismisses school racism claims as 'banter in a playground'Farage needs to explain 'racist' comment allegations, says PM  The problem for Farage is that far from going away - the story is only getting bigger. He's clearly hugely frustrated by this - as evidenced by the angry tirade he launched against the BBC this week when their reporter asked about the allegations. He argued it's \"double standards\" to criticise what he was alleged to have said 49 years ago, at a time when broadcasters were still showing blackface in The Black And White Minstrel Show. He also read out a letter he said had been sent to him by a Jewish contemporary pupil, who described \"plenty of macho, tongue-in-cheek schoolboy banter\" - which, while sometimes \"offensive\", was \"never with malice\". Reform has hit back against our story in bullish fashion, accusing Sky News of scraping the barrel in a desperate attempt to stop Reform UK winning the next election. Of course, the question of who will win the next election isn't down to journalists - but voters. And the jeopardy for Reform is whether these allegations will deter enough potential voters - particularly wavering Tories - to disrupt what has thus far been an unstoppable wave of support."
    },
    {
        "title": "Prostate cancer treatment with potential for fewer side effects to be trialled in UK",
        "description": "A groundbreaking trial for a prostate cancer treatment has been launched in the UK, with the hope of reducing the side effects.",
        "url": "https://news.sky.com/story/prostate-cancer-treatment-with-potential-for-fewer-side-effects-to-be-trialled-in-uk-13479965",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-prostate-cancer-brca_7094466.jpg?20251128130222",
        "type": "Technology",
        "Author": "Bethany Minelle, news reporter",
        "Date Published": "2025-12-06 09:21:00",
        "Headline": "The therapy - which involves a robotic-assisted, high-pressure water jet - is less invasive than traditional surgery.",
        "Content": "By Bethany Minelle, news reporter  A groundbreaking trial for a prostate cancer treatment has been launched in the UK, with the hope of reducing the side effects. Backed by the government-funded National Institute for Health and Care Research (NIHR), the trial will examine whether Aquablation - a therapy using robotics, AI and real-time imaging - works as well or better than traditional surgery. Currently, the entire prostate gland is removed in a bid to cure men of prostate cancer, in a procedure called radical prostatectomy. It is only suitable for men whose cancer has not spread outside of the prostate gland or has spread to the area just outside the gland, and carries a risk of serious side effects, such as infection, erectile dysfunction and urinary problems.  With Aquablation, which is less invasive, experts hope to minimise these issues. The new therapy, which involves a robotic-assisted, high-pressure water jet, allows surgeons to map the entire prostate in real time with ultrasound. \n                  Why prostate cancer is expected to be left as the only major cancer without national screening\n                 \n                  Prostate cancer: NHS screening programme could come one step closer today\n                 \n                  Calls grow for national screening programme for prostate cancer\n                 Using the technique, medics find cancerous tissue to remove while avoiding surrounding nerves and muscles associated with erectile function and the bladder. Aquablation is currently used in some centres to treat benign prostatic hyperplasia (BPH).  An 'incredibly exciting' alternative surgical treatment The new trial - which is sponsored by US company Procept BioRobotics - is being run in seven countries. The four UK centres are the Royal Marsden, Guy's and St Thomas' NHS Foundation Trust, the Royal Free London NHS Foundation Trust and Norfolk and Norwich University Hospitals NHS Foundation Trust. Overall, 280 patients will be recruited globally, all with early-stage, localised prostate cancer who have already decided to have surgery. Philip Charlesworth, consultant urological surgeon at the Royal Marsden, said: \"For men with prostate cancer confined to the prostate, curative options are excellent, however we are becoming increasingly focused on the side effects of the cancer treatment and how we can embrace new technology to maintain a man's quality-of-life following their surgery. \"This trial is measuring Aquablation therapy, which uses a robotic approach to surgically remove the cancer, and to preserve a man's ability to remain continent and maintain sexual activity.\" Calling the trial \"an incredibly exciting prospect for the future of prostate cancer care\", he said positive results could lead to the addition of \"an alternative surgical treatment option for patients with localised prostate cancer across the globe\". Other potential treatments for localised prostate cancer include active surveillance or monitoring of the cancer and radiation. Cases on the rise Figures from Prostate Cancer UK suggest about one in eight men will have the cancer in their lifetime. A total of 58,218 men were diagnosed with prostate cancer in England last year - an increase of almost 9% compared with 2023. Last month, scientific advisers said prostate cancer screening should not be made routinely available for the vast majority of men in the UK, telling the government they would be \"likely to cause more harm than good\". For now, the committee will put forward only a recommendation to screen men with BRCA1 and BRCA2 genetic mutations - which puts them at far higher risk of prostate cancer - every two years, between the ages of 45 and 61. Health Secretary Wes Streeting said he was \"surprised\" by the decision. In recent months, there has been growing pressure for screening from high-profile public figures such as Olympian Sir Chris Hoy and former Sky News presenter Dermot Murnaghan. Both have been diagnosed with advanced prostate cancer. Former prime minister Lord Cameron had also backed the campaign for screening after revealing he had been treated for prostate cancer."
    },
    {
        "title": "Piers Morgan's Uncensored nears £100m valuation after stake sale",
        "description": "Piers Morgan, the broadcaster and journalist, is raising tens of millions of dollars of funding from heavyweight investors as he seeks to turn Uncensored, his YouTube-based venture, into a broad-based global media business.",
        "url": "https://news.sky.com/story/piers-morgan8217s-uncensored-nears-163100m-valuation-after-stake-sale-13479949",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-piers-morgan-broadcaster_7101776.jpg?20251205130745",
        "type": "Entertainment",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-06 07:27:00",
        "Headline": "The US-based merchant bank Raine and Greek media mogul Theo Kyriakou are among the backers of the former Mirror editor and CNN anchor as he raises funds to grow the Uncensored media brand, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n  Piers Morgan, the broadcaster and journalist, is raising tens of millions of dollars of funding from heavyweight investors as he seeks to turn Uncensored, his YouTube-based venture, into a broad-based global media business. Sky News can exclusively reveal that Mr Morgan is in the process of finalising a roughly $30m (£22.5m) fundraising for Uncensored that will give it a pre-money valuation of about $130m (£97m). The new investors are understood to include The Raine Group, the New York-based merchant bank, and Theo Kyriakou, the media mogul behind Greece's Antenna Group, owner of a stake in London-based digital venture The News Movement. Michael Kassan, a marketing veteran, is understood to be advising the business on advertising-related matters and may also invest in a personal capacity, according to insiders. A number of family offices from around the world are also said to be in talks to become shareholders in Uncensored. Joe Ravitch, the prominent American banker and Raine co-founder who has advised in recent years on the sale of Chelsea and Manchester United football clubs, is said to be joining the Uncensored board as part of the capital-raising. The move comes nearly a year after Mr Morgan announced his departure from Rupert Murdoch's British empire through a deal which handed him full control and ownership of his Uncensored YouTube channel. \n                  TalkTV to be taken off air after two years to focus on streaming - as GB News reports heavy losses\n                 \n                  Piers Morgan leaving TalkTV to focus on YouTube channel\n                 \n                  Ex-Mirror journalist says he was asked to give Coronation Street star flowers containing listening device\n                 Allies of Mr Morgan said this weekend that some details of the fundraising were likely to be confirmed publicly in the coming days. While the size of his personal stake in the business was unclear this weekend, insiders said the crystallisation of a $130m valuation would mean that Mr Morgan's economic interest was, on paper, worth tens of millions of pounds. \"The ambition is to grow this into a billion dollar company within a few years,\" said one person close to the discussions with investors. \"With the scale of audiences now being driven to digital channels and the commercial opportunities there, that is definitely achievable.\" The former Mirror editor, whose career has also encompassed stints at ITV, with CNN in the US and Mr Murdoch's global media conglomerates News Corporation and Fox, is now drawing up plans to transform Uncensored into a more diverse digital media group. This is expected to include the launch of a series of 'verticals' attached to the Uncensored brand, including channels dedicated to subjects such as history, sport and technology. Mr Morgan is already said to be in talks with prominent figures to spearhead some of these new strands, with a chief executive also expected to be recruited to drive the growth of the overall Uncensored business. His appetite to establish a YouTube-based global media network has been driven by the scale of the global audiences he has drawn to some of his recent work, including interviews with the footballer Cristiano Ronaldo and the former world tennis number one Novak Djokovic. Both of those athletes have collaborated with Mr Morgan by posting parts of their exchanges on social media platforms, attracting hundreds of millions of views. Mr Morgan's access to President Donald Trump, whom he has interviewed on several occasions, is also likely to be a factor in the timing of Uncensored's expansion strategy. While many 'legacy' news and media networks remain hamstrung by inflated cost bases, Mr Morgan's decision to go it alone and focus on developing the Uncensored brand reflects his belief that the news and media industries are ripe for disintermediation by channels tied to prominent, and sometimes controversial, individual journalists and presenters. The Piers Morgan Uncensored YouTube channel has 4.3 million subscribers, roughly half of whom are from the US. Of the remaining 50%, however, only a minority are British, with a significant number based in the Middle East, South Africa and parts of Asia. This has fuelled Mr Morgan's view that there is journalistic and commercial mileage in creating content on issues which historically might have struggled to generate a significant international audience - such as ongoing military and political tension between India and Pakistan, and the white farmer 'genocide' furore in South Africa. Under the deal he struck with Mr Murdoch in January this year, Mr Morgan has a four-year revenue-sharing agreement that involves News UK receiving a slice of the advertising revenue generated by Piers Morgan Uncensored until 2029. Mr Morgan had returned to Mr Murdoch's media empire in January 2022 with a three-year agreement that included writing regular columns for The Sun and New York Post, as well as presenting shows on the company's now-folded television channel, Talk TV. He also recently released a book, Woke Is Dead, which was published by Mr Murdoch's books subsidiary, Harper Collins. As part of his new arrangements, Mr Morgan also signed a deal with Red Seat Ventures, a US-based agency which partners with prominent media figures and influencers to help them exploit commercial opportunities through sponsorship and other revenue streams. Among those Red Seat has worked with are Megyn Kelly, the American commentator, and Tucker Carlson, the former Fox News presenter. While many well-known American news media figures are followed because of their partisanship and affiliations to either the political left or right, Mr Morgan has positioned himself as a 'ringmaster' who is not ideologically hidebound. His plans come at a time of continuing upheaval in the global media industry, with Netflix agreeing a landmark $83bn deal this week to buy the Hollywood studio Warner Bros. In the UK, Sky, the Comcast-owned immediate parent company of Sky News, is in talks to acquire ITV's broadcasting business, while the Daily Telegraph newspaper could soon find itself as a stablemate of the Daily Mail if a proposed £500m deal is successful. Meanwhile, Reach, the London-listed newspaper publisher which owns the Daily Express and the Daily Mirror, now has a market valuation of just £176m - less than double that of Mr Morgan's new standalone digital media company. When Sky News revealed Mr Morgan's move to separate from News UK earlier this year, he said: \"Owning the [Uncensored] brand allows my team and I the freedom to focus exclusively on building Uncensored into a standalone business, editorially and commercially, and in time, widening it from just me and my content. \"It's clear from the… US election that YouTube is an increasingly powerful and influential media platform, and Uncensored is one of the fastest-growing shows on it in the world. \"I'm very excited about the potential for Uncensored.\" This weekend, he added: \"I am very excited that some of the most experienced and successful players in the global media industry, like Joe, Michael and Theo, share my ambitious vision for Uncensored. \"This is the future of modern media.\""
    }
]