[
    {
        "title": "Investigation into Reeves not needed, says Starmer - after she apologises for rental 'mistake'",
        "description": "Sir Keir Starmer has dismissed calls for an investigation into his chancellor after she apologised for putting her family home up for rent without obtaining the necessary licence. ",
        "url": "https://news.sky.com/story/tories-call-for-investigation-as-reeves-admits-rental-mistake-13460270",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keynote-rachel-reeves_7036066.jpg?20251030000551",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-29 21:40:00",
        "Headline": "The Daily Mail reported that the chancellor rented her family home in Dulwich when she moved into Number 11 Downing Street, but was unaware she had to obtain a licence to do so. The Tories have called for an investigation.",
        "Content": "Sir Keir Starmer has dismissed calls for an investigation into his chancellor after she apologised for putting her family home up for rent without obtaining the necessary licence.  Rachel Reeves wrote to the prime minister to \"sincerely\" apologise for the \"inadvertent error\", which was first reported by the Daily Mail. Politics Hub: Latest updates from Westminster The newspaper said the chancellor rented her family home in Dulwich when she moved into 11 Downing Street, but was unaware she had to obtain a \"selective licence\" to do so.  Some London boroughs require private landlords to obtain a specific kind of licence if they are putting their property up for rent - including Southwark Council, where Ms Reeves' home is listed. The newspaper said she had now applied for a licence, but the Conservatives have called for an investigation. A spokesperson for Ms Reeves said: \"Since becoming chancellor, Rachel Reeves has rented out her family home through a lettings agency. \"She had not been made aware of the licensing requirement, but as soon as it was brought to her attention, she took immediate action and has applied for the licence. \"This was an inadvertent mistake and in the spirit of transparency, she has made the prime minister, the independent adviser on ministerial standards and the parliamentary commissioner for standards aware.\" Southwark Council introduced \"selective licences\" across certain areas two years ago. The scheme is designed to \"improve safety, security and quality for people living in private rented homes\". It aims to ensure renters who face persistent problems with damp, mould and outstanding repairs can get their issues resolved. These licences apply to most private residential properties, last for five years, and cost £900. Landlords need to provide documents including safety certificates for gas, electricity and fire alarms - along with floor plans and tenancy agreements. Renting out a property without a licence can lead to civil penalties of up to £30,000 - as well as prosecution in some cases. It is understood that Sir Laurie Magnus, the prime minister's ethics adviser, has not launched an investigation into Ms Reeves. Sir Keir said further investigation into the issue was \"not necessary\" after consulting Sir Laurie. In a letter to Ms Reeves, he suggested her apology was a \"sufficient resolution\". Daisy Cooper, deputy leader of the Liberal Democrats, said the chancellor was adding to the government's \"list of scandals\". \"Just weeks before the budget, this risks seriously undermining confidence in this government and its ability to focus on the urgent tasks at hand,\" she added.  The development comes weeks before Ms Reeves delivers her budget on 26 November. She is rumoured to be considering a series of tax hikes, including a new tax on the sale of homes worth more than £500,000 to replace stamp duty. Under the proposal, sellers, instead of buyers, would be responsible for paying the tax. Read more:What tax rises could Reeves announce?Why is there a budget black hole? The chancellor is understood to be looking at an annual 1% charge on the amount a property's value exceeds £2m - and a £10,000-a-year levy for homes worth £3m. Another proposal would see capital gains tax (CGT) charged when someone sells their main home, based on the amount it has increased in value during ownership. Reports suggest this would only be applied to the most expensive properties, with a possible threshold of £1.5m, which would affect about 120,000 homeowners."
    },
    {
        "title": "'Huge vote of confidence' as data centre giant announces £4bn British investment",
        "description": "A &#163;4bn data centre investment in the UK by one of the industry's biggest companies has been confirmed today, Sky News can reveal.",
        "url": "https://news.sky.com/story/huge-vote-of-confidence-as-data-centre-giant-announces-1634bn-british-investment-13459984",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-equinix-data-centre_7065808.png?20251029124005",
        "type": "Home",
        "Author": "Tim Baker",
        "Date Published": "2025-10-29 12:10:00",
        "Headline": "Equinix says it will pump billions into the UK with a new data centre by South Mimms services. The government is betting big on data centres to help with its growth agenda.",
        "Content": "\n          Political reporter\n              @TimJ_B\n  A £4bn data centre investment in the UK by one of the industry's biggest companies has been confirmed today, Sky News can reveal. The money is being put up by Equinix - one of the most significant players on the global stage when it comes to providing data centre space for other clients. The 85-acre site in South Mimms, Hertfordshire, would have 250 megawatts of processing capacity and aim to be up and running by 2030. This doubles the company's processing power in Britain, and shows it is willing to invest in the UK despite concerns about energy costs and its environmental impact. Technology Secretary Liz Kendall told Sky News the announcement was a \"huge vote of confidence in Britain\". Megawhat? Megawatts are how the industry measures the power of a data centre. Until recently, a 20MW or 30MW facility was considered huge, but the AI boom has seen these numbers explode. To put today's announcement into context, a government estimate at the end of last year reckoned the UK had a data centre capacity of around 1,566MW. An increase of 250MW roughly doubles Equinix's footprint in the UK, and £4bn is its biggest commitment in Europe. Why are data centres important? They can support jobs, redevelop post-industrial areas, and boost economic growth. This has seen the government bend over backwards to make it easier for the divisive projects to be green lit, including \"grey belt\" designation for areas of green belt land earmarked for development. The grey belt, according to the government, includes land near existing settlements, roads, and other existing infrastructure, and disused car parks and petrol stations. Labour controlled Hertsmere council approved the project, with planning officers arguing the land was grey belt. It's located on oilseed rape fields wedged between the M25, A1(M), South Mimms service station and Potters Bar. This type of data centre needs to be as close as possible to the office workers using its servers - miles equals milliseconds and this can mean millions of pounds in the fast-paced financial world. Read more:'AI superpower' dream at risk, industry warnsGovt still hoping for £45bn in savings from AI As well as construction roles numbering in the hundreds, Equinix says the facility will help support thousands of jobs in London and the City. James Tyler, the firm's UK managing director, said: \"We are excited about the underlying demand in the UK. \"The government are also very excited about the fact we are investing in the UK. Equinix has choice about where we invest, and we're very excited about what the underlying environment looks like, the demand environment, the government support for this.\" Ms Kendall said it was a \"really important investment here from a major company, and they want to help build the infrastructure for the future\". She added that while a \"lot of people are worried about what AI will mean to them\", the government is keen to support people with apprenticeships and \"upskilling\" into the sector. Green credentials One of the key complaints for those wanting to build these hugely power-demanding sites is getting the necessary connection to the National Grid - with the waiting list stretching as far as a decade in some instances. However, this site already has a connection lined up due to the previous work - and Equinix wants to get spades in the ground before the end of 2026 or the start of 2027 for a 2030 launch. It is also committed to using 100% renewable energy by that point. The site will be air cooled and not place any extraneous demand on water past the usual - like on-site toilets. Andrew Higgins, global head of master planning and sustainability, told Sky News: \"We'll be retaining all the existing high-value woodlands and streams, and we'll be planting thousands more trees. \"We'll convert a lot of this monoculture arable land into wildflower meadows, we'll put in ponds, and over 50% of the plot will remain as green space - that will result in a biodiversity net gain exceeding 10%.\" Asked by Sky News how developers will be to their green commitments, Ms Kendall said: \"We want to make sure we both tackle climate change and seize the potential advantages of AI. \"We want to make sure they draw on renewable energy sources. But AI can itself help tackle some of those big challenges around climate change.\" The government announced today that climate science and AI safety will be among the sectors receiving some of a £55bn boost for research and development. It comes from a £86bn package for science and tech announced by the chancellor at the spending review in June."
    },
    {
        "title": "At least 30 killed after 'unprecedented' Hurricane Melissa ravages through Caribbean",
        "description": "At least 30 people have died after Hurricane Melissa tore through the Caribbean on Wednesday.",
        "url": "https://news.sky.com/story/at-least-30-killed-after-unprecedented-hurricane-melissa-ravages-through-caribbean-13460469",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hurricane-melissa-jamaica_7066508.jpg?20251029231953",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-29 23:09:00",
        "Headline": "The storm made landfall in Cuba in the early hours of Wednesday morning before heading towards the Bahamas.",
        "Content": "At least 30 people have died after Hurricane Melissa tore through the Caribbean on Wednesday. The Red Cross said early indications show the storm has been a \"disaster of unprecedented catastrophe\". Storm Melissa has so far ravaged through Jamaica, Haiti, the Dominican Republic and Cuba. At least 34 are estimated to be dead in the Caribbean, with eight of those in Jamaica, one in the Dominican Republic and 25 in Haiti. This was down from a previously reported 40.  'Heartbreaking' aerial footage reveals scale of destruction Later on Wednesday, the Jamaican government confirmed four people - three men and one woman - had been killed. This figure later rose to eight. Local government minister, Desmond McKenzie, said: \"They were discovered after being washed up by the flood waters generated by the hurricane.\" Devastating aerial footage shows towns destroyed by the storm. The Jamaican prime minister, Andrew Holness, travelled to St Elizabeth, where the first deaths were reported, to inspect the storm's impact. Read more:Do we need new 'category 6' for most extreme storms? Sharing aerial footage of battered homes, he wrote: \"The damage is great, but we are going to devote all our energy to mount a strong recovery.\" The storm made landfall in Cuba in the early hours of Wednesday morning before leaving mid-afternoon, heading towards the Bahamas. 'Whole communities are underwater' Alexander Pendry, British Red Cross global response manager, said: \"News is already coming through that whole communities are underwater and that the damage left by the strong winds has been devastating. \"The Jamaica Red Cross has been proactively supporting communities by preparing essential supplies and managing shelters. Their priority now is to reach people with aid as soon as possible. \"Across the Caribbean, Red Cross teams have been mobilising as Melissa continues its trajectory across Cuba, Dominican Republic and Haiti.\" He added: \"Tragically, experience tells us that the impact on communities and individuals will be shattering and long lasting. \"We will be here for as long as people need us.\""
    },
    {
        "title": "Wrongly-released migrant sex offender Hadush Kebatu claims he was 'ignored' by police while trying to hand himself in",
        "description": "Migrant sex offender Hadush Kebatu, who was wrongly freed from prison, has claimed in an interview with Sky News that he tried to hand himself in to police a day before he was arrested, but was ignored by officers.",
        "url": "https://news.sky.com/story/wrongly-released-migrant-sex-offender-hadush-kebatu-claims-he-was-ignored-by-police-while-trying-to-hand-himself-in-13459823",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hadush-kebatu-asylum_7065561.jpg?20251029105937",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-29 17:49:00",
        "Headline": "Speaking to Sky News on the morning he arrived back in Ethiopia, Hadush Kebatu shared details of his accidental release from HMP Chelmsford while awaiting deportation.",
        "Content": " Migrant sex offender Hadush Kebatu, who was wrongly freed from prison, has claimed in an interview with Sky News that he tried to hand himself in to police a day before he was arrested, but was ignored by officers. The Home Office said Kebatu, 38, was deported from the UK on Tuesday night. Speaking to Sky News after he arrived back in Ethiopia on Wednesday morning, Kebatu shared details of his accidental release from HMP Chelmsford on 24 October and the two-day manhunt that followed. The convicted sex offender was repeatedly questioned on his crimes, but Sky News has chosen not to broadcast this part of the interview. 'Ignored' by police The morning after he was released from prison, Kebatu claimed he tried to hand himself into police in London, but was ignored. He said: \"I [told] police, look here, police I am wanted man, I am arrested, I will give you my hand, please help where is police station? He ignored me, he drove [off].\" He added that he told the officer his name and that he was mistakenly released from prison. \"I am not unknown. The police station, where is the place? But also I go to police, I will give you my hand please help me where is the police station, take me, I am wanted. \"You know me, or my image, my name is Hadush Kabatu, nationality Ethiopia. Please, I was the mistake release from Chelmsford prison. Please help me.\"  Responding to Kebatu's claims, the Metropolitan Police told Sky News: \"The Met is not aware of any evidence to support the claims that Kebatu approached officers on Saturday morning. \"The actions of officers who responded to the sighting of him on Sunday morning show how seriously they were taking the manhunt. Kebatu's actions on the morning of his arrest were more like those of someone trying to avoid officers, not trying to hand himself in.\" Release from prison Kebatu was released by HMP Chelmsford a month into his 12-month sentence on the expectation he would be picked up by immigration enforcement. He said after he was released he waited more than three hours outside the prison, for what he described as someone who was \"responsible\" for him. He said: \"At that time I am waiting more than three hours... who [is] responsible for me? Where is Home Office, where is [immigration]? \"I was told there was a bus. Also, all the experts, they all ignored me.\" Deputy Prime Minister David Lammy told the Commons Kebatu was released from prison into the community at 10.25am on 24 October, with police saying Kebatu then boarded a train into London at 12.41pm. In another Sky News story, a delivery driver who spoke to Kebatu outside Chelmsford prison said he looked \"confused\". The driver said he was approached by the prisoner, who had no idea where he was supposed to go. He said Kebatu waited outside the prison for roughly \"an hour and a half\" before leaving. Kebatu said after he left the prison, he asked a passerby where the train station was. He claimed someone helped him, and bought him a train ticket for £18. Kebatu then travelled to London. He was spotted later that evening in Stratford, east London, and then the Dalston area of Hackney. The Ethiopian national arrived in the UK on a small boat on 29 June. Days after his arrival, he sexually assaulted a 14-year-old girl and a woman in Epping, Essex, where he was staying. He was found guilty of two counts of sexual assault, one count of attempted sexual assault, one count of inciting a girl to engage in sexual activity and one count of harassment without violence. He was jailed on 23 September. When approached by Sky News, the Ministry of Justice (MoJ) pointed to a statement made by Justice Secretary David Lammy upon Kebatu's deportation: \"Kebatu has been returned to Ethiopia where he belongs. \"I am grateful to Home Office colleagues for acting swiftly to secure his deportation. I have been clear from the outset that a mistake of this nature is unacceptable, and we must get to the bottom of what happened. \"I have established an independent investigation chaired by Dame Lynne Owens into last Friday's events to get the public the answers they rightly deserve, and we have introduced the strictest checks ever seen in our prison system to stop similar unacceptable errors in future.\" Essex Police, who arrested Kebatu after the assaults in July, told Sky News: \"Our officers responded quickly to the reports of the sexual assaults committed in Epping and arrested Hadush Kebatu on the same day the offences were reported to us. \"Kebatu was then immediately remanded in custody, while officers acted diligently and professionally securing charges and building a case which saw Kebatu convicted following a trial. Protecting women and girls is a priority for Essex Police and our swift and thorough actions highlight our commitment to this.\"  "
    },
    {
        "title": "Microsoft, Alphabet and Meta results overshadowed by growing fears of AI bubble",
        "description": "Some of the world's biggest tech giants reported quarterly earnings on Wednesday - with a mixed bag of results as fears grow that a bubble is forming in artificial intelligence.",
        "url": "https://news.sky.com/story/microsoft-alphabet-and-meta-results-overshadowed-by-growing-fears-of-ai-bubble-13460474",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-mark-zuckerberg-meta_7066517.jpg?20251029232746",
        "type": "Home",
        "Author": "Connor Sephton",
        "Date Published": "2025-10-29 23:04:00",
        "Headline": "Three of the world's biggest companies are ramping up spending on artificial intelligence - but they're under pressure to show a return on investment.",
        "Content": "\n          News reporter\n              @ConnorSephton\n Some of the world's biggest tech giants reported quarterly earnings on Wednesday - with a mixed bag of results as fears grow that a bubble is forming in artificial intelligence. Microsoft revealed that its spending on AI infrastructure hit almost $35bn (£26.5bn) in the three months to the end of September, a sharp rise compared with the year before. Despite revenue jumping 18% and net income rising 12%, shares plunged by close to 4% in after-hours trading, with investors concerned about the mounting costs of sustaining the boom. Microsoft's vice president of investor relations Jonathan Neilson said: \"We continue to see demand which exceeds the capacity we have available. \"Our capital expenditure strategy remains unchanged in that we build against the demand signal we're seeing.\" Big Tech is facing increasing pressure to show returns on the massive AI investments they're making, against a backdrop of soaring valuations and limited evidence of productivity gains. Microsoft became the world's second most valuable company this week thanks to its 27% stake in OpenAI, the creator of ChatGPT. Its market capitalisation surged beyond $4trn (£3trn) at one point, but that psychologically significant threshold is now in doubt because of recent selloffs. Alphabet makes history Last night's results weren't all doom and gloom - with shares in Google's parent company surging by 6% in after-hours trading. Alphabet has also set out aggressive spending ambitions, but placated investors thanks to an impressive set of results that surpassed analysts' expectations. Total revenue for the quarter stood at a staggering $102.35bn (£77bn), with the search giant's advertising unit remaining robust despite growing competition. But concerns linger that Alphabet's dominance in search could be undermined by AI startups, with OpenAI recently unveiling a browser designed to rival Google Chrome. Hargreaves Lansdown's senior equity analyst Matt Britzman shrugged off this threat - and believes the company is \"gearing up for long-term AI leadership\". He said: \"Alphabet just delivered its first-ever $100bn quarter, silencing the doubters with standout performances in both Search and Cloud. \"AI Overviews and AI Mode are clearly resonating with users, helping to ease fears that Google's core search business is under threat from generative AI. \"With ChatGPT's recent browser demo falling short of a game-changer, Google looks well-placed to put up a strong defence as gatekeeper to the internet.\" Read more from Sky News:Federal Reserve cuts interest ratesMicrosoft Azure outage hits thousands  Meta faces a mauling Meta - the parent company of Facebook, Instagram, and WhatsApp - saw its shares tumble by as much as 10% in after-hours trading. Mark Zuckerberg's tech empire anticipates \"notably larger\" capital expenses next year as it ramps up investments in AI and goes on a hiring spree for top talent. Net income in the third quarter stood at $2.7bn (£2bn) and suffered an eye-watering $16bn (£12bn) hit because of Donald Trump's \"Big Beautiful Bill\". Meta was late to the party on AI but has now doubled down on this still-nascent technology - setting an ambition to achieve superintelligence, a milestone where machines could theoretically outthink humans. The social networking giant continues to benefit from its massive user base, and expects fourth-quarter revenues of up to $59bn (£44bn)."
    },
    {
        "title": "Afghan national charged after triple stabbing in west London - as murder victim named",
        "description": "An Afghan national has been charged with murder and attempted murder after a triple stabbing in west London.",
        "url": "https://news.sky.com/story/man-charged-after-triple-stabbing-in-west-london-as-murder-victim-named-13459898",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-wayne-broadhurst-uxbridge-stabbing_7066060.jpg?20251029194413",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-29 17:36:00",
        "Headline": "Safi Dawood has been charged with one count of murder, two counts of attempted murder, and possession of an offensive weapon after Monday's incident in Uxbridge.",
        "Content": "An Afghan national has been charged with murder and attempted murder after a triple stabbing in west London. Safi Dawood, 22, has also been charged with possession of an offensive weapon in relation to the incident in Uxbridge on Monday, the Crown Prosecution Service said. He will appear at Westminster Magistrates' Court on Thursday.  Police and paramedics were called to a stabbing in Midhurst Gardens, Uxbridge, at around 5pm. Wayne Broadhurst, 49, was treated for stab wounds at the scene but died at the scene of his injuries, the Metropolitan Police said in a statement. Another man, aged 45, suffered life-changing injuries and was treated in hospital. A 14-year-old boy was also hurt in the stabbing, but has since been discharged from hospital. Police said his injuries were neither life-threatening nor life-changing. Dawood entered the UK in a lorry in 2020 before claiming asylum, which was granted in 2022, the Home Office said previously. He was not known to Mr Broadhurst, but was known to the other two alleged victims, police said. Dawood, of Midhurst Gardens, needed hospital treatment after \"suffering a medical episode\" and was later returned to police custody, where he remains, the force added. A 'devastating loss' The managing director of Greener Ealing Ltd, which provides environmental services to Ealing Council, said Mr Broadhurst was a \"dedicated member of our team\". Katarina Pohancenikova said in the statement: \"Our thoughts and deepest condolences are with Wayne's family, friends, and colleagues during this incredibly difficult time. \"This is a devastating loss. Wayne was a well-respected and dedicated member of our team who made a real contribution to the work we do and to the residents we serve. \"We ask for the privacy of Wayne's loved ones to be respected as they come to terms with this appalling news.\" Greener Ealing shared a photograph of the Liverpool supporter wearing the football club's hat, as well as the company's high-vis. The Met warned people not to speculate about the case on social media for fear it \"could impede future court proceedings\". Read more on Sky News:Arrests after girl dies in chemicals incidentDeported sex offender given £500Questions over prince's 'peppercorn' rent Jaswant Narwal, Chief Crown Prosecutor for CPS London North, confirmed the charges arising from what he called a \"shocking\" incident. Mr Narwal said prosecutors \"have worked to establish that there is sufficient evidence to bring the case to court and that it is in the public interest to pursue criminal proceedings\". Around 100 people gathered for a vigil on Tuesday evening to lay flowers near the police tape at the junction between Midhurst Gardens and Leybourne Road, with some lighting candles."
    },
    {
        "title": "Tens of thousands killed in two days in Sudan city, analysts believe",
        "description": "Tens of thousands of people have been killed in the Sudanese city of Al Fashir by the Rapid Support Forces (RSF) in a two-day window after the paramilitary group captured the regional capital, analysts believe.",
        "url": "https://news.sky.com/story/tens-of-thousands-killed-in-two-days-in-sudan-city-analysts-believe-13460278",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sudan-war-al-fashir_7066310.jpg?20251029211440",
        "type": "Home",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-10-29 20:12:00",
        "Headline": "Sky News is not able to independently verify the claims, but stains and shapes resembling blood and corpses can be seen from space in satellite images.",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n  Tens of thousands of people have been killed in the Sudanese city of Al Fashir by the Rapid Support Forces (RSF) in a two-day window after the paramilitary group captured the regional capital, analysts believe. Sky News is not able to independently verify the claim by Yale Humanitarian Labs, as the city remains under a telecommunications blackout. Stains and shapes resembling blood and corpses can be seen from space in satellite images analysed by the research lab. Nathaniel Raymond, executive director of Yale Humanitarian Labs, said: \"In the past 48 hours since we've had [satellite] imagery over Al Fashir, we see a proliferation of objects that weren't there before RSF took control of Al Fashir - they are approximately 1.3m to 2m long which is critical because in satellite imagery at very high resolution, that's the average length of a human body lying vertical.\" Mini Minawi, the governor of North Darfur, said on X that 460 civilians have been killed in the last functioning hospital in the city. The Sudan Doctors Network has also shared that the RSF \"cold-bloodedly killed everyone they found inside Al Saudi Hospital, including patients, their companions, and anyone else present in the wards\". World Health Organisation (WHO) chief Dr Tedros Adhanom Ghebreyesus said it was \"appalled and deeply shocked\" by the reports. Satellite images support the claims of a massacre at Al Saudi Hospital, according to Mr Raymond, who said YHL's report detailed \"a large pile of them [objects believed to be bodies] against a wall at one building at Saudi hospital. And we believe that's consistent with reports that patients and staff were executed en masse\". In a video message released on Wednesday, RSF commander Mohamed Hamdan Dagalo acknowledged \"violations in Al Fashir\" and claimed \"an investigation committee should start to hold any soldier or officer accountable\".  The commander is known for committing atrocities in Darfur in the early 2000s as a Janjaweed militia leader, and the RSF has been accused of carrying out genocide in Darfur 20 years on. Sources have told Sky News the RSF is holding doctors, journalists and politicians captive, demanding ransoms from some families to release their loved ones. One video shows a man from Al Fashir with an armed man kneeling on the ground, telling his family to pay 15,000. The currency was not made clear. In some cases, ransoms have been paid, but then more messages come demanding that more money be transferred to secure release. Muammer Ibrahim, a journalist based in the city, is currently being held by the RSF, who initially shared videos of him crouched on the ground, surrounded by fighters, announcing his hometown had been captured under duress. Read more:Key Sudan city falls - what does this mean for the war?'Massacre' kills more than 50, including children200,000 trapped after army flees He is being held incommunicado as his family scrambles to negotiate his release. Muammer courageously covered the siege of Al Fashir for months, enduring starvation and shelling. The Committee to Protect Journalists regional director Sara Qudah said the abduction of Muammar Ibrahim \"is a grave and alarming reminder that journalists in Al Fashir are being targeted simply for telling the truth\"."
    },
    {
        "title": "Victims of Post Office Capture scandal say they are being treated as 'second-class' citizens",
        "description": "Victims of the Post Office Capture scandal say they are being treated as second-class citizens - accusing the government of running a \"two-tier\" compensation system.",
        "url": "https://news.sky.com/story/victims-of-post-office-capture-scandal-say-they-are-being-treated-as-second-class-citizens-13460178",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-steve-marston-capture_7052865.png?20251017023238",
        "type": "Home",
        "Author": "Adele Robinson",
        "Date Published": "2025-10-29 18:23:00",
        "Headline": "Capture was used between 1992 and 1999 in up to 2,500 Post Office branches - with many sub postmasters making up cash losses themselves. A government commissioned report last year found it was likely the software caused accounting errors.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n Victims of the Post Office Capture scandal say they are being treated as second-class citizens - accusing the government of running a \"two-tier\" compensation system. It comes as the Department for Business and Trade announced the launch of the first-ever redress scheme for those wronged after faulty software created false accounting shortfalls in the 1990s. Capture was used between 1992 and 1999 in up to 2,500 Post Office branches, with many sub postmasters making up cash losses themselves. A government-commissioned report last year found it was likely the software caused accounting errors. The Capture Redress Scheme will provide payments of up to £300,000, and more in \"exceptional\" cases, to former postmasters who suffered financial losses. Steve Marston, who was convicted in 1998 of stealing from his branch and is not yet eligible to apply to the scheme, said other victims were feeling \"frustrated\" with it.  \"I want to know, what do they consider exceptional circumstances?\" he said, \"because I want it to see it in black and white what they consider as exceptional circumstances rather than just a vague statement.\" He said that victims felt like \"second-class\" citizens, describing the Horizon schemes and the new Capture scheme as \"two-tier\" systems. \"[It's] one law for the Horizon victims, and a totally different law for us Capture victims and that's not really fair. \"One of the main bones of contention is the fact that with Horizon there's a right of appeal against decisions, and you've got multiple rights to appeal. \"Whereas with the Capture appeal process, there's only a one-shot chance, so basically, it's a second-class system.\" The scheme will be tested for the first 150 claimants before a full roll-out. Chris Roberts, whose mother Liz was jailed in 1999 for theft, is one of them and said victims were concerned about the \"glacial pace\" of government.  He is able to apply to the redress scheme on behalf of his father, who was a postmaster alongside his mother, who oversaw accounts. Both Liz and Bill Roberts have passed away. \"I'd hate us to get to the point where, you know, this scheme's come out and we go through these 150 cases and then it's further developed … and half the people it would apply to are gone,\" Chris said. \"We will lose people before they can see justice, and I think that's a terrible tragedy.\" Under the Capture scheme, eligible claimants will receive an immediate interim payment of £10,000. An independent panel will then assess final awards through a banding model ranging from £10,000 to £300,000, with higher payments in exceptional circumstances. The Post Office Minister Blair McDougall, speaking exclusively to Sky News, said he understood why victims have \"low levels of trust in the state\". He said: \"They've been treated appallingly by the state, but what we've done with this scheme is to try to learn some of those lessons from previous compensation schemes for postmasters that didn't work. \"So we're collecting more evidence from the beginning to try to speed things up.  \"We're trying to give sub postmasters the benefit of the doubt throughout this. And I hope we will see that this scheme treats them with a bit more dignity and a bit more urgency.\" He also said that funds overall for the Capture scandal were \"uncapped\", with \"no ceiling\" on compensation. Mr McDougall also said that the government was working \"as fast as we possibly can, and that's because people have waited so long\". Read more:At least eight Capture convictions investigatedMajor milestone in Post Office scandal When asked if he would personally guarantee speedy redress, he replied: \"Absolutely - that's what we are doing today, to make sure that we have a scheme that gets people's redress as quickly as possible. \"But it's challenging, because we're dealing with cases where there's not a lot of evidence. So much time has passed. \"So we tried to design a scheme to get postmasters the benefit of the doubt and to try to be as fair as possible.\" He said within the scheme there was the \"opportunity\" for victims to make a \"wider case of the impact on their lives - and if the independent panel feels that there is a compelling case, they can go beyond that £300,000\"."
    },
    {
        "title": "British military instructor accused of spying for Russia arrested in Ukraine",
        "description": "A British man accused of spying for Russia has been detained in Ukraine, according to prosecutors.",
        "url": "https://news.sky.com/story/british-military-instructor-accused-of-spying-for-russia-by-ukraine-13460249",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kyiv-ukraine_7066181.jpg?20251029195204",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-29 19:45:00",
        "Headline": "The man is said to have arrived in Ukraine in January 2024 and initially worked as a military instructor in Mykolaiv. He reportedly later worked in a border unit.",
        "Content": "A British man accused of spying for Russia has been detained in Ukraine, according to prosecutors. Prosecutors in Kyiv allege in a statement that the unnamed man \"collaborated\" with Russian special services - and agreed to provide military information in return for money. The man is accused of the \"unauthorised dissemination of information about the defence forces in conditions of martial law\", an offence which carries a prison term of up to 12 years. In a separate statement, the Security Service of Ukraine (SSU) allege that the man was \"preparing to carry out terrorist attacks\". They claim he \"offered his services\" to Russian special services on pro-Kremlin online groups. It is alleged that he was then contacted by a member of the FSB, Russia's secret police. The SSU statement added: \"The occupiers provided him with instructions for making an improvised explosive device. They also sent him the coordinates of a weapons cache, from which he retrieved a pistol with two loaded magazines.\" He was detained at a \"temporary residence\" in Kyiv, according to the SSU. \n                  Investigation into Reeves not needed, says Starmer - after she apologises for rental 'mistake'\n                 \n                  This mum faces a nightly battle to keep her daughter alive - but the NHS won't help her\n                 \n                  'Huge vote of confidence' as data centre giant announces £4bn British investment\n                 The man is said to have arrived in Ukraine in January 2024 and initially worked as a military instructor in Mykolaiv. He reportedly later worked in a border unit. Prosecutors say he then moved to Odesa, where he \"established contact with a representative of the Russian special service, and agreed to provide military information for money\". It is alleged he transmitted the coordinates of Ukrainian units, along with photographs of a training area and other information, in May this year. It is claimed that he received $6,000 for one \"task\". Read more:Kremlin threatens foreign fighters in UkraineUkraine will work on ceasefire plan - Zelenskyy Prosecutors say the pre-trial investigation \"is being conducted by the investigators of the Security Service of Ukraine with operational support from counter-intelligence units\". The man appeared in court this week and was detained without bail."
    },
    {
        "title": "Investigation into Reeves not needed, says Starmer - after she apologises for rental 'mistake'",
        "description": "Sir Keir Starmer has dismissed calls for an investigation into his chancellor after she apologised for putting her family home up for rent without obtaining the necessary licence. ",
        "url": "https://news.sky.com/story/tories-call-for-investigation-as-reeves-admits-rental-mistake-13460270",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keynote-rachel-reeves_7036066.jpg?20251030000551",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-29 21:40:00",
        "Headline": "The Daily Mail reported that the chancellor rented her family home in Dulwich when she moved into Number 11 Downing Street, but was unaware she had to obtain a licence to do so. The Tories have called for an investigation.",
        "Content": "Sir Keir Starmer has dismissed calls for an investigation into his chancellor after she apologised for putting her family home up for rent without obtaining the necessary licence.  Rachel Reeves wrote to the prime minister to \"sincerely\" apologise for the \"inadvertent error\", which was first reported by the Daily Mail. Politics Hub: Latest updates from Westminster The newspaper said the chancellor rented her family home in Dulwich when she moved into 11 Downing Street, but was unaware she had to obtain a \"selective licence\" to do so.  Some London boroughs require private landlords to obtain a specific kind of licence if they are putting their property up for rent - including Southwark Council, where Ms Reeves' home is listed. The newspaper said she had now applied for a licence, but the Conservatives have called for an investigation. A spokesperson for Ms Reeves said: \"Since becoming chancellor, Rachel Reeves has rented out her family home through a lettings agency. \"She had not been made aware of the licensing requirement, but as soon as it was brought to her attention, she took immediate action and has applied for the licence. \"This was an inadvertent mistake and in the spirit of transparency, she has made the prime minister, the independent adviser on ministerial standards and the parliamentary commissioner for standards aware.\" Southwark Council introduced \"selective licences\" across certain areas two years ago. The scheme is designed to \"improve safety, security and quality for people living in private rented homes\". It aims to ensure renters who face persistent problems with damp, mould and outstanding repairs can get their issues resolved. These licences apply to most private residential properties, last for five years, and cost £900. Landlords need to provide documents including safety certificates for gas, electricity and fire alarms - along with floor plans and tenancy agreements. Renting out a property without a licence can lead to civil penalties of up to £30,000 - as well as prosecution in some cases. It is understood that Sir Laurie Magnus, the prime minister's ethics adviser, has not launched an investigation into Ms Reeves. Sir Keir said further investigation into the issue was \"not necessary\" after consulting Sir Laurie. In a letter to Ms Reeves, he suggested her apology was a \"sufficient resolution\". Daisy Cooper, deputy leader of the Liberal Democrats, said the chancellor was adding to the government's \"list of scandals\". \"Just weeks before the budget, this risks seriously undermining confidence in this government and its ability to focus on the urgent tasks at hand,\" she added.  The development comes weeks before Ms Reeves delivers her budget on 26 November. She is rumoured to be considering a series of tax hikes, including a new tax on the sale of homes worth more than £500,000 to replace stamp duty. Under the proposal, sellers, instead of buyers, would be responsible for paying the tax. Read more:What tax rises could Reeves announce?Why is there a budget black hole? The chancellor is understood to be looking at an annual 1% charge on the amount a property's value exceeds £2m - and a £10,000-a-year levy for homes worth £3m. Another proposal would see capital gains tax (CGT) charged when someone sells their main home, based on the amount it has increased in value during ownership. Reports suggest this would only be applied to the most expensive properties, with a possible threshold of £1.5m, which would affect about 120,000 homeowners."
    },
    {
        "title": "'Huge vote of confidence' as data centre giant announces £4bn British investment",
        "description": "A &#163;4bn data centre investment in the UK by one of the industry's biggest companies has been confirmed today, Sky News can reveal.",
        "url": "https://news.sky.com/story/huge-vote-of-confidence-as-data-centre-giant-announces-1634bn-british-investment-13459984",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-equinix-data-centre_7065808.png?20251029124005",
        "type": "UK",
        "Author": "Tim Baker",
        "Date Published": "2025-10-29 12:10:00",
        "Headline": "Equinix says it will pump billions into the UK with a new data centre by South Mimms services. The government is betting big on data centres to help with its growth agenda.",
        "Content": "\n          Political reporter\n              @TimJ_B\n  A £4bn data centre investment in the UK by one of the industry's biggest companies has been confirmed today, Sky News can reveal. The money is being put up by Equinix - one of the most significant players on the global stage when it comes to providing data centre space for other clients. The 85-acre site in South Mimms, Hertfordshire, would have 250 megawatts of processing capacity and aim to be up and running by 2030. This doubles the company's processing power in Britain, and shows it is willing to invest in the UK despite concerns about energy costs and its environmental impact. Technology Secretary Liz Kendall told Sky News the announcement was a \"huge vote of confidence in Britain\". Megawhat? Megawatts are how the industry measures the power of a data centre. Until recently, a 20MW or 30MW facility was considered huge, but the AI boom has seen these numbers explode. To put today's announcement into context, a government estimate at the end of last year reckoned the UK had a data centre capacity of around 1,566MW. An increase of 250MW roughly doubles Equinix's footprint in the UK, and £4bn is its biggest commitment in Europe. Why are data centres important? They can support jobs, redevelop post-industrial areas, and boost economic growth. This has seen the government bend over backwards to make it easier for the divisive projects to be green lit, including \"grey belt\" designation for areas of green belt land earmarked for development. The grey belt, according to the government, includes land near existing settlements, roads, and other existing infrastructure, and disused car parks and petrol stations. Labour controlled Hertsmere council approved the project, with planning officers arguing the land was grey belt. It's located on oilseed rape fields wedged between the M25, A1(M), South Mimms service station and Potters Bar. This type of data centre needs to be as close as possible to the office workers using its servers - miles equals milliseconds and this can mean millions of pounds in the fast-paced financial world. Read more:'AI superpower' dream at risk, industry warnsGovt still hoping for £45bn in savings from AI As well as construction roles numbering in the hundreds, Equinix says the facility will help support thousands of jobs in London and the City. James Tyler, the firm's UK managing director, said: \"We are excited about the underlying demand in the UK. \"The government are also very excited about the fact we are investing in the UK. Equinix has choice about where we invest, and we're very excited about what the underlying environment looks like, the demand environment, the government support for this.\" Ms Kendall said it was a \"really important investment here from a major company, and they want to help build the infrastructure for the future\". She added that while a \"lot of people are worried about what AI will mean to them\", the government is keen to support people with apprenticeships and \"upskilling\" into the sector. Green credentials One of the key complaints for those wanting to build these hugely power-demanding sites is getting the necessary connection to the National Grid - with the waiting list stretching as far as a decade in some instances. However, this site already has a connection lined up due to the previous work - and Equinix wants to get spades in the ground before the end of 2026 or the start of 2027 for a 2030 launch. It is also committed to using 100% renewable energy by that point. The site will be air cooled and not place any extraneous demand on water past the usual - like on-site toilets. Andrew Higgins, global head of master planning and sustainability, told Sky News: \"We'll be retaining all the existing high-value woodlands and streams, and we'll be planting thousands more trees. \"We'll convert a lot of this monoculture arable land into wildflower meadows, we'll put in ponds, and over 50% of the plot will remain as green space - that will result in a biodiversity net gain exceeding 10%.\" Asked by Sky News how developers will be to their green commitments, Ms Kendall said: \"We want to make sure we both tackle climate change and seize the potential advantages of AI. \"We want to make sure they draw on renewable energy sources. But AI can itself help tackle some of those big challenges around climate change.\" The government announced today that climate science and AI safety will be among the sectors receiving some of a £55bn boost for research and development. It comes from a £86bn package for science and tech announced by the chancellor at the spending review in June."
    },
    {
        "title": "Wrongly-released migrant sex offender Hadush Kebatu claims he was 'ignored' by police while trying to hand himself in",
        "description": "Migrant sex offender Hadush Kebatu, who was wrongly freed from prison, has claimed in an interview with Sky News that he tried to hand himself in to police a day before he was arrested, but was ignored by officers.",
        "url": "https://news.sky.com/story/wrongly-released-migrant-sex-offender-hadush-kebatu-claims-he-was-ignored-by-police-while-trying-to-hand-himself-in-13459823",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hadush-kebatu-asylum_7065561.jpg?20251029105937",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-29 17:49:00",
        "Headline": "Speaking to Sky News on the morning he arrived back in Ethiopia, Hadush Kebatu shared details of his accidental release from HMP Chelmsford while awaiting deportation.",
        "Content": " Migrant sex offender Hadush Kebatu, who was wrongly freed from prison, has claimed in an interview with Sky News that he tried to hand himself in to police a day before he was arrested, but was ignored by officers. The Home Office said Kebatu, 38, was deported from the UK on Tuesday night. Speaking to Sky News after he arrived back in Ethiopia on Wednesday morning, Kebatu shared details of his accidental release from HMP Chelmsford on 24 October and the two-day manhunt that followed. The convicted sex offender was repeatedly questioned on his crimes, but Sky News has chosen not to broadcast this part of the interview. 'Ignored' by police The morning after he was released from prison, Kebatu claimed he tried to hand himself into police in London, but was ignored. He said: \"I [told] police, look here, police I am wanted man, I am arrested, I will give you my hand, please help where is police station? He ignored me, he drove [off].\" He added that he told the officer his name and that he was mistakenly released from prison. \"I am not unknown. The police station, where is the place? But also I go to police, I will give you my hand please help me where is the police station, take me, I am wanted. \"You know me, or my image, my name is Hadush Kabatu, nationality Ethiopia. Please, I was the mistake release from Chelmsford prison. Please help me.\"  Responding to Kebatu's claims, the Metropolitan Police told Sky News: \"The Met is not aware of any evidence to support the claims that Kebatu approached officers on Saturday morning. \"The actions of officers who responded to the sighting of him on Sunday morning show how seriously they were taking the manhunt. Kebatu's actions on the morning of his arrest were more like those of someone trying to avoid officers, not trying to hand himself in.\" Release from prison Kebatu was released by HMP Chelmsford a month into his 12-month sentence on the expectation he would be picked up by immigration enforcement. He said after he was released he waited more than three hours outside the prison, for what he described as someone who was \"responsible\" for him. He said: \"At that time I am waiting more than three hours... who [is] responsible for me? Where is Home Office, where is [immigration]? \"I was told there was a bus. Also, all the experts, they all ignored me.\" Deputy Prime Minister David Lammy told the Commons Kebatu was released from prison into the community at 10.25am on 24 October, with police saying Kebatu then boarded a train into London at 12.41pm. In another Sky News story, a delivery driver who spoke to Kebatu outside Chelmsford prison said he looked \"confused\". The driver said he was approached by the prisoner, who had no idea where he was supposed to go. He said Kebatu waited outside the prison for roughly \"an hour and a half\" before leaving. Kebatu said after he left the prison, he asked a passerby where the train station was. He claimed someone helped him, and bought him a train ticket for £18. Kebatu then travelled to London. He was spotted later that evening in Stratford, east London, and then the Dalston area of Hackney. The Ethiopian national arrived in the UK on a small boat on 29 June. Days after his arrival, he sexually assaulted a 14-year-old girl and a woman in Epping, Essex, where he was staying. He was found guilty of two counts of sexual assault, one count of attempted sexual assault, one count of inciting a girl to engage in sexual activity and one count of harassment without violence. He was jailed on 23 September. When approached by Sky News, the Ministry of Justice (MoJ) pointed to a statement made by Justice Secretary David Lammy upon Kebatu's deportation: \"Kebatu has been returned to Ethiopia where he belongs. \"I am grateful to Home Office colleagues for acting swiftly to secure his deportation. I have been clear from the outset that a mistake of this nature is unacceptable, and we must get to the bottom of what happened. \"I have established an independent investigation chaired by Dame Lynne Owens into last Friday's events to get the public the answers they rightly deserve, and we have introduced the strictest checks ever seen in our prison system to stop similar unacceptable errors in future.\" Essex Police, who arrested Kebatu after the assaults in July, told Sky News: \"Our officers responded quickly to the reports of the sexual assaults committed in Epping and arrested Hadush Kebatu on the same day the offences were reported to us. \"Kebatu was then immediately remanded in custody, while officers acted diligently and professionally securing charges and building a case which saw Kebatu convicted following a trial. Protecting women and girls is a priority for Essex Police and our swift and thorough actions highlight our commitment to this.\"  "
    },
    {
        "title": "Alleged stalker asked in court if she still believes she is Madeleine McCann",
        "description": "A Polish woman who claimed to be Madeleine McCann cried in court and said she was \"in between\" yes and no, when she was asked if she still believes she's the missing Briton.",
        "url": "https://news.sky.com/story/alleged-stalker-asked-in-court-if-she-still-believes-she-is-madeleine-mccann-13460099",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-julia-wandelt-karen-spragg_7045999.jpg?20251008150819",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-29 18:24:00",
        "Headline": "Julia Wandelt, 24, from southwest Poland, and Karen Spragg, 61, from Cardiff, are both on trial at Leicester Crown Court, accused of one count of stalking the family of Madeleine McCann. They both deny the charge.",
        "Content": "A Polish woman who claimed to be Madeleine McCann cried in court and said she was \"in between\" yes and no, when she was asked if she still believes she's the missing Briton. Julia Wandelt, 24, from southwest Poland, entered the third day of giving evidence at Leicester Crown Court on Wednesday, facing the prosecution. During questions from Michael Duck KC, she was asked if a DNA test proving that Wandelt was not Madeleine was \"the end of this charade?\" The court also heard of repeated incidents in which Wandelt directly referred to herself as Madeleine, including when trying to contact Kate McCann and saying: \"You are my real mother.\" Wandelt also said she named her Instagram account \"I am Madeleine\" to try and \"make noise for police\". As it happened During cross-examination, Mr Duck asked Wandelt: \"As we stand here, do you still entertain the belief that you could be Madeleine McCann?\" In response, Wandelt said: \"It's neither yes nor no. Because it is very easy to provide me with the documentation, so if I am not her, and it really is negative, I would like to see the documentation [from DNA tests]. \"Now, I would say I'm 50/50. What's the issue with providing the whole paperwork?\" Mr Duck asked again: \"Do you, Julia Wandelt, believe you may still be Madeleine McCann?\" The defendant replied: \"It will be neither yes nor no. It is not yes, and not no. I am in between.\" Asked what would satisfy her, Wandelt raised her voice as she began crying and said: \"An investigation into my disappearance, into what happened to me, why am I here?\" Wandelt previously claimed to the court that she was abducted and abused when she was younger. She said if she saw the \"entire paperwork\" of a DNA test proving she was not Madeleine, she would \"walk away\". 'I don't think it's intimidating' Also during proceedings, the prosecution asked Wandelt about when she and her co-defendant Karen Spragg travelled to Leicestershire to try and talk to Kate McCann, late last year. In a letter written to Mrs McCann the day after, the court heard that Wandelt said: \"I'm so sorry for causing you so much distress.\" Mr Duck asked if this was Wandelt apologising for causing Mrs McCann distress, something she has repeatedly told the trial she does not believe she did. Wandelt said: \"She said I was causing her distress, I didn't apologise because I recognise it as distress.\" Asked whether her travelling to their home was intimidating, Wandelt added: \"No, I don't think it's intimidating. \"If I was looking for my daughter missing for 18 years, I would be okay speaking with the person saying they were my missing child.\" Wandelt's claims about Gerry McCann The Polish national also told the jury she thought Mr McCann was involved in Madeleine's disappearance. She said this was \"based on memories\" and the way Mr McCann \"came across, not letting Kate tell anything\". Wandelt claimed to have memories of what she said were the McCanns, but added she didn't want to \"incriminate him [Mr McCann]\". One such memory, she claimed, was Mrs McCann rubbing her head and saying she would find her. The prosecutor asked: \"Is that, Miss Wandelt, a genuine memory?\" Wandelt claimed: \"Yes.\" Mr Duck asked: \"Are you asserting to this jury that Kate McCann knew of the abduction and told you she would find you?\" Wandelt said: \"Yes… I still believe Kate didn't want it to happen.\" She also told the jury: \"They [Mr and Mrs McCann] are not guilty in my point of view, they had no other choice.\" Wandelt and 61-year-old Spragg, of Caerau Court Road in Caerau, Cardiff, both deny one count of stalking between June 2022 and February this year. The trial continues."
    },
    {
        "title": "Afghan national charged after triple stabbing in west London - as murder victim named",
        "description": "An Afghan national has been charged with murder and attempted murder after a triple stabbing in west London.",
        "url": "https://news.sky.com/story/man-charged-after-triple-stabbing-in-west-london-as-murder-victim-named-13459898",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-wayne-broadhurst-uxbridge-stabbing_7066060.jpg?20251029194413",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-29 17:36:00",
        "Headline": "Safi Dawood has been charged with one count of murder, two counts of attempted murder, and possession of an offensive weapon after Monday's incident in Uxbridge.",
        "Content": "An Afghan national has been charged with murder and attempted murder after a triple stabbing in west London. Safi Dawood, 22, has also been charged with possession of an offensive weapon in relation to the incident in Uxbridge on Monday, the Crown Prosecution Service said. He will appear at Westminster Magistrates' Court on Thursday.  Police and paramedics were called to a stabbing in Midhurst Gardens, Uxbridge, at around 5pm. Wayne Broadhurst, 49, was treated for stab wounds at the scene but died at the scene of his injuries, the Metropolitan Police said in a statement. Another man, aged 45, suffered life-changing injuries and was treated in hospital. A 14-year-old boy was also hurt in the stabbing, but has since been discharged from hospital. Police said his injuries were neither life-threatening nor life-changing. Dawood entered the UK in a lorry in 2020 before claiming asylum, which was granted in 2022, the Home Office said previously. He was not known to Mr Broadhurst, but was known to the other two alleged victims, police said. Dawood, of Midhurst Gardens, needed hospital treatment after \"suffering a medical episode\" and was later returned to police custody, where he remains, the force added. A 'devastating loss' The managing director of Greener Ealing Ltd, which provides environmental services to Ealing Council, said Mr Broadhurst was a \"dedicated member of our team\". Katarina Pohancenikova said in the statement: \"Our thoughts and deepest condolences are with Wayne's family, friends, and colleagues during this incredibly difficult time. \"This is a devastating loss. Wayne was a well-respected and dedicated member of our team who made a real contribution to the work we do and to the residents we serve. \"We ask for the privacy of Wayne's loved ones to be respected as they come to terms with this appalling news.\" Greener Ealing shared a photograph of the Liverpool supporter wearing the football club's hat, as well as the company's high-vis. The Met warned people not to speculate about the case on social media for fear it \"could impede future court proceedings\". Read more on Sky News:Arrests after girl dies in chemicals incidentDeported sex offender given £500Questions over prince's 'peppercorn' rent Jaswant Narwal, Chief Crown Prosecutor for CPS London North, confirmed the charges arising from what he called a \"shocking\" incident. Mr Narwal said prosecutors \"have worked to establish that there is sufficient evidence to bring the case to court and that it is in the public interest to pursue criminal proceedings\". Around 100 people gathered for a vigil on Tuesday evening to lay flowers near the police tape at the junction between Midhurst Gardens and Leybourne Road, with some lighting candles."
    },
    {
        "title": "Victims of Post Office Capture scandal say they are being treated as 'second-class' citizens",
        "description": "Victims of the Post Office Capture scandal say they are being treated as second-class citizens - accusing the government of running a \"two-tier\" compensation system.",
        "url": "https://news.sky.com/story/victims-of-post-office-capture-scandal-say-they-are-being-treated-as-second-class-citizens-13460178",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-steve-marston-capture_7052865.png?20251017023238",
        "type": "UK",
        "Author": "Adele Robinson",
        "Date Published": "2025-10-29 18:23:00",
        "Headline": "Capture was used between 1992 and 1999 in up to 2,500 Post Office branches - with many sub postmasters making up cash losses themselves. A government commissioned report last year found it was likely the software caused accounting errors.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n Victims of the Post Office Capture scandal say they are being treated as second-class citizens - accusing the government of running a \"two-tier\" compensation system. It comes as the Department for Business and Trade announced the launch of the first-ever redress scheme for those wronged after faulty software created false accounting shortfalls in the 1990s. Capture was used between 1992 and 1999 in up to 2,500 Post Office branches, with many sub postmasters making up cash losses themselves. A government-commissioned report last year found it was likely the software caused accounting errors. The Capture Redress Scheme will provide payments of up to £300,000, and more in \"exceptional\" cases, to former postmasters who suffered financial losses. Steve Marston, who was convicted in 1998 of stealing from his branch and is not yet eligible to apply to the scheme, said other victims were feeling \"frustrated\" with it.  \"I want to know, what do they consider exceptional circumstances?\" he said, \"because I want it to see it in black and white what they consider as exceptional circumstances rather than just a vague statement.\" He said that victims felt like \"second-class\" citizens, describing the Horizon schemes and the new Capture scheme as \"two-tier\" systems. \"[It's] one law for the Horizon victims, and a totally different law for us Capture victims and that's not really fair. \"One of the main bones of contention is the fact that with Horizon there's a right of appeal against decisions, and you've got multiple rights to appeal. \"Whereas with the Capture appeal process, there's only a one-shot chance, so basically, it's a second-class system.\" The scheme will be tested for the first 150 claimants before a full roll-out. Chris Roberts, whose mother Liz was jailed in 1999 for theft, is one of them and said victims were concerned about the \"glacial pace\" of government.  He is able to apply to the redress scheme on behalf of his father, who was a postmaster alongside his mother, who oversaw accounts. Both Liz and Bill Roberts have passed away. \"I'd hate us to get to the point where, you know, this scheme's come out and we go through these 150 cases and then it's further developed … and half the people it would apply to are gone,\" Chris said. \"We will lose people before they can see justice, and I think that's a terrible tragedy.\" Under the Capture scheme, eligible claimants will receive an immediate interim payment of £10,000. An independent panel will then assess final awards through a banding model ranging from £10,000 to £300,000, with higher payments in exceptional circumstances. The Post Office Minister Blair McDougall, speaking exclusively to Sky News, said he understood why victims have \"low levels of trust in the state\". He said: \"They've been treated appallingly by the state, but what we've done with this scheme is to try to learn some of those lessons from previous compensation schemes for postmasters that didn't work. \"So we're collecting more evidence from the beginning to try to speed things up.  \"We're trying to give sub postmasters the benefit of the doubt throughout this. And I hope we will see that this scheme treats them with a bit more dignity and a bit more urgency.\" He also said that funds overall for the Capture scandal were \"uncapped\", with \"no ceiling\" on compensation. Mr McDougall also said that the government was working \"as fast as we possibly can, and that's because people have waited so long\". Read more:At least eight Capture convictions investigatedMajor milestone in Post Office scandal When asked if he would personally guarantee speedy redress, he replied: \"Absolutely - that's what we are doing today, to make sure that we have a scheme that gets people's redress as quickly as possible. \"But it's challenging, because we're dealing with cases where there's not a lot of evidence. So much time has passed. \"So we tried to design a scheme to get postmasters the benefit of the doubt and to try to be as fair as possible.\" He said within the scheme there was the \"opportunity\" for victims to make a \"wider case of the impact on their lives - and if the independent panel feels that there is a compelling case, they can go beyond that £300,000\"."
    },
    {
        "title": "Luke Littler: Darts star misses Players Championship event in Wigan after being caught in traffic",
        "description": "Darts star Luke Littler has missed Wednesday's Players Championship event because he got caught in a traffic jam and missed the registration deadline.",
        "url": "https://news.sky.com/story/luke-littler-darts-star-misses-players-championship-event-in-wigan-after-being-caught-in-traffic-13460059",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-luke-littler-darts_6920160.jpg?20250518121356",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-29 15:05:00",
        "Headline": "The 18-year-old player had to register for the tournament by 11am, but he missed the strict cut-off because of congestion on the roads.",
        "Content": "Darts star Luke Littler has missed Wednesday's Players Championship event because he got caught in a traffic jam and missed the registration deadline. The 18-year-old world champion, who is ranked second in the world, had to register for the tournament in Wigan by 11am, but failed to make the strict cut-off after getting stuck in road congestion. The Professional Darts Corporation (PDC) confirmed his absence from the competition, Sky Sports said. Wednesday and Thursday's Players Championship events are the last two tournaments for players to secure places in the season-ending Players Championship finals, held in Minehead next month. Littler, nicknamed 'The Nuke', has already qualified for the finals after winning Players Championship 32 earlier this month. He can still compete in Thursday's event, as long as he registers before 11am on the day, as it is a separate event. The teenager appeared unfazed by the setback, sharing a picture from inside the car to his Instagram story alongside the caption \"back to bed it is, wonder who they're going to call up?\", and a laughing emoji. \n                  Luke Littler under new management after joining forces with Target Darts\n                 \n                  Luke Littler hits out at 'scum of the earth' vandals who targeted his van\n                 \n                  Luke Littler says historic World Darts Championship win 'incredible' for his family\n                 The event, held at Robin Park Leisure Centre, is the penultimate Players Championship event of the year. Another Englishman, Charlie Manby, ranked 174th in the PDC's order of merit, has replaced him. Read more from Sky News:Deported sex offender given £500Questions over prince's 'peppercorn' rent Littler has already won the World Championship, UK Open, World Matchplay and the Grand Slam of Darts this year, but was knocked out of the European Championship in Dortmund by James Wade last week. The Warrington-based player was made an MBE in the King's Birthday Honours list in June for services to darts. In January, he became the sport's youngest world champion, aged just 17."
    },
    {
        "title": "British military instructor accused of spying for Russia arrested in Ukraine",
        "description": "A British man accused of spying for Russia has been detained in Ukraine, according to prosecutors.",
        "url": "https://news.sky.com/story/british-military-instructor-accused-of-spying-for-russia-by-ukraine-13460249",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kyiv-ukraine_7066181.jpg?20251029195204",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-29 19:45:00",
        "Headline": "The man is said to have arrived in Ukraine in January 2024 and initially worked as a military instructor in Mykolaiv. He reportedly later worked in a border unit.",
        "Content": "A British man accused of spying for Russia has been detained in Ukraine, according to prosecutors. Prosecutors in Kyiv allege in a statement that the unnamed man \"collaborated\" with Russian special services - and agreed to provide military information in return for money. The man is accused of the \"unauthorised dissemination of information about the defence forces in conditions of martial law\", an offence which carries a prison term of up to 12 years. In a separate statement, the Security Service of Ukraine (SSU) allege that the man was \"preparing to carry out terrorist attacks\". They claim he \"offered his services\" to Russian special services on pro-Kremlin online groups. It is alleged that he was then contacted by a member of the FSB, Russia's secret police. The SSU statement added: \"The occupiers provided him with instructions for making an improvised explosive device. They also sent him the coordinates of a weapons cache, from which he retrieved a pistol with two loaded magazines.\" He was detained at a \"temporary residence\" in Kyiv, according to the SSU. \n                  Investigation into Reeves not needed, says Starmer - after she apologises for rental 'mistake'\n                 \n                  This mum faces a nightly battle to keep her daughter alive - but the NHS won't help her\n                 \n                  'Huge vote of confidence' as data centre giant announces £4bn British investment\n                 The man is said to have arrived in Ukraine in January 2024 and initially worked as a military instructor in Mykolaiv. He reportedly later worked in a border unit. Prosecutors say he then moved to Odesa, where he \"established contact with a representative of the Russian special service, and agreed to provide military information for money\". It is alleged he transmitted the coordinates of Ukrainian units, along with photographs of a training area and other information, in May this year. It is claimed that he received $6,000 for one \"task\". Read more:Kremlin threatens foreign fighters in UkraineUkraine will work on ceasefire plan - Zelenskyy Prosecutors say the pre-trial investigation \"is being conducted by the investigators of the Security Service of Ukraine with operational support from counter-intelligence units\". The man appeared in court this week and was detained without bail."
    },
    {
        "title": "Small boat migrant who stabbed man to death in Derby bank jailed",
        "description": "A small boat migrant who stabbed a man to death in a high street bank has been jailed for life, with a minimum term of 25 years.",
        "url": "https://news.sky.com/story/haybe-cabdiraxmaan-nur-small-boat-migrant-who-stabbed-man-to-death-in-derby-bank-jailed-13460015",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-haybe-cabdiraxmaan-nur_6997017.jpg?20251029175738",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-29 13:24:00",
        "Headline": "Haybe Cabdiraxmaan Nur pleaded guilty to the murder of Gurvinder Singh Johal, 37, at Derby Crown Court in August. The 47-year-old stabbed Mr Johal at random shortly after angrily complaining about his refused asylum application.",
        "Content": " A small boat migrant who stabbed a man to death in a high street bank has been jailed for life, with a minimum term of 25 years. Haybe Cabdiraxmaan Nur pleaded guilty to the murder of Gurvinder Singh Johal, 37, at Derby Crown Court in August. The Somali national stabbed Mr Johal at random shortly after angrily complaining about his refused asylum application. Mr Johal, who was known to friends as Danny, died after being stabbed inside Lloyds Bank in St Peter's Street on 6 May this year. He was pronounced dead at the scene. Nur, who paid just over £350 to travel to the UK last year, was jailed at Derby Crown Court on Wednesday. He was caught on multiple CCTV cameras attacking Mr Johal with a kitchen knife. Derby Crown Court heard how Nur had called charity Migrant Help less than two hours before the killing, saying he was \"going to kill 500 people,\" later suggesting he was going to target \"doctors, police or people working at the Home Office\". Read more from Sky News:20 warnings for Starmer from new deputy leaderLocals relive 'apocalyptic scenes' after Spain's floods disaster  The 47-year-old had claimed asylum in October last year, shortly after arriving in the UK. His claim was rejected by the Home Office because he had arrived \"voluntarily\" - a decision he later appealed. Jailing Nur for life on Wednesday, Judge Shaun Smith KC told the defendant the murder was a \"brutal and callous act\". He added: \"It was a real-life horror film for everyone connected to Mr Johal and everyone who had the misfortune of witnessing your wicked act.\""
    },
    {
        "title": "At least 30 killed after 'unprecedented' Hurricane Melissa ravages through Caribbean",
        "description": "At least 30 people have died after Hurricane Melissa tore through the Caribbean on Wednesday.",
        "url": "https://news.sky.com/story/at-least-30-killed-after-unprecedented-hurricane-melissa-ravages-through-caribbean-13460469",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hurricane-melissa-jamaica_7066508.jpg?20251029231953",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-29 23:09:00",
        "Headline": "The storm made landfall in Cuba in the early hours of Wednesday morning before heading towards the Bahamas.",
        "Content": "At least 30 people have died after Hurricane Melissa tore through the Caribbean on Wednesday. The Red Cross said early indications show the storm has been a \"disaster of unprecedented catastrophe\". Storm Melissa has so far ravaged through Jamaica, Haiti, the Dominican Republic and Cuba. At least 34 are estimated to be dead in the Caribbean, with eight of those in Jamaica, one in the Dominican Republic and 25 in Haiti. This was down from a previously reported 40.  'Heartbreaking' aerial footage reveals scale of destruction Later on Wednesday, the Jamaican government confirmed four people - three men and one woman - had been killed. This figure later rose to eight. Local government minister, Desmond McKenzie, said: \"They were discovered after being washed up by the flood waters generated by the hurricane.\" Devastating aerial footage shows towns destroyed by the storm. The Jamaican prime minister, Andrew Holness, travelled to St Elizabeth, where the first deaths were reported, to inspect the storm's impact. Read more:Do we need new 'category 6' for most extreme storms? Sharing aerial footage of battered homes, he wrote: \"The damage is great, but we are going to devote all our energy to mount a strong recovery.\" The storm made landfall in Cuba in the early hours of Wednesday morning before leaving mid-afternoon, heading towards the Bahamas. 'Whole communities are underwater' Alexander Pendry, British Red Cross global response manager, said: \"News is already coming through that whole communities are underwater and that the damage left by the strong winds has been devastating. \"The Jamaica Red Cross has been proactively supporting communities by preparing essential supplies and managing shelters. Their priority now is to reach people with aid as soon as possible. \"Across the Caribbean, Red Cross teams have been mobilising as Melissa continues its trajectory across Cuba, Dominican Republic and Haiti.\" He added: \"Tragically, experience tells us that the impact on communities and individuals will be shattering and long lasting. \"We will be here for as long as people need us.\""
    },
    {
        "title": "Tens of thousands killed in two days in Sudan city, analysts believe",
        "description": "Tens of thousands of people have been killed in the Sudanese city of Al Fashir by the Rapid Support Forces (RSF) in a two-day window after the paramilitary group captured the regional capital, analysts believe.",
        "url": "https://news.sky.com/story/tens-of-thousands-killed-in-two-days-in-sudan-city-analysts-believe-13460278",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sudan-war-al-fashir_7066310.jpg?20251029211440",
        "type": "World",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-10-29 20:12:00",
        "Headline": "Sky News is not able to independently verify the claims, but stains and shapes resembling blood and corpses can be seen from space in satellite images.",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n  Tens of thousands of people have been killed in the Sudanese city of Al Fashir by the Rapid Support Forces (RSF) in a two-day window after the paramilitary group captured the regional capital, analysts believe. Sky News is not able to independently verify the claim by Yale Humanitarian Labs, as the city remains under a telecommunications blackout. Stains and shapes resembling blood and corpses can be seen from space in satellite images analysed by the research lab. Nathaniel Raymond, executive director of Yale Humanitarian Labs, said: \"In the past 48 hours since we've had [satellite] imagery over Al Fashir, we see a proliferation of objects that weren't there before RSF took control of Al Fashir - they are approximately 1.3m to 2m long which is critical because in satellite imagery at very high resolution, that's the average length of a human body lying vertical.\" Mini Minawi, the governor of North Darfur, said on X that 460 civilians have been killed in the last functioning hospital in the city. The Sudan Doctors Network has also shared that the RSF \"cold-bloodedly killed everyone they found inside Al Saudi Hospital, including patients, their companions, and anyone else present in the wards\". World Health Organisation (WHO) chief Dr Tedros Adhanom Ghebreyesus said it was \"appalled and deeply shocked\" by the reports. Satellite images support the claims of a massacre at Al Saudi Hospital, according to Mr Raymond, who said YHL's report detailed \"a large pile of them [objects believed to be bodies] against a wall at one building at Saudi hospital. And we believe that's consistent with reports that patients and staff were executed en masse\". In a video message released on Wednesday, RSF commander Mohamed Hamdan Dagalo acknowledged \"violations in Al Fashir\" and claimed \"an investigation committee should start to hold any soldier or officer accountable\".  The commander is known for committing atrocities in Darfur in the early 2000s as a Janjaweed militia leader, and the RSF has been accused of carrying out genocide in Darfur 20 years on. Sources have told Sky News the RSF is holding doctors, journalists and politicians captive, demanding ransoms from some families to release their loved ones. One video shows a man from Al Fashir with an armed man kneeling on the ground, telling his family to pay 15,000. The currency was not made clear. In some cases, ransoms have been paid, but then more messages come demanding that more money be transferred to secure release. Muammer Ibrahim, a journalist based in the city, is currently being held by the RSF, who initially shared videos of him crouched on the ground, surrounded by fighters, announcing his hometown had been captured under duress. Read more:Key Sudan city falls - what does this mean for the war?'Massacre' kills more than 50, including children200,000 trapped after army flees He is being held incommunicado as his family scrambles to negotiate his release. Muammer courageously covered the siege of Al Fashir for months, enduring starvation and shelling. The Committee to Protect Journalists regional director Sara Qudah said the abduction of Muammar Ibrahim \"is a grave and alarming reminder that journalists in Al Fashir are being targeted simply for telling the truth\"."
    },
    {
        "title": "Hurricane Melissa: What we know about the powerful storm in Cuba that 'ravaged' Jamaica ",
        "description": "Hurricane Melissa, the most powerful hurricane of the year so far, has hit Cuba after ripping through Jamaica.",
        "url": "https://news.sky.com/story/hurricane-melissa-what-we-know-about-the-powerful-storm-approaching-jamaica-13459190",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hurricane-jamaica_7065285.jpg?20251028212241",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-29 18:37:00",
        "Headline": "The hurricane, which is now tearing through Cuba, was the first Category 5 storm to hit Jamaica since records began 174 years ago.",
        "Content": " Hurricane Melissa, the most powerful hurricane of the year so far, has hit Cuba after ripping through Jamaica. The Category 5 hurricane, which has now been downgraded, has left a trail of destruction in Jamaica, with prime minister Andrew Holness saying it \"ravaged\" the country. It reached wind speeds of 185mph on Tuesday, making it the worst storm to hit the Caribbean country since records began 174 years ago. At least 25 people have died in the southern Haitian coastal town of Petit-Goâve after the La Digue river burst its banks as a result of the hurricane, according to the town's mayor Jean Bertrand Subreme. Officials have said the storm is responsible for at least seven other deaths in the Caribbean, including three in Jamaica, three in Haiti and one in the Dominican Republic, where another person remains missing. The three deaths in Jamaica happened during preparations for the storm's arrival as people were cutting trees, health minister Christopher Tufton said. Desmond McKenzie, Jamaica's local government minister, says it's too early to report on fatalities caused after Melissa struck. Here's what we know so far. How badly was Jamaica hit? The government formally declared Jamaica a disaster area as the storm struck, saying more than 530,000 were without power and almost every parish had reported blocked roads, fallen trees and major flooding. Floodwaters trapped at least three families in their homes in the community of Black River in western Jamaica, and crews were unable to help them because of dangerous conditions, according to Mr McKenzie.  \"Roofs were flying off,\" he said. \"We are hoping and praying that the situation will ease so that some attempt can be made to get to those persons.\" He said the southwestern parish of St. Elizabeth \"is underwater\" and had suffered extensive damage. Four main hospitals along the coast were damaged and one lost power, forcing officials to evacuate 75 patients, he added. As of Wednesday afternoon, 77% of the country remained without electricity, according to government officials. The extent of the damage across the country is not fully known, but aid group the Red Cross said early indications are that Hurricane Melissa has been a \"disaster of unprecedented catastrophe\". \"News is already coming through that whole communities are underwater and that the damage left by the strong winds has been devastating,\" said Alexander Pendry, British Red Cross global response manager. \"Tragically, experience tells us that the impact on communities and individuals will be shattering and long lasting.\" Before the hurricane made landfall, the Red Cross said it was preparing for just over half of Jamaica's population, about 2.8 million people, to be directly affected. Live updates as hurricane rips through Cuba The prime minister had warned there was \"no infrastructure in the region that can withstand a Category 5\". Addressing Jamaicans in a statement on X on Wednesday morning, Mr Holness vowed to rebuild \"even better than before\".  \"I know many, especially those in the worst-affected parishes, are feeling disheartened,\" he said. \"Your homes may have been damaged or destroyed and your communities and towns no longer look the same. \"I know your pain and I feel your loss. We are mobilising quickly to start the relief and recovery efforts and we will be there with you every step of the way.\" The government hoped to reopen airports as early as Thursday to allow aid into the country from UN agencies and dozens of non-profits.  It had issued mandatory evacuation orders before the storm hit for at least seven areas in the southeast that were designated as high risk, but reported that many residents decided to remain in their homes. How bad could it get in Cuba? Life-threatening and potentially catastrophic flash flooding with numerous landslides are possible, according to the US National Hurricane Center. While it was downgraded before reaching Cuba in the early hours of Wednesday, forecasters said it \"restrengthened\" shortly before landfall, with wind speeds of up to 125mph as it approached. Read more:What is the difference between a cyclone, typhoon and hurricane? Rainfall of up to 50cm (20in) was expected, rising to 63cm (25in) over mountainous terrain, while a storm surge could reach 2.4m to 3.6m (8ft to 12ft) above normal tide levels along the southeast Cuban coast, accompanied by \"large and destructive waves,\" according to the US centre. More than 735,000 people have been evacuated to shelters and a hurricane warning is in effect for the provinces of Granma, Santiago de Cuba, Guantanamo, Holguin and Las Tunas. \"There will be a lot of work to do. We know there will be a lot of damage,\" Cuba's president Miguel Díaz-Canel said in a televised address, pledging that \"no one is left behind and no resources are spared to protect the lives of the population\". He urged the public not to underestimate the power of Melissa, \"the strongest ever to hit national territory\". Melissa was categorised as the strongest type of hurricane on the Saffir-Simpson Hurricane Wind Scale as it ripped through Jamaica. This scale rates maximum sustained wind speeds from one to five based on potential property damage. By the time it reached Cuba it had been demoted to Category 3, but the scale does not take into account related dangers like storm surge, rainfall flooding and tornadoes. All hurricanes produce life-threatening winds, but hurricanes rated Category 3 and higher are deemed major hurricanes. • Category 1: 74-95mph. Very dangerous winds will produce some damage • Category 2: 96-110mph. Extremely dangerous winds will cause extensive damage • Category 3: 111mph-129mph: Devastating damage will occur • Category 4: 130mph-156mph: Catastrophic damage will occur • Category 5: 157mph+ Catastrophic damage will occur Why is the storm named Melissa? Since 1953, Atlantic tropical storms have been named by the US National Hurricane Center and then the World Meteorological Organisation. Six lists of names are used in rotation and recycled every six years. Should three more storms occur after Melissa, their names will be Nestor, Olga and Pablo. The only time there is a change to the list is if a storm is so catastrophic that to use its name for another storm would be insensitive. For example, the name Katrina was retired by the World Meteorological Organisation due to the 2005 storm's devastating impact - it was replaced with the name Katia. The use of easily remembered names reduces confusion when two or more tropical storms occur at the same time."
    },
    {
        "title": "Suspects arrested over Louvre heist 'partially admit involvement' - as officials address inside job theory",
        "description": "The two suspects arrested over the Louvre jewellery heist have \"partially\" confessed to their involvement in the robbery, according to a prosecutor.",
        "url": "https://news.sky.com/story/suspects-arrested-over-louvre-heist-partially-admit-involvement-as-officials-address-inside-job-theory-13460064",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-louvre-paris_7066014.jpg?20251029163806",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-29 15:32:00",
        "Headline": "Paris police have acknowledged gaps in the Louvre's security systems following an audacious robbery at the world-famous museum.",
        "Content": "The two suspects arrested over the Louvre jewellery heist have \"partially\" confessed to their involvement in the robbery, according to a prosecutor. Paris prosecutor Laure Beccuau revealed the development at a news conference on Wednesday.  Four thieves stole nine items - one of which was dropped and recovered at the scene - in a heist pulled off while the world-famous Paris museum was open to visitors on 19 October. It took the thieves less than eight minutes to steal the jewels. They forced open a window and cut into cases with power tools after gaining access via a vehicle-mounted mechanical lift.  Ms Beccuau also said the jewels had not yet been recovered. \"These jewels are now, of course, unsellable,\" said Ms Beccuau. \"Anyone who buys them would be guilty of concealment of stolen goods. It's still time to give them back.\" 'No evidence' Ms Beccuau also addressed reports that police believe the robbery could have been an inside job. She said that there was \"no evidence the thieves benefited from inside help\". Under French rules for organised theft, custody can run up to 96 hours. That limit is due to expire late on Wednesday, and prosecutors must charge the suspects, release them or seek a judge's extension. One suspect is a 34-year-old Algerian national who has been living in France since 2010, Ms Beccuau said. He was arrested Saturday night at Charles de Gaulle airport as he was about to fly to Algeria with no return ticket. Ms Beccuau said that he was living in the Paris suburb of Aubervilliers, and was known to police mostly for road traffic offences. The other suspect, 39, was arrested Saturday night at his home in Aubervilliers. \"There is no evidence to suggest that he was about to leave the country,\" said Ms Beccuau.  The man was known to police for several thefts, and his DNA was found on one of the glass cases where the jewels were displayed, and on items the thieves left behind, she added. Earlier, French police acknowledged major gaps in the Louvre's defences. Paris police chief Patrice Faure told politicians that ageing security systems had left weak spots. \"A technological step has not been taken,\" he said. Read more:Prosecutor furious as news leaks of Louvre arrestsMakers of lift used by Louvre thieves reveal cheeky advert Mr Faure also revealed that the Louvre's authorisation to operate its security cameras quietly expired in July and had not been renewed. He said the first alert to police came not from the Louvre's alarms, but from a cyclist outside who dialled the emergency line after seeing helmeted men with a basket lift. Mr Faure also rejected calls for a permanent police post inside the museum, warning it would set an unworkable precedent and do little against fast and mobile thieves. \"I am firmly opposed,\" he said. \"The issue is not a guard at a door; it is speeding the chain of alert.\""
    },
    {
        "title": "Israel carries out fresh strike on Gaza and accuses Hamas of preparing 'imminent terror attack'",
        "description": "The Israeli military says it has carried out a fresh strike on Gaza, in a move that will further raise concerns about the fragility of its ceasefire with Hamas.",
        "url": "https://news.sky.com/story/israel-carries-out-fresh-strike-on-gaza-and-accuses-hamas-of-preparing-imminent-terror-attack-13460070",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-israel-gaza_7065997.jpg?20251029162119",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-29 15:37:00",
        "Headline": "The Israel Defence Forces (IDF) said it targeted \"terrorist infrastructure\".",
        "Content": "The Israeli military says it has carried out a fresh strike on Gaza, in a move that will further raise concerns about the fragility of its ceasefire with Hamas. The Israel Defence Forces (IDF) said it conducted the strike on what it called \"terrorist infrastructure\" in the area of Beit Lahia in the northern Gaza Strip. It said the site was being used to store weapons that it claimed were \"intended to be used for the execution of an imminent terror attack against IDF soldiers\". \"IDF soldiers in the southern command remain deployed in accordance with the ceasefire agreement and will continue to operate to remove any immediate threat,\" a spokesperson said. People living in Gaza City said they heard an explosion in Gaza and saw a column of smoke. It comes after hospital officials said at least 104 people, including 46 children, had been killed overnight in Gaza after Israel launched new strikes. Benjamin Netanyahu ordered the strikes after an Israeli official reported that troops had come under fire in southern Gaza. Israel claimed a soldier was killed on Tuesday afternoon by \"enemy fire\" in the southern city of Rafah. Read more:Trump defends Israeli strikes in Gaza Israel says one of its soldiers killed in Gaza The decision also followed Hamas's handover on Monday of body parts that Israel said belonged to a hostage whose remains were partly recovered earlier in the conflict. Hamas has denied any role in the Rafah shooting and reaffirmed its commitment to the ceasefire.  'Nothing is going to jeopardise the ceasefire' US President Donald Trump had said the ceasefire was not at risk, telling reporters: \"As I understand it, they took out an Israeli soldier.\" He added: \"So the Israelis hit back and they should hit back. When that happens, they should hit back. Nothing is going to jeopardise [the ceasefire]. \"You have to understand Hamas is a very small part of peace in the Middle East, and they have to behave.\" Following the latest strikes, the Israeli military said it would continue to uphold the ceasefire agreement. It added that it would respond firmly to \"any violation\". 'Very disappointing and frustrating' Qatar's Prime Minister, Sheikh Mohammed bin Abdulrahman al-Thani, said on Wednesday that the attack on the Israeli soldier and the following airstrikes had been \"very disappointing and frustrating for us\". Qatar had been leading peace efforts in Gaza, along with the US and Egypt. At the Council on Foreign Relations in New York, al-Thani said Hamas militants had been clear they were prepared to give up governance of the enclave, which they have run since 2007. He added that Qatar had been pushing them to acknowledge that they need to disarm."
    },
    {
        "title": "Hurricane Melissa: Do we need new 'category 6' for most extreme storms?",
        "description": "Hurricane Melissa was the second strongest Atlantic storm on record.",
        "url": "https://news.sky.com/story/hurricane-melissa-do-we-need-new-category-6-for-most-extreme-storms-13460248",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-melissa-jamaica_7066306.jpg?20251029211125",
        "type": "World",
        "Author": "Thomas Moore",
        "Date Published": "2025-10-29 19:42:00",
        "Headline": "As storms get increasingly extreme, scientists have called for an updated scale.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  Hurricane Melissa was the second strongest Atlantic storm on record. But future hurricanes could be even more intense. So do we need a new top-tier, a 'category 6' for extreme winds? At the moment, scientists classify storms by the five-level Saffir-Simpson scale. Melissa was right at the top, a category 5. Latest updates: Aerial footage reveals scale of Jamaica destruction So was Hurricane Katrina in 2005, which killed almost 1,400 people and caused $125bn (£95bn) in damage. To make it into the top tier, a hurricane needs a sustained wind speed of 157 miles an hour. But some scientists say the 50-year-old scale just doesn't cut it anymore as storms get more extreme. And we need a new top tier - a category 6 - for hurricanes with winds faster than 192 miles an hour. Would Melissa reach the bar? Not quite. It had sustained windspeeds of 185mph.  Read more:'Nervous' tourists tell of Hurricane Melissa ordealHospital roof in Jamaica flies off almost hitting staff The strongest Atlantic storm on record, Hurricane Allen in 1980, had winds of 190mph. So for now, a category 6 storm is just theoretical. But global warming is making storms more intense, with rising sea temperatures driving the winds faster and faster. Right now, the Caribbean is 2-3 degrees warmer than normal, so the destruction left behind by Melissa is climate change writ large. If fossil fuel emissions keep on rising, there will be stronger hurricanes, and yes, ones which could reach that bar for category 6."
    },
    {
        "title": "Microsoft outage knocks Office 365 and X-Box Live offline for thousands of users",
        "description": "Microsoft Azure was down for thousands of users on Wednesday due to issues with its domain name system.",
        "url": "https://news.sky.com/story/thousands-of-users-unable-affected-by-microsoft-azure-outage-13460125",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-microsoft-websites_7066051.jpg?20251029173441",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-29 16:57:00",
        "Headline": "Azure was down for more than 105,000 users, Downdetector, which tracks online outages, said on X.",
        "Content": "Microsoft Azure was down for thousands of users on Wednesday due to issues with its domain name system. Microsoft said it was \"investigating an issue with the Azure Portal where customers may be experiencing issues accessing the portal\". It later said a fix had rolled out to solve the issue. Azure was down for more than 105,000 users, Downdetector, which tracks online outages, said on X. It said Microsoft 365 was down for nearly 9,000 users. The tech company said it was reviewing reports of an issue impacting Azure and services, including an impact on the Microsoft 365 admin center. A Microsoft spokesperson told Sky News: \"We are working to address an issue affecting Azure Front Door that is impacting the availability of some services. Customers should continue to check their Service Health Alerts and the latest update on this issue can be found on the Azure status page.\" On Downdetector, a website that tracks online outages, users reported issues with Office 365, Minecraft, X-Box Live, Copilot, Costco, Starbucks, and many other services. Alaska Airlines posted on its X account that the outage is at the heart of problems affecting its systems, including check-in services. The issue came hours before Microsoft was set to release its quarterly earnings report. Amazon's AWS cloud service faced an outage last week, which caused global chaos on thousands of sites, including some of the web's most popular apps, such as Snapchat and Reddit. "
    },
    {
        "title": "British military instructor accused of spying for Russia arrested in Ukraine",
        "description": "A British man accused of spying for Russia has been detained in Ukraine, according to prosecutors.",
        "url": "https://news.sky.com/story/british-military-instructor-accused-of-spying-for-russia-by-ukraine-13460249",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kyiv-ukraine_7066181.jpg?20251029195204",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-29 19:45:00",
        "Headline": "The man is said to have arrived in Ukraine in January 2024 and initially worked as a military instructor in Mykolaiv. He reportedly later worked in a border unit.",
        "Content": "A British man accused of spying for Russia has been detained in Ukraine, according to prosecutors. Prosecutors in Kyiv allege in a statement that the unnamed man \"collaborated\" with Russian special services - and agreed to provide military information in return for money. The man is accused of the \"unauthorised dissemination of information about the defence forces in conditions of martial law\", an offence which carries a prison term of up to 12 years. In a separate statement, the Security Service of Ukraine (SSU) allege that the man was \"preparing to carry out terrorist attacks\". They claim he \"offered his services\" to Russian special services on pro-Kremlin online groups. It is alleged that he was then contacted by a member of the FSB, Russia's secret police. The SSU statement added: \"The occupiers provided him with instructions for making an improvised explosive device. They also sent him the coordinates of a weapons cache, from which he retrieved a pistol with two loaded magazines.\" He was detained at a \"temporary residence\" in Kyiv, according to the SSU. \n                  Investigation into Reeves not needed, says Starmer - after she apologises for rental 'mistake'\n                 \n                  This mum faces a nightly battle to keep her daughter alive - but the NHS won't help her\n                 \n                  'Huge vote of confidence' as data centre giant announces £4bn British investment\n                 The man is said to have arrived in Ukraine in January 2024 and initially worked as a military instructor in Mykolaiv. He reportedly later worked in a border unit. Prosecutors say he then moved to Odesa, where he \"established contact with a representative of the Russian special service, and agreed to provide military information for money\". It is alleged he transmitted the coordinates of Ukrainian units, along with photographs of a training area and other information, in May this year. It is claimed that he received $6,000 for one \"task\". Read more:Kremlin threatens foreign fighters in UkraineUkraine will work on ceasefire plan - Zelenskyy Prosecutors say the pre-trial investigation \"is being conducted by the investigators of the Security Service of Ukraine with operational support from counter-intelligence units\". The man appeared in court this week and was detained without bail."
    },
    {
        "title": "China's Xi holding Trump card ahead of meeting with US president",
        "description": "There has been plenty to leave Donald Trump buoyant during his trip around Asia.",
        "url": "https://news.sky.com/story/chinas-xi-holding-trump-card-ahead-of-meeting-with-us-president-13460145",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-china_7066057.jpg?20251029174443",
        "type": "World",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-10-29 17:22:00",
        "Headline": "Donald Trump will meet China's President Xi tomorrow for the first time since 2019, following a turbulent spell in their relationship.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n  There has been plenty to leave Donald Trump buoyant during his trip around Asia. Formality, flattery and ego-stroking gifts have sat alongside genuine agreements to solidify trade, diversify supply chains and build on existing allegiances. But for all of Trump's gravitas, for all the sway he clearly holds in this region, much of what we have seen has, no doubt, been a form of response to another great power, another unignorable presence. And that, of course, is China. It's been more than six years since Donald Trump and Xi Jinping have met in person. Tomorrow they will sit down together to attempt to iron out some of the disagreements that have plagued their relations and rocked the global economy since the early weeks of Trump's presidency. Managing this geopolitical relationship is far more complex than anything else he has engaged with this week, but it is the real metric of this trip's success. Trump will find a different Chinese leader to the one he last saw in 2019, with a different approach to negotiating with him. Xi has learnt from experiences in Trump's first term and has clearly made the strategic decision that a deal for a deal's sake is not worth having. This time, China has opted to match Trump's playbook, matching strength with strength, unpredictability with unpredictability, maximum pressure with maximum pressure - and so far it's been working for them. Read more from Sky News:More than a dozen killed as US attacks alleged drug boats in PacificUS warship arrives in Trinidad and Tobago  Xi has his own public to answer to and his own image as a strongman to protect. His stance of standing up to Trump - not yielding to the imposition of high tariffs, but instead matching them tit-for-tat, has been popular at home despite rates reaching as high as 145%, making trade all but impossible. In short, China is coming to the table with a new sense of confidence - and it is one that Trump should not underestimate. This confidence is based on a number of factors, including major technological breakthroughs and recent military expansion. The unveiling of DeepSeek is one such example - an open source AI product made for a fraction of the cost of Western alternatives. But it also comes from the fact that China holds arguably the most powerful trump card in these negotiations, and that is the control of the rare earth industry. Rare earths are the crucial metals used to develop everything from cars and semiconductors to AI and advanced weaponry. China has about 60% of the world's supply, and controls about 90% of its processing. China has been gradually increasing restrictions in response to Trump's tariffs. It raised the stakes a few weeks ago, introducing a stringent new licensing system that requires Chinese government approval for the export of any product containing even trace of rare earths. This system going into force, as it is scheduled to do in the coming days, would be disastrous for the US and will no doubt be central to negotiations. Both teams have clearly worked hard to lay the groundwork for their leaders to agree, and it is quite possible that some form of 'quick fix' economic deal will be decided; there's a sense that the current instability is pretty unpalatable to both sides. There may also be progress on issues like fentanyl and TikTok. But a longer-term political understanding that reverses the recent spiral of distrust is unlikely, and there are still so many stumbling blocks - from deep-seated political differences over issues like Taiwan to a contrast of styles. Trump likes to assume his force of character will get a deal over the line while Xi is process-driven and unlikely to sign off on something that hasn't been ironed out in advance. This all matters because the stakes are extremely high. As one source close to the Chinese government put it to me \"the chances of armed conflict are not at zero\". Achieving a degree of stabilisation will, of course, be welcomed in this region and around the world, but the chances of it holding feel thin."
    },
    {
        "title": "Families mourn dozens killed during Rio de Janeiro's 'biggest' raid against drugs gang",
        "description": "Grieving families have been mourning dozens of people killed during a lethal police operation against gang members in Rio de Janeiro, days before Brazil hosts the COP30 climate summit.",
        "url": "https://news.sky.com/story/families-mourn-dozens-killed-during-rio-de-janeiros-biggest-raid-against-drugs-gang-13459992",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-drug-trafficking-brazil_7065804.jpg?20251029142217",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-29 14:49:00",
        "Headline": "Police in Brazil launched a massive raid targeting a notorious gang, just days before dignitaries like Prince William begin arriving in Brazil ahead of the COP30 climate summit.",
        "Content": "Grieving families have been mourning dozens of people killed during a lethal police operation against gang members in Rio de Janeiro, days before Brazil hosts the COP30 climate summit. Local officials say at least 119 people died in a massive raid in the city's sprawling Alemao and Penha favelas, targeting the notorious drug-trafficking gang Comando Vermelho (Red Command). About 40 bodies were lined up on the street. They were carried there by residents who went looking for their missing relatives after Tuesday's operation. Prince William is among the dignitaries due to attend Brazil in the coming days at the C40 global summit - part of the build up to COP30 - where he will hand out the 2025 Earthshot Prize. Celebrities, including pop star Kylie Minogue and four-time Formula One world champion Sebastian Vettel, are also expected to feature. Around 2,500 police and soldiers were involved in the operation on Tuesday, which started shootouts, left four officers dead and resulted in more than 80 arrests.  The state government said 93 rifles and more than half a ton of drugs were also seized. \n                  At least 64 killed as Rio police target drug gang in deadliest-ever raid ahead of COP30 \n                 \n                  Renowned 'sponge city' architect Kongjian Yu dies in Brazil plane crash\n                 \n                  Jair Bolsonaro: Brazil's ex-president sentenced to 27 years in jail for coup attempt - as Trump warns conviction is 'very bad' for country\n                 Police in Rio have often conducted large-scale operations against criminal groups ahead of major events in the city, which hosted the 2016 Olympics, the G20 summit in 2024 and the BRICS summit in July. Footage on social media showed fire and smoke rising from the two favelas as gunfire rang out. Schools and a nearby university across the two neighbourhoods were closed. Read more from Sky News:Brazil's ex-president jailedClimate warning ahead of COP30Architect dies in Brazil plane crash Suspected gang members blocked roads in northern and southeastern Rio in response to the raid, local media reported. At least 50 buses were commandeered to be used in the blockades, the city's bus organisation, Rio Onibus, said. Rio's state governor Claudio Castro praised the police raids, calling them the biggest such operation in the city's history. But the United Nations Human Rights Office said it was \"horrified\" by the deadly police operation, and reminded authorities of their obligations under international human rights law. Emerging from Rio's prisons, the Red Command criminal gang has expanded its control in favelas in recent years. Rio has been the scene of lethal police raids for decades. In March 2005, some 29 people were killed in Rio's Baixada Fluminense region, while in May 2021, 28 were killed in the Jacarezinho favela."
    },
    {
        "title": "Microsoft, Alphabet and Meta results overshadowed by growing fears of AI bubble",
        "description": "Some of the world's biggest tech giants reported quarterly earnings on Wednesday - with a mixed bag of results as fears grow that a bubble is forming in artificial intelligence.",
        "url": "https://news.sky.com/story/microsoft-alphabet-and-meta-results-overshadowed-by-growing-fears-of-ai-bubble-13460474",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-mark-zuckerberg-meta_7066517.jpg?20251029232746",
        "type": "US",
        "Author": "Connor Sephton",
        "Date Published": "2025-10-29 23:04:00",
        "Headline": "Three of the world's biggest companies are ramping up spending on artificial intelligence - but they're under pressure to show a return on investment.",
        "Content": "\n          News reporter\n              @ConnorSephton\n Some of the world's biggest tech giants reported quarterly earnings on Wednesday - with a mixed bag of results as fears grow that a bubble is forming in artificial intelligence. Microsoft revealed that its spending on AI infrastructure hit almost $35bn (£26.5bn) in the three months to the end of September, a sharp rise compared with the year before. Despite revenue jumping 18% and net income rising 12%, shares plunged by close to 4% in after-hours trading, with investors concerned about the mounting costs of sustaining the boom. Microsoft's vice president of investor relations Jonathan Neilson said: \"We continue to see demand which exceeds the capacity we have available. \"Our capital expenditure strategy remains unchanged in that we build against the demand signal we're seeing.\" Big Tech is facing increasing pressure to show returns on the massive AI investments they're making, against a backdrop of soaring valuations and limited evidence of productivity gains. Microsoft became the world's second most valuable company this week thanks to its 27% stake in OpenAI, the creator of ChatGPT. Its market capitalisation surged beyond $4trn (£3trn) at one point, but that psychologically significant threshold is now in doubt because of recent selloffs. Alphabet makes history Last night's results weren't all doom and gloom - with shares in Google's parent company surging by 6% in after-hours trading. Alphabet has also set out aggressive spending ambitions, but placated investors thanks to an impressive set of results that surpassed analysts' expectations. Total revenue for the quarter stood at a staggering $102.35bn (£77bn), with the search giant's advertising unit remaining robust despite growing competition. But concerns linger that Alphabet's dominance in search could be undermined by AI startups, with OpenAI recently unveiling a browser designed to rival Google Chrome. Hargreaves Lansdown's senior equity analyst Matt Britzman shrugged off this threat - and believes the company is \"gearing up for long-term AI leadership\". He said: \"Alphabet just delivered its first-ever $100bn quarter, silencing the doubters with standout performances in both Search and Cloud. \"AI Overviews and AI Mode are clearly resonating with users, helping to ease fears that Google's core search business is under threat from generative AI. \"With ChatGPT's recent browser demo falling short of a game-changer, Google looks well-placed to put up a strong defence as gatekeeper to the internet.\" Read more from Sky News:Federal Reserve cuts interest ratesMicrosoft Azure outage hits thousands  Meta faces a mauling Meta - the parent company of Facebook, Instagram, and WhatsApp - saw its shares tumble by as much as 10% in after-hours trading. Mark Zuckerberg's tech empire anticipates \"notably larger\" capital expenses next year as it ramps up investments in AI and goes on a hiring spree for top talent. Net income in the third quarter stood at $2.7bn (£2bn) and suffered an eye-watering $16bn (£12bn) hit because of Donald Trump's \"Big Beautiful Bill\". Meta was late to the party on AI but has now doubled down on this still-nascent technology - setting an ambition to achieve superintelligence, a milestone where machines could theoretically outthink humans. The social networking giant continues to benefit from its massive user base, and expects fourth-quarter revenues of up to $59bn (£44bn)."
    },
    {
        "title": "US interest rates cut as concerns over Trump tariff inflation ease",
        "description": "The US central bank has cut interest rates for the second time this year in a move consistently sought by President Trump. ",
        "url": "https://news.sky.com/story/us-interest-rates-cut-as-concerns-over-trump-tariff-inflation-ease-13459996",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jay-powell-trump_6893843.jpg?20250422145901",
        "type": "US",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-10-29 12:23:00",
        "Headline": "The second reduction this year has come despite the US government shutdown preventing the release of key economics data. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The US central bank has cut interest rates for the second time this year in a move consistently sought by President Trump.  Rates were brought down by a quarter of a percentage point to 3.75%-4%. Unlike the UK, the US interest rate is a range to guide lenders rather than a single percentage. The Federal Reserve, known as the Fed, has opted for the cut despite the absence of economic announcements due to the government shutdown. Latest employment figures were not published, as all non-essential functions of government are frozen over the inability of Republican and Democratic legislators to agree on a spending package. The absence of these figures makes it trickier for the Fed to assess the state of the economy and meet its dual mandate to keep inflation steady and maintain maximum employment. Data on price rises, however, showed inflation hit 3% in September, one percentage point above the Fed's 2% target but lower than anticipated by economists. The fact that concerns over spiralling inflation, fuelled by Mr Trump's tariff-induced trade war, have not materialised, has facilitated the cut. \n                  Farage and Tice right to scrutinise one of Bank of England's most radical monetary experiments in history\n                 \n                  Bank of England leaves interest rate unchanged and slows quantitative tightening \n                 \n                  Cost of long term UK government borrowing hits fresh 27-year high\n                 Interest rates had been held amid warnings from Fed chair Jerome Powell that the US economy would grow less and goods would become more expensive due to hiked taxes on imports and the associated disruption in supply. Mr Powell and the Fed in general have, as a result, been the subject of Mr Trump's ire. The president sparked a crisis over the Fed's independence when he moved to remove rate-setter Lisa Cook from her post at the Federal Reserve on alleged mortgage fraud grounds, which she denied. Before the first interest rate drop of his term, in September, Mr Trump had threatened to remove Mr Powell, calling him a \"stupid person\" and saying he \"should be ashamed\". The animosity comes despite Mr Trump appointing Mr Powell during his first presidential term. What next? The prospect of an interest rate cut was one of the factors boosting US and European stock markets in the days running up to the vote, with major stock indexes reaching record highs. Further increases are likely to be seen due to the decision."
    },
    {
        "title": "'Close eye' will be kept on OpenAI's for-profit conversion, says California's attorney general",
        "description": "OpenAI has completed its transition to a for-profit company, after court battles and public criticism from one of its founders, Elon Musk.",
        "url": "https://news.sky.com/story/close-eye-will-be-kept-on-openais-for-profit-conversion-says-californias-attorney-general-13459872",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-openai-sam-altman_7065655.jpg?20251029095855",
        "type": "US",
        "Author": "Mickey Carroll",
        "Date Published": "2025-10-29 09:15:00",
        "Headline": "The company also announced that Microsoft - a long-time backer of OpenAI - will now hold a roughly 27% stake in its new for-profit corporation, a slightly bigger share than OpenAI's own nonprofit.",
        "Content": "\n          Science and technology reporter\n       OpenAI has completed its transition to a for-profit company, after court battles and public criticism from one of its founders, Elon Musk. The company's for-profit arm will become a public benefit corporation - a company type that must consider both the mission and shareholder interests. But the non-profit arm will retain control over it to make sure OpenAI sticks to its mission of developing artificial intelligence to the \"benefit of all humanity\". The restructuring will make it easier for OpenAI to profit from its AI, which the company says will help it to realise its goal of developing artificial general intelligence (AGI). AGI would mean AI can perform any intellectual task that a human can. It is often seen as the holy grail for AI companies.  In a call on Tuesday, OpenAI's chief executive Sam Altman said \"the most likely path\" for the newly formed business is that it becomes publicly traded on the stock market, \"given the capital needs that we'll have and sort of the size of the company\". The company also announced that Microsoft, a long-time backer of OpenAI, will now hold a roughly 27% stake in its new for-profit corporation, a slightly bigger share than OpenAI's own nonprofit. \"We will be keeping a close eye on OpenAI to ensure ongoing adherence to its charitable mission and the protection of the safety of all Californians,\" said California Attorney General Rob Bonta. Read more technology news:Over 1.2 million people a week talk to ChatGPT about suicideUncertainty for UK workers as Amazon to cut 14,000 jobs globallyNHS to offer same-day AI prostate cancer diagnosis  OpenAI said it completed its restructuring \"after nearly a year of engaging in constructive dialogue\" with the offices in both states. \"OpenAI has completed its recapitalization, simplifying its corporate structure,\" said a blog post Tuesday from Bret Taylor, the chair of OpenAI's board of directors. \"The nonprofit remains in control of the for-profit, and now has a direct path to major resources before AGI arrives.\" Read more:Musk v Altman: The battle to become king of AI  When OpenAI initially suggested restructuring, Mr Musk asked a judge to block this from happening. He launched a legal case against the company in 2024, accusing it of a breach of contract. Mr Musk accused the ChatGPT developer of transforming into \"a closed-source de facto subsidiary of the largest technology company, Microsoft\", according to a court filing. \"It is not just developing but is actually refining an AGI [artificial general intelligence] to maximise profits for Microsoft, rather than for the benefit of humanity,\" the court filing said. A legal battle ensued and earlier this year, Mr Musk offered to buy OpenAI for $97.4bn (£78.7bn) - an offer that was quickly rejected by Mr Altman, who told Sky News: \"The company is not for sale.\" After announcing the changes on Tuesday, Mr Altman said: \"California is my home, and I love it here, and when I talked to Attorney General Bonta two weeks ago I made clear that we were not going to do what those other companies do and threaten to leave if sued. \"We really wanted to figure this out and are really happy about where it all landed - and very much appreciate the work of the Attorney General.\""
    },
    {
        "title": "Former policeman found guilty of murder over shooting of Sonya Massey",
        "description": "A former policeman has been found guilty of second-degree murder following the fatal shooting of a woman in the US.",
        "url": "https://news.sky.com/story/former-policeman-found-guilty-of-murder-over-shooting-of-woman-in-us-13460106",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sean-grayson-sonya-massey_7066212.jpg?20251029212144",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-29 16:29:00",
        "Headline": "Sean Grayson shot Sonya Massey after she called police about a suspected intruder outside her home.",
        "Content": " A former policeman has been found guilty of second-degree murder following the fatal shooting of a woman in the US. Sonya Massey, 36, died after she had called the Sangamon County Sheriff's Office about a suspected intruder outside her home in Springfield, Illinois, on 6 July 2024. Sean Grayson, who was a sheriff's deputy, shot Ms Massey after confronting her about how she was handling a pot of hot water from a stove. Grayson and his lawyers argued he feared Ms Massey would scald him with the water. The 31-year-old, who was dismissed from his job after firing three shots in the incident, was found guilty by a jury in Peoria, Illinois, and could be sentenced to four to 20 years in prison. Jurors did not, however, convict Grayson for the first-degree murder charge that prosecutors were seeking, which carries a 45-year term. Instead, he was convicted of second-degree murder and his sentence could be halved based upon behaviour behind bars. Sentencing is scheduled for 29 January next year. Ms Massey's killing sparked anger in the US and drew the attention of former president Joe Biden. Mr Biden said last year: \"When we call for help, all of us as Americans - regardless of who we are or where we live - should be able to do so without fearing for our lives. \"Sonya's death at the hands of a responding officer reminds us that all too often Black Americans face fears for their safety in ways many of the rest of us do not.\" Former vice president, Kamala Harris, also said at the time: \"Sonya Massey deserved to be safe. \"After she called the police for help, she was tragically killed in her own home at the hands of a responding officer sworn to protect and serve.\" Read more from Sky News:Wrongly-released migrant sex offender claims police 'ignored' himAfghan national charged after triple stabbing in west London The Massey family's lawyers, Ben Crump and Antonio Romanucci, said after the seven-day trial: \"While we believe Grayson's actions deserved a first-degree conviction, today's verdict is still a measure of justice for Sonya Massey.\" Body camera video, recorded by another sheriff's deputy at the scene Dawson Farley, showed Ms Massey, who struggled with mental health issues, telling officers \"don't hurt me\" and repeating \"please God\". Grayson saw the pot on the stove and ordered Ms Massey to move it. After initially joking with Grayson about how he said he was backing off from the \"hot, steaming water\", Ms Massey then replied \"I rebuke you in the name of Jesus\". The two deputies then drew their pistols and yelled at her to put the pot down. Grayson told investigators he thought her \"rebuke\" meant she intended to kill him. He then fired three shots, striking Ms Massey below the eye."
    },
    {
        "title": "Microsoft, Alphabet and Meta results overshadowed by growing fears of AI bubble",
        "description": "Some of the world's biggest tech giants reported quarterly earnings on Wednesday - with a mixed bag of results as fears grow that a bubble is forming in artificial intelligence.",
        "url": "https://news.sky.com/story/microsoft-alphabet-and-meta-results-overshadowed-by-growing-fears-of-ai-bubble-13460474",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-mark-zuckerberg-meta_7066517.jpg?20251029232746",
        "type": "Business",
        "Author": "Connor Sephton",
        "Date Published": "2025-10-29 23:04:00",
        "Headline": "Three of the world's biggest companies are ramping up spending on artificial intelligence - but they're under pressure to show a return on investment.",
        "Content": "\n          News reporter\n              @ConnorSephton\n Some of the world's biggest tech giants reported quarterly earnings on Wednesday - with a mixed bag of results as fears grow that a bubble is forming in artificial intelligence. Microsoft revealed that its spending on AI infrastructure hit almost $35bn (£26.5bn) in the three months to the end of September, a sharp rise compared with the year before. Despite revenue jumping 18% and net income rising 12%, shares plunged by close to 4% in after-hours trading, with investors concerned about the mounting costs of sustaining the boom. Microsoft's vice president of investor relations Jonathan Neilson said: \"We continue to see demand which exceeds the capacity we have available. \"Our capital expenditure strategy remains unchanged in that we build against the demand signal we're seeing.\" Big Tech is facing increasing pressure to show returns on the massive AI investments they're making, against a backdrop of soaring valuations and limited evidence of productivity gains. Microsoft became the world's second most valuable company this week thanks to its 27% stake in OpenAI, the creator of ChatGPT. Its market capitalisation surged beyond $4trn (£3trn) at one point, but that psychologically significant threshold is now in doubt because of recent selloffs. Alphabet makes history Last night's results weren't all doom and gloom - with shares in Google's parent company surging by 6% in after-hours trading. Alphabet has also set out aggressive spending ambitions, but placated investors thanks to an impressive set of results that surpassed analysts' expectations. Total revenue for the quarter stood at a staggering $102.35bn (£77bn), with the search giant's advertising unit remaining robust despite growing competition. But concerns linger that Alphabet's dominance in search could be undermined by AI startups, with OpenAI recently unveiling a browser designed to rival Google Chrome. Hargreaves Lansdown's senior equity analyst Matt Britzman shrugged off this threat - and believes the company is \"gearing up for long-term AI leadership\". He said: \"Alphabet just delivered its first-ever $100bn quarter, silencing the doubters with standout performances in both Search and Cloud. \"AI Overviews and AI Mode are clearly resonating with users, helping to ease fears that Google's core search business is under threat from generative AI. \"With ChatGPT's recent browser demo falling short of a game-changer, Google looks well-placed to put up a strong defence as gatekeeper to the internet.\" Read more from Sky News:Federal Reserve cuts interest ratesMicrosoft Azure outage hits thousands  Meta faces a mauling Meta - the parent company of Facebook, Instagram, and WhatsApp - saw its shares tumble by as much as 10% in after-hours trading. Mark Zuckerberg's tech empire anticipates \"notably larger\" capital expenses next year as it ramps up investments in AI and goes on a hiring spree for top talent. Net income in the third quarter stood at $2.7bn (£2bn) and suffered an eye-watering $16bn (£12bn) hit because of Donald Trump's \"Big Beautiful Bill\". Meta was late to the party on AI but has now doubled down on this still-nascent technology - setting an ambition to achieve superintelligence, a milestone where machines could theoretically outthink humans. The social networking giant continues to benefit from its massive user base, and expects fourth-quarter revenues of up to $59bn (£44bn)."
    },
    {
        "title": "Victims of Post Office Capture scandal say they are being treated as 'second-class' citizens",
        "description": "Victims of the Post Office Capture scandal say they are being treated as second-class citizens - accusing the government of running a \"two-tier\" compensation system.",
        "url": "https://news.sky.com/story/victims-of-post-office-capture-scandal-say-they-are-being-treated-as-second-class-citizens-13460178",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-steve-marston-capture_7052865.png?20251017023238",
        "type": "Business",
        "Author": "Adele Robinson",
        "Date Published": "2025-10-29 18:23:00",
        "Headline": "Capture was used between 1992 and 1999 in up to 2,500 Post Office branches - with many sub postmasters making up cash losses themselves. A government commissioned report last year found it was likely the software caused accounting errors.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n Victims of the Post Office Capture scandal say they are being treated as second-class citizens - accusing the government of running a \"two-tier\" compensation system. It comes as the Department for Business and Trade announced the launch of the first-ever redress scheme for those wronged after faulty software created false accounting shortfalls in the 1990s. Capture was used between 1992 and 1999 in up to 2,500 Post Office branches, with many sub postmasters making up cash losses themselves. A government-commissioned report last year found it was likely the software caused accounting errors. The Capture Redress Scheme will provide payments of up to £300,000, and more in \"exceptional\" cases, to former postmasters who suffered financial losses. Steve Marston, who was convicted in 1998 of stealing from his branch and is not yet eligible to apply to the scheme, said other victims were feeling \"frustrated\" with it.  \"I want to know, what do they consider exceptional circumstances?\" he said, \"because I want it to see it in black and white what they consider as exceptional circumstances rather than just a vague statement.\" He said that victims felt like \"second-class\" citizens, describing the Horizon schemes and the new Capture scheme as \"two-tier\" systems. \"[It's] one law for the Horizon victims, and a totally different law for us Capture victims and that's not really fair. \"One of the main bones of contention is the fact that with Horizon there's a right of appeal against decisions, and you've got multiple rights to appeal. \"Whereas with the Capture appeal process, there's only a one-shot chance, so basically, it's a second-class system.\" The scheme will be tested for the first 150 claimants before a full roll-out. Chris Roberts, whose mother Liz was jailed in 1999 for theft, is one of them and said victims were concerned about the \"glacial pace\" of government.  He is able to apply to the redress scheme on behalf of his father, who was a postmaster alongside his mother, who oversaw accounts. Both Liz and Bill Roberts have passed away. \"I'd hate us to get to the point where, you know, this scheme's come out and we go through these 150 cases and then it's further developed … and half the people it would apply to are gone,\" Chris said. \"We will lose people before they can see justice, and I think that's a terrible tragedy.\" Under the Capture scheme, eligible claimants will receive an immediate interim payment of £10,000. An independent panel will then assess final awards through a banding model ranging from £10,000 to £300,000, with higher payments in exceptional circumstances. The Post Office Minister Blair McDougall, speaking exclusively to Sky News, said he understood why victims have \"low levels of trust in the state\". He said: \"They've been treated appallingly by the state, but what we've done with this scheme is to try to learn some of those lessons from previous compensation schemes for postmasters that didn't work. \"So we're collecting more evidence from the beginning to try to speed things up.  \"We're trying to give sub postmasters the benefit of the doubt throughout this. And I hope we will see that this scheme treats them with a bit more dignity and a bit more urgency.\" He also said that funds overall for the Capture scandal were \"uncapped\", with \"no ceiling\" on compensation. Mr McDougall also said that the government was working \"as fast as we possibly can, and that's because people have waited so long\". Read more:At least eight Capture convictions investigatedMajor milestone in Post Office scandal When asked if he would personally guarantee speedy redress, he replied: \"Absolutely - that's what we are doing today, to make sure that we have a scheme that gets people's redress as quickly as possible. \"But it's challenging, because we're dealing with cases where there's not a lot of evidence. So much time has passed. \"So we tried to design a scheme to get postmasters the benefit of the doubt and to try to be as fair as possible.\" He said within the scheme there was the \"opportunity\" for victims to make a \"wider case of the impact on their lives - and if the independent panel feels that there is a compelling case, they can go beyond that £300,000\"."
    },
    {
        "title": "US interest rates cut as concerns over Trump tariff inflation ease",
        "description": "The US central bank has cut interest rates for the second time this year in a move consistently sought by President Trump. ",
        "url": "https://news.sky.com/story/us-interest-rates-cut-as-concerns-over-trump-tariff-inflation-ease-13459996",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jay-powell-trump_6893843.jpg?20250422145901",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-10-29 12:23:00",
        "Headline": "The second reduction this year has come despite the US government shutdown preventing the release of key economics data. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The US central bank has cut interest rates for the second time this year in a move consistently sought by President Trump.  Rates were brought down by a quarter of a percentage point to 3.75%-4%. Unlike the UK, the US interest rate is a range to guide lenders rather than a single percentage. The Federal Reserve, known as the Fed, has opted for the cut despite the absence of economic announcements due to the government shutdown. Latest employment figures were not published, as all non-essential functions of government are frozen over the inability of Republican and Democratic legislators to agree on a spending package. The absence of these figures makes it trickier for the Fed to assess the state of the economy and meet its dual mandate to keep inflation steady and maintain maximum employment. Data on price rises, however, showed inflation hit 3% in September, one percentage point above the Fed's 2% target but lower than anticipated by economists. The fact that concerns over spiralling inflation, fuelled by Mr Trump's tariff-induced trade war, have not materialised, has facilitated the cut. \n                  Farage and Tice right to scrutinise one of Bank of England's most radical monetary experiments in history\n                 \n                  Bank of England leaves interest rate unchanged and slows quantitative tightening \n                 \n                  Cost of long term UK government borrowing hits fresh 27-year high\n                 Interest rates had been held amid warnings from Fed chair Jerome Powell that the US economy would grow less and goods would become more expensive due to hiked taxes on imports and the associated disruption in supply. Mr Powell and the Fed in general have, as a result, been the subject of Mr Trump's ire. The president sparked a crisis over the Fed's independence when he moved to remove rate-setter Lisa Cook from her post at the Federal Reserve on alleged mortgage fraud grounds, which she denied. Before the first interest rate drop of his term, in September, Mr Trump had threatened to remove Mr Powell, calling him a \"stupid person\" and saying he \"should be ashamed\". The animosity comes despite Mr Trump appointing Mr Powell during his first presidential term. What next? The prospect of an interest rate cut was one of the factors boosting US and European stock markets in the days running up to the vote, with major stock indexes reaching record highs. Further increases are likely to be seen due to the decision."
    },
    {
        "title": "Santander warns car finance redress scheme a threat to UK jobs, growth and economy",
        "description": "High street bank Santander has launched a scathing criticism of the car finance compensation scheme and delayed the release of its financial results \"in light of uncertainties\" it has caused.",
        "url": "https://news.sky.com/story/santander-warns-car-finance-redress-scheme-a-threat-to-uk-jobs-growth-and-economy-13459851",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-santander-bank_6954887.jpg?20250701215141",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-10-29 08:00:00",
        "Headline": "At stake is the ability for banks to lend, Santander's UK chief executive Mike Regnier said. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n High street bank Santander has launched a scathing criticism of the car finance compensation scheme and delayed the release of its financial results \"in light of uncertainties\" it has caused. The Spanish-owned lender called for government intervention - warning it sees the scheme as posing a wider threat to the economy, jobs and consumers. Money blog: Tesco increases price of carrier bag The scheme was set up by financial regulator, the Financial Conduct Authority (FCA), to compensate people mis-sold car loans. Under FCA proposals, up to 14.2 million people could each receive an average of £700, as lenders broke the law by failing to disclose they paid commission to brokers. It meant customers lost out on better deals and sometimes paid more. The proposal differs, Santander said, \"in important respects\" from the Supreme Court ruling that paved the way for the redress plan. Mr Regnier said: \"We believe that the level of concern in the industry and market is such that material changes to the proposed FCA redress scheme should be an active consideration for the UK government. \"Without such change, the unintended consequences for the car finance market, the supply of credit and the resulting negative impact on the automotive industry and its supply chain could significantly impact jobs, growth and the broader UK economy. \"This could also cause significant detriment to the consumer. \"What is at stake is the supply of credit that customers need and that supports a very important sector for the economy.\" Deferred results Santander was due to publish its latest financial figures on Wednesday morning, but has held back until it says it gets \"greater clarity\" on the scheme and its impact on the bank and the wider market. No new date to report results was given. Release of the same third-quarter results last year was also deferred due to uncertainty over the impact of car loan mis-selling. The hit to Santander, however, is not expected to impact its operations or financial position, even in a worst-case scenario for the bank where it has to allocate more funds for compensation, it said. It had already set aside £295m to deal with the mis-selling. The FCA said, \"We believe a compensation scheme is the best way to settle, for both lenders and consumers, liabilities that exist no matter what. \"Alternatives would cost more and take longer. It's vital we draw a line under the issue so a trusted motor finance market can continue to serve millions of families every year.\" Read more from Sky News:Compensation scheme launched for postmasters affected by Capture scandal'Close eye' will be kept on OpenAI's for-profit conversion  Santander said it was committed to \"ensuring fair outcomes\" for its customers and will continue engaging constructively with the FCA, HM Treasury and other stakeholders. Santander UK shares were up 0.5% following the news."
    },
    {
        "title": "'Huge vote of confidence' as data centre giant announces £4bn British investment",
        "description": "A &#163;4bn data centre investment in the UK by one of the industry's biggest companies has been confirmed today, Sky News can reveal.",
        "url": "https://news.sky.com/story/huge-vote-of-confidence-as-data-centre-giant-announces-1634bn-british-investment-13459984",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-equinix-data-centre_7065808.png?20251029124005",
        "type": "Business",
        "Author": "Tim Baker",
        "Date Published": "2025-10-29 12:10:00",
        "Headline": "Equinix says it will pump billions into the UK with a new data centre by South Mimms services. The government is betting big on data centres to help with its growth agenda.",
        "Content": "\n          Political reporter\n              @TimJ_B\n  A £4bn data centre investment in the UK by one of the industry's biggest companies has been confirmed today, Sky News can reveal. The money is being put up by Equinix - one of the most significant players on the global stage when it comes to providing data centre space for other clients. The 85-acre site in South Mimms, Hertfordshire, would have 250 megawatts of processing capacity and aim to be up and running by 2030. This doubles the company's processing power in Britain, and shows it is willing to invest in the UK despite concerns about energy costs and its environmental impact. Technology Secretary Liz Kendall told Sky News the announcement was a \"huge vote of confidence in Britain\". Megawhat? Megawatts are how the industry measures the power of a data centre. Until recently, a 20MW or 30MW facility was considered huge, but the AI boom has seen these numbers explode. To put today's announcement into context, a government estimate at the end of last year reckoned the UK had a data centre capacity of around 1,566MW. An increase of 250MW roughly doubles Equinix's footprint in the UK, and £4bn is its biggest commitment in Europe. Why are data centres important? They can support jobs, redevelop post-industrial areas, and boost economic growth. This has seen the government bend over backwards to make it easier for the divisive projects to be green lit, including \"grey belt\" designation for areas of green belt land earmarked for development. The grey belt, according to the government, includes land near existing settlements, roads, and other existing infrastructure, and disused car parks and petrol stations. Labour controlled Hertsmere council approved the project, with planning officers arguing the land was grey belt. It's located on oilseed rape fields wedged between the M25, A1(M), South Mimms service station and Potters Bar. This type of data centre needs to be as close as possible to the office workers using its servers - miles equals milliseconds and this can mean millions of pounds in the fast-paced financial world. Read more:'AI superpower' dream at risk, industry warnsGovt still hoping for £45bn in savings from AI As well as construction roles numbering in the hundreds, Equinix says the facility will help support thousands of jobs in London and the City. James Tyler, the firm's UK managing director, said: \"We are excited about the underlying demand in the UK. \"The government are also very excited about the fact we are investing in the UK. Equinix has choice about where we invest, and we're very excited about what the underlying environment looks like, the demand environment, the government support for this.\" Ms Kendall said it was a \"really important investment here from a major company, and they want to help build the infrastructure for the future\". She added that while a \"lot of people are worried about what AI will mean to them\", the government is keen to support people with apprenticeships and \"upskilling\" into the sector. Green credentials One of the key complaints for those wanting to build these hugely power-demanding sites is getting the necessary connection to the National Grid - with the waiting list stretching as far as a decade in some instances. However, this site already has a connection lined up due to the previous work - and Equinix wants to get spades in the ground before the end of 2026 or the start of 2027 for a 2030 launch. It is also committed to using 100% renewable energy by that point. The site will be air cooled and not place any extraneous demand on water past the usual - like on-site toilets. Andrew Higgins, global head of master planning and sustainability, told Sky News: \"We'll be retaining all the existing high-value woodlands and streams, and we'll be planting thousands more trees. \"We'll convert a lot of this monoculture arable land into wildflower meadows, we'll put in ponds, and over 50% of the plot will remain as green space - that will result in a biodiversity net gain exceeding 10%.\" Asked by Sky News how developers will be to their green commitments, Ms Kendall said: \"We want to make sure we both tackle climate change and seize the potential advantages of AI. \"We want to make sure they draw on renewable energy sources. But AI can itself help tackle some of those big challenges around climate change.\" The government announced today that climate science and AI safety will be among the sectors receiving some of a £55bn boost for research and development. It comes from a £86bn package for science and tech announced by the chancellor at the spending review in June."
    },
    {
        "title": "Budget 2025: Reeves vows to 'defy' gloomy forecasts - but faces income tax warning",
        "description": "Rachel Reeves has said she is determined to \"defy\" forecasts that suggest she will face a multibillion-pound black hole in next month's budget, but has indicated there are some tough choices on the way.",
        "url": "https://news.sky.com/story/budget-2025-reeves-vows-to-defy-gloomy-forecasts-but-faces-income-tax-warning-13459769",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rachel-reeves-chancellor_7065444.jpg?20251029010111",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-29 00:55:00",
        "Headline": "Some top economists have warned the chancellor that increasing income tax or reducing public spending is her only option for balancing the books.",
        "Content": " Rachel Reeves has said she is determined to \"defy\" forecasts that suggest she will face a multibillion-pound black hole in next month's budget, but has indicated there are some tough choices on the way. Writing in The Guardian, the chancellor argued the \"foundations of Britain's economy remain strong\" - and rejected claims the country is in a permanent state of decline. Reports have suggested the Office for Budget Responsibility is expected to downgrade its productivity growth forecast by about 0.3 percentage points. That means the Treasury will take in less tax than expected over the coming years - and this could leave a gap of up to £40bn in the country's finances. Ms Reeves wrote she would not \"pre-empt\" these forecasts, and her job \"is not to relitigate the past or let past mistakes determine our future\". \"I am determined that we don't simply accept the forecasts, but we defy them, as we already have this year. To do so means taking necessary choices today, including at the budget next month,\" the chancellor added. She also pointed to five interest rate cuts, three trade deals with major economies and wages outpacing inflation as evidence Labour has made progress since the election. Speculation is growing that Ms Reeves may break a key manifesto pledge by raising income tax or national insurance during the budget on 26 November. Read more from Sky News:What tax rises could Reeves announce?Start-ups warn chancellor over budget bombshell  Budget decisions 'don't come for free' Although her article didn't address this, she admitted \"our country and our economy continue to face challenges\". Her opinion piece said: \"The decisions I will take at the budget don't come for free, and they are not easy - but they are the right, fair and necessary choices.\" Yesterday, Sky's deputy political editor Sam Coates reported that Ms Reeves is unlikely to raise the basic rates of income tax or national insurance, to avoid breaking a promise to protect \"working people\" in the budget.  Sky News has also obtained an internal definition of \"working people\" used by the Treasury, which relates to Britons who earn less than £45,000 a year. This, in theory, means those on higher salaries could be the ones to face a squeeze in the budget - with the Treasury stating that it does not comment on tax measures. In other developments, some top economists have warned Ms Reeves that increasing income tax or reducing public spending is her only option for balancing the books. Experts from the Institute for Fiscal Studies have cautioned the chancellor against opting to hike alternative taxes instead, telling The Independent this would \"cause unnecessary amounts of economic damage\". Although such an approach would help the chancellor avoid breaking Labour's manifesto pledge, it is feared a series of smaller changes would make the tax system \"ever more complicated and less efficient\"."
    },
    {
        "title": "Why there is a budget black hole - and how the chancellor might fill it",
        "description": "Here are my rolling assumptions for the shape of the budget on 26 November, which I will update as the date draws closer.",
        "url": "https://news.sky.com/story/why-there-is-a-budget-black-hole-and-how-the-chancellor-might-fill-it-13459862",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-coates-analysis-reeves_7065623.jpg?20251029091724",
        "type": "Business",
        "Author": "Sam Coates",
        "Date Published": "2025-10-29 08:26:00",
        "Headline": "Rachel Reeves will deliver her budget in less than a month's time.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Here are my rolling assumptions for the shape of the budget on 26 November, which I will update as the date draws closer. It sets out why there is a black hole - and what might fill it, with greater confidence about the former. Note the Treasury has not yet received the final forecasts. Some of the suggestions and assumptions have been drawn up with the help of the Resolution Foundation, but the judgements are mine. The size of the black hole £10bn - Forecast downgrade, comprising of lower future productivity offset by upgrade to wage growth £2bn-£4bn - Debt interest costs, depending on the window picked by the Office for Budget Responsibility £10bn - Existing policy turns: winter fuel allowance, welfare/PIP U-turn, fuel duty freeze rollover £5bn - More spending on lifting two-child benefit cap, help for energy bills and also for NHS England redundancy payments £5-£10bn - Extra headroom Total: £32-£39bn 👉Listen to Politics at Sam and Anne's on your podcast app👈 How could Rachel Reeves fill it? £5bn - Reducing unallocated departmental spending in 2029/30 £8bn - Freezing personal allowance £4bn - Close capital gains tax loopholes on people moving abroad and after death £2bn - Higher rate council tax band £2bn - Get Limited Liability Partnerships to pay national insurance £1-£2bn - Higher gambling taxes £1bn - Raise higher rate income tax Total: £23bn How to fill the rest? One big measure or lots of little measures. The Resolution Foundation has explored putting up income tax and simultaneously reducing national insurance. This means for most employees their tax bill doesn't change. But the self employed are paying more and pensioners pay more, along with landlords who pay more because income tax is paid on rental income not national insurance. This raises £6bn."
    },
    {
        "title": "Starmer fails to rule out manifesto-breaking budget tax rises",
        "description": "Prime Minister Sir Keir Starmer has refused to say he stands by Labour's manifesto pledge not to increase income tax, national insurance or VAT.",
        "url": "https://news.sky.com/story/starmer-fails-to-rule-out-manifesto-breaking-budget-tax-rises-13459997",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer-kemi-badenoch_7065814.jpg?20251029124847",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-29 12:25:00",
        "Headline": "Sir Keir Starmer dodged a question at Prime Minister's Questions on whether income tax, national insurance or VAT could go up - despite giving a direct answer a few months ago.",
        "Content": " Prime Minister Sir Keir Starmer has refused to say he stands by Labour's manifesto pledge not to increase income tax, national insurance or VAT. Asked by Tory leader Kemi Badenoch during Prime Minister's Questions if that commitment will be honoured in next month's budget, he said plans for the economy will be laid out then - on 26 November. \"But I can tell the House now that we will build a stronger economy. We will cut NHS waiting lists and deliver a better future for our country,\" he said. Politics live: Deported migrant sex offender given £500 to leave country Ms Badenoch said it was a \"fascinating answer\" as he gave a different one when asked the same question at PMQs on 9 July. Then, she asked: \"In its manifesto last year, Labour promised not to increase income tax, not to increase national insurance and not to increase VAT. Does the prime minister still stand by his promises?\" At the time, Sir Keir responded with a one-word answer: \"Yes.\" Asked on Wednesday what had changed in the past four months, Sir Keir repeated that no prime minister or chancellor \"will ever set out their plans\" ahead of a budget.  He went on to attack the Tories' record on the economy during their 14 years in government. Referring to reports the UK's official forecaster, the Office for Budget Responsibility (OBR), is set to downgrade the UK's productivity performance, Sir Keir said: \"This is a judgement on their record in office. Those figures are now coming through and they confirm that the Tories did even more damage to the economy than we previously thought. \"We will turn that around. We've already delivered the fastest growth in the G7 in the first half of this year. Five interest rate cuts in a row. Trade deals with the US, EU and India. They broke the economy. We're fixing it.\" He also said there would be \"no return to austerity... no return to the instability of their mad borrowing spree, and we'll end the unfairness and low growth that squeezed living standards for working people\". Chancellor Rachel Reeves needs to fill a black hole that could be as high as £40bn when she sets out her budget.  👉Listen to Politics at Sam and Anne's on your podcast app👈  After the prime minister failed to say at PMQs that he stands by his manifesto promise not to raise income tax, national insurance, or VAT, his spokesman was challenged about it by reporters. Sir Keir Starmer's spokesman said: \"You have the prime minister's words in the House.\" He reiterated the government is committed to building 1.5 million new homes, getting young people into work, and reforming the planning system. \"The chancellor has been clear that we need to ensure we have the money to fund our public services and bring growth to businesses,\" he said. \"As we set out in the plan for change, we are committed to growing the economy.\" "
    },
    {
        "title": "First ever compensation scheme launched for postmasters affected by Capture IT scandal",
        "description": "The first ever redress scheme for victims of the Post Office Capture IT scandal has been launched.",
        "url": "https://news.sky.com/story/first-ever-compensation-scheme-launched-for-postmasters-affected-by-capture-it-scandal-13459870",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-post-office-scandal_6960071.jpg?20250708124943",
        "type": "Business",
        "Author": "Adele Robinson",
        "Date Published": "2025-10-29 08:54:00",
        "Headline": "The Capture Redress Scheme will provide payments of up to £300,000, and more in \"exceptional\" cases, to former postmasters who suffered financial losses.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n  The first ever redress scheme for victims of the Post Office Capture IT scandal has been launched. It marks the government officially acknowledging the damage caused to former sub postmasters who used faulty accounting software in the 1990s. Capture was used in branches between 1992 and 2000, before the infamous Horizon scandal, which saw hundreds wrongfully convicted. The Capture Redress Scheme will provide payments of up to £300,000, and more in \"exceptional\" cases, to former postmasters who suffered financial losses. The scheme, announced by the Department for Business and Trade in June, aims to deliver long-awaited justice for those affected.  How will the payouts work? It follows an independent investigation in September 2024 by forensic accountants Kroll Associates, which found there was a \"reasonable likelihood\" that the Capture system created accounting shortfalls. Similar to the Horizon scandal, postmasters made up shortfalls out of their own pocket - some losing their jobs. Under the Capture scheme, eligible claimants will receive an immediate interim payment of £10,000. An independent panel will then assess final awards through a banding model ranging from £10,000 to £300,000, with higher payments in exceptional circumstances. The redress scheme will initially be tested with 150 claimants before a full rollout to ensure the process is \"fair and accessible\", according to the government. All awards will be tax-exempt and disregarded for means-tested benefits. 'Livelihoods destroyed' Post Office Minister Blair McDougall said the launch marks a significant milestone for victims who have waited decades for redress. \"After over two decades of fighting for justice, postmasters and their families will finally receive recognition and recompense for the lives and livelihoods that Capture destroyed,\" he said. \"I'd like to thank all of those victims who have helped us to design this scheme, allowing us to deliver on our promise of providing redress today. \"We can't make up for everything they have lost, but today we begin restoring some of the dignity so cruelly taken away by this scandal.\"  Read more from Sky News:Compensation 'worse than original injustice', victims' commissioner saysCapture IT system conviction referred to Court of Appeal for first time The scheme is not open to postmasters with a criminal conviction related to Capture - those cases are currently going through the Criminal Cases Review Commission (CCRC). If convictions are later found to be unsafe, ministers said appropriate redress will be provided. Applications to the Capture Redress Scheme can be made via GOV.UK."
    },
    {
        "title": "Investigation into Reeves not needed, says Starmer - after she apologises for rental 'mistake'",
        "description": "Sir Keir Starmer has dismissed calls for an investigation into his chancellor after she apologised for putting her family home up for rent without obtaining the necessary licence. ",
        "url": "https://news.sky.com/story/tories-call-for-investigation-as-reeves-admits-rental-mistake-13460270",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keynote-rachel-reeves_7036066.jpg?20251030000551",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-29 21:40:00",
        "Headline": "The Daily Mail reported that the chancellor rented her family home in Dulwich when she moved into Number 11 Downing Street, but was unaware she had to obtain a licence to do so. The Tories have called for an investigation.",
        "Content": "Sir Keir Starmer has dismissed calls for an investigation into his chancellor after she apologised for putting her family home up for rent without obtaining the necessary licence.  Rachel Reeves wrote to the prime minister to \"sincerely\" apologise for the \"inadvertent error\", which was first reported by the Daily Mail. Politics Hub: Latest updates from Westminster The newspaper said the chancellor rented her family home in Dulwich when she moved into 11 Downing Street, but was unaware she had to obtain a \"selective licence\" to do so.  Some London boroughs require private landlords to obtain a specific kind of licence if they are putting their property up for rent - including Southwark Council, where Ms Reeves' home is listed. The newspaper said she had now applied for a licence, but the Conservatives have called for an investigation. A spokesperson for Ms Reeves said: \"Since becoming chancellor, Rachel Reeves has rented out her family home through a lettings agency. \"She had not been made aware of the licensing requirement, but as soon as it was brought to her attention, she took immediate action and has applied for the licence. \"This was an inadvertent mistake and in the spirit of transparency, she has made the prime minister, the independent adviser on ministerial standards and the parliamentary commissioner for standards aware.\" Southwark Council introduced \"selective licences\" across certain areas two years ago. The scheme is designed to \"improve safety, security and quality for people living in private rented homes\". It aims to ensure renters who face persistent problems with damp, mould and outstanding repairs can get their issues resolved. These licences apply to most private residential properties, last for five years, and cost £900. Landlords need to provide documents including safety certificates for gas, electricity and fire alarms - along with floor plans and tenancy agreements. Renting out a property without a licence can lead to civil penalties of up to £30,000 - as well as prosecution in some cases. It is understood that Sir Laurie Magnus, the prime minister's ethics adviser, has not launched an investigation into Ms Reeves. Sir Keir said further investigation into the issue was \"not necessary\" after consulting Sir Laurie. In a letter to Ms Reeves, he suggested her apology was a \"sufficient resolution\". Daisy Cooper, deputy leader of the Liberal Democrats, said the chancellor was adding to the government's \"list of scandals\". \"Just weeks before the budget, this risks seriously undermining confidence in this government and its ability to focus on the urgent tasks at hand,\" she added.  The development comes weeks before Ms Reeves delivers her budget on 26 November. She is rumoured to be considering a series of tax hikes, including a new tax on the sale of homes worth more than £500,000 to replace stamp duty. Under the proposal, sellers, instead of buyers, would be responsible for paying the tax. Read more:What tax rises could Reeves announce?Why is there a budget black hole? The chancellor is understood to be looking at an annual 1% charge on the amount a property's value exceeds £2m - and a £10,000-a-year levy for homes worth £3m. Another proposal would see capital gains tax (CGT) charged when someone sells their main home, based on the amount it has increased in value during ownership. Reports suggest this would only be applied to the most expensive properties, with a possible threshold of £1.5m, which would affect about 120,000 homeowners."
    },
    {
        "title": "Tories and Reform: From feud to love-in?",
        "description": "Is this the shape of things to come?",
        "url": "https://news.sky.com/story/tories-and-reform-from-feud-to-love-in-13460154",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-kemi-badenoch-nigel-farage_6785671.jpg?20251029190051",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-10-29 17:46:00",
        "Headline": "Kemi Badenoch supported Nigel Farage's bid to bring forward legislation for the UK to leave the European Convention on Human Rights - but the move was blocked by MPs.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Is this the shape of things to come? Are Kemi Badenoch's Conservatives and Nigel Farage's Reform UK about to bury the hatchet and work together? Tory and Reform MPs joined forces to back a Commons move by Mr Farage to withdraw from the European Convention on Human Rights. It was the biggest and most high-profile display of co-operation between these hitherto sworn enemies seen in parliament so far. Could it be a pointer to some sort of arrangement or pact in opposition to Labour, the Liberal Democrats and other left-leaning parties after the next election? The issue that brought about the new apparent love-in between the feuding parties on the right of UK politics was a 10-minute rule bill moved by Mr Farage. Surrounded by opponents from the Lib Dems and SNP, Mr Farage was shouted down throughout his speech, before the Lib Dem leader Sir Ed Davey launched an angry onslaught opposing his bill. \n                  Burka ban 'not our policy',  says senior Tory Mel Stride, after calls by Robert Jenrick\n                 \n                  Is it too late for Kemi Badenoch?\n                 \n                  Badenoch pulls off first conference speech as leader, but it is less clear if this will be her last\n                 Of course, withdrawing from the ECHR is an issue on which the Conservatives and Reform UK agree. But quite often the big parties ignore Commons motions moved by small parties. Not this time. Voting was 96 MPs in favour and 154 against Mr Farage's ECHR Withdrawal Bill, with 63 Labour MPs, 64 Liberal Democrats and Jeremy Corbyn's band of 10 independents voting against. Kemi Badenoch led 87 Conservative MPs into the Aye lobby alongside Mr Farage, his Reform UK colleagues Richard Tice, Lee Anderson and Danny Kruger, who was a teller, and a few Northern Ireland MPs. Read more from Sky News:Military barracks to be used to house asylum seekersLammy blames 'human error' for release of migrant sex offender The Conservative MPs backing Mr Farage's motion included most of the shadow cabinet. The Tory grandee Sir John Whittingdale was the Reform UK leader's other teller. After the vote, Mr Farage thanked former cabinet ministers Suella Braverman and Sir Gavin Williamson and - most significantly - shadow justice secretary Robert Jenrick for co-signing his bill. While Mrs Badenoch has publicly ruled out a pact with Reform UK, Mr Jenrick told Sky News during the Tory conference earlier this month it was \"not a priority\". The breakdown of the voting numbers tells us that without the 63 Labour MPs voting against, Mr Farage would have won the vote, although victory on a ten-minute rule bill is purely symbolic. And indeed, until a last-minute plea by pro-Europe Labour MPs led by Stella Creasy, the Labour leadership's plan had been to ignore the vote and abstain. But the party's high command is understood to have been warned that, purely symbolic or not, allowing Farage's bill to be passed would send a terrible signal to the UK's European neighbours. And so the new government chief whip Jonathan Reynolds relented and ruled that while ministers should abstain and not take part, backbenchers could vote against Mr Farage if they wished. Ed Davey later claimed the credit for defeating Mr Farage, however. \"We just defeated Nigel Farage's bill in parliament to tear up people's rights and withdraw from the ECHR,\" he said. \"Farage wants to do away with the Britain Churchill built and turn it into a version of Trump's America. We stopped him.\" But could this vote signal that some form of coalition politics may be on the way back in the Commons, with Labour and the Liberal Democrats v the Conservatives and Reform UK?"
    },
    {
        "title": "Vietnamese migrants to be returned under new deal with UK",
        "description": "Vietnamese migrants with no right to be in the UK will be returned to their home country under a new agreement.",
        "url": "https://news.sky.com/story/vietnamese-migrants-to-be-returned-under-new-deal-with-uk-13460147",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-migrants-boat-france_7058132.jpg?20251022100433",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-29 17:27:00",
        "Headline": "Biometric data sharing and streamlined documentation will be used to fast-track Vietnamese migrants out of the UK if they came illegally.",
        "Content": "Vietnamese migrants with no right to be in the UK will be returned to their home country under a new agreement. The pilot scheme, announced on Wednesday, will use biometric data sharing and streamlined documentation to fast-track Vietnamese migrants out of the UK if they came illegally. Politics latest: PM refuses to rule out manifesto-breaking tax rises More Vietnamese people attempted to cross the Channel in small boats in the first quarter of 2024 than any other nationality, according to Home Office figures. Statistics from April 2024 showed Vietnamese nationals made up 20% of all small boat arrivals - a 10-fold increase compared with the same period the previous year. Overall in 2024, approximately 3,798 Vietnamese nationals were detected entering the UK illegally - making up 9% of the 43,630 total detected illegal entries for that year. Immigration minister Mike Tapp told Sky News the government had already deported 35,000 people in its first year in office, including an increase of 14% on foreign national offenders. \n                  Huge rise in raids on salons and takeaways revealed in illegal working crackdown\n                 \n                  Military barracks to be used to house asylum seekers\n                 \n                  David Lammy to face Commons grilling over wrongly released migrant sex offender\n                 Asked how many people from Vietnam were in the UK, Mr Tapp said: \"There are a significant number. \"I can't give you the exact figure that comes over from Vietnam, but it goes up and down. \"So sometimes you'll see that, spiking. And then it depends where the gangs are at with their operations.\" Prime minister hails 'landmark agreement' Sir Keir Starmer welcomed the scheme on X, saying: \"I've just secured a landmark agreement with Vietnam to ramp up the returns process of illegal migrants. \"I mean it when I say: if you come here illegally, you will be swiftly returned.\" It comes as the government continues to struggle with the number of small boat Channel crossings. Figures released last week showed more migrants have crossed the English Channel in small boats so far this year than in the whole of 2024. Read more:Deported migrant sex offender given £500 to leave countryA colossal reputational repair job is needed after Kebatu debacle Home Office sources confirmed that more than 36,816 people - the total for 2024 - have now crossed the Channel so far in 2025. Earlier this year, the UK struck a \"one in, one out\" treaty which means the UK can send people back to France if they have entered the country illegally. In exchange, the UK will allow asylum seekers to enter through a safe and legal route - as long as they have not previously tried to enter illegally. Government setback However, the scheme suffered an early setback after a migrant who was deported back to France under the flagship scheme returned to the UK on a small boat. The Iranian national was initially detained when he entered the UK on a small boat on 6 August. He was removed under the government's deal with France on 19 September, and he returned on 18 October. On Wednesday morning, border security minister Alex Norris said the man was still in the country. He told Sky News: \"He's come through, he was detected immediately at the front door, he was detained, and he will be removed from this country.\" Asked when the man would be removed, the minister said: \"I wouldn't want to give a specific timeline, but we are removing him as soon as possible.\""
    },
    {
        "title": "MPs demand Crown Estate explains why Prince Andrew paid 'peppercorn' rent at Royal Lodge",
        "description": "Parliament's spending watchdog has asked the Crown Estate to explain the rationale behind Prince Andrew's \"peppercorn\" rent at Royal Lodge.",
        "url": "https://news.sky.com/story/mps-demand-crown-estate-explains-why-prince-andrew-paid-peppercorn-rent-at-royal-lodge-13460047",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-royal-lodge-prince-andrew_7057640.jpg?20251021193944",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-29 15:00:00",
        "Headline": "The prince has lived at Royal Lodge for more than 20 years on a \"peppercorn\" rent.",
        "Content": "Parliament's spending watchdog has asked the Crown Estate to explain the rationale behind Prince Andrew's \"peppercorn\" rent at Royal Lodge. The Public Accounts Committee (PAC) has written to the Treasury and the Crown Estate after raising concerns over the value for money of the prince's living arrangements. The King's team is said to be in talks with his brother about leaving the property voluntarily following renewed controversy over his links to the late paedophile financier Jeffrey Epstein. Andrew signed a 75-year lease in 2003 after paying an initial down payment of £1m and spent £7.5m on renovations as part of the agreement. He lives there with his ex-wife, Sarah Ferguson. \"Peppercorn rent\" is a legal term used in leases to show that rent technically exists, so the lease is valid, but it's nominal, often literally £1 a year or just a symbolic amount. In practice, it means the tenant pays no rent. In a letter published on Wednesday, PAC chairman and Tory MP Sir Geoffrey Clifton-Brown, said: \"There is considerable and understandable public interest in the spending of public money in relation to Prince Andrew, which in part stems from the fact that he is no longer a working Royal and from serious and disturbing allegations made against him.\" He asked \"that you write to us providing an update on the status of, and rationale for, the lease\". Prince Andrew gave up his titles ahead of the publication of the posthumous memoirs of Virginia Giuffre, who accused the prince of sexually abusing her as a 17-year-old. He has strenuously denied the allegations.  Criticism has now turned to the 30-room mansion in Windsor he has lived in effectively rent-free since 2003. Sir Geoffrey said the Crown Estate has a duty to manage its land \"according to the best consideration of money or money's worth which in their opinion can be reasonably obtained\". Read more: Where could Prince Andrew move to if he leaves Royal Lodge?No simple solution to problem of Prince Andrew and Royal Lodge He went on: \"We are therefore concerned as to whether the lease arrangements for Royal Lodge are, in light of recent developments and changes in the responsibilities of Prince Andrew, achieving the best value for money. \"They must also be justifiable in comparison to other options for the use or disposal of the property. \"It is also a matter of concern to the committee that the terms of the lease, including those relating to maintenance, are being effectively enforced to maintain the value and character of this nationally important royal residence.\" He has requested a response on or before 28 November, and said the committee will then decide if a public evidence session should be held."
    },
    {
        "title": "'Huge vote of confidence' as data centre giant announces £4bn British investment",
        "description": "A &#163;4bn data centre investment in the UK by one of the industry's biggest companies has been confirmed today, Sky News can reveal.",
        "url": "https://news.sky.com/story/huge-vote-of-confidence-as-data-centre-giant-announces-1634bn-british-investment-13459984",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-equinix-data-centre_7065808.png?20251029124005",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-10-29 12:10:00",
        "Headline": "Equinix says it will pump billions into the UK with a new data centre by South Mimms services. The government is betting big on data centres to help with its growth agenda.",
        "Content": "\n          Political reporter\n              @TimJ_B\n  A £4bn data centre investment in the UK by one of the industry's biggest companies has been confirmed today, Sky News can reveal. The money is being put up by Equinix - one of the most significant players on the global stage when it comes to providing data centre space for other clients. The 85-acre site in South Mimms, Hertfordshire, would have 250 megawatts of processing capacity and aim to be up and running by 2030. This doubles the company's processing power in Britain, and shows it is willing to invest in the UK despite concerns about energy costs and its environmental impact. Technology Secretary Liz Kendall told Sky News the announcement was a \"huge vote of confidence in Britain\". Megawhat? Megawatts are how the industry measures the power of a data centre. Until recently, a 20MW or 30MW facility was considered huge, but the AI boom has seen these numbers explode. To put today's announcement into context, a government estimate at the end of last year reckoned the UK had a data centre capacity of around 1,566MW. An increase of 250MW roughly doubles Equinix's footprint in the UK, and £4bn is its biggest commitment in Europe. Why are data centres important? They can support jobs, redevelop post-industrial areas, and boost economic growth. This has seen the government bend over backwards to make it easier for the divisive projects to be green lit, including \"grey belt\" designation for areas of green belt land earmarked for development. The grey belt, according to the government, includes land near existing settlements, roads, and other existing infrastructure, and disused car parks and petrol stations. Labour controlled Hertsmere council approved the project, with planning officers arguing the land was grey belt. It's located on oilseed rape fields wedged between the M25, A1(M), South Mimms service station and Potters Bar. This type of data centre needs to be as close as possible to the office workers using its servers - miles equals milliseconds and this can mean millions of pounds in the fast-paced financial world. Read more:'AI superpower' dream at risk, industry warnsGovt still hoping for £45bn in savings from AI As well as construction roles numbering in the hundreds, Equinix says the facility will help support thousands of jobs in London and the City. James Tyler, the firm's UK managing director, said: \"We are excited about the underlying demand in the UK. \"The government are also very excited about the fact we are investing in the UK. Equinix has choice about where we invest, and we're very excited about what the underlying environment looks like, the demand environment, the government support for this.\" Ms Kendall said it was a \"really important investment here from a major company, and they want to help build the infrastructure for the future\". She added that while a \"lot of people are worried about what AI will mean to them\", the government is keen to support people with apprenticeships and \"upskilling\" into the sector. Green credentials One of the key complaints for those wanting to build these hugely power-demanding sites is getting the necessary connection to the National Grid - with the waiting list stretching as far as a decade in some instances. However, this site already has a connection lined up due to the previous work - and Equinix wants to get spades in the ground before the end of 2026 or the start of 2027 for a 2030 launch. It is also committed to using 100% renewable energy by that point. The site will be air cooled and not place any extraneous demand on water past the usual - like on-site toilets. Andrew Higgins, global head of master planning and sustainability, told Sky News: \"We'll be retaining all the existing high-value woodlands and streams, and we'll be planting thousands more trees. \"We'll convert a lot of this monoculture arable land into wildflower meadows, we'll put in ponds, and over 50% of the plot will remain as green space - that will result in a biodiversity net gain exceeding 10%.\" Asked by Sky News how developers will be to their green commitments, Ms Kendall said: \"We want to make sure we both tackle climate change and seize the potential advantages of AI. \"We want to make sure they draw on renewable energy sources. But AI can itself help tackle some of those big challenges around climate change.\" The government announced today that climate science and AI safety will be among the sectors receiving some of a £55bn boost for research and development. It comes from a £86bn package for science and tech announced by the chancellor at the spending review in June."
    },
    {
        "title": "Microsoft, Alphabet and Meta results overshadowed by growing fears of AI bubble",
        "description": "Some of the world's biggest tech giants reported quarterly earnings on Wednesday - with a mixed bag of results as fears grow that a bubble is forming in artificial intelligence.",
        "url": "https://news.sky.com/story/microsoft-alphabet-and-meta-results-overshadowed-by-growing-fears-of-ai-bubble-13460474",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-mark-zuckerberg-meta_7066517.jpg?20251029232746",
        "type": "Technology",
        "Author": "Connor Sephton",
        "Date Published": "2025-10-29 23:04:00",
        "Headline": "Three of the world's biggest companies are ramping up spending on artificial intelligence - but they're under pressure to show a return on investment.",
        "Content": "\n          News reporter\n              @ConnorSephton\n Some of the world's biggest tech giants reported quarterly earnings on Wednesday - with a mixed bag of results as fears grow that a bubble is forming in artificial intelligence. Microsoft revealed that its spending on AI infrastructure hit almost $35bn (£26.5bn) in the three months to the end of September, a sharp rise compared with the year before. Despite revenue jumping 18% and net income rising 12%, shares plunged by close to 4% in after-hours trading, with investors concerned about the mounting costs of sustaining the boom. Microsoft's vice president of investor relations Jonathan Neilson said: \"We continue to see demand which exceeds the capacity we have available. \"Our capital expenditure strategy remains unchanged in that we build against the demand signal we're seeing.\" Big Tech is facing increasing pressure to show returns on the massive AI investments they're making, against a backdrop of soaring valuations and limited evidence of productivity gains. Microsoft became the world's second most valuable company this week thanks to its 27% stake in OpenAI, the creator of ChatGPT. Its market capitalisation surged beyond $4trn (£3trn) at one point, but that psychologically significant threshold is now in doubt because of recent selloffs. Alphabet makes history Last night's results weren't all doom and gloom - with shares in Google's parent company surging by 6% in after-hours trading. Alphabet has also set out aggressive spending ambitions, but placated investors thanks to an impressive set of results that surpassed analysts' expectations. Total revenue for the quarter stood at a staggering $102.35bn (£77bn), with the search giant's advertising unit remaining robust despite growing competition. But concerns linger that Alphabet's dominance in search could be undermined by AI startups, with OpenAI recently unveiling a browser designed to rival Google Chrome. Hargreaves Lansdown's senior equity analyst Matt Britzman shrugged off this threat - and believes the company is \"gearing up for long-term AI leadership\". He said: \"Alphabet just delivered its first-ever $100bn quarter, silencing the doubters with standout performances in both Search and Cloud. \"AI Overviews and AI Mode are clearly resonating with users, helping to ease fears that Google's core search business is under threat from generative AI. \"With ChatGPT's recent browser demo falling short of a game-changer, Google looks well-placed to put up a strong defence as gatekeeper to the internet.\" Read more from Sky News:Federal Reserve cuts interest ratesMicrosoft Azure outage hits thousands  Meta faces a mauling Meta - the parent company of Facebook, Instagram, and WhatsApp - saw its shares tumble by as much as 10% in after-hours trading. Mark Zuckerberg's tech empire anticipates \"notably larger\" capital expenses next year as it ramps up investments in AI and goes on a hiring spree for top talent. Net income in the third quarter stood at $2.7bn (£2bn) and suffered an eye-watering $16bn (£12bn) hit because of Donald Trump's \"Big Beautiful Bill\". Meta was late to the party on AI but has now doubled down on this still-nascent technology - setting an ambition to achieve superintelligence, a milestone where machines could theoretically outthink humans. The social networking giant continues to benefit from its massive user base, and expects fourth-quarter revenues of up to $59bn (£44bn)."
    },
    {
        "title": "'Huge vote of confidence' as data centre giant announces £4bn British investment",
        "description": "A &#163;4bn data centre investment in the UK by one of the industry's biggest companies has been confirmed today, Sky News can reveal.",
        "url": "https://news.sky.com/story/huge-vote-of-confidence-as-data-centre-giant-announces-1634bn-british-investment-13459984",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-equinix-data-centre_7065808.png?20251029124005",
        "type": "Technology",
        "Author": "Tim Baker",
        "Date Published": "2025-10-29 12:10:00",
        "Headline": "Equinix says it will pump billions into the UK with a new data centre by South Mimms services. The government is betting big on data centres to help with its growth agenda.",
        "Content": "\n          Political reporter\n              @TimJ_B\n  A £4bn data centre investment in the UK by one of the industry's biggest companies has been confirmed today, Sky News can reveal. The money is being put up by Equinix - one of the most significant players on the global stage when it comes to providing data centre space for other clients. The 85-acre site in South Mimms, Hertfordshire, would have 250 megawatts of processing capacity and aim to be up and running by 2030. This doubles the company's processing power in Britain, and shows it is willing to invest in the UK despite concerns about energy costs and its environmental impact. Technology Secretary Liz Kendall told Sky News the announcement was a \"huge vote of confidence in Britain\". Megawhat? Megawatts are how the industry measures the power of a data centre. Until recently, a 20MW or 30MW facility was considered huge, but the AI boom has seen these numbers explode. To put today's announcement into context, a government estimate at the end of last year reckoned the UK had a data centre capacity of around 1,566MW. An increase of 250MW roughly doubles Equinix's footprint in the UK, and £4bn is its biggest commitment in Europe. Why are data centres important? They can support jobs, redevelop post-industrial areas, and boost economic growth. This has seen the government bend over backwards to make it easier for the divisive projects to be green lit, including \"grey belt\" designation for areas of green belt land earmarked for development. The grey belt, according to the government, includes land near existing settlements, roads, and other existing infrastructure, and disused car parks and petrol stations. Labour controlled Hertsmere council approved the project, with planning officers arguing the land was grey belt. It's located on oilseed rape fields wedged between the M25, A1(M), South Mimms service station and Potters Bar. This type of data centre needs to be as close as possible to the office workers using its servers - miles equals milliseconds and this can mean millions of pounds in the fast-paced financial world. Read more:'AI superpower' dream at risk, industry warnsGovt still hoping for £45bn in savings from AI As well as construction roles numbering in the hundreds, Equinix says the facility will help support thousands of jobs in London and the City. James Tyler, the firm's UK managing director, said: \"We are excited about the underlying demand in the UK. \"The government are also very excited about the fact we are investing in the UK. Equinix has choice about where we invest, and we're very excited about what the underlying environment looks like, the demand environment, the government support for this.\" Ms Kendall said it was a \"really important investment here from a major company, and they want to help build the infrastructure for the future\". She added that while a \"lot of people are worried about what AI will mean to them\", the government is keen to support people with apprenticeships and \"upskilling\" into the sector. Green credentials One of the key complaints for those wanting to build these hugely power-demanding sites is getting the necessary connection to the National Grid - with the waiting list stretching as far as a decade in some instances. However, this site already has a connection lined up due to the previous work - and Equinix wants to get spades in the ground before the end of 2026 or the start of 2027 for a 2030 launch. It is also committed to using 100% renewable energy by that point. The site will be air cooled and not place any extraneous demand on water past the usual - like on-site toilets. Andrew Higgins, global head of master planning and sustainability, told Sky News: \"We'll be retaining all the existing high-value woodlands and streams, and we'll be planting thousands more trees. \"We'll convert a lot of this monoculture arable land into wildflower meadows, we'll put in ponds, and over 50% of the plot will remain as green space - that will result in a biodiversity net gain exceeding 10%.\" Asked by Sky News how developers will be to their green commitments, Ms Kendall said: \"We want to make sure we both tackle climate change and seize the potential advantages of AI. \"We want to make sure they draw on renewable energy sources. But AI can itself help tackle some of those big challenges around climate change.\" The government announced today that climate science and AI safety will be among the sectors receiving some of a £55bn boost for research and development. It comes from a £86bn package for science and tech announced by the chancellor at the spending review in June."
    },
    {
        "title": "Microsoft outage knocks Office 365 and X-Box Live offline for thousands of users",
        "description": "Microsoft Azure was down for thousands of users on Wednesday due to issues with its domain name system.",
        "url": "https://news.sky.com/story/thousands-of-users-unable-affected-by-microsoft-azure-outage-13460125",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-microsoft-websites_7066051.jpg?20251029173441",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-10-29 16:57:00",
        "Headline": "Azure was down for more than 105,000 users, Downdetector, which tracks online outages, said on X.",
        "Content": "Microsoft Azure was down for thousands of users on Wednesday due to issues with its domain name system. Microsoft said it was \"investigating an issue with the Azure Portal where customers may be experiencing issues accessing the portal\". It later said a fix had rolled out to solve the issue. Azure was down for more than 105,000 users, Downdetector, which tracks online outages, said on X. It said Microsoft 365 was down for nearly 9,000 users. The tech company said it was reviewing reports of an issue impacting Azure and services, including an impact on the Microsoft 365 admin center. A Microsoft spokesperson told Sky News: \"We are working to address an issue affecting Azure Front Door that is impacting the availability of some services. Customers should continue to check their Service Health Alerts and the latest update on this issue can be found on the Azure status page.\" On Downdetector, a website that tracks online outages, users reported issues with Office 365, Minecraft, X-Box Live, Copilot, Costco, Starbucks, and many other services. Alaska Airlines posted on its X account that the outage is at the heart of problems affecting its systems, including check-in services. The issue came hours before Microsoft was set to release its quarterly earnings report. Amazon's AWS cloud service faced an outage last week, which caused global chaos on thousands of sites, including some of the web's most popular apps, such as Snapchat and Reddit. "
    },
    {
        "title": "'Close eye' will be kept on OpenAI's for-profit conversion, says California's attorney general",
        "description": "OpenAI has completed its transition to a for-profit company, after court battles and public criticism from one of its founders, Elon Musk.",
        "url": "https://news.sky.com/story/close-eye-will-be-kept-on-openais-for-profit-conversion-says-californias-attorney-general-13459872",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-openai-sam-altman_7065655.jpg?20251029095855",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-10-29 09:15:00",
        "Headline": "The company also announced that Microsoft - a long-time backer of OpenAI - will now hold a roughly 27% stake in its new for-profit corporation, a slightly bigger share than OpenAI's own nonprofit.",
        "Content": "\n          Science and technology reporter\n       OpenAI has completed its transition to a for-profit company, after court battles and public criticism from one of its founders, Elon Musk. The company's for-profit arm will become a public benefit corporation - a company type that must consider both the mission and shareholder interests. But the non-profit arm will retain control over it to make sure OpenAI sticks to its mission of developing artificial intelligence to the \"benefit of all humanity\". The restructuring will make it easier for OpenAI to profit from its AI, which the company says will help it to realise its goal of developing artificial general intelligence (AGI). AGI would mean AI can perform any intellectual task that a human can. It is often seen as the holy grail for AI companies.  In a call on Tuesday, OpenAI's chief executive Sam Altman said \"the most likely path\" for the newly formed business is that it becomes publicly traded on the stock market, \"given the capital needs that we'll have and sort of the size of the company\". The company also announced that Microsoft, a long-time backer of OpenAI, will now hold a roughly 27% stake in its new for-profit corporation, a slightly bigger share than OpenAI's own nonprofit. \"We will be keeping a close eye on OpenAI to ensure ongoing adherence to its charitable mission and the protection of the safety of all Californians,\" said California Attorney General Rob Bonta. Read more technology news:Over 1.2 million people a week talk to ChatGPT about suicideUncertainty for UK workers as Amazon to cut 14,000 jobs globallyNHS to offer same-day AI prostate cancer diagnosis  OpenAI said it completed its restructuring \"after nearly a year of engaging in constructive dialogue\" with the offices in both states. \"OpenAI has completed its recapitalization, simplifying its corporate structure,\" said a blog post Tuesday from Bret Taylor, the chair of OpenAI's board of directors. \"The nonprofit remains in control of the for-profit, and now has a direct path to major resources before AGI arrives.\" Read more:Musk v Altman: The battle to become king of AI  When OpenAI initially suggested restructuring, Mr Musk asked a judge to block this from happening. He launched a legal case against the company in 2024, accusing it of a breach of contract. Mr Musk accused the ChatGPT developer of transforming into \"a closed-source de facto subsidiary of the largest technology company, Microsoft\", according to a court filing. \"It is not just developing but is actually refining an AGI [artificial general intelligence] to maximise profits for Microsoft, rather than for the benefit of humanity,\" the court filing said. A legal battle ensued and earlier this year, Mr Musk offered to buy OpenAI for $97.4bn (£78.7bn) - an offer that was quickly rejected by Mr Altman, who told Sky News: \"The company is not for sale.\" After announcing the changes on Tuesday, Mr Altman said: \"California is my home, and I love it here, and when I talked to Attorney General Bonta two weeks ago I made clear that we were not going to do what those other companies do and threaten to leave if sued. \"We really wanted to figure this out and are really happy about where it all landed - and very much appreciate the work of the Attorney General.\""
    }
]