[
    {
        "title": "The untrained mercenaries being tricked into fighting Russia's war in Ukraine",
        "description": "A South African man, with eyes darkened by sleepless nights, tells us his older brother was lured into fighting for Russia on the frontline in Ukraine's raging Donbas region.",
        "url": "https://news.sky.com/story/the-untrained-mercenaries-being-tricked-into-fighting-russias-war-in-ukraine-13484263",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-yousra-elbagir-south-africa_7112069.png?20251216134846",
        "type": "Home",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-12-16 12:35:00",
        "Headline": "Men are fighting on the frontline of a war they have no stake in, with weapons they have little training to wield. Sky News examines how South Africans are being tricked into joining Russians on the frontline in Ukraine.",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n A South African man, with eyes darkened by sleepless nights, tells us his older brother was lured into fighting for Russia on the frontline in Ukraine's raging Donbas region. \"To them, it's a suicide mission because they have never been trained for the military. They don't have military training - they don't have military experience,\" says Bongani, whose name we have changed for his safety. In the hidden back garden of a modest hotel in KwaZulu-Natal province, he continues: \"They don't have experience of any war. They are just bodyguards who want to get a job and provide for their families. That's all.\" Bongani says his brother travelled to Russia on a flight via Dubai after being told he would be receiving bodyguard training along with at least 16 other South African men. After signing a contract in Russian, their fate was sealed. \"The problems started when they were moved from Russia to Ukraine, and they asked them: 'Guys - where are we going now because we are here for training?' \"And then the Russians said: 'Training for what? We don't know anything about training - what we know is that you've signed the contract. You are under our command now - under the Russian army.'\" How is this happening? Sky News has seen harrowing SOS video messages from South African men who describe entrapment and deployment to the frontline in Ukraine. In one video, a man in military fatigues details the moment they signed their contracts. He claims Duduzile Zuma-Sambudla, the daughter of former South African President Jacob Zuma, encouraged them to sign away their lives. \"We refused to sign the contract forms because it was written in Russia, which we didn't understand. We asked them for a translator - someone who can translate the language. They said there was no network,\" he says in fluent English. \"That is when Duduzile came with a guy by the name of Khosa. She said we must sign the contract because it is the same thing they did. Duduzile said she is doing the same course we are doing, the same training, and that unfortunately she won't be with us because she is training somewhere else.\" \"Yes, we agreed. We did sign the forms because we trust the lady, Duduzile.\" Duduzile Zuma-Sambudla is accused of trafficking South African men - including eight of her own relatives - for mercenary recruitment by her half-sister Nkosazana Bonganini Zuma-Mncube, who has filed police charges against her. She denies the allegations and says she was a victim of deception, misrepresentation, and manipulation. The South African Police Service (SAPS) say they are currently investigating the charges. Duduzile Zuma-Sambudla has resigned as a member of parliament and has not responded to our request for comment. Five hours away in Johannesburg's Gauteng province, we watched as another case of suspected mercenary recruitment played out in a South African magistrate's court. Five suspects were ushered out into a crowded courtroom in Kempton Park after being arrested on their way out of Johannesburg's Oliver R Tambo airport following a tip-off to the police that they were allegedly travelling to Russia via the United Arab Emirates. The line-up is sullen as the three young men on one end of the stand look down at their hands. The youngest is only 21 years old. At the other end of the stand is a 39-year-old woman called Patricia Mantuala, who stands accused of recruiting them. The five suspects were eventually granted bail by the court after a postponed hearing. Read more from Sky News:G20 overshadowed by UkraineAlleged mercenary arrested in LondonIs time running out for Ukraine? Colonel Katlego Mogale, a spokesperson for the Directorate for Priority Crime Investigation (DPCI), also known as the HAWKS, told Sky News and other journalists in a news conference that they are not ruling out the possibility that more suspects will be arrested. Amid signs of a growing recruitment drive, the families of those who say they are trapped fighting for Russia in Ukraine are advocating for their loved ones to return home - against all odds. \"You are dealing with people who are well known in South Africa and in South Africa nobody's safe and we may never know what's going to happen next to us,\" says Bongani. \"What's going to happen to our family?\""
    },
    {
        "title": "How 'red mist' led Paul Doyle to plough into Liverpool parade crowd - as violent past revealed",
        "description": "The dashcam footage from Paul Doyle's Ford Galaxy, as he ploughs his way through the crowd at the Liverpool parade, is chilling.",
        "url": "https://news.sky.com/story/how-red-mist-led-paul-doyle-to-plough-into-liverpool-parade-crowd-as-violent-past-revealed-13483661",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-paul-doyle-licerpool_7110979.jpg?20251215134731",
        "type": "Home",
        "Author": "Greg Milam",
        "Date Published": "2025-12-16 12:44:00",
        "Headline": "Tens of thousands of Liverpool fans had been on the streets to celebrate the club's Premier League triumph. Paul Doyle's actions resulted in injuries to 134 people, including two babies and six other children.",
        "Content": "\n          Chief North of England correspondent\n              @GregMilamSky\n The dashcam footage from Paul Doyle's Ford Galaxy, as he ploughs his way through the crowd at the Liverpool parade, is chilling. Bodies are thrown left and right, people disappear under the front of the car, for a few seconds some appear to be clinging to the bonnet, terror on their faces. The sound is equally graphic. The screaming and the shouting from outside of the car. And the thumps: as people bang on the car to get Doyle to stop, and as people are hit by it. Men, women and children hit. A bike, a baby's pram. Throughout those couple of minutes, Doyle lays on the car's horn, the parking sensors beep constantly, and he shouts. \"F***ing hell, move,\" he repeats. \"Get out the f***ing way\", \"f***ing move\", \"get off the f***ing road, you f***ing p***k\". Those words, prosecutors say, reveal the truth - that Doyle knew he was driving at people. He was jailed for 21 years and six months - with Judge Andrew Menary KC telling Doyle he acted in an \"inexplicable and undiluted fury\" when he drove into the crowds. The judge told him his \"disregard for human life defies ordinary understanding\". \"Your actions caused horror and devastation on a scale not previously encountered by this court,\" he said. \"The footage is truly shocking... it shows you, quite deliberately, accelerating into groups of fans time and time again. \"You struck people head-on, knocked others onto the bonnet, drove over limbs, crushed prams and forced those nearby to scatter in terror.\"   Follow latest as Paul Doyle is sentenced \"In my 20 years of policing, this is the most graphic and distressing footage I have ever encountered,\" said Detective Chief Inspector John Fitzgerald, the senior investigating officer for Merseyside Police. \"Doyle's total disregard for the safety of others - particularly the many young children present on Dale Street and Water Street that day - is beyond comprehension. It is sheer luck that no lives were lost.\" In the end, that dashcam footage was never shown to a jury as Doyle pleaded guilty on the day his trial was due to begin. The footage will not be released to the public due to its graphic nature. What motivated his rampage? \"I think Doyle was just determined to get to where he wanted to get to, and there was no stopping him no matter who was in his way,\" said DCI Fitzgerald. \"He clearly got angrier and angrier as the dashcam footage rolls on. He was yelling profanities at the people in his way. \"He just clearly got red mist. \"I do not believe that Doyle deliberately set out his journey to injure people on that day, but his actions were deliberate.\" Ex-soldier helped stop attack Doyle was only stopped by the bravery of former soldier Dan Barr. He managed to climb into the back seat of the car when Doyle briefly paused. \"It was desperation to get him stopped, determination to stop him by whatever means, I think that's what was going through my head,\" Mr Barr said. \"He accelerated off, the door slammed shut and I'd gone from the total chaos of panic and screaming to the relative silence as he's accelerated off and you can just hear the people being hit and run over. \"It was horrendous, and I could see people's faces. I could see the looks of them trying to plead but wasting their time, that's all they could do because there was nowhere to go to get out of the way. \"I do remember seeing he had an automatic and therefore P for park was right at the end so I thought I'll just jam that forward as far as I could that should stop him, and it did.\" Without Mr Barr's actions, police say, Doyle would have carried on. They have described him as a hero. \"I don't think I am,\" Mr Barr said. \"I think it is standard. \"Who wouldn't, if they could have, done what I did? I can't think of anyone, especially on that street.\" It has come at a cost. \"I don't think I have processed it, to be honest with you,\" Mr Barr said. \"I'm not the same since that day. I'm not doing great but I'm getting there.\" By the time it was all over, 134 people had been injured, including two babies and six other children. Read more:Liverpool parade victim tells of 'carnage' Tens of thousands of Liverpool fans had been on the streets of the city on that spring bank holiday Monday to celebrate the club's Premier League triumph. Doyle had driven to the parade to collect a friend he had earlier dropped off there. On his way into the city, his dashcam had recorded him driving erratically, undertaking other cars and running a red light. But police say there had been no sign earlier that day of what could have triggered his rage. Doyle's violent past It can now be revealed that Doyle has previous convictions for assault. In the early 1990s, while serving in the Royal Marines, he was convicted of biting off part of someone's ear during a fight in a pub. He was discharged from the military at that time. Police say they believe Doyle is a fan of Liverpool's city rivals Everton, but that this was not a factor in what happened on 26 May. In police interviews, Doyle claimed he acted in fear and panic because someone in the crowd with a knife had opened his car door. Investigators say they spoke to 1,500 witnesses and no one else mentioned seeing a knife. He also claimed he stopped when he hit the first person. In fact, he had hit more than 100 before stopping. His claims, prosecutors say, were lies. As the incident unfolded, many of those who were there shared their first thoughts. Debbie Blair said: \"People were just screaming, 'It's a terrorist, it's a terrorist, he might have a gun, he might have a knife'.\" \"Next minute people were all screaming, 'kill him, kill him',\" she said. Her son Mike was with her. Images of car attacks on Christmas markets in Europe, he said, flashed through his mind. His greatest concern was the number of children there. \"It was carnage, total carnage,\" he said. He was treated in hospital for injuries that still affect him. \"It shouldn't have happened. But for someone to intentionally do that, it's quite sick really.\" Police say Doyle has never shown any remorse for his actions. He told officers: \"I've ruined my family's lives.\" What he did on 26 May, prosecutors say, devastated lots of people's lives."
    },
    {
        "title": "Film director Rob Reiner's son could face death penalty if found guilty of parents' killings, prosecutors say",
        "description": "Rob Reiner's son Nick could face the death penalty if he is found guilty of murdering his parents, Los Angeles prosecutors have said.",
        "url": "https://news.sky.com/story/film-director-rob-reiners-son-could-face-death-penalty-if-found-guilty-of-parents-killings-prosecutors-say-13484543",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nick-reiner-actor_7112544.jpg?20251217002123",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-16 21:49:00",
        "Headline": "Nick Reiner will be charged with two counts of first degree murder over the killings, district attorney Nathan Hochman says. The 32-year-old is suspected in the deaths of the 78-year-old actor and his wife, Michele Singer Reiner.",
        "Content": "Rob Reiner's son Nick could face the death penalty if he is found guilty of murdering his parents, Los Angeles prosecutors have said. Nick Reiner will be charged with two counts of first degree murder over the killings, district attorney Nathan Hochman said. The 32-year-old is suspected in the deaths of the 78-year-old director and his wife, Michele Singer Reiner.   \"Rob Reiner was a brilliant actor and director, an iconic force in our entertainment industry for decades. His wife, Michel Singer Reine, was an equally iconic photographer and producer,\" said Mr Hochman. \"Their loss is beyond tragic. We will commit ourselves to bringing their murderer to justice.\" \n                  Obamas planned to see Reiners the night they were killed, says ex-US first lady\n                 \n                  Rob Reiner spoke to Eric Idle about future before he and wife were killed\n                 \n                  Rob Reiner latest: Son could face death penalty as he's charged over the killings of Rob Reiner and wife Michele, LA police say\n                 Prosecutors said they would file the charges - two counts of first degree murder with a special circumstance of multiple murders, later on Tuesday. They will also include a special allegation he used a dangerous weapon, a knife. Mr Hochman said the charges carry a maximum sentence of life in prison without the possibility of parole or the death penalty, adding \"no decision\" has been made with respect to the death penalty. \"This case is heartbreaking and deeply personal, not only for the Reiner family and their loved ones but for our entire city,\" LA Police chief Jim McDonnell said. \"We will continue to support the Reiner family and ensure that every step forward is taken with care, dignity and resolve.\" Their tributes were a stark contrast to Donald Trump's response to the news, which prompted the US president to attack Mr Reiner as \"tortured and struggling, but once very talented\". In a post on his Truth Social platform, Mr Trump said Mr Reiner and his wife died \"reportedly due to the anger he caused others through his massive, unyielding, and incurable affliction with a mind crippling disease known as TRUMP DERANGEMENT SYNDROME\". Read more: Rob Reiner spoke to Eric Idle about future before he was killed It comes after it emerged Mr Reiner's son was reportedly disruptive at a party hosted by comedian Conan O'Brien the night before the killings. Nick Reiner joined his father and mother at the event on Saturday - and the couple were upset and embarrassed about his behaviour, Sky News' US partner NBC News cited a source as saying. They also expressed concerns about his health. The outlet cited another source saying Nick Reiner's behaviour had made other guests uncomfortable. They said he interrupted a conversation filmmaker Bill Hader was having with two guests and - when informed it was a private conversation - stood still and stared before storming off. The couple were found dead from apparent stab wounds at their home in the Brentwood neighbourhood on the west side of Los Angeles. Nick Reiner did not resist when he was arrested hours later in the Exposition Park area, near the University of Southern California, around four miles from the crime scene, police said. He had been expected to make an initial court appearance earlier on Tuesday, but his attorney said he was not brought from jail to the courthouse for medical reasons, and the appearance would not happen before Wednesday. Nick Reiner has not yet entered a plea. Rob Reiner was a celebrated director, whose work included some of the most memorable films of the 1980s and 1990s, including This Is Spinal Tap, The Princess Bride, When Harry Met Sally and A Few Good Men. He met Michele Singer in 1989, while directing When Harry Met Sally, and they had three children together. Michele used to work as a photographer and took the photo of Donald Trump that appears on the cover of his book Trump: The Art Of The Deal."
    },
    {
        "title": "Brown University shooting: New image and video released of 'person of interest'",
        "description": "Police investigating a deadly shooting at a US university have released a new image and video clips of a \"person of interest\".",
        "url": "https://news.sky.com/story/brown-university-shooting-new-image-and-video-released-of-person-of-interest-13484529",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-brown-suspect-brown-shooteer_7112425.png?20251216211101",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-16 20:54:00",
        "Headline": "A new image and video clips show the movements of a 'person of interest' in the deadly attack that left two students dead and nine injured.",
        "Content": "Police investigating a deadly shooting at a US university have released a new image and video clips of a \"person of interest\". It comes as the manhunt for a gunman who killed two Brown University students and injured nine more in a classroom continued for a fourth day. The shooting on Saturday afternoon unfolded on the first floor of the engineering and physics building while exams were taking place. A law enforcement official said the attacker fired more than 40 rounds from a 9mm handgun in Providence, Rhode Island. The new image showed a man dressed in dark clothing, wearing a black hat and face mask, walking down a street that day. In all of the videos made public, the suspect's face was either covered by a mask or turned away. He is described as stocky and about 5ft 8in (173cm) tall. Authorities have released a video timeline showing the movements of the person of interest, including of him before the attack, in the hope that someone might recognise him. \n                  Film director Rob Reiner's son could face death penalty if found guilty of parents' killings, prosecutors say\n                 \n                  Obamas planned to see Reiners the night they were killed, says ex-US first lady\n                 \n                  Doctor sentenced over Matthew Perry's death\n                 The clips showed a man walking briskly, and at one point running, between 2pm and 3pm local time, along several different streets, about a block away from the building where the attack would later take place. The shooting happened at 4.03pm, and another clip showed the same person from a distance walking from the building's car park towards the street, even as police cars with flashing lights arrived at the scene. The final clip showed the man walking along that street about three minutes after the shooting. Authorities on Sunday released a man who had been detained in connection with the attack. Read more:Video of 'person of interest' in Brown shooting Police have said there was no clear video of the gunman from inside the building. Attorney general Peter Neronha said there were cameras in the newer part but \"fewer, if any, cameras\" where the shooting happened \"because it's an older building\". The attack and the gunman's escape have sparked concerns about campus safety, including the absence of security cameras, and led to calls for improved door locks. More details about victims emerge The students who were killed were Ella Cook, a 19-year-old sophomore from Birmingham, Alabama, and MukhammadAziz Umurzokov, an 18-year-old freshman from Brandermill, Virginia. Ms Cook was vice president of the College Republicans club at Brown University and Mr Umurzokov, whose family came to the US from Uzbekistan when he was a child, was an aspiring neurosurgeon. The Reverend R Craig Smalley described Ms Cook as \"an incredibly grounded, faithful, bright light\" who encouraged and \"lifted up those around her\". In a GoFundMe post, Mr Umurzokov's family described him as \"incredibly kind, funny, and smart\". \"He always lent a helping hand to anyone in need without hesitation, and was the most kind-hearted person our family knew,\" they said."
    },
    {
        "title": "Whitakers' real-life Willy Wonka on shrinkflation and the rise of chocolate-flavour bars",
        "description": "Britain loves chocolate.",
        "url": "https://news.sky.com/story/whitakers-real-life-willie-wonka-on-shrinkflation-and-the-rise-of-chocolate-flavour-bars-13484338",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-william-whitaker-willie-wonka_7112267.png?20251216164213",
        "type": "Home",
        "Author": "Paul Kelso",
        "Date Published": "2025-12-16 13:43:00",
        "Headline": "The British chocolate maker has seen nearly £3m of cost increases this year and last, and some rival brands have had to tinker with their recipes to such an extent they can't legally call themselves chocolate.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n Britain loves chocolate. We're estimated to consume 8.2kg each every year, a good chunk of it at Christmas, but the cost of that everyday luxury habit has been rising fast. Whitakers have been making chocolate in Skipton in north Yorkshire for 135 years, but they have never experienced price pressures as extreme as those in the last five. \"We buy liquid chocolate and since 2023, the price of our chocolate has doubled,\" explains William Whitaker, the real-life Willy Wonka and the fourth generation of the family to run the business. \"It could have been worse. If we hadn't been contracted [with a supplier], it would have trebled. \"That represents a £5,000 per-tonne increase, and we use a thousand tonnes a year. And we only sell £12-£13m of product, so it's a massive effect.\" Whitakers makes 10 million pieces of chocolate a week in a factory on the much-expanded site of the original bakery where the business began. Automated production lines snake through the site moulding, cutting, cooling, coating and wrapping a relentless procession of fondants, cremes, crisps and pure chocolate products for customers, including own-brand retail, supermarkets, and the catering trade. Steepest inflation in the business All of them have faced price increases as Whitakers has grappled with some of the steepest inflation in the food business. Cocoa prices have soared in the last two years, largely because of a succession of poor cocoa harvests in West Africa, where Ghana and the Ivory Coast produce around two-thirds of global supply. A combination of drought and crop disease cut global output by around 14% last year, pushing consumer prices in the other direction, with chocolate inflation passing 17% in the UK in October.  Skimpflation and shrinkflation  Some major brands have responded by cutting the chocolate content of products - \"skimpflation\" - or charging more for less - \"shrinkflation\". Household-name brands including Penguin and Club have cut the cocoa and milk solid content so far they can no longer be classified as chocolate, and are marketed instead as \"chocolate-flavour\". Whitakers have stuck to their recipes and product sizes, choosing to pass price increases on to customers while adapting products to the new market conditions. \"Not only are major brands putting up prices over 20%, sometimes 40%, they've also reduced the size of their pieces and sometimes the ingredients,\" says William Whitaker. \"We haven't done any of that. We knew that long-term, the market will fall again, and that happier days will return. \"We've introduced new products where we've used chocolate as a coating rather than a solid chocolate because the centre, which is sugar-based, is cheaper than the chocolate. \"We've got a big product range of fondant creams, and others like gingers and Brazil nuts, where we're using that chocolate as a coating.\" A deluge of price rises Brazil nuts have enjoyed their own spike in price, more than doubling to £15,000 a tonne at one stage. On top of commodity prices determined by markets beyond their control, Whitakers face the same inflationary pressures as other UK businesses. \"We've had the minimum wage increasing every year, we had the national insurance rise last year, and sort of hidden a little bit in this budget is a business rate increase. \"This is a small business, we turn over £12m, but our rates will go up nearly £100,000 next year before any other costs. \"If you add up all the cocoa and all the other cost increases in 2024 and 2025, it's nearly £3m of cost increases we've had to bear. Some of that is returning to a little normality. It does test the relevance of what you do.\""
    },
    {
        "title": "Imran Khan being held in 'death cell', his sons say",
        "description": "The sons of former Pakistani prime minister Imran Khan have said they fear they might never see their father again as he is being \"psychologically tortured\" in a \"death cell\".",
        "url": "https://news.sky.com/story/imran-khans-sons-fear-they-may-never-see-him-again-as-former-pakistan-pm-held-in-death-cell-13484410",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-imran-sons-yalda-hakim-show_7112285.jpg?20251216165153",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-16 14:55:00",
        "Headline": "Kasim Khan tells The World with Yalda Hakim: \"It's getting harder to see a route out at this point. We're trying to have faith. But at the same time, right now, the conditions are getting worse.\"",
        "Content": "The sons of former Pakistani prime minister Imran Khan have said they fear they might never see their father again as he is being \"psychologically tortured\" in a \"death cell\". Speaking to Sky News' The World with Yalda Hakim, Kasim and Sulaiman Khan said they had not spoken to their father, who has been in prison since August 2023, for months. Kasim described the conditions the former Pakistani leader has been kept in, saying: \"He's been in a solitary confinement cell for over two years where he's had filthy water, he is around inmates who are dying of hepatitis, the conditions are disgusting and also he is completely isolated from any human contact.\"   He continued: \"It's getting harder to see a route out at this point. We're trying to have faith. But at the same time, right now, the conditions are getting worse. \"It's very hard to see a way out… We're now worried we might never see him again.\" \n                  How did a viral deepfake stoke tensions between India and Pakistan? \n                 \n                  Imran Khan vs the military: What's just happened in Pakistan?\n                 \n                  Ex-Pakistan PM Imran Khan sentenced to 14 years in jail in corruption case\n                 Kasim said his father was being subjected to \"psychological torture tactics\" as even the prison guards were not allowed to communicate with Imran Khan, who led the country between 2018 and 2022. Sulaiman said his father's cell, where he allegedly spends 23 hours a day, has been described as a \"death cell\". He said an army spokesperson announced on Friday that Imran Khan, who has in the past been shot three times, was now officially in full isolation. He added that his father was being kept in \"completely substandard conditions that don't meet international law for any sort of prisoner\". The brothers' words echo what one of Imran Khan's sisters reported after being allowed to meet the former cricketer in prison at the start of the month. Uzma Khanum said at the time that her brother was facing isolation and psychological strain in prison following weeks in which his family said access had been blocked. The former leader has been in jail since his August 2023 arrest after he was handed a three-year prison term for illegally selling state gifts. He was convicted in a string of cases that he says were politically driven following his ousting in a 2022 parliamentary vote. Kasim said his father would \"never take a deal and leave all of his other party members in jail to die and fester in these jails... instead he stays in those conditions, happy to rot and it means that he can move towards his goal of ridding Pakistan of corruption, a goal that he has stated to us a million times\". Speaking on The World with Yalda Hakim on Tuesday, Mosharraf Zaidi, a spokesperson for Pakistan's PM, denied allegations Imran Khan was being kept in solitary confinement. He told Sky News Imran Khan had been in prison for about 860 days and had 870 visits, despite the fact he is supposed to get one visit per week. Before launching his political career, Imran Khan was best known as a star of international cricket and for leading Pakistan to Cricket World Cup victory in 1992."
    },
    {
        "title": "2025 is the UK's sunniest year ever - with record levels for solar power",
        "description": "The UK has recorded its sunniest year ever - and we are only halfway through December.",
        "url": "https://news.sky.com/story/2025-is-the-uks-sunniest-year-ever-with-record-levels-for-solar-power-13484385",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-brighton-beach-sunshine_7112327.jpg?20251216175712",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-12-16 14:28:00",
        "Headline": "There were long spells earlier this year when every time morning rolled around, it was another day of sun. The UK has in fact been getting sunnier since the 1980s, but scientists can't yet say why.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The UK has recorded its sunniest year ever - and we are only halfway through December. But a bumper spring and summer for sunshine have already put 2025 firmly in the top spot for sunshine hours across the UK, according to provisional Met Office statistics. The sunny spells were driven by frequent periods of high pressure that reduced clouds and locked in sunny skies for many parts of the country. Though it may be hard to believe, Britain's weather has generally been getting sunnier over the past few decades - but scientists can't yet say why. This year, up until 15 December, the country clocked up 1,622 hours of sunshine, beating the previous sunniest year of 2003. All that sunshine drove a record year for solar power, by a huge margin. Met Office senior scientist Mike Kendon said: \"Spring was exceptional, and many will remember the long spells of days with largely unbroken sunshine.\" So far this year, only the months of February and October recorded below-average sunshine hours, he added. But the bounties were not shared equally across the nations. England enjoyed its sunniest year ever. But 2025 has likely not even made the top 10 for Northern Ireland, even though it was above average. Scotland is on course for its second-sunniest year, and Wales its sixth, albeit with two weeks still to go. Why is the UK getting sunnier? The UK has broadly been getting sunnier since the 1980s, but the cause of the trend remains a mystery. It could \"simply be down to natural variability\", the Met Office said, meaning it could well change in future. Or it may be explained by a \"reduction in particulates [known as aerosols] over the UK, partly due to clean air laws introduced to combat acid rain\", said Edward Gryspeerdt, associate professor in atmospheric physics, Imperial College London. Aerosols cause clouds to reflect less light, so fewer of them allows more sunshine down to Earth. There is \"no definitive evidence\" that climate change is impacting sunshine levels, according to the Met Office. Solar energy in the limelight All that sunshine, combined with the build out of more solar farms and panels on roofs, meant solar power soared to record levels in 2025. By November, solar had already generated 18Twh of electricity, far more than the 14Twh by the end of December last year. John Marsham, professor of atmospheric science at Leeds University, said solar energy was \"helping to lower prices\" of electricity by breaking the link with gas prices. The Ember thinktank also found just 2% of days in a typical year have both low wind and low sunshine, meaning 98% of the time it is either windy or sunny. Ember analyst Frankie Mayo said: \"At a national scale, solar power pairs well with wind farms which generate more in winter, when it's less sunny.\" Read more from Sky News:Imran Khan 'held in death cell'Boy arrested over girl's murder However, large solar farms have proved unpopular in some local communities for their impact on the landscape, such as in Lincolnshire, where several large sites recently were given the go-ahead. Craig Dyke from the UK's energy system operator NESO said: \"It's hard to believe how far Britain has come over the past quarter of a century, with renewables now producing around 60% of our electricity - up from just 3% in the year 2000.\""
    },
    {
        "title": "UK to rejoin EU's Erasmus student exchange scheme - reports",
        "description": "The UK is to rejoin the European Union's Erasmus student exchange scheme, according to reports.",
        "url": "https://news.sky.com/story/uk-to-rejoin-eus-erasmus-student-exchange-scheme-reports-13484526",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-university-erasmus_7112424.jpg?20251216211059",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-16 20:50:00",
        "Headline": "The programme was halted due to Brexit at the beginning of 2021.",
        "Content": "The UK is to rejoin the European Union's Erasmus student exchange scheme, according to reports. The popular programme, which allowed Britons to spend a year studying at European universities as part of their degree without paying extra fees and vice versa for their European counterparts, ended for British students after Brexit on 1 January 2021. But ministers could announce the UK will rejoin Erasmus from January 2027 as soon as Wednesday, The Times and The Guardian have reported. Politics latest: Labour's flagship workers' rights bill passes Lords after months of debate  Sir Keir Starmer promised a post-Brexit reset deal with Brussels and announced the government was working on rejoining the programme in May. Negotiations have included work on \"mutually agreed financial terms\" for the UK and the EU. \n                  David Lammy suggests UK would benefit from rejoining an EU customs union\n                 \n                  PM issues China warning - and hits out at Brexit\n                 \n                  Brexit impact on UK economy 'negative for foreseeable future', Bank of England chief says\n                 The UK had pushed for a discount on membership fees, which are calculated on the basis of a country's gross domestic product (GDP), The Times reported. It said the EU is understood to have offered the government a 30% reduction of fees in the first year of membership. Labour MP Darren Frith told Sky News' Politics Hub he would \"welcome\" such a move. The Guardian reported that as well as university-based study exchanges, British students will be able to participate in vocational training placements under the scheme. Cabinet Office minister Nick Thomas-Symonds held talks with Maros Sefcovic, the European Commission's trade lead, in Brussels last week. A Cabinet Office spokesman said: \"We are not commenting on ongoing talks.\" But the UK's universities welcomed the apparent breakthrough. Tim Bradshaw, chief executive of the Russell Group of leading universities, said: \"We're delighted at the UK's association to Erasmus+. \"With an even greater scope than previous programmes, Erasmus+ opens up fantastic opportunities for students, adult learners and young people to all benefit from new experiences and learning. \"It will also renew the huge contributions that EU students and staff make to life on our university campuses.\" The Lib Dems, who have been campaigning to rejoin Erasmus, welcomed the news. Leader Sir Ed Davey said: \"This is a moment of real opportunity and a clear step towards repairing the disastrous Conservative Brexit deal.\""
    },
    {
        "title": "Couple win second £1m lottery – beating 24-trillion-to-one odds",
        "description": "A couple are celebrating a second &#163;1m National Lottery win after they beat 24-trillion-to-one odds of them winning both the EuroMillions Millionaire Maker and then five numbers and the bonus ball on the Lotto.",
        "url": "https://news.sky.com/story/couple-win-second-1631m-lottery-8211-beating-24-trillion-to-one-odds-13484525",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-lottery-winners_7112474.jpg?20251216220336",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-16 20:45:00",
        "Headline": "Richard Davies and Faye Stevenson-Davies celebrated their first £1m win in 2018. The couple credit the power of positive thinking for their lottery wins.",
        "Content": "A couple are celebrating a second £1m National Lottery win after they beat 24-trillion-to-one odds of them winning both the EuroMillions Millionaire Maker and then five numbers and the bonus ball on the Lotto. Richard Davies, 49, and Faye Stevenson-Davies, 43, celebrated their first £1m win in June 2018. The couple credit the power of positive thinking for their win. Ms Stevenson-Davies said: \"We always believed winning was possible, and once we scooped £1m and met hundreds of other lucky winners, we realised fairy tales do come true and there are winners everywhere! \"We knew the odds of it happening again were outrageous, but we're proof that if you believe, anything is possible.\" While rare, double wins have happened before. Neither partner fancies early retirement Before their first win, Mr Davies worked as a hairdresser and Ms Stevenson-Davies worked as a mental health nurse. Ms Stevenson-Davies used the 2018 win to return to university, gaining a second degree in counselling and therapeutic practice, while her other half hung up his scissors. Since then, Mr Davies has started working seven days a week as a parcel courier after originally helping a friend out by doing the work just a couple days per week. Ms Stevenson-Davies is utilising her new degree and now has her own practice and also provides counselling services for local organisations including Brecon & District Mind charity and The DPJ Foundation. Mr Davies said: \"Everyone keeps asking what we'll do in the future, and we genuinely have no idea at present. \"The first time around we gifted people cars, we donated a minibus to the local rugby team, and did our best to help friends and family, it was all new and it was amazing to be able to make a difference. \"This time, who knows, we'll take our time and enjoy the moment.\" How the couple managed it Mr Davies said: \"This win was not as simple as buying the winning ticket, it came to us through a series of four consecutive Lotto draws!\" Richard explained how \"when you match two numbers in the Lotto draw, you automatically win a Lucky Dip for the next game and that's what's happened to us. \"We matched two numbers and won a free Lucky Dip from the draw on the 15 [November], which put us into the next draw and so on, until the winning draw on Wednesday 26 November.\" More from Sky News:FIFA announces £45 World Cup tickets in price climbdownObamas planned to see Reiners the night they were killed While another win was always a real possibility for the positive pair, they had other motivations for playing too. Ms Stevenson-Davies said: \"We've also seen first-hand, through our volunteering at projects that have received vital National Lottery funding, the impact players make.\" While the couple could easily swap Mid-Wales for Mauritius this Christmas, the community-minded pair have other plans. Mr Davies will continue to work seven days a week so that everyone gets their Christmas deliveries, while Ms Stevenson-Davies is offering mental health support to her clients across the festive period, including Christmas Day. Andy Carter, senior winner's adviser at Allwyn, the operator of The National Lottery, said: \"With a £15m Must Be Won Christmas Eve Lotto Draw, there is guaranteed to be more big winners, so if ever there was a time to believe in festive magic, now's the time.\""
    },
    {
        "title": "How 'red mist' led Paul Doyle to plough into Liverpool parade crowd - as violent past revealed",
        "description": "The dashcam footage from Paul Doyle's Ford Galaxy, as he ploughs his way through the crowd at the Liverpool parade, is chilling.",
        "url": "https://news.sky.com/story/how-red-mist-led-paul-doyle-to-plough-into-liverpool-parade-crowd-as-violent-past-revealed-13483661",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-paul-doyle-licerpool_7110979.jpg?20251215134731",
        "type": "UK",
        "Author": "Greg Milam",
        "Date Published": "2025-12-16 12:44:00",
        "Headline": "Tens of thousands of Liverpool fans had been on the streets to celebrate the club's Premier League triumph. Paul Doyle's actions resulted in injuries to 134 people, including two babies and six other children.",
        "Content": "\n          Chief North of England correspondent\n              @GregMilamSky\n The dashcam footage from Paul Doyle's Ford Galaxy, as he ploughs his way through the crowd at the Liverpool parade, is chilling. Bodies are thrown left and right, people disappear under the front of the car, for a few seconds some appear to be clinging to the bonnet, terror on their faces. The sound is equally graphic. The screaming and the shouting from outside of the car. And the thumps: as people bang on the car to get Doyle to stop, and as people are hit by it. Men, women and children hit. A bike, a baby's pram. Throughout those couple of minutes, Doyle lays on the car's horn, the parking sensors beep constantly, and he shouts. \"F***ing hell, move,\" he repeats. \"Get out the f***ing way\", \"f***ing move\", \"get off the f***ing road, you f***ing p***k\". Those words, prosecutors say, reveal the truth - that Doyle knew he was driving at people. He was jailed for 21 years and six months - with Judge Andrew Menary KC telling Doyle he acted in an \"inexplicable and undiluted fury\" when he drove into the crowds. The judge told him his \"disregard for human life defies ordinary understanding\". \"Your actions caused horror and devastation on a scale not previously encountered by this court,\" he said. \"The footage is truly shocking... it shows you, quite deliberately, accelerating into groups of fans time and time again. \"You struck people head-on, knocked others onto the bonnet, drove over limbs, crushed prams and forced those nearby to scatter in terror.\"   Follow latest as Paul Doyle is sentenced \"In my 20 years of policing, this is the most graphic and distressing footage I have ever encountered,\" said Detective Chief Inspector John Fitzgerald, the senior investigating officer for Merseyside Police. \"Doyle's total disregard for the safety of others - particularly the many young children present on Dale Street and Water Street that day - is beyond comprehension. It is sheer luck that no lives were lost.\" In the end, that dashcam footage was never shown to a jury as Doyle pleaded guilty on the day his trial was due to begin. The footage will not be released to the public due to its graphic nature. What motivated his rampage? \"I think Doyle was just determined to get to where he wanted to get to, and there was no stopping him no matter who was in his way,\" said DCI Fitzgerald. \"He clearly got angrier and angrier as the dashcam footage rolls on. He was yelling profanities at the people in his way. \"He just clearly got red mist. \"I do not believe that Doyle deliberately set out his journey to injure people on that day, but his actions were deliberate.\" Ex-soldier helped stop attack Doyle was only stopped by the bravery of former soldier Dan Barr. He managed to climb into the back seat of the car when Doyle briefly paused. \"It was desperation to get him stopped, determination to stop him by whatever means, I think that's what was going through my head,\" Mr Barr said. \"He accelerated off, the door slammed shut and I'd gone from the total chaos of panic and screaming to the relative silence as he's accelerated off and you can just hear the people being hit and run over. \"It was horrendous, and I could see people's faces. I could see the looks of them trying to plead but wasting their time, that's all they could do because there was nowhere to go to get out of the way. \"I do remember seeing he had an automatic and therefore P for park was right at the end so I thought I'll just jam that forward as far as I could that should stop him, and it did.\" Without Mr Barr's actions, police say, Doyle would have carried on. They have described him as a hero. \"I don't think I am,\" Mr Barr said. \"I think it is standard. \"Who wouldn't, if they could have, done what I did? I can't think of anyone, especially on that street.\" It has come at a cost. \"I don't think I have processed it, to be honest with you,\" Mr Barr said. \"I'm not the same since that day. I'm not doing great but I'm getting there.\" By the time it was all over, 134 people had been injured, including two babies and six other children. Read more:Liverpool parade victim tells of 'carnage' Tens of thousands of Liverpool fans had been on the streets of the city on that spring bank holiday Monday to celebrate the club's Premier League triumph. Doyle had driven to the parade to collect a friend he had earlier dropped off there. On his way into the city, his dashcam had recorded him driving erratically, undertaking other cars and running a red light. But police say there had been no sign earlier that day of what could have triggered his rage. Doyle's violent past It can now be revealed that Doyle has previous convictions for assault. In the early 1990s, while serving in the Royal Marines, he was convicted of biting off part of someone's ear during a fight in a pub. He was discharged from the military at that time. Police say they believe Doyle is a fan of Liverpool's city rivals Everton, but that this was not a factor in what happened on 26 May. In police interviews, Doyle claimed he acted in fear and panic because someone in the crowd with a knife had opened his car door. Investigators say they spoke to 1,500 witnesses and no one else mentioned seeing a knife. He also claimed he stopped when he hit the first person. In fact, he had hit more than 100 before stopping. His claims, prosecutors say, were lies. As the incident unfolded, many of those who were there shared their first thoughts. Debbie Blair said: \"People were just screaming, 'It's a terrorist, it's a terrorist, he might have a gun, he might have a knife'.\" \"Next minute people were all screaming, 'kill him, kill him',\" she said. Her son Mike was with her. Images of car attacks on Christmas markets in Europe, he said, flashed through his mind. His greatest concern was the number of children there. \"It was carnage, total carnage,\" he said. He was treated in hospital for injuries that still affect him. \"It shouldn't have happened. But for someone to intentionally do that, it's quite sick really.\" Police say Doyle has never shown any remorse for his actions. He told officers: \"I've ruined my family's lives.\" What he did on 26 May, prosecutors say, devastated lots of people's lives."
    },
    {
        "title": "UK to rejoin EU's Erasmus student exchange scheme - reports",
        "description": "The UK is to rejoin the European Union's Erasmus student exchange scheme, according to reports.",
        "url": "https://news.sky.com/story/uk-to-rejoin-eus-erasmus-student-exchange-scheme-reports-13484526",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-university-erasmus_7112424.jpg?20251216211059",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-16 20:50:00",
        "Headline": "The programme was halted due to Brexit at the beginning of 2021.",
        "Content": "The UK is to rejoin the European Union's Erasmus student exchange scheme, according to reports. The popular programme, which allowed Britons to spend a year studying at European universities as part of their degree without paying extra fees and vice versa for their European counterparts, ended for British students after Brexit on 1 January 2021. But ministers could announce the UK will rejoin Erasmus from January 2027 as soon as Wednesday, The Times and The Guardian have reported. Politics latest: Labour's flagship workers' rights bill passes Lords after months of debate  Sir Keir Starmer promised a post-Brexit reset deal with Brussels and announced the government was working on rejoining the programme in May. Negotiations have included work on \"mutually agreed financial terms\" for the UK and the EU. \n                  David Lammy suggests UK would benefit from rejoining an EU customs union\n                 \n                  PM issues China warning - and hits out at Brexit\n                 \n                  Brexit impact on UK economy 'negative for foreseeable future', Bank of England chief says\n                 The UK had pushed for a discount on membership fees, which are calculated on the basis of a country's gross domestic product (GDP), The Times reported. It said the EU is understood to have offered the government a 30% reduction of fees in the first year of membership. Labour MP Darren Frith told Sky News' Politics Hub he would \"welcome\" such a move. The Guardian reported that as well as university-based study exchanges, British students will be able to participate in vocational training placements under the scheme. Cabinet Office minister Nick Thomas-Symonds held talks with Maros Sefcovic, the European Commission's trade lead, in Brussels last week. A Cabinet Office spokesman said: \"We are not commenting on ongoing talks.\" But the UK's universities welcomed the apparent breakthrough. Tim Bradshaw, chief executive of the Russell Group of leading universities, said: \"We're delighted at the UK's association to Erasmus+. \"With an even greater scope than previous programmes, Erasmus+ opens up fantastic opportunities for students, adult learners and young people to all benefit from new experiences and learning. \"It will also renew the huge contributions that EU students and staff make to life on our university campuses.\" The Lib Dems, who have been campaigning to rejoin Erasmus, welcomed the news. Leader Sir Ed Davey said: \"This is a moment of real opportunity and a clear step towards repairing the disastrous Conservative Brexit deal.\""
    },
    {
        "title": "2025 is the UK's sunniest year ever - with record levels for solar power",
        "description": "The UK has recorded its sunniest year ever - and we are only halfway through December.",
        "url": "https://news.sky.com/story/2025-is-the-uks-sunniest-year-ever-with-record-levels-for-solar-power-13484385",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-brighton-beach-sunshine_7112327.jpg?20251216175712",
        "type": "UK",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-12-16 14:28:00",
        "Headline": "There were long spells earlier this year when every time morning rolled around, it was another day of sun. The UK has in fact been getting sunnier since the 1980s, but scientists can't yet say why.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The UK has recorded its sunniest year ever - and we are only halfway through December. But a bumper spring and summer for sunshine have already put 2025 firmly in the top spot for sunshine hours across the UK, according to provisional Met Office statistics. The sunny spells were driven by frequent periods of high pressure that reduced clouds and locked in sunny skies for many parts of the country. Though it may be hard to believe, Britain's weather has generally been getting sunnier over the past few decades - but scientists can't yet say why. This year, up until 15 December, the country clocked up 1,622 hours of sunshine, beating the previous sunniest year of 2003. All that sunshine drove a record year for solar power, by a huge margin. Met Office senior scientist Mike Kendon said: \"Spring was exceptional, and many will remember the long spells of days with largely unbroken sunshine.\" So far this year, only the months of February and October recorded below-average sunshine hours, he added. But the bounties were not shared equally across the nations. England enjoyed its sunniest year ever. But 2025 has likely not even made the top 10 for Northern Ireland, even though it was above average. Scotland is on course for its second-sunniest year, and Wales its sixth, albeit with two weeks still to go. Why is the UK getting sunnier? The UK has broadly been getting sunnier since the 1980s, but the cause of the trend remains a mystery. It could \"simply be down to natural variability\", the Met Office said, meaning it could well change in future. Or it may be explained by a \"reduction in particulates [known as aerosols] over the UK, partly due to clean air laws introduced to combat acid rain\", said Edward Gryspeerdt, associate professor in atmospheric physics, Imperial College London. Aerosols cause clouds to reflect less light, so fewer of them allows more sunshine down to Earth. There is \"no definitive evidence\" that climate change is impacting sunshine levels, according to the Met Office. Solar energy in the limelight All that sunshine, combined with the build out of more solar farms and panels on roofs, meant solar power soared to record levels in 2025. By November, solar had already generated 18Twh of electricity, far more than the 14Twh by the end of December last year. John Marsham, professor of atmospheric science at Leeds University, said solar energy was \"helping to lower prices\" of electricity by breaking the link with gas prices. The Ember thinktank also found just 2% of days in a typical year have both low wind and low sunshine, meaning 98% of the time it is either windy or sunny. Ember analyst Frankie Mayo said: \"At a national scale, solar power pairs well with wind farms which generate more in winter, when it's less sunny.\" Read more from Sky News:Imran Khan 'held in death cell'Boy arrested over girl's murder However, large solar farms have proved unpopular in some local communities for their impact on the landscape, such as in Lincolnshire, where several large sites recently were given the go-ahead. Craig Dyke from the UK's energy system operator NESO said: \"It's hard to believe how far Britain has come over the past quarter of a century, with renewables now producing around 60% of our electricity - up from just 3% in the year 2000.\""
    },
    {
        "title": "Whitakers' real-life Willy Wonka on shrinkflation and the rise of chocolate-flavour bars",
        "description": "Britain loves chocolate.",
        "url": "https://news.sky.com/story/whitakers-real-life-willie-wonka-on-shrinkflation-and-the-rise-of-chocolate-flavour-bars-13484338",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-william-whitaker-willie-wonka_7112267.png?20251216164213",
        "type": "UK",
        "Author": "Paul Kelso",
        "Date Published": "2025-12-16 13:43:00",
        "Headline": "The British chocolate maker has seen nearly £3m of cost increases this year and last, and some rival brands have had to tinker with their recipes to such an extent they can't legally call themselves chocolate.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n Britain loves chocolate. We're estimated to consume 8.2kg each every year, a good chunk of it at Christmas, but the cost of that everyday luxury habit has been rising fast. Whitakers have been making chocolate in Skipton in north Yorkshire for 135 years, but they have never experienced price pressures as extreme as those in the last five. \"We buy liquid chocolate and since 2023, the price of our chocolate has doubled,\" explains William Whitaker, the real-life Willy Wonka and the fourth generation of the family to run the business. \"It could have been worse. If we hadn't been contracted [with a supplier], it would have trebled. \"That represents a £5,000 per-tonne increase, and we use a thousand tonnes a year. And we only sell £12-£13m of product, so it's a massive effect.\" Whitakers makes 10 million pieces of chocolate a week in a factory on the much-expanded site of the original bakery where the business began. Automated production lines snake through the site moulding, cutting, cooling, coating and wrapping a relentless procession of fondants, cremes, crisps and pure chocolate products for customers, including own-brand retail, supermarkets, and the catering trade. Steepest inflation in the business All of them have faced price increases as Whitakers has grappled with some of the steepest inflation in the food business. Cocoa prices have soared in the last two years, largely because of a succession of poor cocoa harvests in West Africa, where Ghana and the Ivory Coast produce around two-thirds of global supply. A combination of drought and crop disease cut global output by around 14% last year, pushing consumer prices in the other direction, with chocolate inflation passing 17% in the UK in October.  Skimpflation and shrinkflation  Some major brands have responded by cutting the chocolate content of products - \"skimpflation\" - or charging more for less - \"shrinkflation\". Household-name brands including Penguin and Club have cut the cocoa and milk solid content so far they can no longer be classified as chocolate, and are marketed instead as \"chocolate-flavour\". Whitakers have stuck to their recipes and product sizes, choosing to pass price increases on to customers while adapting products to the new market conditions. \"Not only are major brands putting up prices over 20%, sometimes 40%, they've also reduced the size of their pieces and sometimes the ingredients,\" says William Whitaker. \"We haven't done any of that. We knew that long-term, the market will fall again, and that happier days will return. \"We've introduced new products where we've used chocolate as a coating rather than a solid chocolate because the centre, which is sugar-based, is cheaper than the chocolate. \"We've got a big product range of fondant creams, and others like gingers and Brazil nuts, where we're using that chocolate as a coating.\" A deluge of price rises Brazil nuts have enjoyed their own spike in price, more than doubling to £15,000 a tonne at one stage. On top of commodity prices determined by markets beyond their control, Whitakers face the same inflationary pressures as other UK businesses. \"We've had the minimum wage increasing every year, we had the national insurance rise last year, and sort of hidden a little bit in this budget is a business rate increase. \"This is a small business, we turn over £12m, but our rates will go up nearly £100,000 next year before any other costs. \"If you add up all the cocoa and all the other cost increases in 2024 and 2025, it's nearly £3m of cost increases we've had to bear. Some of that is returning to a little normality. It does test the relevance of what you do.\""
    },
    {
        "title": "FIFA announces £45 World Cup tickets in climbdown after outcry over pricing",
        "description": "FIFA has announced \"more affordable\" tickets for all 104 matches at next year's World Cup after an outcry over pricing.",
        "url": "https://news.sky.com/story/fifa-announces-more-affordable-world-cup-tickets-after-outcry-over-pricing-13484459",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-world-cup-2026-fifa_7112359.jpg?20251216184602",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-16 18:14:00",
        "Headline": "The number of cheaper tickets for each game is likely to be in the hundreds, rather than thousands.",
        "Content": "FIFA has announced \"more affordable\" tickets for all 104 matches at next year's World Cup after an outcry over pricing. The cheapest tickets will now be on offer from $60 (£45) as part of a new \"Supporter Entry Tier\" which will be available specifically to supporters of qualified teams. However, only 10% of participating member association's allocated tickets will fall under this most affordable category. As a result, the number of $60 tickets for each game is likely to be in the hundreds, rather than thousands.  Supporter value tier prices will apply to 40% of their tickets with the remaining 50% being split evenly between supporter standard tier and supporter premier tier. Ronan Evain, the executive director of Football Supporter's Europe (FSE), a group that represents the interests of supporters in European football, said the group was \"looking at the FIFA announcement as nothing more than an appeasement tactic due to the global negative backlash\". He added: \"This shows that FIFA's ticketing policy is not set in stone, was decided in a rush, and without proper consultation - including with FIFA's own member associations.\" While he welcomed FIFA's \"seeming recognition of the damage its original plans were to cause\", he insisted \"the revisions do not go far enough to reconcile\" the harm done. In a statement, FIFA said: \"With demand in the current sales phase achieving 20 million ticket requests, FIFA has confirmed that fans of the national teams that have qualified for the FIFA World Cup 2026 will benefit from a dedicated ticket pricing tier, which has been designed to make following their teams on football's greatest stage more affordable. \"The newly introduced Supporter Entry Tier will be available at the fixed price of USD 60 per ticket for each of the 104 matches, including the final.\" FIFA had been urged to halt World Cup ticket sales after it emerged countries' most loyal fans faced paying \"extortionate\" prices for tickets, with the cheapest for the final coming in at over £3,000. The cheaper tickets, which will be made available for every game at the tournament in North America, will be given to the national federations whose teams are playing. It will then be up to those federations to decide how to distribute them to loyal fans who have likely attended previous games at home and on the road. Posting on social media, Prime Minister Keir Starmer welcomed the move but said \"as someone who used to save up for England tickets, I encourage FIFA to do more to make tickets more affordable so that the World Cup doesn't lose touch with the genuine supporters who make the game so special\". Sports correspondent This is FIFA caving into criticism like rarely before under Gianni Infantino. It has still not shut down the outcry at the cost of going to the World Cup. \"We have listened to feedback,\" a senior FIFA official acknowledged to Sky News.\nSuddenly cutting World Cup ticket prices amid a growing fan backlash is a significant climbdown.\nFIFA admitted it got it wrong by pricing tickets too high.\n Groups, including England's Football Supporter's Association, said last week it was \"scandalous\" its cheapest group stage tickets in the United States would cost about £165 ($265) and the cheapest for the final £3,130.\nNow, FIFA says there will be $60 (£45) tickets for every match. The US-Canada-Mexico bid book ahead of the 2018 FIFA vote said the cheapest tickets would be $21.\n \"This new category is the right thing to do,\" the FIFA official close to talks said.\nBut only 10% of the allocation for each team will be made available at the new cheaper entry point. \nSo for England's opener against Croatia, there could only be 750 tickets at £45. The Dallas stadium has a capacity of 94,000.\n It will be for the FAs to work out who should receive these cheapest tickets from their fan base.\nThe men's World Cup is FIFA's main source of income every four years – with revenue of $13bn (£9.75bn) across the 2023-26 cycle.\n It helps to fund expanding women's and youth tournaments as well as draws, conferences and award ceremonies.\nAnd this U-turn overshadowed one of their glitziest nights of the year – the FIFA Best awards in Qatar. \nThat was one FIFA event supporters couldn't buy a ticket to - for any price.\n The news shows how the organisation is continuing its weeks-long move to back away from using dynamic pricing for all 2026 World Cup tickets. FIFA did not specify exactly why it so dramatically changed strategy, but said the lower prices are \"designed to further support travelling fans following their national teams across the tournament\". Read more from Sky News:The politics behind FIFA's reshaped Club World CupUnapologetically political - a World Cup draw like no other Prices for England's fixtures at the tournament in the USA, Canada and Mexico were revealed last week, with the cheapest ticket for the final - should England, one of the home nations reach that stage - costing between $4,185 (£3,120) and $8,680 (£6,471) for members of the England Supporters' Travel Club. Outrage over such high prices was made worse due to co-hosts having pledged eight years ago to have hundreds of thousands of $21 (£15.64) tickets. In another climbdown, FIFA has also announced that fans applying through the participating member association's tickets allocation whose teams do not advance to the knockout phase will have the administrative fee waived when refunds are processed for unsuccessful applications. Fan anger had intensified when it became clear that fans who wanted to reserve a ticket for all of their team's potential games - through the final - would not get refunded if their teams didn't make it to the final until after the tournament. The World Cup in North America will be the first edition that features 48 teams - up from 32 - and is expected to earn FIFA at least $10bn (£7.4bn) in revenue."
    },
    {
        "title": "Couple win second £1m lottery – beating 24-trillion-to-one odds",
        "description": "A couple are celebrating a second &#163;1m National Lottery win after they beat 24-trillion-to-one odds of them winning both the EuroMillions Millionaire Maker and then five numbers and the bonus ball on the Lotto.",
        "url": "https://news.sky.com/story/couple-win-second-1631m-lottery-8211-beating-24-trillion-to-one-odds-13484525",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-lottery-winners_7112474.jpg?20251216220336",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-16 20:45:00",
        "Headline": "Richard Davies and Faye Stevenson-Davies celebrated their first £1m win in 2018. The couple credit the power of positive thinking for their lottery wins.",
        "Content": "A couple are celebrating a second £1m National Lottery win after they beat 24-trillion-to-one odds of them winning both the EuroMillions Millionaire Maker and then five numbers and the bonus ball on the Lotto. Richard Davies, 49, and Faye Stevenson-Davies, 43, celebrated their first £1m win in June 2018. The couple credit the power of positive thinking for their win. Ms Stevenson-Davies said: \"We always believed winning was possible, and once we scooped £1m and met hundreds of other lucky winners, we realised fairy tales do come true and there are winners everywhere! \"We knew the odds of it happening again were outrageous, but we're proof that if you believe, anything is possible.\" While rare, double wins have happened before. Neither partner fancies early retirement Before their first win, Mr Davies worked as a hairdresser and Ms Stevenson-Davies worked as a mental health nurse. Ms Stevenson-Davies used the 2018 win to return to university, gaining a second degree in counselling and therapeutic practice, while her other half hung up his scissors. Since then, Mr Davies has started working seven days a week as a parcel courier after originally helping a friend out by doing the work just a couple days per week. Ms Stevenson-Davies is utilising her new degree and now has her own practice and also provides counselling services for local organisations including Brecon & District Mind charity and The DPJ Foundation. Mr Davies said: \"Everyone keeps asking what we'll do in the future, and we genuinely have no idea at present. \"The first time around we gifted people cars, we donated a minibus to the local rugby team, and did our best to help friends and family, it was all new and it was amazing to be able to make a difference. \"This time, who knows, we'll take our time and enjoy the moment.\" How the couple managed it Mr Davies said: \"This win was not as simple as buying the winning ticket, it came to us through a series of four consecutive Lotto draws!\" Richard explained how \"when you match two numbers in the Lotto draw, you automatically win a Lucky Dip for the next game and that's what's happened to us. \"We matched two numbers and won a free Lucky Dip from the draw on the 15 [November], which put us into the next draw and so on, until the winning draw on Wednesday 26 November.\" More from Sky News:FIFA announces £45 World Cup tickets in price climbdownObamas planned to see Reiners the night they were killed While another win was always a real possibility for the positive pair, they had other motivations for playing too. Ms Stevenson-Davies said: \"We've also seen first-hand, through our volunteering at projects that have received vital National Lottery funding, the impact players make.\" While the couple could easily swap Mid-Wales for Mauritius this Christmas, the community-minded pair have other plans. Mr Davies will continue to work seven days a week so that everyone gets their Christmas deliveries, while Ms Stevenson-Davies is offering mental health support to her clients across the festive period, including Christmas Day. Andy Carter, senior winner's adviser at Allwyn, the operator of The National Lottery, said: \"With a £15m Must Be Won Christmas Eve Lotto Draw, there is guaranteed to be more big winners, so if ever there was a time to believe in festive magic, now's the time.\""
    },
    {
        "title": "Five arrested over plot to steal 'tonnes' of charity clothes to fund crime",
        "description": "Police have arrested five men over a conspiracy to steal \"tonnes\" of clothing from charity clothes banks to sell abroad and fund criminal activity.",
        "url": "https://news.sky.com/story/five-arrested-over-plot-to-steal-tonnes-of-charity-clothes-to-fund-crime-13484492",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-stolen-clothes-essex-police_7112332.jpg?20251216180731",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-16 18:00:00",
        "Headline": "Police said donated clothing was taken from public collection banks and sold overseas, with the proceeds linked to other criminal activity.",
        "Content": "Police have arrested five men over a conspiracy to steal \"tonnes\" of clothing from charity clothes banks to sell abroad and fund criminal activity. Essex Police said items donated by members of the public were being taken from collection containers, particularly those in town and city centres where large quantities of clothes can be removed at once. Officers from the force's Proactive Money Laundering Team (PMLT) believe the group was selling the clothing overseas to finance further crimes or launder money to conceal their offending. A dozen addresses in Basildon and Thurrock in Essex, as well as locations across London, were raided on Tuesday in connection with the scheme and an alleged Lithuanian organised crime group, police said. The five men, all arrested on suspicion of theft and currently in custody, are a 46-year-old from Pitsea, a 38-year-old from South Ockendon, a 34-year-old and a 32-year-old from Dagenham in east London, and a 30-year-old from Purfleet. During the raids, officers seized multiple mobile phones and large amounts of cash, including £10,000 from a vehicle and a further unconfirmed sum of more than £10,000 from a bedroom at one property. Police said the money is believed to be linked to criminal activity. \n                  Deported migrant sex offender given £500 to leave country\n                 \n                  David Lammy to face Commons grilling over wrongly released migrant sex offender\n                 \n                  Migrant mistakenly released from prison arrested after police manhunt\n                 Detective Sergeant Mike Monkton, of the Proactive Money Laundering Team, said the scale of the alleged thefts was significant. Read more from sky News:Boy arrested on suspicion of murdering nine-year-old girlStephen Lawrence's killer David Norris denied parole \"The scale of these thefts is huge - criminals are taking tonnes and tonnes of clothing from sites nationwide that were intended to help others or raise money for those in need,\" he said. \"Instead, it was being used to line the pockets of criminals operating across Europe.\" The warrants, which took place simultaneously on Tuesday morning, \"are a huge disruption to the operation\", Mr Monkton said. They will \"ultimately help us take criminal property off our streets, reduce crime in our neighbourhoods and send a clear message that there will be consequences for anyone committing these offences in our county\", he added."
    },
    {
        "title": "Domestic abuse and sexual violence survivors to get specialist NHS help",
        "description": "Domestic abuse and sexual violence survivors will have access to specialist NHS services across England, the government has announced.",
        "url": "https://news.sky.com/story/domestic-abuse-and-sexual-violence-survivors-to-get-specialist-nhs-help-13484491",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-domestic-abuse-domestic-violence_7112506.jpg?20251216223254",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-16 17:46:00",
        "Headline": "The initiative is part of the government's aim to halve violence against women and girls in a decade.",
        "Content": "Domestic abuse and sexual violence survivors will have access to specialist NHS services across England, the government has announced. As part of Labour's manifesto pledge to halve violence against women and girls (VAWG) in a decade, a new referral service will be launched to connect victims with specialist help through their GP. The \"steps to safety\" initiative will be launched in every area of England by 2029 to \"end the postcode lottery\" in support for victims and survivors, the government said. GP practice staff will also be offered training in all regions so they can better identify and respond to domestic abuse and sexual violence. Child sexual abuse survivors, both boys and girls, will also have access to specialist \"trauma-informed care\" based on the \"child house\" model. This is where different agencies, including police, health, social care and therapy services, are brought together to provide coordinated support for the child and their family. It means children only need to share their experiences once, rather than reliving their abuse through repeated interviews with different agencies. \n                  Specialist teams and online investigators deployed across England and Wales to tackle 'national emergency' of violence against women and girls\n                 \n                  Families of women who died after violence demand reform\n                 \n                  Claire Inglis: Call for 'damning' report into mother's murder to be fully released\n                 Based on US and Icelandic models, there is currently only one in the UK, the Lighthouse in north London, but the government said it will expand the model to all NHS regions in England. They will be funded by up to £50m from the government. Last week, Home Secretary Shabana Mahmood announced specialist investigation teams for rape and sexual offences will be created across England and Wales. The use of Domestic Abuse Protection Orders (DAPOs), which have been trialled in several areas, will also be rolled out across England and Wales. They are designed to target abusers by imposing curfews, electronic tags and exclusion zones. The orders cover all forms of domestic abuse, including economic abuse, coercive and controlling behaviour, stalking and 'honour'-based abuse. Breaching the terms can carry a prison term of up to five years. Read more:Violence against women and girls grows despite government strategies Nearly £2m will also be spent funding a network of officers to target offenders operating within the online space. Teams will use covert and intelligence techniques to tackle violence against women and girls via apps and websites. Ms Mahmood called violence against women and girls a \"national emergency\" ahead of unveiling the government's VAWG strategy on Thursday, after being delayed three times this year."
    },
    {
        "title": "Second Horizon victim Janet Skinner 'forced' to sue Post Office as she seeks full redress for wrongful conviction",
        "description": "A victim of the Post Office Horizon IT scandal is taking legal action against the government-owned organisation as she seeks full redress for her wrongful conviction.",
        "url": "https://news.sky.com/story/second-horizon-victim-janet-skinner-forced-to-sue-post-office-as-she-seeks-full-redress-for-wrongful-conviction-13484489",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-janet-skinner-post-office_6418499.jpg?20240111160240",
        "type": "UK",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-12-16 17:40:00",
        "Headline": "Barring a \"sea change\", a solicitor for Post Office victims said more people will sue the government-owned company.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n A victim of the Post Office Horizon IT scandal is taking legal action against the government-owned organisation as she seeks full redress for her wrongful conviction. Janet Skinner is believed to be only the second victim to sue the Post Office. The former subpostmistress has been \"forced\" to take the state-owned business to court, her solicitor told Sky News. Money blog: Oil hit lowest since 2021 with possible impact on filling your car Ms Skinner has been a campaigner for victims of the faulty Horizon software for nearly two decades. Around 1,000 people were wrongly prosecuted and convicted throughout the UK between 1999 and 2015 as a result of Horizon. Despite having her conviction for false accounting overturned in 2021, Ms Skinner has yet to receive a final payment, has been given an insufficient interim sum and is being asked for six different expert reports, said lawyer Simon Goldberg. \n                  Appeal court delay for first Capture case as Post Office requests extension\n                 \n                  Post Office scandal: Police consider corporate manslaughter charges\n                 \n                  Conviction linked to third 'faulty' Post Office system referred to Court of Appeal\n                 Ms Skinner is taking legal action in an attempt to see the issue resolved. \"There's no sign of resolution. We're only forced to do it because enough is enough,\" Mr Goldberg said. \"It's cruel and traumatic beyond belief that she should still have to be fighting.\" Ms Skinner's claim should have been settled within 12 months of the conviction being overturned, he said. Mr Goldberg added the interim offers are not in keeping with the recommendations of retired High Court judge Sir Wyn Williams, who presided over the public inquiry into the scandal. Both the Post Office and the Department for Business and Trade, which administers all but one of the victims' redress schemes, said in October they would \"always apply a generous approach\" to assessing redress. But Ms Skinner was initially offered a payment worth only 15% of her total claim. \"They've [claim assessors] clearly tried to grind her down and make her give up, and we're not playing,\" her solicitor said. More legal action to come? While Ms Skinner is believed to be only the second victim to launch a civil case against the Post Office, she may not be the last. A postmaster made famous after being portrayed in the ITV drama Mr Bates vs the Post Office, Lee Castleton became the first to take such action in March. \"Unless there's a sea change, there will definitely be more claims,\" Mr Goldberg said. Ms Skinner was given a nine-month custodial sentence in 2007 after the Horizon computer programme, made by Fujitsu, incorrectly generated a £59,000 shortfall. She was imprisoned when her two children were in their teens, released with an ankle monitor tag, and sold her house when it was due to be repossessed. Amid the ordeal, Ms Skinner suffered a neurological collapse and was left paralysed from the neck down. She has had to regain the ability to walk. A Post Office spokesperson said: \"We recognise the devastating impact of the Horizon IT Scandal on former postmasters like Ms Skinner and would like to unequivocally apologise for her experiences. \"Responsibility for Ms Skinner's redress claim moved to the Department for Business and Trade in June 2025. \"We cannot comment on ongoing legal proceedings but once we receive the claim, we will engage fully in the process.\""
    },
    {
        "title": "The untrained mercenaries being tricked into fighting Russia's war in Ukraine",
        "description": "A South African man, with eyes darkened by sleepless nights, tells us his older brother was lured into fighting for Russia on the frontline in Ukraine's raging Donbas region.",
        "url": "https://news.sky.com/story/the-untrained-mercenaries-being-tricked-into-fighting-russias-war-in-ukraine-13484263",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-yousra-elbagir-south-africa_7112069.png?20251216134846",
        "type": "World",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-12-16 12:35:00",
        "Headline": "Men are fighting on the frontline of a war they have no stake in, with weapons they have little training to wield. Sky News examines how South Africans are being tricked into joining Russians on the frontline in Ukraine.",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n A South African man, with eyes darkened by sleepless nights, tells us his older brother was lured into fighting for Russia on the frontline in Ukraine's raging Donbas region. \"To them, it's a suicide mission because they have never been trained for the military. They don't have military training - they don't have military experience,\" says Bongani, whose name we have changed for his safety. In the hidden back garden of a modest hotel in KwaZulu-Natal province, he continues: \"They don't have experience of any war. They are just bodyguards who want to get a job and provide for their families. That's all.\" Bongani says his brother travelled to Russia on a flight via Dubai after being told he would be receiving bodyguard training along with at least 16 other South African men. After signing a contract in Russian, their fate was sealed. \"The problems started when they were moved from Russia to Ukraine, and they asked them: 'Guys - where are we going now because we are here for training?' \"And then the Russians said: 'Training for what? We don't know anything about training - what we know is that you've signed the contract. You are under our command now - under the Russian army.'\" How is this happening? Sky News has seen harrowing SOS video messages from South African men who describe entrapment and deployment to the frontline in Ukraine. In one video, a man in military fatigues details the moment they signed their contracts. He claims Duduzile Zuma-Sambudla, the daughter of former South African President Jacob Zuma, encouraged them to sign away their lives. \"We refused to sign the contract forms because it was written in Russia, which we didn't understand. We asked them for a translator - someone who can translate the language. They said there was no network,\" he says in fluent English. \"That is when Duduzile came with a guy by the name of Khosa. She said we must sign the contract because it is the same thing they did. Duduzile said she is doing the same course we are doing, the same training, and that unfortunately she won't be with us because she is training somewhere else.\" \"Yes, we agreed. We did sign the forms because we trust the lady, Duduzile.\" Duduzile Zuma-Sambudla is accused of trafficking South African men - including eight of her own relatives - for mercenary recruitment by her half-sister Nkosazana Bonganini Zuma-Mncube, who has filed police charges against her. She denies the allegations and says she was a victim of deception, misrepresentation, and manipulation. The South African Police Service (SAPS) say they are currently investigating the charges. Duduzile Zuma-Sambudla has resigned as a member of parliament and has not responded to our request for comment. Five hours away in Johannesburg's Gauteng province, we watched as another case of suspected mercenary recruitment played out in a South African magistrate's court. Five suspects were ushered out into a crowded courtroom in Kempton Park after being arrested on their way out of Johannesburg's Oliver R Tambo airport following a tip-off to the police that they were allegedly travelling to Russia via the United Arab Emirates. The line-up is sullen as the three young men on one end of the stand look down at their hands. The youngest is only 21 years old. At the other end of the stand is a 39-year-old woman called Patricia Mantuala, who stands accused of recruiting them. The five suspects were eventually granted bail by the court after a postponed hearing. Read more from Sky News:G20 overshadowed by UkraineAlleged mercenary arrested in LondonIs time running out for Ukraine? Colonel Katlego Mogale, a spokesperson for the Directorate for Priority Crime Investigation (DPCI), also known as the HAWKS, told Sky News and other journalists in a news conference that they are not ruling out the possibility that more suspects will be arrested. Amid signs of a growing recruitment drive, the families of those who say they are trapped fighting for Russia in Ukraine are advocating for their loved ones to return home - against all odds. \"You are dealing with people who are well known in South Africa and in South Africa nobody's safe and we may never know what's going to happen next to us,\" says Bongani. \"What's going to happen to our family?\""
    },
    {
        "title": "Imran Khan being held in 'death cell', his sons say",
        "description": "The sons of former Pakistani prime minister Imran Khan have said they fear they might never see their father again as he is being \"psychologically tortured\" in a \"death cell\".",
        "url": "https://news.sky.com/story/imran-khans-sons-fear-they-may-never-see-him-again-as-former-pakistan-pm-held-in-death-cell-13484410",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-imran-sons-yalda-hakim-show_7112285.jpg?20251216165153",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-16 14:55:00",
        "Headline": "Kasim Khan tells The World with Yalda Hakim: \"It's getting harder to see a route out at this point. We're trying to have faith. But at the same time, right now, the conditions are getting worse.\"",
        "Content": "The sons of former Pakistani prime minister Imran Khan have said they fear they might never see their father again as he is being \"psychologically tortured\" in a \"death cell\". Speaking to Sky News' The World with Yalda Hakim, Kasim and Sulaiman Khan said they had not spoken to their father, who has been in prison since August 2023, for months. Kasim described the conditions the former Pakistani leader has been kept in, saying: \"He's been in a solitary confinement cell for over two years where he's had filthy water, he is around inmates who are dying of hepatitis, the conditions are disgusting and also he is completely isolated from any human contact.\"   He continued: \"It's getting harder to see a route out at this point. We're trying to have faith. But at the same time, right now, the conditions are getting worse. \"It's very hard to see a way out… We're now worried we might never see him again.\" \n                  How did a viral deepfake stoke tensions between India and Pakistan? \n                 \n                  Imran Khan vs the military: What's just happened in Pakistan?\n                 \n                  Ex-Pakistan PM Imran Khan sentenced to 14 years in jail in corruption case\n                 Kasim said his father was being subjected to \"psychological torture tactics\" as even the prison guards were not allowed to communicate with Imran Khan, who led the country between 2018 and 2022. Sulaiman said his father's cell, where he allegedly spends 23 hours a day, has been described as a \"death cell\". He said an army spokesperson announced on Friday that Imran Khan, who has in the past been shot three times, was now officially in full isolation. He added that his father was being kept in \"completely substandard conditions that don't meet international law for any sort of prisoner\". The brothers' words echo what one of Imran Khan's sisters reported after being allowed to meet the former cricketer in prison at the start of the month. Uzma Khanum said at the time that her brother was facing isolation and psychological strain in prison following weeks in which his family said access had been blocked. The former leader has been in jail since his August 2023 arrest after he was handed a three-year prison term for illegally selling state gifts. He was convicted in a string of cases that he says were politically driven following his ousting in a 2022 parliamentary vote. Kasim said his father would \"never take a deal and leave all of his other party members in jail to die and fester in these jails... instead he stays in those conditions, happy to rot and it means that he can move towards his goal of ridding Pakistan of corruption, a goal that he has stated to us a million times\". Speaking on The World with Yalda Hakim on Tuesday, Mosharraf Zaidi, a spokesperson for Pakistan's PM, denied allegations Imran Khan was being kept in solitary confinement. He told Sky News Imran Khan had been in prison for about 860 days and had 870 visits, despite the fact he is supposed to get one visit per week. Before launching his political career, Imran Khan was best known as a star of international cricket and for leading Pakistan to Cricket World Cup victory in 1992."
    },
    {
        "title": "FIFA announces £45 World Cup tickets in climbdown after outcry over pricing",
        "description": "FIFA has announced \"more affordable\" tickets for all 104 matches at next year's World Cup after an outcry over pricing.",
        "url": "https://news.sky.com/story/fifa-announces-more-affordable-world-cup-tickets-after-outcry-over-pricing-13484459",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-world-cup-2026-fifa_7112359.jpg?20251216184602",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-16 18:14:00",
        "Headline": "The number of cheaper tickets for each game is likely to be in the hundreds, rather than thousands.",
        "Content": "FIFA has announced \"more affordable\" tickets for all 104 matches at next year's World Cup after an outcry over pricing. The cheapest tickets will now be on offer from $60 (£45) as part of a new \"Supporter Entry Tier\" which will be available specifically to supporters of qualified teams. However, only 10% of participating member association's allocated tickets will fall under this most affordable category. As a result, the number of $60 tickets for each game is likely to be in the hundreds, rather than thousands.  Supporter value tier prices will apply to 40% of their tickets with the remaining 50% being split evenly between supporter standard tier and supporter premier tier. Ronan Evain, the executive director of Football Supporter's Europe (FSE), a group that represents the interests of supporters in European football, said the group was \"looking at the FIFA announcement as nothing more than an appeasement tactic due to the global negative backlash\". He added: \"This shows that FIFA's ticketing policy is not set in stone, was decided in a rush, and without proper consultation - including with FIFA's own member associations.\" While he welcomed FIFA's \"seeming recognition of the damage its original plans were to cause\", he insisted \"the revisions do not go far enough to reconcile\" the harm done. In a statement, FIFA said: \"With demand in the current sales phase achieving 20 million ticket requests, FIFA has confirmed that fans of the national teams that have qualified for the FIFA World Cup 2026 will benefit from a dedicated ticket pricing tier, which has been designed to make following their teams on football's greatest stage more affordable. \"The newly introduced Supporter Entry Tier will be available at the fixed price of USD 60 per ticket for each of the 104 matches, including the final.\" FIFA had been urged to halt World Cup ticket sales after it emerged countries' most loyal fans faced paying \"extortionate\" prices for tickets, with the cheapest for the final coming in at over £3,000. The cheaper tickets, which will be made available for every game at the tournament in North America, will be given to the national federations whose teams are playing. It will then be up to those federations to decide how to distribute them to loyal fans who have likely attended previous games at home and on the road. Posting on social media, Prime Minister Keir Starmer welcomed the move but said \"as someone who used to save up for England tickets, I encourage FIFA to do more to make tickets more affordable so that the World Cup doesn't lose touch with the genuine supporters who make the game so special\". Sports correspondent This is FIFA caving into criticism like rarely before under Gianni Infantino. It has still not shut down the outcry at the cost of going to the World Cup. \"We have listened to feedback,\" a senior FIFA official acknowledged to Sky News.\nSuddenly cutting World Cup ticket prices amid a growing fan backlash is a significant climbdown.\nFIFA admitted it got it wrong by pricing tickets too high.\n Groups, including England's Football Supporter's Association, said last week it was \"scandalous\" its cheapest group stage tickets in the United States would cost about £165 ($265) and the cheapest for the final £3,130.\nNow, FIFA says there will be $60 (£45) tickets for every match. The US-Canada-Mexico bid book ahead of the 2018 FIFA vote said the cheapest tickets would be $21.\n \"This new category is the right thing to do,\" the FIFA official close to talks said.\nBut only 10% of the allocation for each team will be made available at the new cheaper entry point. \nSo for England's opener against Croatia, there could only be 750 tickets at £45. The Dallas stadium has a capacity of 94,000.\n It will be for the FAs to work out who should receive these cheapest tickets from their fan base.\nThe men's World Cup is FIFA's main source of income every four years – with revenue of $13bn (£9.75bn) across the 2023-26 cycle.\n It helps to fund expanding women's and youth tournaments as well as draws, conferences and award ceremonies.\nAnd this U-turn overshadowed one of their glitziest nights of the year – the FIFA Best awards in Qatar. \nThat was one FIFA event supporters couldn't buy a ticket to - for any price.\n The news shows how the organisation is continuing its weeks-long move to back away from using dynamic pricing for all 2026 World Cup tickets. FIFA did not specify exactly why it so dramatically changed strategy, but said the lower prices are \"designed to further support travelling fans following their national teams across the tournament\". Read more from Sky News:The politics behind FIFA's reshaped Club World CupUnapologetically political - a World Cup draw like no other Prices for England's fixtures at the tournament in the USA, Canada and Mexico were revealed last week, with the cheapest ticket for the final - should England, one of the home nations reach that stage - costing between $4,185 (£3,120) and $8,680 (£6,471) for members of the England Supporters' Travel Club. Outrage over such high prices was made worse due to co-hosts having pledged eight years ago to have hundreds of thousands of $21 (£15.64) tickets. In another climbdown, FIFA has also announced that fans applying through the participating member association's tickets allocation whose teams do not advance to the knockout phase will have the administrative fee waived when refunds are processed for unsuccessful applications. Fan anger had intensified when it became clear that fans who wanted to reserve a ticket for all of their team's potential games - through the final - would not get refunded if their teams didn't make it to the final until after the tournament. The World Cup in North America will be the first edition that features 48 teams - up from 32 - and is expected to earn FIFA at least $10bn (£7.4bn) in revenue."
    },
    {
        "title": "Paris Saint-Germain ordered to pay Kylian Mbappe €60m  French court rules",
        "description": "French football champions Paris Saint-Germain have been ordered to pay former player Kylian Mbappe 60 million euros (&#163;52.6m) by a Paris court.",
        "url": "https://news.sky.com/story/paris-saint-germain-ordered-to-pay-kylian-mbappe-836460m-french-court-rules-13484416",
        "image_url": "https://e3.365dm.com/23/11/1920x1080/skynews-newcastle-psg-champions-league_6376402.jpg?20231129115950",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-16 14:59:00",
        "Headline": "Mbappe's lawyers have welcomed the verdict, while PSG said \"it will comply with\" the order \"while reserving the right to appeal\".",
        "Content": "French football champions Paris Saint-Germain have been ordered to pay former player Kylian Mbappe 60 million euros (£52.6m) by a Paris court. A Paris labour court found on Tuesday that Mbappe was due three months in unpaid wages, as well as an ethics bonus and a signing bonus, under his employment contract with PSG. It was noted that the sums were recognised by the French Professional Football League (LFP) in September and October 2024, and that there was no evidence of an agreement showing that Mbappe had waived his entitlement to them. Judges thus rejected the club's argument that the 26-year-old French forward should forfeit unpaid wages entirely, but did dismiss his additional claims of concealed work, moral harassment and breach of the employer's duty of safety. Speaking to reporters after the verdict, Mbappe's lawyer Frederique Cassereau said: \"We are satisfied with the ruling. This is what you could expect when salaries went unpaid.\" In a statement, his legal team also said: \"This judgment confirms that commitments entered into must be honoured. It restores a simple truth: even in the professional football industry, labour law applies to everyone.\" PSG 'reserving right to appeal' \n                  FIFA announces £45 World Cup tickets in climbdown after outcry over pricing\n                 \n                  PSG's Qatari owner adds to squad with swoop on Belgian side\n                 \n                  Former West Ham captain and manager Billy Bonds dies aged 79\n                 PSG said in a statement that it \"takes note of the ruling handed down by the Paris labour court, which it will comply with, while reserving the right to appeal\". The statement added: \"Paris Saint-Germain has always acted in good faith and with integrity, and will continue to do so. \"The club is now looking to the future, built on unity and collective success, and wishes the player all the best for the remainder of his career.\" Now playing for Real Madrid, Mbappe had taken PSG to court over earnings he said were withheld for April, May and June 2024 - before he left the club for Spain on a free transfer. Lawyers for the striker argued he was owed more than 260m euros (£227m), and that his fixed-term contract should be reclassified as a permanent one. Judges on Tuesday did not view Mbappe's contract with PSG as a permanent one, which limited the scale of possible compensation. Read more from Sky News:Passenger jet and US Air Force aircraft in near miss by VenezuelaAngry Messi fans rip up seats and invade pitch as India tour begins PSG argued that Mbappe had acted disloyally by concealing for nearly a year his intention not to renew his contract, and sought 440m euros (£385m) over damages and a \"loss of opportunity\" after he left on a free transfer. In the last year of his contract, he was linked with a world record transfer to Saudi Arabian football club Al Hilal, which Sky Sports News reported at the time to be worth £259m. PSG signed Mbappe on loan with a mandatory purchase option of 180m euros (£165.7m) from AS Monaco in 2017, making him the second-most expensive player and most expensive teenage footballer in history. While playing for the Parisians, he won six league titles and scored 256 goals in all competitions, making him the club's all-time top goal scorer."
    },
    {
        "title": "US military says eight 'narco-terrorists' killed in strikes on three boats in Pacific",
        "description": "Eight people have been killed in US military strikes on three boats it has accused of smuggling drugs in the Pacific Ocean.",
        "url": "https://news.sky.com/story/us-military-says-eight-narco-terrorists-killed-in-strikes-on-three-boats-in-pacific-13484078",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-us-military-southern-command_7111894.jpg?20251216112907",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-16 08:34:00",
        "Headline": "No evidence the vessels were involved in drug trafficking has been given, but a video showing the strikes on the boats was posted online by the US military.",
        "Content": "Eight people have been killed in US military strikes on three boats it has accused of smuggling drugs in the Pacific Ocean. The US military's Southern Command said the strikes targeted \"designated terrorist organisations\" killing three \"narco-terrorists\" in the first vessel, two in the second boat and three in the third. No evidence the vessels were involved in drug trafficking has been given, but a video showing the strikes on the boats was posted on social media. Southern Command added that defence secretary Pete Hegseth ordered the strikes, and claimed intelligence confirmed the vessels were using known drug trafficking routes and engaged in drug trafficking. It is unclear where the vessels were from, but the strikes mark the latest in Donald Trump's \"war\" with drug cartels, which has also seen vessels targeted in the Caribbean Sea, including near Venezuela. Over the past several months, the US has been carrying out a large-scale military build-up in the southern Caribbean, with the stated goal of combating drug trafficking. In its first lethal strike on 2 September, the White House posted on X that it had conducted a strike against \"narcoterrorists\" shipping fentanyl to the US, without providing evidence of the alleged crime.  Sky's Data & Forensics unit last week verified that in the four months up to 10 December, 23 boats were targeted in 22 strikes, killing 87 people. US forces also seized a crude oil tanker, named Skipper, off the coast of Venezuela last week. The government in Caracas, led by President Nicolas Maduro, who insists the real purpose of the US military operations is to force him out of office, branded the ship's seizure a \"blatant theft\" and an \"act of international piracy\". Read more from Sky News:Musk is winning the space race - and looks unstoppableTrump wants $10bn in damages over BBC Panorama edit On Monday, Mr Trump signed an executive order declaring fentanyl a \"weapon of mass destruction\". The order instructs the State and Treasury departments to pursue the financial assets of and sanctions on financial institutions and groups involved in fentanyl trafficking. It also calls for greater co-operation between the Pentagon and the Justice Department on fentanyl and drug trafficking issues. The latest strikes on vessels allegedly trafficking drugs come on the eve of briefings on Capitol Hill for all members of Congress as questions mount over the Trump administration's military actions. Mr Hegseth, secretary of state Marco Rubio, and other top national security officials are expected to provide closed-door briefings for politicians in the House and Senate."
    },
    {
        "title": "Brown University shooting: New image and video released of 'person of interest'",
        "description": "Police investigating a deadly shooting at a US university have released a new image and video clips of a \"person of interest\".",
        "url": "https://news.sky.com/story/brown-university-shooting-new-image-and-video-released-of-person-of-interest-13484529",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-brown-suspect-brown-shooteer_7112425.png?20251216211101",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-16 20:54:00",
        "Headline": "A new image and video clips show the movements of a 'person of interest' in the deadly attack that left two students dead and nine injured.",
        "Content": "Police investigating a deadly shooting at a US university have released a new image and video clips of a \"person of interest\". It comes as the manhunt for a gunman who killed two Brown University students and injured nine more in a classroom continued for a fourth day. The shooting on Saturday afternoon unfolded on the first floor of the engineering and physics building while exams were taking place. A law enforcement official said the attacker fired more than 40 rounds from a 9mm handgun in Providence, Rhode Island. The new image showed a man dressed in dark clothing, wearing a black hat and face mask, walking down a street that day. In all of the videos made public, the suspect's face was either covered by a mask or turned away. He is described as stocky and about 5ft 8in (173cm) tall. Authorities have released a video timeline showing the movements of the person of interest, including of him before the attack, in the hope that someone might recognise him. \n                  Film director Rob Reiner's son could face death penalty if found guilty of parents' killings, prosecutors say\n                 \n                  Obamas planned to see Reiners the night they were killed, says ex-US first lady\n                 \n                  Doctor sentenced over Matthew Perry's death\n                 The clips showed a man walking briskly, and at one point running, between 2pm and 3pm local time, along several different streets, about a block away from the building where the attack would later take place. The shooting happened at 4.03pm, and another clip showed the same person from a distance walking from the building's car park towards the street, even as police cars with flashing lights arrived at the scene. The final clip showed the man walking along that street about three minutes after the shooting. Authorities on Sunday released a man who had been detained in connection with the attack. Read more:Video of 'person of interest' in Brown shooting Police have said there was no clear video of the gunman from inside the building. Attorney general Peter Neronha said there were cameras in the newer part but \"fewer, if any, cameras\" where the shooting happened \"because it's an older building\". The attack and the gunman's escape have sparked concerns about campus safety, including the absence of security cameras, and led to calls for improved door locks. More details about victims emerge The students who were killed were Ella Cook, a 19-year-old sophomore from Birmingham, Alabama, and MukhammadAziz Umurzokov, an 18-year-old freshman from Brandermill, Virginia. Ms Cook was vice president of the College Republicans club at Brown University and Mr Umurzokov, whose family came to the US from Uzbekistan when he was a child, was an aspiring neurosurgeon. The Reverend R Craig Smalley described Ms Cook as \"an incredibly grounded, faithful, bright light\" who encouraged and \"lifted up those around her\". In a GoFundMe post, Mr Umurzokov's family described him as \"incredibly kind, funny, and smart\". \"He always lent a helping hand to anyone in need without hesitation, and was the most kind-hearted person our family knew,\" they said."
    },
    {
        "title": "Film director Rob Reiner's son could face death penalty if found guilty of parents' killings, prosecutors say",
        "description": "Rob Reiner's son Nick could face the death penalty if he is found guilty of murdering his parents, Los Angeles prosecutors have said.",
        "url": "https://news.sky.com/story/film-director-rob-reiners-son-could-face-death-penalty-if-found-guilty-of-parents-killings-prosecutors-say-13484543",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nick-reiner-actor_7112544.jpg?20251217002123",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-16 21:49:00",
        "Headline": "Nick Reiner will be charged with two counts of first degree murder over the killings, district attorney Nathan Hochman says. The 32-year-old is suspected in the deaths of the 78-year-old actor and his wife, Michele Singer Reiner.",
        "Content": "Rob Reiner's son Nick could face the death penalty if he is found guilty of murdering his parents, Los Angeles prosecutors have said. Nick Reiner will be charged with two counts of first degree murder over the killings, district attorney Nathan Hochman said. The 32-year-old is suspected in the deaths of the 78-year-old director and his wife, Michele Singer Reiner.   \"Rob Reiner was a brilliant actor and director, an iconic force in our entertainment industry for decades. His wife, Michel Singer Reine, was an equally iconic photographer and producer,\" said Mr Hochman. \"Their loss is beyond tragic. We will commit ourselves to bringing their murderer to justice.\" \n                  Obamas planned to see Reiners the night they were killed, says ex-US first lady\n                 \n                  Rob Reiner spoke to Eric Idle about future before he and wife were killed\n                 \n                  Rob Reiner latest: Son could face death penalty as he's charged over the killings of Rob Reiner and wife Michele, LA police say\n                 Prosecutors said they would file the charges - two counts of first degree murder with a special circumstance of multiple murders, later on Tuesday. They will also include a special allegation he used a dangerous weapon, a knife. Mr Hochman said the charges carry a maximum sentence of life in prison without the possibility of parole or the death penalty, adding \"no decision\" has been made with respect to the death penalty. \"This case is heartbreaking and deeply personal, not only for the Reiner family and their loved ones but for our entire city,\" LA Police chief Jim McDonnell said. \"We will continue to support the Reiner family and ensure that every step forward is taken with care, dignity and resolve.\" Their tributes were a stark contrast to Donald Trump's response to the news, which prompted the US president to attack Mr Reiner as \"tortured and struggling, but once very talented\". In a post on his Truth Social platform, Mr Trump said Mr Reiner and his wife died \"reportedly due to the anger he caused others through his massive, unyielding, and incurable affliction with a mind crippling disease known as TRUMP DERANGEMENT SYNDROME\". Read more: Rob Reiner spoke to Eric Idle about future before he was killed It comes after it emerged Mr Reiner's son was reportedly disruptive at a party hosted by comedian Conan O'Brien the night before the killings. Nick Reiner joined his father and mother at the event on Saturday - and the couple were upset and embarrassed about his behaviour, Sky News' US partner NBC News cited a source as saying. They also expressed concerns about his health. The outlet cited another source saying Nick Reiner's behaviour had made other guests uncomfortable. They said he interrupted a conversation filmmaker Bill Hader was having with two guests and - when informed it was a private conversation - stood still and stared before storming off. The couple were found dead from apparent stab wounds at their home in the Brentwood neighbourhood on the west side of Los Angeles. Nick Reiner did not resist when he was arrested hours later in the Exposition Park area, near the University of Southern California, around four miles from the crime scene, police said. He had been expected to make an initial court appearance earlier on Tuesday, but his attorney said he was not brought from jail to the courthouse for medical reasons, and the appearance would not happen before Wednesday. Nick Reiner has not yet entered a plea. Rob Reiner was a celebrated director, whose work included some of the most memorable films of the 1980s and 1990s, including This Is Spinal Tap, The Princess Bride, When Harry Met Sally and A Few Good Men. He met Michele Singer in 1989, while directing When Harry Met Sally, and they had three children together. Michele used to work as a photographer and took the photo of Donald Trump that appears on the cover of his book Trump: The Art Of The Deal."
    },
    {
        "title": "Obamas planned to see Reiners the night they were killed, says ex-US first lady",
        "description": "Michelle Obama says she and husband Barack Obama were due to see director Rob Reiner and his photographer wife Michele Reiner the night they were killed.",
        "url": "https://news.sky.com/story/obamas-planned-to-see-reiners-the-night-they-were-killed-says-ex-us-first-lady-13484461",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-obama-michelle_7112262.png?20251216174657",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-16 16:05:00",
        "Headline": "The Reiners' son, Nick, 32, has been arrested on suspicion of murder and was held in custody.",
        "Content": "Michelle Obama says she and husband Barack Obama were due to see director Rob Reiner and his photographer wife Michele Reiner the night they were killed. The former US first lady has paid tribute to the couple, who were found stabbed to death in their Los Angeles home on Sunday night. The Reiners' son, Nick, 32, was arrested and will be charged with two counts of first-degree murder in the killing of his parents. Speaking on Jimmy Kimmel Live, Ms Obama said of the Hollywood couple: \"We've known them for many, many years, and we were supposed to be seeing them that night.\" Rob Reiner was active in politics, supporting liberal causes. Ms Obama's comments came after Donald Trump suggested the 78-year-old died because of his anti-Trump views. He referred to the director as \"tortured and struggling\" and said he and his 68-year-old wife had died \"reportedly due to the anger he caused\" by opposing the Republican president. \n                  Man detained indefinitely after 'furiously and repeatedly' stabbing 11-year-old girl\n                 \n                  Mother jailed after 'losing her temper' and killing her three-month-old daughter\n                 \n                  Man found guilty of attempted murder over relentless train attack\n                 Reiners were 'not deranged' Ms Obama said: \"Let me just say this, unlike some people, Rob and Michele Reiner are some of the most decent, courageous people you ever want to know. \"They are not deranged or crazed. What they have always been are passionate people in a time when there's not a lot of courage going on.\" The former first lady highlighted how caring the couple were; stating they cared about their family, country and fairness and equality. In a post on Truth Social, Mr Trump suggested the Reiners died \"reportedly due to the anger he caused others through his massive, unyielding and incurable affliction with a mind crippling disease known as Trump derangement syndrome\". \"He was known to have driven people crazy by his raging obsession of President Donald J Trump, with his obvious paranoia reaching new heights as the Trump Administration surpassed all goals and expectations of greatness, and with the Golden Age of America upon us, perhaps like never before.\" Rob Reiner was known for directing some of the most-loved films of the 1980s and 1990s, including the rom-com When Harry Met Sally and the legal thriller A Few Good Men. Tributes pour in Former US presidents Joe Biden, Barack Obama and Bill Clinton as well as former US speaker Nancy Pelosi also paid tribute to the director. Mr Obama added: \"Beneath all of the stories he produced was a deep belief in the goodness of people - and a lifelong commitment to putting that belief into action.\" Among the other high-profile figures paying tribute was actress Jamie Lee Curtis, who played Reiner's ex-wife in the hit comedy series New Girl. She said: \"I will always remember them as they lived. Passionate. Political. Surrounded by family and friends.\" US actor Kevin Bacon, who starred in A Few Good Men, appeared emotional in a video he shared on Instagram, praising the director for giving him the role. Bacon said: \"The making of that movie was one of the best experiences that I've ever had on a set. \"It was a magical time. So, I'm just sending love to everybody that knew him, because I know that everyone's hurting today.\" Read more from Sky News:Stephen Lawrence killer denied parolePassenger plane and US Air Force aircraft in near miss Reiner's other films included The Princess Bride (1987), Ghosts Of Mississippi (1996) The Story Of Us (1999), The Magic Of Belle Isle (2012) and LBJ (2016). Actress and activist Jane Fonda said she was \"reeling with grief\" in a post on Instagram, while Stephen King, whose books were adapted into Reiner's 1986 Stand By Me and 1990's Misery, said he was \"horrified and saddened\" by the death of the Reiners."
    },
    {
        "title": "Doctor sentenced over Matthew Perry's death",
        "description": "A doctor has been sentenced to eight months of home confinement over the fatal overdose of Friends star Matthew Perry after pleading guilty to a drugs charge.",
        "url": "https://news.sky.com/story/doctor-sentenced-over-matthew-perrys-death-13484357",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mark-chavez-matthew-perry_6943977.jpg?20250617003152",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-16 13:59:00",
        "Headline": "Mark Chavez, 55, pleaded guilty to one count of conspiracy to distribute ketamine.",
        "Content": "A doctor has been sentenced to eight months of home confinement over the fatal overdose of Friends star Matthew Perry after pleading guilty to a drugs charge. Mark Chavez, whose sentence included three years of supervised release, addressed the judge on Tuesday, saying he had recently lost a loved one and understood the grief that Perry's death caused. \"I just want to say my heart goes out to the Perry family,\" he added. Mr Chavez admitted to selling ketamine to another doctor, Salvador Plasencia, who supplied ketamine to Perry.  Plasencia contacted Chavez, 55, after learning that Perry, whose history of drug addiction was well documented, was interested in obtaining ketamine. In text messages, Plasencia told Chavez - who previously ran a ketamine clinic - \"I wonder how much this moron will pay\" and \"Lets [sic] find out\". \n                  Doctor to plead guilty to giving Matthew Perry ketamine before Friends star suffered fatal overdose\n                 \n                  Lisa Kudrow says the cast of Friends only met up once after hit show ended - as she speaks about Matthew Perry's death\n                 \n                  Matthew Perry: Courteney Cox pays tribute to Friends co-star a year on from his death\n                 Chavez, who pleaded guilty to one count of conspiracy to distribute ketamine, admitted in his plea agreement to diverting ketamine from his former clinic to sell to Plasencia. He also admitted to making false representations to a wholesale ketamine distributor in a bid to get more of the drug for Plasencia, submitting a bogus prescription in the name of a former patient without her knowledge or consent. Plasencia was introduced to Perry in September 2023 by one of his patients, who described the actor as a \"high profile person\" willing to pay \"cash and lots of thousands\" for ketamine. The same day they met, the doctor contacted Chavez, and drove to Costa Mesa to purchase $795 (£590) in ketamine vials and tablets, syringes, and gloves from him. Plasencia then drove to Perry's Los Angeles home, injected the star with ketamine, and left at least one more vial of ketamine with Perry's assistant, Kenneth Iwamasa, 60, who paid the doctor $4,500 (£3,350). Plasencia is said to have distributed 20 vials and multiple tablets to Iwamasa and Perry, netting $57,000 (£42,500) from 30 September to 12 October, 2023, despite the going price of ketamine being roughly $15 (£11) per vial. The 44-year-old was jailed for two-and-a-half years on 3 December after pleading guilty to four counts of distribution of ketamine, having already surrendered his California medical license. However, he did not supply the dose that killed Perry, who was found drowned in his hot tub at home after taking ketamine in October 2023. Iwamasa, 60, admitted to repeatedly injecting Perry with ketamine, despite having no medical training, including multiple times on the day he died. He pleaded guilty to one count of conspiracy to distribute ketamine causing death and will be sentenced in January. Also charged is Erik Fleming, 54, who admitted in court documents that he supplied the ketamine that killed Perry, having distributed 50 vials to Iwamasa - half of them four days before Perry died. He further stated he obtained the drug from 42-year-old Jasveen Sangha, a dual US-UK citizen, nicknamed the \"Ketamine Queen\". Fleming pleaded guilty to one count of conspiracy to distribute ketamine and one count of distribution of ketamine resulting in death. Sangha pleaded guilty to one count of maintaining a drug-involved premises, three counts of distribution of ketamine, and one count of distribution of ketamine resulting in death or serious bodily injury. They will be sentenced in January and February respectively. Perry had been taking ketamine legally as a treatment for depression, but sought more of the drug and started taking it unsupervised in the weeks before his death, acquiring it illegally from different sources. The actor starred in 10 seasons of Friends, from 1994 to 2004, alongside Jennifer Aniston, Courteney Cox, Lisa Kudrow, Matt LeBlanc and David Schwimmer, as well as appearing in the 2021 reunion show."
    },
    {
        "title": "Brown University shooting: New image and video released of 'person of interest'",
        "description": "Police investigating a deadly shooting at a US university have released a new image and video clips of a \"person of interest\".",
        "url": "https://news.sky.com/story/brown-university-shooting-new-image-and-video-released-of-person-of-interest-13484529",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-brown-suspect-brown-shooteer_7112425.png?20251216211101",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-16 20:54:00",
        "Headline": "A new image and video clips show the movements of a 'person of interest' in the deadly attack that left two students dead and nine injured.",
        "Content": "Police investigating a deadly shooting at a US university have released a new image and video clips of a \"person of interest\". It comes as the manhunt for a gunman who killed two Brown University students and injured nine more in a classroom continued for a fourth day. The shooting on Saturday afternoon unfolded on the first floor of the engineering and physics building while exams were taking place. A law enforcement official said the attacker fired more than 40 rounds from a 9mm handgun in Providence, Rhode Island. The new image showed a man dressed in dark clothing, wearing a black hat and face mask, walking down a street that day. In all of the videos made public, the suspect's face was either covered by a mask or turned away. He is described as stocky and about 5ft 8in (173cm) tall. Authorities have released a video timeline showing the movements of the person of interest, including of him before the attack, in the hope that someone might recognise him. \n                  Film director Rob Reiner's son could face death penalty if found guilty of parents' killings, prosecutors say\n                 \n                  Obamas planned to see Reiners the night they were killed, says ex-US first lady\n                 \n                  Doctor sentenced over Matthew Perry's death\n                 The clips showed a man walking briskly, and at one point running, between 2pm and 3pm local time, along several different streets, about a block away from the building where the attack would later take place. The shooting happened at 4.03pm, and another clip showed the same person from a distance walking from the building's car park towards the street, even as police cars with flashing lights arrived at the scene. The final clip showed the man walking along that street about three minutes after the shooting. Authorities on Sunday released a man who had been detained in connection with the attack. Read more:Video of 'person of interest' in Brown shooting Police have said there was no clear video of the gunman from inside the building. Attorney general Peter Neronha said there were cameras in the newer part but \"fewer, if any, cameras\" where the shooting happened \"because it's an older building\". The attack and the gunman's escape have sparked concerns about campus safety, including the absence of security cameras, and led to calls for improved door locks. More details about victims emerge The students who were killed were Ella Cook, a 19-year-old sophomore from Birmingham, Alabama, and MukhammadAziz Umurzokov, an 18-year-old freshman from Brandermill, Virginia. Ms Cook was vice president of the College Republicans club at Brown University and Mr Umurzokov, whose family came to the US from Uzbekistan when he was a child, was an aspiring neurosurgeon. The Reverend R Craig Smalley described Ms Cook as \"an incredibly grounded, faithful, bright light\" who encouraged and \"lifted up those around her\". In a GoFundMe post, Mr Umurzokov's family described him as \"incredibly kind, funny, and smart\". \"He always lent a helping hand to anyone in need without hesitation, and was the most kind-hearted person our family knew,\" they said."
    },
    {
        "title": "Trump sues BBC for $10bn in lawsuit",
        "description": "Donald Trump has filed a defamation lawsuit against the BBC, alleging the corporation's Panorama documentary portrayed him in a \"false, defamatory, deceptive, disparaging, inflammatory, and malicious\" manner.",
        "url": "https://news.sky.com/story/trump-files-5bn-lawsuit-against-bbc-over-panorama-edit-13484000",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump-bbc_7111577.jpg?20251216010147",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-16 00:50:00",
        "Headline": "Clips were spliced together from sections of the US president's speech on 6 January 2021 to make it appear he told supporters he was going to walk to the US Capitol with them to \"fight like hell\".",
        "Content": "Donald Trump has filed a defamation lawsuit against the BBC, alleging the corporation's Panorama documentary portrayed him in a \"false, defamatory, deceptive, disparaging, inflammatory, and malicious\" manner. The complaint relates to the broadcaster's editing of a speech he made in 2021 on the day his supporters stormed the Capitol building. Clips were spliced together from sections of the US president's speech on January 6 2021 to make it appear he told supporters he was going to walk to the US Capitol with them to \"fight like hell\". It aired in the documentary Trump: A Second Chance?, which was broadcast by the BBC the week before last year's US election. The US president is seeking damages of no less than $5bn (£3.7bn) under a defamation lawsuit. He has also sued for $5bn for alleged violation of a trade practices law. Both lawsuits have been filed in Florida. 'They put words in my mouth' Speaking in the Oval Office earlier on Monday, he said: \"In a little while, you'll be seeing I'm suing the BBC for putting words in my mouth. \"Literally, they put words in my mouth. They had me saying things that I never said coming out.\" The scandal erupted earlier this year after a leaked memo highlighted concerns over the way the clips were edited. Responding to the lawsuit, a BBC spokesperson said: \"As we have made clear previously, we will be defending this case. We are not going to make further comment on ongoing legal proceedings.\" UK government minister Wes Streeting said Mr Trump has \"every reason to be angry\" and said the BBC was \"wrong and misrepresented\" what he said - but said the corporation apologised. However, he said the BBC is \"one of the most trusted news sources, not just in this country, but the world over\". After the leak, BBC chair Samir Shah apologised on behalf of the broadcaster over an \"error of judgement\" and accepted the editing of the 2024 documentary gave \"the impression of a direct call for violent action\". The fallout from the saga led to the resignation of both the BBC director-general Tim Davie and the head of news Deborah Turness. Earlier, BBC News reported the broadcaster had set out five main arguments in a letter to Mr Trump's legal team as to why it did not believe there was a basis for a defamation claim. In November, the BBC officially apologised to the president, adding that it was an \"error of judgement\" and saying the programme will \"not be broadcast again in this form on any BBC platforms\". A spokesperson said \"the BBC sincerely regrets the manner in which the video clip was edited\", but they also added that \"we strongly disagree there is a basis for a defamation claim\". Read more from Sky News:Why Britain isn't workingArmed forces chief's stark warning  'Trump's outrageous legal threat' Speaking on Mornings with Ridge and Frost, health minister Stephen Kinnock backed the BBC. He said: \"Well, it's absolutely right that the BBC is an independent organisation. \"I think they have apologised for one or two of the mistakes that were made in that Panorama programme. But they've also been very clear that there is no case to answer in terms of Mr Trump's accusations on the broader point about, libel or defamation. So, you know, I think it's right that the BBC stands firm on that point. \"Yes, there were some mistakes made in that particular piece of film, but I think the broader argument that they were making, they're right to stick by their guns on that. And I hope that they will continue to do so as an independent organisation, of course, funded by the licence fee, a hugely important institution.\" He added: \"I am a massive supporter. The government is a massive supporter of the BBC. The Labour Party will always stand up for the BBC as a vitally important institution, in both our political life and of course, in terms of entertaining and informing the British public.\" Liberal Democrat leader Sir Ed Davey said: \"Keir Starmer needs to stand up for the BBC against Trump's outrageous legal threat and protect licence fee-payers from being hit in the pocket. \"The Trump administration has clearly set out they want to interfere in our democracy, which includes undermining our national broadcaster. \"The prime minister needs to make clear this is unacceptable.\"  "
    },
    {
        "title": "How did Trump politicise the murder of Rob Reiner, a Hollywood icon?",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈&#160; </a>",
        "url": "https://news.sky.com/story/who-are-the-domestic-terrorist-group-the-fbi-just-foiled-13484004",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump-100-donald-trump_7015760.jpg?20250910080951",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-16 04:12:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈   Members of the so-called Turtle Island Liberation Front have been charged with plotting to bomb multiple targets in California on New Year's Eve. But who are they, and why has no one ever heard of them before now? Elsewhere, after legendary film director Rob Reiner and his wife are brutally murdered at their home over the weekend, the president writes online… not a message of condolence, but an attack on the man who'd just lost his life. It goes down like a cup of cold sick with both the right and the left. Why did the president politicise this murder? And a blockbuster UK-US trade deal appears to stall. Or has it? You can also watch all episodes on our YouTube channel. Email us on trump100@sky.uk with your comments and questions."
    },
    {
        "title": "US military says eight 'narco-terrorists' killed in strikes on three boats in Pacific",
        "description": "Eight people have been killed in US military strikes on three boats it has accused of smuggling drugs in the Pacific Ocean.",
        "url": "https://news.sky.com/story/us-military-says-eight-narco-terrorists-killed-in-strikes-on-three-boats-in-pacific-13484078",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-us-military-southern-command_7111894.jpg?20251216112907",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-16 08:34:00",
        "Headline": "No evidence the vessels were involved in drug trafficking has been given, but a video showing the strikes on the boats was posted online by the US military.",
        "Content": "Eight people have been killed in US military strikes on three boats it has accused of smuggling drugs in the Pacific Ocean. The US military's Southern Command said the strikes targeted \"designated terrorist organisations\" killing three \"narco-terrorists\" in the first vessel, two in the second boat and three in the third. No evidence the vessels were involved in drug trafficking has been given, but a video showing the strikes on the boats was posted on social media. Southern Command added that defence secretary Pete Hegseth ordered the strikes, and claimed intelligence confirmed the vessels were using known drug trafficking routes and engaged in drug trafficking. It is unclear where the vessels were from, but the strikes mark the latest in Donald Trump's \"war\" with drug cartels, which has also seen vessels targeted in the Caribbean Sea, including near Venezuela. Over the past several months, the US has been carrying out a large-scale military build-up in the southern Caribbean, with the stated goal of combating drug trafficking. In its first lethal strike on 2 September, the White House posted on X that it had conducted a strike against \"narcoterrorists\" shipping fentanyl to the US, without providing evidence of the alleged crime.  Sky's Data & Forensics unit last week verified that in the four months up to 10 December, 23 boats were targeted in 22 strikes, killing 87 people. US forces also seized a crude oil tanker, named Skipper, off the coast of Venezuela last week. The government in Caracas, led by President Nicolas Maduro, who insists the real purpose of the US military operations is to force him out of office, branded the ship's seizure a \"blatant theft\" and an \"act of international piracy\". Read more from Sky News:Musk is winning the space race - and looks unstoppableTrump wants $10bn in damages over BBC Panorama edit On Monday, Mr Trump signed an executive order declaring fentanyl a \"weapon of mass destruction\". The order instructs the State and Treasury departments to pursue the financial assets of and sanctions on financial institutions and groups involved in fentanyl trafficking. It also calls for greater co-operation between the Pentagon and the Justice Department on fentanyl and drug trafficking issues. The latest strikes on vessels allegedly trafficking drugs come on the eve of briefings on Capitol Hill for all members of Congress as questions mount over the Trump administration's military actions. Mr Hegseth, secretary of state Marco Rubio, and other top national security officials are expected to provide closed-door briefings for politicians in the House and Senate."
    },
    {
        "title": "Whitakers' real-life Willy Wonka on shrinkflation and the rise of chocolate-flavour bars",
        "description": "Britain loves chocolate.",
        "url": "https://news.sky.com/story/whitakers-real-life-willie-wonka-on-shrinkflation-and-the-rise-of-chocolate-flavour-bars-13484338",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-william-whitaker-willie-wonka_7112267.png?20251216164213",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-12-16 13:43:00",
        "Headline": "The British chocolate maker has seen nearly £3m of cost increases this year and last, and some rival brands have had to tinker with their recipes to such an extent they can't legally call themselves chocolate.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n Britain loves chocolate. We're estimated to consume 8.2kg each every year, a good chunk of it at Christmas, but the cost of that everyday luxury habit has been rising fast. Whitakers have been making chocolate in Skipton in north Yorkshire for 135 years, but they have never experienced price pressures as extreme as those in the last five. \"We buy liquid chocolate and since 2023, the price of our chocolate has doubled,\" explains William Whitaker, the real-life Willy Wonka and the fourth generation of the family to run the business. \"It could have been worse. If we hadn't been contracted [with a supplier], it would have trebled. \"That represents a £5,000 per-tonne increase, and we use a thousand tonnes a year. And we only sell £12-£13m of product, so it's a massive effect.\" Whitakers makes 10 million pieces of chocolate a week in a factory on the much-expanded site of the original bakery where the business began. Automated production lines snake through the site moulding, cutting, cooling, coating and wrapping a relentless procession of fondants, cremes, crisps and pure chocolate products for customers, including own-brand retail, supermarkets, and the catering trade. Steepest inflation in the business All of them have faced price increases as Whitakers has grappled with some of the steepest inflation in the food business. Cocoa prices have soared in the last two years, largely because of a succession of poor cocoa harvests in West Africa, where Ghana and the Ivory Coast produce around two-thirds of global supply. A combination of drought and crop disease cut global output by around 14% last year, pushing consumer prices in the other direction, with chocolate inflation passing 17% in the UK in October.  Skimpflation and shrinkflation  Some major brands have responded by cutting the chocolate content of products - \"skimpflation\" - or charging more for less - \"shrinkflation\". Household-name brands including Penguin and Club have cut the cocoa and milk solid content so far they can no longer be classified as chocolate, and are marketed instead as \"chocolate-flavour\". Whitakers have stuck to their recipes and product sizes, choosing to pass price increases on to customers while adapting products to the new market conditions. \"Not only are major brands putting up prices over 20%, sometimes 40%, they've also reduced the size of their pieces and sometimes the ingredients,\" says William Whitaker. \"We haven't done any of that. We knew that long-term, the market will fall again, and that happier days will return. \"We've introduced new products where we've used chocolate as a coating rather than a solid chocolate because the centre, which is sugar-based, is cheaper than the chocolate. \"We've got a big product range of fondant creams, and others like gingers and Brazil nuts, where we're using that chocolate as a coating.\" A deluge of price rises Brazil nuts have enjoyed their own spike in price, more than doubling to £15,000 a tonne at one stage. On top of commodity prices determined by markets beyond their control, Whitakers face the same inflationary pressures as other UK businesses. \"We've had the minimum wage increasing every year, we had the national insurance rise last year, and sort of hidden a little bit in this budget is a business rate increase. \"This is a small business, we turn over £12m, but our rates will go up nearly £100,000 next year before any other costs. \"If you add up all the cocoa and all the other cost increases in 2024 and 2025, it's nearly £3m of cost increases we've had to bear. Some of that is returning to a little normality. It does test the relevance of what you do.\""
    },
    {
        "title": "Second Horizon victim Janet Skinner 'forced' to sue Post Office as she seeks full redress for wrongful conviction",
        "description": "A victim of the Post Office Horizon IT scandal is taking legal action against the government-owned organisation as she seeks full redress for her wrongful conviction.",
        "url": "https://news.sky.com/story/second-horizon-victim-janet-skinner-forced-to-sue-post-office-as-she-seeks-full-redress-for-wrongful-conviction-13484489",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-janet-skinner-post-office_6418499.jpg?20240111160240",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-12-16 17:40:00",
        "Headline": "Barring a \"sea change\", a solicitor for Post Office victims said more people will sue the government-owned company.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n A victim of the Post Office Horizon IT scandal is taking legal action against the government-owned organisation as she seeks full redress for her wrongful conviction. Janet Skinner is believed to be only the second victim to sue the Post Office. The former subpostmistress has been \"forced\" to take the state-owned business to court, her solicitor told Sky News. Money blog: Oil hit lowest since 2021 with possible impact on filling your car Ms Skinner has been a campaigner for victims of the faulty Horizon software for nearly two decades. Around 1,000 people were wrongly prosecuted and convicted throughout the UK between 1999 and 2015 as a result of Horizon. Despite having her conviction for false accounting overturned in 2021, Ms Skinner has yet to receive a final payment, has been given an insufficient interim sum and is being asked for six different expert reports, said lawyer Simon Goldberg. \n                  Appeal court delay for first Capture case as Post Office requests extension\n                 \n                  Post Office scandal: Police consider corporate manslaughter charges\n                 \n                  Conviction linked to third 'faulty' Post Office system referred to Court of Appeal\n                 Ms Skinner is taking legal action in an attempt to see the issue resolved. \"There's no sign of resolution. We're only forced to do it because enough is enough,\" Mr Goldberg said. \"It's cruel and traumatic beyond belief that she should still have to be fighting.\" Ms Skinner's claim should have been settled within 12 months of the conviction being overturned, he said. Mr Goldberg added the interim offers are not in keeping with the recommendations of retired High Court judge Sir Wyn Williams, who presided over the public inquiry into the scandal. Both the Post Office and the Department for Business and Trade, which administers all but one of the victims' redress schemes, said in October they would \"always apply a generous approach\" to assessing redress. But Ms Skinner was initially offered a payment worth only 15% of her total claim. \"They've [claim assessors] clearly tried to grind her down and make her give up, and we're not playing,\" her solicitor said. More legal action to come? While Ms Skinner is believed to be only the second victim to launch a civil case against the Post Office, she may not be the last. A postmaster made famous after being portrayed in the ITV drama Mr Bates vs the Post Office, Lee Castleton became the first to take such action in March. \"Unless there's a sea change, there will definitely be more claims,\" Mr Goldberg said. Ms Skinner was given a nine-month custodial sentence in 2007 after the Horizon computer programme, made by Fujitsu, incorrectly generated a £59,000 shortfall. She was imprisoned when her two children were in their teens, released with an ankle monitor tag, and sold her house when it was due to be repossessed. Amid the ordeal, Ms Skinner suffered a neurological collapse and was left paralysed from the neck down. She has had to regain the ability to walk. A Post Office spokesperson said: \"We recognise the devastating impact of the Horizon IT Scandal on former postmasters like Ms Skinner and would like to unequivocally apologise for her experiences. \"Responsibility for Ms Skinner's redress claim moved to the Department for Business and Trade in June 2025. \"We cannot comment on ongoing legal proceedings but once we receive the claim, we will engage fully in the process.\""
    },
    {
        "title": "Unemployment rate jumps again, with young people worst affected",
        "description": "The UK's unemployment rate has risen further, with official figures showing young people being particularly hard hit by the jump in job cuts under Labour.",
        "url": "https://news.sky.com/story/unemployment-rate-jumps-again-with-young-people-worst-affected-13484019",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-jobcentre-benefits_7079487.jpg?20251207202817",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-12-16 06:16:00",
        "Headline": "At 5.1%, the rate is up by a full percentage point under Labour following April's tax hike on employment and surge in minimum pay rates.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The UK's unemployment rate has risen further, with official figures showing young people being particularly hard hit by the jump in job cuts under Labour. Figures from the Office for National Statistics (ONS) showed the jobless rate hit 5.1% in the three months to October - a period dominated again by talk of a tough budget ahead. That was up from the 5% level reported a month ago. It had stood at 4.1% when Labour took office in 2024, promising a focus on growing the economy and protecting \"working people\" from tough fiscal choices. Money latest: What are my rights over neighbour's doorbell camera ONS director of economic statistics Liz McKeown said: \"The overall picture continues to be of a weakening labour market. The number of employees on payroll has fallen again, reflecting subdued hiring activity, while firms told us there were fewer jobs in the latest period. \"This weakness is also reflected in an increase in the unemployment rate, while vacancies remained broadly flat. The fall in payroll numbers and increase in unemployment has been seen particularly among some younger age groups. \n                  Whitakers' real-life Willy Wonka on shrinkflation and the rise of chocolate-flavour bars\n                 \n                  Second Horizon victim Janet Skinner 'forced' to sue Post Office as she seeks full redress for wrongful conviction\n                 \n                  Out of a job and on benefits: Why Britain isn't working\n                 \"Wage growth slowed further in the private sector, while increasing again in the public sector, reflecting the continued impact of some pay rises being awarded earlier than they were last year.\" The ONS highlighted a youth unemployment rate of 16%. The data was released against the backdrop of a continuing investigation into the sources of leaks ahead of the chancellor's second budget, with the countdown dominated by talk of pain ahead including income tax hikes. Economists and private sector surveys have blamed months of budget speculation for forcing business and consumer spending into a form of hibernation. This comes on top of a backlash among employers to Rachel Reeves's first budget that saw business placed on the hook for £25bn of additional national insurance contributions - costs which have underpinned the UK's stubbornly high level of inflation. It also raised minimum wage levels at inflation-busting rates - rates that were further upwardly adjusted on 26 November. Early data released by the ONS showed that the number of payrolled employees in the labour market had fallen by more than 170,000 over the past 12 months - a number that is still subject to future revision. In an interview on Sky's Mornings with Ridge and Frost, care minister Stephen Kinnock repeatedly dodged questions on whether he accepted that the jobless rate had risen under Labour. \"We're absolutely focussed on getting more jobs... getting better paid jobs. We've also seen the minimum wage increasing substantially. So we're dealing with that cost of living crisis,\" he said while pointing to investment in the economy \"after 14 years of neglect\". Secretary of State for Work and Pensions, Pat McFadden said in a statement: \"There are over 350,000 more people in work this year and the rate of inactivity is at its joint lowest in over five years, but today's figures underline the scale of the challenge we've inherited. \"That is why we are investing £1.5 billion to deliver 50,000 apprenticeships and 350,000 new workplace opportunities for young people - giving them real experience and a foot in the door. \"To go further and tackle the deep-rooted issues of our labour market, Alan Milburn is also leading an investigation into the whole issue of young people inactivity and work.\" The weak labour market data adds weight to expectations of an interest rate cut by the Bank of England this week. The vast majority of financial market participants and economists forecast a reduction to 3.75% - a near three-year low - from 4%. They say that rather than being allowed by an easing in inflation, the recent monthly contractions in UK economic growth and rising jobless rate give policymakers the scope to cut due to weak demand. Liberal Democrat deputy leader and economy spokesperson, Daisy Cooper, said: \"The government says it's on the side of working people but it's workers and jobseekers who are paying the price of their failures. \"For people worried about their job, these figures are the last thing they want to see before Christmas. \"From the jobs tax to the betrayal on business rates, businesses are struggling to stay afloat under the massive tax increases imposed by this government which are making it more expensive to employ people. \"The chancellor must take this as a wake up call and reverse the jobs tax before it can do any more damage,\" she said."
    },
    {
        "title": "Ben & Jerry's directors removed in fresh twist to Magnum row",
        "description": "A co-founder of Ben & Jerry's has accused its owners of a fresh attempt to \"silence\" its social mission through the departures of three members of its independent board.",
        "url": "https://news.sky.com/story/ben-jerrys-directors-removed-in-fresh-twist-to-magnum-row-13484009",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ben-and-jerry-ice-cream_7022689.jpg?20250917084603",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-12-16 05:22:00",
        "Headline": "Ben & Jerry's said in a statement that any director who has served more than nine years on the board would not be eligible for annual re-election in 2026.",
        "Content": "A co-founder of Ben & Jerry's has accused its owners of a fresh attempt to \"silence\" its social mission through the departures of three members of its independent board. Ben Cohen spoke up after it emerged that its chair Anuradha Mittal, who had previously resisted parent company pressure to remove her, had left Ben & Jerry's in the wake of new rules imposed by the US brand that included nine-year term limits for board members. It is understood that two other long-standing directors, Daryn Dodson and Jennifer Henderson, will see their terms expire on 31 December. Ben & Jerry's has, since last week, been owned by The Magnum Ice Cream Company (TMICC) which was created by a spin-off from the UK-based consumer goods firm Unilever. Unilever bought Ben & Jerry's in 2000 but the relationship has been sour since, despite the creation of the independent board at that time which was aimed at protecting the brand's social mission. The most high-profile spat came in 2021 when Ben & Jerry's took the decision not to sell ice cream in Israeli-occupied Palestinian territories on the grounds that sales would be \"inconsistent\" with its values. Unilever responded by selling the business to its licensee in Israel. A series of rows have followed akin to a tug of war, with Magnum refusing repeated demands by the co-founders of Ben & Jerry's to sell the brand back. Magnum and Unilever argue its mission has strayed beyond what was acceptable back in 2000, with the brand evolving into one-sided advocacy on polarising topics that risk reputational and business damage. TMICC declared last month that Ms Mittal \"no longer meets the criteria\" to serve after internal investigations. An audit of the separate Ben & Jerry's Foundation, where she is also a trustee, found deficiencies in financial controls and governance. Magnum said the charitable arm risked having funding removed unless the alleged problems were addressed. Read more from Sky News:'People who struggle to get out of bed are having benefits cut'Strawberry fields forever? UK farm growing berries in December  Ms Mittal had accused Magnum of attempts to \"discredit\" her and undermine the authority of the independent board. Neither she, or the other two directors set to leave the board, were yet to comment. Mr Cohen said the three directors had served the company with integrity and courage, calling their departure \"another step in Magnum's systematic effort to dismantle Ben & Jerry's from the inside and silence the very social mission that gives the brand its value\". Magnum said it fully supported the steps Ben & Jerry's was taking to enhance board governance."
    },
    {
        "title": "Thames Water defers payment of controversial £2.5m retention awards",
        "description": "Thames Water has opted not to pay more than &#163;2m in retention awards to more than 20 of its top executives this month amid a political outcry over the payments.",
        "url": "https://news.sky.com/story/thames-water-defers-payment-of-controversial-16325m-retention-awards-13484127",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mogden-thames-water_6944125.jpg?20250617092707",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-16 11:12:00",
        "Headline": "The crisis-hit utility has decided to pause the payments, which were due to be handed to 21 senior managers this month, until further notice amid intense political scrutiny, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Thames Water has opted not to pay more than £2m in retention awards to more than 20 of its top executives this month amid a political outcry over the payments. Sky News has learnt that the embattled utility's remuneration committee has decided to defer roughly £2.46m in payouts until further notice following deliberations among directors in recent days. The decision not to permanently cancel or to hand over the awards risks being labelled a fudge by critics of the company, but avoids the possibility of a pre-Christmas bonus row as Thames Water races to finalise a multibillion-pound rescue led by its largest group of creditors. Money latest: Octopus and British Gas confirm all customers will see big drop in energy bills Sources said that the government and Ofwat, the water industry regulator, had been notified of the bonus decision this week. The £2.46m payouts, which have attracted fierce scrutiny from the Commons environment, food and rural affairs select committee, follow a similar payment which was made earlier this year. A larger award of about £13.5m is due to be made under the retention scheme schedule during the course of 2026. \n                  Revenues of water company to be cut by regulator Ofwat\n                 \n                  Thames Water to decide on controversial £2m payouts to bosses\n                 \n                  Bond giant Pimco sells bulk of Thames Water debt position\n                 Alistair Carmichael, the Liberal Democrat MP who chairs the select committee, told The Daily Telegraph after Sky News had revealed the Thames Water board discussions: \"Given the perilous state of Thames Water's finances, for a remuneration committee to award bonuses to already well-paid executives would be an outrage.\" Mr Carmichael wrote to Sir Adrian last month demanding to know by December 1 whether the money would be handed out. Chris Weston, Thames Water's chief executive, is already the subject of a bonus 'ban' imposed by the regulator, Ofwat, under new rules preventing payouts at water companies which are failing to meet environmental, financial resilience or consumer standards. He is not among the 21 executives eligible for the retention payments. Thames Water's survival battle will continue until well into next year as it seeks Ofwat's approval for a deal that will involve creditors injecting about £5bn into the business. They would also write off billions of pounds in debt they are owed in return for greater leniency from regulators over future environmental penalties and targets. Without an agreement, Thames Water would effectively be nationalised through a process called a Special Administration Regime. Sky News revealed during the summer that the government was lining up FTI Consulting to draw up contingency plans for such an outcome. On Tuesday, Thames Water declined to comment on the retention awards decision."
    },
    {
        "title": "Cambridge 'materials science' start-up CuspAI nears $1bn valuation",
        "description": "A materials science start-up which aims to eradicate 'forever chemicals' that are harmful to humans, is on the brink of a major new funding injection less than four months after securing backing from some of the world's leading investors. ",
        "url": "https://news.sky.com/story/cambridge-forever-chemicals-start-up-cuspai-nears-1bn-valuation-13484186",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-rain-cambridge_6828951.png?20250214193204",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-16 11:04:00",
        "Headline": "A materials science company founded just over a year ago is on track to become Britain’s latest technology 'unicorn' as it nears a new funding injection from a syndicate of investors, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A materials science start-up which aims to eradicate 'forever chemicals' that are harmful to humans, is on the brink of a major new funding injection less than four months after securing backing from some of the world's leading investors.  Sky News has learnt that CuspAI, which announced a $100m fundraising in September, is close to raising tens of millions of pounds from more from some of the same shareholders which supported its autumn capital boost. City sources said that Temasek Holdings, the Singaporean state fund, and NEA, a major US-based venture capital firm, were expected to commit additional money to the Cambridge-based company. Money latest: Octopus and British Gas confirm all customers will see big drop in energy bills CuspAI has also drawn investment from the likes of NVentures, Nvidia's venture arm, Samsung, Hyundai Motor Group, Giant Ventures, LocalGlobe and Northzone. One insider said the new funding put CuspAI firmly on track to reach a 'unicorn' valuation of at least $1bn in its next funding round, which is likely to take place as early as next year. The company was founded in 2024 by former chemist Dr Chad Edwards and Professor Max Welling, an AI specialist. \n                  Whitakers' real-life Willy Wonka on shrinkflation and the rise of chocolate-flavour bars\n                 \n                  Second Horizon victim Janet Skinner 'forced' to sue Post Office as she seeks full redress for wrongful conviction\n                 \n                  Out of a job and on benefits: Why Britain isn't working\n                 It has developed what it describes as an AI \"search engine\" for the material world, enabling customers to specify the exact properties they need and then generating new, synthesizable candidates up to 10 times faster than traditional discovery methods. \"Next-generation AI compute, clean air and water and sustainable energy - these multi-billion-dollar global challenges share a common barrier: materials,\" Dr Edwards said in September. \"In just a year, we've gone from concept to partnerships with world leaders in automotive, semiconductors, energy, and climate.\" A person close to CuspAI said the new funding represented an extension of its Series A round, while the company itself declined to comment."
    },
    {
        "title": "Wessex Water is latest firm facing enforcement penalty for sewage failures",
        "description": "Wessex Water has become the latest utility to face a multimillion-pound enforcement package for sewage leaks, the industry regulator has announced.",
        "url": "https://news.sky.com/story/wessex-water-is-latest-firm-facing-enforcement-penalty-for-sewage-failures-13484090",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sewage-rivers_6968697.jpg?20250719173745",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-12-16 09:17:00",
        "Headline": "Wessex shareholders must fund the additional investment agreed with the industry regulator, rather than customers.",
        "Content": "Wessex Water has become the latest utility to face a multimillion-pound enforcement package for sewage leaks, the industry regulator has announced. Ofwat said the company, which has 2.9 million customers in the South West, was to pay £11m more towards its wastewater infrastructure upgrades instead of a fine. The watchdog, which is facing the axe itself under a planned shake-up of industry oversight, said Wessex failed to operate, maintain and upgrade its network to ensure it could cope with flows of waste including sewage. Money latest: Octopus and British Gas confirm all customers will see big drop in energy bills It ruled that Wessex, which is owned by Malaysia-based YTL, could not fund the required additional investment through company bills. The money was to be spent on a number of specific projects. Ofwat said Wessex was the sixth case it had completed in its wider wastewater investigation, which has resulted in £250m in fines and enforcement packages. Almost half that sum is at the foot of cash-strapped Thames Water, the country's biggest operator, which is currently seeking approval for a change of ownership to prevent collapse. \n                  Whitakers' real-life Willy Wonka on shrinkflation and the rise of chocolate-flavour bars\n                 \n                  Second Horizon victim Janet Skinner 'forced' to sue Post Office as she seeks full redress for wrongful conviction\n                 \n                  Out of a job and on benefits: Why Britain isn't working\n                 Lynn Parker, senior director for enforcement at Ofwat, said: \"These cases are a crucial part of holding water companies to account and driving the transformation of the water sector that the public wants to see.\" Wessex Water said it regretted the impact its wastewater performance had \"on customers and the environment\". The company said the investment package \"will tackle the problem directly\" and that it was planning to invest £300m in its sewerage infrastructure by 2030."
    },
    {
        "title": "UK to rejoin EU's Erasmus student exchange scheme - reports",
        "description": "The UK is to rejoin the European Union's Erasmus student exchange scheme, according to reports.",
        "url": "https://news.sky.com/story/uk-to-rejoin-eus-erasmus-student-exchange-scheme-reports-13484526",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-university-erasmus_7112424.jpg?20251216211059",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-16 20:50:00",
        "Headline": "The programme was halted due to Brexit at the beginning of 2021.",
        "Content": "The UK is to rejoin the European Union's Erasmus student exchange scheme, according to reports. The popular programme, which allowed Britons to spend a year studying at European universities as part of their degree without paying extra fees and vice versa for their European counterparts, ended for British students after Brexit on 1 January 2021. But ministers could announce the UK will rejoin Erasmus from January 2027 as soon as Wednesday, The Times and The Guardian have reported. Politics latest: Labour's flagship workers' rights bill passes Lords after months of debate  Sir Keir Starmer promised a post-Brexit reset deal with Brussels and announced the government was working on rejoining the programme in May. Negotiations have included work on \"mutually agreed financial terms\" for the UK and the EU. \n                  David Lammy suggests UK would benefit from rejoining an EU customs union\n                 \n                  PM issues China warning - and hits out at Brexit\n                 \n                  Brexit impact on UK economy 'negative for foreseeable future', Bank of England chief says\n                 The UK had pushed for a discount on membership fees, which are calculated on the basis of a country's gross domestic product (GDP), The Times reported. It said the EU is understood to have offered the government a 30% reduction of fees in the first year of membership. Labour MP Darren Frith told Sky News' Politics Hub he would \"welcome\" such a move. The Guardian reported that as well as university-based study exchanges, British students will be able to participate in vocational training placements under the scheme. Cabinet Office minister Nick Thomas-Symonds held talks with Maros Sefcovic, the European Commission's trade lead, in Brussels last week. A Cabinet Office spokesman said: \"We are not commenting on ongoing talks.\" But the UK's universities welcomed the apparent breakthrough. Tim Bradshaw, chief executive of the Russell Group of leading universities, said: \"We're delighted at the UK's association to Erasmus+. \"With an even greater scope than previous programmes, Erasmus+ opens up fantastic opportunities for students, adult learners and young people to all benefit from new experiences and learning. \"It will also renew the huge contributions that EU students and staff make to life on our university campuses.\" The Lib Dems, who have been campaigning to rejoin Erasmus, welcomed the news. Leader Sir Ed Davey said: \"This is a moment of real opportunity and a clear step towards repairing the disastrous Conservative Brexit deal.\""
    },
    {
        "title": "'Urgent' review announced into foreign interference in British politics",
        "description": "Sir Keir Starmer has authorised an \"urgent\" review into the extent of foreign interference in British politics, as he prepares to change the law to tighten donation rules.",
        "url": "https://news.sky.com/story/urgent-review-announced-into-foreign-interference-in-british-politics-13484407",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nathan-gill-reform-uk_7112210.jpg?20251216152548",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-12-16 14:52:00",
        "Headline": "The review comes in response to Nathan Gill, the former head of Reform UK in Wales, being jailed for accepting bribes to make pro-Russian statements.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Sir Keir Starmer has authorised an \"urgent\" review into the extent of foreign interference in British politics, as he prepares to change the law to tighten donation rules. Ministers have initiated a rapid inquiry into current financial rules on donations and election safeguards, which will report at the end of March. It will be led by Philip Rycroft, the former permanent secretary of the Brexit department. Politics latest: Who could lead Labour instead of Starmer? The inquiry is a direct response to the jailing of Nathan Gill, the former leader of Reform UK in Wales, who admitted accepting tens of thousands of pounds in cash to make pro-Russian statements to the media and European Parliament. In this case, officers said that they believed some individuals had a direct link to Vladimir Putin. Communities Secretary Steve Reed, who announced the inquiry to the Commons on Tuesday, wants Mr Rycroft to assess how well the rules work at the moment and promised the report will be published in full. \n                  Politics latest: Labour's flagship workers' rights bill passes Lords after months of debate\n                 \n                  UK to rejoin EU's Erasmus student exchange scheme - reports\n                 \n                  Domestic abuse and sexual violence survivors to get specialist NHS help\n                 Mr Reed told MPs that the \"conduct [of Gill] is a stain on our democracy\". \"The independent review will work to remove that stain,\" he said. The review could then lead to changes in the Elections Bill, due this spring, which could significantly change the way elections are financed. Tuesday's announcement is likely to ignite a firestorm of criticism. Among the changes that could result from the Rycroft report could be a clampdown on cryptocurrency donations, which Reform UK leader Nigel Farage has said in the past would be a direct attack on his party. It could introduce new rules for donations to thinktanks, which fall outside any regulatory regime at the moment, and could see new rules around foreign donations. Foreign donors can effectively give money if they have a trading UK subsidiary at the moment. The government has already promised to clamp down on \"shell\" companies, but this could give more clarity over how this will work. It could also look at funding of \"troll farms\" - vast banks of social media accounts based overseas designed to try and sway public opinion as part of state disinformation campaigns. However, the financial affairs of and donations to Labour MPs could be in the scope of the review, and those named in the report could face fresh disciplinary consequences. The government also singled out Christine Lee, the UK-based lawyer accused of working covertly on behalf of the Chinese Communist Party, as another case of concern. Nevertheless, other parties are likely to suggest this is an attempt to change the donation rules in Labour's favour, after promising to lower the voting age to 16 and cancelling some mayoral elections because of a local government re-organisation. The review will invite all party leaders to take part in \"in-depth assessment of the current financial rules and safeguards and offer recommendations to further mitigate risks from foreign political interference\". Mr Rycroft cannot compel politicians to give evidence, but he will have access to the security services, though the extent of their cooperation is unclear. The conduct around the Brexit referendum has been specifically excluded in the terms of reference, and Mr Rycroft will be instructed to focus on more \"recent\" cases, although there is no specific start date. The 12-week timeline for the inquiry, alongside the lack of statutory powers, is likely to make it hard for Mr Rycroft to uncover substantial new incidents of bribery or corruption and prove them to a standard necessary to put details in the public domain. The publication date, at the end of March, comes just five weeks before local elections in which Reform UK is expected to do well, and opposition politicians are likely to question the timing. Mr Rycroft has previously locked horns with Boris Johnson. He argued that, at times, Mr Johnson was a PM who \"only speaks for England\", his government was \"not sensitive to the niceties of constitutional convention\" and had \"imperious disregard\" for devolved policies, fuelling the breakup of the UK. In June last year, just before the election, when Rishi Sunak was PM, he signed a letter to The Times which said: \"Trust in politics, and in the people and institutions of public life, is at an all-time low. \"This is a serious problem for the health of our democracy and is indicative of the need for substantial improvement in the governance of the UK.\" Mr Rycroft has previously expressed his caution about the relationship between big tech and politics, telling Sky News two years ago: \"Politicians do have to be a little bit careful in this space. \"Nobody's elected Elon Musk, his opinions are those of a businessman, he is not a statesman. \"Clearly, they can court business people for their investment, but they shouldn't look as though they're kowtowing to them in terms of their regulatory concepts. \"They should listen to their views, but it should be democratically elected politicians that take those really, really important decisions, and let's hope that's the case in the UK.\" It comes as Reform and the Conservatives both received significantly higher donations than Labour in the first three quarters of this year. They included the largest ever political donation from a living person: £9m to Reform UK from British-Thai businessman Christopher Harborne."
    },
    {
        "title": "Domestic abuse and sexual violence survivors to get specialist NHS help",
        "description": "Domestic abuse and sexual violence survivors will have access to specialist NHS services across England, the government has announced.",
        "url": "https://news.sky.com/story/domestic-abuse-and-sexual-violence-survivors-to-get-specialist-nhs-help-13484491",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-domestic-abuse-domestic-violence_7112506.jpg?20251216223254",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-16 17:46:00",
        "Headline": "The initiative is part of the government's aim to halve violence against women and girls in a decade.",
        "Content": "Domestic abuse and sexual violence survivors will have access to specialist NHS services across England, the government has announced. As part of Labour's manifesto pledge to halve violence against women and girls (VAWG) in a decade, a new referral service will be launched to connect victims with specialist help through their GP. The \"steps to safety\" initiative will be launched in every area of England by 2029 to \"end the postcode lottery\" in support for victims and survivors, the government said. GP practice staff will also be offered training in all regions so they can better identify and respond to domestic abuse and sexual violence. Child sexual abuse survivors, both boys and girls, will also have access to specialist \"trauma-informed care\" based on the \"child house\" model. This is where different agencies, including police, health, social care and therapy services, are brought together to provide coordinated support for the child and their family. It means children only need to share their experiences once, rather than reliving their abuse through repeated interviews with different agencies. \n                  Specialist teams and online investigators deployed across England and Wales to tackle 'national emergency' of violence against women and girls\n                 \n                  Families of women who died after violence demand reform\n                 \n                  Claire Inglis: Call for 'damning' report into mother's murder to be fully released\n                 Based on US and Icelandic models, there is currently only one in the UK, the Lighthouse in north London, but the government said it will expand the model to all NHS regions in England. They will be funded by up to £50m from the government. Last week, Home Secretary Shabana Mahmood announced specialist investigation teams for rape and sexual offences will be created across England and Wales. The use of Domestic Abuse Protection Orders (DAPOs), which have been trialled in several areas, will also be rolled out across England and Wales. They are designed to target abusers by imposing curfews, electronic tags and exclusion zones. The orders cover all forms of domestic abuse, including economic abuse, coercive and controlling behaviour, stalking and 'honour'-based abuse. Breaching the terms can carry a prison term of up to five years. Read more:Violence against women and girls grows despite government strategies Nearly £2m will also be spent funding a network of officers to target offenders operating within the online space. Teams will use covert and intelligence techniques to tackle violence against women and girls via apps and websites. Ms Mahmood called violence against women and girls a \"national emergency\" ahead of unveiling the government's VAWG strategy on Thursday, after being delayed three times this year."
    },
    {
        "title": "Justice Secretary Angela Constance survives no confidence vote amid grooming gangs row",
        "description": "Scotland's justice secretary has survived a vote of no confidence amid claims she misrepresented a leading expert on grooming gangs and therefore misled parliament.",
        "url": "https://news.sky.com/story/justice-secretary-angela-constance-survives-no-confidence-vote-amid-grooming-gangs-row-13484303",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-john-swinney-angela-constance_7112245.jpg?20251216155823",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-12-16 12:57:00",
        "Headline": "Scottish Labour, the Scottish Tories and the Scottish Liberal Democrats joined forces to vote against Ms Constance, but the motion failed due to the backing of the SNP and Scottish Greens.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n Scotland's justice secretary has survived a vote of no confidence amid claims she misrepresented a leading expert on grooming gangs and therefore misled parliament. MSP Angela Constance has ignored calls to stand down and has First Minister John Swinney's full backing in the wake of comments she made about Professor Alexis Jay. Mr Swinney led her defence, describing her as a \"sincere minister\" who was \"getting on with the job of making Scotland safer\".   Both Scottish Labour and the Scottish Conservatives lodged motions of no confidence, with a debate held at Holyrood on Tuesday afternoon. Scottish Labour, the Scottish Tories and the Scottish Liberal Democrats joined forces to vote against Ms Constance, but the motion failed due to the backing of the SNP and Scottish Greens. \n                  First Minister John Swinney backs Justice Secretary Angela Constance amid threat of no confidence vote in grooming gangs row\n                 \n                  Scarlett was 14 - groomed and trafficked in Manchester to be raped by dozens of men\n                 \n                  Prey: Giving a voice to the survivors of grooming gangs \n                 MSP Russell Findlay, leader of the Scottish Conservatives, said: \"Shameless SNP and Green MSPs put partisan politics before truth and integrity, to the understandable fury of grooming gang victims. \"To any reasonable person, Angela Constance's position is untenable. She misled parliament by misrepresenting Professor Jay, tried to cover it up and then publicly lied after being caught. \"She twisted Professor Jay's words to reject our calls for a Scottish grooming gangs inquiry and then failed to correct the record. \"It's an open-and-shut case of a ministerial code breach for which she should lose her job.\" The row revolves around a comment made by Ms Constance as MSPs debated the Victims, Witnesses and Justice Reform (Scotland) Bill in September. Amid a failed Scottish Conservative amendment for a public inquiry to be established into grooming gangs in Scotland, Ms Constance insisted Professor Jay agreed with her that such a probe was not needed. However, emails made public by the Scottish government last week revealed the professor - who led the Independent Inquiry into Child Sexual Exploitation in Rotherham in 2014 - later contacted Ms Constance to say she would \"appreciate\" her position \"being clarified\". Professor Jay added that her comments quoted by Ms Constance had \"nothing to do\" with the situation in Scotland. Read more: Scottish government orders review of grooming gangs evidence Scottish Labour leader Anas Sarwar said he supported the motion as \"victims and survivors of grooming gangs and child sexual exploitation have lost confidence in this justice secretary\". He added: \"The justice secretary misrepresented Professor Jay's views in order to find an excuse not to have an inquiry into grooming gangs. \"Victims and survivors should be able to rely on their justice system, and their government, to tell the truth, to act with integrity and to put them first. \"On this, the justice secretary has failed.\" 👉 Listen to Sky News Daily on your podcast app 👈 During First Minister's Questions last week, Mr Swinney claimed Ms Constance \"was making a general comment\" on the situation as he gave his justice secretary his full backing. He reiterated his support for Ms Constance during the debate, saying: \"The cabinet secretary in the debate in September did not state that Professor Jay was speaking directly about the amendment. \"She made a general point drawing on the publicly stated views of Professor Jay. \"But I acknowledge that members of parliament and members of the public will draw different conclusions from the words we all use.\" Mr Swinney described Ms Constance as a \"sincere minister who would never address parliament in a way that would in any way mislead parliament or the public\". The first minister added: \"She's never shied away from asking tough questions about our approach to justice. \"Nor has she ever avoided tackling some of the biggest issues that we face. \"For these reasons, Angela Constance has my full confidence as justice secretary. \"She's getting on with the job of making Scotland safer, and I urge members to enable her to continue doing that by rejecting this motion today.\" The motion was defeated by 57 votes to 67, with one abstention"
    },
    {
        "title": "Is Angela Rayner popular enough to be PM?",
        "description": "<a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>",
        "url": "https://news.sky.com/story/is-angela-rayner-popular-enough-to-be-pm-13484010",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-politics-sam-coates_7021320.jpg?20250915170446",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-16 05:48:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics at Sam and Anne's on your podcast app👈 As Donald Trump files a multi-billion dollar defamation lawsuit against the BBC and there are reports of friction over the recent US-UK technology deal - what state is the \"special relationship\" in? Sam and Anne pore over the details and discuss if things can get back on track or whether the US president is meddling too much in British political affairs. Also, we have some exclusive polling from Labour voters on who they would prefer as leader of the party if it wasn't Sir Keir Starmer. Plus, Anne has an update on the talks held in Germany over a possible peace plan for Ukraine."
    },
    {
        "title": "2025 is the UK's sunniest year ever - with record levels for solar power",
        "description": "The UK has recorded its sunniest year ever - and we are only halfway through December.",
        "url": "https://news.sky.com/story/2025-is-the-uks-sunniest-year-ever-with-record-levels-for-solar-power-13484385",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-brighton-beach-sunshine_7112327.jpg?20251216175712",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-12-16 14:28:00",
        "Headline": "There were long spells earlier this year when every time morning rolled around, it was another day of sun. The UK has in fact been getting sunnier since the 1980s, but scientists can't yet say why.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The UK has recorded its sunniest year ever - and we are only halfway through December. But a bumper spring and summer for sunshine have already put 2025 firmly in the top spot for sunshine hours across the UK, according to provisional Met Office statistics. The sunny spells were driven by frequent periods of high pressure that reduced clouds and locked in sunny skies for many parts of the country. Though it may be hard to believe, Britain's weather has generally been getting sunnier over the past few decades - but scientists can't yet say why. This year, up until 15 December, the country clocked up 1,622 hours of sunshine, beating the previous sunniest year of 2003. All that sunshine drove a record year for solar power, by a huge margin. Met Office senior scientist Mike Kendon said: \"Spring was exceptional, and many will remember the long spells of days with largely unbroken sunshine.\" So far this year, only the months of February and October recorded below-average sunshine hours, he added. But the bounties were not shared equally across the nations. England enjoyed its sunniest year ever. But 2025 has likely not even made the top 10 for Northern Ireland, even though it was above average. Scotland is on course for its second-sunniest year, and Wales its sixth, albeit with two weeks still to go. Why is the UK getting sunnier? The UK has broadly been getting sunnier since the 1980s, but the cause of the trend remains a mystery. It could \"simply be down to natural variability\", the Met Office said, meaning it could well change in future. Or it may be explained by a \"reduction in particulates [known as aerosols] over the UK, partly due to clean air laws introduced to combat acid rain\", said Edward Gryspeerdt, associate professor in atmospheric physics, Imperial College London. Aerosols cause clouds to reflect less light, so fewer of them allows more sunshine down to Earth. There is \"no definitive evidence\" that climate change is impacting sunshine levels, according to the Met Office. Solar energy in the limelight All that sunshine, combined with the build out of more solar farms and panels on roofs, meant solar power soared to record levels in 2025. By November, solar had already generated 18Twh of electricity, far more than the 14Twh by the end of December last year. John Marsham, professor of atmospheric science at Leeds University, said solar energy was \"helping to lower prices\" of electricity by breaking the link with gas prices. The Ember thinktank also found just 2% of days in a typical year have both low wind and low sunshine, meaning 98% of the time it is either windy or sunny. Ember analyst Frankie Mayo said: \"At a national scale, solar power pairs well with wind farms which generate more in winter, when it's less sunny.\" Read more from Sky News:Imran Khan 'held in death cell'Boy arrested over girl's murder However, large solar farms have proved unpopular in some local communities for their impact on the landscape, such as in Lincolnshire, where several large sites recently were given the go-ahead. Craig Dyke from the UK's energy system operator NESO said: \"It's hard to believe how far Britain has come over the past quarter of a century, with renewables now producing around 60% of our electricity - up from just 3% in the year 2000.\""
    },
    {
        "title": "Film director Rob Reiner's son could face death penalty if found guilty of parents' killings, prosecutors say",
        "description": "Rob Reiner's son Nick could face the death penalty if he is found guilty of murdering his parents, Los Angeles prosecutors have said.",
        "url": "https://news.sky.com/story/film-director-rob-reiners-son-could-face-death-penalty-if-found-guilty-of-parents-killings-prosecutors-say-13484543",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nick-reiner-actor_7112544.jpg?20251217002123",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-16 21:49:00",
        "Headline": "Nick Reiner will be charged with two counts of first degree murder over the killings, district attorney Nathan Hochman says. The 32-year-old is suspected in the deaths of the 78-year-old actor and his wife, Michele Singer Reiner.",
        "Content": "Rob Reiner's son Nick could face the death penalty if he is found guilty of murdering his parents, Los Angeles prosecutors have said. Nick Reiner will be charged with two counts of first degree murder over the killings, district attorney Nathan Hochman said. The 32-year-old is suspected in the deaths of the 78-year-old director and his wife, Michele Singer Reiner.   \"Rob Reiner was a brilliant actor and director, an iconic force in our entertainment industry for decades. His wife, Michel Singer Reine, was an equally iconic photographer and producer,\" said Mr Hochman. \"Their loss is beyond tragic. We will commit ourselves to bringing their murderer to justice.\" \n                  Obamas planned to see Reiners the night they were killed, says ex-US first lady\n                 \n                  Rob Reiner spoke to Eric Idle about future before he and wife were killed\n                 \n                  Rob Reiner latest: Son could face death penalty as he's charged over the killings of Rob Reiner and wife Michele, LA police say\n                 Prosecutors said they would file the charges - two counts of first degree murder with a special circumstance of multiple murders, later on Tuesday. They will also include a special allegation he used a dangerous weapon, a knife. Mr Hochman said the charges carry a maximum sentence of life in prison without the possibility of parole or the death penalty, adding \"no decision\" has been made with respect to the death penalty. \"This case is heartbreaking and deeply personal, not only for the Reiner family and their loved ones but for our entire city,\" LA Police chief Jim McDonnell said. \"We will continue to support the Reiner family and ensure that every step forward is taken with care, dignity and resolve.\" Their tributes were a stark contrast to Donald Trump's response to the news, which prompted the US president to attack Mr Reiner as \"tortured and struggling, but once very talented\". In a post on his Truth Social platform, Mr Trump said Mr Reiner and his wife died \"reportedly due to the anger he caused others through his massive, unyielding, and incurable affliction with a mind crippling disease known as TRUMP DERANGEMENT SYNDROME\". Read more: Rob Reiner spoke to Eric Idle about future before he was killed It comes after it emerged Mr Reiner's son was reportedly disruptive at a party hosted by comedian Conan O'Brien the night before the killings. Nick Reiner joined his father and mother at the event on Saturday - and the couple were upset and embarrassed about his behaviour, Sky News' US partner NBC News cited a source as saying. They also expressed concerns about his health. The outlet cited another source saying Nick Reiner's behaviour had made other guests uncomfortable. They said he interrupted a conversation filmmaker Bill Hader was having with two guests and - when informed it was a private conversation - stood still and stared before storming off. The couple were found dead from apparent stab wounds at their home in the Brentwood neighbourhood on the west side of Los Angeles. Nick Reiner did not resist when he was arrested hours later in the Exposition Park area, near the University of Southern California, around four miles from the crime scene, police said. He had been expected to make an initial court appearance earlier on Tuesday, but his attorney said he was not brought from jail to the courthouse for medical reasons, and the appearance would not happen before Wednesday. Nick Reiner has not yet entered a plea. Rob Reiner was a celebrated director, whose work included some of the most memorable films of the 1980s and 1990s, including This Is Spinal Tap, The Princess Bride, When Harry Met Sally and A Few Good Men. He met Michele Singer in 1989, while directing When Harry Met Sally, and they had three children together. Michele used to work as a photographer and took the photo of Donald Trump that appears on the cover of his book Trump: The Art Of The Deal."
    },
    {
        "title": "Doctor sentenced over Matthew Perry's death",
        "description": "A doctor has been sentenced to eight months of home confinement over the fatal overdose of Friends star Matthew Perry after pleading guilty to a drugs charge.",
        "url": "https://news.sky.com/story/doctor-sentenced-over-matthew-perrys-death-13484357",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mark-chavez-matthew-perry_6943977.jpg?20250617003152",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-16 13:59:00",
        "Headline": "Mark Chavez, 55, pleaded guilty to one count of conspiracy to distribute ketamine.",
        "Content": "A doctor has been sentenced to eight months of home confinement over the fatal overdose of Friends star Matthew Perry after pleading guilty to a drugs charge. Mark Chavez, whose sentence included three years of supervised release, addressed the judge on Tuesday, saying he had recently lost a loved one and understood the grief that Perry's death caused. \"I just want to say my heart goes out to the Perry family,\" he added. Mr Chavez admitted to selling ketamine to another doctor, Salvador Plasencia, who supplied ketamine to Perry.  Plasencia contacted Chavez, 55, after learning that Perry, whose history of drug addiction was well documented, was interested in obtaining ketamine. In text messages, Plasencia told Chavez - who previously ran a ketamine clinic - \"I wonder how much this moron will pay\" and \"Lets [sic] find out\". \n                  Doctor to plead guilty to giving Matthew Perry ketamine before Friends star suffered fatal overdose\n                 \n                  Lisa Kudrow says the cast of Friends only met up once after hit show ended - as she speaks about Matthew Perry's death\n                 \n                  Matthew Perry: Courteney Cox pays tribute to Friends co-star a year on from his death\n                 Chavez, who pleaded guilty to one count of conspiracy to distribute ketamine, admitted in his plea agreement to diverting ketamine from his former clinic to sell to Plasencia. He also admitted to making false representations to a wholesale ketamine distributor in a bid to get more of the drug for Plasencia, submitting a bogus prescription in the name of a former patient without her knowledge or consent. Plasencia was introduced to Perry in September 2023 by one of his patients, who described the actor as a \"high profile person\" willing to pay \"cash and lots of thousands\" for ketamine. The same day they met, the doctor contacted Chavez, and drove to Costa Mesa to purchase $795 (£590) in ketamine vials and tablets, syringes, and gloves from him. Plasencia then drove to Perry's Los Angeles home, injected the star with ketamine, and left at least one more vial of ketamine with Perry's assistant, Kenneth Iwamasa, 60, who paid the doctor $4,500 (£3,350). Plasencia is said to have distributed 20 vials and multiple tablets to Iwamasa and Perry, netting $57,000 (£42,500) from 30 September to 12 October, 2023, despite the going price of ketamine being roughly $15 (£11) per vial. The 44-year-old was jailed for two-and-a-half years on 3 December after pleading guilty to four counts of distribution of ketamine, having already surrendered his California medical license. However, he did not supply the dose that killed Perry, who was found drowned in his hot tub at home after taking ketamine in October 2023. Iwamasa, 60, admitted to repeatedly injecting Perry with ketamine, despite having no medical training, including multiple times on the day he died. He pleaded guilty to one count of conspiracy to distribute ketamine causing death and will be sentenced in January. Also charged is Erik Fleming, 54, who admitted in court documents that he supplied the ketamine that killed Perry, having distributed 50 vials to Iwamasa - half of them four days before Perry died. He further stated he obtained the drug from 42-year-old Jasveen Sangha, a dual US-UK citizen, nicknamed the \"Ketamine Queen\". Fleming pleaded guilty to one count of conspiracy to distribute ketamine and one count of distribution of ketamine resulting in death. Sangha pleaded guilty to one count of maintaining a drug-involved premises, three counts of distribution of ketamine, and one count of distribution of ketamine resulting in death or serious bodily injury. They will be sentenced in January and February respectively. Perry had been taking ketamine legally as a treatment for depression, but sought more of the drug and started taking it unsupervised in the weeks before his death, acquiring it illegally from different sources. The actor starred in 10 seasons of Friends, from 1994 to 2004, alongside Jennifer Aniston, Courteney Cox, Lisa Kudrow, Matt LeBlanc and David Schwimmer, as well as appearing in the 2021 reunion show."
    },
    {
        "title": "Trump sues BBC for $10bn in lawsuit",
        "description": "Donald Trump has filed a defamation lawsuit against the BBC, alleging the corporation's Panorama documentary portrayed him in a \"false, defamatory, deceptive, disparaging, inflammatory, and malicious\" manner.",
        "url": "https://news.sky.com/story/trump-files-5bn-lawsuit-against-bbc-over-panorama-edit-13484000",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump-bbc_7111577.jpg?20251216010147",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-16 00:50:00",
        "Headline": "Clips were spliced together from sections of the US president's speech on 6 January 2021 to make it appear he told supporters he was going to walk to the US Capitol with them to \"fight like hell\".",
        "Content": "Donald Trump has filed a defamation lawsuit against the BBC, alleging the corporation's Panorama documentary portrayed him in a \"false, defamatory, deceptive, disparaging, inflammatory, and malicious\" manner. The complaint relates to the broadcaster's editing of a speech he made in 2021 on the day his supporters stormed the Capitol building. Clips were spliced together from sections of the US president's speech on January 6 2021 to make it appear he told supporters he was going to walk to the US Capitol with them to \"fight like hell\". It aired in the documentary Trump: A Second Chance?, which was broadcast by the BBC the week before last year's US election. The US president is seeking damages of no less than $5bn (£3.7bn) under a defamation lawsuit. He has also sued for $5bn for alleged violation of a trade practices law. Both lawsuits have been filed in Florida. 'They put words in my mouth' Speaking in the Oval Office earlier on Monday, he said: \"In a little while, you'll be seeing I'm suing the BBC for putting words in my mouth. \"Literally, they put words in my mouth. They had me saying things that I never said coming out.\" The scandal erupted earlier this year after a leaked memo highlighted concerns over the way the clips were edited. Responding to the lawsuit, a BBC spokesperson said: \"As we have made clear previously, we will be defending this case. We are not going to make further comment on ongoing legal proceedings.\" UK government minister Wes Streeting said Mr Trump has \"every reason to be angry\" and said the BBC was \"wrong and misrepresented\" what he said - but said the corporation apologised. However, he said the BBC is \"one of the most trusted news sources, not just in this country, but the world over\". After the leak, BBC chair Samir Shah apologised on behalf of the broadcaster over an \"error of judgement\" and accepted the editing of the 2024 documentary gave \"the impression of a direct call for violent action\". The fallout from the saga led to the resignation of both the BBC director-general Tim Davie and the head of news Deborah Turness. Earlier, BBC News reported the broadcaster had set out five main arguments in a letter to Mr Trump's legal team as to why it did not believe there was a basis for a defamation claim. In November, the BBC officially apologised to the president, adding that it was an \"error of judgement\" and saying the programme will \"not be broadcast again in this form on any BBC platforms\". A spokesperson said \"the BBC sincerely regrets the manner in which the video clip was edited\", but they also added that \"we strongly disagree there is a basis for a defamation claim\". Read more from Sky News:Why Britain isn't workingArmed forces chief's stark warning  'Trump's outrageous legal threat' Speaking on Mornings with Ridge and Frost, health minister Stephen Kinnock backed the BBC. He said: \"Well, it's absolutely right that the BBC is an independent organisation. \"I think they have apologised for one or two of the mistakes that were made in that Panorama programme. But they've also been very clear that there is no case to answer in terms of Mr Trump's accusations on the broader point about, libel or defamation. So, you know, I think it's right that the BBC stands firm on that point. \"Yes, there were some mistakes made in that particular piece of film, but I think the broader argument that they were making, they're right to stick by their guns on that. And I hope that they will continue to do so as an independent organisation, of course, funded by the licence fee, a hugely important institution.\" He added: \"I am a massive supporter. The government is a massive supporter of the BBC. The Labour Party will always stand up for the BBC as a vitally important institution, in both our political life and of course, in terms of entertaining and informing the British public.\" Liberal Democrat leader Sir Ed Davey said: \"Keir Starmer needs to stand up for the BBC against Trump's outrageous legal threat and protect licence fee-payers from being hit in the pocket. \"The Trump administration has clearly set out they want to interfere in our democracy, which includes undermining our national broadcaster. \"The prime minister needs to make clear this is unacceptable.\"  "
    }
]