[
    {
        "title": "Boy, 8, and girl, 10, killed in US Catholic school shooting named - as father brands attacker 'a coward'",
        "description": "The families of two children killed in the US Catholic school shooting have said their \"hearts are broken\" and branded the attacker a \"coward\".",
        "url": "https://news.sky.com/story/boy-8-and-girl-10-killed-in-us-catholic-school-shooting-named-as-father-brands-attacker-a-coward-13420257",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-fletcher-merkel-harper-moyski_7004124.png?20250829015540",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-28 21:20:00",
        "Headline": "Fletcher Merkel, 8, and Harper Moyski, 10, were killed during mass at Annunciation Catholic School in Minneapolis on Wednesday.",
        "Content": "The families of two children killed in the US Catholic school shooting have said their \"hearts are broken\" and branded the attacker a \"coward\". Fletcher Merkel who was eight and 10-year-old Harper Moyski were killed during mass at Annunciation Catholic School in Minneapolis on Wednesday. Eighteen other people were injured, including children aged between six and 15 and three adults in their 80s. Police said Robin Westman, a male born as Robert Westman, opened fire with a rifle through the windows of the school's church as children sat in pews.  'Our hearts are broken' Harper's parents, Michael Moyski and Jackie Flavin, remembered her as \"a bright, joyful, and deeply loved 10-year-old whose laughter, kindness, and spirit touched everyone who knew her\". \"Our hearts are broken not only as parents, but also for Harper's sister, who adored her big sister and is grieving an unimaginable loss. As a family, we are shattered, and words cannot capture the depth of our pain,\" their statement said. They urged leaders and communities to \"take meaningful steps to address gun violence and the mental health crisis in this country.\" \"Change is possible, and it is necessary - so that Harper's story does not become yet another in a long line of tragedies,\" the statement added. 'Fletcher loved his family' In a statement reported by Sky's US partner network NBC News, Fletcher's father Jesse Merkel blamed the \"coward\" killer for why the boy's family can't \"hold him, talk to him, play with him, and watch him grow into the wonderful young man he was on the path to becoming\". He said: \"Fletcher loved his family, friends, fishing, cooking, and any sports that he was allowed to play. \"While the hole in our hearts and lives will never be filled, I hope that in time, our family can find healing.\" Mr Merkel also praised \"the swift and heroic actions of children and adults alike from inside the church\". \"Without these people and their selfless actions, this could have been a tragedy of many magnitudes more. For these people, I am thankful,\" he added. Mayor calls for assault weapon ban It comes after Minneapolis mayor Jacob Frey called for a statewide and federal ban on assault weapons, a day after the deadly school shooting.  \"Thoughts and prayers are not going to cut it. It's on all of us to see this through,\" the mayor said at a news conference. \"We need a statewide and a federal ban on assault weapons. \"We need a statewide and a federal ban on high-capacity magazines. There is no reason that someone should be able to reel off 30 shots before they even have to reload. \"We're not talking about your father's hunting rifle gear. We're talking about guns that are built to pierce armour and kill people.\" Meanwhile, Minneapolis police chief Brian O'Hara gave an update on the investigation, saying the suspect had fired 116 rifle rounds into the church. \"It is very clear that this shooter had the intention to terrorise those innocent children,\" he added, before saying the killer \"fantasised\" about the plans of other mass shooting attackers and wanted to \"obtain notoriety\". Read more from Sky News:Man 'who impersonated Michael Jackson' was 'unfairly dismissed'Concern as British couple detained in Iran 'whisked' to courtroom Thomas Klemond, interim CEO of Minneapolis's main trauma hospital Hennepin Healthcare, said at an earlier news conference that the hospital was treating nine patients injured in the shooting. One child at the hospital was in a critical condition, he added. Children's Minnesota Hospital also said that three children remain in its care as of Thursday morning."
    },
    {
        "title": "New details released about killer in Catholic school shooting in US",
        "description": "Police have released new details about the killer in the US Catholic school shooting - including that they \"idolised\" mass murderers and they wanted to \"watch children suffer\". ",
        "url": "https://news.sky.com/story/new-details-released-about-killer-in-catholic-school-shooting-in-us-13419977",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-catholic-annunciation-school_7004012.jpg?20250828204908",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-28 13:21:00",
        "Headline": "Minneapolis Police Chief Brian O'Hara said the attacker, who \"fantasised\" about the plans of other mass shooting attackers, fired 116 rifle rounds into Annunciation Catholic School's church.",
        "Content": " Police have released new details about the killer in the US Catholic school shooting - including that they \"idolised\" mass murderers and they wanted to \"watch children suffer\".  Two children, aged eight and 10, were killed during mass at Annunciation Catholic School in Minneapolis on Wednesday. One of the victims has been named as Fletcher Merkel - click here to read more Eighteen other people were injured, including children aged between six and 15 and three adults in their 80s. Police said Robin Westman, a male born as Robert Westman, opened fire with a rifle through the windows of the school's church as children sat in pews. Almost 120 rifle rounds fired, police chief says In a news conference on Thursday, Minneapolis Police Chief Brian O'Hara said the attacker fired 116 rifle rounds into the church. \"It is very clear that this shooter had the intention to terrorise those innocent children,\" he added. The police chief said the killer \"fantasised\" about the plans of other mass shooting attackers and wanted to \"obtain notoriety\". When asked about the attacker obtaining the firearms used legally, Mr O'Hara said that they did not have a criminal history or any diagnosed mental health disorders. While they had potentially concerning social media posts, the police chief added that there was no evidence to suggest that Westman was legally barred from purchasing a firearm. Suspect 'wanted to watch children suffer' Joe Thompson, acting US attorney for Minnesota, also said evidence recovered of the killer's plans showed \"pure indiscriminate hate\" and that they \"idolised some of the most notorious school shooters and mass murderers in our country's history\". \"I won't dignify the shooter's words by repeating them,\" Mr Thompson added. \"They are horrific and vile, but in short, the shooter wanted to watch children suffer.\" Earlier, the mayor of Minneapolis called for a statewide and federal ban on assault weapons after the deadly attack, saying \"thoughts and prayers are not going to cut it\". \"There is no reason that someone should be able to reel off 30 shots before they even have to reload,\" Jacob Frey said. \"We're not talking about your father's hunting rifle gear. We're talking about guns that are built to pierce armour and kill people.\"  Thomas Klemond, interim CEO of Minneapolis's main trauma hospital Hennepin Healthcare, said at a news conference that the hospital was treating nine patients injured in the shooting. One child at the hospital was in a critical condition, he added. Children's Minnesota Hospital also said that three children remain in its care as of Thursday morning. Read more from Sky News:Cost of weight-loss drug to be discounted in UK pharmaciesWhat could happen next at Man Utd after Grimsby humiliationUN staff pressure human rights chief to call Gaza a genocide In a post on Facebook, the hospital said \"there are no words to describe the overwhelming pain many are feeling\", adding: \"We feel that pain with you. \"To the entire Annunciation community, you have our deepest condolences. During this time of unimaginable grief and loss, we want you to know that we at Children's Minnesota are with you. \"We will always be here to care for you. And in this moment, we hurt alongside you.\""
    },
    {
        "title": "Vladimir Putin may be playing for time while he carries on beating down Ukraine's will to win",
        "description": "After all those raised hopes of peace, Ukraine has been hit by the second-worst night of Russian air attacks since the war began.",
        "url": "https://news.sky.com/story/vladimir-putin-may-be-playing-for-time-while-he-carries-on-beating-down-ukraines-will-to-win-13420100",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-russia-kyiv-ukraine_7003843.jpg?20250828190125",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-08-28 16:41:00",
        "Headline": "Ukraine is hitting back, particularly at Russia's oil installations, but analysts don't expect it will be enough to persuade Vladimir Putin to end the war.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  After all those raised hopes of peace, Ukraine has been hit by the second-worst night of Russian air attacks since the war began. So much for diplomacy, despite the Alaska summit, then the Washington DC meeting. The Kremlin says it was aiming at military targets, but yet again, the pictures tell a very different story. Follow latest: UK summons Putin's ambassador One civilian building after another was hit, more than a dozen people were killed and British Council and EU buildings were also damaged. So what's going on? Why is Vladimir Putin doing it? Because he can. The Russian president thinks he's winning this war, and it's hard to escape the conclusion that he's using diplomacy to play for time while he carries on beating down the Ukrainians will to win. And at the moment, no one is stopping him  Ukraine is hitting back, particularly at Russia's oil installations, more of them going up in thick black smoke, after being hit by long-range Ukrainian drones. It is taking a heavy toll on Putin's 'Achilles heel', but on its own, analysts don't expect it will be enough to persuade him to end this war.  The West can wring its hands in condemnation. But it's divided between Europe that wants a ceasefire and much more severe sanctions, and President Trump, who, it seems, does not - strangely always willing to sympathise with the Russians more than Ukraine. He's back to blaming Ukraine for starting the war, saying earlier in the week that Kyiv should not have got into a war it had no chance of winning. It is a grotesque perversion of history. Ukraine, of course, had no choice but to fight to defend itself when it was invaded in an act of unprovoked aggression. Every time the US president has condemned Russia for these kinds of attacks, he has never followed through and done nothing to punish them. More worryingly for the Ukrainians, the Russians are getting the upper hand in the drones war, taking Iranian technology and souping it up into faster-moving drones that the Ukrainians are having increasing difficulty bringing down. They expect as many as a thousand drones a night coming their way by the winter, and many, many more innocents to die. Next week, Putin will join Chinese and North Korean leaders in a summit in Beijing, both supporting his war in Ukraine. Read more from Dominic Waghorn:Ukrainians warn they're in danger of losing drone arms raceWe are further away from peace now than we were two weeks ago A war that began as one man's mad idea has, in three and a half years, metastasised into a titanic struggle between east and west, fought increasingly with machines in a dystopian evolution of war. If President Trump is not prepared to use his power to bring this war to an end, what will another three and a half years of his presidency bring? It is a chilling question."
    },
    {
        "title": "Chickenpox vaccine to be offered on NHS next year, as part of routine MMR jab for babies",
        "description": "A vaccine against chickenpox will be rolled out on the NHS in England for the first time next year.",
        "url": "https://news.sky.com/story/chickenpox-vaccine-to-be-offered-on-nhs-next-year-as-part-of-routine-mmr-jab-for-babies-13420248",
        "image_url": "https://e3.365dm.com/23/01/1920x1080/skynews-chickenpox-infection_6040635.jpg?20230130094711",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-28 20:51:00",
        "Headline": "The UK Health Security Agency said the varicella vaccination will be available for babies aged between 12 and 18 months old, and is expected to protect around 500,000 every year.",
        "Content": "A vaccine against chickenpox will be rolled out on the NHS in England for the first time next year. The varicella vaccination is currently only available through private treatment and costs around £150. But under new plans, the jab will be included in a new NHS childhood immunisation programme - joining the current range against measles, mumps, and rubella. In a statement, the UK Health Security Agency (UKHSA) said GPs will be able to offer the MMRV (measles, mumps, rubella and varicella) vaccination from January 2025. It will be available for babies aged between 12 and 18 months old, and is expected to protect around 500,000 every year. According to the NHS website, the vaccine provides around 98% protection in children and about 75% protection in adults after two doses. Further booster doses are also not needed. The most well-known symptom of chickenpox is an itchy, spotty rash over the body. But before this appears, children may have a high temperature, a loss of appetite, and may feel generally unwell.\n\n Chickenpox usually gets better on its own within one to two weeks - but some children can develop complications such as bacterial infections like group A strep.\n\n In the rarest cases, the virus can cause swelling of the brain, serious lung inflammation and stroke, sometimes leading to death. Dr Gayatri Amirthalingam, the UKHSA's deputy director of immunisation, called the wider rollout \"excellent news\". He added it would help \"prevent what is for most a nasty illness and for those who develop severe symptoms, it could be a life saver\". Amanda Doyle, national director for primary care and community services at NHS England, also said it marked \"a hugely positive moment for families\". She added: \"We will work with vaccination teams and GP surgeries across the country to roll out the combined MMRV vaccine in the new year, helping to keep children healthy and prevent sickness from these highly contagious viruses.\" Read more:Why are childhood vaccine rates so low?Bereaved mum urges parents to book kids' vaccinations The Joint Committee on Vaccination and Immunisation (JCVI) recommended back in 2023 that the varicella jab should be given to youngsters in two doses as babies. It is also already part of the routine vaccine schedules in a number of countries, including Germany, Australia, Canada and the US. The announcement comes after UKHSA figures showed none of the main childhood vaccines in England reached their uptake targets last year. Some 91.9% of five-year-olds have received one dose of the measles, mumps, and rubella vaccine - a number unchanged from the previous year and at the lowest level since 2010/2011. Just 83.7% of children aged five had received both MMR doses, down year-on-year from 83.9%, and the lowest level since 2009/10."
    },
    {
        "title": "Japan releases AI-generated video showing simulation of Mount Fuji violently erupting",
        "description": "Japanese officials have released an AI-generated video showing a simulation of Mount Fuji violently erupting to raise awareness about a potential disaster.",
        "url": "https://news.sky.com/story/japan-releases-ai-generated-video-showing-simulation-of-mount-fuji-violently-erupting-13420214",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-mount-fuji-japan_7004068.png?20250828220314",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-28 20:01:00",
        "Headline": "The video was released to mark Volcanic Disaster Preparedness Day and warns an eruption could strike \"at any moment, without warning\".",
        "Content": " Japanese officials have released an AI-generated video showing a simulation of Mount Fuji violently erupting to raise awareness about a potential disaster. The video was released to mark Volcanic Disaster Preparedness Day and warns an eruption could strike \"at any moment, without warning\". It depicts a plume of smoke billowing from the volcano before ash falls over central Tokyo, which lies around 60 miles away. The city is then shown covered in ash within hours of an eruption, bringing transport to a halt, disrupting food and power supplies and causing long-term respiratory issues. \"We need to arm ourselves with facts and prepare for disaster in our daily lives,\" it says. The video also shows a family stocking their pantry with canned food and a first aid kit. Tokyo's city government said there are currently no signs of Fuji erupting. It explained: \"The simulation is designed to equip residents with accurate knowledge and preparedness measures they can take in case of an emergency.\" Read more:Family sue OpenAI over teenager's death after he confided in ChatGPTWhy the tech bubble seems safe - for now Japan is highly vulnerable to natural disasters and is known for its planning for earthquakes, typhoons, floods, mudslides and volcanic eruptions. It sits on the Pacific Ring of Fire and is home to 111 of the world's roughly 1,500 active volcanoes. Mt Fuji is Japan's tallest peak. It used to erupt around once every 30 years, but has been dormant since 1707."
    },
    {
        "title": "Cost of weight-loss drug Mounjaro to be discounted in UK pharmacies when price hike comes into force, Sky News learns",
        "description": "The cost of Mounjaro, one of Britain's biggest-selling weight loss drugs, will be heavily discounted across UK pharmacies when the official list price soars next week, Sky News has learned.",
        "url": "https://news.sky.com/story/cost-of-weight-loss-drug-mounjaro-to-be-heavily-discounted-across-uk-pharmacies-amid-price-hike-13419987",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mounjaro-weight-loss_6948297.jpg?20250623033923",
        "type": "Home",
        "Author": "Thomas Moore",
        "Date Published": "2025-08-28 13:48:00",
        "Headline": "A confidential document from the makers Eli Lilly to pharmacies sets out the scheme, with a saving of £83 on the cost of the maximum dose.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  The cost of Mounjaro, one of Britain's biggest-selling weight loss drugs, will be heavily discounted across UK pharmacies when the official list price soars next week, Sky News has learned. We've seen a confidential document from the makers Eli Lilly to pharmacies setting out the scheme, with a saving of £83 on the cost of the maximum dose. It would take some of the sting out of the sharp price hike previously announced by the pharmaceutical giant. But, under the new plans, the cost will still double for the 15mg top dose, rising from £122 a month to £247.50 from 1 September. The price of the highest dose was set to go up 170%, from £122 to £330. Lower doses will get smaller discounts. Eli Lilly confirmed the scheme. In a statement to Sky News, it said: \"We are working with private providers on commercial arrangements to maintain affordability and expect these to be passed onto patients when the change is effective on 1 September. \"We are already seeing providers respond in different ways to the list price change, with a range of options available for eligible patients.\" Read more:Mounjaro manufacturer pauses UK shipments of weight lossWhat are weight loss jabs and what were they designed to do?  Many obese patients have been thrown by the sharp rise in the cost of the drug, announced with just two weeks' warning. More than 1.25 million people in the UK are taking weight loss drugs, the vast majority of them paying privately because NHS provision is severely limited. Around 90% of them are currently taking weekly injections of Mounjaro - also known by its generic name tirzepatide. Clinical trials show people lose 20% of their weight in a matter of months. The alternative drug Wegovy leads to weight loss of 15%. Reece Maddick has been taking Mounjaro since November, when he weighed 24st (152kg). He has since lost more than 6st (38kg), with a dramatic improvement to his physical and mental wellbeing. He stockpiled a two-month supply when he heard the price was rising, but he isn't sure he can afford to continue treatment beyond that. \"It does petrify me,\" he said. \"I don't want to go back to where I was eight or nine months ago.\" He recently missed a weekly dose and almost immediately found his appetite returning. \"I fear just from that week missing it,\" he said. \"I think it's like jumping off a cliff, and you're back to square one. I'd put all the weight back on. No doubt in my mind.\" The online pharmacy CheqUp is shipping 4,000 orders for weight-loss drugs every day from its base in Chippenham, Wiltshire. Almost all are for Mounjaro. It thinks most users will switch to Wegovy because it will be cheaper than Mounjaro from next month. But they fear others will take risks with their health to try to save money. James Hunt, the pharmacy's director, said: \"We would urge absolutely everybody to avoid the black market, to avoid beauticians offering to give you injections of semaglutide (Wegovy) or tirzepatide (Mounjaro). Absolutely do not do that. \"We would also urge people not to microdose, not to skip weeks. \"If you're taking a medication you need to use that medication as it's been instructed and designed to be used clinically.\" The price rise followed complaints by US President Donald Trump that \"foreign freeloaders\" were getting a better deal on medicines than Americans, with the White House pressuring pharmaceutical giants to increase the price of the drug abroad so it can be made cheaper in the US. Eli Lilly said the UK was one of the first countries to roll out Mounjaro, and the list price had been significantly lower than the European average. In a statement, it said: \"We are now aligning the list price more consistently to ensure fair global contribution to the cost of innovation.\" Olivier Picard, chair of the National Pharmacy Association, said: \"This rebate will mitigate some of the impact of the increase in Mounjaro prices faced by pharmacies but patients should still anticipate seeing a rise in prices from 1 September. \"Prices advertised in many pharmacies will already reflect this discount and pharmacies will also have to wait to receive this retrospectively after dispensing.\""
    },
    {
        "title": "Grimsby humiliation may leave Man Utd asking if boss Ruben Amorim is out of ideas",
        "description": "The creativity at Manchester United these days is finding ways of sinking to new lows.",
        "url": "https://news.sky.com/story/grimsby-humiliation-may-leave-man-utd-asking-if-boss-ruben-amorim-is-out-of-ideas-13420065",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-manchester-united-ruben-amorim_7003780.jpg?20250828165255",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-08-28 17:16:00",
        "Headline": "The defeat was the first time the club had ever lost to a fourth-tier side in the League Cup, and it leaves their manager under increased pressure.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  The creativity at Manchester United these days is finding ways of sinking to new lows. However often they change managers, however much they spend, this is a giant of a club unable to escape the doom cycle. Never before last night had Manchester United lost to a fourth-tier club in the League Cup before Grimsby knocked them out. A team that has relied on free transfers in the summer beat one that has already benefited from £200m in squad reinforcements in the transfer window. So Ruben Amorim cannot complain that he has not been backed by the ownership. He's even got his players back in upgraded training facilities. When the refurbishment was unveiled earlier this month, co-owner Sir Jim Ratcliffe talked about the club enjoying a brand that \"stands shoulder to shoulder with Coca-Cola and Apple\". But how much can the brand withstand the dominance turning into disarray on the pitch? 'The club has to compete at the highest level' As Sir Jim said: \"The club has to compete at the highest level that is appropriate to the size and history of the club.\" Churning through managers has not been working. They are now on their sixth permanent appointment since the end of the Sir Alex Ferguson era, back when the trophy cabinet was packed. Can they really contemplate discarding Amorim after less than 10 months? Read more:British Tour de France-winning cyclist airlifted to hospitalTennis star denies being racist at US Open Especially after backing him by signing Benjamin Sesko, Bryan Mbeumo and Matheus Cunha. But incredibly for United, it is only August, and the FA Cup might be their only realistic shot at silverware. Grimsby was preceded by a defeat and a draw to open the Premier League following their lowest-ever finish in the competition last season. Lose to Burnley on Saturday, and they will head into the international break with growing doubts about the suitability of a 40-year-old manager hired based on his success in Lisbon with Sporting. Amorim might not have helped his cause by providing a defining image of the night they lost on penalties to Grimsby. When trailing 2-0 - before hauling the game back to 2-2 - he was seen fiddling with a tactics board with magnetic players in the dugout. He looked befuddled. And if things get any worse, United could wonder if he has run out of ideas."
    },
    {
        "title": "How the US trade war is now targeting you from today",
        "description": "Donald Trump has cancelled a loophole from today that had allowed consumers and businesses to be spared duties for sending low-value goods to the United States.",
        "url": "https://news.sky.com/story/how-the-us-trade-war-is-now-targeting-you-from-today-13419843",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-trump-money-dollars_6965913.png?20250716092207",
        "type": "Home",
        "Author": "James Sillars",
        "Date Published": "2025-08-28 23:01:00",
        "Headline": "Very few have heard of de minimis rules but the US president has just imposed a big change on the rest of the world after first going after China's e-commerce giants.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump has cancelled a loophole from today that had allowed consumers and businesses to be spared duties for sending low-value goods to the United States. The so-called de minimis exemption had applied across the world before Trump 2.0 but the president has taken action - and the UK may soon follow suit - as part of his trade war. The relief had allowed goods worth less than $800 (£595) to enter the US duty-free since 2016. But now, low-cost packages face the same tariff rate as other, more expensive, goods. The reasons for the latest bout of protectionism are numerous and the ramifications are country and purpose specific. What is changing? It was no accident that China was the first destination to be slapped with this rule change. \n                  Ed Davey reveals he has written to King to explain Trump state dinner boycott\n                 \n                  Vladimir Putin may be playing for time while he carries on beating down Ukraine's will to win\n                 \n                  Historic legal battle launched as Fed governor Lisa Cook fights back against firing\n                 The duty exemption on low-value Chinese goods was ended in May as US retailers, in fact those across the Western world, complained bitterly that they were being undercut by cheap clothing, accessories and household goods shipped by the likes of Shein and Temu. From today, Mr Trump is expanding the end of the de minimis rule to the rest of the world. Why is Trump doing this? The president is not acting purely to protect US businesses. More duties mean more money for his tariff treasure chest, bolstering the goodies already pouring in from his base and reciprocal tariffs imposed on trading partners globally this year. The Trump administration has also called out \"deceptive shipping practices, illegal material and duty circumvention\". It also believes many parcels claiming to contain low-value goods have been used to fuel the country's supplies of fentanyl, with the importation of the illegal drug being used by the president as a reason for his wider trade war against allies including Canada. How will it apply?  Under the new rules, only letters and personal gifts worth less than $100 (£74) will still be free of import duties. Charges will depend on the tariff regime facing the country from where the goods are sent. Fox example, a parcel containing products worth $600 would raise $180 in extra duties when sent from a country facing a 30% tariff rate. It has sparked chaos in many countries, with postal services in places including Japan, Germany and Australia refusing to accept many items for delivery to the US until the practicalities of the new regime become clearer. What about the UK? All goods not meeting the £74 exemption criteria now face a 10% charge because that is the baseline tariff the US has slapped on imports from the UK. We were spared, if you remember, higher reciprocal tariffs under the so-called \"trade deal\". How will the process work? All shipping and delivery companies will be wading through the changes, with the big international operators such as DHL, FedEx and the like all promising to navigate the challenge. Royal Mail said on Thursday that it would be the first international postal service to have a dedicated operation. It said consumers could use its new postal delivery duties paid (PDDP) services both online and at Post Offices. But it explained that business customers faced different restrictions to individuals. Read more from Sky News:Up to 550 UK jobs to go at carmaker LotusWhy the tech bubble seems safe - at least for now Businesses would be charged a handling fee per parcel to cover additional costs and duties would be calculated based on where items were originally manufactured. While business account customers could be handed an invoice for the duties, it explained that consumers would have to pay at the point of buying postage. No customs declaration would be required, it concluded, for personal correspondence. Is the US alone in doing this? The answer is no, but it remains a fairly widespread relief globally. The European Union, for example, removed de minimis breaks back in 2021, making all e-commerce imports to the bloc subject to VAT. It is also now planning to introduce a fee of €2 on goods worth €150 or less to cover the costs of customs processing. Should the UK do the same?  The UK has been under pressure for many years to follow suit and drop its own £135 duty-free threshold as retailers battle the cheap e-commerce competition from China we mentioned earlier. A review was announced by the chancellor in April. Sky News revealed in July how the total declared trade value of de minimis imports into the UK in the 2024-25 financial year was £5.9bn - a 53% increase on the previous 12-month period. Any rise in revenue would be welcomed, not only by UK retailers, but by Rachel Reeves too as she looks to fill a renewed black hole in the public finances."
    },
    {
        "title": "Concern after British couple detained in Iran 'suddenly whisked' to courtroom",
        "description": "A British couple detained in Iran have been \"suddenly whisked\" to a courtroom in the country's capital, Tehran, their family have said.",
        "url": "https://news.sky.com/story/concern-after-british-couple-detained-in-iran-suddenly-whisked-to-courtroom-13420087",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-craig-and-lindsay-foreman_6831859.jpg?20250217182752",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-28 17:33:00",
        "Headline": "Lindsay and Craig Foreman were arrested in January during a round-the-world motorbike trip and were later charged with espionage - allegations the couple deny.",
        "Content": "A British couple detained in Iran have been \"suddenly whisked\" to a courtroom in the country's capital, Tehran, their family have said. Lindsay and Craig Foreman were arrested in January during a round-the-world motorbike trip and were later charged with espionage - allegations the couple deny. Their son, Joe Bennett, said the family were informed the pair, from East Sussex, appeared in court in Tehran on Wednesday with a \"state-appointed lawyer they only just met\". \"We cannot see how [this] could be considered to be a fair trial,\" he added. Mr Bennett's family said they are \"deeply concerned\" that they had no prior knowledge of the hearing being organised or carried out.  Earlier this month, the couple spoke to their family for the first time in seven months. They later said they were \"seriously worried\" about them after they were moved to one of Iran's \"harshest prisons\". Through their adviser, Radd Seiger, the family have now requested a meeting with Foreign Secretary David Lammy to ensure efforts are made to secure the couple's return to the UK as urgently as possible. Mr Bennett said the latest court update has raised the family's concerns about their well-being. \"The ambassador was due to visit Craig yesterday but that did not happen,\" he said. \"We are not sure if the ambassador went and Craig was not there because he was whisked away to court. \"This is deeply worrying, because it has been well over three-and-a-half months since Craig was last seen. \"At that time, he had already lost weight. \"Now, with no funds and no access to food beyond the bare minimum, I can only guess at how he must be.\" Read more from Sky News:UK plans to reimpose sanctions on Iran over nuclear weapon fearsUN staff pressure human rights chief to call Gaza a genocide The family said they understood Lindsay Foreman had been seen by ambassador Hugo Shorter on Wednesday and \"provided with a comfort pack of essential supplies\". Mr Bennett said the lack of transparency over the court hearing \"only deepens our concern\". \"We cannot see how being suddenly whisked into a courtroom with no warning, with a state-appointed lawyer they only just met, could be considered to be a fair trial,\" he said. \"At least they saw each other, which must be some relief. \"Craig has now been in Evin Prison for 25 days without access to funds. \"In Iran's prison system, detainees must rely on money credited to their accounts to buy food, clean water, and hygiene products. \"The Foreign, Commonwealth & Development Office (FCDO) has so far been unable to transfer money into Craig's account, leaving him without the essentials needed to survive. \"The lack of transparency only deepens our concern.\" The FCDO has warned all British and British-Iranian nationals not to travel to Iran due to a \"significant risk of arrest, questioning or detention\". A spokesperson for the FCDO said: \"We are deeply concerned by reports that two British nationals have been charged with espionage in Iran. We continue to raise this case directly with the Iranian authorities. \"We are providing them with consular assistance and remain in close contact with their family members.\""
    },
    {
        "title": "Cost of weight-loss drug Mounjaro to be discounted in UK pharmacies when price hike comes into force, Sky News learns",
        "description": "The cost of Mounjaro, one of Britain's biggest-selling weight loss drugs, will be heavily discounted across UK pharmacies when the official list price soars next week, Sky News has learned.",
        "url": "https://news.sky.com/story/cost-of-weight-loss-drug-mounjaro-to-be-heavily-discounted-across-uk-pharmacies-amid-price-hike-13419987",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mounjaro-weight-loss_6948297.jpg?20250623033923",
        "type": "UK",
        "Author": "Thomas Moore",
        "Date Published": "2025-08-28 13:48:00",
        "Headline": "A confidential document from the makers Eli Lilly to pharmacies sets out the scheme, with a saving of £83 on the cost of the maximum dose.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  The cost of Mounjaro, one of Britain's biggest-selling weight loss drugs, will be heavily discounted across UK pharmacies when the official list price soars next week, Sky News has learned. We've seen a confidential document from the makers Eli Lilly to pharmacies setting out the scheme, with a saving of £83 on the cost of the maximum dose. It would take some of the sting out of the sharp price hike previously announced by the pharmaceutical giant. But, under the new plans, the cost will still double for the 15mg top dose, rising from £122 a month to £247.50 from 1 September. The price of the highest dose was set to go up 170%, from £122 to £330. Lower doses will get smaller discounts. Eli Lilly confirmed the scheme. In a statement to Sky News, it said: \"We are working with private providers on commercial arrangements to maintain affordability and expect these to be passed onto patients when the change is effective on 1 September. \"We are already seeing providers respond in different ways to the list price change, with a range of options available for eligible patients.\" Read more:Mounjaro manufacturer pauses UK shipments of weight lossWhat are weight loss jabs and what were they designed to do?  Many obese patients have been thrown by the sharp rise in the cost of the drug, announced with just two weeks' warning. More than 1.25 million people in the UK are taking weight loss drugs, the vast majority of them paying privately because NHS provision is severely limited. Around 90% of them are currently taking weekly injections of Mounjaro - also known by its generic name tirzepatide. Clinical trials show people lose 20% of their weight in a matter of months. The alternative drug Wegovy leads to weight loss of 15%. Reece Maddick has been taking Mounjaro since November, when he weighed 24st (152kg). He has since lost more than 6st (38kg), with a dramatic improvement to his physical and mental wellbeing. He stockpiled a two-month supply when he heard the price was rising, but he isn't sure he can afford to continue treatment beyond that. \"It does petrify me,\" he said. \"I don't want to go back to where I was eight or nine months ago.\" He recently missed a weekly dose and almost immediately found his appetite returning. \"I fear just from that week missing it,\" he said. \"I think it's like jumping off a cliff, and you're back to square one. I'd put all the weight back on. No doubt in my mind.\" The online pharmacy CheqUp is shipping 4,000 orders for weight-loss drugs every day from its base in Chippenham, Wiltshire. Almost all are for Mounjaro. It thinks most users will switch to Wegovy because it will be cheaper than Mounjaro from next month. But they fear others will take risks with their health to try to save money. James Hunt, the pharmacy's director, said: \"We would urge absolutely everybody to avoid the black market, to avoid beauticians offering to give you injections of semaglutide (Wegovy) or tirzepatide (Mounjaro). Absolutely do not do that. \"We would also urge people not to microdose, not to skip weeks. \"If you're taking a medication you need to use that medication as it's been instructed and designed to be used clinically.\" The price rise followed complaints by US President Donald Trump that \"foreign freeloaders\" were getting a better deal on medicines than Americans, with the White House pressuring pharmaceutical giants to increase the price of the drug abroad so it can be made cheaper in the US. Eli Lilly said the UK was one of the first countries to roll out Mounjaro, and the list price had been significantly lower than the European average. In a statement, it said: \"We are now aligning the list price more consistently to ensure fair global contribution to the cost of innovation.\" Olivier Picard, chair of the National Pharmacy Association, said: \"This rebate will mitigate some of the impact of the increase in Mounjaro prices faced by pharmacies but patients should still anticipate seeing a rise in prices from 1 September. \"Prices advertised in many pharmacies will already reflect this discount and pharmacies will also have to wait to receive this retrospectively after dispensing.\""
    },
    {
        "title": "UK summons Russian ambassador after British Council building hit in Kyiv",
        "description": "The Russian ambassador to the UK has been summoned by the Foreign Office following attacks on Kyiv overnight.",
        "url": "https://news.sky.com/story/uk-to-summon-russian-ambassador-after-british-council-building-hit-in-kyiv-sky-news-understands-13419902",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-russian-ambassador_7003610.jpg?20250828133116",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-28 10:52:00",
        "Headline": "The Russian ambassador has been summoned after a British Council building in Kyiv suffered major damage in overnight strikes on Ukraine's capital city",
        "Content": " The Russian ambassador to the UK has been summoned by the Foreign Office following attacks on Kyiv overnight. It comes after the British Council building in the Ukrainian capital suffered major damage in Russian strikes. Politics latest: Blair 'needs' to disclose what he told Trump about Gaza, Lib Dems say Foreign Secretary David Lammy confirmed the government had summoned Andrey Kelin in response. Mr Kelin was seen arriving at the Foreign Office building in Whitehall today. Mr Lammy posted on X: \"Putin's strikes last night killed civilians, destroyed homes and damaged buildings, including the British Council and EU Delegation in Kyiv. \"We have summoned the Russian Ambassador. The killing and destruction must stop.\" The British Council's chief executive, Scott McDonald, said their guard for the building was injured but \"stable\". \"At the insistence of my amazing colleagues, we will continue operations in Ukraine today wherever possible,\" he said. \"Their resilience is awe-inspiring, and I am deeply thankful they are all safe.\" Earlier, Sir Keir Starmer said: \"My thoughts are with all those affected by the senseless Russian strikes on Kyiv, which have damaged the British Council building. \"Putin is killing children and civilians, and sabotaging hopes of peace. This bloodshed must end.\" The British Council is an arms-length body from the government, and says its mission is to \"support peace and prosperity by building connections, understanding and trust between people in the UK and countries worldwide\". It facilitates schemes like working, living and learning abroad for British people. Most of its funding comes from the fees it charges people for its services, but it does also get funding from the Foreign Commonwealth and Development Office (FCDO). As well as the attack on the British Council building, Russia also targeted the EU delegation building in the Ukrainian capital overnight. Ursula von der Leyen, the president of the European Commission, told reporters two missiles hit within 50 metres of the site in 20 seconds.  And Kaja Kallas, the EU's foreign policy chief, said the bloc was also summoning Russia's ambassador following the strike. \"No diplomatic mission should ever be a target,\" she said. The attacks came as part of wider strikes on Kyiv, which destroyed homes and buildings and killed at least 15 people and injured 38, according to Ukrainian officials. Russia has said it targeted military sites and air bases in its large overnight strike on Ukraine - and that it is still interested in negotiations to meet its aims. \"The special military operation continues,\" he said, referring to Russia's full-scale invasion of Ukraine, which it launched in February 2022. \"You see that strikes on Russian infrastructure facilities are also continuing, and often Russian civilian infrastructure is targeted by the Kyiv regime.\" He added: \"At the same time, Russia will maintain its interest in continuing the negotiation process in order to achieve the goals we face through political and diplomatic means.\" Russia's latest attack on Ukraine has been widely condemned, with Germany's foreign minister Johann Wadephul saying there must be \"consequences\". \"Last night we once again experienced in a terrible way how Russia attacked and bombed Kyiv, civilians died, children died, and the European Union delegation was also attacked,\" he told reporters. \"And that cannot remain without consequences.\" Read more:British journalists demand action from PM over war in GazaSir Ed Davey to boycott Donald Trump state dinner Mr Wadephul added that Germany wanted to show it was considering a further response and that any action would be taken jointly by the EU. A Foreign Commonwealth and Development Office Spokesperson said: \"The UK condemns in the strongest terms these outrageous attacks on Ukrainians and the damage done to the British Council and EU Delegation. \"Russia's increasing attacks on Ukrainian civilians and cities, including Kyiv, are an escalation of the war and deeply irresponsible and are further sabotaging international peace efforts. \"We have made clear to the Russians that such actions will only harden UK and Western resolve to support Ukraine and bring an end to this unjustified war. \"Russia must stop this senseless killing and destruction immediately.\""
    },
    {
        "title": "Former Met Police volunteer guilty of raping and sexually assaulting a child",
        "description": "A former Metropolitan Police volunteer has been found guilty of raping and sexually assaulting a child.",
        "url": "https://news.sky.com/story/former-met-police-volunteer-guilty-of-raping-and-sexually-assaulting-a-child-13419776",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-james-bubb-gwyn-samuels_7003728.jpg?20250828155443",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-28 07:01:00",
        "Headline": "The ex-special constable, who now identifies as a woman named Gwyn Samuels, was also found guilty of raping a teenager.",
        "Content": "A former Metropolitan Police volunteer has been found guilty of raping and sexually assaulting a child. James Bubb, who now identifies as a woman named Gwyn Samuels, assaulted the victim multiple times when she was between the ages of 12 and 18. Jurors were told Bubb, who identified as male at the time of the offences, would be referred to by their biological sex when allegations were being discussed throughout the trial. Bubb met the victim on a video chat site in 2018, when he was around 21 and she was 12 years old. They then met in person for the first time at a Christian festival a few months later, the court was told. The trial heard Bubb sexually assaulted the girl in public shortly before her 13th birthday, and that he was violent towards the girl when he raped her in her early teens. In relation to the complainant, Bubb was on Thursday found guilty of one count of raping a child under 13, one count of sexual activity with a child, one count of assault of a child under 13 by penetration, and one count of assault by penetration. He was found not guilty of one count of rape and one count of sexual activity with a child in relation to that complainant, and found guilty of one count of rape against a second person. The defendant made no expression as the verdicts were read out, but sobbed with their head in their hands after the foreman finished speaking. Bubb, who is now 27, started training with the Met in 2020. The first victim said the defendant spoke \"a lot about the powers he had\" in his role as a special constable. Read more:Man arrested after racist abuse sent to England starBritish Tour de France winner in 'serious' crash The second complainant was a woman Bubb met online while posing as a 16-year-old girl. They met when the woman had just turned 18, and were in an on-off relationship between January 2018 and February 2023. She said Bubb used \"BDSM and kink as a way of creating control\" over her, and that he would \"use police training techniques\" on her. \"The control, the power he got, it sure as hell wasn't consensual,\" she told police. Bubb, of Chesham, Buckinghamshire, will be sentenced at a later date."
    },
    {
        "title": "British Tour de France-winning cyclist Chris Froome airlifted to hospital after 'serious' crash",
        "description": "Four-time Tour de France-winning cyclist Chris Froome has been airlifted to hospital following a \"serious\" crash in training.",
        "url": "https://news.sky.com/story/british-tour-de-france-winning-cyclist-chris-froome-airlifted-to-hospital-after-serious-crash-13419974",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-chris-froome-cyclist_7003656.jpg?20250828142635",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-28 13:11:00",
        "Headline": "The 40-year-old is set to have surgery later following the accident on Wednesday.",
        "Content": "Four-time Tour de France-winning cyclist Chris Froome has been airlifted to hospital following a \"serious\" crash in training. A statement posted from Froome's official X account said he did not suffer any head injuries but scans revealed he has a lower back fracture, a collapsed lung and five broken ribs. The 40-year-old Briton is in a stable condition and is set to have surgery for his back injury later on Thursday, the statement said. It added that an update on Froome's condition will be provided after the operation. No other cyclists or vehicles were involved in the crash. The British rider was on a training ride on Wednesday when the accident occurred and he was taken by helicopter to a hospital in Toulon on the French Riviera. He has been racing with Israel Premier-Tech since 2021, with the team posting on X after the crash: \"Please join us in wishing @chrisfroome well and a speedy recovery.\" Read more from Sky News:Tennis star denies being racistTop Boy actor appears in court on rape charges Froome won the Tour de France with Team Sky in 2013, 2015, 2016 and 2017 and has won the Vuelta a Espana twice and the Giro d'Italia once. However, the three-time Olympic bronze medallist has been nowhere near his best form since suffering serious injuries in a horrific high-speed crash during training for the Criterium du Dauphine in 2019. He spent more than three weeks in hospital after fracturing his neck, femur, elbow, hip and ribs when he crashed into a wall at high speed while training. Froome more recently broke his collarbone at the UAE Tour in February and has also hinted that 2025 could be his final year of competitive racing."
    },
    {
        "title": "'I'm shocked at how fragile I am still': Cumberbatch and Colman on protecting their sanity from perils of social media",
        "description": "Actor Benedict Cumberbatch says he's shocked at how \"fragile\" he still is - despite years in the spotlight and success in the industry.",
        "url": "https://news.sky.com/story/im-shocked-at-how-fragile-i-am-still-cumberbatch-and-colman-on-protecting-their-sanity-from-perils-of-social-media-13420109",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-colman-cumberbatch_7003853.jpg?20250828181517",
        "type": "UK",
        "Author": "Faye de Silva, news reporter",
        "Date Published": "2025-08-28 23:01:00",
        "Headline": "The pair star in new satirical black comedy The Roses - a remake of the 1989 hit film starring Michael Douglas and Kathleen Turner.",
        "Content": "By Faye de Silva, news reporter  Actor Benedict Cumberbatch says he's shocked at how \"fragile\" he still is - despite years in the spotlight and success in the industry. It might seem like the Doctor Strange star and The Crown actress Olivia Colman have it all when it comes to money and success - but they are also human like the rest of us. The pair lead the cast of new satirical black comedy The Roses, which sees picture-perfect couple Ivy and Theo Rose - a rising star chef and ambitious architect - raise their two children in California, while chasing their own dreams. 'I am shocked at how fragile I am' But behind its dark humour and comic language, the film also looks at the realities of power imbalance, insecurity and wounded pride - in even the strongest of relationships. And 49-year-old Cumberbatch - whose character faces a major setback in his career - tells Sky News that in real life the glare of social media only intensifies those type of situations. \"I am shocked at how fragile I am still. \n                  Benedict Cumberbatch and Gaby Hoffmann on Netflix series Eric\n                 \n                  Benedict Cumberbatch: 'I want to give them stability' - British actor says Ukrainian family will stay in his home\n                 \n                  Oscars red carpet fashion 2022: The best looks from the Academy Awards\n                 \"I don't go anywhere near it [social media] because of that. \"It's like walking into a place where people want to marry you or kill you. Those extremes. \"I think we will get to a stage, a corporate culture that's now manifested around it where people are obliged to do that in order to sell their lives, and therefore their brand and what they do for a living.\" Co-star Colman - who's long-shunned the online world - agrees. Read more from Sky News:Taylor Swift announces engagement to Travis Kelce - and reveals huge ringBridgerton creator on 'bizarre' criticism - Watch \"I'm afraid I am very thin-skinned. \"I don't look at any of it. My husband will look at a review and if it's nice he'll show me - but if it's anything mean he knows to just go 'don't look - don't look.' \"You just have to learn to be thicker-skinned. \"But actually, I think we need people who are sensitive and kind.\" 'Don't do it… delete it all' Colman - now 51, and whose leading role in The Favourite bagged her an Academy Award in 2019 - says no amount of experience and success can shield her from criticism. \"My advice to a young'un - sort of dipping their toe into the world of social media for the first time is absolutely don't do it. \"Delete it all. If you want a happy life, don't have any of it. I've never had it.\" The movie - directed by Meet The Parents' Jay Roach with The Favourite screenwriter Tony McNamara - also calls into question the notion of success - asking, is it really possible to have it all? Or is sacrifice inevitable when it comes to spinning the plates of a high-flying career, marriage and parenthood? Cumberbatch admits \"you can't do it all without there being a cost\". \"You just have to weigh up what those balances are,\" he adds. Colman says \"there are I suppose little sacrifices along the way\" - from both sides of a relationship. The comedy drama offers a fresh take on Warren Adler's novel The War Of The Roses - and the 1989 hit film adaptation- starring Michael Douglas and Kathleen Turner. Colman and Cumberbatch - both producers on the film - insist they weren't daunted by that though. \"We wanted to find a project to do together, and we have utter respect for the iconic status of the film and book,\" explains Cumberbatch. \"Hopefully this will have its own place in the culture - it's very different, it's not a remake - it's a reimagined jumping-on point.\" \"But beyond that, it's very different,\" adds Colman. Former Doctor Who Ncuti Gatwa and Barbie's Kate McKinnon also form the cast. The Roses is out in UK cinemas now."
    },
    {
        "title": "Chickenpox vaccine to be offered on NHS next year, as part of routine MMR jab for babies",
        "description": "A vaccine against chickenpox will be rolled out on the NHS in England for the first time next year.",
        "url": "https://news.sky.com/story/chickenpox-vaccine-to-be-offered-on-nhs-next-year-as-part-of-routine-mmr-jab-for-babies-13420248",
        "image_url": "https://e3.365dm.com/23/01/1920x1080/skynews-chickenpox-infection_6040635.jpg?20230130094711",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-28 20:51:00",
        "Headline": "The UK Health Security Agency said the varicella vaccination will be available for babies aged between 12 and 18 months old, and is expected to protect around 500,000 every year.",
        "Content": "A vaccine against chickenpox will be rolled out on the NHS in England for the first time next year. The varicella vaccination is currently only available through private treatment and costs around £150. But under new plans, the jab will be included in a new NHS childhood immunisation programme - joining the current range against measles, mumps, and rubella. In a statement, the UK Health Security Agency (UKHSA) said GPs will be able to offer the MMRV (measles, mumps, rubella and varicella) vaccination from January 2025. It will be available for babies aged between 12 and 18 months old, and is expected to protect around 500,000 every year. According to the NHS website, the vaccine provides around 98% protection in children and about 75% protection in adults after two doses. Further booster doses are also not needed. The most well-known symptom of chickenpox is an itchy, spotty rash over the body. But before this appears, children may have a high temperature, a loss of appetite, and may feel generally unwell.\n\n Chickenpox usually gets better on its own within one to two weeks - but some children can develop complications such as bacterial infections like group A strep.\n\n In the rarest cases, the virus can cause swelling of the brain, serious lung inflammation and stroke, sometimes leading to death. Dr Gayatri Amirthalingam, the UKHSA's deputy director of immunisation, called the wider rollout \"excellent news\". He added it would help \"prevent what is for most a nasty illness and for those who develop severe symptoms, it could be a life saver\". Amanda Doyle, national director for primary care and community services at NHS England, also said it marked \"a hugely positive moment for families\". She added: \"We will work with vaccination teams and GP surgeries across the country to roll out the combined MMRV vaccine in the new year, helping to keep children healthy and prevent sickness from these highly contagious viruses.\" Read more:Why are childhood vaccine rates so low?Bereaved mum urges parents to book kids' vaccinations The Joint Committee on Vaccination and Immunisation (JCVI) recommended back in 2023 that the varicella jab should be given to youngsters in two doses as babies. It is also already part of the routine vaccine schedules in a number of countries, including Germany, Australia, Canada and the US. The announcement comes after UKHSA figures showed none of the main childhood vaccines in England reached their uptake targets last year. Some 91.9% of five-year-olds have received one dose of the measles, mumps, and rubella vaccine - a number unchanged from the previous year and at the lowest level since 2010/2011. Just 83.7% of children aged five had received both MMR doses, down year-on-year from 83.9%, and the lowest level since 2009/10."
    },
    {
        "title": "Up to 550 UK jobs to go at carmaker Lotus with tariffs blamed",
        "description": "Up to 550 roles are to be cut across car maker Lotus's UK operations, the company said. ",
        "url": "https://news.sky.com/story/up-to-550-uk-jobs-to-go-at-carmaker-lotus-with-tariffs-blamed-13419972",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lotus-yellow-sport-car_7003673.jpg?20250828145106",
        "type": "UK",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-08-28 13:11:00",
        "Headline": "Despite the cuts, the company said it was committed to the UK, and staff may be moved to different areas of the business. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Up to 550 roles are to be cut across car maker Lotus's UK operations, the company said.  The losses will be made across the business, with no one portion in particular being pared back, a spokesperson said. A consultation process on the cuts is underway, and those who lose their job will have the opportunity to apply for another Lotus role. The company said it is \"actively exploring future growth opportunities to diversify Lotus Cars' business model, including through third-party manufacturing\". Most of Lotus's 1,300 employees work at the Norwich headquarters in Hethel, so it is this site which will sustain the greatest losses. Lotus also operates an engineering division in Wellesbourne, Warwickshire. Why are the jobs going? Uncertainty, including from President Trump's tariffs, was cited as the reason for the roles reduction. \n                  How the US trade war is now targeting you from today\n                 \n                  Cost of weight-loss drug Mounjaro to be discounted in UK pharmacies when price hike comes into force, Sky News learns\n                 \n                  Steel tycoon Gupta's troubles deepen amid Australian probe\n                 \"The proposal is designed to enable Lotus Cars to operate with a flexible and agile business model, allowing it to ramp operations and resources in line with demand, as and when needed,\" a statement read. \"We believe this is necessary in order to secure a sustainable future for the company in today's rapidly evolving automotive environment, which is seeing uncertainty with rapid changes in global policies including tariffs.\" Another reason the cuts are coming is the company's plans to use more resources from Lotus's global business. \"The company plans to increase integration globally across the wider Lotus group and is exploring greater resource sharing and collaboration across its operations\", it said. \"This comes on the heels of the recent news Lotus Technology plans to acquire 100% equity interest in Lotus UK in 2025, consolidating all Lotus businesses and operations together.\"  The former chief executive of Aston Martin, Andy Palmer, told Sky News that, like the rest of the car industry, Lotus had been struggling with Chinese customers moving to domestic electric car brands. Brand loyalty doesn't apply in the same way when customers are trying out something new, namely electric vehicles, Mr Palmer added. Lotus also allowed its brand equity to erode by manufacturing SUVs in China at \"aspirationally high volumes\". There is optimism from the fact Lotus is known in the industry for its expertise in creating lightweight vehicles, important at a time when electric vehicles need to be aerodynamic and reduce drag. Lotus said it was \"fully committed to the UK\". \"Norfolk will remain the home of the Lotus' sports car, motorsports and engineering consulting operations\"."
    },
    {
        "title": "How the US trade war is now targeting you from today",
        "description": "Donald Trump has cancelled a loophole from today that had allowed consumers and businesses to be spared duties for sending low-value goods to the United States.",
        "url": "https://news.sky.com/story/how-the-us-trade-war-is-now-targeting-you-from-today-13419843",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-trump-money-dollars_6965913.png?20250716092207",
        "type": "UK",
        "Author": "James Sillars",
        "Date Published": "2025-08-28 23:01:00",
        "Headline": "Very few have heard of de minimis rules but the US president has just imposed a big change on the rest of the world after first going after China's e-commerce giants.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump has cancelled a loophole from today that had allowed consumers and businesses to be spared duties for sending low-value goods to the United States. The so-called de minimis exemption had applied across the world before Trump 2.0 but the president has taken action - and the UK may soon follow suit - as part of his trade war. The relief had allowed goods worth less than $800 (£595) to enter the US duty-free since 2016. But now, low-cost packages face the same tariff rate as other, more expensive, goods. The reasons for the latest bout of protectionism are numerous and the ramifications are country and purpose specific. What is changing? It was no accident that China was the first destination to be slapped with this rule change. \n                  Ed Davey reveals he has written to King to explain Trump state dinner boycott\n                 \n                  Vladimir Putin may be playing for time while he carries on beating down Ukraine's will to win\n                 \n                  Historic legal battle launched as Fed governor Lisa Cook fights back against firing\n                 The duty exemption on low-value Chinese goods was ended in May as US retailers, in fact those across the Western world, complained bitterly that they were being undercut by cheap clothing, accessories and household goods shipped by the likes of Shein and Temu. From today, Mr Trump is expanding the end of the de minimis rule to the rest of the world. Why is Trump doing this? The president is not acting purely to protect US businesses. More duties mean more money for his tariff treasure chest, bolstering the goodies already pouring in from his base and reciprocal tariffs imposed on trading partners globally this year. The Trump administration has also called out \"deceptive shipping practices, illegal material and duty circumvention\". It also believes many parcels claiming to contain low-value goods have been used to fuel the country's supplies of fentanyl, with the importation of the illegal drug being used by the president as a reason for his wider trade war against allies including Canada. How will it apply?  Under the new rules, only letters and personal gifts worth less than $100 (£74) will still be free of import duties. Charges will depend on the tariff regime facing the country from where the goods are sent. Fox example, a parcel containing products worth $600 would raise $180 in extra duties when sent from a country facing a 30% tariff rate. It has sparked chaos in many countries, with postal services in places including Japan, Germany and Australia refusing to accept many items for delivery to the US until the practicalities of the new regime become clearer. What about the UK? All goods not meeting the £74 exemption criteria now face a 10% charge because that is the baseline tariff the US has slapped on imports from the UK. We were spared, if you remember, higher reciprocal tariffs under the so-called \"trade deal\". How will the process work? All shipping and delivery companies will be wading through the changes, with the big international operators such as DHL, FedEx and the like all promising to navigate the challenge. Royal Mail said on Thursday that it would be the first international postal service to have a dedicated operation. It said consumers could use its new postal delivery duties paid (PDDP) services both online and at Post Offices. But it explained that business customers faced different restrictions to individuals. Read more from Sky News:Up to 550 UK jobs to go at carmaker LotusWhy the tech bubble seems safe - at least for now Businesses would be charged a handling fee per parcel to cover additional costs and duties would be calculated based on where items were originally manufactured. While business account customers could be handed an invoice for the duties, it explained that consumers would have to pay at the point of buying postage. No customs declaration would be required, it concluded, for personal correspondence. Is the US alone in doing this? The answer is no, but it remains a fairly widespread relief globally. The European Union, for example, removed de minimis breaks back in 2021, making all e-commerce imports to the bloc subject to VAT. It is also now planning to introduce a fee of €2 on goods worth €150 or less to cover the costs of customs processing. Should the UK do the same?  The UK has been under pressure for many years to follow suit and drop its own £135 duty-free threshold as retailers battle the cheap e-commerce competition from China we mentioned earlier. A review was announced by the chancellor in April. Sky News revealed in July how the total declared trade value of de minimis imports into the UK in the 2024-25 financial year was £5.9bn - a 53% increase on the previous 12-month period. Any rise in revenue would be welcomed, not only by UK retailers, but by Rachel Reeves too as she looks to fill a renewed black hole in the public finances."
    },
    {
        "title": "Man sacked after 'impersonating Michael Jackson' was unfairly dismissed, tribunal finds",
        "description": "A man sacked from working in a warehouse after being accused of impersonating Michael Jackson was unfairly dismissed, an employment tribunal has found.",
        "url": "https://news.sky.com/story/man-sacked-after-impersonating-michael-jackson-was-unfairly-dismissed-tribunal-finds-13420129",
        "image_url": "https://e3.365dm.com/23/01/1920x1080/skynews-michael-jackson-pop-star_6041606.jpg?20230131095216",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-28 17:41:00",
        "Headline": "The Co-Operative Group was ordered to pay Lucasz Zawadzki more than £10,000 in compensation after an employment judge found he was unfairly dismissed.",
        "Content": "A man sacked from working in a warehouse after being accused of impersonating Michael Jackson was unfairly dismissed, an employment tribunal has found. Lucasz Zawadzki was accused by a colleague of making high-pitched \"hee hee\" noises mimicking the US pop star, the tribunal in Manchester heard. Mr Zawadzki was also accused by the colleague, who is black, of making monkey noises and being racist at the Co-Operative warehouse where they worked. He admitted making \"embarrassing and juvenile\" noises in the workplace but said they were not racist. The Co-Operative Group was ordered to pay him more than £10,000 in compensation after employment judge Carol Porter found he was unfairly dismissed. A colleague, referred to as SM, reported to his manager that he had been a victim of bullying in December 2023, according to the tribunal's judgment. Mr Zawadzki was told a complaint had been made against him in which the colleague alleged he made a \"screaming noise in the style of Michael Jackson\", which was described as a high-pitched \"hee hee\" sound. He later admitted making \"grunting and moaning\" noises with another colleague and agreed these could be described as \"orgasmic\" and it was \"not appropriate\" in the workplace. He also said a colleague had commented on his \"high-pitched laugh\". But he denied impersonating the US pop star and making monkey noises, saying he did not want to \"bully or hurt someone\". Read more from Sky News:UK plans to reimpose sanctions on Iran over nuclear weapon fearsUN staff pressure human rights chief to call Gaza a genocide The tribunal heard Mr Zawadzki was suspended after \"an alleged breach of the bullying, harassment and discrimination policy, specifically making inappropriate comments to a colleague causing hurt and distress\". In her judgment Judge Porter said: \"In essence the misconduct of the claimant was inappropriate and juvenile conduct in the workplace. \"There was no satisfactory evidence before the dismissing officer that that particular admitted conduct was offensive to SM, or caused him distress. \"There was no satisfactory evidence before the dismissing officer that the claimant had, by making those noises, engaged in bullying or harassment. \"The claimant gave clear evidence, which was not contradicted, that he had worked with SM for a long time and SM had never told him that he found this inappropriate and juvenile behaviour offensive.\" She also found \"the claimant was not aware of the company's zero-tolerance policy in relation to inappropriate and juvenile behaviour in the work place\" or had \"received any warnings that such behaviour was unacceptable\"."
    },
    {
        "title": "Boy, 8, and girl, 10, killed in US Catholic school shooting named - as father brands attacker 'a coward'",
        "description": "The families of two children killed in the US Catholic school shooting have said their \"hearts are broken\" and branded the attacker a \"coward\".",
        "url": "https://news.sky.com/story/boy-8-and-girl-10-killed-in-us-catholic-school-shooting-named-as-father-brands-attacker-a-coward-13420257",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-fletcher-merkel-harper-moyski_7004124.png?20250829015540",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-28 21:20:00",
        "Headline": "Fletcher Merkel, 8, and Harper Moyski, 10, were killed during mass at Annunciation Catholic School in Minneapolis on Wednesday.",
        "Content": "The families of two children killed in the US Catholic school shooting have said their \"hearts are broken\" and branded the attacker a \"coward\". Fletcher Merkel who was eight and 10-year-old Harper Moyski were killed during mass at Annunciation Catholic School in Minneapolis on Wednesday. Eighteen other people were injured, including children aged between six and 15 and three adults in their 80s. Police said Robin Westman, a male born as Robert Westman, opened fire with a rifle through the windows of the school's church as children sat in pews.  'Our hearts are broken' Harper's parents, Michael Moyski and Jackie Flavin, remembered her as \"a bright, joyful, and deeply loved 10-year-old whose laughter, kindness, and spirit touched everyone who knew her\". \"Our hearts are broken not only as parents, but also for Harper's sister, who adored her big sister and is grieving an unimaginable loss. As a family, we are shattered, and words cannot capture the depth of our pain,\" their statement said. They urged leaders and communities to \"take meaningful steps to address gun violence and the mental health crisis in this country.\" \"Change is possible, and it is necessary - so that Harper's story does not become yet another in a long line of tragedies,\" the statement added. 'Fletcher loved his family' In a statement reported by Sky's US partner network NBC News, Fletcher's father Jesse Merkel blamed the \"coward\" killer for why the boy's family can't \"hold him, talk to him, play with him, and watch him grow into the wonderful young man he was on the path to becoming\". He said: \"Fletcher loved his family, friends, fishing, cooking, and any sports that he was allowed to play. \"While the hole in our hearts and lives will never be filled, I hope that in time, our family can find healing.\" Mr Merkel also praised \"the swift and heroic actions of children and adults alike from inside the church\". \"Without these people and their selfless actions, this could have been a tragedy of many magnitudes more. For these people, I am thankful,\" he added. Mayor calls for assault weapon ban It comes after Minneapolis mayor Jacob Frey called for a statewide and federal ban on assault weapons, a day after the deadly school shooting.  \"Thoughts and prayers are not going to cut it. It's on all of us to see this through,\" the mayor said at a news conference. \"We need a statewide and a federal ban on assault weapons. \"We need a statewide and a federal ban on high-capacity magazines. There is no reason that someone should be able to reel off 30 shots before they even have to reload. \"We're not talking about your father's hunting rifle gear. We're talking about guns that are built to pierce armour and kill people.\" Meanwhile, Minneapolis police chief Brian O'Hara gave an update on the investigation, saying the suspect had fired 116 rifle rounds into the church. \"It is very clear that this shooter had the intention to terrorise those innocent children,\" he added, before saying the killer \"fantasised\" about the plans of other mass shooting attackers and wanted to \"obtain notoriety\". Read more from Sky News:Man 'who impersonated Michael Jackson' was 'unfairly dismissed'Concern as British couple detained in Iran 'whisked' to courtroom Thomas Klemond, interim CEO of Minneapolis's main trauma hospital Hennepin Healthcare, said at an earlier news conference that the hospital was treating nine patients injured in the shooting. One child at the hospital was in a critical condition, he added. Children's Minnesota Hospital also said that three children remain in its care as of Thursday morning."
    },
    {
        "title": "New details released about killer in Catholic school shooting in US",
        "description": "Police have released new details about the killer in the US Catholic school shooting - including that they \"idolised\" mass murderers and they wanted to \"watch children suffer\". ",
        "url": "https://news.sky.com/story/new-details-released-about-killer-in-catholic-school-shooting-in-us-13419977",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-catholic-annunciation-school_7004012.jpg?20250828204908",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-28 13:21:00",
        "Headline": "Minneapolis Police Chief Brian O'Hara said the attacker, who \"fantasised\" about the plans of other mass shooting attackers, fired 116 rifle rounds into Annunciation Catholic School's church.",
        "Content": " Police have released new details about the killer in the US Catholic school shooting - including that they \"idolised\" mass murderers and they wanted to \"watch children suffer\".  Two children, aged eight and 10, were killed during mass at Annunciation Catholic School in Minneapolis on Wednesday. One of the victims has been named as Fletcher Merkel - click here to read more Eighteen other people were injured, including children aged between six and 15 and three adults in their 80s. Police said Robin Westman, a male born as Robert Westman, opened fire with a rifle through the windows of the school's church as children sat in pews. Almost 120 rifle rounds fired, police chief says In a news conference on Thursday, Minneapolis Police Chief Brian O'Hara said the attacker fired 116 rifle rounds into the church. \"It is very clear that this shooter had the intention to terrorise those innocent children,\" he added. The police chief said the killer \"fantasised\" about the plans of other mass shooting attackers and wanted to \"obtain notoriety\". When asked about the attacker obtaining the firearms used legally, Mr O'Hara said that they did not have a criminal history or any diagnosed mental health disorders. While they had potentially concerning social media posts, the police chief added that there was no evidence to suggest that Westman was legally barred from purchasing a firearm. Suspect 'wanted to watch children suffer' Joe Thompson, acting US attorney for Minnesota, also said evidence recovered of the killer's plans showed \"pure indiscriminate hate\" and that they \"idolised some of the most notorious school shooters and mass murderers in our country's history\". \"I won't dignify the shooter's words by repeating them,\" Mr Thompson added. \"They are horrific and vile, but in short, the shooter wanted to watch children suffer.\" Earlier, the mayor of Minneapolis called for a statewide and federal ban on assault weapons after the deadly attack, saying \"thoughts and prayers are not going to cut it\". \"There is no reason that someone should be able to reel off 30 shots before they even have to reload,\" Jacob Frey said. \"We're not talking about your father's hunting rifle gear. We're talking about guns that are built to pierce armour and kill people.\"  Thomas Klemond, interim CEO of Minneapolis's main trauma hospital Hennepin Healthcare, said at a news conference that the hospital was treating nine patients injured in the shooting. One child at the hospital was in a critical condition, he added. Children's Minnesota Hospital also said that three children remain in its care as of Thursday morning. Read more from Sky News:Cost of weight-loss drug to be discounted in UK pharmaciesWhat could happen next at Man Utd after Grimsby humiliationUN staff pressure human rights chief to call Gaza a genocide In a post on Facebook, the hospital said \"there are no words to describe the overwhelming pain many are feeling\", adding: \"We feel that pain with you. \"To the entire Annunciation community, you have our deepest condolences. During this time of unimaginable grief and loss, we want you to know that we at Children's Minnesota are with you. \"We will always be here to care for you. And in this moment, we hurt alongside you.\""
    },
    {
        "title": "Vladimir Putin may be playing for time while he carries on beating down Ukraine's will to win",
        "description": "After all those raised hopes of peace, Ukraine has been hit by the second-worst night of Russian air attacks since the war began.",
        "url": "https://news.sky.com/story/vladimir-putin-may-be-playing-for-time-while-he-carries-on-beating-down-ukraines-will-to-win-13420100",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-russia-kyiv-ukraine_7003843.jpg?20250828190125",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-08-28 16:41:00",
        "Headline": "Ukraine is hitting back, particularly at Russia's oil installations, but analysts don't expect it will be enough to persuade Vladimir Putin to end the war.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  After all those raised hopes of peace, Ukraine has been hit by the second-worst night of Russian air attacks since the war began. So much for diplomacy, despite the Alaska summit, then the Washington DC meeting. The Kremlin says it was aiming at military targets, but yet again, the pictures tell a very different story. Follow latest: UK summons Putin's ambassador One civilian building after another was hit, more than a dozen people were killed and British Council and EU buildings were also damaged. So what's going on? Why is Vladimir Putin doing it? Because he can. The Russian president thinks he's winning this war, and it's hard to escape the conclusion that he's using diplomacy to play for time while he carries on beating down the Ukrainians will to win. And at the moment, no one is stopping him  Ukraine is hitting back, particularly at Russia's oil installations, more of them going up in thick black smoke, after being hit by long-range Ukrainian drones. It is taking a heavy toll on Putin's 'Achilles heel', but on its own, analysts don't expect it will be enough to persuade him to end this war.  The West can wring its hands in condemnation. But it's divided between Europe that wants a ceasefire and much more severe sanctions, and President Trump, who, it seems, does not - strangely always willing to sympathise with the Russians more than Ukraine. He's back to blaming Ukraine for starting the war, saying earlier in the week that Kyiv should not have got into a war it had no chance of winning. It is a grotesque perversion of history. Ukraine, of course, had no choice but to fight to defend itself when it was invaded in an act of unprovoked aggression. Every time the US president has condemned Russia for these kinds of attacks, he has never followed through and done nothing to punish them. More worryingly for the Ukrainians, the Russians are getting the upper hand in the drones war, taking Iranian technology and souping it up into faster-moving drones that the Ukrainians are having increasing difficulty bringing down. They expect as many as a thousand drones a night coming their way by the winter, and many, many more innocents to die. Next week, Putin will join Chinese and North Korean leaders in a summit in Beijing, both supporting his war in Ukraine. Read more from Dominic Waghorn:Ukrainians warn they're in danger of losing drone arms raceWe are further away from peace now than we were two weeks ago A war that began as one man's mad idea has, in three and a half years, metastasised into a titanic struggle between east and west, fought increasingly with machines in a dystopian evolution of war. If President Trump is not prepared to use his power to bring this war to an end, what will another three and a half years of his presidency bring? It is a chilling question."
    },
    {
        "title": "Putin, Xi and Kim set to unite at major military parade",
        "description": "Kim Jong Un will join Xi Jinping and Vladimir Putin at a major military parade in Beijing next week, North Korean and Chinese state media have announced.",
        "url": "https://news.sky.com/story/putin-xi-and-kim-set-to-unite-at-major-military-parade-13419723",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-vladimir-putin-xi-jinping_6910961.jpg?20250509165247",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-28 02:55:00",
        "Headline": "China, Russia, and North Korea are close allies. Beijing has long been Pyongyang's biggest aid and trading partner, while Kim Jong Un has been providing Vladimir Putin with troops for his war in Ukraine.",
        "Content": "Kim Jong Un will join Xi Jinping and Vladimir Putin at a major military parade in Beijing next week, North Korean and Chinese state media have announced. The dictator will make the rare trip abroad as China marks the 80th anniversary of the end of the Second World War. Mr Putin's presence had already been confirmed. He and Mr Kim will be among 26 foreign leaders at the event, with none expected from the US or Western Europe. Myanmar's military junta chief, Min Aung Hlaing, who seized power in a coup four years ago, will also attend the summit, according to the country's state media. China, Russia, and North Korea are close allies. Beijing has long been Pyongyang's biggest aid and trading partner, while Mr Kim has been providing the Russian president with troops for his war in Ukraine. There are currently no details of exactly when and for how long Mr Kim will be in China. It's set to be his first visit in some six years - before the pandemic. Hong Lei, assistant foreign minister of China, said the country would \"warmly welcome\" Mr Kim and that \"maintaining, consolidating, and developing\" relations between the two countries' governments was a priority. Asked what message China was sending by hosting Mr Putin, Mr Lei said the Russian president's attendance at commemorative events \"further demonstrates the high level of the China-Russia comprehensive strategic partnership of coordination for a new era and declares the unity and solidarity between China and Russia\". He added: \"Facing an international landscape fraught with both change and turmoil, China and Russia, as founding members of the UN and permanent members of the Security Council, will continue to uphold the authority of the United Nations and international fairness and justice.\" It may not be the last of Mr Kim's major global summits of the year, with Donald Trump having said earlier this week he fancies another meeting with the North Korean. The pair had an unprecedented meeting during the US president's first term, and he's suggested they could reunite later this year."
    },
    {
        "title": "UN staff pressure human rights chief Volker Turk to call Gaza a genocide",
        "description": "More than 500 staff at the United Nations have urged its human rights chief to describe the Gaza conflict as a genocide.",
        "url": "https://news.sky.com/story/un-staff-pressure-human-rights-chief-volker-turk-to-call-gaza-a-genocide-13420004",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-palestinians-food_7003699.jpg?20250828155935",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-28 14:03:00",
        "Headline": "A letter, signed by staff, claims the legal criteria has been met to call Israel's actions a genocide. Israel denies its actions amount to this.",
        "Content": "More than 500 staff at the United Nations have urged its human rights chief to describe the Gaza conflict as a genocide. In a letter to Volker Turk, head of the Office of the High Commissioner for Human Rights (OHCHR), staff claim that thelegal criteria for genocide in the nearly two-year Israel-Hamas war have been met. The staff said failure to claim a genocide \"undermines\" the UN's credibility. The letter, seen by news agency Reuters, was sent on Wednesday. They argue the scale, scope and nature of the near two-year Israel-Hamas war justifies using the term. 'Failing to denounce an unfolding genocide undermines the credibility of the UN' The letter, signed by the Staff Committee on behalf of more than 500 employees, reads: \"OHCHR has a strong legal and moral responsibility to denounce acts of genocide. \"Failing to denounce an unfolding genocide undermines the credibility of the UN and the human rights system itself.\" \n                  All members of UN Security Council except US say Gaza famine is 'manmade crisis'\n                 \n                  Israeli protesters demand Netanyahu does whatever it takes to bring hostages home - but is he listening?\n                 \n                  Gaza hospital rejects Israel's claim troops 'saw Hamas camera' before deadly attack\n                 The letter also points towards the international body's perceived moral failure in not doing more to stop the 1994 Rwanda genocide that killed more than one million people. It comes after Israeli forces killed at least 16 Palestinians across Gaza on Thursday, according to local health officials. Residents reported an intensified military bombardment in the suburbs of Gaza City. There have been fears a fresh assault on the city will cause significant casualties and displace roughly one million Palestinians sheltering there. According to the health ministry, Thursday's deaths bring the number of Palestinians killed by Israeli fire to 71 in the past 24 hours. Israel's Foreign Ministry did not immediately respond to the letter. The country has denied it is committing genocide, claiming self-defence against Hamas following its attack on October 7, 2023, that killed 1,200 people and resulted in 251 hostages being taken. 'We all share a feeling of moral indignation at the horrors we are witnessing' Since then, the conflict has killed almost 63,000 people, according to Gaza's Hamas-run Health Ministry. The UN's global hunger monitor earlier this month declared that Gaza City and surrounding areas were officially suffering from famine. The letter echoes claims from various rights groups, including Amnesty International, who have also accused Israel of committing genocide. Independent UN expert Francesca Albanese has also used the term, but not the UN itself. Previously, UN officials said it is up to international courts to determine genocide. Turk has repeatedly condemned Israel's actions in Gaza, and said the letter highlighted important concerns. He said: \"I know we all share a feeling of moral indignation at the horrors we are witnessing, as well as frustration in the face of the international community's inability to bring this situation to an end.\" He called for employees to \"remain united as an Office in the face of such adversity\". 'It is not nearly enough to do what we need to do' On Thursday, the World Food Programme (WFP) said more aid is reaching Gaza but it is not enough to prevent widespread starvation. WFP Executive Director Cindy McCain said: \"We're getting a little bit more food in. We're moving in the right direction, but it's not nearly enough to do what we need to do to make sure that people are not malnourished and not starving.\""
    },
    {
        "title": "Japan releases AI-generated video showing simulation of Mount Fuji violently erupting",
        "description": "Japanese officials have released an AI-generated video showing a simulation of Mount Fuji violently erupting to raise awareness about a potential disaster.",
        "url": "https://news.sky.com/story/japan-releases-ai-generated-video-showing-simulation-of-mount-fuji-violently-erupting-13420214",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-mount-fuji-japan_7004068.png?20250828220314",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-28 20:01:00",
        "Headline": "The video was released to mark Volcanic Disaster Preparedness Day and warns an eruption could strike \"at any moment, without warning\".",
        "Content": " Japanese officials have released an AI-generated video showing a simulation of Mount Fuji violently erupting to raise awareness about a potential disaster. The video was released to mark Volcanic Disaster Preparedness Day and warns an eruption could strike \"at any moment, without warning\". It depicts a plume of smoke billowing from the volcano before ash falls over central Tokyo, which lies around 60 miles away. The city is then shown covered in ash within hours of an eruption, bringing transport to a halt, disrupting food and power supplies and causing long-term respiratory issues. \"We need to arm ourselves with facts and prepare for disaster in our daily lives,\" it says. The video also shows a family stocking their pantry with canned food and a first aid kit. Tokyo's city government said there are currently no signs of Fuji erupting. It explained: \"The simulation is designed to equip residents with accurate knowledge and preparedness measures they can take in case of an emergency.\" Read more:Family sue OpenAI over teenager's death after he confided in ChatGPTWhy the tech bubble seems safe - for now Japan is highly vulnerable to natural disasters and is known for its planning for earthquakes, typhoons, floods, mudslides and volcanic eruptions. It sits on the Pacific Ring of Fire and is home to 111 of the world's roughly 1,500 active volcanoes. Mt Fuji is Japan's tallest peak. It used to erupt around once every 30 years, but has been dormant since 1707."
    },
    {
        "title": "UK, France and Germany plan to reimpose sanctions on Iran over nuclear weapon fears",
        "description": "The UK, France and Germany are planning to revive UN-backed sanctions on Iran over fears it is developing nuclear weapons.",
        "url": "https://news.sky.com/story/uk-france-and-germany-plan-to-reimpose-sanctions-on-iran-over-nuclear-weapon-fears-13419988",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-tehran-iran_6966123.jpg?20250716133215",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-28 13:48:00",
        "Headline": "The three nations said Iran has continually breached a 2015 agreement and its nuclear programme is a threat to global peace and security.",
        "Content": "The UK, France and Germany are planning to revive UN-backed sanctions on Iran over fears it is developing nuclear weapons. The three European nations, known as the E3, are triggering the \"snapback\" mechanisms after efforts to restart diplomatic talks over Tehran's nuclear programme stalled. Read more: Asylum hotel appeal decision expected Iran insists its nuclear programme is for peaceful purposes, but it has enriched uranium to levels exceeding that required for civil nuclear power. This is a breach of a deal agreed with Western nations in 2015, when a series of sanctions were suspended. However, the E3 now wants to reimpose those sanctions, which were made by a UN resolution. The sanctions include freezing Iranian assets abroad, halting arms deals with Tehran and penalising any development of its ballistic missile programme to further squeeze Iran's flailing economy. \n                  Concern after British couple detained in Iran 'suddenly whisked' to courtroom\n                 \n                  Family 'seriously worried' for parents detained in Iran's 'harshest prison'\n                 \n                  British couple Lindsay and Craig Foreman make first call home since being detained in Iran\n                 Before the sanctions are implemented, there will be a 30-day period when the UK, France and Germany hope talks can take place and Iran will agree to step back its nuclear ambitions. The E3 wrote to US secretary of state Marco Rubio informing him of their intent, and on Thursday afternoon, notified the UN. The UN Security Council will meet on Friday to discuss the move, it is understood. Russia and China, two out of five permanent members of the UN Security Council, quickly drafted a resolution to extend the Iran nuclear deal for six months and urge all parties to immediately resume negotiations. Russia's deputy UN envoy said the E3's move has \"no legal bearing\". E3: Iran's nuclear programme is threat to international peace In a joint statement, the foreign ministers of the UK, France and Germany, said they have \"consistently\" undertaken \"intensive diplomatic efforts\" over the past five years to de-escalate tensions and bring Iran and the US to the negotiating table after Iran essentially abandoned the 2015 agreement. But they said Iran has refused suggested packages while \"continuing to raise unacceptable demands\". They added: \"Today, Iran's non-compliance with the Joint Comprehensive Plan of Action (JCPoA) is clear and deliberate, and sites of major proliferation concern in Iran are outside of IAEA monitoring. \"Iran has no civilian justification for its high enriched uranium stockpile - now over nine Significant Quantities - which is also unaccounted for by the IAEA. Its nuclear programme, therefore, remains a clear threat to international peace and security.\" They committed to \"strive to diplomatically resolve\" the issue and will use the 30-day period to \"engage with Iran\". US welcomes sanctions snapback Mr Rubio welcomed the sanctions snapback and said the E3 have laid out a clear case of Iran's continuing \"significant non-performance\" of its nuclear commitments. He confirmed the US will work with the E3 and members of the UN Security Council to complete the reimposition of the sanctions, and said the US remains available for direct engagement with Iran. Iran rejects move The development has not been met well by the Iranians, with Tehran's foreign ministry saying it \"strongly rejects and firmly\" condemns the move. They called it a \"provocative and unnecessary escalation\" and said it will be met with \"appropriate responses\".  Donald Trump withdrew the US from the JCPOA on Iran's nuclear agreement in 2018, three years after an agreement between Iran and the UN Security Council's five permanent members (China, France, Russia, the UK, the US) plus Germany, and re-imposed sanctions that had been lifted when the agreement was made in 2015. Tehran's relations with the West are strained following its 12-day war with Israel earlier this year. During that conflict, Israel targeted Iran's largest nuclear sites, claiming Tehran was close to developing nuclear weapons. Lammy: Ball is in Iran's court British foreign secretary David Lammy said the UK and its European allies have \"negotiated in good faith\" with Iran since 2019, but are now \"left with no choice\" but to reintroduce sanctions. He said: \"Iran's nuclear programme remains a threat to global peace and security. Over the past six years, Iran has broken almost all limits in the JCPOA (Joint Comprehensive Plan of Action) and its stockpile of enriched uranium is 45 times over the JCPOA limit. \"Alongside our European allies, the UK has negotiated in good faith since 2019, when Iran began to disregard the nuclear deal. We supported a viable deal in 2022, which Iran rejected, and recently offered an extension to sanctions relief, subject to Iran meeting set conditions.\" \"Whilst we have been left with no choice but to take this action, the ball remains in Iran's court and I would welcome their return to the table with a serious offer,\" he added."
    },
    {
        "title": "On Russia’s hit list but unshaken: Rheinmetall CEO leads Europe’s defence surge",
        "description": "For a man whose name we are told was on a Russian hit list, Armin Papperger seems very relaxed.",
        "url": "https://news.sky.com/story/on-russia8217s-hit-list-but-unshaken-rheinmetall-ceo-leads-europe8217s-defence-surge-13419903",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-unterluss-ammunition-factory_7003573.jpg?20250828122229",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-08-28 10:55:00",
        "Headline": "Despite a foiled assassination plot, Armin Papperger remains calm as Germany’s largest weapons manufacturer ramps up artillery production to counter Russian aggression and bolster NATO’s defenses.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n For a man whose name we are told was on a Russian hit list, Armin Papperger seems very relaxed. The 62-year-old is the chief executive of Germany's largest weapons manufacturer, Rheinmetall. In January, a Nato official confirmed that a plot to murder Armin Papperger was foiled by US and German intelligence. The plot was one of a series of Russian plans to assassinate defence industry executives across Europe and part of wider sabotage being carried out on member states, according to NATO deputy assistant secretary-general for innovation, hybrid, and cyber, James Appathurai. While the Kremlin denies the allegations, it's news that would rattle most people, but Papperger is calm. \"It's better not to be on a hit list, but you see the guys here around me; this is my personal protection, so I feel very good,\" he replies when I ask if his life has become more dangerous since Russia invaded Ukraine in 2022. \"The guys\" he's referring to are a team of heavy-set men in slick black uniforms. They're the kind of security staff you see flanking world leaders and, if German media is correct, the Rheinmetall CEO has similar protection to the German Chancellor. While Mr Papperger won't be drawn on whether his life has become more dangerous, he can't deny it's become busier. We are meeting at the opening of Rheinmetall's new ammunition factory in Unterluß, Germany. The sprawling plant is the largest in Europe and aims to produce 350,000 rounds a year by 2027. The 155mm shells will initially be used to replenish the German military and boost Ukraine's stock. As well as the German ammunition plant, Europe's renewed focus on defence means Rheinmetall is rapidly expanding, with a gunpowder factory in Romania, two factories in Bulgaria and a gun barrel facility in the UK just some of its new ventures. The projects, they say, are a direct reaction to Russian aggression and the new demand from Germany and its European allies to rearm in response. \"How big is that challenge to rearm?\" I ask. \"At the moment, the western world has a capacity of about two million rounds of artillery which is not enough. We need more, and 50% of those shells will be produced at Rheinmetall,\" Mr Papperger says. Read more from Sky News:Tony Blair meets Donald Trump to discuss GazaPutin, Xi, and Kim set to unite at major military parade\"How long will 2 million rounds last?\" I ask? \"President Zelenskyy told me I need two-and-a-half million if we have a ceasefire and four-and-a-half million if we have a war,\" he replies. By Papperger's assessment, it will take 10 years to fully restock but he's confident Europe could defend itself if it was attacked before this. \"It's not that we are not able to fight, we are able to,\" he says. For years, defence was a dirty word for many in Germany due to its history in the Second World War, but the war in Ukraine has changed the government's thinking. The very real possibility that Russia could strike a NATO country in the next five years means the Germans, like many of their neighbours, are working to turbo-charge their military, and defence giants like Rheinmetall are a key part of those plans. "
    },
    {
        "title": "Jelena Ostapenko denies being racist during row with Taylor Townsend at US Open",
        "description": "Tennis star Jelena Ostapenko has denied she was racist after reportedly telling Taylor Townsend she has \"no class\" and \"no education\" during a fiery exchange at the US Open.",
        "url": "https://news.sky.com/story/jelena-ostapenko-denies-being-racist-during-row-with-taylor-townsend-at-us-open-13419846",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jelena-ostapenko-racist_7003521.jpg?20250828114441",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-28 08:52:00",
        "Headline": "Jelena Ostapenko was seen on camera pointing her finger at Taylor Townsend during the row as loud boos could be heard from the crowd.",
        "Content": " Tennis star Jelena Ostapenko has denied she was racist after reportedly telling Taylor Townsend she has \"no class\" and \"no education\" during a fiery exchange at the US Open. The pair clashed at the side of the court at Flushing Meadows in New York following Townsend's 7-5 6-1 second-round victory. Ostapenko, from Latvia, was seen pointing her finger at her American rival during the row as loud boos could be heard from the crowd. The confrontation was caught on camera but what the players were saying could not be heard. However, one video of the exchange shows Townsend saying \"you can learn to take a loss better\" before walking away. Ostapenko, ranked 26th in the world, didn't do a post-match news conference but later shared an Instagram story where she accused Townsend of unsporting behaviour and being \"disrespectful\" by not apologising for a shot that hit the top of the net. She also accused her US rival, who is ranked 139th in the world, of not warming up in the expected manner by practising volleys. The 28-year-old added: \"If she plays in her homeland, it doesn't mean that she can behave and do whatever she wants.\" Ostapenko was later met with allegations of racism after Townsend said during her on-court interview that her opponent told her she has \"no class\" and \"no education\" and to \"see what happens when we get outside the US\". Townsend added: \"I'm looking forward to it. I beat her in Canada outside the US so let's see what else she has to say.\" During a post-match news conference, Townsend was asked if there were racial undertones to Ostapenko's on-court remarks. The American said: \"I'm very proud as a black woman being out here representing myself and representing us and our culture. \"I make sure that I do everything that I can to be the best representation possible every time that I step on the court and even off the court. \"So I can't speak on how she felt about it. That's something that you're going to have to ask her. I didn't take it in that way, but also, that has been a stigma in our community of being not educated and all of the things when it's the furthest thing from the truth.\" Read more from Sky News:What we know about Minneapolis school shootingPutin, Xi, and Kim set to unite at major military parade Ostapenko later wrote in a post on her Instagram story: \"Wow how many messages I received that I am a racist. I was NEVER racist in my life and I respect all nations of people in the world, for me it doesn't matter where you come from. \"There are some rules in tennis and unfortunately when the crowd is with you, you can't use it in disrespectful way to your opponent. \"Unfortunately for me coming from such a small country I don't have that huge support and a chance to play in homeland. I always loved to play in the US and US Open but this is the first time someone is approaching the match this disrespectful way.\" The confrontation came a year after Townsend beat Ostapenko 6-2 6-1 in Canada in August 2024. Townsend and doubles partner Katerina Siniakova also beat Ostapenko and Hsieh Su-wei in three sets to win the Australian Open doubles title in January. The American and Siniakova then lost to Ostapenko and Hsieh in the semi-finals of Wimbledon this past June. The post-match row between Townsend and Ostapenko at the US Open comes after Yulia Putintseva was involved in a heated exchange with Maria Sakkari at the Bad Homburg Open in Germany in June. Sakkari, from Greece, beat her Kazakhstani rival 7-5 7-6 (8-6) in a close encounter before the pair shook hands and exchanged insults. One of the comments made by Sakkari to Putintseva which the microphone picked up was \"when you shake hands with someone, look them in the eyes\" followed by \"nobody likes you\"."
    },
    {
        "title": "Boy, 8, and girl, 10, killed in US Catholic school shooting named - as father brands attacker 'a coward'",
        "description": "The families of two children killed in the US Catholic school shooting have said their \"hearts are broken\" and branded the attacker a \"coward\".",
        "url": "https://news.sky.com/story/boy-8-and-girl-10-killed-in-us-catholic-school-shooting-named-as-father-brands-attacker-a-coward-13420257",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-fletcher-merkel-harper-moyski_7004124.png?20250829015540",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-28 21:20:00",
        "Headline": "Fletcher Merkel, 8, and Harper Moyski, 10, were killed during mass at Annunciation Catholic School in Minneapolis on Wednesday.",
        "Content": "The families of two children killed in the US Catholic school shooting have said their \"hearts are broken\" and branded the attacker a \"coward\". Fletcher Merkel who was eight and 10-year-old Harper Moyski were killed during mass at Annunciation Catholic School in Minneapolis on Wednesday. Eighteen other people were injured, including children aged between six and 15 and three adults in their 80s. Police said Robin Westman, a male born as Robert Westman, opened fire with a rifle through the windows of the school's church as children sat in pews.  'Our hearts are broken' Harper's parents, Michael Moyski and Jackie Flavin, remembered her as \"a bright, joyful, and deeply loved 10-year-old whose laughter, kindness, and spirit touched everyone who knew her\". \"Our hearts are broken not only as parents, but also for Harper's sister, who adored her big sister and is grieving an unimaginable loss. As a family, we are shattered, and words cannot capture the depth of our pain,\" their statement said. They urged leaders and communities to \"take meaningful steps to address gun violence and the mental health crisis in this country.\" \"Change is possible, and it is necessary - so that Harper's story does not become yet another in a long line of tragedies,\" the statement added. 'Fletcher loved his family' In a statement reported by Sky's US partner network NBC News, Fletcher's father Jesse Merkel blamed the \"coward\" killer for why the boy's family can't \"hold him, talk to him, play with him, and watch him grow into the wonderful young man he was on the path to becoming\". He said: \"Fletcher loved his family, friends, fishing, cooking, and any sports that he was allowed to play. \"While the hole in our hearts and lives will never be filled, I hope that in time, our family can find healing.\" Mr Merkel also praised \"the swift and heroic actions of children and adults alike from inside the church\". \"Without these people and their selfless actions, this could have been a tragedy of many magnitudes more. For these people, I am thankful,\" he added. Mayor calls for assault weapon ban It comes after Minneapolis mayor Jacob Frey called for a statewide and federal ban on assault weapons, a day after the deadly school shooting.  \"Thoughts and prayers are not going to cut it. It's on all of us to see this through,\" the mayor said at a news conference. \"We need a statewide and a federal ban on assault weapons. \"We need a statewide and a federal ban on high-capacity magazines. There is no reason that someone should be able to reel off 30 shots before they even have to reload. \"We're not talking about your father's hunting rifle gear. We're talking about guns that are built to pierce armour and kill people.\" Meanwhile, Minneapolis police chief Brian O'Hara gave an update on the investigation, saying the suspect had fired 116 rifle rounds into the church. \"It is very clear that this shooter had the intention to terrorise those innocent children,\" he added, before saying the killer \"fantasised\" about the plans of other mass shooting attackers and wanted to \"obtain notoriety\". Read more from Sky News:Man 'who impersonated Michael Jackson' was 'unfairly dismissed'Concern as British couple detained in Iran 'whisked' to courtroom Thomas Klemond, interim CEO of Minneapolis's main trauma hospital Hennepin Healthcare, said at an earlier news conference that the hospital was treating nine patients injured in the shooting. One child at the hospital was in a critical condition, he added. Children's Minnesota Hospital also said that three children remain in its care as of Thursday morning."
    },
    {
        "title": "New details released about killer in Catholic school shooting in US",
        "description": "Police have released new details about the killer in the US Catholic school shooting - including that they \"idolised\" mass murderers and they wanted to \"watch children suffer\". ",
        "url": "https://news.sky.com/story/new-details-released-about-killer-in-catholic-school-shooting-in-us-13419977",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-catholic-annunciation-school_7004012.jpg?20250828204908",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-28 13:21:00",
        "Headline": "Minneapolis Police Chief Brian O'Hara said the attacker, who \"fantasised\" about the plans of other mass shooting attackers, fired 116 rifle rounds into Annunciation Catholic School's church.",
        "Content": " Police have released new details about the killer in the US Catholic school shooting - including that they \"idolised\" mass murderers and they wanted to \"watch children suffer\".  Two children, aged eight and 10, were killed during mass at Annunciation Catholic School in Minneapolis on Wednesday. One of the victims has been named as Fletcher Merkel - click here to read more Eighteen other people were injured, including children aged between six and 15 and three adults in their 80s. Police said Robin Westman, a male born as Robert Westman, opened fire with a rifle through the windows of the school's church as children sat in pews. Almost 120 rifle rounds fired, police chief says In a news conference on Thursday, Minneapolis Police Chief Brian O'Hara said the attacker fired 116 rifle rounds into the church. \"It is very clear that this shooter had the intention to terrorise those innocent children,\" he added. The police chief said the killer \"fantasised\" about the plans of other mass shooting attackers and wanted to \"obtain notoriety\". When asked about the attacker obtaining the firearms used legally, Mr O'Hara said that they did not have a criminal history or any diagnosed mental health disorders. While they had potentially concerning social media posts, the police chief added that there was no evidence to suggest that Westman was legally barred from purchasing a firearm. Suspect 'wanted to watch children suffer' Joe Thompson, acting US attorney for Minnesota, also said evidence recovered of the killer's plans showed \"pure indiscriminate hate\" and that they \"idolised some of the most notorious school shooters and mass murderers in our country's history\". \"I won't dignify the shooter's words by repeating them,\" Mr Thompson added. \"They are horrific and vile, but in short, the shooter wanted to watch children suffer.\" Earlier, the mayor of Minneapolis called for a statewide and federal ban on assault weapons after the deadly attack, saying \"thoughts and prayers are not going to cut it\". \"There is no reason that someone should be able to reel off 30 shots before they even have to reload,\" Jacob Frey said. \"We're not talking about your father's hunting rifle gear. We're talking about guns that are built to pierce armour and kill people.\"  Thomas Klemond, interim CEO of Minneapolis's main trauma hospital Hennepin Healthcare, said at a news conference that the hospital was treating nine patients injured in the shooting. One child at the hospital was in a critical condition, he added. Children's Minnesota Hospital also said that three children remain in its care as of Thursday morning. Read more from Sky News:Cost of weight-loss drug to be discounted in UK pharmaciesWhat could happen next at Man Utd after Grimsby humiliationUN staff pressure human rights chief to call Gaza a genocide In a post on Facebook, the hospital said \"there are no words to describe the overwhelming pain many are feeling\", adding: \"We feel that pain with you. \"To the entire Annunciation community, you have our deepest condolences. During this time of unimaginable grief and loss, we want you to know that we at Children's Minnesota are with you. \"We will always be here to care for you. And in this moment, we hurt alongside you.\""
    },
    {
        "title": "As Trump sends in the troops, the US capital feels like it's creeping towards a tipping point",
        "description": "The headlines these past few weeks have focused on the National Guard deployed by the American president to the streets of Washington DC.",
        "url": "https://news.sky.com/story/as-trump-sends-in-the-troops-the-us-capital-feels-like-its-creeping-towards-a-tipping-point-13419708",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-mark-stone-national-guard_7003280.jpg?20250828005914",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-08-28 00:13:00",
        "Headline": "Donald Trump has deployed the National Guard to Washington DC - and more cities across the country could well follow. Heavily armed, they are an effective visual for the president - but it's leaving communities feeling scared, angry, and divided.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  The headlines these past few weeks have focused on the National Guard deployed by the American president to the streets of Washington DC. With combat rifles and armoured vehicles, they are an effective visual for Donald Trump. They neatly project his power. But they are a distraction, too. While the troops may, for his supporters, represent hard presidential power in a Democrat-run city perceived to be out of control, they are not actually fighting crime (nor are they the right tool to do that) and they are not focused on the nation's immigration challenges. This week, they were spotted collecting litter in downtown DC. Yet Trump's law, order, and crime agenda has many strands which represent an unprecedented extension of presidential authority. Two weeks ago, at the White House, he told America what to expect. \"We're going to take our capital back; we're going to take it back,\" he said. \"Massive enforcement operations targeting known gangs, drug dealers and criminal networks to get them the hell off the street, maybe get them out of the country because a lot of them came into our country illegally. \"They shouldn't have been allowed in. They come from Venezuela. They come from all over the world. We're going to get them the hell out. They won't be here long.\"  The real story is going on beyond the National Guard photo-op. On Tuesday morning, I set out to see what this sweeping new presidential power really looks like on the streets of America's capital city. I didn't expect that it would take five minutes and a drive of just a few blocks to find what appears to be a new normal. The neighbourhood of Mount Pleasant is a couple of miles north of the White House. It's a proudly multicultural and multi-income part of the city. In that sense, it's somewhat unusual. Washington is mostly a city of bubbles - where different communities are distinct, and the wealth gap is vast. Turning off 17th Street, the flashing lights were ahead. It was just after 7am. This residential neighbourhood had been awoken this particular morning by the sound of a commotion which was unfolding in front of me. A construction truck had been pulled over by unmarked police vehicles. Three Latino men had been taken out, handcuffed and were in the process of being taken to the police cars. 'You're the Gestapo' It was an immigration raid. The men had been detained because they were not able to prove, on demand, as they went to work, whether they were in the country legally. Locals, drawn out of their houses, shouted at the federal agents from ICE - the Immigration and Customs Enforcement Agency. \"Shame, shame, shame. You're the Gestapo… why are you doing this,\" they shouted. \"These are hardworking people,\" one neighbour said of the men detained. \"These people work in our neighbourhood. They work in our restaurants. They're our neighbours. They are taking hardworking people away, not criminals.\" \"I'm feeling devastated for those men who were just ripped out of their lives unceremoniously,\" another neighbour told me. \"I'm feeling scared for my neighbours who are afraid to leave their house because they're afraid of exactly that happening.\" \"This is not making our city safe,\" her partner added, his young children crying in his arms. \"Pulling out workers who are an essential member of our community and being like, 'oh, that makes DC a better place'. It doesn't.\" The surge of federal law enforcement agents into America's capital has been unprecedented, and their powers are too. Using presidential authority and harnessing the unique status of Washington as a district rather than a state, Trump has taken control of local law enforcement agencies in the city. The city's Metropolitan Police now answer to him, not to the local government, and are working alongside federal agencies. In a recent statement, a spokesperson for ICE said: \"We will support the re-establishment of law and order and public safety in DC, which includes taking drug dealers, gang members and criminal aliens off city streets.\" Here, in Mount Pleasant, this now includes taking people, speculatively, from their vehicles on their way to work. Twenty minutes later, whistles punctuated another moment of tension up the road. Whistles are a new community tactic to alert people that ICE agents are in the area. Other innovative tactics include using the Waze Satnav system to report \"icy streets\" - in August. On 16th Street, a small group of locals - commuters and local business owners among them - had gathered around a car with blacked-out windows. They had identified ICE agents inside. An officer from the city's Metropolitan Police arrived and asked what the commotion was about. The crowd told him about the ICE agents. He looked into the car, nodded, and retreated. He, too, was then jeered. Read more:The flashpoint in Trump's deportations blitz 'This is not what we're about' In these neighbourhoods of overwhelmingly Democratic, left-leaning Washington DC, the mood feels edgy; not a tipping point, but creeping towards one, for sure. \"I don't feel safer, I feel more policed,\" one woman said. A day later, a few streets away, another raid. Officers were staged at the entrance to an apartment block. Heavily armed, they appeared to be from various agencies and the city police too. \"I'm sick, this is not this country, this is not what we're about. We're a quiet community. It's unbelievable we've come to this, unbelievable,\" a woman of retirement age told me as she watched the commotion. 'They are brutalising people' When questioned, the officers wouldn't confirm what their operation was about, but no one was detained and in the end they were literally shouted out of the street by locals. The anger was visceral. \"I've lived here for 47 years, and I've never seen anything like this,\" another woman said. \"They are occupying the city and our neighbourhoods. They are brutalising people, they are taking people for no reason. We don't want them here. This is a Donald Trump dominance performance.\" It is more than a performance, though. If this is the plan for Democrat-run cities across the country, well then the weeks ahead look divisive indeed."
    },
    {
        "title": "Historic legal battle launched as Fed governor Lisa Cook fights back against firing",
        "description": "A governor of the US central bank has made good on her threat to sue the Trump administration, which has attempted to fire her. ",
        "url": "https://news.sky.com/story/historic-legal-battle-launched-as-fed-governor-lisa-cook-fights-back-against-firing-13420033",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jay-powell-lisa-cook_7001482.jpg?20250826061303",
        "type": "US",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-08-28 14:51:00",
        "Headline": "Dr Cook's legal filing said President Trump's social media announcement of her sacking is \"unprecedented and illegal\" and would, if allowed, be the first in Fed history. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n A governor of the US central bank has made good on her threat to sue the Trump administration, which has attempted to fire her.  Legal representatives for Dr Lisa Cook on Thursday launched an injunction to prevent President Trump removing her from the role, teeing up a legal battle for political independence of the interest rate-setting Federal Reserve. Such action is unprecedented and will have implications for the body known as the Fed, which is mandated to keep inflation at 2% and ensure maximum employment in the US. Money latest: Terry Wogan's son rages at Rachel Reeves Mr Trump has said Dr Cook committed mortgage fraud by listing two properties as her primary residence in short succession. Mortgage rates tend to be lower on primary residences. The move is the latest in a long line of attempts by Mr Trump to exert control of the Fed and bring down interest rates to make borrowing cheaper.  Dr Cook's filing described her sacking, announced on social media, as \"unprecedented and illegal\", which \"if allowed to occur, would the first of its kind in the board's history\". \n                  How the US trade war is now targeting you from today\n                 \n                  Ed Davey reveals he has written to King to explain Trump state dinner boycott\n                 \n                  Vladimir Putin may be playing for time while he carries on beating down Ukraine's will to win\n                 \"It would subvert the Federal Reserve Act (FRA), which explicitly requires a showing of \"cause\" for a governor's removal, which an unsubstantiated allegation about private mortgage applications submitted by governor Cook prior to her Senate confirmation is not.\" Mr Trump has been displeased for months at the slow progress in reducing interest rates, with the Fed's chair Jerome Powell a frequent target of his ire. Uncertainty and higher inflation forecasts stemming from the Trump administration's tariff policies have led to a holding of interest rates at 4.25%-4.5%. Unlike the UK, the US interest rate is a range to guide lenders rather than a single percentage. A judge has set the hearing date for Dr Cook's on Friday. Who is Dr Cook? As a governor of the Fed, Dr Cook is one of seven people who set the borrowing rates. She was appointed by President Biden in 2022 and became the first African American person to hold the role. Before her appointment, she served on President Obama's Council of Economic Advisers and worked at the US Treasury, the government department tasked with overseeing the country's finances. Her academic research delved into the impacts of uncertainty on economies, in particular, violence in the Jim Crow South and its impact on patent filing, and the banking system in czarist and post-Soviet Russia. Operational independence of the Fed is a core tenet of the US economy, but the market reaction has been muted with US government borrowing costs and stock markets little moved."
    },
    {
        "title": "US health chief sacked after less than a month amid backlash to RFK Jr's vaccine cuts",
        "description": "The White House says the director of America's public health agency has been sacked less than a month after she was sworn in.",
        "url": "https://news.sky.com/story/us-health-chief-sacked-after-less-than-a-month-amid-backlash-to-rfk-jrs-vaccine-cuts-13419718",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-susan-monarez-reuters_7003302.jpg?20250828034203",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-28 02:24:00",
        "Headline": "Lawyers for Dr Susan Monarez have accused Donald Trump's health secretary of \"weaponising public health\". RFK Jr is a renowned vaccine sceptic, whose contentious policies have been decried by experts.",
        "Content": "The White House says the director of America's public health agency has been sacked less than a month after she was sworn in. The ousting of Susan Monarez from the Centers for Disease Control and Prevention (CDC) has triggered a wave of resignations, amid backlash against health secretary Robert F Kennedy Jr. Earlier this month, the vaccine-sceptic announced $500m (£375.8m) worth of cuts to their development in the US, having sacked all members of the CDC's expert advisory panel on jabs. He's also ditched federal recommendations for pregnant women and healthy children to have COVID shots. Announcing Dr Monarez's departure on Wednesday night, a White House spokesman said she was not \"aligned with the president's agenda of making America healthy again\". Her lawyers said she had not been informed of her sacking and denied she had resigned. They accused RFK Jr of \"weaponising public health\". Read more US news:Two children dead in school shootingWorld's most valuable company beats expectations Four other senior officials have quit, Reuters news agency reports. They are chief medical officer Debra Houry, the director of the national centre for immunisation Demetre Daskalakis, public health data office director Jen Layden, and emerging infections diseases director Daniel Jernigan. Dr Monarez was only sworn in by the US Senate in July. An uneasy relationship with RFK Jr was made obvious from the beginning. In her confirmation hearing, she said she hadn't seen any evidence linking vaccines with autism - a discredited theory the health secretary has promoted."
    },
    {
        "title": "Ed Davey reveals he has written to King to explain Trump state dinner boycott",
        "description": "Sir Ed Davey has written to King Charles to explain why he believes he has to refuse his invite to a state banquet for Donald Trump.",
        "url": "https://news.sky.com/story/ed-davey-reveals-he-has-written-to-king-to-explain-trump-state-dinner-boycott-13420135",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-king-charles-vj-day_6991118.jpg?20250814220523",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-28 17:38:00",
        "Headline": "The Lib Dem leader said it was a very difficult decision as he has \"huge respect\" for the King but feels it is the best way to get his voice heard on Gaza.",
        "Content": " Sir Ed Davey has written to King Charles to explain why he believes he has to refuse his invite to a state banquet for Donald Trump. The Lib Dem leader said on Wednesday he will be boycotting the dinner next month during the US president's second state visit to the UK because of the situation in Gaza. He told Sky News on Thursday: \"I've written to him [the King] personally explaining my thinking. \"And it's with deep regret that I've had to take the decision, but I feel with what is going on in Gaza, it's the best way I can get my voice heard.\" Politics latest: Asylum hotel injunction appeal decision coming soon Sir Ed said the \"sad truth\" is Mr Trump is the \"one man\" who has the power to stop the \"horrible famine in Gaza, could get the hostages released, could bring an end to this horrendous humanitarian crisis\". He said the US president could do that by phoning up Israeli Prime Minister Benjamin Netanyahu and telling him to stop. \n                  How the US trade war is now targeting you from today\n                 \n                  Vladimir Putin may be playing for time while he carries on beating down Ukraine's will to win\n                 \n                  Historic legal battle launched as Fed governor Lisa Cook fights back against firing\n                 The Lib Dem leader said Mr Trump could also call up the Qatari government and other Gulf states to get them to put pressure on Hamas to release the remaining 50 Israeli hostages (20 living, 30 dead) they took on 7 October 2023. He emphasised that he has \"huge respect\" for the King and it was a very difficult decision he \"really wrestled with\" and involved him talking to his wife and praying about it. Sir Ed denied it was political posturing and instead is one of the only ways he could get Mr Trump to listen. \"I didn't want him to come to the UK without being reminded, as best I can, that he has that moral responsibility, frankly,\" he added. \"And from what I'm picking up from many people, there are people across the political spectrum who agree with me and the Democrats that it is Donald Trump, it is the United States who has this power over Netanyahu, over Hamas, albeit indirectly, to stop this horrendous situation.\" Publicly refusing the King's invite is \"the best way I can get my voice heard,\" Sir Ed said. Read more:British journalists demand action from PM over war in GazaHas Trump ended seven wars as he claims? Tony Blair at White House Gaza meeting While Sir Ed is choosing to snub Mr Trump to get his voice heard, former Labour prime minister Sir Tony Blair has been asked by the US president for help on Gaza. Sir Tony joined a White House meeting on Wednesday, chaired by Mr Trump, to discuss the war in Gaza and post-war plans for the Palestinian territory, a senior White House official confirmed. They were joined by Mr Trump's former Middle East envoy and son-in-law, Jared Kushner, to also discuss the hostage crisis and plans to escalate food aid deliveries. The official described it as \"simply a policy meeting\". In July, the Financial Times reported the Tony Blair Institute had participated in a project to develop a post-war Gaza plan, with the think tank having \"had many calls with different groups on post-war reconstruction of Gaza but none included the idea of forcible relocation of people from Gaza\". Sir Ed called on Sir Tony to be quizzed in parliament about his discussions with the Trump administration. \"If he has special insight into Trump's intentions, it's only right that parliament and the government are made privy to this,\" he said. \"We must leverage all the information and resources at our disposal to make Trump do the right thing.\""
    },
    {
        "title": "Nvidia: Tech bubble seems safe so long as AI demand remains high",
        "description": "For all the trillions being spent in the pursuit of artificial intelligence (AI) it still cannot answer the existential question: is AI a truly transformative technology, akin to the railways, or a bubble about to burst, taking global markets with it?",
        "url": "https://news.sky.com/story/nvidia-tech-bubble-seems-safe-so-long-as-ai-demand-remains-high-13419880",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-nvidia-software_6585236.jpg?20240619101906",
        "type": "US",
        "Author": "Paul Kelso",
        "Date Published": "2025-08-28 10:01:00",
        "Headline": "Sky's Paul Kelso writes that while there are gold rush comparisons to make given Nvidia's meteoric rise, there is a good reason why financial market money is sticking with the AI boom. ",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  For all the trillions being spent in the pursuit of artificial intelligence (AI) it still cannot answer the existential question: is AI a truly transformative technology, akin to the railways, or a bubble about to burst, taking global markets with it? In the absence (for now) of a definitive digitally-generated answer, the performance of chip-maker Nvidia is a good proxy. The world's largest company by value has released quarterly results that give clues to the future, as well as evidence of current performance. Nvidia's growth is fundamentally linked to AI. It made its name developing the graphic processing chips (GPUs) that powered gaming and by 2022 was turning over $9bn. A tidy sum, but soon to be eclipsed as CEO Jenson Huang spotted the potential of his GPUs in the nascent AI technology and threw the entire company behind its development. Money latest: Airline makes plus-sized travellers buy two seats That really was transformational. After ChatGPT provided public proof-of-concept for large language AI models (LLMs) in early 2023, Nvidia took off. Its valuation trebled last year and has risen 35% already this year on the way to a market value of $4.4trn. \n                  TikTok puts hundreds of UK jobs at risk\n                 \n                  AI 'immune system' Phoebe lands backing from Google arm\n                 \n                  Publishers issue warning on AI-created books imitating sports autobiographies\n                 That's double the value of every company in the FTSE100 combined and getting on for 25% larger than total UK GDP. With stratospheric valuations come similarly lofty expectations, however, which helps explain why, despite reporting $46.7bn in second quarter revenue and $26.4bn in profits, both ahead of expectations and up more than 50% year-on-year, markets were initially unimpressed and Nvidia shares dipped 3% in post-close trading. That sentiment may not last, but could be explained by questions over Nvidia's access to Chinese markets, blocked until recently by Donald Trump. Huang has done a deal with the US president to hand over 15% of its revenues from sales to Beijing, but until it is inked, Nvidia is neither booking or forecasting Chinese revenue.  The vibes around AI have also shifted in recent months. A recent report from the Massachusetts Institute of Technology found scant evidence of meaningful returns on AI investment despite huge spending across the corporate landscape. And after OpenAI's ChatGPT-5 launched to lukewarm reviews, its founder Sam Altman, one of the biggest beneficiaries of the hype, wondered out loud whether the market was overheated. Despite the noise, Nvidia believes it has plenty of road left to run, and with good reason. Tech giants Google, Microsoft, Meta and Amazon and many others are all chasing the potential of AI, perhaps uncertain what it might ultimately deliver but desperate to be first to find out. That impetus is driving enormous investment in hardware. More than $41bn of Nvidia's Q2 revenues came from the sale of data centre equipment, and it predicts another $3tn-$4tn will be invested in AI infrastructure by the end of the decade. If anything on that scale is realised, then Nvidia and Jenson Huang will keep winning. Like the railroad pioneers who transported prospectors west during the California gold rush, it matters less that they strike lucky as long as they keep trying."
    },
    {
        "title": "How the US trade war is now targeting you from today",
        "description": "Donald Trump has cancelled a loophole from today that had allowed consumers and businesses to be spared duties for sending low-value goods to the United States.",
        "url": "https://news.sky.com/story/how-the-us-trade-war-is-now-targeting-you-from-today-13419843",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-trump-money-dollars_6965913.png?20250716092207",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-08-28 23:01:00",
        "Headline": "Very few have heard of de minimis rules but the US president has just imposed a big change on the rest of the world after first going after China's e-commerce giants.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump has cancelled a loophole from today that had allowed consumers and businesses to be spared duties for sending low-value goods to the United States. The so-called de minimis exemption had applied across the world before Trump 2.0 but the president has taken action - and the UK may soon follow suit - as part of his trade war. The relief had allowed goods worth less than $800 (£595) to enter the US duty-free since 2016. But now, low-cost packages face the same tariff rate as other, more expensive, goods. The reasons for the latest bout of protectionism are numerous and the ramifications are country and purpose specific. What is changing? It was no accident that China was the first destination to be slapped with this rule change. \n                  Ed Davey reveals he has written to King to explain Trump state dinner boycott\n                 \n                  Vladimir Putin may be playing for time while he carries on beating down Ukraine's will to win\n                 \n                  Historic legal battle launched as Fed governor Lisa Cook fights back against firing\n                 The duty exemption on low-value Chinese goods was ended in May as US retailers, in fact those across the Western world, complained bitterly that they were being undercut by cheap clothing, accessories and household goods shipped by the likes of Shein and Temu. From today, Mr Trump is expanding the end of the de minimis rule to the rest of the world. Why is Trump doing this? The president is not acting purely to protect US businesses. More duties mean more money for his tariff treasure chest, bolstering the goodies already pouring in from his base and reciprocal tariffs imposed on trading partners globally this year. The Trump administration has also called out \"deceptive shipping practices, illegal material and duty circumvention\". It also believes many parcels claiming to contain low-value goods have been used to fuel the country's supplies of fentanyl, with the importation of the illegal drug being used by the president as a reason for his wider trade war against allies including Canada. How will it apply?  Under the new rules, only letters and personal gifts worth less than $100 (£74) will still be free of import duties. Charges will depend on the tariff regime facing the country from where the goods are sent. Fox example, a parcel containing products worth $600 would raise $180 in extra duties when sent from a country facing a 30% tariff rate. It has sparked chaos in many countries, with postal services in places including Japan, Germany and Australia refusing to accept many items for delivery to the US until the practicalities of the new regime become clearer. What about the UK? All goods not meeting the £74 exemption criteria now face a 10% charge because that is the baseline tariff the US has slapped on imports from the UK. We were spared, if you remember, higher reciprocal tariffs under the so-called \"trade deal\". How will the process work? All shipping and delivery companies will be wading through the changes, with the big international operators such as DHL, FedEx and the like all promising to navigate the challenge. Royal Mail said on Thursday that it would be the first international postal service to have a dedicated operation. It said consumers could use its new postal delivery duties paid (PDDP) services both online and at Post Offices. But it explained that business customers faced different restrictions to individuals. Read more from Sky News:Up to 550 UK jobs to go at carmaker LotusWhy the tech bubble seems safe - at least for now Businesses would be charged a handling fee per parcel to cover additional costs and duties would be calculated based on where items were originally manufactured. While business account customers could be handed an invoice for the duties, it explained that consumers would have to pay at the point of buying postage. No customs declaration would be required, it concluded, for personal correspondence. Is the US alone in doing this? The answer is no, but it remains a fairly widespread relief globally. The European Union, for example, removed de minimis breaks back in 2021, making all e-commerce imports to the bloc subject to VAT. It is also now planning to introduce a fee of €2 on goods worth €150 or less to cover the costs of customs processing. Should the UK do the same?  The UK has been under pressure for many years to follow suit and drop its own £135 duty-free threshold as retailers battle the cheap e-commerce competition from China we mentioned earlier. A review was announced by the chancellor in April. Sky News revealed in July how the total declared trade value of de minimis imports into the UK in the 2024-25 financial year was £5.9bn - a 53% increase on the previous 12-month period. Any rise in revenue would be welcomed, not only by UK retailers, but by Rachel Reeves too as she looks to fill a renewed black hole in the public finances."
    },
    {
        "title": "Up to 550 UK jobs to go at carmaker Lotus with tariffs blamed",
        "description": "Up to 550 roles are to be cut across car maker Lotus's UK operations, the company said. ",
        "url": "https://news.sky.com/story/up-to-550-uk-jobs-to-go-at-carmaker-lotus-with-tariffs-blamed-13419972",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lotus-yellow-sport-car_7003673.jpg?20250828145106",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-08-28 13:11:00",
        "Headline": "Despite the cuts, the company said it was committed to the UK, and staff may be moved to different areas of the business. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Up to 550 roles are to be cut across car maker Lotus's UK operations, the company said.  The losses will be made across the business, with no one portion in particular being pared back, a spokesperson said. A consultation process on the cuts is underway, and those who lose their job will have the opportunity to apply for another Lotus role. The company said it is \"actively exploring future growth opportunities to diversify Lotus Cars' business model, including through third-party manufacturing\". Most of Lotus's 1,300 employees work at the Norwich headquarters in Hethel, so it is this site which will sustain the greatest losses. Lotus also operates an engineering division in Wellesbourne, Warwickshire. Why are the jobs going? Uncertainty, including from President Trump's tariffs, was cited as the reason for the roles reduction. \n                  How the US trade war is now targeting you from today\n                 \n                  Cost of weight-loss drug Mounjaro to be discounted in UK pharmacies when price hike comes into force, Sky News learns\n                 \n                  Steel tycoon Gupta's troubles deepen amid Australian probe\n                 \"The proposal is designed to enable Lotus Cars to operate with a flexible and agile business model, allowing it to ramp operations and resources in line with demand, as and when needed,\" a statement read. \"We believe this is necessary in order to secure a sustainable future for the company in today's rapidly evolving automotive environment, which is seeing uncertainty with rapid changes in global policies including tariffs.\" Another reason the cuts are coming is the company's plans to use more resources from Lotus's global business. \"The company plans to increase integration globally across the wider Lotus group and is exploring greater resource sharing and collaboration across its operations\", it said. \"This comes on the heels of the recent news Lotus Technology plans to acquire 100% equity interest in Lotus UK in 2025, consolidating all Lotus businesses and operations together.\"  The former chief executive of Aston Martin, Andy Palmer, told Sky News that, like the rest of the car industry, Lotus had been struggling with Chinese customers moving to domestic electric car brands. Brand loyalty doesn't apply in the same way when customers are trying out something new, namely electric vehicles, Mr Palmer added. Lotus also allowed its brand equity to erode by manufacturing SUVs in China at \"aspirationally high volumes\". There is optimism from the fact Lotus is known in the industry for its expertise in creating lightweight vehicles, important at a time when electric vehicles need to be aerodynamic and reduce drag. Lotus said it was \"fully committed to the UK\". \"Norfolk will remain the home of the Lotus' sports car, motorsports and engineering consulting operations\"."
    },
    {
        "title": "Cost of weight-loss drug Mounjaro to be discounted in UK pharmacies when price hike comes into force, Sky News learns",
        "description": "The cost of Mounjaro, one of Britain's biggest-selling weight loss drugs, will be heavily discounted across UK pharmacies when the official list price soars next week, Sky News has learned.",
        "url": "https://news.sky.com/story/cost-of-weight-loss-drug-mounjaro-to-be-heavily-discounted-across-uk-pharmacies-amid-price-hike-13419987",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mounjaro-weight-loss_6948297.jpg?20250623033923",
        "type": "Business",
        "Author": "Thomas Moore",
        "Date Published": "2025-08-28 13:48:00",
        "Headline": "A confidential document from the makers Eli Lilly to pharmacies sets out the scheme, with a saving of £83 on the cost of the maximum dose.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  The cost of Mounjaro, one of Britain's biggest-selling weight loss drugs, will be heavily discounted across UK pharmacies when the official list price soars next week, Sky News has learned. We've seen a confidential document from the makers Eli Lilly to pharmacies setting out the scheme, with a saving of £83 on the cost of the maximum dose. It would take some of the sting out of the sharp price hike previously announced by the pharmaceutical giant. But, under the new plans, the cost will still double for the 15mg top dose, rising from £122 a month to £247.50 from 1 September. The price of the highest dose was set to go up 170%, from £122 to £330. Lower doses will get smaller discounts. Eli Lilly confirmed the scheme. In a statement to Sky News, it said: \"We are working with private providers on commercial arrangements to maintain affordability and expect these to be passed onto patients when the change is effective on 1 September. \"We are already seeing providers respond in different ways to the list price change, with a range of options available for eligible patients.\" Read more:Mounjaro manufacturer pauses UK shipments of weight lossWhat are weight loss jabs and what were they designed to do?  Many obese patients have been thrown by the sharp rise in the cost of the drug, announced with just two weeks' warning. More than 1.25 million people in the UK are taking weight loss drugs, the vast majority of them paying privately because NHS provision is severely limited. Around 90% of them are currently taking weekly injections of Mounjaro - also known by its generic name tirzepatide. Clinical trials show people lose 20% of their weight in a matter of months. The alternative drug Wegovy leads to weight loss of 15%. Reece Maddick has been taking Mounjaro since November, when he weighed 24st (152kg). He has since lost more than 6st (38kg), with a dramatic improvement to his physical and mental wellbeing. He stockpiled a two-month supply when he heard the price was rising, but he isn't sure he can afford to continue treatment beyond that. \"It does petrify me,\" he said. \"I don't want to go back to where I was eight or nine months ago.\" He recently missed a weekly dose and almost immediately found his appetite returning. \"I fear just from that week missing it,\" he said. \"I think it's like jumping off a cliff, and you're back to square one. I'd put all the weight back on. No doubt in my mind.\" The online pharmacy CheqUp is shipping 4,000 orders for weight-loss drugs every day from its base in Chippenham, Wiltshire. Almost all are for Mounjaro. It thinks most users will switch to Wegovy because it will be cheaper than Mounjaro from next month. But they fear others will take risks with their health to try to save money. James Hunt, the pharmacy's director, said: \"We would urge absolutely everybody to avoid the black market, to avoid beauticians offering to give you injections of semaglutide (Wegovy) or tirzepatide (Mounjaro). Absolutely do not do that. \"We would also urge people not to microdose, not to skip weeks. \"If you're taking a medication you need to use that medication as it's been instructed and designed to be used clinically.\" The price rise followed complaints by US President Donald Trump that \"foreign freeloaders\" were getting a better deal on medicines than Americans, with the White House pressuring pharmaceutical giants to increase the price of the drug abroad so it can be made cheaper in the US. Eli Lilly said the UK was one of the first countries to roll out Mounjaro, and the list price had been significantly lower than the European average. In a statement, it said: \"We are now aligning the list price more consistently to ensure fair global contribution to the cost of innovation.\" Olivier Picard, chair of the National Pharmacy Association, said: \"This rebate will mitigate some of the impact of the increase in Mounjaro prices faced by pharmacies but patients should still anticipate seeing a rise in prices from 1 September. \"Prices advertised in many pharmacies will already reflect this discount and pharmacies will also have to wait to receive this retrospectively after dispensing.\""
    },
    {
        "title": "Steel tycoon Gupta's troubles deepen amid Australian probe",
        "description": "Sanjeev Gupta, the metals tycoon whose main British business was forced into compulsory liquidation last week, is facing a deepening probe by Australian regulators into his operations in the country.",
        "url": "https://news.sky.com/story/steel-tycoon-guptas-troubles-deepen-amid-australian-probe-13419822",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-liberty-steel-sanjeev-gupta_6996353.jpg?20250820171224",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-28 08:19:00",
        "Headline": "Australia's markets watchdog is said to have taken possession of a mobile phone belonging to Sanjeev Gupta as part of a deepening investigation into his operations, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Sanjeev Gupta, the metals tycoon whose main British business was forced into compulsory liquidation last week, is facing a deepening probe by Australian regulators into his operations in the country. Sky News has learnt that officials from the Australian Securities & Investment Commission (ASIC) last week served Mr Gupta's Liberty Steel group with a new demand for information about its activities. Sources said the regulator had also taken possession of a mobile phone belonging to Mr Gupta as part of the probe. Money latest: Airline makes plus-sized travellers buy two seats One insider said that other senior executives at the company may also have had electronic devices confiscated, although the accuracy of this claim could not be verified on Thursday morning. Both ASIC and a spokesman for Mr Gupta's GFG conglomerate refused to comment on the suggestion that a search warrant had been produced by the watchdog. ASIC's deepening investigation comes a month after it said that three of GFG Alliance's companies had been ordered by the Supreme Court of New South Wales to lodge outstanding annual reports with it. \n                  How the US trade war is now targeting you from today\n                 \n                  Up to 550 UK jobs to go at carmaker Lotus with tariffs blamed\n                 \n                  Cost of weight-loss drug Mounjaro to be discounted in UK pharmacies when price hike comes into force, Sky News learns\n                 It is the latest headache to hit Mr Gupta, whose companies remain under investigation by the Serious Fraud Office in the UK. Last week, the Official Receiver took control of Speciality Steels UK following a winding-up petition from creditors led by Greensill Capital, the collapsed finance firm. Mr Gupta remains intent on buying SSUK back, and has assembled financing from BlackRock, the world's largest asset manager, Sky News revealed last week. SSUK employs nearly 1,500 people at steel plants in South Yorkshire, and makes highly engineered steel products for use in sectors such as aerospace, automotive and oil and gas. \"[Gupta Family Group] will now continue to advance its bid for the business in collaboration with prospective debt and equity partners and will present its plan to the official receiver,\" Jeffrey Kabel, chief transformation officer, at Liberty Steel, said after SSUK's collapse. \"GFG continues to believe it has the ideas, management expertise and commitment to lead SSUK into the future and attract major investment.\" \"The plan that GFG presented to the court would have secured new investment in the UK steel industry, protecting jobs and establishing a sustainable operational platform under a new governance structure with independent oversight,\" Mr Kabel added. \"Instead, liquidation will now impose prolonged uncertainty and significant costs on UK taxpayers for settlements and related expenses, despite the availability of a commercial solution.\" Mr Gupta wants to hand control of SSUK to his family in a bid to alleviate concerns about his influence. One source close to the situation claimed that the ownership structure devised by Mr Gupta would be independent, ring-fenced from him and have \"robust standards of governance\". Behind Tata Steel and British Steel, SSUK is the third-largest steel producer in the country. Other parts of Mr Gupta's empire have been showing signs of financial stress for years. Mr Gupta is said to have explored whether he could persuade the government to step in and support SSUK using the legislation enacted to take control of British Steel's operations. His overtures were dismissed by Whitehall officials. He had previously sought government aid during the pandemic but that plea was also rejected by ministers."
    },
    {
        "title": "Ex-BCG boss Quickenden to chair Cinven-backed Grant Thornton",
        "description": "A former boss of the consultancy firm BCG is being drafted in to chair one of Britain's biggest auditors by its new private equity backers.",
        "url": "https://news.sky.com/story/ex-bcg-boss-quickenden-to-chair-cinven-backed-grant-thornton-13420167",
        "image_url": "https://e3.365dm.com/22/04/1920x1080/skynews-grant-thornton-auditor_5756259.jpg?20241015163441",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-28 18:30:00",
        "Headline": "Stuart Quickenden has been recruited by the private equity group to chair a professional services firm which sits just outside the 'big four' auditors, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A former boss of the consultancy firm BCG is being drafted in to chair one of Britain's biggest auditors by its new private equity backers. Sky News has learnt that Stuart Quickenden, who is now a senior advisor to BCG in the UK, will be named chairman of Grant Thornton UK in an announcement expected on Friday. His appointment will come nearly nine months after Grant Thornton's UK partners voted to approve the sale of a majority stake in the firm to Cinven, the buyout firm. The deal, which was understood to value the accountancy firm at about £1.5bn, formed part of a rush of deals in the professional services sector. Mr Quickenden has a strong pedigree in the industry, and now also serves as chairman of Octopus Investments, a backer of myriad early-stage companies. Grant Thornton UK sits just below the ranks of the big four audit firms, a group comprising Deloitte, EY, KPMG and PricewaterhouseCoopers. In its last financial year, Grant Thornton's roughly 250 UK partners earned average pay packets of £682,000. \n                  How the US trade war is now targeting you from today\n                 \n                  Up to 550 UK jobs to go at carmaker Lotus with tariffs blamed\n                 \n                  Cost of weight-loss drug Mounjaro to be discounted in UK pharmacies when price hike comes into force, Sky News learns\n                 The firm audits a number of FTSE-350 companies, while its restructuring division is the administrator to Greensill Capital, which is involved in the liquidation of Sanjeev Gupta's Speciality Steels UK. A string of deals has taken place in recent months across the professional services sector, including AlixPartners raising new debt financing in an oversubscribed deal and MHA - the UK arm of Baker Tilly - floating on the London Stock Exchange. Cinven declined to comment on Thursday."
    },
    {
        "title": "Nvidia: Tech bubble seems safe so long as AI demand remains high",
        "description": "For all the trillions being spent in the pursuit of artificial intelligence (AI) it still cannot answer the existential question: is AI a truly transformative technology, akin to the railways, or a bubble about to burst, taking global markets with it?",
        "url": "https://news.sky.com/story/nvidia-tech-bubble-seems-safe-so-long-as-ai-demand-remains-high-13419880",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-nvidia-software_6585236.jpg?20240619101906",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-08-28 10:01:00",
        "Headline": "Sky's Paul Kelso writes that while there are gold rush comparisons to make given Nvidia's meteoric rise, there is a good reason why financial market money is sticking with the AI boom. ",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  For all the trillions being spent in the pursuit of artificial intelligence (AI) it still cannot answer the existential question: is AI a truly transformative technology, akin to the railways, or a bubble about to burst, taking global markets with it? In the absence (for now) of a definitive digitally-generated answer, the performance of chip-maker Nvidia is a good proxy. The world's largest company by value has released quarterly results that give clues to the future, as well as evidence of current performance. Nvidia's growth is fundamentally linked to AI. It made its name developing the graphic processing chips (GPUs) that powered gaming and by 2022 was turning over $9bn. A tidy sum, but soon to be eclipsed as CEO Jenson Huang spotted the potential of his GPUs in the nascent AI technology and threw the entire company behind its development. Money latest: Airline makes plus-sized travellers buy two seats That really was transformational. After ChatGPT provided public proof-of-concept for large language AI models (LLMs) in early 2023, Nvidia took off. Its valuation trebled last year and has risen 35% already this year on the way to a market value of $4.4trn. \n                  TikTok puts hundreds of UK jobs at risk\n                 \n                  AI 'immune system' Phoebe lands backing from Google arm\n                 \n                  Publishers issue warning on AI-created books imitating sports autobiographies\n                 That's double the value of every company in the FTSE100 combined and getting on for 25% larger than total UK GDP. With stratospheric valuations come similarly lofty expectations, however, which helps explain why, despite reporting $46.7bn in second quarter revenue and $26.4bn in profits, both ahead of expectations and up more than 50% year-on-year, markets were initially unimpressed and Nvidia shares dipped 3% in post-close trading. That sentiment may not last, but could be explained by questions over Nvidia's access to Chinese markets, blocked until recently by Donald Trump. Huang has done a deal with the US president to hand over 15% of its revenues from sales to Beijing, but until it is inked, Nvidia is neither booking or forecasting Chinese revenue.  The vibes around AI have also shifted in recent months. A recent report from the Massachusetts Institute of Technology found scant evidence of meaningful returns on AI investment despite huge spending across the corporate landscape. And after OpenAI's ChatGPT-5 launched to lukewarm reviews, its founder Sam Altman, one of the biggest beneficiaries of the hype, wondered out loud whether the market was overheated. Despite the noise, Nvidia believes it has plenty of road left to run, and with good reason. Tech giants Google, Microsoft, Meta and Amazon and many others are all chasing the potential of AI, perhaps uncertain what it might ultimately deliver but desperate to be first to find out. That impetus is driving enormous investment in hardware. More than $41bn of Nvidia's Q2 revenues came from the sale of data centre equipment, and it predicts another $3tn-$4tn will be invested in AI infrastructure by the end of the decade. If anything on that scale is realised, then Nvidia and Jenson Huang will keep winning. Like the railroad pioneers who transported prospectors west during the California gold rush, it matters less that they strike lucky as long as they keep trying."
    },
    {
        "title": "Financier Hands eyes stay at Hotel du Vin and Malmaison hotels",
        "description": "The private equity firm founded by Guy Hands, the veteran financier, is exploring an offer to buy Hotel du Vin and Malmaison, two of Britain's best-known hotel chains.",
        "url": "https://news.sky.com/story/financier-hands-eyes-stay-at-hotel-du-vin-and-malmaison-hotels-13420013",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-malmaison-hotel-dundee_6971501.jpg?20250723094812",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-28 14:14:00",
        "Headline": "Terra Firma Capital Partners is among the suitors considering a takeover of the Singaporean-owned hotel chains, which trade from 37 sites across the UK, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The private equity firm founded by Guy Hands, the veteran financier, is exploring an offer to buy Hotel du Vin and Malmaison, two of Britain's best-known hotel chains. Sky News has learnt that Terra Firma Capital Partners, which is now run by Mr Hands' son, Richard, is among the suitors who have been in talks with advisers to the chain's owner. The prospects of a firm deal materialising were unclear on Thursday. If a transaction did take place, it would be the latest in a string of prominent UK assets to have been owned by Terra Firma. Among its investments - some of which turned out to be financially and reputationally notorious - were the music company EMI, the care homes operator Four Seasons Health Care and Annington Homes, the former owner of thousands of Ministry of Defence homes. More recently, it has focused on managing Mr Hands' family's money, although it does still have some external investors. The elder Mr Hands retired from his full-time roles at Terra Firma two years ago, having built it over several decades. \n                  How the US trade war is now targeting you from today\n                 \n                  Up to 550 UK jobs to go at carmaker Lotus with tariffs blamed\n                 \n                  Cost of weight-loss drug Mounjaro to be discounted in UK pharmacies when price hike comes into force, Sky News learns\n                 His wife, Julia, is chair of Hand Picked Hotels, a collection of former stately homes which trades across the UK. Its sites were acquired from Sir Richard Branson's Virgin Group in 2001. Malmaison and Hotel du Vin sit under the same ownership structure, and trades from 37 hotels in 27 UK cities, with the portfolio split almost equally between the two brands. The chains have been through a succession of owners over the last 20 years, including the private equity firm KSL Capital Partners. They are now owned by Singapore-based Frasers Hospitality Group, which reportedly paid more than £360m to acquire the group in 2015. Among the other potential bidders for the chains has been Fortress Investment Group, Sky News reported several months ago. Cushman & Wakefield (C&W), the commercial property agent, is handling the auction. A Terra Firma spokesperson declined to comment."
    },
    {
        "title": "Historic legal battle launched as Fed governor Lisa Cook fights back against firing",
        "description": "A governor of the US central bank has made good on her threat to sue the Trump administration, which has attempted to fire her. ",
        "url": "https://news.sky.com/story/historic-legal-battle-launched-as-fed-governor-lisa-cook-fights-back-against-firing-13420033",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jay-powell-lisa-cook_7001482.jpg?20250826061303",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-08-28 14:51:00",
        "Headline": "Dr Cook's legal filing said President Trump's social media announcement of her sacking is \"unprecedented and illegal\" and would, if allowed, be the first in Fed history. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n A governor of the US central bank has made good on her threat to sue the Trump administration, which has attempted to fire her.  Legal representatives for Dr Lisa Cook on Thursday launched an injunction to prevent President Trump removing her from the role, teeing up a legal battle for political independence of the interest rate-setting Federal Reserve. Such action is unprecedented and will have implications for the body known as the Fed, which is mandated to keep inflation at 2% and ensure maximum employment in the US. Money latest: Terry Wogan's son rages at Rachel Reeves Mr Trump has said Dr Cook committed mortgage fraud by listing two properties as her primary residence in short succession. Mortgage rates tend to be lower on primary residences. The move is the latest in a long line of attempts by Mr Trump to exert control of the Fed and bring down interest rates to make borrowing cheaper.  Dr Cook's filing described her sacking, announced on social media, as \"unprecedented and illegal\", which \"if allowed to occur, would the first of its kind in the board's history\". \n                  How the US trade war is now targeting you from today\n                 \n                  Ed Davey reveals he has written to King to explain Trump state dinner boycott\n                 \n                  Vladimir Putin may be playing for time while he carries on beating down Ukraine's will to win\n                 \"It would subvert the Federal Reserve Act (FRA), which explicitly requires a showing of \"cause\" for a governor's removal, which an unsubstantiated allegation about private mortgage applications submitted by governor Cook prior to her Senate confirmation is not.\" Mr Trump has been displeased for months at the slow progress in reducing interest rates, with the Fed's chair Jerome Powell a frequent target of his ire. Uncertainty and higher inflation forecasts stemming from the Trump administration's tariff policies have led to a holding of interest rates at 4.25%-4.5%. Unlike the UK, the US interest rate is a range to guide lenders rather than a single percentage. A judge has set the hearing date for Dr Cook's on Friday. Who is Dr Cook? As a governor of the Fed, Dr Cook is one of seven people who set the borrowing rates. She was appointed by President Biden in 2022 and became the first African American person to hold the role. Before her appointment, she served on President Obama's Council of Economic Advisers and worked at the US Treasury, the government department tasked with overseeing the country's finances. Her academic research delved into the impacts of uncertainty on economies, in particular, violence in the Jim Crow South and its impact on patent filing, and the banking system in czarist and post-Soviet Russia. Operational independence of the Fed is a core tenet of the US economy, but the market reaction has been muted with US government borrowing costs and stock markets little moved."
    },
    {
        "title": "Ed Davey reveals he has written to King to explain Trump state dinner boycott",
        "description": "Sir Ed Davey has written to King Charles to explain why he believes he has to refuse his invite to a state banquet for Donald Trump.",
        "url": "https://news.sky.com/story/ed-davey-reveals-he-has-written-to-king-to-explain-trump-state-dinner-boycott-13420135",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-king-charles-vj-day_6991118.jpg?20250814220523",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-28 17:38:00",
        "Headline": "The Lib Dem leader said it was a very difficult decision as he has \"huge respect\" for the King but feels it is the best way to get his voice heard on Gaza.",
        "Content": " Sir Ed Davey has written to King Charles to explain why he believes he has to refuse his invite to a state banquet for Donald Trump. The Lib Dem leader said on Wednesday he will be boycotting the dinner next month during the US president's second state visit to the UK because of the situation in Gaza. He told Sky News on Thursday: \"I've written to him [the King] personally explaining my thinking. \"And it's with deep regret that I've had to take the decision, but I feel with what is going on in Gaza, it's the best way I can get my voice heard.\" Politics latest: Asylum hotel injunction appeal decision coming soon Sir Ed said the \"sad truth\" is Mr Trump is the \"one man\" who has the power to stop the \"horrible famine in Gaza, could get the hostages released, could bring an end to this horrendous humanitarian crisis\". He said the US president could do that by phoning up Israeli Prime Minister Benjamin Netanyahu and telling him to stop. \n                  How the US trade war is now targeting you from today\n                 \n                  Vladimir Putin may be playing for time while he carries on beating down Ukraine's will to win\n                 \n                  Historic legal battle launched as Fed governor Lisa Cook fights back against firing\n                 The Lib Dem leader said Mr Trump could also call up the Qatari government and other Gulf states to get them to put pressure on Hamas to release the remaining 50 Israeli hostages (20 living, 30 dead) they took on 7 October 2023. He emphasised that he has \"huge respect\" for the King and it was a very difficult decision he \"really wrestled with\" and involved him talking to his wife and praying about it. Sir Ed denied it was political posturing and instead is one of the only ways he could get Mr Trump to listen. \"I didn't want him to come to the UK without being reminded, as best I can, that he has that moral responsibility, frankly,\" he added. \"And from what I'm picking up from many people, there are people across the political spectrum who agree with me and the Democrats that it is Donald Trump, it is the United States who has this power over Netanyahu, over Hamas, albeit indirectly, to stop this horrendous situation.\" Publicly refusing the King's invite is \"the best way I can get my voice heard,\" Sir Ed said. Read more:British journalists demand action from PM over war in GazaHas Trump ended seven wars as he claims? Tony Blair at White House Gaza meeting While Sir Ed is choosing to snub Mr Trump to get his voice heard, former Labour prime minister Sir Tony Blair has been asked by the US president for help on Gaza. Sir Tony joined a White House meeting on Wednesday, chaired by Mr Trump, to discuss the war in Gaza and post-war plans for the Palestinian territory, a senior White House official confirmed. They were joined by Mr Trump's former Middle East envoy and son-in-law, Jared Kushner, to also discuss the hostage crisis and plans to escalate food aid deliveries. The official described it as \"simply a policy meeting\". In July, the Financial Times reported the Tony Blair Institute had participated in a project to develop a post-war Gaza plan, with the think tank having \"had many calls with different groups on post-war reconstruction of Gaza but none included the idea of forcible relocation of people from Gaza\". Sir Ed called on Sir Tony to be quizzed in parliament about his discussions with the Trump administration. \"If he has special insight into Trump's intentions, it's only right that parliament and the government are made privy to this,\" he said. \"We must leverage all the information and resources at our disposal to make Trump do the right thing.\""
    },
    {
        "title": "UK, France and Germany plan to reimpose sanctions on Iran over nuclear weapon fears",
        "description": "The UK, France and Germany are planning to revive UN-backed sanctions on Iran over fears it is developing nuclear weapons.",
        "url": "https://news.sky.com/story/uk-france-and-germany-plan-to-reimpose-sanctions-on-iran-over-nuclear-weapon-fears-13419988",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-tehran-iran_6966123.jpg?20250716133215",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-28 13:48:00",
        "Headline": "The three nations said Iran has continually breached a 2015 agreement and its nuclear programme is a threat to global peace and security.",
        "Content": "The UK, France and Germany are planning to revive UN-backed sanctions on Iran over fears it is developing nuclear weapons. The three European nations, known as the E3, are triggering the \"snapback\" mechanisms after efforts to restart diplomatic talks over Tehran's nuclear programme stalled. Read more: Asylum hotel appeal decision expected Iran insists its nuclear programme is for peaceful purposes, but it has enriched uranium to levels exceeding that required for civil nuclear power. This is a breach of a deal agreed with Western nations in 2015, when a series of sanctions were suspended. However, the E3 now wants to reimpose those sanctions, which were made by a UN resolution. The sanctions include freezing Iranian assets abroad, halting arms deals with Tehran and penalising any development of its ballistic missile programme to further squeeze Iran's flailing economy. \n                  Concern after British couple detained in Iran 'suddenly whisked' to courtroom\n                 \n                  Family 'seriously worried' for parents detained in Iran's 'harshest prison'\n                 \n                  British couple Lindsay and Craig Foreman make first call home since being detained in Iran\n                 Before the sanctions are implemented, there will be a 30-day period when the UK, France and Germany hope talks can take place and Iran will agree to step back its nuclear ambitions. The E3 wrote to US secretary of state Marco Rubio informing him of their intent, and on Thursday afternoon, notified the UN. The UN Security Council will meet on Friday to discuss the move, it is understood. Russia and China, two out of five permanent members of the UN Security Council, quickly drafted a resolution to extend the Iran nuclear deal for six months and urge all parties to immediately resume negotiations. Russia's deputy UN envoy said the E3's move has \"no legal bearing\". E3: Iran's nuclear programme is threat to international peace In a joint statement, the foreign ministers of the UK, France and Germany, said they have \"consistently\" undertaken \"intensive diplomatic efforts\" over the past five years to de-escalate tensions and bring Iran and the US to the negotiating table after Iran essentially abandoned the 2015 agreement. But they said Iran has refused suggested packages while \"continuing to raise unacceptable demands\". They added: \"Today, Iran's non-compliance with the Joint Comprehensive Plan of Action (JCPoA) is clear and deliberate, and sites of major proliferation concern in Iran are outside of IAEA monitoring. \"Iran has no civilian justification for its high enriched uranium stockpile - now over nine Significant Quantities - which is also unaccounted for by the IAEA. Its nuclear programme, therefore, remains a clear threat to international peace and security.\" They committed to \"strive to diplomatically resolve\" the issue and will use the 30-day period to \"engage with Iran\". US welcomes sanctions snapback Mr Rubio welcomed the sanctions snapback and said the E3 have laid out a clear case of Iran's continuing \"significant non-performance\" of its nuclear commitments. He confirmed the US will work with the E3 and members of the UN Security Council to complete the reimposition of the sanctions, and said the US remains available for direct engagement with Iran. Iran rejects move The development has not been met well by the Iranians, with Tehran's foreign ministry saying it \"strongly rejects and firmly\" condemns the move. They called it a \"provocative and unnecessary escalation\" and said it will be met with \"appropriate responses\".  Donald Trump withdrew the US from the JCPOA on Iran's nuclear agreement in 2018, three years after an agreement between Iran and the UN Security Council's five permanent members (China, France, Russia, the UK, the US) plus Germany, and re-imposed sanctions that had been lifted when the agreement was made in 2015. Tehran's relations with the West are strained following its 12-day war with Israel earlier this year. During that conflict, Israel targeted Iran's largest nuclear sites, claiming Tehran was close to developing nuclear weapons. Lammy: Ball is in Iran's court British foreign secretary David Lammy said the UK and its European allies have \"negotiated in good faith\" with Iran since 2019, but are now \"left with no choice\" but to reintroduce sanctions. He said: \"Iran's nuclear programme remains a threat to global peace and security. Over the past six years, Iran has broken almost all limits in the JCPOA (Joint Comprehensive Plan of Action) and its stockpile of enriched uranium is 45 times over the JCPOA limit. \"Alongside our European allies, the UK has negotiated in good faith since 2019, when Iran began to disregard the nuclear deal. We supported a viable deal in 2022, which Iran rejected, and recently offered an extension to sanctions relief, subject to Iran meeting set conditions.\" \"Whilst we have been left with no choice but to take this action, the ball remains in Iran's court and I would welcome their return to the table with a serious offer,\" he added."
    },
    {
        "title": "Senior judges prepare to rule on whether to overturn asylum seeker hotel injunction",
        "description": "Senior judges have been warned an injunction which would ban asylum seekers from being housed at an Essex hotel could spark further protests if they decide not to overturn it on Friday.",
        "url": "https://news.sky.com/story/senior-judges-prepare-to-rule-on-whether-to-overturn-asylum-seeker-hotel-injunction-13420034",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-epping-bell-hotel_7001771.jpg?20250826141105",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-28 15:03:00",
        "Headline": "The Bell Hotel has became the focal point of several protests after an asylum seeker housed there was charged with sexually assaulting a teenage girl.",
        "Content": "Senior judges have been warned an injunction which would ban asylum seekers from being housed at an Essex hotel could spark further protests if they decide not to overturn it on Friday. The Home Office and Somani Hotels, which owns The Bell Hotel in Epping, are seeking to challenge a High Court ruling that will stop 138 asylum seekers from being housed there beyond 12 September. In a ruling last week, Mr Justice Eyre granted Epping Forest District Council (EFDC) an interim injunction after the authority claimed that Somani Hotels had breached planning rules by using the hotel as accommodation for asylum seekers. The hotel has become the focal point of several protests and counter-protests in recent weeks after an asylum seeker housed there was charged with sexually assaulting a teenage girl. At the end of Thursday's hearing about whether to overturn the temporary injunction, Lord Justice Bean, sitting with Lady Justice Nicola Davies and Lord Justice Cobb at the Court of Appeal, said that they would hand down their judgment on Friday afternoon. He said: \"Because of the great urgency of this matter, we will aim to give judgment at 2pm tomorrow.\" He continued: \"If it proves impractical for us to meet the deadline, we will let people know in advance.\" \n                  'Our country's ruined': Protesters on why they oppose asylum hotels\n                 \n                  Cost of weight-loss drug Mounjaro to be discounted in UK pharmacies when price hike comes into force, Sky News learns\n                 \n                  UK summons Russian ambassador after British Council building hit in Kyiv\n                 The Home Office is also seeking to challenge Mr Justice Eyre's decision not to let it intervene in the case, while the council opposes the appeal bids. Since the High Court judge's ruling last week, other councils, including Labour-run authorities, have publicly announced their intention to seek legal advice over whether they could achieve similar injunctions for hotels in their areas. In written submissions for the hearing on Thursday, Edward Brown KC, for the Home Office, said ending the use of hotels to accommodate asylum seekers \"requires a structured response\", and that individual injunction bids \"ignore the obvious consequence that closure of one site means that capacity then needs to be identified elsewhere\". Analysis: Epping protests are just the latest flashpoint of frustration He said: \"The judge did not grapple with this. He had no regard to the obvious risk that other local planning authorities would adopt the same approach; that is to say, to use planning concerns as a means of appeasing local political unrest regarding asylum accommodation generally. \"This injunction essentially incentivises other authorities who wish to remove asylum accommodation to move urgently to court before capacity elsewhere in the system becomes exhausted. That creates a chaotic and disorderly approach.\" He added: \"The granting of an interim injunction in the present case runs the risk of acting as an impetus for further protests, some of which may be disorderly, around other asylum accommodation. \"This is on the basis that the protests in Epping appear to be a material factor behind the decision now to bring this claim and not to take planning enforcement action as would normally be expected.\" It comes as Hadush Gerberslasie Kebatu, the asylum seeker charged with sexually assaulting a teenage girl, has been on trial this week after denying the alleged offence. Another man who was living at the site, Syrian national Mohammed Sharwarq, has separately been charged with seven offences, while several other men have been charged over alleged disorder outside the hotel. The hotel previously housed asylum seekers from May 2020 to March 2021, from October 2022 to April 2024, and since April 2025. Single males were also housed at the hotel between October 2022 and April 2024, but this year marked the first time the council had taken enforcement action when it issued legal proceedings earlier this month. Granting the temporary injunction on 19 August, Mr Justice Eyre stated that the council had not \"definitively established\" that Somani Hotels had breached planning rules, but that the company had \"sidestepped public scrutiny and explanation\" by housing asylum seekers at the site without planning permission. Piers Riley-Smith, for Somani Hotels, said in written submissions on Thursday that Mr Justice Eyre \"overlooked\" the \"hardship\" that would be caused to asylum seekers if they were required to move. He continued that the \"extremely high-profile nature of the issue\" created a \"risk of a precedent being set\". Mr Riley-Smith also said that the injunction would cause \"financial harm\" to the company, having told a previous hearing that the contract to accommodate asylum seekers was a \"lifeline\" and that the hotel had been only 1% full in August 2022, when it was open to paying customers. The council has opposed the appeal bids, with barrister Philip Coppel KC stating in written submissions that the case \"sets no precedent\" and there was \"no compelling reason\" for the injunction to be overturned."
    },
    {
        "title": "Concern after British couple detained in Iran 'suddenly whisked' to courtroom",
        "description": "A British couple detained in Iran have been \"suddenly whisked\" to a courtroom in the country's capital, Tehran, their family have said.",
        "url": "https://news.sky.com/story/concern-after-british-couple-detained-in-iran-suddenly-whisked-to-courtroom-13420087",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-craig-and-lindsay-foreman_6831859.jpg?20250217182752",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-28 17:33:00",
        "Headline": "Lindsay and Craig Foreman were arrested in January during a round-the-world motorbike trip and were later charged with espionage - allegations the couple deny.",
        "Content": "A British couple detained in Iran have been \"suddenly whisked\" to a courtroom in the country's capital, Tehran, their family have said. Lindsay and Craig Foreman were arrested in January during a round-the-world motorbike trip and were later charged with espionage - allegations the couple deny. Their son, Joe Bennett, said the family were informed the pair, from East Sussex, appeared in court in Tehran on Wednesday with a \"state-appointed lawyer they only just met\". \"We cannot see how [this] could be considered to be a fair trial,\" he added. Mr Bennett's family said they are \"deeply concerned\" that they had no prior knowledge of the hearing being organised or carried out.  Earlier this month, the couple spoke to their family for the first time in seven months. They later said they were \"seriously worried\" about them after they were moved to one of Iran's \"harshest prisons\". Through their adviser, Radd Seiger, the family have now requested a meeting with Foreign Secretary David Lammy to ensure efforts are made to secure the couple's return to the UK as urgently as possible. Mr Bennett said the latest court update has raised the family's concerns about their well-being. \"The ambassador was due to visit Craig yesterday but that did not happen,\" he said. \"We are not sure if the ambassador went and Craig was not there because he was whisked away to court. \"This is deeply worrying, because it has been well over three-and-a-half months since Craig was last seen. \"At that time, he had already lost weight. \"Now, with no funds and no access to food beyond the bare minimum, I can only guess at how he must be.\" Read more from Sky News:UK plans to reimpose sanctions on Iran over nuclear weapon fearsUN staff pressure human rights chief to call Gaza a genocide The family said they understood Lindsay Foreman had been seen by ambassador Hugo Shorter on Wednesday and \"provided with a comfort pack of essential supplies\". Mr Bennett said the lack of transparency over the court hearing \"only deepens our concern\". \"We cannot see how being suddenly whisked into a courtroom with no warning, with a state-appointed lawyer they only just met, could be considered to be a fair trial,\" he said. \"At least they saw each other, which must be some relief. \"Craig has now been in Evin Prison for 25 days without access to funds. \"In Iran's prison system, detainees must rely on money credited to their accounts to buy food, clean water, and hygiene products. \"The Foreign, Commonwealth & Development Office (FCDO) has so far been unable to transfer money into Craig's account, leaving him without the essentials needed to survive. \"The lack of transparency only deepens our concern.\" The FCDO has warned all British and British-Iranian nationals not to travel to Iran due to a \"significant risk of arrest, questioning or detention\". A spokesperson for the FCDO said: \"We are deeply concerned by reports that two British nationals have been charged with espionage in Iran. We continue to raise this case directly with the Iranian authorities. \"We are providing them with consular assistance and remain in close contact with their family members.\""
    },
    {
        "title": "Chickenpox vaccine to be offered on NHS next year, as part of routine MMR jab for babies",
        "description": "A vaccine against chickenpox will be rolled out on the NHS in England for the first time next year.",
        "url": "https://news.sky.com/story/chickenpox-vaccine-to-be-offered-on-nhs-next-year-as-part-of-routine-mmr-jab-for-babies-13420248",
        "image_url": "https://e3.365dm.com/23/01/1920x1080/skynews-chickenpox-infection_6040635.jpg?20230130094711",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-28 20:51:00",
        "Headline": "The UK Health Security Agency said the varicella vaccination will be available for babies aged between 12 and 18 months old, and is expected to protect around 500,000 every year.",
        "Content": "A vaccine against chickenpox will be rolled out on the NHS in England for the first time next year. The varicella vaccination is currently only available through private treatment and costs around £150. But under new plans, the jab will be included in a new NHS childhood immunisation programme - joining the current range against measles, mumps, and rubella. In a statement, the UK Health Security Agency (UKHSA) said GPs will be able to offer the MMRV (measles, mumps, rubella and varicella) vaccination from January 2025. It will be available for babies aged between 12 and 18 months old, and is expected to protect around 500,000 every year. According to the NHS website, the vaccine provides around 98% protection in children and about 75% protection in adults after two doses. Further booster doses are also not needed. The most well-known symptom of chickenpox is an itchy, spotty rash over the body. But before this appears, children may have a high temperature, a loss of appetite, and may feel generally unwell.\n\n Chickenpox usually gets better on its own within one to two weeks - but some children can develop complications such as bacterial infections like group A strep.\n\n In the rarest cases, the virus can cause swelling of the brain, serious lung inflammation and stroke, sometimes leading to death. Dr Gayatri Amirthalingam, the UKHSA's deputy director of immunisation, called the wider rollout \"excellent news\". He added it would help \"prevent what is for most a nasty illness and for those who develop severe symptoms, it could be a life saver\". Amanda Doyle, national director for primary care and community services at NHS England, also said it marked \"a hugely positive moment for families\". She added: \"We will work with vaccination teams and GP surgeries across the country to roll out the combined MMRV vaccine in the new year, helping to keep children healthy and prevent sickness from these highly contagious viruses.\" Read more:Why are childhood vaccine rates so low?Bereaved mum urges parents to book kids' vaccinations The Joint Committee on Vaccination and Immunisation (JCVI) recommended back in 2023 that the varicella jab should be given to youngsters in two doses as babies. It is also already part of the routine vaccine schedules in a number of countries, including Germany, Australia, Canada and the US. The announcement comes after UKHSA figures showed none of the main childhood vaccines in England reached their uptake targets last year. Some 91.9% of five-year-olds have received one dose of the measles, mumps, and rubella vaccine - a number unchanged from the previous year and at the lowest level since 2010/2011. Just 83.7% of children aged five had received both MMR doses, down year-on-year from 83.9%, and the lowest level since 2009/10."
    },
    {
        "title": "Cost of weight-loss drug Mounjaro to be discounted in UK pharmacies when price hike comes into force, Sky News learns",
        "description": "The cost of Mounjaro, one of Britain's biggest-selling weight loss drugs, will be heavily discounted across UK pharmacies when the official list price soars next week, Sky News has learned.",
        "url": "https://news.sky.com/story/cost-of-weight-loss-drug-mounjaro-to-be-heavily-discounted-across-uk-pharmacies-amid-price-hike-13419987",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mounjaro-weight-loss_6948297.jpg?20250623033923",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-08-28 13:48:00",
        "Headline": "A confidential document from the makers Eli Lilly to pharmacies sets out the scheme, with a saving of £83 on the cost of the maximum dose.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  The cost of Mounjaro, one of Britain's biggest-selling weight loss drugs, will be heavily discounted across UK pharmacies when the official list price soars next week, Sky News has learned. We've seen a confidential document from the makers Eli Lilly to pharmacies setting out the scheme, with a saving of £83 on the cost of the maximum dose. It would take some of the sting out of the sharp price hike previously announced by the pharmaceutical giant. But, under the new plans, the cost will still double for the 15mg top dose, rising from £122 a month to £247.50 from 1 September. The price of the highest dose was set to go up 170%, from £122 to £330. Lower doses will get smaller discounts. Eli Lilly confirmed the scheme. In a statement to Sky News, it said: \"We are working with private providers on commercial arrangements to maintain affordability and expect these to be passed onto patients when the change is effective on 1 September. \"We are already seeing providers respond in different ways to the list price change, with a range of options available for eligible patients.\" Read more:Mounjaro manufacturer pauses UK shipments of weight lossWhat are weight loss jabs and what were they designed to do?  Many obese patients have been thrown by the sharp rise in the cost of the drug, announced with just two weeks' warning. More than 1.25 million people in the UK are taking weight loss drugs, the vast majority of them paying privately because NHS provision is severely limited. Around 90% of them are currently taking weekly injections of Mounjaro - also known by its generic name tirzepatide. Clinical trials show people lose 20% of their weight in a matter of months. The alternative drug Wegovy leads to weight loss of 15%. Reece Maddick has been taking Mounjaro since November, when he weighed 24st (152kg). He has since lost more than 6st (38kg), with a dramatic improvement to his physical and mental wellbeing. He stockpiled a two-month supply when he heard the price was rising, but he isn't sure he can afford to continue treatment beyond that. \"It does petrify me,\" he said. \"I don't want to go back to where I was eight or nine months ago.\" He recently missed a weekly dose and almost immediately found his appetite returning. \"I fear just from that week missing it,\" he said. \"I think it's like jumping off a cliff, and you're back to square one. I'd put all the weight back on. No doubt in my mind.\" The online pharmacy CheqUp is shipping 4,000 orders for weight-loss drugs every day from its base in Chippenham, Wiltshire. Almost all are for Mounjaro. It thinks most users will switch to Wegovy because it will be cheaper than Mounjaro from next month. But they fear others will take risks with their health to try to save money. James Hunt, the pharmacy's director, said: \"We would urge absolutely everybody to avoid the black market, to avoid beauticians offering to give you injections of semaglutide (Wegovy) or tirzepatide (Mounjaro). Absolutely do not do that. \"We would also urge people not to microdose, not to skip weeks. \"If you're taking a medication you need to use that medication as it's been instructed and designed to be used clinically.\" The price rise followed complaints by US President Donald Trump that \"foreign freeloaders\" were getting a better deal on medicines than Americans, with the White House pressuring pharmaceutical giants to increase the price of the drug abroad so it can be made cheaper in the US. Eli Lilly said the UK was one of the first countries to roll out Mounjaro, and the list price had been significantly lower than the European average. In a statement, it said: \"We are now aligning the list price more consistently to ensure fair global contribution to the cost of innovation.\" Olivier Picard, chair of the National Pharmacy Association, said: \"This rebate will mitigate some of the impact of the increase in Mounjaro prices faced by pharmacies but patients should still anticipate seeing a rise in prices from 1 September. \"Prices advertised in many pharmacies will already reflect this discount and pharmacies will also have to wait to receive this retrospectively after dispensing.\""
    },
    {
        "title": "Energy giant Drax probed by watchdog over wood sourcing, following whistleblower claims",
        "description": "Energy giant Drax is being investigated by Britain's financial watchdog about where it gets the wood from that it burns to create electricity.",
        "url": "https://news.sky.com/story/energy-giant-drax-probed-by-watchdog-over-wood-sourcing-following-whistleblower-claims-13419811",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-drax-biomass-bioenergy_6425847.jpg?20240118162634",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-28 07:49:00",
        "Headline": "The probe intensifies scrutiny of Drax, which is subsidised by bill payers to burn wood to create electricity - an energy source deemed \"important\" but whose environmental benefits are disputed.",
        "Content": "Energy giant Drax is being investigated by Britain's financial watchdog about where it gets the wood from that it burns to create electricity. It follows accusations by a former Drax insider in March that the company had misled over its sourcing of wood for biomass pellets. The London-listed company denied those claims. It said it would \"co-operate with the FCA as part of their investigation\" on Thursday. Drax, which used to burn coal at its Yorkshire power station, now receives multimillion-pound subsidies from energy bill-payers to burn woody biomass pellets. The UK government supported this switch as a way to clean up power supplies, and classed the resulting bioenergy as renewable. But that status and the enormous subsidies have been disputed by campaigners and some scientists who fear bioenergy is less green than thought, based on its impact on forests and the years needed for its emissions to be offset. Sky News was the first to reveal in 2021 that Drax's Selby power station is Britain's largest single source of emissions. \n                  Drax subsidies and energy production role cut by government\n                 \n                  Power giant Drax told by own advisers to stop calling biomass 'carbon neutral' \n                 \n                  Criminal proceedings against Drax over 'harmful' dust exposure dropped following new evidence\n                 But the station provides 5% of Britain's electricity and has the advantage of being highly flexible: it can easily be turned up, down or off to match demand, a feat that eludes wind, solar and nuclear power. Shares in the FTSE 250 firm fell more than 12% on Thursday morning.  The group said the Financial Conduct Authority (FCA) probe covers its biomass sourcing statements from January 2022 to March 2024. It will also assess the compliance of Drax's annual reports from 2021-2023 with financial disclosure and transparency rules. The regulator said: \"We can confirm that the FCA has opened an investigation into Drax Group.\" Its probe intensifies scrutiny over Drax, which last year paid a £25m penalty for misreporting data on wood from Canada. Then, in March 2025, Drax's former head of public affairs and policy, Rowaa Ahmar, suggested the company had misled over its sourcing of wood for biomass pellets, which were made as part of a claim for unfair dismissal at an employment tribunal. Drax denied the claims. The two quickly reached a settlement. Weeks earlier, the government confirmed it would extend subsidies for Drax's \"important\" bioenergy, but halve the amount paid and include a windfall mechanism to recoup some of the profits. Calum Andrews, UK power analyst for S&P Global, said the current subsidy arrangements \"incentivise the plant to run at high capacity for most of the year\". But the changes from 2027 should cause a \"significant cut in output (and therefore biomass burning) from the plant, with generation focused on times when the power grid needs it most, e.g. when wind generation is low\". Frankie Mayo, energy analyst at thinktank Ember, said it's \"right that the UK's largest emitter faces additional scrutiny\", given its cost, environmental impact and dependence on wood product imports."
    },
    {
        "title": "Nvidia: Tech bubble seems safe so long as AI demand remains high",
        "description": "For all the trillions being spent in the pursuit of artificial intelligence (AI) it still cannot answer the existential question: is AI a truly transformative technology, akin to the railways, or a bubble about to burst, taking global markets with it?",
        "url": "https://news.sky.com/story/nvidia-tech-bubble-seems-safe-so-long-as-ai-demand-remains-high-13419880",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-nvidia-software_6585236.jpg?20240619101906",
        "type": "Technology",
        "Author": "Paul Kelso",
        "Date Published": "2025-08-28 10:01:00",
        "Headline": "Sky's Paul Kelso writes that while there are gold rush comparisons to make given Nvidia's meteoric rise, there is a good reason why financial market money is sticking with the AI boom. ",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  For all the trillions being spent in the pursuit of artificial intelligence (AI) it still cannot answer the existential question: is AI a truly transformative technology, akin to the railways, or a bubble about to burst, taking global markets with it? In the absence (for now) of a definitive digitally-generated answer, the performance of chip-maker Nvidia is a good proxy. The world's largest company by value has released quarterly results that give clues to the future, as well as evidence of current performance. Nvidia's growth is fundamentally linked to AI. It made its name developing the graphic processing chips (GPUs) that powered gaming and by 2022 was turning over $9bn. A tidy sum, but soon to be eclipsed as CEO Jenson Huang spotted the potential of his GPUs in the nascent AI technology and threw the entire company behind its development. Money latest: Airline makes plus-sized travellers buy two seats That really was transformational. After ChatGPT provided public proof-of-concept for large language AI models (LLMs) in early 2023, Nvidia took off. Its valuation trebled last year and has risen 35% already this year on the way to a market value of $4.4trn. \n                  TikTok puts hundreds of UK jobs at risk\n                 \n                  AI 'immune system' Phoebe lands backing from Google arm\n                 \n                  Publishers issue warning on AI-created books imitating sports autobiographies\n                 That's double the value of every company in the FTSE100 combined and getting on for 25% larger than total UK GDP. With stratospheric valuations come similarly lofty expectations, however, which helps explain why, despite reporting $46.7bn in second quarter revenue and $26.4bn in profits, both ahead of expectations and up more than 50% year-on-year, markets were initially unimpressed and Nvidia shares dipped 3% in post-close trading. That sentiment may not last, but could be explained by questions over Nvidia's access to Chinese markets, blocked until recently by Donald Trump. Huang has done a deal with the US president to hand over 15% of its revenues from sales to Beijing, but until it is inked, Nvidia is neither booking or forecasting Chinese revenue.  The vibes around AI have also shifted in recent months. A recent report from the Massachusetts Institute of Technology found scant evidence of meaningful returns on AI investment despite huge spending across the corporate landscape. And after OpenAI's ChatGPT-5 launched to lukewarm reviews, its founder Sam Altman, one of the biggest beneficiaries of the hype, wondered out loud whether the market was overheated. Despite the noise, Nvidia believes it has plenty of road left to run, and with good reason. Tech giants Google, Microsoft, Meta and Amazon and many others are all chasing the potential of AI, perhaps uncertain what it might ultimately deliver but desperate to be first to find out. That impetus is driving enormous investment in hardware. More than $41bn of Nvidia's Q2 revenues came from the sale of data centre equipment, and it predicts another $3tn-$4tn will be invested in AI infrastructure by the end of the decade. If anything on that scale is realised, then Nvidia and Jenson Huang will keep winning. Like the railroad pioneers who transported prospectors west during the California gold rush, it matters less that they strike lucky as long as they keep trying."
    },
    {
        "title": "'I'm shocked at how fragile I am still': Cumberbatch and Colman on protecting their sanity from perils of social media",
        "description": "Actor Benedict Cumberbatch says he's shocked at how \"fragile\" he still is - despite years in the spotlight and success in the industry.",
        "url": "https://news.sky.com/story/im-shocked-at-how-fragile-i-am-still-cumberbatch-and-colman-on-protecting-their-sanity-from-perils-of-social-media-13420109",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-colman-cumberbatch_7003853.jpg?20250828181517",
        "type": "Entertainment",
        "Author": "Faye de Silva, news reporter",
        "Date Published": "2025-08-28 23:01:00",
        "Headline": "The pair star in new satirical black comedy The Roses - a remake of the 1989 hit film starring Michael Douglas and Kathleen Turner.",
        "Content": "By Faye de Silva, news reporter  Actor Benedict Cumberbatch says he's shocked at how \"fragile\" he still is - despite years in the spotlight and success in the industry. It might seem like the Doctor Strange star and The Crown actress Olivia Colman have it all when it comes to money and success - but they are also human like the rest of us. The pair lead the cast of new satirical black comedy The Roses, which sees picture-perfect couple Ivy and Theo Rose - a rising star chef and ambitious architect - raise their two children in California, while chasing their own dreams. 'I am shocked at how fragile I am' But behind its dark humour and comic language, the film also looks at the realities of power imbalance, insecurity and wounded pride - in even the strongest of relationships. And 49-year-old Cumberbatch - whose character faces a major setback in his career - tells Sky News that in real life the glare of social media only intensifies those type of situations. \"I am shocked at how fragile I am still. \n                  Benedict Cumberbatch and Gaby Hoffmann on Netflix series Eric\n                 \n                  Benedict Cumberbatch: 'I want to give them stability' - British actor says Ukrainian family will stay in his home\n                 \n                  Oscars red carpet fashion 2022: The best looks from the Academy Awards\n                 \"I don't go anywhere near it [social media] because of that. \"It's like walking into a place where people want to marry you or kill you. Those extremes. \"I think we will get to a stage, a corporate culture that's now manifested around it where people are obliged to do that in order to sell their lives, and therefore their brand and what they do for a living.\" Co-star Colman - who's long-shunned the online world - agrees. Read more from Sky News:Taylor Swift announces engagement to Travis Kelce - and reveals huge ringBridgerton creator on 'bizarre' criticism - Watch \"I'm afraid I am very thin-skinned. \"I don't look at any of it. My husband will look at a review and if it's nice he'll show me - but if it's anything mean he knows to just go 'don't look - don't look.' \"You just have to learn to be thicker-skinned. \"But actually, I think we need people who are sensitive and kind.\" 'Don't do it… delete it all' Colman - now 51, and whose leading role in The Favourite bagged her an Academy Award in 2019 - says no amount of experience and success can shield her from criticism. \"My advice to a young'un - sort of dipping their toe into the world of social media for the first time is absolutely don't do it. \"Delete it all. If you want a happy life, don't have any of it. I've never had it.\" The movie - directed by Meet The Parents' Jay Roach with The Favourite screenwriter Tony McNamara - also calls into question the notion of success - asking, is it really possible to have it all? Or is sacrifice inevitable when it comes to spinning the plates of a high-flying career, marriage and parenthood? Cumberbatch admits \"you can't do it all without there being a cost\". \"You just have to weigh up what those balances are,\" he adds. Colman says \"there are I suppose little sacrifices along the way\" - from both sides of a relationship. The comedy drama offers a fresh take on Warren Adler's novel The War Of The Roses - and the 1989 hit film adaptation- starring Michael Douglas and Kathleen Turner. Colman and Cumberbatch - both producers on the film - insist they weren't daunted by that though. \"We wanted to find a project to do together, and we have utter respect for the iconic status of the film and book,\" explains Cumberbatch. \"Hopefully this will have its own place in the culture - it's very different, it's not a remake - it's a reimagined jumping-on point.\" \"But beyond that, it's very different,\" adds Colman. Former Doctor Who Ncuti Gatwa and Barbie's Kate McKinnon also form the cast. The Roses is out in UK cinemas now."
    },
    {
        "title": "Top Boy and Eddington actor Micheal Ward granted bail as he appears in court on rape charges",
        "description": "BAFTA-winning actor Micheal Ward has been granted bail after appearing in court charged with two counts of rape.",
        "url": "https://news.sky.com/story/top-boy-and-eddington-actor-micheal-ward-granted-bail-as-he-appears-in-court-on-rape-charges-13419791",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-michael-ward-actor_7003463.jpg?20250828095133",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-28 07:32:00",
        "Headline": "No subtitle found",
        "Content": "BAFTA-winning actor Micheal Ward has been granted bail after appearing in court charged with two counts of rape. The 27-year-old, who appeared at Thames Magistrates' Court this morning, is also accused of two counts of assault by penetration, and one count of sexual assault. The offences relate to one woman and are reported to have taken place in January 2023. Ward, who starred in the popular British series Top Boy and was awarded BAFTA's rising star honour in 2020, spoke to confirm his name, address and date of birth during a short court hearing. He did not enter any pleas and was granted conditional bail until a further hearing at Snaresbrook Crown Court on 25 September. In a statement issued after the charges were announced last month, Ward denied them \"entirely\" and said he had co-operated with police throughout their investigation. The actor's film credits include Blue Story, The Old Guard and Empire of Light, as well as the current Hollywood Western Eddington. He was also twice nominated for BAFTA's best supporting actor prize. This breaking news story is being updated and more details will be published shortly. Please refresh the page for the latest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    }
]