[
    {
        "title": "Trump to host Zelenskyy today after setting up another meeting with Putin",
        "description": "Donald Trump will host Volodymyr Zelenskyy at the White House today after announcing another meeting with Vladimir Putin, as the US president seeks to end the war in Ukraine.",
        "url": "https://news.sky.com/story/trump-says-hell-meet-putin-in-hungary-for-ukraine-talks-after-productive-call-13451362",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-zelenskyy-putin_7052858.jpg?20251017012300",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-16 19:56:00",
        "Headline": "Ukraine's president arrived in Washington in the hope of getting the right to use powerful missiles that could strike deep into Russia, but a surprise call between Donald Trump and Vladimir Putin may have changed things.",
        "Content": " Donald Trump will host Volodymyr Zelenskyy at the White House today after announcing another meeting with Vladimir Putin, as the US president seeks to end the war in Ukraine. Mr Zelenskyy arrived in Washington on Thursday, and is hoping to persuade his American counterpart to allow his forces use of long-range Tomahawk missiles - which could feasibly reach Moscow. The Kremlin has been warning against such a move, and Mr Zelenskyy suggested Mr Putin was \"rushing to resume dialogue\" because of the possibility after a surprise call with Mr Trump. Read more:Has missile threat brought Putin back to table? Another Trump-Putin summit will take place in Hungary, Mr Trump revealed after his call with the Russian on Thursday, though he did not confirm a date. It would be the first known trip to an EU country by Mr Putin since the war began in February 2022. Unlike most of the bloc, Budapest - under Viktor Orban - has maintained cordial ties with Moscow and questioned support for Kyiv. The last Trump-Putin meeting, in August for a peace summit in Alaska, came and went without any sign of a ceasefire, with Russian bombardments of Ukraine continuing. Mr Trump has appeared increasingly irritated with Russia in recent weeks, and has even gone so far as to propose Ukraine could take back all the land it has lost. Even so, he described his latest call with Mr Putin - apparently made at Moscow's request - as \"extremely frank and trustful\" and \"very productive\". Secretary of State Marco Rubio will lead a US delegation for talks with Russian officials next week. Read more:Putin's outreach seeks to temper support for Ukraine  Trump hopeful of another peace deal Sky News US correspondent David Blevins said Mr Trump was looking to use the momentum from brokering a ceasefire between Israel and Hamas in Gaza to accelerate his efforts regarding Ukraine. Before coming to office, he repeatedly claimed he'd be able to end the war in a day. Speaking to reporters after his call with Mr Putin, he said: \"My whole life, I've made deals. \"I think we're hopefully going to have this one done, hopefully soon.\"  Putin 'trying to derail momentum' Mr Zelenskyy and his European allies, including Britain's Sir Keir Starmer, have repeatedly warned Mr Putin is not serious about peace. Former US state department official Dan Fried said the Russian president was again \"trying to derail the momentum toward greater pressure on Russia\". Mr Trump already appears to be looking forward to potential trade deals he could strike with Russia after the war, saying the two leaders \"spent a great deal of time\" talking about it during their latest call. He also said Mr Putin had congratulated him on brokering the Israel-Hamas deal, and praised his wife, Melania, for efforts she's made to reunite displaced Ukrainian children with their families.  Why are Trump and Putin meeting in Budapest? According to the Kremlin, Mr Trump suggested Budapest as the location for face-to-face talks with Mr Putin, who immediately agreed to the plan. Hungarian Prime Minister Mr Orban, a critic of EU sanctions on Moscow, welcomed the news enthusiastically, calling Hungary an \"island of peace\" and confirming preparations after speaking with Mr Trump. Budapest was among the shortlisted sites for the last summit between Mr Trump and Mr Putin in Alaska. It also holds historical significance. In 1994, Ukraine surrendered the world's third-largest nuclear arsenal in exchange for security guarantees through the Budapest Memorandum. Signed by Russia, the US, and the UK, the agreement promised to protect Ukraine's sovereignty. It was ultimately broken when Russia annexed Crimea in 2014 and launched a full-scale invasion in 2022.  What happened in Alaska? Mr Trump met Mr Putin on US soil on 15 August for a summit which the US leader hoped would help convince the Russian president to enter peace talks to end the Ukraine war. There were hopes after the call that a trilateral summit could be scheduled that would include Mr Zelenskyy.  Mr Putin spoke to Mr Trump again days after the summit when European leaders, including Mr Zelenskyy, were at the White House. There's been no public confirmation from the White House or the Kremlin that any communication has taken place between the two since then, in which time Mr Trump has taken a tougher line towards Moscow."
    },
    {
        "title": "MI5 boss says China plot disrupted in past week - amid rise in state-sponsored threats",
        "description": "The head of MI5 says he will \"never back off\" from confronting threats from China as he revealed his officers disrupted a case linked to Beijing in just the past week.",
        "url": "https://news.sky.com/story/mi5-boss-says-he-will-never-back-off-from-china-threat-as-beijing-plot-disrupted-in-last-week-13451068",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ken-mccallum-mi5-director-general_7052401.jpg?20251016131413",
        "type": "Home",
        "Author": "Deborah Haynes",
        "Date Published": "2025-10-16 10:44:00",
        "Headline": "Sir Ken admits he's \"frustrated when opportunities to prosecute national security threatening activity are not followed\" - as a row escalates over the scrapping of a case against two Britons. ",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  The head of MI5 says he will \"never back off\" from confronting threats from China as he revealed his officers disrupted a case linked to Beijing in just the past week. More broadly, Sir Ken McCallum said the number of people in the UK under investigation for \"state threat activity\" - also including from Russia and Iran - has jumped by 35% in the past year compared with the previous 12 months. He admitted he felt frustration at the collapse last month of a trial against two British men accused of spying for China, but he stressed that the Security Service had still successfully derailed the alleged espionage operation. With pressure mounting on Sir Keir Starmer over why the high-profile trial foundered, the director general of MI5 - choosing his words carefully given the controversy - confirmed that \"Chinese state actors\" pose a threat to UK national security \"every day\". Politics latest: Senior MPs launch 'formal inquiry' into China spy case collapse He also warned that the wider threat from nation states is escalating and becoming as ugly as terrorism. He used an annual speech at MI5's headquarters in London to say: \n                  Everything we know about China's new 'super embassy'\n                 \n                  The three key questions about the China spy case that need to be answered\n                 \n                  PM faces 'more unanswered questions' after evidence in China spying case released\n                 • Attempts by states - principally China, Russia and Iran - to carry out operations involving violence, sabotage, arson or surveillance are \"routinely\" being uncovered. • MI5 has tracked more than 20 \"potentially lethal\" plots backed by Iran in the past year. • Russia is hatching a \"steady stream\" of surveillance plots with \"hostile intent\", while MI5 officers take it as a working assumption that Russian trolls will attempt to exploit any particular \"fissures\" in UK society using online posts, though these efforts are largely unsuccessful. • On terrorism, MI5 and the police have disrupted 19 late-stage attack plots since 2020 and have intervened in many hundreds of developing threats. • There is growing concern about children becoming involved in terrorism, with one in five of the 232 terrorism arrests last year involving minors under 17. \"MI5 is contending with more volume and more variety of threat from terrorists and state actors than I've ever seen,\" Sir Ken said. 'Biggest shift' Declaring a \"new era\", the MI5 boss warned of \"fast-rising\" state threats coupled with a \"near record\" number of terrorism investigations. He said this was forcing the biggest shift in MI5's mission since the 11 September 2001 terrorist attacks on the United States. China is a particular challenge as the Starmer government seeks to bolster economic ties with Beijing, while also wary of the security threat posed by Chinese spies.  \"The UK-China relationship is by its nature complex, but MI5's role is not,\" Sir Ken said. \"We detect and deal, robustly, with activity threatening UK national security.\" These threats range from cyber espionage; attempts to steal secrets from universities such as by cultivating academics; or efforts to target parliament and other parts of public life. \"MI5 will keep doing what the public would expect of us, preventing, detecting and disrupting activity of national security concern,\" said the MI5 chief. \"Our track record is strong. We've intervened operationally again just in the last week and we will keep doing so.\" The spy boss continued: \"I am MI5 born and bred. I will never back off from confronting threats to the UK wherever they come.\" The speech was delivered amid a growing row around a decision by the Crown Prosecution Service (CPS) to drop the espionage trial of Christopher Cash, a former parliamentary researcher to two prominent Conservative MPs, and Christopher Berry, a teacher. Both have denied any wrongdoing. Prosecutors said the government had not provided evidence that China represented a threat to national security, prompting allegations by the Conservatives that the prime minister's team had interfered with the case to protect the UK's trading ties with China. Attempting to push back, ministers on Wednesday released written evidence by Matthew Collins, the deputy national security adviser, that was given to the CPS. It spelled out the threat posed by China and his assessment of the allegations against the two individuals. China's UK embassy said Mr Collins' statements contained \"unfounded accusations that are purely fabricated and groundless\". \"We urge the UK to stop making an issue out of China, stop engaging in anti-China hype, and stop undermining China-UK relations,\" a spokesperson said on the embassy's website. MPs will hold a formal inquiry to discuss the China spying case and the issues that have arisen from it. Read more:Spy case witness statements released by governmentThree questions about spy case that need answering  Given the political storm, the MI5 director general was careful when responding to questions on the furore. But he chose to voice his support for Mr Collins who he has worked with, describing him as a \"man of high integrity and a professional of considerable quality\". Sir Ken was asked by journalists if he had been frustrated at the failure to prosecute. \"Of course I am frustrated when opportunities to prosecute national security threatening activity are not followed through for whatever reason,\" he said, though he noted not all cases that involve MI5 lead to prosecution. \"I would remind you all that in the particular case… the activity was disrupted.\" On whether he regarded China to be a threat, the MI5 chief said: \"Do Chinese state actors present a UK national security threat? And the answer is of course yes, they do every day.\" But he added that UK wider bilateral foreign policy on China is a matter for the government. Sky News has approached the Chinese embassy for comment on Sir Ken's comments."
    },
    {
        "title": "Starmer criticises decision to stop Maccabi Tel Aviv fans from attending Aston Villa match",
        "description": "Sir Keir Starmer has criticised a decision to stop Israeli football fans who support Maccabi Tel Aviv from attending their side's Europa League match against Aston Villa in Birmingham after police classified it as a \"high risk\" event.",
        "url": "https://news.sky.com/story/maccabi-tel-aviv-fans-will-not-be-allowed-to-attend-aston-villa-match-amid-safety-concerns-13451240",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-villa-park-aston-villa_7052595.jpg?20251016174315",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-16 16:28:00",
        "Headline": "Police say the decision is based partly on what happened in Amsterdam last year, when Israeli fans attending a match against Ajax were caught up in attacks.",
        "Content": "Sir Keir Starmer has criticised a decision to stop Israeli football fans who support Maccabi Tel Aviv from attending their side's Europa League match against Aston Villa in Birmingham after police classified it as a \"high risk\" event. West Midlands Police (WMP) said the decision not to allow away fans to attend the game next month was taken by a joint safety committee and was based partly on what happened in Amsterdam last year, when Maccabi Tel Aviv supporters attending a game against Ajax were caught up in attacks in the city. Responding to the announcement, the prime minister said: \"This is the wrong decision. \"We will not tolerate antisemitism on our streets. The role of the police is to ensure all football fans can enjoy the game, without fear of violence or intimidation.\" WMP said it had taken into account the \"violent clashes and hate crime offences\" that occurred in the Dutch capital when classifying the event as \"high risk\". Kemi Badenoch, the leader of the opposition, criticised the decision, saying it was a \"national disgrace\". She has challenged Sir Keir to \"guarantee that Jewish fans can walk into any football stadium in this country\". The Tory leader added: \"If not, it sends a horrendous and shameful message: there are parts of Britain where Jews simply cannot go.\" The Jewish Leadership Council, which works to protect British Jews, also slammed the decision. In a post on X, it said it was \"perverse that away fans should be banned from a football match because West Midlands Police can't guarantee their safety\". It added: \"Aston Villa should face the consequences of this decision and the match should be played behind closed doors.\" The Campaign Against Antisemitism said it was \"another alarming sign of how British authorities are failing to ensure that Jews can participate safely and equally in public life\". It added: \"Instead of confronting the antisemitic hatred that has made it unsafe for Israeli fans to attend, the response is to exclude the victims.\" Gideon Sa'ar, Israel's foreign minister, said it was a \"shameful decision\" which should be reversed. But Ayoub Khan, the independent MP for Birmingham Perry Barr, said he welcomed the news that Maccabi Tel Aviv fans would \"not be permitted to watch the match at Aston Villa!\" He added: \"Well done to all those that signed our petition!\" There had been \"so much hostility and uncertainty around the match\" that it was \"only right to take drastic measures\", he said. And he referenced \"latent safety risks\" that law enforcement \"would not be able to fully manage\". The petition, signed by Mr Khan and his fellow MP Jeremy Corbyn, attracted 3,861 signatures. The Palestine Solidarity Campaign, also posting on X, said the match should be cancelled altogether. It accused Israel of committing \"genocide and apartheid\" and said Israeli football teams \"shouldn't play in international tournaments\" while that is allegedly happening. Israel denies it has committed genocide in Gaza and says it is fighting a terrorist organisation - Hamas - which is dedicated to its destruction. Aston Villa said the decision followed safety concerns raised by officers. The local Safety Advisory Group (SAG) said no fans of the Israeli club would be able to attend the match on 6 November, the club added. A SAG is a multi-agency forum coordinated by a local authority. Aston Villa said in a statement: \"Following a meeting this afternoon, the SAG has formally written to the club and UEFA to advise no away fans will be permitted to attend Villa Park for this fixture. \"West Midlands Police have advised the SAG that they have public safety concerns outside the stadium bowl and the ability to deal with any potential protests on the night. \"The club are in continuous dialogue with Maccabi Tel Aviv and the local authorities throughout this ongoing process, with the safety of supporters attending the match and the safety of local residents at the forefront of any decision.\" Read more from Sky News:Starmer orders mandatory antisemitism training for NHS staffMI5 boss says China plot disrupted in past weekMajor milestone in Post Office IT scandal In a statement, West Midlands Police said the upcoming game had been classified as \"high risk\" following a \"thorough assessment\". \"West Midlands Police supports the decision to prohibit away supporters from attending,\" a spokesperson said. \"This decision is based on current intelligence and previous incidents, including violent clashes and hate crime offences that occurred during the 2024 UEFA Europa League match between Ajax and Maccabi Tel Aviv in Amsterdam. \"Based on our professional judgement, we believe this measure will help mitigate risks to public safety. \"We remain steadfast in our support of all affected communities, and reaffirm our zero-tolerance stance on hate crime in all its forms.\" Birmingham City Council said that following a \"multi-agency meeting\" and a \"thorough review\", a \"collective decision was made to restrict away fan attendance\"."
    },
    {
        "title": "Trump's former adviser John Bolton charged amid crackdown on president's critics",
        "description": "Donald Trump's ex-adviser John Bolton has accused the president of attempting to \"intimidate his opponents\" after being criminally indicted on federal charges.",
        "url": "https://news.sky.com/story/donald-trumps-former-adviser-john-bolton-charged-amid-crackdown-on-presidents-critics-13451405",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-bolton_7052818.jpg?20251016221547",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-16 21:09:00",
        "Headline": "John Bolton served under Donald Trump during his first term in office before being fired in 2019. He has since become one of the US president's most vocal critics. ",
        "Content": "Donald Trump's ex-adviser John Bolton has accused the president of attempting to \"intimidate his opponents\" after being criminally indicted on federal charges. Mr Bolton has been charged with illegally storing and transmitting classified information - alleged crimes which could see him face decades behind bars. He has been one of Mr Trump's most vocal critics since being sacked from his first administration in 2019, and described him as being unfit for office ahead of last year's election. He said the charges filed on Thursday were an effort by the president to \"to ensure that he alone determines what is said about his conduct\". \"I look forward to the fight to defend my lawful conduct and to expose his abuse of power,\" he added. Why has Bolton been charged? The FBI searched his Maryland home and Washington office in August for records he may have kept from his time in government, and previously unsealed court filings said agents found multiple documents labelled as \"classified\", \"confidential\", and \"secret\". Some appeared to concern weapons of mass destruction and national \"strategic communication\", they said. Thursday's indictment alleges Bolton retained multiple files - and used personal email and messaging accounts to transmit documents classified as top secret, the US justice department said. He has been charged with eight counts of transmission of national defence information (NDI), as well as 10 counts of unlawful retention of NDI, the department said. Each charge comes with a maximum sentence of 10 years in prison. Mr Bolton and his lawyer have denied any wrongdoing. For four decades, I have devoted my life to America's foreign policy and national security,\" he said. \"I would never compromise those goals.\" Asked by reporters at the White House about Mr Bolton facing charges, Mr Trump said: \"He's a bad guy.\" 👉 Follow Trump100 on your podcast app 👈  It marks the third time in recent weeks the US justice department has secured criminal charges against one of the president's critics. Ex-FBI director James Comey - who was fired by Mr Trump in 2017 - is facing charges of making false statements to Congress and obstruction of Congress, which he denies. Read more:Man dies after being detained in ICE raidCharlie Kirk awarded Presidential Medal of Freedom  New York Attorney General Letitia James, who previously brought a civil fraud case against Trump and his family real estate company, is facing charges of bank fraud and making false statements to a financial institution. She has denied wrongdoing. Bolton served as US ambassador to the UN, as well as White House national security adviser, before being sacked by Mr Trump in 2019."
    },
    {
        "title": "Hamas says it is facing 'enormous difficulties' recovering Israeli hostages' bodies",
        "description": "Hamas has told Sky News that it is committed to every detail of the ceasefire agreement but says it faces \"enormous difficulties\" in recovering the remaining bodies of Israeli hostages.",
        "url": "https://news.sky.com/story/hamas-says-it-is-facing-enormous-difficulties-recovering-israeli-hostages-bodies-13451293",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hostages-hamas-gaza_7052691.jpg?20251016194257",
        "type": "Home",
        "Author": "Adam Parsons",
        "Date Published": "2025-10-16 18:06:00",
        "Headline": "Speaking to Sky News, a spokesperson for the militant group has denied Israel's claim that Hamas is breaching the terms of the ceasefire agreement by deliberately delaying the return of bodies. ",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  Hamas has told Sky News that it is committed to every detail of the ceasefire agreement but says it faces \"enormous difficulties\" in recovering the remaining bodies of Israeli hostages. Hazem Qassem, a Hamas spokesperson based in Gaza, said that recovering and identifying the bodies would require specialist equipment that no longer exists in the enclave and said that some of the hostages had been \"vaporised\" during Israeli military attacks. He also said that the question of disarmament, which has been repeatedly highlighted by both American and Israeli politicians, was \"complex and sensitive\" with a need to avoid an \"extremely dangerous security vacuum\". Gaza latest: Trump issues a warning to Hamas Qassem was interviewed by journalists working for Sky News. International journalists are barred by Israel from entering Gaza independently. The ceasefire deal initiated by Donald Trump mandated that Hamas should return all of the hostages it was holding, both living and dead. So far, all 20 living hostages have been returned to Israel, while the remains of nine hostages have been handed over. That leaves a further 19 dead hostages unaccounted for.  Read more from Sky News:Hamas battles rival militias for control of Gaza Israel has alleged that Hamas is breaching the terms of the agreement by deliberately delaying the return of bodies. Mr Qassem flatly denies this and says it is all but impossible for them to now reach the remains of captives with the equipment they have. He said: \"We need heavy machinery, cranes, and specialised equipment for identifying remains, none of which exist in Gaza. All our heavy equipment was completely destroyed, as were all forensic laboratories. \"Therefore, we need technical teams capable of identifying bodies and dealing with the immense rubble. The mediators understand that.\" He continued: \"There are major difficulties in locating and reaching sites due to the destruction and the change in the geography of the areas. That means it all requires more time and effort. There is a great effort underway and Hamas is working to fully implement the agreement. \"We explained all this to the mediators from the outset, and they understood. We even heard from US President Trump that he acknowledged the difficulty of this issue, saying we showed a genuine intention to return the bodies.\" What has Hamas said on disarmament? Trump has also been vocal about the need for disarmament, another stipulation in the agreement, even if it is vaguely expressed. 👉 Listen to Sky News Daily on your podcast app 👈 Mr Qassem made it clear to our team that, in the minds of Hamas, the subject still requires much more debate. \"We emphasise that there must be no security vacuum, because a vacuum is extremely dangerous,\" he said. \"There must be effort toward reforming administrative structures to prevent such a void. \"The issue of weapons is complex and sensitive, requiring national consensus and political approaches to solve this dilemma. We must avoid being trapped by the term 'disarmament' but instead find nationally agreed approaches to deal with the weapons issue.\" Read more:Renewed appeal for donations to Gaza charitiesCall for inter-Arab force to stop Hamas retaking GazaWill Trump stay the course over Gaza? He claimed prisoners returned by Israel showed signs of torture, claiming there were \"descriptions and testimonies that are too gruesome to mention in the media\" and demanded \"immediate accountability\". Israel has denied the mistreatment of prisoners, saying they are offered medical treatment while in detention.  Hamas comments on execution videos Qassem also alleged that Israel was stoking violence in Gaza by supporting armed militias, who he accused of \"high treason - the most severe charge in Palestinian revolutionary law\". Sky News recently reported on links between Israel and the Abu Shabab rebel group, which is based in Gaza but opposes Hamas. Our team asked Qassem about images widely spread on social media that appeared to show people being executed on the street.  Qassem claimed the clashes were a result of action taken by government security forces, and not Hamas itself, but said that some people had been \"turned in\" after accusations that they had colluded with Israel. \"The most important point we stress is that these chaotic incidents must be decisively contained. The security forces are carrying out their lawful duty to impose order and prevent anarchy, holding offenders accountable.\""
    },
    {
        "title": "Sam Fender wins 2025 Mercury Prize for album People Watching",
        "description": "Sam Fender has won the 2025 Mercury Prize for his album People Watching.",
        "url": "https://news.sky.com/story/sam-fender-wins-2025-mercury-prize-for-album-people-watching-13451398",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sam-fender-sam-fender-performs_7052821.jpg?20251016222041",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-16 21:03:00",
        "Headline": "Celebrating excellence in British and Irish music, the prestigious award highlights outstanding albums, with Sam Fender previously nominated in 2022.",
        "Content": "Sam Fender has won the 2025 Mercury Prize for his album People Watching. The announcement was made during the award ceremony in Newcastle on Thursday night, marking the event's debut outside of London. Jubilant crowds cheered hometown hero Sam Fender, from North Shields, who triumphed over competitors including Britpop legends Pulp, Irish artist CMAT, and post-punk group Fontaines DC. DJ Lauren Laverne hosted the event, while judge Sian Eleri announced the 31-year-old's win at the Utilita Arena, following performances by several nominees, including FKA Twigs and Martin Carthy. Judge Eleri said: \"After much hard discussion, we decided on one album that stood out for its cohesion, character, and ambition. \"It felt like a classic album, one that will take pride of place in record collections for years to come.\" Accepting the award, Fender expressed gratitude to the other nominees, saying, \"we're in great company\". \n                  The Brit Awards and Mercury Prize are moving outside London for the first time - but what does the shift mean for the UK music industry?\n                 \n                  Sam Fender, Pulp, CMAT and Wolf Alice among Mercury Prize nominees for 2025 - as full shortlist revealed\n                 \n                  Dynamic ticket pricing questioned by Mercury Prize stars: 'Where's the money going?'\n                 He dedicated the prize to his late friend and mentor, Annie Orwin, who inspired the album's title track. \"I want to just say thank you because I never did to the person, the song that People Watching is about,\" Fender said, becoming emotional. \"I want to dedicate it to Annie Orwin who's up there. \"That's all I've got thank you, and I love, this region is the best region in the country.\" Among other nominated artists were Pulp, Wolf Alice, FKA Twigs, PinkPantheress, Pa Salieu, Emma-Jean Thackray, Jacob Alon, Joe Webb and Martin Carthy. If Wolf Alice or Pulp had won the prize, they would have become only the second artist to have won the award twice after PJ Harvey, who won it with Stories From The City in 2001 and Let England Shake in 2011. Pulp won the prize in 1996 with their album Different Class, while Wolf Alice won with Visions Of A Life in 2018. Established in 1992, the award honours the best album released by a British or Irish artist each year. Last year, the indie quartet English Teacher took home the prize for their debut album This Could Be Texas. Fender had been nominated before in 2022 for his album Seventeen Going Under."
    },
    {
        "title": "Starmer orders mandatory antisemitism training for NHS staff",
        "description": "The prime minister has ordered a review of antisemitism in the NHS, saying there are too many cases \"simply not being dealt with\".",
        "url": "https://news.sky.com/story/starmer-orders-mandatory-antisemitism-training-for-nhs-staff-13451250",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-strmer-starmer-keir_7052617.jpg?20251016180045",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-16 16:43:00",
        "Headline": "The crackdown will see all 1.5m NHS staff undergo updated antisemitism and anti-racism training, while guidance on staff uniforms will be reviewed. ",
        "Content": "The prime minister has ordered a review of antisemitism in the NHS, saying there are too many cases \"simply not being dealt with\". The review is part of a wider crackdown on antisemitism in the UK, which will also see all 1.5m NHS staff undergo mandatory updated antisemitism and anti-racism training. Meanwhile, NHS England will review guidance on staff uniforms to \"protect freedom of religious expression while ensuring patients feel respected at all times\", the Department of Health and Social Care said. NHS England and other healthcare bodies will also be asked to adopt the International Holocaust Remembrance Alliance's definition of antisemitism. Sir Keir also announced a £10 million boost for security at sites including synagogues and Jewish schools, sharing the news during a visit to the Community Security Trust (CST), which provides protection for Jewish communities in the UK. \"We have heard loud and clear in the last few days and weeks that words are not enough, action is what matters,\" he said. Health correspondent Wes Streeting was furious when Dr Rahmeh Aladwan was cleared by an interim orders tribunal last September. The British-Palestinian doctor was referred to the medical tribunal following a series of social media posts, including one that said Israel was \"humiliated\" by the October 7 attacks. The Medical Practitioners Tribunal Service (MPTS) rejected the complaints against Dr Aladwan and said it believed her views did not present a real risk to patients. It did not impose interim restrictions against the doctor. The General Medical Council (GMC) has now re-referred Dr Aladwan for another interim orders tribunal while it continues its investigation. This is normally done when it believes there is an immediate risk to public protection. It is Dr Aladwan's case that prompted the Health Secretary to demand changes to the law to make it easier to suspend doctors accused of misconduct from practising while they are under investigation. Mr Streeting will hope these new measures introduced today will go some way towards his vision of a \"universal health system that everyone should feel safe approaching if they need care, regardless of race, creed or religion\". Dr Aladwan's next tribunal hearing is scheduled for 23 October.  The NHS review - led by John Mann, the government's independent adviser on antisemitism - is expected to focus on how healthcare regulators tackle antisemitism and other forms of racism. Andrew Gilbert, vice-president of the Board of Deputies of British Jews, has welcomed the review, saying Jewish staff and patients had felt \"let down by the NHS while antisemitism has been allowed to flourish and thrive\".  Sir Keir also said some universities have been \"too slow\" in dealing with cases of antisemitism. He singled out the University of Oxford, which is understood to have suspended a student on Wednesday after he was arrested on suspicion of inciting racial hatred. Read more:Major change to GP appointment bookingsNHS publishes hospital league tables The student is alleged to have chanted for Gaza to \"put the Zios in the ground\" at a protest in London on Saturday. \"That was a slow reaction to the clearest of cases,\" the PM said. Today's announcement comes in the wake of a terrorist attack at a Manchester synagogue that left two men dead, and after new Home Office figures suggested antisemitic hate crime remains near record levels."
    },
    {
        "title": "Early surge in flu cases prompts calls for vaccinations",
        "description": "An early surge in flu cases has prompted health experts to call for vaccinations, with hospital admissions also beginning to rise.",
        "url": "https://news.sky.com/story/early-surge-in-flu-cases-prompts-calls-for-vaccinations-13451287",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-woman-injection-vaccine_6503094.jpg?20240328105134",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-16 17:58:00",
        "Headline": "Health officials warn of rising cases among children and young adults, urging eligible groups to get vaccinated as hospital admissions begin to climb.",
        "Content": "An early surge in flu cases has prompted health experts to call for vaccinations, with hospital admissions also beginning to rise. Although flu levels remain within the normal range and are comparable to those seen in 2022, following the COVID pandemic, data indicates the early surge is largely driven by younger adults and school-aged children. The UK Health Security Agency (UKHSA) is advising eligible groups to get their jab through the NHS, noting that flu cases have risen across all monitored datasets, especially among children. Everyone over 65, pregnant women, and individuals in high-risk groups - such as those with asthma, heart disease, or diabetes - are eligible to receive a free flu jab through the NHS. Parents are also encouraged to complete and return consent forms to schools so their children can be vaccinated. Additionally, parents and carers of 2- to 3-year-olds can schedule vaccination appointments. Data showed that the consultation rate for flu and flu-like illnesses at GP practices has increased to 5.4 per 100,000, up from 4.2 per 100,000 the week before. It also revealed a rise in respiratory syncytial virus (RSV), which can be particularly dangerous for infants and older adults. \n                  MI5 boss says China plot disrupted in past week - amid rise in state-sponsored threats\n                 \n                  Politics latest: Minister delays decision again on new Chinese super-embassy - as senior MP has row with 'patronising' CPS lawyers\n                 \n                  Why thousands of England's poorest children are missing out on free school meals\n                 Read more from Sky News:Major milestone in Post Office IT scandal Government delays Chinese super embassy decision again Dr Conall Watson, consultant epidemiologist at the UKHSA, said \"it is relatively early in the autumn to be seeing these increases and we will be monitoring this closely in the coming weeks\". \"It's absolutely crucial that everyone eligible for a flu vaccine books their appointment - it could make all the difference in avoiding severe illness and hospitalisation,\" Dr Watson said. \"It will also help avoid them passing on flu to those around them, including grandparents and those with long-term health conditions. \"They can usually have the flu vaccine even if they have a cold, which is very common at this time of the year.\" The UKHSA recommends that individuals experiencing flu or COVID symptoms - such as a high temperature, cough, or fatigue - should limit contact with others as much as possible."
    },
    {
        "title": "The first digital ID launches today",
        "description": "From today, digital veteran cards are available for ex-members of the armed services - the first step in the digitisation of almost every form of ID.",
        "url": "https://news.sky.com/story/the-first-digital-id-launches-today-13451263",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-digital-id-card-beefeater_7052658.png?20251016184918",
        "type": "Home",
        "Author": "Tim Baker",
        "Date Published": "2025-10-16 16:55:00",
        "Headline": "Digital veteran ID cards are launching today, and the government wants to digitise passports, driving licences and others by the end of 2027.",
        "Content": "\n          Political reporter\n              @TimJ_B\n  From today, digital veteran cards are available for ex-members of the armed services - the first step in the digitisation of almost every form of ID. No, this isn't the controversial \"mandatory\" right to work checks announced recently - more on that later - but it is part of the same programme for pretty much all forms of government identification to be accessible on your phone by the end of 2027. This will mean passports, driving licences, national insurance cards and many more being virtual instead of - or as well as - being stashed in a shoebox or under socks in a drawer. At an event at the Tower of London - chosen for its millennia-old juxtaposition with the digital revolution - Beefeaters showed off their shiny new cards and joked of using it to get discounted food. There was an occasional tech hiccup here and there with getting the cards downloaded, mostly due to dodgy internet, it seemed, but in general it was all smiles. The minister in charge of the rollout, Ian Murray MP, crowed of the benefits of having documents on your phone and how it will make life easier. \"We all use our smartphones for everyday life,\" he explained. \"So it's about making the relationship with the citizen easier and making their access to government services easier.\" Mr Murray said he is looking forward to the end of \"having to continuously fill out my name, my address, my telephone number\" and instead just scanning his phone.  How will it work? Having all government documents accessible in an Apple or Google Wallet-style app is the end goal, and the solution is being built on similar secure technology that underpins storing payment cards on your phone. The work is being done in house by Government Digital Service, part of the Department of Science, Innovation and Technology, that houses the digitisation expertise in Whitehall. Any mention of digitisation of the personal information raises questions around security, but the government insists its solution is safe with a \"federated\" approach. To use the example of a veteran's ID, this would mean that the original data of who is a veteran, where they served, and all other relevant information would remain with the Ministry of Defence. Once the sign-in and verification with this data has been completed on a phone, this can then be used to prove someone is a veteran, and easily give them access to housing, mental health support, shopping discounts, museum entry and other benefits, the government says. What about other forms of ID? For driving licences, the data would stay with DVLA, passports with the passport office, and national insurance with the Department for Work and Pensions. Those who have worked on the creation of the software say this stops the creation of a single vault of everyone's personal data in one place. In order to get the card on your phone, you would need to use the phone's security - such as a face scan, fingerprint, or pin code. There is even talk that technology like contactless could be used with the government's version of the wallet to tap and verify things like age in an off-licence. The hope from government is that it can speed up tedious paper-based interactions, like house buying, passport control, and the right to work. It is here where the sticking point on this policy plan becomes apparent.  Papers, please? Announcing \"mandatory\" digital ID last month, the prime minister made it clear this was about cracking down on immigration. Straightaway, concerns were raised about why a compulsory digital ID was needed, who would check it, and what for. Polling showed - especially among Tory and Reform voters - an opposition to this policy, when it is these people the immigration battle is being fought over. Tory MP and a stalwart opponent of government overreach David Davis said: \"Digital ID gives the state the unchecked power to digitally strip citizens naked.\" He added: \"Starmer's scheme will be even more risky as ransomware criminals, foreign states and other hackers will attack the strategic weak points in the OneLogin architecture.\" Read more:Do we need digital IDs?The countries where digital ID already exists If the government believes digitising identification is so beneficial, and such a win-win, why does it want to force people to use it rather than see the benefits and choose to use it? Mr Murray said the right to work ID will be mandatory as \"it's mandatory already to be able to prove that you can work in the UK\". He insists it will make the process for employees easier, and also make it easier for the Home Office to see which employers are not making checks - no more photocopying passports and scanning old phone bills. The government is adamant this is the only mandatory use case, with the suggestion even that the digital ID could be deleted once employment is confirmed. 👉Listen to Politics At Sam And Anne's on your podcast app👈 But the flip side is that once this can of worms is opened, this or a future government could change tack and would have the digital infrastructure to do what it wants. But Mr Murray said: \"The principle here is to make the state and the citizen's relationship much easier - and the power of the data in the hands of the citizen.\""
    },
    {
        "title": "The first digital ID launches today",
        "description": "From today, digital veteran cards are available for ex-members of the armed services - the first step in the digitisation of almost every form of ID.",
        "url": "https://news.sky.com/story/the-first-digital-id-launches-today-13451263",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-digital-id-card-beefeater_7052658.png?20251016184918",
        "type": "UK",
        "Author": "Tim Baker",
        "Date Published": "2025-10-16 16:55:00",
        "Headline": "Digital veteran ID cards are launching today, and the government wants to digitise passports, driving licences and others by the end of 2027.",
        "Content": "\n          Political reporter\n              @TimJ_B\n  From today, digital veteran cards are available for ex-members of the armed services - the first step in the digitisation of almost every form of ID. No, this isn't the controversial \"mandatory\" right to work checks announced recently - more on that later - but it is part of the same programme for pretty much all forms of government identification to be accessible on your phone by the end of 2027. This will mean passports, driving licences, national insurance cards and many more being virtual instead of - or as well as - being stashed in a shoebox or under socks in a drawer. At an event at the Tower of London - chosen for its millennia-old juxtaposition with the digital revolution - Beefeaters showed off their shiny new cards and joked of using it to get discounted food. There was an occasional tech hiccup here and there with getting the cards downloaded, mostly due to dodgy internet, it seemed, but in general it was all smiles. The minister in charge of the rollout, Ian Murray MP, crowed of the benefits of having documents on your phone and how it will make life easier. \"We all use our smartphones for everyday life,\" he explained. \"So it's about making the relationship with the citizen easier and making their access to government services easier.\" Mr Murray said he is looking forward to the end of \"having to continuously fill out my name, my address, my telephone number\" and instead just scanning his phone.  How will it work? Having all government documents accessible in an Apple or Google Wallet-style app is the end goal, and the solution is being built on similar secure technology that underpins storing payment cards on your phone. The work is being done in house by Government Digital Service, part of the Department of Science, Innovation and Technology, that houses the digitisation expertise in Whitehall. Any mention of digitisation of the personal information raises questions around security, but the government insists its solution is safe with a \"federated\" approach. To use the example of a veteran's ID, this would mean that the original data of who is a veteran, where they served, and all other relevant information would remain with the Ministry of Defence. Once the sign-in and verification with this data has been completed on a phone, this can then be used to prove someone is a veteran, and easily give them access to housing, mental health support, shopping discounts, museum entry and other benefits, the government says. What about other forms of ID? For driving licences, the data would stay with DVLA, passports with the passport office, and national insurance with the Department for Work and Pensions. Those who have worked on the creation of the software say this stops the creation of a single vault of everyone's personal data in one place. In order to get the card on your phone, you would need to use the phone's security - such as a face scan, fingerprint, or pin code. There is even talk that technology like contactless could be used with the government's version of the wallet to tap and verify things like age in an off-licence. The hope from government is that it can speed up tedious paper-based interactions, like house buying, passport control, and the right to work. It is here where the sticking point on this policy plan becomes apparent.  Papers, please? Announcing \"mandatory\" digital ID last month, the prime minister made it clear this was about cracking down on immigration. Straightaway, concerns were raised about why a compulsory digital ID was needed, who would check it, and what for. Polling showed - especially among Tory and Reform voters - an opposition to this policy, when it is these people the immigration battle is being fought over. Tory MP and a stalwart opponent of government overreach David Davis said: \"Digital ID gives the state the unchecked power to digitally strip citizens naked.\" He added: \"Starmer's scheme will be even more risky as ransomware criminals, foreign states and other hackers will attack the strategic weak points in the OneLogin architecture.\" Read more:Do we need digital IDs?The countries where digital ID already exists If the government believes digitising identification is so beneficial, and such a win-win, why does it want to force people to use it rather than see the benefits and choose to use it? Mr Murray said the right to work ID will be mandatory as \"it's mandatory already to be able to prove that you can work in the UK\". He insists it will make the process for employees easier, and also make it easier for the Home Office to see which employers are not making checks - no more photocopying passports and scanning old phone bills. The government is adamant this is the only mandatory use case, with the suggestion even that the digital ID could be deleted once employment is confirmed. 👉Listen to Politics At Sam And Anne's on your podcast app👈 But the flip side is that once this can of worms is opened, this or a future government could change tack and would have the digital infrastructure to do what it wants. But Mr Murray said: \"The principle here is to make the state and the citizen's relationship much easier - and the power of the data in the hands of the citizen.\""
    },
    {
        "title": "MI5 boss says China plot disrupted in past week - amid rise in state-sponsored threats",
        "description": "The head of MI5 says he will \"never back off\" from confronting threats from China as he revealed his officers disrupted a case linked to Beijing in just the past week.",
        "url": "https://news.sky.com/story/mi5-boss-says-he-will-never-back-off-from-china-threat-as-beijing-plot-disrupted-in-last-week-13451068",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ken-mccallum-mi5-director-general_7052401.jpg?20251016131413",
        "type": "UK",
        "Author": "Deborah Haynes",
        "Date Published": "2025-10-16 10:44:00",
        "Headline": "Sir Ken admits he's \"frustrated when opportunities to prosecute national security threatening activity are not followed\" - as a row escalates over the scrapping of a case against two Britons. ",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  The head of MI5 says he will \"never back off\" from confronting threats from China as he revealed his officers disrupted a case linked to Beijing in just the past week. More broadly, Sir Ken McCallum said the number of people in the UK under investigation for \"state threat activity\" - also including from Russia and Iran - has jumped by 35% in the past year compared with the previous 12 months. He admitted he felt frustration at the collapse last month of a trial against two British men accused of spying for China, but he stressed that the Security Service had still successfully derailed the alleged espionage operation. With pressure mounting on Sir Keir Starmer over why the high-profile trial foundered, the director general of MI5 - choosing his words carefully given the controversy - confirmed that \"Chinese state actors\" pose a threat to UK national security \"every day\". Politics latest: Senior MPs launch 'formal inquiry' into China spy case collapse He also warned that the wider threat from nation states is escalating and becoming as ugly as terrorism. He used an annual speech at MI5's headquarters in London to say: \n                  Everything we know about China's new 'super embassy'\n                 \n                  The three key questions about the China spy case that need to be answered\n                 \n                  PM faces 'more unanswered questions' after evidence in China spying case released\n                 • Attempts by states - principally China, Russia and Iran - to carry out operations involving violence, sabotage, arson or surveillance are \"routinely\" being uncovered. • MI5 has tracked more than 20 \"potentially lethal\" plots backed by Iran in the past year. • Russia is hatching a \"steady stream\" of surveillance plots with \"hostile intent\", while MI5 officers take it as a working assumption that Russian trolls will attempt to exploit any particular \"fissures\" in UK society using online posts, though these efforts are largely unsuccessful. • On terrorism, MI5 and the police have disrupted 19 late-stage attack plots since 2020 and have intervened in many hundreds of developing threats. • There is growing concern about children becoming involved in terrorism, with one in five of the 232 terrorism arrests last year involving minors under 17. \"MI5 is contending with more volume and more variety of threat from terrorists and state actors than I've ever seen,\" Sir Ken said. 'Biggest shift' Declaring a \"new era\", the MI5 boss warned of \"fast-rising\" state threats coupled with a \"near record\" number of terrorism investigations. He said this was forcing the biggest shift in MI5's mission since the 11 September 2001 terrorist attacks on the United States. China is a particular challenge as the Starmer government seeks to bolster economic ties with Beijing, while also wary of the security threat posed by Chinese spies.  \"The UK-China relationship is by its nature complex, but MI5's role is not,\" Sir Ken said. \"We detect and deal, robustly, with activity threatening UK national security.\" These threats range from cyber espionage; attempts to steal secrets from universities such as by cultivating academics; or efforts to target parliament and other parts of public life. \"MI5 will keep doing what the public would expect of us, preventing, detecting and disrupting activity of national security concern,\" said the MI5 chief. \"Our track record is strong. We've intervened operationally again just in the last week and we will keep doing so.\" The spy boss continued: \"I am MI5 born and bred. I will never back off from confronting threats to the UK wherever they come.\" The speech was delivered amid a growing row around a decision by the Crown Prosecution Service (CPS) to drop the espionage trial of Christopher Cash, a former parliamentary researcher to two prominent Conservative MPs, and Christopher Berry, a teacher. Both have denied any wrongdoing. Prosecutors said the government had not provided evidence that China represented a threat to national security, prompting allegations by the Conservatives that the prime minister's team had interfered with the case to protect the UK's trading ties with China. Attempting to push back, ministers on Wednesday released written evidence by Matthew Collins, the deputy national security adviser, that was given to the CPS. It spelled out the threat posed by China and his assessment of the allegations against the two individuals. China's UK embassy said Mr Collins' statements contained \"unfounded accusations that are purely fabricated and groundless\". \"We urge the UK to stop making an issue out of China, stop engaging in anti-China hype, and stop undermining China-UK relations,\" a spokesperson said on the embassy's website. MPs will hold a formal inquiry to discuss the China spying case and the issues that have arisen from it. Read more:Spy case witness statements released by governmentThree questions about spy case that need answering  Given the political storm, the MI5 director general was careful when responding to questions on the furore. But he chose to voice his support for Mr Collins who he has worked with, describing him as a \"man of high integrity and a professional of considerable quality\". Sir Ken was asked by journalists if he had been frustrated at the failure to prosecute. \"Of course I am frustrated when opportunities to prosecute national security threatening activity are not followed through for whatever reason,\" he said, though he noted not all cases that involve MI5 lead to prosecution. \"I would remind you all that in the particular case… the activity was disrupted.\" On whether he regarded China to be a threat, the MI5 chief said: \"Do Chinese state actors present a UK national security threat? And the answer is of course yes, they do every day.\" But he added that UK wider bilateral foreign policy on China is a matter for the government. Sky News has approached the Chinese embassy for comment on Sir Ken's comments."
    },
    {
        "title": "Why thousands of England's poorest children are missing out on free school meals",
        "description": "Thousands of children in England are not receiving free school meals despite meeting the eligibility criteria, a new report has found.",
        "url": "https://news.sky.com/story/why-thousands-of-englands-poorest-children-are-missing-out-on-free-school-meals-13451423",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-royal-high-school-bath_7052847.jpg?20251016233728",
        "type": "UK",
        "Author": "Anjum Peerbacos",
        "Date Published": "2025-10-16 22:15:00",
        "Headline": "The Education Policy Institute is recommending a new national system of auto-enrolment for free school meals and other measures to ensure more eligible children can benefit, as too many who should get them are going without.",
        "Content": "\n          Education reporter\n       Thousands of children in England are not receiving free school meals despite meeting the eligibility criteria, a new report has found. The Education Policy Institute (EPI) says some disadvantaged families struggle to register for them due to the stigma, which makes some parents and carers reluctant to apply, alongside a lack of digital access and IT skills. Language barriers for those with English as an additional language can also provide challenges in accessing free school meals. Dr Tammy Campbell, co-director for early childhood and wellbeing at the EPI, told Sky News there are \"tens of thousands that are eligible for free school meals not receiving them\". The report recommends a new national system of auto-enrolment and other measures to address the issue.  How many children should be getting them? Official figures from January 2025 show almost 2.2 million pupils in England were eligible for free school meals, representing 25.7% of all state-funded pupils. This is an increase of 77,700 pupils since January 2024. Eligibility rates are highest in the North East (32.3%) and lowest in the South East (20.6%) and East of England (20.7%). The most recent government statistics for the UK as a whole show a record 4.5 million children living in poverty. And why aren't they? The EPI report says the current low-income threshold makes free school meals less meaningful as a measure of disadvantage. To be eligible for free school meals, a household's income must be less than £7,400 a year after tax and not including any benefits. David Huntingford, headteacher at William Ford Junior School in Dagenham, east London, told Sky News it means \"there are a number of parents who want free school meals and need free school meals, but they cannot qualify for them because they are working\". He said some parents might question whether they are \"better off not working because of the benefits\" they could receive. Other barriers include \"the complexity of the language of the forms\" needed to apply. Read more from Sky News:Poorer SEND children being left behindTrainee teachers offered tax-free perksStarmer expands free school meals  'There are children who are hungry' Mr Huntingford said: \"Because we're a London primary school, every child automatically gets a free school meal. \"But we need to look at the coastal areas, and more rural communities as well. There are children there who are hungry, and they are suffering, and they need that free school meal.\" \"As educators, our concern is making sure that children have food in their bellies, because a hungry child is a child who's going to find it very, very difficult to regulate their behaviour, their emotions. \"They're going to find it extremely difficult to engage in class and in their learning and to make progress as well.\" 'Too many children fall through the cracks' Daniel Kebede, general secretary of the National Education Union, said: \"We know that measuring entitlement to free school meals does not accurately capture which children are growing up in poverty. \"Too many children fall through the cracks, as eligibility criteria have excluded many and registration processes create barriers to access. \"This has the knock-on effect of preventing schools from unlocking the funding they need to support their pupils.\" A Department for Education spokesperson said: \"This government has taken a historic step to tackle the stain of child poverty - offering free school meals to every single child from a household that claims Universal Credit. \"The new entitlement will see over half a million more children able to benefit from a free meal from next school year and lift 100,000 children out of poverty. \"We are also upgrading our eligibility checking service to make it even easier for families to claim free meals and will continue to work closely with the sector as we review wider disadvantage funding.\" The Education Policy Institute collated its data from several major national datasets, including the Department for Education's National Pupil Database (NPD), the Office for National Statistics (ONS), and the Department for Work and Pensions' Households Below Average Income (HBAI) dataset. It also drew on the Millennium Cohort Study and linked education administrative datasets provided through the UK Data Service and UCL Institute of Education's Centre for Longitudinal Studies."
    },
    {
        "title": "Starmer criticises decision to stop Maccabi Tel Aviv fans from attending Aston Villa match",
        "description": "Sir Keir Starmer has criticised a decision to stop Israeli football fans who support Maccabi Tel Aviv from attending their side's Europa League match against Aston Villa in Birmingham after police classified it as a \"high risk\" event.",
        "url": "https://news.sky.com/story/maccabi-tel-aviv-fans-will-not-be-allowed-to-attend-aston-villa-match-amid-safety-concerns-13451240",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-villa-park-aston-villa_7052595.jpg?20251016174315",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-16 16:28:00",
        "Headline": "Police say the decision is based partly on what happened in Amsterdam last year, when Israeli fans attending a match against Ajax were caught up in attacks.",
        "Content": "Sir Keir Starmer has criticised a decision to stop Israeli football fans who support Maccabi Tel Aviv from attending their side's Europa League match against Aston Villa in Birmingham after police classified it as a \"high risk\" event. West Midlands Police (WMP) said the decision not to allow away fans to attend the game next month was taken by a joint safety committee and was based partly on what happened in Amsterdam last year, when Maccabi Tel Aviv supporters attending a game against Ajax were caught up in attacks in the city. Responding to the announcement, the prime minister said: \"This is the wrong decision. \"We will not tolerate antisemitism on our streets. The role of the police is to ensure all football fans can enjoy the game, without fear of violence or intimidation.\" WMP said it had taken into account the \"violent clashes and hate crime offences\" that occurred in the Dutch capital when classifying the event as \"high risk\". Kemi Badenoch, the leader of the opposition, criticised the decision, saying it was a \"national disgrace\". She has challenged Sir Keir to \"guarantee that Jewish fans can walk into any football stadium in this country\". The Tory leader added: \"If not, it sends a horrendous and shameful message: there are parts of Britain where Jews simply cannot go.\" The Jewish Leadership Council, which works to protect British Jews, also slammed the decision. In a post on X, it said it was \"perverse that away fans should be banned from a football match because West Midlands Police can't guarantee their safety\". It added: \"Aston Villa should face the consequences of this decision and the match should be played behind closed doors.\" The Campaign Against Antisemitism said it was \"another alarming sign of how British authorities are failing to ensure that Jews can participate safely and equally in public life\". It added: \"Instead of confronting the antisemitic hatred that has made it unsafe for Israeli fans to attend, the response is to exclude the victims.\" Gideon Sa'ar, Israel's foreign minister, said it was a \"shameful decision\" which should be reversed. But Ayoub Khan, the independent MP for Birmingham Perry Barr, said he welcomed the news that Maccabi Tel Aviv fans would \"not be permitted to watch the match at Aston Villa!\" He added: \"Well done to all those that signed our petition!\" There had been \"so much hostility and uncertainty around the match\" that it was \"only right to take drastic measures\", he said. And he referenced \"latent safety risks\" that law enforcement \"would not be able to fully manage\". The petition, signed by Mr Khan and his fellow MP Jeremy Corbyn, attracted 3,861 signatures. The Palestine Solidarity Campaign, also posting on X, said the match should be cancelled altogether. It accused Israel of committing \"genocide and apartheid\" and said Israeli football teams \"shouldn't play in international tournaments\" while that is allegedly happening. Israel denies it has committed genocide in Gaza and says it is fighting a terrorist organisation - Hamas - which is dedicated to its destruction. Aston Villa said the decision followed safety concerns raised by officers. The local Safety Advisory Group (SAG) said no fans of the Israeli club would be able to attend the match on 6 November, the club added. A SAG is a multi-agency forum coordinated by a local authority. Aston Villa said in a statement: \"Following a meeting this afternoon, the SAG has formally written to the club and UEFA to advise no away fans will be permitted to attend Villa Park for this fixture. \"West Midlands Police have advised the SAG that they have public safety concerns outside the stadium bowl and the ability to deal with any potential protests on the night. \"The club are in continuous dialogue with Maccabi Tel Aviv and the local authorities throughout this ongoing process, with the safety of supporters attending the match and the safety of local residents at the forefront of any decision.\" Read more from Sky News:Starmer orders mandatory antisemitism training for NHS staffMI5 boss says China plot disrupted in past weekMajor milestone in Post Office IT scandal In a statement, West Midlands Police said the upcoming game had been classified as \"high risk\" following a \"thorough assessment\". \"West Midlands Police supports the decision to prohibit away supporters from attending,\" a spokesperson said. \"This decision is based on current intelligence and previous incidents, including violent clashes and hate crime offences that occurred during the 2024 UEFA Europa League match between Ajax and Maccabi Tel Aviv in Amsterdam. \"Based on our professional judgement, we believe this measure will help mitigate risks to public safety. \"We remain steadfast in our support of all affected communities, and reaffirm our zero-tolerance stance on hate crime in all its forms.\" Birmingham City Council said that following a \"multi-agency meeting\" and a \"thorough review\", a \"collective decision was made to restrict away fan attendance\"."
    },
    {
        "title": "Great-grandfather Joginder Singh, killed in collision with road-sweeping vehicle in Leicester, was 'humble' and 'devoted', family says",
        "description": "An 87-year-old great-grandfather, who was killed in a collision with a council road-sweeping vehicle, has been described as a \"devoted\" family man.",
        "url": "https://news.sky.com/story/great-grandfather-joginder-singh-killed-in-collision-with-road-sweeping-vehicle-in-leicester-was-humble-and-devoted-family-says-13451209",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-joginder-singh-leicester_7052541.png?20251016161005",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-16 15:06:00",
        "Headline": "Police are trying to establish the full circumstances surrounding the collision - as family remember his selflessness.",
        "Content": "An 87-year-old great-grandfather, who was killed in a collision with a council road-sweeping vehicle, has been described as a \"devoted\" family man. Joginder Singh was taken to hospital following the collision in a road called Holy Bones in Leicester, and died a few hours later. It happened outside the gurdwara temple he visited daily. Police said they were called to the scene by East Midlands Ambulance Service not long after 2pm on 13 October. Detectives from Leicestershire Police's Serious Collision Investigation Unit said they were trying to establish the \"full circumstances surrounding the collision\". A 63-year-old man has been arrested on suspicion of causing death by careless driving, and has since been released under investigation. Mr Singh's family said he was a \"devoted husband, father, grandfather and great-grandfather, and someone who made an amazing contribution to the Sikh community in Leicester\". They added: \"We are devastated by the loss and extremely shocked by what has happened. \"He was a great person and a devoted member of the gurdwara - someone who selflessly and tirelessly contributed to making a real difference. His death is being felt by so many people.\" Mr Singh was the vice-president and one of the founding members of the Guru Nanak Gurdwara. Read more from Sky News:Government again delays decision on Chinese super embassyFormer West Ham star fined over dangerous dogs Police are appealing for witnesses. Detective Sergeant Mike Steer said: \"The vehicle involved was a Leicester City Council road sweeper. \"We are in contact with colleagues in the council, and they are assisting us with our investigation.\""
    },
    {
        "title": "Man who used 3D printer to make gun parts guilty of terrorism and firearms offences",
        "description": "A man who used a 3D printer to make parts of a gun has been found guilty of terrorism and firearms offences, the Metropolitan Police said.",
        "url": "https://news.sky.com/story/man-who-used-3d-printer-to-make-gun-parts-guilty-of-terrorism-and-firearms-offences-13451332",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-robert-adamski_7052726.jpg?20251016201757",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-16 19:08:00",
        "Headline": "The printer was making part of a semi-automatic rifle when counter-terrorism officers searched Robert Adamski's east London home. ",
        "Content": "A man who used a 3D printer to make parts of a gun has been found guilty of terrorism and firearms offences, the Metropolitan Police said. Counter-terrorism officers found Robert Adamski had printed part of a semi-automatic rifle when they searched his home in Leyton, east London, last summer. The 29-year-old Polish national was also found to have various items relating to extreme right-wing ideology, police said. Analysis of his phone revealed he had shared documents in a Telegram group of which he was an admin. After a two-week trial at Woolwich Crown Court, Adamski was on Thursday found guilty of seven counts, including two counts of possession of a component part of a firearm and four counts of dissemination of terrorist publications. Adamski was arrested and taken into custody on 11 July 2024. Counter-terrorism police searched his home the following day and found the printer making part of the gun, as well as a number of other parts he had printed for the firearm, including storage that could hold 25 cartridges. Counter-terrorism detectives found multiple internet searches for 3D-printed guns and how to make them. \n                  Boy, 17, in critical condition after being shot in Arnos Grove, north London\n                 \n                  Horse that bolted through London retires\n                 \n                  Two teenagers arrested over reports of cyber attack on children's nurseries\n                 A payment for a 3D printer was discovered in his credit history in June 2024. Days later, Adamski saved a guide on how to make the FCG-9 Mk2 firearm using a 3D printer. Read more:Major milestone in Post Office scandalWatch as drones fly above UK prisons  Commander Dominic Murphy, head of Counter Terrorism Policing London, said: \"The device still needed a number of other parts as well as technical know-how to make it viable. However, the intention to make a lethal weapon was clear. \"This proactive counter-terrorism investigation has prevented two potential firearms from falling into the hands of a man who held hateful views towards ethnic minorities in London.\" Officers found no evidence Adamski was planning to target any particular communities or the wider public, he added. Adamski will be sentenced on 28 November."
    },
    {
        "title": "Sam Fender wins 2025 Mercury Prize for album People Watching",
        "description": "Sam Fender has won the 2025 Mercury Prize for his album People Watching.",
        "url": "https://news.sky.com/story/sam-fender-wins-2025-mercury-prize-for-album-people-watching-13451398",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sam-fender-sam-fender-performs_7052821.jpg?20251016222041",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-16 21:03:00",
        "Headline": "Celebrating excellence in British and Irish music, the prestigious award highlights outstanding albums, with Sam Fender previously nominated in 2022.",
        "Content": "Sam Fender has won the 2025 Mercury Prize for his album People Watching. The announcement was made during the award ceremony in Newcastle on Thursday night, marking the event's debut outside of London. Jubilant crowds cheered hometown hero Sam Fender, from North Shields, who triumphed over competitors including Britpop legends Pulp, Irish artist CMAT, and post-punk group Fontaines DC. DJ Lauren Laverne hosted the event, while judge Sian Eleri announced the 31-year-old's win at the Utilita Arena, following performances by several nominees, including FKA Twigs and Martin Carthy. Judge Eleri said: \"After much hard discussion, we decided on one album that stood out for its cohesion, character, and ambition. \"It felt like a classic album, one that will take pride of place in record collections for years to come.\" Accepting the award, Fender expressed gratitude to the other nominees, saying, \"we're in great company\". \n                  The Brit Awards and Mercury Prize are moving outside London for the first time - but what does the shift mean for the UK music industry?\n                 \n                  Sam Fender, Pulp, CMAT and Wolf Alice among Mercury Prize nominees for 2025 - as full shortlist revealed\n                 \n                  Dynamic ticket pricing questioned by Mercury Prize stars: 'Where's the money going?'\n                 He dedicated the prize to his late friend and mentor, Annie Orwin, who inspired the album's title track. \"I want to just say thank you because I never did to the person, the song that People Watching is about,\" Fender said, becoming emotional. \"I want to dedicate it to Annie Orwin who's up there. \"That's all I've got thank you, and I love, this region is the best region in the country.\" Among other nominated artists were Pulp, Wolf Alice, FKA Twigs, PinkPantheress, Pa Salieu, Emma-Jean Thackray, Jacob Alon, Joe Webb and Martin Carthy. If Wolf Alice or Pulp had won the prize, they would have become only the second artist to have won the award twice after PJ Harvey, who won it with Stories From The City in 2001 and Let England Shake in 2011. Pulp won the prize in 1996 with their album Different Class, while Wolf Alice won with Visions Of A Life in 2018. Established in 1992, the award honours the best album released by a British or Irish artist each year. Last year, the indie quartet English Teacher took home the prize for their debut album This Could Be Texas. Fender had been nominated before in 2022 for his album Seventeen Going Under."
    },
    {
        "title": "Government delays Chinese super embassy decision again",
        "description": "The government has again delayed making a decision on whether the Chinese super embassy can go ahead.",
        "url": "https://news.sky.com/story/government-delays-chinese-super-embassy-decision-again-13451183",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-china-embassy_7050654.jpg?20251014113348",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-16 14:17:00",
        "Headline": "There are national security concerns about the 600,000 sq ft proposed embassy on the site of the old Royal Mint near the Tower of London.",
        "Content": "The government has again delayed making a decision on whether the Chinese super embassy can go ahead. New Housing Secretary Steve Reed, who took over from Angela Rayner, was due to approve or deny Beijing's application for a 600,000 sq ft embassy near the Tower of London next Tuesday. However, the decision has been delayed to 10 December, \"given the detailed nature\" of the planning application, and the need to give parties sufficient opportunity to respond\", the prime minister's spokesman confirmed. He added that the new deadline is \"not legally binding\". Politics latest: Senior MP hits back at 'patronising' CPS lawyers The spokesman denied the postponement was politically influenced and said it was \"very much bound by the quasi-judicial\" nature of planning law. The delay comes the day after the government published witness statements it provided to prosecutors in the China spy trial that collapsed, prompting a blame game over whose fault it was that it dropped. A decision had already been delayed from 9 September to 21 October after China submitted plans with large greyed-out sections, which said: \"Redacted for security reasons.\" Explainer: Everything we know about China's new 'super embassy' What are the concerns about the embassy? It has become controversial due to concerns about it being turned into a Chinese spy hub for Europe and the fact highly sensitive financial cables run beneath it to the City of London and Canary Wharf. The decision to delay again was made after the national security strategy committee wrote to Mr Reed on Monday saying that approving the embassy at its proposed site was \"not in the UK's long-term interest\". Committee chairman Matt Western, a Labour MP, said in the letter the location presents \"eavesdropping risks in peacetime and sabotage risks in a crisis\". Read more:MI5 boss says China plot disrupted in past weekThe Chinese exiles with £100k bounties on their headsThree key questions about China spy case Tower Hamlets Council rejected China's initial planning application in 2022 to turn Royal Mint Court, where British coins were minted until 1975, into the largest embassy in Europe over security concerns and opposition from residents. Beijing did not appeal the decision after making it clear it wanted Conservative ministers to give assurances they would back a resubmitted application - but the then-Tory government refused. Eleven days after Labour won the election last July, the application was resubmitted in nearly exactly the same form, and was soon \"called in\" by Ms Rayner for central government to decide.  Conservative shadow housing secretary Sir James Cleverly accused the government of having \"actively sought to silence the warnings\" about the threats to national security from the embassy. \"It is essential the planning review has access to the full unredacted drawings for the Chinese embassy, and that the UK security agencies are able to submit evidence in private, using established processes,\" he said. \"If Keir Starmer had any backbone, he would ensure his government threw out this sinister application - as Ireland and Australia did when faced with similar embassy development proposals from Russia.\" What has China said about the concerns? In August, the Chinese embassy in the UK said the planning and design was \"of high quality\" and the application had \"followed the customary diplomatic practices, as well as necessary protocol and procedures\". The embassy added that it is \"an international obligation of the host country to provide support and facilitation for the construction of diplomatic premises\". And it reminded the UK that London wants to knock down and rebuild the British embassy in Beijing, which is in a very poor condition. In September, a Chinese embassy spokesperson told Sky News that claims the new embassy poses a potential security risk to the UK are \"completely groundless and malicious slander, and we firmly oppose it\". They added: \"Anti-China forces are using security risks as an excuse to interfere with the British government's consideration over this planning application. This is a despicable move that is unpopular and will not succeed.\""
    },
    {
        "title": "Major milestone in Post Office scandal as first Capture conviction referred to Court of Appeal",
        "description": "The first Post Office Capture conviction has now been formally referred to the Court of Appeal, marking a major milestone in the IT scandal.",
        "url": "https://news.sky.com/story/major-milestone-in-post-office-scandal-as-capture-case-referred-to-court-of-appeal-13450966",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-post-office-robinson_6945429.png?20250718201050",
        "type": "UK",
        "Author": "Adele Robinson",
        "Date Published": "2025-10-16 14:40:00",
        "Headline": "An exoneration of one victim may \"speed up\" the handling of others cases, lawyers say. ",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n The first Post Office Capture conviction has now been formally referred to the Court of Appeal, marking a major milestone in the IT scandal. The Criminal Cases Review Commission (CCRC) made the decision to refer the case of sub-postmistress Patricia Owen back in July. Mrs Owen was convicted of theft by a jury in 1998, based on evidence from the faulty IT software Capture.   She was given a suspended prison sentence and fought to clear her name afterwards - but died in 2003. Capture software was used in 2,500 branches between 1992 and 1999. \n                  Post Office scandal compensation shake-up and new redress body revealed\n                 \n                  Post Office Capture IT system conviction referred to Court of Appeal for first time\n                 \n                  Post Office transformation effort gets £118m funding boost\n                  It is the first time a conviction based on Capture - the predecessor to the Horizon system at the centre of the wider Post Office scandal - has reached the Court of Appeal. It comes after Sky News revealed that a damning report into Capture, which could help overturn convictions, had been unearthed after nearly 30 years. An investigation found the Post Office knew about the report at the time and continued to prosecute sub-postmasters based on Capture evidence. Mrs Owen's family submitted an application to the CCRC in January 2024 - her case has now been referred on the grounds that her prosecution was an \"abuse of process\". A 'touchstone case' for victims Lawyers have said that if Mrs Owen is exonerated posthumously in the Court of Appeal, it may \"speed up\" the handling of others. The CCRC is also continuing to investigate more than 30 other \"pre-Horizon\" convictions. CCRC chair, Dame Vera Baird, also told Sky News in the summer it could be a \"touchstone case\" for other victims. Juliet Shardlow, Mrs Owen's daughter, has been fighting to clear her mother's name for years. She told Sky News the family were \"so pleased\" her case had finally been referred. \"This has been a very long journey for us as a family and we can now see the light at the end of the tunnel,\" she said. \"It's just sad that mum isn't here to see it. \"The good news is that once mum's case is heard in the High Court, it will pave the way for all the other Capture victims.\" The Post Office has previously said it is \"determined that past wrongs are put right and continue to support the government's work in this area as well as fully co-operate with the Criminal Cases Review Commission\". A spokesperson added on Thursday evening: \"We continue to fully co-operate with the CCRC by supplying documents and information, where this is available, that has been requested in relation to pre-Horizon convictions. \"Whilst we can’t comment on individual cases, we continue to support the CCRC in dealing with pre-Horizon convictions.\" "
    },
    {
        "title": "Trump to host Zelenskyy today after setting up another meeting with Putin",
        "description": "Donald Trump will host Volodymyr Zelenskyy at the White House today after announcing another meeting with Vladimir Putin, as the US president seeks to end the war in Ukraine.",
        "url": "https://news.sky.com/story/trump-says-hell-meet-putin-in-hungary-for-ukraine-talks-after-productive-call-13451362",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-zelenskyy-putin_7052858.jpg?20251017012300",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-16 19:56:00",
        "Headline": "Ukraine's president arrived in Washington in the hope of getting the right to use powerful missiles that could strike deep into Russia, but a surprise call between Donald Trump and Vladimir Putin may have changed things.",
        "Content": " Donald Trump will host Volodymyr Zelenskyy at the White House today after announcing another meeting with Vladimir Putin, as the US president seeks to end the war in Ukraine. Mr Zelenskyy arrived in Washington on Thursday, and is hoping to persuade his American counterpart to allow his forces use of long-range Tomahawk missiles - which could feasibly reach Moscow. The Kremlin has been warning against such a move, and Mr Zelenskyy suggested Mr Putin was \"rushing to resume dialogue\" because of the possibility after a surprise call with Mr Trump. Read more:Has missile threat brought Putin back to table? Another Trump-Putin summit will take place in Hungary, Mr Trump revealed after his call with the Russian on Thursday, though he did not confirm a date. It would be the first known trip to an EU country by Mr Putin since the war began in February 2022. Unlike most of the bloc, Budapest - under Viktor Orban - has maintained cordial ties with Moscow and questioned support for Kyiv. The last Trump-Putin meeting, in August for a peace summit in Alaska, came and went without any sign of a ceasefire, with Russian bombardments of Ukraine continuing. Mr Trump has appeared increasingly irritated with Russia in recent weeks, and has even gone so far as to propose Ukraine could take back all the land it has lost. Even so, he described his latest call with Mr Putin - apparently made at Moscow's request - as \"extremely frank and trustful\" and \"very productive\". Secretary of State Marco Rubio will lead a US delegation for talks with Russian officials next week. Read more:Putin's outreach seeks to temper support for Ukraine  Trump hopeful of another peace deal Sky News US correspondent David Blevins said Mr Trump was looking to use the momentum from brokering a ceasefire between Israel and Hamas in Gaza to accelerate his efforts regarding Ukraine. Before coming to office, he repeatedly claimed he'd be able to end the war in a day. Speaking to reporters after his call with Mr Putin, he said: \"My whole life, I've made deals. \"I think we're hopefully going to have this one done, hopefully soon.\"  Putin 'trying to derail momentum' Mr Zelenskyy and his European allies, including Britain's Sir Keir Starmer, have repeatedly warned Mr Putin is not serious about peace. Former US state department official Dan Fried said the Russian president was again \"trying to derail the momentum toward greater pressure on Russia\". Mr Trump already appears to be looking forward to potential trade deals he could strike with Russia after the war, saying the two leaders \"spent a great deal of time\" talking about it during their latest call. He also said Mr Putin had congratulated him on brokering the Israel-Hamas deal, and praised his wife, Melania, for efforts she's made to reunite displaced Ukrainian children with their families.  Why are Trump and Putin meeting in Budapest? According to the Kremlin, Mr Trump suggested Budapest as the location for face-to-face talks with Mr Putin, who immediately agreed to the plan. Hungarian Prime Minister Mr Orban, a critic of EU sanctions on Moscow, welcomed the news enthusiastically, calling Hungary an \"island of peace\" and confirming preparations after speaking with Mr Trump. Budapest was among the shortlisted sites for the last summit between Mr Trump and Mr Putin in Alaska. It also holds historical significance. In 1994, Ukraine surrendered the world's third-largest nuclear arsenal in exchange for security guarantees through the Budapest Memorandum. Signed by Russia, the US, and the UK, the agreement promised to protect Ukraine's sovereignty. It was ultimately broken when Russia annexed Crimea in 2014 and launched a full-scale invasion in 2022.  What happened in Alaska? Mr Trump met Mr Putin on US soil on 15 August for a summit which the US leader hoped would help convince the Russian president to enter peace talks to end the Ukraine war. There were hopes after the call that a trilateral summit could be scheduled that would include Mr Zelenskyy.  Mr Putin spoke to Mr Trump again days after the summit when European leaders, including Mr Zelenskyy, were at the White House. There's been no public confirmation from the White House or the Kremlin that any communication has taken place between the two since then, in which time Mr Trump has taken a tougher line towards Moscow."
    },
    {
        "title": "Has threat of Tomahawk missiles for Ukraine forced Putin back to negotiating table?",
        "description": "It feels like a game of diplomatic chess.",
        "url": "https://news.sky.com/story/has-threat-of-tomahawk-missiles-for-ukraine-forced-putin-back-to-negotiating-table-13451345",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-alaska_6992303.jpg?20250816012742",
        "type": "World",
        "Author": "David Blevins",
        "Date Published": "2025-10-16 19:22:00",
        "Headline": "The prospect of Washington providing Kyiv with cruise missiles means something has \"shifted on the board\", writes Sky's David Blevins.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n It feels like a game of diplomatic chess. Just before another meeting with the Ukrainian president at the White House on Friday, Donald Trump telephoned the Russian one. Amid speculation that the US could give Ukraine access to Tomahawk cruise missiles, something has shifted on the board. Ukraine war latest: Trump and Putin agree location to meet again The prospect of more military support for Kyiv may have been the catalyst for Russia's return to the table. High-level officials from Washington and Moscow will meet next week. Mr Trump and Vladimir Putin, who last came face-to-face in Alaska two months ago, will meet again soon in Budapest, Hungary.  Asked if the US president still believes he can get Mr Putin and Volodymyr Zelenskyy together soon, White House press secretary Karoline Leavitt said: \"I think he thinks it's possible, and he would, of course, love to see that happen.\" But there's currently no plan for the Ukrainian leader to join Trump and Putin in Hungary, and that will be a concern for Kyiv and its European allies.  How does call impact Ukraine's Tomahawk request? It's difficult to envisage the US granting Ukraine's request for Tomahawk cruise missiles against the backdrop of these diplomatic manoeuvres.  Read more:Could Tomahawk missiles be a game-changer for Ukraine?Why emboldened Trump has changed his stance on Ukraine Mr Trump had already done a handbrake turn, from telling Mr Zelenksyy \"you don't have the cards\" to suggesting Ukraine could win back all its land. Now he appears to be looking in the rear view mirror, back to the Alaskan summit, where his hopes of brokering a ceasefire were dashed. He's expressing hope that the end of the war in the Middle East could have a knock-on effect in Ukraine - one man on a mission to end two wars."
    },
    {
        "title": "Hamas says it is facing 'enormous difficulties' recovering Israeli hostages' bodies",
        "description": "Hamas has told Sky News that it is committed to every detail of the ceasefire agreement but says it faces \"enormous difficulties\" in recovering the remaining bodies of Israeli hostages.",
        "url": "https://news.sky.com/story/hamas-says-it-is-facing-enormous-difficulties-recovering-israeli-hostages-bodies-13451293",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hostages-hamas-gaza_7052691.jpg?20251016194257",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-10-16 18:06:00",
        "Headline": "Speaking to Sky News, a spokesperson for the militant group has denied Israel's claim that Hamas is breaching the terms of the ceasefire agreement by deliberately delaying the return of bodies. ",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  Hamas has told Sky News that it is committed to every detail of the ceasefire agreement but says it faces \"enormous difficulties\" in recovering the remaining bodies of Israeli hostages. Hazem Qassem, a Hamas spokesperson based in Gaza, said that recovering and identifying the bodies would require specialist equipment that no longer exists in the enclave and said that some of the hostages had been \"vaporised\" during Israeli military attacks. He also said that the question of disarmament, which has been repeatedly highlighted by both American and Israeli politicians, was \"complex and sensitive\" with a need to avoid an \"extremely dangerous security vacuum\". Gaza latest: Trump issues a warning to Hamas Qassem was interviewed by journalists working for Sky News. International journalists are barred by Israel from entering Gaza independently. The ceasefire deal initiated by Donald Trump mandated that Hamas should return all of the hostages it was holding, both living and dead. So far, all 20 living hostages have been returned to Israel, while the remains of nine hostages have been handed over. That leaves a further 19 dead hostages unaccounted for.  Read more from Sky News:Hamas battles rival militias for control of Gaza Israel has alleged that Hamas is breaching the terms of the agreement by deliberately delaying the return of bodies. Mr Qassem flatly denies this and says it is all but impossible for them to now reach the remains of captives with the equipment they have. He said: \"We need heavy machinery, cranes, and specialised equipment for identifying remains, none of which exist in Gaza. All our heavy equipment was completely destroyed, as were all forensic laboratories. \"Therefore, we need technical teams capable of identifying bodies and dealing with the immense rubble. The mediators understand that.\" He continued: \"There are major difficulties in locating and reaching sites due to the destruction and the change in the geography of the areas. That means it all requires more time and effort. There is a great effort underway and Hamas is working to fully implement the agreement. \"We explained all this to the mediators from the outset, and they understood. We even heard from US President Trump that he acknowledged the difficulty of this issue, saying we showed a genuine intention to return the bodies.\" What has Hamas said on disarmament? Trump has also been vocal about the need for disarmament, another stipulation in the agreement, even if it is vaguely expressed. 👉 Listen to Sky News Daily on your podcast app 👈 Mr Qassem made it clear to our team that, in the minds of Hamas, the subject still requires much more debate. \"We emphasise that there must be no security vacuum, because a vacuum is extremely dangerous,\" he said. \"There must be effort toward reforming administrative structures to prevent such a void. \"The issue of weapons is complex and sensitive, requiring national consensus and political approaches to solve this dilemma. We must avoid being trapped by the term 'disarmament' but instead find nationally agreed approaches to deal with the weapons issue.\" Read more:Renewed appeal for donations to Gaza charitiesCall for inter-Arab force to stop Hamas retaking GazaWill Trump stay the course over Gaza? He claimed prisoners returned by Israel showed signs of torture, claiming there were \"descriptions and testimonies that are too gruesome to mention in the media\" and demanded \"immediate accountability\". Israel has denied the mistreatment of prisoners, saying they are offered medical treatment while in detention.  Hamas comments on execution videos Qassem also alleged that Israel was stoking violence in Gaza by supporting armed militias, who he accused of \"high treason - the most severe charge in Palestinian revolutionary law\". Sky News recently reported on links between Israel and the Abu Shabab rebel group, which is based in Gaza but opposes Hamas. Our team asked Qassem about images widely spread on social media that appeared to show people being executed on the street.  Qassem claimed the clashes were a result of action taken by government security forces, and not Hamas itself, but said that some people had been \"turned in\" after accusations that they had colluded with Israel. \"The most important point we stress is that these chaotic incidents must be decisively contained. The security forces are carrying out their lawful duty to impose order and prevent anarchy, holding offenders accountable.\""
    },
    {
        "title": "The Catholic Church needs to do more to help victims of sexual abuse  - Vatican report",
        "description": "The Catholic Church has a \"moral and spiritual obligation\" to do more to help the victims of sexual abuse - and must take tougher action against their abusers, a Vatican report says.",
        "url": "https://news.sky.com/story/the-catholic-church-needs-to-do-more-to-help-victims-of-sexual-abuse-vatican-report-13451064",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-vatican-rome_7052387.jpg?20251016124600",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-16 10:40:00",
        "Headline": "The report from the Vatican's child protection board calls for the Church to take tougher action on abusers, saying victims need reparations and tangible sanctions to heal.",
        "Content": "The Catholic Church has a \"moral and spiritual obligation\" to do more to help the victims of sexual abuse - and must take tougher action against their abusers, a Vatican report says. The highly critical report from the Vatican's child protection board faults Church leaders for not providing information to victims about the handling of their cases. The report calls for the church to take tougher action on abusers, saying victims need reparations and tangible sanctions to heal. \"In many cases ... victims/survivors report that the Church has responded with empty settlements, performative gestures, and a persistent refusal to engage with victims/survivors in good faith,\" the report said. The report also states that financial settlements should be paid to victims of abuse. The new report is the second by the Pontifical Commission for the Protection of Minors, which was founded over a decade ago, with the first annual report only issued last year. The commission states that monetary reparations are needed to help victims recover from the trauma of their abuse, along with \"tangible and commensurate\" sanctions for abusers and their enablers. Compiled with input from dozens of survivors of abuse, the report, issued five months into the papacy of Pope Leo XIV, states that the Church must implement \"concrete measures of reparation\".  \"The Church bears a moral and spiritual obligation to heal the deep wounds inflicted from sexual violence perpetrated, enabled, mishandled, or covered up by anyone holding a position of authority in the Church,\" it states. \"The principles of justice and fraternal charity, to which every Christian is called, require not only an acknowledgement of responsibility, but also the implementation of concrete measures of reparation.\" The report covers 2024, a period before the new pope was elected after Pope Francis passed away on Easter Monday. Pope Leo has acknowledged that the abuse scandal remains a \"crisis\" for the Church - and that victims need more than just financial reparations to heal. The commission was created by Pope Francis in 2014 to advise the church on best practices to prevent abuse. However, it has encountered some resistance as it looks to confront the problem of abuse in the Church, and endorse victim-focused policies. The 2024 report states that the Church's way of handling abuse cases can itself be traumatising for victims. \"We must re-emphasise that the Church's decades-long pattern of mishandling reports, including abandoning, ignoring, shaming, blaming, and stigmatising victims/survivors, perpetuates the trauma as an ongoing harm,\" it states. The commission is referencing the Church's way of dealing with cases according to its in-house code, where the most severe punishment meted out to a serial abuser is dismissal. Read more:Pope Leo's revealing birthday interviewWe must say no to 'war of words' - Pope Leo Victims also have no rights to information about their case other than learning the outcome. The report calls for sanctions that are \"tangible and commensurate with the severity of the crime\" - and also \"clear\" communication of the reasons for a resignation or removal of a priest."
    },
    {
        "title": "Putin's strategic outreach to Trump seeks to temper US support for Ukraine ",
        "description": "As ever with Vladimir Putin, timing is everything.",
        "url": "https://news.sky.com/story/putin8217s-strategic-outreach-to-trump-seeks-to-temper-us-support-for-ukraine160-13451373",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-vladimir-putin-beijing_7009221.jpg?20250902130028",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-10-16 20:25:00",
        "Headline": "Despite warm rhetoric and promises of a summit, Moscow’s tactic of buying time risks undermining real progress on the war.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n As ever with Vladimir Putin, timing is everything. Initiating a phone call with Donald Trump on the eve of Volodymyr Zelenskyy's visit to the White House was no coincidence. The Kremlin is acutely aware of the American president's apparent shift in sympathy towards Ukraine, and it's fearful that, tomorrow, it could translate into Kyiv being given permission to use US Tomahawk missiles. This was a clear attempt to stave off the weapons - which Moscow regards as a dangerous escalation - and bring Donald Trump back around to Russia's way of thinking. Judging by the White House readout of the call, Vladimir Putin appears to have had some success. Instead of threats and castigation, Trump's rhetoric towards Russia is once again warm and fuzzy. He described the call as \"very productive,\" claimed the leaders made \"great progress,\" and crucially, we're told there'll be another summit. \n                  Trump to host Zelenskyy today after setting up another meeting with Putin\n                 \n                  Hamas battles militias for control of Gaza following Israel's withdrawal\n                 \n                  Has threat of Tomahawk missiles for Ukraine forced Putin back to negotiating table?\n                  But does that really count as progress? After the distinct lack of progress that followed Alaska, I expect Ukraine and its European allies will doubt whether Budapest will be any different. There is a chance that Trump could still give Zelenskyy what he wants in terms of firepower at their meeting on Friday, but I doubt it. If he does, Putin would be forced to respond, and Budapest would be bust. The call, and its outcome, follows a similar pattern. Read more from Sky News:Starmer orders mandatory antisemitism training for NHS staffMI5 boss says China plot disrupted in past week Just as Trump seems poised to throw his support behind Ukraine and apply pressure on Russia, in a manner that's more than merely verbal, Putin somehow manages to talk him down and buy more time, despite showing no sign of compromise or making any concrete concessions. There was the demand back in March for a 30-day truce, which Putin countered by offering a ceasefire on strikes targeting energy infrastructure only. In May, Trump tried again, but this time with the threat of joining Europe and imposing massive sanctions. Putin's response - direct talks with Ukraine. And don't forget Trump's 50-day, then 12-day, deadline in the summer for Russia to end the war or face economic fury. That's what triggered the Alaska summit. This feels like history is repeating itself. How does Putin do it? His tactic seems to be the same each time - offer Trump something he can present as a breakthrough, and serve it with lashings of bald-faced flattery. In this case, he congratulated Trump on his \"great accomplishment\" of the Gaza ceasefire; he thanked the First Lady for her intervention on Ukraine's missing children; and he agreed to (or perhaps proposed) another face-to-face photo-op. If Budapest happens, Trump will get what he wants - a TV moment to serve as the latest illustration of his peace-making presidency. But perhaps the bigger prize will be Putin's, who'll be welcomed onto EU soil for the first time since the war began, despite Europe's ongoing sanctions on Russia. You can already see his smile."
    },
    {
        "title": "Ex-British soldiers among those who fathered Kenyan children while at Army base, court rules",
        "description": "A number of men who were stationed at or connected with a British Army base in Kenya have been declared the fathers of Kenyan children by the High Court.",
        "url": "https://news.sky.com/story/ex-british-soldiers-among-those-who-fathered-kenyan-children-while-at-army-base-court-rules-13450980",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-court-royal-courts-of-justice_6915211.jpg?20250513140309",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-16 07:13:00",
        "Headline": "In one case, a teenager who grew up thinking she was an orphan discovered that her father might be in the UK.",
        "Content": "A number of men who were stationed at or connected with a British Army base in Kenya have been declared the fathers of Kenyan children by the High Court. The children, aged from two to their mid-50s, were born near BATUK (British Army Training Unit Kenya) where the only non-black people are British Army personnel and civilians who work there. Lawyers for 11 children had asked the court to order information be given to the government to help identify their fathers. Ten of the men were located and seven accepted they were father to one of the children. Judge Sir Andrew McFarlane has now made \"declaration of parentage\" orders in six of the cases, with the same order set to follow in the seventh case. Lawyer for the children, Rob George KC, told the court not all the men were white and some were dual citizens of the UK and another country. DNA testing confirmed the fathers were not Kenyan, and Mr George added: \"It is likely that they were British Army personnel based at BATUK, or possibly civilians connected with BATUK, at the time of the applicants' conception.\" \n                  Former Kenyan prime minister Raila Odinga dies aged 80\n                 \n                  Agnes Wanjiru: Niece of Kenyan woman 'murdered by British soldier' comes to UK to seek justice\n                 \n                  Doomsday cult leader talked followers into deadly ritual while still in jail, police say\n                 In one case, a teenager who grew up thinking she was an orphan, after her mother died when she was a year old, discovered her father might be in the UK. Testing showed 31% of her DNA was related to England and northwest Europe, with 8% Welsh and 6% Irish. A relative was tracked down in England and told investigators she had a family member who served with the Army in Kenya and was still alive. Mr George told the court the girl was \"missing a fundamental part of her heritage and her identity\" as she never had the ability to find anything out about her father. He said many of the children had also suffered harassment, bullying and discrimination because they are mixed race. Read more from Sky News:Widow who helped husband 'die with dignity' won't face chargesThousands sue Johnson & Johnson in UK over cancer claims A solicitor for the group, James Netto, told the hearing in July they \"spoke of having a real loss in their lives and a real question mark over their own identity as a result of not truly knowing their fathers\". Work is ongoing to confirm the identity of the fathers of four of the original 11 children. Mr George also told the court four new cases - who he said were \"mostly mixed-race\" children - had been identified and \"many more may follow\". Judge Sir Andrew McFarlane told the government to hand over information about the assumed fathers or relatives in the new cases and scheduled another hearing for December."
    },
    {
        "title": "Government delays Chinese super embassy decision again",
        "description": "The government has again delayed making a decision on whether the Chinese super embassy can go ahead.",
        "url": "https://news.sky.com/story/government-delays-chinese-super-embassy-decision-again-13451183",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-china-embassy_7050654.jpg?20251014113348",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-16 14:17:00",
        "Headline": "There are national security concerns about the 600,000 sq ft proposed embassy on the site of the old Royal Mint near the Tower of London.",
        "Content": "The government has again delayed making a decision on whether the Chinese super embassy can go ahead. New Housing Secretary Steve Reed, who took over from Angela Rayner, was due to approve or deny Beijing's application for a 600,000 sq ft embassy near the Tower of London next Tuesday. However, the decision has been delayed to 10 December, \"given the detailed nature\" of the planning application, and the need to give parties sufficient opportunity to respond\", the prime minister's spokesman confirmed. He added that the new deadline is \"not legally binding\". Politics latest: Senior MP hits back at 'patronising' CPS lawyers The spokesman denied the postponement was politically influenced and said it was \"very much bound by the quasi-judicial\" nature of planning law. The delay comes the day after the government published witness statements it provided to prosecutors in the China spy trial that collapsed, prompting a blame game over whose fault it was that it dropped. A decision had already been delayed from 9 September to 21 October after China submitted plans with large greyed-out sections, which said: \"Redacted for security reasons.\" Explainer: Everything we know about China's new 'super embassy' What are the concerns about the embassy? It has become controversial due to concerns about it being turned into a Chinese spy hub for Europe and the fact highly sensitive financial cables run beneath it to the City of London and Canary Wharf. The decision to delay again was made after the national security strategy committee wrote to Mr Reed on Monday saying that approving the embassy at its proposed site was \"not in the UK's long-term interest\". Committee chairman Matt Western, a Labour MP, said in the letter the location presents \"eavesdropping risks in peacetime and sabotage risks in a crisis\". Read more:MI5 boss says China plot disrupted in past weekThe Chinese exiles with £100k bounties on their headsThree key questions about China spy case Tower Hamlets Council rejected China's initial planning application in 2022 to turn Royal Mint Court, where British coins were minted until 1975, into the largest embassy in Europe over security concerns and opposition from residents. Beijing did not appeal the decision after making it clear it wanted Conservative ministers to give assurances they would back a resubmitted application - but the then-Tory government refused. Eleven days after Labour won the election last July, the application was resubmitted in nearly exactly the same form, and was soon \"called in\" by Ms Rayner for central government to decide.  Conservative shadow housing secretary Sir James Cleverly accused the government of having \"actively sought to silence the warnings\" about the threats to national security from the embassy. \"It is essential the planning review has access to the full unredacted drawings for the Chinese embassy, and that the UK security agencies are able to submit evidence in private, using established processes,\" he said. \"If Keir Starmer had any backbone, he would ensure his government threw out this sinister application - as Ireland and Australia did when faced with similar embassy development proposals from Russia.\" What has China said about the concerns? In August, the Chinese embassy in the UK said the planning and design was \"of high quality\" and the application had \"followed the customary diplomatic practices, as well as necessary protocol and procedures\". The embassy added that it is \"an international obligation of the host country to provide support and facilitation for the construction of diplomatic premises\". And it reminded the UK that London wants to knock down and rebuild the British embassy in Beijing, which is in a very poor condition. In September, a Chinese embassy spokesperson told Sky News that claims the new embassy poses a potential security risk to the UK are \"completely groundless and malicious slander, and we firmly oppose it\". They added: \"Anti-China forces are using security risks as an excuse to interfere with the British government's consideration over this planning application. This is a despicable move that is unpopular and will not succeed.\""
    },
    {
        "title": "Trump's former adviser John Bolton charged amid crackdown on president's critics",
        "description": "Donald Trump's ex-adviser John Bolton has accused the president of attempting to \"intimidate his opponents\" after being criminally indicted on federal charges.",
        "url": "https://news.sky.com/story/donald-trumps-former-adviser-john-bolton-charged-amid-crackdown-on-presidents-critics-13451405",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-bolton_7052818.jpg?20251016221547",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-16 21:09:00",
        "Headline": "John Bolton served under Donald Trump during his first term in office before being fired in 2019. He has since become one of the US president's most vocal critics. ",
        "Content": "Donald Trump's ex-adviser John Bolton has accused the president of attempting to \"intimidate his opponents\" after being criminally indicted on federal charges. Mr Bolton has been charged with illegally storing and transmitting classified information - alleged crimes which could see him face decades behind bars. He has been one of Mr Trump's most vocal critics since being sacked from his first administration in 2019, and described him as being unfit for office ahead of last year's election. He said the charges filed on Thursday were an effort by the president to \"to ensure that he alone determines what is said about his conduct\". \"I look forward to the fight to defend my lawful conduct and to expose his abuse of power,\" he added. Why has Bolton been charged? The FBI searched his Maryland home and Washington office in August for records he may have kept from his time in government, and previously unsealed court filings said agents found multiple documents labelled as \"classified\", \"confidential\", and \"secret\". Some appeared to concern weapons of mass destruction and national \"strategic communication\", they said. Thursday's indictment alleges Bolton retained multiple files - and used personal email and messaging accounts to transmit documents classified as top secret, the US justice department said. He has been charged with eight counts of transmission of national defence information (NDI), as well as 10 counts of unlawful retention of NDI, the department said. Each charge comes with a maximum sentence of 10 years in prison. Mr Bolton and his lawyer have denied any wrongdoing. For four decades, I have devoted my life to America's foreign policy and national security,\" he said. \"I would never compromise those goals.\" Asked by reporters at the White House about Mr Bolton facing charges, Mr Trump said: \"He's a bad guy.\" 👉 Follow Trump100 on your podcast app 👈  It marks the third time in recent weeks the US justice department has secured criminal charges against one of the president's critics. Ex-FBI director James Comey - who was fired by Mr Trump in 2017 - is facing charges of making false statements to Congress and obstruction of Congress, which he denies. Read more:Man dies after being detained in ICE raidCharlie Kirk awarded Presidential Medal of Freedom  New York Attorney General Letitia James, who previously brought a civil fraud case against Trump and his family real estate company, is facing charges of bank fraud and making false statements to a financial institution. She has denied wrongdoing. Bolton served as US ambassador to the UN, as well as White House national security adviser, before being sacked by Mr Trump in 2019."
    },
    {
        "title": "Trump to host Zelenskyy today after setting up another meeting with Putin",
        "description": "Donald Trump will host Volodymyr Zelenskyy at the White House today after announcing another meeting with Vladimir Putin, as the US president seeks to end the war in Ukraine.",
        "url": "https://news.sky.com/story/trump-says-hell-meet-putin-in-hungary-for-ukraine-talks-after-productive-call-13451362",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-zelenskyy-putin_7052858.jpg?20251017012300",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-16 19:56:00",
        "Headline": "Ukraine's president arrived in Washington in the hope of getting the right to use powerful missiles that could strike deep into Russia, but a surprise call between Donald Trump and Vladimir Putin may have changed things.",
        "Content": " Donald Trump will host Volodymyr Zelenskyy at the White House today after announcing another meeting with Vladimir Putin, as the US president seeks to end the war in Ukraine. Mr Zelenskyy arrived in Washington on Thursday, and is hoping to persuade his American counterpart to allow his forces use of long-range Tomahawk missiles - which could feasibly reach Moscow. The Kremlin has been warning against such a move, and Mr Zelenskyy suggested Mr Putin was \"rushing to resume dialogue\" because of the possibility after a surprise call with Mr Trump. Read more:Has missile threat brought Putin back to table? Another Trump-Putin summit will take place in Hungary, Mr Trump revealed after his call with the Russian on Thursday, though he did not confirm a date. It would be the first known trip to an EU country by Mr Putin since the war began in February 2022. Unlike most of the bloc, Budapest - under Viktor Orban - has maintained cordial ties with Moscow and questioned support for Kyiv. The last Trump-Putin meeting, in August for a peace summit in Alaska, came and went without any sign of a ceasefire, with Russian bombardments of Ukraine continuing. Mr Trump has appeared increasingly irritated with Russia in recent weeks, and has even gone so far as to propose Ukraine could take back all the land it has lost. Even so, he described his latest call with Mr Putin - apparently made at Moscow's request - as \"extremely frank and trustful\" and \"very productive\". Secretary of State Marco Rubio will lead a US delegation for talks with Russian officials next week. Read more:Putin's outreach seeks to temper support for Ukraine  Trump hopeful of another peace deal Sky News US correspondent David Blevins said Mr Trump was looking to use the momentum from brokering a ceasefire between Israel and Hamas in Gaza to accelerate his efforts regarding Ukraine. Before coming to office, he repeatedly claimed he'd be able to end the war in a day. Speaking to reporters after his call with Mr Putin, he said: \"My whole life, I've made deals. \"I think we're hopefully going to have this one done, hopefully soon.\"  Putin 'trying to derail momentum' Mr Zelenskyy and his European allies, including Britain's Sir Keir Starmer, have repeatedly warned Mr Putin is not serious about peace. Former US state department official Dan Fried said the Russian president was again \"trying to derail the momentum toward greater pressure on Russia\". Mr Trump already appears to be looking forward to potential trade deals he could strike with Russia after the war, saying the two leaders \"spent a great deal of time\" talking about it during their latest call. He also said Mr Putin had congratulated him on brokering the Israel-Hamas deal, and praised his wife, Melania, for efforts she's made to reunite displaced Ukrainian children with their families.  Why are Trump and Putin meeting in Budapest? According to the Kremlin, Mr Trump suggested Budapest as the location for face-to-face talks with Mr Putin, who immediately agreed to the plan. Hungarian Prime Minister Mr Orban, a critic of EU sanctions on Moscow, welcomed the news enthusiastically, calling Hungary an \"island of peace\" and confirming preparations after speaking with Mr Trump. Budapest was among the shortlisted sites for the last summit between Mr Trump and Mr Putin in Alaska. It also holds historical significance. In 1994, Ukraine surrendered the world's third-largest nuclear arsenal in exchange for security guarantees through the Budapest Memorandum. Signed by Russia, the US, and the UK, the agreement promised to protect Ukraine's sovereignty. It was ultimately broken when Russia annexed Crimea in 2014 and launched a full-scale invasion in 2022.  What happened in Alaska? Mr Trump met Mr Putin on US soil on 15 August for a summit which the US leader hoped would help convince the Russian president to enter peace talks to end the Ukraine war. There were hopes after the call that a trilateral summit could be scheduled that would include Mr Zelenskyy.  Mr Putin spoke to Mr Trump again days after the summit when European leaders, including Mr Zelenskyy, were at the White House. There's been no public confirmation from the White House or the Kremlin that any communication has taken place between the two since then, in which time Mr Trump has taken a tougher line towards Moscow."
    },
    {
        "title": "Man who moved to US aged four dies after being detained in immigration raid",
        "description": "A 39-year-old man died in hospital alone, miles from his family, after being detained by US immigration officials.",
        "url": "https://news.sky.com/story/man-who-moved-to-us-aged-four-dies-after-being-detained-in-immigration-raid-13450941",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kelner-ice_7052121.jpg?20251016045454",
        "type": "US",
        "Author": "Martha Kelner",
        "Date Published": "2025-10-16 03:42:00",
        "Headline": "Ismael Ayala-Uribe, 39, is one of at least 15 people who have died in immigration detention since Donald Trump returned to office. Sky's Martha Kelner meets his grieving mother and brother.",
        "Content": "\n          US correspondent\n              @marthakelner\n  A 39-year-old man died in hospital alone, miles from his family, after being detained by US immigration officials. Ismael Ayala-Uribe, who had lived in the US since he was four, fell ill while in an immigration detention centre in California. He complained of a fever and had a persistent cough in the weeks before he died, according to his mother Lucia. She said he was initially treated by medical staff inside the detention centre but was returned to his cell. He was eventually taken to hospital for a scheduled surgery to remove an abscess on his buttocks, but died before he was able to have the operation. His family were never told he was in hospital, learning of his death via a knock on the door from police. \"They're the ones that notified us that he had passed,\" his brother, Jose Ayala, told Sky News. \"We were not even aware that he was in the hospital or even had a scheduled surgery. Then we got a knock on our door a little after 5.30 one morning. \"I believe he would still be alive today if he was never detained. He got sick while in detention, and they did not seem to take care of him.\" Why was he detained? Mr Ayala-Uribe's death raises questions about the conditions inside the centre he was held in, and if a sudden surge of immigrants being detained by this administration has left the system stretched beyond breaking point. He had moved to the US from Mexico with his family as a child. He did have DACA - deferred action for childhood arrivals - status, granted to those who have arrived while under the age of 18. But this was removed in 2016, after he was convicted of drink-driving. In August, he was arrested by immigration agents at a car wash in California where he had worked for 15 years. He was held for five weeks at Adelanto, a privately owned, run-for-profit, immigrant detention centre. A lawyer for his family said he was, as far as they are aware, a healthy man before he was detained and had no medical need. But Mr Ayala-Uribe's mother, who was visiting him every eight days and speaking to him on the phone a couple of times a day, said she noticed him getting progressively unwell. \"He started with lots of fever,\" Ms Ayala said. \"He said they weren't listening to him. The last time I saw him his face was drained, he told me he was not OK, he told me he couldn't take it any more.\" Beginning to cry, wiping away tears, she added: \"I feel powerless that I couldn't do anything to help my son. \"I never imagined I was going to bury one of my sons. It feels terrible, they took a piece of my heart away. \"I would like something to change. If we cannot save him, at least we can save others that are still inside.\"  ICE defends detention treatment The cause of Mr Ayala-Uribe's death is still under investigation. Sky News requested comment from the company which owns the detention centre where he was held, and they deferred to ICE, the US immigration and customs enforcement agency. In a statement, ICE said: \"Comprehensive medical care is provided from the moment individuals arrive and throughout the entirety of their stay. \"At no time during detention is a detained illegal alien denied emergency care.\" The Trump administration says it's targeting criminals and people in the US illegally. But campaigners say Mr Ayala-Uribe's death should not be viewed in isolation. Since Donald Trump took office, at least 15 people have died in immigration detention. Democrat senators Jon Ossoff and Raphael Warnock wrote a letter to the homeland security secretary, Kristi Noem, asking for more information about these deaths. The senators claimed 10 people had died between January and June, and that it was the highest rate in the first six months of any year publicly available. Sarah Houston, a lawyer for the Immigrant Defenders Law Centre, claims immigrants are being mistreated in custody. Read more from Sky News:The people fighting back against ICE raidsWhy US capital feels like it's reaching tipping point  \"This administration's main goal is to harm, to torture individuals and to try to force them out,\" she said. \"The great increase we see in human rights abuses, in deaths, is a direct result of the administration's decision to pack these detention centres as much as they can.\" Mr Ayala-Uribe's funeral was held this week. Dozens of extended family and friends wore t-shirts bearing his face. A mariachi band played as his casket was lowered into the ground and his mother heaved with sobs. As they absorb their loss, the effort to carry out the biggest mass deportation operation in US history continues."
    },
    {
        "title": "DNA from smoothie straw leads to murder charge against Richard Bilodeau, 41 years after Theresa Fusco's death",
        "description": "A man in the US has been charged with murder after samples taken from a drinking straw were linked to DNA found on the body of a teenage girl more than 40 years ago.&#160;",
        "url": "https://news.sky.com/story/dna-from-smoothie-straw-leads-to-murder-charge-against-richard-bilodeau-41-years-after-theresa-fuscos-death-13451075",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-richard-bilodeau-nassau-county-da_7052338.jpg?20251016121008",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-16 11:04:00",
        "Headline": "The suspect could be jailed for life, if convicted of murdering the 16-year-old, whose remains were found near the roller-skating rink where she worked.",
        "Content": "A man in the US has been charged with murder after samples taken from a drinking straw were linked to DNA found on the body of a teenage girl more than 40 years ago.  Richard Bilodeau, 63, of Center Moriches, Long Island, is accused of murdering 16-year-old Theresa Fusco, who disappeared after leaving her part-time job at a roller-skating rink roughly 30 miles from Manhattan, in November 1984. Three other men, who were wrongly convicted of Ms Fusco's killing and served 17 years in prison, were released after being exonerated by DNA evidence in 2003. Exclusive - drones flying above UK terrorist prisons They sued for wrongful imprisonment, and two were each awarded $18m (£13.4m). The girl's remains were found weeks after the assault, buried under leaves in a wooded area near the rink. Bilodeau, who was 23 and living a mile away from the rink with his grandparents at the time, pleaded not guilty at the Nassau County court in Mineola on 15 October and was remanded in jail. Fusco's father, Thomas, told reporters it was \"heartbreaking\" to relive his daughter's death \"over and over again\", adding \"I loved her and I miss her... I never gave up hope. I've always had faith in the system.\" \"She lives in my heart, as you can see,\" Fusco said, showing a picture of Theresa taken from his jacket. Bilodeau could be jailed for up to 25 years to life, if convicted. In February 2024, detectives, who said they had developed \"multiple investigative leads\", recovered a cup and straw they said Bilodeau had used and thrown away at a smoothie cafe. DNA extracted from the straw matched a sample taken from Fusco's body in 1984. Assistant District Attorney Jared Rosenblatt said that when confronted with the DNA evidence, the suspect said: \"Yeah, people got away with murder back then.\" In court, Mr Rosenblatt told him: \"It's 2025, and your day of reckoning is now.\" Fusco was one of three teenage girls who disappeared around the same time, one of whom was a friend of hers. Kelly Morrissey, 15, went missing earlier in 1984 and was never found. Jacqueline Martarella, 19, of Oceanside, was found dead the following year at a nearby golf course. Read more from Sky News:Godfather star died of pneumoniaHatton's cause of death revealed The three men who were wrongfully convicted of killing Fusco worked together as removal workers and one of them had dated Ms Morrissey. DNA testing that was not available in the 1980s later proved someone else raped and killed her."
    },
    {
        "title": "Major milestone in Post Office scandal as first Capture conviction referred to Court of Appeal",
        "description": "The first Post Office Capture conviction has now been formally referred to the Court of Appeal, marking a major milestone in the IT scandal.",
        "url": "https://news.sky.com/story/major-milestone-in-post-office-scandal-as-capture-case-referred-to-court-of-appeal-13450966",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-post-office-robinson_6945429.png?20250718201050",
        "type": "Business",
        "Author": "Adele Robinson",
        "Date Published": "2025-10-16 14:40:00",
        "Headline": "An exoneration of one victim may \"speed up\" the handling of others cases, lawyers say. ",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n The first Post Office Capture conviction has now been formally referred to the Court of Appeal, marking a major milestone in the IT scandal. The Criminal Cases Review Commission (CCRC) made the decision to refer the case of sub-postmistress Patricia Owen back in July. Mrs Owen was convicted of theft by a jury in 1998, based on evidence from the faulty IT software Capture.   She was given a suspended prison sentence and fought to clear her name afterwards - but died in 2003. Capture software was used in 2,500 branches between 1992 and 1999. \n                  Post Office scandal compensation shake-up and new redress body revealed\n                 \n                  Post Office Capture IT system conviction referred to Court of Appeal for first time\n                 \n                  Post Office transformation effort gets £118m funding boost\n                  It is the first time a conviction based on Capture - the predecessor to the Horizon system at the centre of the wider Post Office scandal - has reached the Court of Appeal. It comes after Sky News revealed that a damning report into Capture, which could help overturn convictions, had been unearthed after nearly 30 years. An investigation found the Post Office knew about the report at the time and continued to prosecute sub-postmasters based on Capture evidence. Mrs Owen's family submitted an application to the CCRC in January 2024 - her case has now been referred on the grounds that her prosecution was an \"abuse of process\". A 'touchstone case' for victims Lawyers have said that if Mrs Owen is exonerated posthumously in the Court of Appeal, it may \"speed up\" the handling of others. The CCRC is also continuing to investigate more than 30 other \"pre-Horizon\" convictions. CCRC chair, Dame Vera Baird, also told Sky News in the summer it could be a \"touchstone case\" for other victims. Juliet Shardlow, Mrs Owen's daughter, has been fighting to clear her mother's name for years. She told Sky News the family were \"so pleased\" her case had finally been referred. \"This has been a very long journey for us as a family and we can now see the light at the end of the tunnel,\" she said. \"It's just sad that mum isn't here to see it. \"The good news is that once mum's case is heard in the High Court, it will pave the way for all the other Capture victims.\" The Post Office has previously said it is \"determined that past wrongs are put right and continue to support the government's work in this area as well as fully co-operate with the Criminal Cases Review Commission\". A spokesperson added on Thursday evening: \"We continue to fully co-operate with the CCRC by supplying documents and information, where this is available, that has been requested in relation to pre-Horizon convictions. \"Whilst we can’t comment on individual cases, we continue to support the CCRC in dealing with pre-Horizon convictions.\" "
    },
    {
        "title": "First test of chancellor's 'securonomics' policy does not bode well",
        "description": "Not all that long ago the prevailing wisdom in economic circles was that where things were made hardly mattered. What really mattered, instead, was how much something cost.",
        "url": "https://news.sky.com/story/first-test-of-chancellors-securonomics-policy-does-not-bode-well-13451118",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-rachel-reeves-chancellor_7029992.jpg?20250924035136",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-10-16 11:51:00",
        "Headline": "Sky's Ed Conway writes that the loss of the planned rare earths refinery near Hull does not seem to concern Rachel Reeves outwardly, but there is every reason to be worried.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Not all that long ago the prevailing wisdom in economic circles was that where things were made hardly mattered. What really mattered, instead, was how much something cost. But in recent years that has changed - and changed in a big way. Now countries around the world are racing to secure the minerals and materials they need to build the technologies of the future. Where something is made matters, in other words. That, at least, was the gist of Rachel Reeves' policy of \"securonomics\", unveiled here in Washington in a speech three years ago. Her point was that unless countries like Britain try to secure their supply of certain ingredients for making technology and energy, they will leave themselves more vulnerable to future crises. Money latest: Fake texts scam warning So you might have thought the chancellor would have been disappointed to have heard from Sky News that one of the central firms in Britain's push to build a domestic critical minerals infrastructure, Pensana, had decided to scrap plans for a UK rare earths refinery, choosing instead to locate its plant in the US. However, the chancellor seemed quite sanguine when I caught up with her on the fringes of the International Monetary Fund's annual meetings here in the US capital. Indeed, she seemed almost reassured that the investment had gone to the US, another G7 nation, and pointed to a series of prospective investments in lithium and tin production elsewhere in the UK. She said that when it came to the trade deals done this year, \"we are the envy of the world\" - words that some might construe as hubris.  Even so, there is a deeper question: why are so many industrial companies abandoning the UK? There are some straightforward explanations, among them the fact that power prices in Britain are higher than any other leading economy. Yet Pensana's chairman, Paul Atherley, said that energy costs were not the deciding factor in its decision to relocate to the US. \n                  Be bold with tax hikes or risk 'groundhog day', chancellor told as limited growth recorded\n                 \n                  Reeves plots budget boost to entrepreneur tax incentives\n                 \n                  Chancellor Rachel Reeves admits tax rises and spending cuts considered for budget\n                 Instead, the bigger issue is that while European governments have talked the talk on reindustrialising, they have not put significant sums of money behind those pledges. In the case of rare earths, the suite of critical minerals needed for production of high power magnets in electric car motors and wind turbines, the reality is that at current global prices, it is essentially impossible for UK companies to compete with China.  Read more from Sky News:Got a pair of AirPods? There's more to them than meets the eye...China tightens control of global rare-earth supply chain In the universe we used to inhabit a few years ago, in which the location where something is made is essentially irrelevant, the logical conclusion was that everyone should try to source their rare earth metals from China. And that's more or less what happened, with the upshot that 90% of refined rare earths are produced in China. So… what to do? The US response has been straightforward: the administration has pledged to pay a guaranteed price for rare earths from its leading domestic producer, MP Minerals. No such pledge exists in the UK or Europe, making it incredibly difficult for aspiring companies to raise money and build a business. The Chancellor seems to show little interest in matching the US on this front. And so it's nearly inevitable that Pensana and other companies will migrate to where they can expect to net a decent price for their products. That is why this episode matters so much. It is an early test for \"securonomics\" - of whether it is more than just clever word. Whether it will actually turn the tide. So far there's not much evidence that that is happening."
    },
    {
        "title": "Nestle to cut 16,000 jobs with British impact unclear",
        "description": "The world's biggest packaged food company, Nestle, is to cut 16,000 jobs in the next two years, it announced on Thursday.",
        "url": "https://news.sky.com/story/nestle-to-cut-16000-jobs-13450987",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nestle-switzerland_7008977.jpg?20250902085529",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-10-16 07:38:00",
        "Headline": "While no detail has been given on the hit to Nestle sites across Britain, the GMB union said it is anticipating an impact on its members. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The world's biggest packaged food company, Nestle, is to cut 16,000 jobs in the next two years, it announced on Thursday. The cuts around the world come as the company said it was \"automating\" its processes and increasing focus on \"operational efficiency\". Losses will primarily be in white-collar, professional parts of the business, with 12,000 roles to go. Around 4,000 manufacturing and supply chain jobs are to be lost, Nestle said. Money blog: New ready meals costing up to £30 launched There will be a consultation on the roles to be axed \"where applicable\", the announcement read. The company is behind brands such as Nescafe, Cheerios, KitKat, and Rolo. What about the UK? \n                  Major milestone in Post Office scandal as first Capture conviction referred to Court of Appeal\n                 \n                  Money blog: Chancellor 'considering ISA cut' again - despite backlash\n                 \n                  UK suffers blow in bid to become minerals superpower - as it's snubbed by its own leading firm\n                 The impact on Nestle's British workforce was not clear from the corporate announcement. When contacted by Sky News, a spokesperson said: \"At this point in time, we are not in a position to give concrete figures for individual markets.\" Its market update said the reductions will be \"across functions and geographies\". There are Nestle factories, distribution centres and offices across England, Scotland and Wales employing roughly 7,500. Worldwide Nestle employs 277,000 people. The GMB union, which represents roughly 2,000 Nestle staff in Britain said the job losses are \"a gutless betrayal of Nestle's hard-working staff\". \"Nestle is a hugely profitable business, and from our point of view, this is about squeezing more profit rather than trying to mitigate losses, which is hugely disappointing,\" Charlotte Brumpton-Childs, GMB's national officer, told Sky News. Latest figures for Nestle, for the first half of the year, showed profit of £4.7bn, down 10% from a year earlier. \"Nestle workers in the UK have already had to deal with the closure of Fawdon factory in 2023 and what feels like constant restructuring and job losses in factories in York and Tutbury,\" Ms Brumpton-Childs said While the union hasn't had any detail from Nestle leadership, she said she was anticipating GMB members to \"definitely\" be impacted by the latest announcement. A struggling sweets market \"We do know that the European markets are where some of the tightest margins are, and where the company might be struggling more\", she added. The confectionery market in particular has struggled due to elevated cocoa prices, as climate change has hit harvests. 'Hard but necessary' Nestle's new chief executive, Philipp Navratil, said the number of staff will be reduced \"with respect and transparency\" and that it will involve \"hard but necessary decisions\" in his first major structural announcement since being appointed after the sudden departure of his predecessor. Mr Navratil, a long-time Nestle executive and former head of Nestle coffee machine brand, Nespresso, took the reins in September after the dismissal of Laurent Freixe following an investigation into an undisclosed romantic relationship with an employee. \"As Nestle moves forward, we will be rigorous in our approach to resource allocation, prioritising the opportunities and businesses with the highest potential returns,\" Mr Navratil said. \"We are fostering a culture that embraces a performance mindset, that does not accept losing market share, and where winning is rewarded.\""
    },
    {
        "title": "Struggling drinks giant Diageo faces investor pay revolt",
        "description": "Diageo, the struggling owner of Guinness and Johnnie Walker whisky, is facing an investor backlash next month over nearly &#163;8.5m in stock awards handed to the frontrunner to become its next chief executive.",
        "url": "https://news.sky.com/story/struggling-drinks-giant-diageo-faces-investor-pay-revolt-13451028",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-guinness-pint-pints_6921447.jpg?20250519134600",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-16 09:22:00",
        "Headline": "Shareholders in the Guinness-maker are being encouraged to revolt at next month's AGM over £8.5m in share awards handed to interim chief Nik Jhangiani, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Diageo, the struggling owner of Guinness and Johnnie Walker whisky, is facing an investor backlash next month over nearly £8.5m in stock awards handed to the frontrunner to become its next chief executive. Sky News has learnt that investors in Diageo are being urged to vote against its pay report at its annual meeting in early November because of disquiet over the lack of performance conditions attached to shares awarded to Nik Jhangiani. Mr Jhangiani joined the company, which also owns Baileys and Smirnoff, as its finance chief just over a year ago. Money blog: New ready meals costing up to £30 launched In July, he was elevated to become interim chief executive following Debra Crew's ousting over the company's lacklustre performance. Glass Lewis, one of the leading proxy advisers which makes recommendations to institutional shareholders on voting decisions, has called on them to oppose Diageo's pay report because of Mr Jhangiani's recruitment awards. \"Given the significant quantum of the awards, approximately £8.48m, we believe that shareholders may reasonably have expected greater clarification as to the determination of the conditions associated with such awards,\" Glass Lewis said. \n                  Major milestone in Post Office scandal as first Capture conviction referred to Court of Appeal\n                 \n                  Money blog: Chancellor 'considering ISA cut' again - despite backlash\n                 \n                  UK suffers blow in bid to become minerals superpower - as it's snubbed by its own leading firm\n                 \"In the absence of a cogent rationale as to the non-performance-based nature of the majority of awards, we believe this issue precludes shareholder support for this proposal at this time.\" The remuneration report vote is advisory only, and the result is not binding on Diageo. In response to Glass Lewis's recommendation, a Diageo spokesperson said: \"The recruitment arrangement was predominantly made in shares and was to compensate Nik for what he forfeited from his previous employer upon joining Diageo. \"When determining the structure and value of a recruitment arrangement, the Remuneration Committee looks to ensure that any such compensation has a fair value, no higher than that of the awards forfeited. \"As an executive director, Nik is subject to a shareholding requirement both during his tenure and on a post-employment basis.\" Mr Jhangiani is widely regarded as the most likely permanent successor to Ms Crew, with an appointment said to be possible as early as next month."
    },
    {
        "title": "Thousands sue Johnson & Johnson in UK over cancer claims",
        "description": "Johnson & Johnson (J&J) is facing legal action from thousands of people in the UK who are accusing the global healthcare giant of knowingly selling talcum powder contaminated with asbestos.",
        "url": "https://news.sky.com/story/thousands-sue-johnson-johnson-in-uk-over-cancer-claims-13450938",
        "image_url": "https://e3.365dm.com/22/08/1920x1080/skynews-johnson-and-johnson_5862037.jpg?20220812092108",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-16 02:59:00",
        "Headline": "Legal action is being taken on behalf of more than 3,000 people in Britain who allege their cancer was caused by using baby powder contaminated with asbestos.",
        "Content": "Johnson & Johnson (J&J) is facing legal action from thousands of people in the UK who are accusing the global healthcare giant of knowingly selling talcum powder contaminated with asbestos. More than 3,000 people allege they or a family member developed forms of ovarian cancer or mesothelioma from using Johnson's baby powder between 1965 and 2023. A lawsuit has been filed by KP Law at the High Court in London seeking damages against J&J and Kenvue UK, which was split from the former in 2023 and now operates as a separate business. The lawsuit alleges J&J's product was contaminated with carcinogenic fibres, including asbestos, and the firm concealed the risk to the public for decades. J&J stopped selling talc-based baby powder in the US in 2020, switching to a cornstarch product. It did the same globally in 2023. Kenvue said in a statement that J&J baby powder \"did not contain asbestos, and does not cause cancer\". J&J is separately facing tens of thousands of lawsuits in America, where claimants allege they were diagnosed with cancer after using baby powder and other talc products. Last week, J&J was ordered to pay $966m (£720m) to the family of a woman who died from mesothelioma, one of the largest awards against the firm, although the amount could be reduced on appeal. Damages awarded by UK courts are generally more restricted. What is the legal claim being made? Talc is a naturally occurring mineral which is mined. But Michael Rawlinson KC, who is representing the claimants, said in court documents that \"there exist very few, if any, commercially exploited talc deposits in the world which do not contain asbestos\". He also alleged that reports from such mines, J&J's own research, and existing scientific literature would all have informed J&J about asbestos contamination. Despite this, Mr Rawlinson claimed the company \"suppressed information that might indicate that baby powder was contaminated with asbestos\", \"lobbied regulators\" to enable the continued sale of its product, and sponsored studies to \"downplay the dangers\" to human health. Read more from Sky News:J&J agrees to pay $8.9bnTalcum powder lawsuit approved 'We were told talc was good for you' Janet Fuschillo, one of the claimants, was diagnosed with ovarian cancer seven years ago. The 75-year-old said she used J&J's baby powder since the 1960s: \"I used talc on myself and all four of my children because we were told it was pure, and it was good for you.\" Patricia Angell said her husband Edward died in 2006, aged 64, a few weeks after being diagnosed with mesothelioma. \"He would come home from work and shower every day and use J&J's talc,\" she said. \"Talc was mentioned on Edward's autopsy report, along with asbestos strains found in contaminated talc.\" Mesothelioma, a form of cancer, is almost always caused by asbestos exposure, according to the NHS, and it commonly forms in the lungs after people inhale the microscopic fibres. Baby powder 'does not cause cancer' A Kenvue spokesperson said: \"We sympathise deeply with people living with cancer. \"We understand that they and their families want answers - that's why the facts are so important. \"The safety of Johnson's baby powder is backed by years of testing by independent and leading laboratories, universities and health authorities in the UK and around the world. \"The high-quality cosmetic grade talc that was used in Johnson's baby powder was compliant with any required regulatory standards, did not contain asbestos, and does not cause cancer.\""
    },
    {
        "title": "The first digital ID launches today",
        "description": "From today, digital veteran cards are available for ex-members of the armed services - the first step in the digitisation of almost every form of ID.",
        "url": "https://news.sky.com/story/the-first-digital-id-launches-today-13451263",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-digital-id-card-beefeater_7052658.png?20251016184918",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-10-16 16:55:00",
        "Headline": "Digital veteran ID cards are launching today, and the government wants to digitise passports, driving licences and others by the end of 2027.",
        "Content": "\n          Political reporter\n              @TimJ_B\n  From today, digital veteran cards are available for ex-members of the armed services - the first step in the digitisation of almost every form of ID. No, this isn't the controversial \"mandatory\" right to work checks announced recently - more on that later - but it is part of the same programme for pretty much all forms of government identification to be accessible on your phone by the end of 2027. This will mean passports, driving licences, national insurance cards and many more being virtual instead of - or as well as - being stashed in a shoebox or under socks in a drawer. At an event at the Tower of London - chosen for its millennia-old juxtaposition with the digital revolution - Beefeaters showed off their shiny new cards and joked of using it to get discounted food. There was an occasional tech hiccup here and there with getting the cards downloaded, mostly due to dodgy internet, it seemed, but in general it was all smiles. The minister in charge of the rollout, Ian Murray MP, crowed of the benefits of having documents on your phone and how it will make life easier. \"We all use our smartphones for everyday life,\" he explained. \"So it's about making the relationship with the citizen easier and making their access to government services easier.\" Mr Murray said he is looking forward to the end of \"having to continuously fill out my name, my address, my telephone number\" and instead just scanning his phone.  How will it work? Having all government documents accessible in an Apple or Google Wallet-style app is the end goal, and the solution is being built on similar secure technology that underpins storing payment cards on your phone. The work is being done in house by Government Digital Service, part of the Department of Science, Innovation and Technology, that houses the digitisation expertise in Whitehall. Any mention of digitisation of the personal information raises questions around security, but the government insists its solution is safe with a \"federated\" approach. To use the example of a veteran's ID, this would mean that the original data of who is a veteran, where they served, and all other relevant information would remain with the Ministry of Defence. Once the sign-in and verification with this data has been completed on a phone, this can then be used to prove someone is a veteran, and easily give them access to housing, mental health support, shopping discounts, museum entry and other benefits, the government says. What about other forms of ID? For driving licences, the data would stay with DVLA, passports with the passport office, and national insurance with the Department for Work and Pensions. Those who have worked on the creation of the software say this stops the creation of a single vault of everyone's personal data in one place. In order to get the card on your phone, you would need to use the phone's security - such as a face scan, fingerprint, or pin code. There is even talk that technology like contactless could be used with the government's version of the wallet to tap and verify things like age in an off-licence. The hope from government is that it can speed up tedious paper-based interactions, like house buying, passport control, and the right to work. It is here where the sticking point on this policy plan becomes apparent.  Papers, please? Announcing \"mandatory\" digital ID last month, the prime minister made it clear this was about cracking down on immigration. Straightaway, concerns were raised about why a compulsory digital ID was needed, who would check it, and what for. Polling showed - especially among Tory and Reform voters - an opposition to this policy, when it is these people the immigration battle is being fought over. Tory MP and a stalwart opponent of government overreach David Davis said: \"Digital ID gives the state the unchecked power to digitally strip citizens naked.\" He added: \"Starmer's scheme will be even more risky as ransomware criminals, foreign states and other hackers will attack the strategic weak points in the OneLogin architecture.\" Read more:Do we need digital IDs?The countries where digital ID already exists If the government believes digitising identification is so beneficial, and such a win-win, why does it want to force people to use it rather than see the benefits and choose to use it? Mr Murray said the right to work ID will be mandatory as \"it's mandatory already to be able to prove that you can work in the UK\". He insists it will make the process for employees easier, and also make it easier for the Home Office to see which employers are not making checks - no more photocopying passports and scanning old phone bills. The government is adamant this is the only mandatory use case, with the suggestion even that the digital ID could be deleted once employment is confirmed. 👉Listen to Politics At Sam And Anne's on your podcast app👈 But the flip side is that once this can of worms is opened, this or a future government could change tack and would have the digital infrastructure to do what it wants. But Mr Murray said: \"The principle here is to make the state and the citizen's relationship much easier - and the power of the data in the hands of the citizen.\""
    },
    {
        "title": "Government delays Chinese super embassy decision again",
        "description": "The government has again delayed making a decision on whether the Chinese super embassy can go ahead.",
        "url": "https://news.sky.com/story/government-delays-chinese-super-embassy-decision-again-13451183",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-china-embassy_7050654.jpg?20251014113348",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-16 14:17:00",
        "Headline": "There are national security concerns about the 600,000 sq ft proposed embassy on the site of the old Royal Mint near the Tower of London.",
        "Content": "The government has again delayed making a decision on whether the Chinese super embassy can go ahead. New Housing Secretary Steve Reed, who took over from Angela Rayner, was due to approve or deny Beijing's application for a 600,000 sq ft embassy near the Tower of London next Tuesday. However, the decision has been delayed to 10 December, \"given the detailed nature\" of the planning application, and the need to give parties sufficient opportunity to respond\", the prime minister's spokesman confirmed. He added that the new deadline is \"not legally binding\". Politics latest: Senior MP hits back at 'patronising' CPS lawyers The spokesman denied the postponement was politically influenced and said it was \"very much bound by the quasi-judicial\" nature of planning law. The delay comes the day after the government published witness statements it provided to prosecutors in the China spy trial that collapsed, prompting a blame game over whose fault it was that it dropped. A decision had already been delayed from 9 September to 21 October after China submitted plans with large greyed-out sections, which said: \"Redacted for security reasons.\" Explainer: Everything we know about China's new 'super embassy' What are the concerns about the embassy? It has become controversial due to concerns about it being turned into a Chinese spy hub for Europe and the fact highly sensitive financial cables run beneath it to the City of London and Canary Wharf. The decision to delay again was made after the national security strategy committee wrote to Mr Reed on Monday saying that approving the embassy at its proposed site was \"not in the UK's long-term interest\". Committee chairman Matt Western, a Labour MP, said in the letter the location presents \"eavesdropping risks in peacetime and sabotage risks in a crisis\". Read more:MI5 boss says China plot disrupted in past weekThe Chinese exiles with £100k bounties on their headsThree key questions about China spy case Tower Hamlets Council rejected China's initial planning application in 2022 to turn Royal Mint Court, where British coins were minted until 1975, into the largest embassy in Europe over security concerns and opposition from residents. Beijing did not appeal the decision after making it clear it wanted Conservative ministers to give assurances they would back a resubmitted application - but the then-Tory government refused. Eleven days after Labour won the election last July, the application was resubmitted in nearly exactly the same form, and was soon \"called in\" by Ms Rayner for central government to decide.  Conservative shadow housing secretary Sir James Cleverly accused the government of having \"actively sought to silence the warnings\" about the threats to national security from the embassy. \"It is essential the planning review has access to the full unredacted drawings for the Chinese embassy, and that the UK security agencies are able to submit evidence in private, using established processes,\" he said. \"If Keir Starmer had any backbone, he would ensure his government threw out this sinister application - as Ireland and Australia did when faced with similar embassy development proposals from Russia.\" What has China said about the concerns? In August, the Chinese embassy in the UK said the planning and design was \"of high quality\" and the application had \"followed the customary diplomatic practices, as well as necessary protocol and procedures\". The embassy added that it is \"an international obligation of the host country to provide support and facilitation for the construction of diplomatic premises\". And it reminded the UK that London wants to knock down and rebuild the British embassy in Beijing, which is in a very poor condition. In September, a Chinese embassy spokesperson told Sky News that claims the new embassy poses a potential security risk to the UK are \"completely groundless and malicious slander, and we firmly oppose it\". They added: \"Anti-China forces are using security risks as an excuse to interfere with the British government's consideration over this planning application. This is a despicable move that is unpopular and will not succeed.\""
    },
    {
        "title": "The three key questions about the China spy case that need to be answered",
        "description": "The government has published witness statements submitted by a senior official connected to the collapse of a trial involving two men accused of spying for China.",
        "url": "https://news.sky.com/story/the-three-key-questions-about-the-china-spy-case-that-need-to-be-answered-13450999",
        "image_url": "https://e3.365dm.com/21/03/1920x1080/skynews-china-flag-uk-flag_5307146.jpg?20210316144021",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-10-16 08:18:00",
        "Headline": "The PM has taken the unusual move of publishing witness statements from the case. But now there are new questions to answer.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n The government has published witness statements submitted by a senior official connected to the collapse of a trial involving two men accused of spying for China. Here are three big questions that flow from them: 1. Why weren't these statements enough for the Crown Prosecution Service (CPS) to carry on with the trial? For this prosecution to go ahead, the CPS needed evidence that China was a \"threat to national security\". The deputy national security adviser Matthew Collins doesn't explicitly use this form of words in his evidence. But he comes pretty close. Politics latest - follow live In the February 2025 witness statement, he calls China \"the biggest state-based threat to the UK's economic security\". \n                  Everything we know about China's new 'super embassy'\n                 \n                  MI5 boss says China plot disrupted in past week - amid rise in state-sponsored threats\n                 \n                  PM faces 'more unanswered questions' after evidence in China spying case released\n                 Six months later, he says China's espionage operations \"harm the interests and security of the UK\". Yes, he does quote the language of the Tory government at the time of the alleged offences, naming China as an \"epoch-defining and systemic challenge\". But he also provides examples of malicious cyber activity and the targeting of individuals in government during the two-year period that the alleged Chinese spies are said to have been operating.  In short, you can see why some MPs and ex-security chiefs are wondering why this wasn't enough. Former MI6 head Sir Richard Dearlove told Sky News this morning that \"it seems to be there was enough\" and added that the CPS could have called other witnesses - such as sitting intelligence directors - to back up the claim that China was a threat. Expect the current director of public prosecutions (DPP) Stephen Parkinson to be called before MPs to answer all these questions. 2. Why didn't the government give the CPS the extra evidence it needed? The DPP, Stephen Parkinson, spoke to senior MPs yesterday and apparently told them he had 95% of the evidence he needed to bring the case. The government has said it's for the DPP to explain what that extra 5% was. He's already said the missing link was that he needed evidence to show China was a \"threat to national security\", and the government did not give him that.  The newly published witness statements show they came close. But if what was needed was that explicit form of words, why was the government reticent to jump through that hoop? The defence from ministers is that the previous Conservative administration defined China as a \"challenge\", rather than a \"threat\" (despite the numerous examples from the time of China being a threat). The attack from the Tories is that Labour is seeking closer economic ties with China and so didn't want to brand them an explicit threat.  3. Why do these statements contain current Labour policy? Sir Keir Starmer says the key reason for the collapse of this trial is the position held by the previous Tory government on China. But the witness statements from Matthew Collins do contain explicit references to current Labour policy. The most eye-catching is the final paragraph of the third witness statement provided by the Deputy National Security Adviser, where he quotes directly from Labour's 2024 manifesto. He writes: \"It is important for me to emphasise… the government's position is that we will co-operate where we can; compete where we need to; and challenge where we must, including on issues of national security.\"  Did these warmer words towards China influence the DPP's decision to drop the case? Why did Matthew Collins feel it so important to include this statement? Was he simply covering his back by inserting the current government's approach, or was he instructed to put this section in? A complicated relationship Everyone agrees that the UK-China relationship is a complicated one. There is ample evidence to suggest that China poses a threat to the UK's national security. But that doesn't mean the government here shouldn't try and work with the country economically and on issues like climate change. It appears the multi-faceted nature of these links struggled to fit the legal specificity required to bring a successful prosecution. But there are still plenty of questions about why the government and the CPS weren't able or willing to do more to square these circles."
    },
    {
        "title": "Starmer orders mandatory antisemitism training for NHS staff",
        "description": "The prime minister has ordered a review of antisemitism in the NHS, saying there are too many cases \"simply not being dealt with\".",
        "url": "https://news.sky.com/story/starmer-orders-mandatory-antisemitism-training-for-nhs-staff-13451250",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-strmer-starmer-keir_7052617.jpg?20251016180045",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-16 16:43:00",
        "Headline": "The crackdown will see all 1.5m NHS staff undergo updated antisemitism and anti-racism training, while guidance on staff uniforms will be reviewed. ",
        "Content": "The prime minister has ordered a review of antisemitism in the NHS, saying there are too many cases \"simply not being dealt with\". The review is part of a wider crackdown on antisemitism in the UK, which will also see all 1.5m NHS staff undergo mandatory updated antisemitism and anti-racism training. Meanwhile, NHS England will review guidance on staff uniforms to \"protect freedom of religious expression while ensuring patients feel respected at all times\", the Department of Health and Social Care said. NHS England and other healthcare bodies will also be asked to adopt the International Holocaust Remembrance Alliance's definition of antisemitism. Sir Keir also announced a £10 million boost for security at sites including synagogues and Jewish schools, sharing the news during a visit to the Community Security Trust (CST), which provides protection for Jewish communities in the UK. \"We have heard loud and clear in the last few days and weeks that words are not enough, action is what matters,\" he said. Health correspondent Wes Streeting was furious when Dr Rahmeh Aladwan was cleared by an interim orders tribunal last September. The British-Palestinian doctor was referred to the medical tribunal following a series of social media posts, including one that said Israel was \"humiliated\" by the October 7 attacks. The Medical Practitioners Tribunal Service (MPTS) rejected the complaints against Dr Aladwan and said it believed her views did not present a real risk to patients. It did not impose interim restrictions against the doctor. The General Medical Council (GMC) has now re-referred Dr Aladwan for another interim orders tribunal while it continues its investigation. This is normally done when it believes there is an immediate risk to public protection. It is Dr Aladwan's case that prompted the Health Secretary to demand changes to the law to make it easier to suspend doctors accused of misconduct from practising while they are under investigation. Mr Streeting will hope these new measures introduced today will go some way towards his vision of a \"universal health system that everyone should feel safe approaching if they need care, regardless of race, creed or religion\". Dr Aladwan's next tribunal hearing is scheduled for 23 October.  The NHS review - led by John Mann, the government's independent adviser on antisemitism - is expected to focus on how healthcare regulators tackle antisemitism and other forms of racism. Andrew Gilbert, vice-president of the Board of Deputies of British Jews, has welcomed the review, saying Jewish staff and patients had felt \"let down by the NHS while antisemitism has been allowed to flourish and thrive\".  Sir Keir also said some universities have been \"too slow\" in dealing with cases of antisemitism. He singled out the University of Oxford, which is understood to have suspended a student on Wednesday after he was arrested on suspicion of inciting racial hatred. Read more:Major change to GP appointment bookingsNHS publishes hospital league tables The student is alleged to have chanted for Gaza to \"put the Zios in the ground\" at a protest in London on Saturday. \"That was a slow reaction to the clearest of cases,\" the PM said. Today's announcement comes in the wake of a terrorist attack at a Manchester synagogue that left two men dead, and after new Home Office figures suggested antisemitic hate crime remains near record levels."
    },
    {
        "title": "First test of chancellor's 'securonomics' policy does not bode well",
        "description": "Not all that long ago the prevailing wisdom in economic circles was that where things were made hardly mattered. What really mattered, instead, was how much something cost.",
        "url": "https://news.sky.com/story/first-test-of-chancellors-securonomics-policy-does-not-bode-well-13451118",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-rachel-reeves-chancellor_7029992.jpg?20250924035136",
        "type": "Politics",
        "Author": "Ed Conway",
        "Date Published": "2025-10-16 11:51:00",
        "Headline": "Sky's Ed Conway writes that the loss of the planned rare earths refinery near Hull does not seem to concern Rachel Reeves outwardly, but there is every reason to be worried.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Not all that long ago the prevailing wisdom in economic circles was that where things were made hardly mattered. What really mattered, instead, was how much something cost. But in recent years that has changed - and changed in a big way. Now countries around the world are racing to secure the minerals and materials they need to build the technologies of the future. Where something is made matters, in other words. That, at least, was the gist of Rachel Reeves' policy of \"securonomics\", unveiled here in Washington in a speech three years ago. Her point was that unless countries like Britain try to secure their supply of certain ingredients for making technology and energy, they will leave themselves more vulnerable to future crises. Money latest: Fake texts scam warning So you might have thought the chancellor would have been disappointed to have heard from Sky News that one of the central firms in Britain's push to build a domestic critical minerals infrastructure, Pensana, had decided to scrap plans for a UK rare earths refinery, choosing instead to locate its plant in the US. However, the chancellor seemed quite sanguine when I caught up with her on the fringes of the International Monetary Fund's annual meetings here in the US capital. Indeed, she seemed almost reassured that the investment had gone to the US, another G7 nation, and pointed to a series of prospective investments in lithium and tin production elsewhere in the UK. She said that when it came to the trade deals done this year, \"we are the envy of the world\" - words that some might construe as hubris.  Even so, there is a deeper question: why are so many industrial companies abandoning the UK? There are some straightforward explanations, among them the fact that power prices in Britain are higher than any other leading economy. Yet Pensana's chairman, Paul Atherley, said that energy costs were not the deciding factor in its decision to relocate to the US. \n                  Be bold with tax hikes or risk 'groundhog day', chancellor told as limited growth recorded\n                 \n                  Reeves plots budget boost to entrepreneur tax incentives\n                 \n                  Chancellor Rachel Reeves admits tax rises and spending cuts considered for budget\n                 Instead, the bigger issue is that while European governments have talked the talk on reindustrialising, they have not put significant sums of money behind those pledges. In the case of rare earths, the suite of critical minerals needed for production of high power magnets in electric car motors and wind turbines, the reality is that at current global prices, it is essentially impossible for UK companies to compete with China.  Read more from Sky News:Got a pair of AirPods? There's more to them than meets the eye...China tightens control of global rare-earth supply chain In the universe we used to inhabit a few years ago, in which the location where something is made is essentially irrelevant, the logical conclusion was that everyone should try to source their rare earth metals from China. And that's more or less what happened, with the upshot that 90% of refined rare earths are produced in China. So… what to do? The US response has been straightforward: the administration has pledged to pay a guaranteed price for rare earths from its leading domestic producer, MP Minerals. No such pledge exists in the UK or Europe, making it incredibly difficult for aspiring companies to raise money and build a business. The Chancellor seems to show little interest in matching the US on this front. And so it's nearly inevitable that Pensana and other companies will migrate to where they can expect to net a decent price for their products. That is why this episode matters so much. It is an early test for \"securonomics\" - of whether it is more than just clever word. Whether it will actually turn the tide. So far there's not much evidence that that is happening."
    },
    {
        "title": "MI5 boss says China plot disrupted in past week - amid rise in state-sponsored threats",
        "description": "The head of MI5 says he will \"never back off\" from confronting threats from China as he revealed his officers disrupted a case linked to Beijing in just the past week.",
        "url": "https://news.sky.com/story/mi5-boss-says-he-will-never-back-off-from-china-threat-as-beijing-plot-disrupted-in-last-week-13451068",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ken-mccallum-mi5-director-general_7052401.jpg?20251016131413",
        "type": "Politics",
        "Author": "Deborah Haynes",
        "Date Published": "2025-10-16 10:44:00",
        "Headline": "Sir Ken admits he's \"frustrated when opportunities to prosecute national security threatening activity are not followed\" - as a row escalates over the scrapping of a case against two Britons. ",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  The head of MI5 says he will \"never back off\" from confronting threats from China as he revealed his officers disrupted a case linked to Beijing in just the past week. More broadly, Sir Ken McCallum said the number of people in the UK under investigation for \"state threat activity\" - also including from Russia and Iran - has jumped by 35% in the past year compared with the previous 12 months. He admitted he felt frustration at the collapse last month of a trial against two British men accused of spying for China, but he stressed that the Security Service had still successfully derailed the alleged espionage operation. With pressure mounting on Sir Keir Starmer over why the high-profile trial foundered, the director general of MI5 - choosing his words carefully given the controversy - confirmed that \"Chinese state actors\" pose a threat to UK national security \"every day\". Politics latest: Senior MPs launch 'formal inquiry' into China spy case collapse He also warned that the wider threat from nation states is escalating and becoming as ugly as terrorism. He used an annual speech at MI5's headquarters in London to say: \n                  Everything we know about China's new 'super embassy'\n                 \n                  The three key questions about the China spy case that need to be answered\n                 \n                  PM faces 'more unanswered questions' after evidence in China spying case released\n                 • Attempts by states - principally China, Russia and Iran - to carry out operations involving violence, sabotage, arson or surveillance are \"routinely\" being uncovered. • MI5 has tracked more than 20 \"potentially lethal\" plots backed by Iran in the past year. • Russia is hatching a \"steady stream\" of surveillance plots with \"hostile intent\", while MI5 officers take it as a working assumption that Russian trolls will attempt to exploit any particular \"fissures\" in UK society using online posts, though these efforts are largely unsuccessful. • On terrorism, MI5 and the police have disrupted 19 late-stage attack plots since 2020 and have intervened in many hundreds of developing threats. • There is growing concern about children becoming involved in terrorism, with one in five of the 232 terrorism arrests last year involving minors under 17. \"MI5 is contending with more volume and more variety of threat from terrorists and state actors than I've ever seen,\" Sir Ken said. 'Biggest shift' Declaring a \"new era\", the MI5 boss warned of \"fast-rising\" state threats coupled with a \"near record\" number of terrorism investigations. He said this was forcing the biggest shift in MI5's mission since the 11 September 2001 terrorist attacks on the United States. China is a particular challenge as the Starmer government seeks to bolster economic ties with Beijing, while also wary of the security threat posed by Chinese spies.  \"The UK-China relationship is by its nature complex, but MI5's role is not,\" Sir Ken said. \"We detect and deal, robustly, with activity threatening UK national security.\" These threats range from cyber espionage; attempts to steal secrets from universities such as by cultivating academics; or efforts to target parliament and other parts of public life. \"MI5 will keep doing what the public would expect of us, preventing, detecting and disrupting activity of national security concern,\" said the MI5 chief. \"Our track record is strong. We've intervened operationally again just in the last week and we will keep doing so.\" The spy boss continued: \"I am MI5 born and bred. I will never back off from confronting threats to the UK wherever they come.\" The speech was delivered amid a growing row around a decision by the Crown Prosecution Service (CPS) to drop the espionage trial of Christopher Cash, a former parliamentary researcher to two prominent Conservative MPs, and Christopher Berry, a teacher. Both have denied any wrongdoing. Prosecutors said the government had not provided evidence that China represented a threat to national security, prompting allegations by the Conservatives that the prime minister's team had interfered with the case to protect the UK's trading ties with China. Attempting to push back, ministers on Wednesday released written evidence by Matthew Collins, the deputy national security adviser, that was given to the CPS. It spelled out the threat posed by China and his assessment of the allegations against the two individuals. China's UK embassy said Mr Collins' statements contained \"unfounded accusations that are purely fabricated and groundless\". \"We urge the UK to stop making an issue out of China, stop engaging in anti-China hype, and stop undermining China-UK relations,\" a spokesperson said on the embassy's website. MPs will hold a formal inquiry to discuss the China spying case and the issues that have arisen from it. Read more:Spy case witness statements released by governmentThree questions about spy case that need answering  Given the political storm, the MI5 director general was careful when responding to questions on the furore. But he chose to voice his support for Mr Collins who he has worked with, describing him as a \"man of high integrity and a professional of considerable quality\". Sir Ken was asked by journalists if he had been frustrated at the failure to prosecute. \"Of course I am frustrated when opportunities to prosecute national security threatening activity are not followed through for whatever reason,\" he said, though he noted not all cases that involve MI5 lead to prosecution. \"I would remind you all that in the particular case… the activity was disrupted.\" On whether he regarded China to be a threat, the MI5 chief said: \"Do Chinese state actors present a UK national security threat? And the answer is of course yes, they do every day.\" But he added that UK wider bilateral foreign policy on China is a matter for the government. Sky News has approached the Chinese embassy for comment on Sir Ken's comments."
    },
    {
        "title": "Five arrested on suspicion of crypto scams that may have cost victims millions",
        "description": "Five men have been arrested in London as part of an investigation into alleged crypto scams that may have cost victims more than &#163;1m, police have said.",
        "url": "https://news.sky.com/story/five-arrested-on-suspicion-crypto-scam-that-may-have-cost-victims-millions-13451024",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-crypto-scam_7052251.jpg?20251016102438",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-10-16 09:18:00",
        "Headline": "A London-based \"boiler room\" operation was suspected of making follow-up calls to victims to encourage further investment.",
        "Content": "\n          Science and technology reporter\n       Five men have been arrested in London as part of an investigation into alleged crypto scams that may have cost victims more than £1m, police have said. Detectives from the Met Police's economic crime team said the scams allegedly involved several websites claiming to offer pre-sale investment opportunities in new cryptocurrencies. Investors were promised cash returns that could more than double in value when listed on major exchanges, according to the police. However, the websites rarely had any intention to list them on exchange websites and could not guarantee returns in cash, the Met said. A London-based \"boiler room\" operation was then suspected of making follow-up calls to victims to encourage further investment. Victims of the scam, both in London and further afield, may have lost millions of pounds, according to the police. There are some steps you can take to protect yourself if you are considering investing in cryptocurrencies.  The Met Police recommends conducting \"thorough research\" before parting with your money. It also suggests checking the Financial Conduct Authority's (FCA) warning list. That is a list of companies that are not allowed to operate in the UK and includes crypto companies.\n The Met Police also shared five tips in its Little Book of Crypto Crime: 1. Don't be rushed into decisions: make sure you understand what you're buying and where you're buying it from. 2. If it sounds too good to be true, it probably is: taglines that promise guaranteed returns or consistent profit should be treated with caution. 3. Don't advertise how much crypto you have, just as you wouldn't advertise traditional wealth because it can make you a target for criminals. 4. Be wary of unsolicited contact and don't click on unsolicited links: login directly on sites rather than through links that are sent to you. 5. Check for subtle differences in web addresses, email addresses and contact numbers. Always check wallet addresses before transferring crypto.  The police named five websites allegedly linked to the arrests: DTX Exchange, Intel Markets, Cryptids, Algo Tech Trades and Unilabs Finance. \n                  Cryptocurrency investors charged over alleged New York City kidnap plot\n                 \n                  Investors descend on Trump's golf club for $148m meme coin dinner amid protests\n                 \n                  Cryptocurrency platform Coinbase warns of up to $400m hit from cyber attack \n                 They warned that some of the sites previously operated under different domain names, which makes them harder to track. Read more cryptocurrency news:Bitcoin's price is at record highs. Is it sustainable?Woman pleads guilty to money laundering over £5bn Bitcoin seizureCaves and crypto: The secrets behind the return of ISIS \"These websites are highly convincing and use professional-looking content, fake endorsements and aggressive marketing tactics to lure people in,\" said Detective Sergeant Stephen Bourne. \"Once cryptocurrency is sent, it is almost impossible to recover. If you have any doubts, please do not invest.  \"Though we are still very much in the early stages of the investigation, we believe this crime is affecting victims in every corner of the world and strongly advise members of the public not to engage with or invest through the websites listed,\" said DC Bourne. The men, aged between 21 and 37, were arrested in London earlier this month on suspicion of conspiracy to commit fraud. They have since been released on bail."
    },
    {
        "title": "Sam Fender wins 2025 Mercury Prize for album People Watching",
        "description": "Sam Fender has won the 2025 Mercury Prize for his album People Watching.",
        "url": "https://news.sky.com/story/sam-fender-wins-2025-mercury-prize-for-album-people-watching-13451398",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sam-fender-sam-fender-performs_7052821.jpg?20251016222041",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-16 21:03:00",
        "Headline": "Celebrating excellence in British and Irish music, the prestigious award highlights outstanding albums, with Sam Fender previously nominated in 2022.",
        "Content": "Sam Fender has won the 2025 Mercury Prize for his album People Watching. The announcement was made during the award ceremony in Newcastle on Thursday night, marking the event's debut outside of London. Jubilant crowds cheered hometown hero Sam Fender, from North Shields, who triumphed over competitors including Britpop legends Pulp, Irish artist CMAT, and post-punk group Fontaines DC. DJ Lauren Laverne hosted the event, while judge Sian Eleri announced the 31-year-old's win at the Utilita Arena, following performances by several nominees, including FKA Twigs and Martin Carthy. Judge Eleri said: \"After much hard discussion, we decided on one album that stood out for its cohesion, character, and ambition. \"It felt like a classic album, one that will take pride of place in record collections for years to come.\" Accepting the award, Fender expressed gratitude to the other nominees, saying, \"we're in great company\". \n                  The Brit Awards and Mercury Prize are moving outside London for the first time - but what does the shift mean for the UK music industry?\n                 \n                  Sam Fender, Pulp, CMAT and Wolf Alice among Mercury Prize nominees for 2025 - as full shortlist revealed\n                 \n                  Dynamic ticket pricing questioned by Mercury Prize stars: 'Where's the money going?'\n                 He dedicated the prize to his late friend and mentor, Annie Orwin, who inspired the album's title track. \"I want to just say thank you because I never did to the person, the song that People Watching is about,\" Fender said, becoming emotional. \"I want to dedicate it to Annie Orwin who's up there. \"That's all I've got thank you, and I love, this region is the best region in the country.\" Among other nominated artists were Pulp, Wolf Alice, FKA Twigs, PinkPantheress, Pa Salieu, Emma-Jean Thackray, Jacob Alon, Joe Webb and Martin Carthy. If Wolf Alice or Pulp had won the prize, they would have become only the second artist to have won the award twice after PJ Harvey, who won it with Stories From The City in 2001 and Let England Shake in 2011. Pulp won the prize in 1996 with their album Different Class, while Wolf Alice won with Visions Of A Life in 2018. Established in 1992, the award honours the best album released by a British or Irish artist each year. Last year, the indie quartet English Teacher took home the prize for their debut album This Could Be Texas. Fender had been nominated before in 2022 for his album Seventeen Going Under."
    },
    {
        "title": "BBC says Gregg Wallace isn't entitled to damages, as it denies causing 'distress and harassment' ",
        "description": "The BBC has said Gregg Wallace is not \"entitled to any damages\" in response to a High Court claim filed by the presenter - in which he says the broadcaster caused him \"distress and harassment\". ",
        "url": "https://news.sky.com/story/bbc-says-gregg-wallace-isnt-entitled-to-damages-as-it-denies-causing-distress-and-harassment-13451228",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-gregg-wallace-masterchef-host_6763965.jpg?20241204093832",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-16 15:48:00",
        "Headline": "The presenter, who was sacked from MasterChef in July, is suing the BBC and one of its subsidiaries in a row over a request he made for his personal data. ",
        "Content": "The BBC has said Gregg Wallace is not \"entitled to any damages\" in response to a High Court claim filed by the presenter - in which he says the broadcaster caused him \"distress and harassment\".  The former MasterChef presenter is suing the broadcaster and its subsidiary BBC Studios Distribution Limited after he was sacked from the cooking show in July. Wallace was dismissed after an investigation into historical allegations of misconduct upheld multiple accusations against him. He has filed a legal claim for up to £10,000 in damages, alleging the BBC failed to comply with a request for copies of his personal data, which caused \"distress and harassment\". In its defence filed at the High Court, Jason Pobjoy KC, for the BBC, said: \"It is denied that the claimant has suffered any distress or harassment as a result of the responses of the BBC. \"It is denied that the claimant is entitled to any damages, interest or other relief, whether as pleaded or otherwise.\" The broadcaster further denied that Wallace \"has suffered any distress or harassment\" as a result of its responses. \n                  Gregg Wallace suing the BBC for 'distress and harassment' following sacking\n                 \n                  Penny Lancaster says she felt 'belittled' by ex-MasterChef host Gregg Wallace\n                 \n                  'We may see more things coming out': BBC chief quizzed by MPs about talent 'scandal'\n                 The court documents also claim that the presenter failed to give the BBC prior notice of his intention to issue legal proceedings. The broadcaster has admitted Wallace wrote to it on 6 March this year, asking for copies of his personal data. Mr Pobjoy said the BBC did not provide Wallace with a \"substantive response\" within three months of his request \"primarily due to the lack of proportionality and scale\". He said that after designating the request as complex, the BBC responded to Wallace on 7 October and provided him with a copy of his personal data. The barrister said the \"voluntary disclosure demonstrates that the claimant has no basis to claim damages for distress, or otherwise, in respect of the withholding of such information\". Read more:Wallace speaks out after sackingJohn Torode axed from MasterChef Court documents filed on behalf of Wallace last month said the BBC emailed the presenter on 7 August to apologise for the delay in sending his personal data. Barrister Lawrence Power said the broadcaster told Wallace it was \"taking all reasonable steps\" to process the request in \"as timely a manner as possible going forward\", but that he had still not received a response when the court documents were filed. He said that by \"failing to fully comply with the subject access requests\" made by Wallace, \"the defendants acted in breach of their statutory duty and, in doing so, caused distress and harassment to the claimant\".  Wallace began co-presenting MasterChef in 2005, but it was announced in November 2024 that he would step away from his role while the misconduct allegations were investigated. A review by law firm Lewis Silkin later upheld 45 of the 83 allegations against him, including one of \"unwelcome physical contact\". Wallace issued an apology, saying he was \"deeply sorry for any distress caused\" and that he \"never set out to harm or humiliate\"."
    }
]