[
    {
        "title": "'Peace in the Middle East,' declares Trump after leaders fly in to witness deal signing",
        "description": "US President Donald Trump has said the \"prayers of millions have finally been answered\" after a Gaza peace deal was signed at a global summit in Egypt.",
        "url": "https://news.sky.com/story/trump-says-prayers-of-millions-answered-as-he-hails-peace-in-the-middle-east-13449671",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-family-photo-peace-summit_7050152.jpg?20251013174006",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-13 18:45:00",
        "Headline": "Mr Trump flew to Sharm el-Sheikh from Jerusalem, where he got a rapturous welcome and at least 22 standing ovations as he addressed Israel's Knesset (parliament) - but was also heckled by some members.",
        "Content": " US President Donald Trump has said the \"prayers of millions have finally been answered\" after a Gaza peace deal was signed at a global summit in Egypt. Speaking from a podium in Sharm el-Sheikh, where other world leaders met to hold discussions on Gaza's future, Mr Trump said: \"With the historic agreement we've just signed, those prayers of millions have finally been answered.\" He added: \"We've achieved what everybody said was impossible, at long last, we have peace in the Middle East.\" Mr Trump, Egyptian President Abdel Fattah el-Sissi, Turkish President Recep Tayyip Erdogan and Qatari Emir Tamim bin Hamad Al Thani had earlier signed a document the US president said would lay the groundwork for Gaza's future. However, a copy was not made public.  Mr Trump flew to Sharm el-Sheikh from Jerusalem, where he got a rapturous welcome and at least 22 standing ovations as he addressed Israel's Knesset (parliament) - but was also heckled by some members. The US president, who was hailed by Israeli Prime Minister Benjamin Netanyahu as Israel's \"greatest friend\", said \"after so many years of unceasing war and endless danger, today the skies are calm, the guns are silent and the sirens are still\". He added: \"It's the start of a grand concord and lasting harmony for Israel and all the nations of what will soon be a truly magnificent region.\" Read more:How withdrawal of Israeli troops in Gaza could workWill the ceasefire between Israel and Hamas last? It comes after Israel and Hamas last week agreed to the first phase of a long-sought ceasefire deal aimed at bringing the devastating war in Gaza to an end after two years of bloodshed. Israel's war in Gaza, launched following the killing of 1,200 people and capture of 251 more by Hamas during its attacks on 7 October 2023, saw more than 67,000 Gazans killed, according to Palestinian health officials. Its figures do not differentiate between civilians and combatants but it says around half of those killed were women and children.  On Monday, Hamas freed all 20 living hostages, but only released the bodies of four dead hostages. As part of Mr Trump's peace deal, Hamas was given 72 hours (until 10am on Monday) to return the 48 hostages left in Gaza - 20 of whom were known to be alive and 28 who have died. Hamas previously indicated that recovering the bodies of some dead hostages may take longer, as not all burial sites are known. The Hostages and Missing Families Forum condemned Hamas's actions, calling it \"a blatant breach of the agreement\". Prime Minister Sir Keir Starmer attended the ceremony in Sharm el-Sheikh alongside other world leaders, including Italy's Giorgia Meloni and France's Emmanuel Macron. He said the UK could play a key role in monitoring the ceasefire. Sir Keir said: \"What happens tomorrow really matters, and that's why, what I've been discussing with leaders all day is, what part can we play? \"And we, the United Kingdom in particular, I think, can play a part in monitoring the ceasefire, but also decommissioning the capability of Hamas and their weaponry drawing on our experience in Northern Ireland. \"So the question today has already moved to, how do we implement how do we make sure this moves forward? It's really important we keep that focus. We mustn't have any missteps now.\""
    },
    {
        "title": "China poses 'highly sophisticated' cyber threat to UK, NCSC warns",
        "description": "China poses a \"highly sophisticated and capable\" cyber threat, the UK's cyber agency has warned - as it revealed a 50% jump in significant attacks in Britain by criminals and hostile states.",
        "url": "https://news.sky.com/story/china-poses-highly-sophisticated-cyber-threat-to-uk-ncsc-warns-13449794",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-starmer-xi_7050426.jpg?20251014015646",
        "type": "Home",
        "Author": "Deborah Haynes",
        "Date Published": "2025-10-13 23:41:00",
        "Headline": "The National Cyber Security Centre (NCSC) says China poses a \"capable\" cyber threat, \"targeting a wide range of sectors and institutions across the globe, including the UK\".",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  China poses a \"highly sophisticated and capable\" cyber threat, the UK's cyber agency has warned - as it revealed a 50% jump in significant attacks in Britain by criminals and hostile states. The National Cyber Security Centre (NCSC)'s verdict on the threat posed by Chinese cyber spies comes as Sir Keir Starmer is under mounting pressure over the sudden collapse of a trial against two British men accused of espionage on behalf of Beijing. The Crown Prosecution Service said the case was derailed because the government would not deliver evidence to show China had been a threat to Britain's national security at the time of the alleged offences between 2021 and 2023. The prime minister said Beijing had not been classed as an \"enemy\" back then. Yet a 2023 review by the NCSC - which is part of Government Communications Headquarters - refers to the \"advanced threats\" posed by China to the UK's critical national infrastructure. A similar alarm was raised in the annual review in 2022: \"The regimes that continued to present the most acute cyber threat to the UK and its interests were Russia, China, Iran, and North Korea.\" In its latest report, published on Tuesday, the cybersecurity agency stated: \"China continues to be a highly sophisticated and capable threat actor, targeting a wide range of sectors and institutions across the globe, including the UK.\" \n                  Got a pair of these? There's more to them than meets the eye - and it may mean global trade war\n                 \n                  Government accused of 'cover-up' over collapse of China spy trial\n                 \n                  Starmer's national security adviser played no role in collapse of China spy trial, cabinet minister says\n                 This review covers the year to August 2025. With hacks and ransomware increasingly crippling some of the UK's biggest brands, the NCSC said the number of \"highly significant\" cyberattacks - classed as those impacting the government, essential services, large chunks of the population or the economy - surged 50% to 18 cases over the past year compared with the previous 12 months. The government did not provide a breakdown of whether those suspected of being responsible for the attacks were lone wolves, criminals or hostile states. \"Cyber is being used by state and non-state actors to achieve their goals, and the overall cyber threat to the UK is growing from an already high level,\" it said. Among the most high-profile victims of cyber foul-play have been the car manufacturer Jaguar Land Rover (JLR) and retailers M&S, Co-op and Harrods. Investigators are reported to be looking at whether a Russian state-backed actor targeted JLR. That hack forced the company temporarily to close its factories and had a major impact on its supply chain, prompting the government to agree a £1.5bn loan. Separately, four people were arrested in July over the cyberattacks against the three retailers. Attacks should be 'wake-up call' Richard Horne, head of the NCSC, said such attacks should be a \"wake-up call\" and urged the bosses of every company - big and small - to build their resilience against cyber threats. \"The time to act is now,\" he will say, according to an advanced copy of a speech he is set to deliver this morning. He will say it is vital for businesses to know what they would do if their computer screens went blank. \"Could you run your payroll systems? Or keep your machinery working? Or stock your shelves?\" he will say. \"If the answer is no, or more likely 'don't know' - act now.\"  Offering a sense of the real-world impact of a cyber assault, Shirine Khoury-Haq, the boss of the Co-operative Group, shared how it felt to be targeted. \"The attack has had a significant impact on me, my colleagues and on our members,\" she wrote in a foreword to the review. \"While you can plan meticulously, invest in the right tools and run countless exercises, nothing truly prepares you for the moment a real cyber event unfolds. \"The intensity, urgency, and unpredictability of a live attack is unlike anything you can rehearse. That said, those drills are invaluable - they build muscle memory, sharpen instincts, and expose vulnerabilities in your systems.\" The cyberattack cost Co-op at least £206m in lost revenues after hackers penetrated its networks, prompting shortages of goods on shelves and the loss of customer data. As well as calling out China, the NCSC also focused on the threat posed by Russia, Iran, and North Korea. It further flagged concerns about how cyberattackers are using artificial intelligence to enhance their capabilities."
    },
    {
        "title": "Thousands of homes now need repairs after insulation fitted under government scheme",
        "description": "Thousands of homes fitted with insulation under a flagship government scheme now need major remedial work, or risk damp and mould, the public spending watchdog has warned.",
        "url": "https://news.sky.com/story/thousands-of-homes-now-need-repairs-after-insulation-fitted-under-government-scheme-13449541",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-insulation-wall-insulation_7050237.jpg?20251013190752",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-10-13 14:13:00",
        "Headline": "More than 30,000 homes face damp or mould due to ill-fitted insulation, with a handful facing immediate risks like fires, a government watchdog warned. The energy department said it had plans to fix the issues at no cost to the household.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Thousands of homes fitted with insulation under a flagship government scheme now need major remedial work, or risk damp and mould, the public spending watchdog has warned. A damning report by the National Audit Office (NAO) said \"clear failures\" in the Energy Company Obligation (ECO) scheme to tackle fuel poverty and pollution had led to low quality installations and even potential fraud. It blamed incompetent subcontractors and weak monitoring and government oversight for the issues, which in extreme cases could cause fires. Fuel poverty campaigners warned the system had \"let cowboys through the front door\", saying it must be fixed to bring down energy bills and keep people warm. Almost all homes - some 98%, affecting 22,000 to 23,000 properties - fitted with external wall insulation under the ECO are affected, the NAO said. A further 29% of homes with internal wall insulation - around 9,000 to 13,000 dwellings - also face major issues that need fixing. A small percentage of homes - 6% with external insulation and 2% with internal - put people in immediate danger, such as poor ventilation that could cause carbon monoxide poisoning, and electrical safety issues that could start fires. ECO is a scheme that obliges energy companies to pay for energy efficiency measures in vulnerable households out of consumer bills. Gareth Davies, head of the NAO, said ECO is \"important to help reduce fuel poverty and meet the government's ambitions for energy efficiency\". But \"clear failures in the design and set-up\" had led to \"poor-quality installations, as well as suspected fraud\", he added. 'Gaming the system' The report says the reason things had gone so badly wrong could be down to work being subcontracted to individuals and firms who are not competent or certified, uncertainty over standards, and businesses \"cutting corners\" or \"gaming the system\". The energy regulator Ofgem last year estimated businesses had falsified claims for ECO installations in between 5,600 and 16,500 homes. That means they could have claimed between £56m and £165m from energy suppliers - ultimately paid for by bill-payers. Read more from Sky News:At least 42 killed as bus crashes on mountain roadDiscord hack shows risks of online age checks Martin McCluskey, the government minister for energy consumers, criticised the \"unacceptable, systemic failings\" that had affected thousands of families. He added: \"We are fixing the broken system the last government left by introducing comprehensive reforms to make this process clear and straightforward, and in the rare cases where things go wrong, there will be clear lines of accountability, so consumers are guaranteed to get any problems fixed quickly.\" The government urged households to take up the free audit that will be offered in a forthcoming letter, and said installers would be forced to remedy the issues free of charge. However, insulation has the potential to vastly improve homes, analysts pointed out. Jess Ralston from energy think tank ECIU said: \"The majority of households that have benefitted from insulation schemes have lower bills and warmer, healthy homes, particularly during the early years of the gas crisis when the UK's poor quality housing stock was one of the reasons we were so badly hit compared to other European countries.\" Simon Francis, co-ordinator of the End Fuel Poverty Coalition, said: \"Insulation and ventilation, when done properly, are among the safest and most effective ways to bring down energy bills and keep people warm.\" But the report had revealed a \"system that has let cowboys through the front door, leaving thousands of victims living in misery and undermining public trust\". Sue Davies, Which? head of consumer protection policy, called it \"a damning indictment of a failed scheme, where poor oversight has allowed rogue traders to cause huge damage to people's homes and lives\". She said the government must take swift action to rectify the damage, as well as ensuring \"there is no repeat of this scandal by putting in place robust consumer protections and effective oversight\"."
    },
    {
        "title": "Birmingham bin workers warned they face blacklisting over strike action",
        "description": "Birmingham bin workers employed by an agency have been told they will be blacklisted from permanent roles by the council if they refuse to cross picket lines in the ongoing dispute.",
        "url": "https://news.sky.com/story/birmingham-bin-workers-warned-they-face-blacklisting-over-strike-action-13449699",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-birmingham-bin-strike_7014992.jpg?20251013210542",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-13 21:09:00",
        "Headline": "Agency staff told the council will block permanent jobs if they refuse to cross picket lines amid an ongoing pay dispute.",
        "Content": "Birmingham bin workers employed by an agency have been told they will be blacklisted from permanent roles by the council if they refuse to cross picket lines in the ongoing dispute. Footage obtained by Sky News shows a manager from Job&Talent, an agency contracted by Birmingham City Council, telling staff at a meeting this week that council chiefs will bar them from permanent jobs if they join the strike. The manager said: \"Now I've spoken to Chris [Smiles], I've spoken to Rob Edmondson, and I think, you know categorically the council are not going to employ anybody that they don't want to employ. \"So those people that do decide to join the picket line, then the council have confirmed to us that they are not going to get a permanent job.\" Chris Smiles is a strategic operational director for Birmingham City Council, and Rob Edmondson is the acting director of street scene. The meeting took place on Thursday at the Atlas Depot in Birmingham. Birmingham's bin workers have been locked in a dispute with the council over proposed pay cuts since March 2025. The strike has caused widespread disruption to waste collection, with rubbish piling up across the city. The council declared a major incident as negotiations continue, but workers remain on strike, rejecting the council's offers and demanding better pay and job security. In response, Job&Talent said the comments were part of a longer discussion and do not reflect the agency's official position. \"We do not engage in or condone any form of blacklisting, and no worker is or would be denied employment opportunities on the basis of lawful participation in industrial action,\" the agency said. \"The exchange was part of an effort to clarify that no third party can guarantee permanent employment and that employment decisions are made through formal processes. No action has been taken against any worker in relation to this matter.\" Job&Talent added that it \"remains committed to maintaining safe, fair, and respectful working environments.\" Read more from Sky News:Government accused of 'cover-up' over collapse of China spy trialEngland defender Millie Bright announces retirement Birmingham City Council said: \"The council does not condone any actions which are contrary to legislation and good employment practice. \"Blacklisting will not be tolerated. We will immediately begin an investigation to ascertain the full facts. As this is a staffing matter, it would not be appropriate to make any further comment.\" The Unite union has said many agency staff have worked for Birmingham Council for over a decade without being offered permanent roles. \"Birmingham's bin workers are well aware that there is something rotten at the top of the council. That's why they've been striking for nine months over ruinous £8,000 fire and rehire attacks on their wages,\" Unite general secretary Sharon Graham said. \"Ministers must act now to stop this appalling behaviour and bring this dispute to an end with a fair deal for the bin workers,\" she added.\"The strikes will not end until it does.\""
    },
    {
        "title": "Alleged Madeleine McCann family stalker left voicemails saying 'I believe I'm really her'",
        "description": "A woman accused of stalking the parents of Madeleine McCann allegedly left voicemails asking the mother of the missing girl for a DNA test, a court heard.",
        "url": "https://news.sky.com/story/alleged-madeleine-mccann-family-stalker-left-voicemails-saying-i-believe-im-really-her-13449566",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-julia-wandelt-madeleine-mccann_7044386.jpg?20251006193949",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-13 14:57:00",
        "Headline": "Jurors heard that Julia Wandelt left Kate McCann a series of voicemails between June 2022 and February this year.",
        "Content": "A woman accused of stalking the parents of Madeleine McCann allegedly left voicemails asking the mother of the missing girl for a DNA test, a court heard. Jurors heard voicemails left by Julia Wandelt, 24, from Lubin, Poland, in which she was audibly upset. She allegedly left the messages last year, over a period of months, and at one point asked: \"What if I'm her?\" Co-defendant Karen Spragg, 61, began crying today at Leicester Crown Court and had to leave the dock when the voicemails were played. Wandelt, whose head was down while jurors were listening, was heard saying: \"I know you probably think Madeleine's dead. Well she is not. I really believe I'm her. \"Help me. Don't think Madeleine is dead. This is a chance. Please, I beg you. The police don't want to help me, they don't want to help Madeleine. It's all corrupt. \"I promise you that I will prove who I am because I know you love Madeleine.\" In another message, she said: \"You probably believe Madeleine is not alive anymore. \"What if I am her? What if there's a small chance that I'm her?\" Jurors also heard that, one night, Wandelt sent a message to Mrs McCann at 1am, saying: \"I don't understand why you don't want to do a DNA test.\" Prosecutors allege that Wandelt, a Polish national, falsely claimed she was Madeleine while stalking parents Kate and Gerry McCann by sending emails, making calls and turning up at their address between June 2022 and February this year. The court previously heard that Wandelt called and messaged Mrs McCann more than 60 times in a single day in April last year. This included alleged memories of Madeleine's abduction. Madeleine went missing during a family holiday to Praia da Luz in Portugal, in May 2007. Wandelt and Spragg, of Caerau Court Road in Caerau, Cardiff, both deny one count of stalking. The trial continues."
    },
    {
        "title": "Sir Keir Starmer has 'full confidence' in national security adviser after China spy trial collapse",
        "description": "Sir Keir Starmer has said he has \"full confidence\" in national security adviser Jonathan Powell following the collapse of the China spy trial.",
        "url": "https://news.sky.com/story/sir-keir-starmer-has-full-confidence-in-national-security-adviser-after-china-spy-trial-collapse-13449629",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer_7050270.jpg?20251013195032",
        "type": "Home",
        "Author": "Faye Brown",
        "Date Published": "2025-10-13 20:25:00",
        "Headline": "The collapse of a trial against two men accused of spying for China has led to an extraordinary blame game in parliament - with the Tories accusing the government of seeking to \"curry favour\" with Beijing. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Sir Keir Starmer has said he has \"full confidence\" in national security adviser Jonathan Powell following the collapse of the China spy trial. The prime minister said the senior civil servant is doing an \"excellent job\", amid questions over whether he played a role in the case being abandoned. Christopher Cash, 30, a former parliamentary researcher, and teacher Christopher Berry, 33, were accused of spying for China - a charge they denied - but weeks before their trial was due to begin, it was suddenly dropped. The director of public prosecutions, Stephen Parkinson, has blamed ministers for failing to provide evidence that would support the assertion that China represented a threat to national security, leading to accusations of a cover-up from the Tories.  However, Downing Street blamed the Conservatives for failing to classify China as a threat while in office - when the charges were brought against the pair - and for failing to update the \"archaic\" Official Secrets Act. Asked today if he supported Mr Powell, Sir Keir told broadcasters: \"He's doing an excellent job. \"You heard what Steve Witkoff said about him today in relation to the role he's played behind the scenes [in Gaza]. So of course, I've got full confidence in him.\" \n                  Starmer and other leaders have fallen into line on Trump's Gaza plan - now it must deliver\n                 \n                  UK played 'vital role' in Gaza peace deal, says Trump aide, after minister branded 'delusional'\n                 \n                  Politics latest: Tony Blair dodges Sky News questions about Gaza peace board controversy\n                 Mr Witkoff, the US's Middle East envoy, this morning lauded \"the incredible input and tireless efforts\" of Mr Powell in helping to bring about a ceasefire. Sir Keir was speaking from Sharm el-Sheikh in Egypt, where world leaders have gathered for the Gaza peace summit. The dropped trial has sparked a political row, with Tory leader Kemi Badenoch accusing the government of deliberately collapsing the case in order to avoid angering China and losing investment into the UK - something ministers have strenuously denied. Security minister Dan Jarvis accused her of spreading \"baseless smears\" in a statement setting out the government's position in the House of Commons on Monday afternoon, as MPs returned to parliament following the party conference recess. Mr Cash, of Whitechapel, east London, and Mr Berry, of Witney, Oxfordshire, were charged in April 2024 with passing politically sensitive information to a Chinese intelligence agent between December 2021 and February 2023. Blame game continues Mr Jarvis told MPs the prosecution was \"based on the law at the time of the [alleged] offence and the policy position of the Conservative government at the time of the [alleged] offence\". He said \"every effort\" was made by the Labour government to provide evidence to proceed with the case on that basis, but the CPS was \"hamstrung\" by the Tories' failure to update the Official Secrets Act. This was the legislation under which the charges were brought, which specifies it is a crime to communicate any documents which might be useful to \"an enemy\" - language Mr Jarvis said was \"archaic in the modern threat landscape\". The Tories defined China only as a \"systemic challenge to UK security\" in 2021, and then as an \"epoch-defining challenge\" in 2023. Mr Jarvis said ministers \"cannot retrospectively\" change that, adding: \"The current government's policy position was immaterial to the assessment that was made by the CPS. \"The CPS decision to drop the case was not influenced by any member of this government, nor special adviser or senior official.\" China 'poses series of threats' Ms Badenoch doubled down on her accusations in response, saying the collapsed trial \"wasn't a mistake\". \"This looks like a deliberate decision to collapse the case and curry favour with the regime in China.\" On Labour's position on China, Mr Jarvis said: \"We fully recognise that China poses a series of threats to UK national security, yet we must also be alive to the fact that China does present us with opportunities.\" He said that requires a \"pragmatic approach to economic engagement without compromising on our national security\". Read More:The blame game over China spy trial collapse MI5 issues new guidance to MPs Another issue the row has raised is the safety of MPs - with Commons speaker Lindsey Hoyle opening Monday's debate saying he is \"angry and disappointed\" that politicians are not being adequately protected from foreign interference. MI5 has now issued new guidance to MPs, peers, councillors, candidates and parliamentary staff, warning them: \"You are a potential target.\" As well as urging vigilance at home, the advice warns that foreign intelligence services could seek to exploit politicians' overseas travel to access their data or use financial donations as a route to influence. The guidance specifically accused Russia, China and Iran of carrying out \"long-term strategic foreign interference and espionage\" but said \"other states\" could also seek to obtain information about \"the UK system\". Mr Jarvis said the guidance would \"kickstart a wider cross-government action plan.. to reduce foreign interference and espionage threats to UK democratic institutions\"."
    },
    {
        "title": "Got a pair of these? There's more to them than meets the eye - and it may mean global trade war",
        "description": "For most of human history, no one paid all that much attention to the 17 rare earth elements. ",
        "url": "https://news.sky.com/story/got-a-pair-of-these-theres-more-to-them-than-meets-the-eye-and-it-may-mean-global-trade-war-13449786",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-apple-airpods_7050429.jpg?20251014025929",
        "type": "Home",
        "Author": "Ed Conway",
        "Date Published": "2025-10-13 22:02:00",
        "Headline": "Right now, about 70% of the world's rare earth elements - key to everything from AirPods to cars - are mined in China, which announced last week that anyone using Chinese rare earths would have to apply for a licence. This has been seen as a declaration of economic war in Washington.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  For most of human history, no one paid all that much attention to the 17 rare earth elements.  An obscure suite of elements that sit in their own corner of the periodic table, they were mostly renowned among chemists and geologists for being tricky and fiddly - incredibly hard to refine, but with chemical facets that made them, well… interesting. Not so much for a single thing they did by themselves, but for what they did in conjunction with other elements. Added to alloys, rare earths can make them stronger, more ductile, more heat-resistant, and so on. Think of them as a sort of metallic condiment: a seasoning you add to other substances to make them stronger, harder, better. The best example is probably neodymium. On its own, there's nothing especially spectacular about this rare earth element. But add it to iron and boron, and you end up with the strongest magnets in the world. Neodymium iron boron magnets are everywhere. If you have a pair of headphones or earbuds, the speakers inside them (\"drivers\" is the technical term) are driven by these rare earth magnets. If you have a pair of Apple AirPods, those magnets aren't just in the speakers; they're what's responsible for the satisfying \"click\" when the case snaps shut. Rare earth magnets are in your car: in the little motors that raise and lower the windows, inside the functioning of the airbag and the seat adjustment mechanism. And not just the little things. Most electric vehicles use rare-earth magnets in their motors, enabling them to accelerate more efficiently than the old all-copper ones. More sensitively, from the perspective of Western governments, in the military, there are tonnes of rare earths to be found in submarines, in fighter jets, in tanks and frigates. Much of this is in the form of magnets, but some is in the form of specialised alloys. So, for instance, there is no making a modern jet engine without yttrium and zirconium, which, together, help those metallic fan blades withstand the extraordinary temperatures inside the engine. Without rare earths, the blades would simply melt. Yet the amount of this stuff we mine from the ground each year is surprisingly small. According to Rob West of Thunder Said Energy, the total size of the rare earth market is roughly the same as the North American avocado market. But, says West, those numbers underplay its profound importance. \"Buyers would likely pay over 10-100x more for small but essential quantities of rare earths, if supplies were ever disrupted,\" he says. \"You cannot make long-distance fibre cables without erbium. You cannot make a gas turbine or jet engine without yttrium.\" China's dominance In short, these things matter. And that brings us to the politics. Right now, about 70% of the world's rare earth elements are mined in China. Roughly 90% of the finished products (in other words, those magnets) are made in China. China is dominant in this field in an extraordinary way. This is not, it's worth saying, for geological reasons. Contrary to what the name suggests, rare earth elements aren't all that rare. Pull a chunk of soil out of the ground and there will be trace amounts of most of them in there. True: finding concentrated ores is a bit harder, but even here, it's not as if they are all in China. There are plenty of rich rare earth ores in Brazil, India, Australia, and even the US (indeed, the Mountain Pass mine in California is where rare earth mining really began in earnest). Low cost of Chinese rare earths The main explanation for Chinese dominance is that China has simply become very good at extracting lots of rare earths at relatively low cost. According to figures from Benchmark Mineral Intelligence, the prevailing cost of Chinese rare earths is at least three times lower than the cost of similar minerals refined in Europe (to the extent that such things are available). At this point, perhaps you're wondering how China has managed to do it - to dominate global production at such low prices. Part of the explanation, says West, probably comes down to \"transfer pricing\" - in other words, China being China, refiners and producers are probably able to buy raw materials at below market prices. Another part of the explanation is that refining rare earth ores is phenomenally energy and carbon-intensive. Most European and American firms have pulled out of the sector because it is hideously dirty. Such qualms are less of an issue in China, especially since most of their mines, including the biggest of all, Bayan Obo in Inner Mongolia, are hundreds if not thousands of miles from the nearest city. Energy costs are less of a constraint in a country whose grid is still built mostly on a foundation of cheap thermal coal. Add it all up, and you end up with the situation we have today: where the vast majority of the world's rare earths, that go into all our devices, come from dirty mines in China, produced at such a low cost that device manufacturers are happy to put them anywhere. Anyway, that brings us to the politics. Global trade war flaring up again In recent months and years, China has periodically introduced controls on rare earth exports. Last week, it announced the most serious rule change yet, essentially insisting that anyone using Chinese rare earths would have to apply for a licence from them. It has been seen, in Washington at least, as a declaration of economic war, and, in response, Donald Trump has announced a fresh set of tariffs on China. In short, the global trade war seems to be flaring up all over again. Where this ends up is anyone's guess. Tim Worstall, a former scandium expert who has been in and out of the rare earths sector for decades, suspects China might have overplayed its hand. \"The end result here is that there can be two outcomes,\" he says. \"A: The entire world's usage of rare earths is mapped out in detail, end uses, end users, quantities, and times for the Chinese state and depends upon their bureaucracy to administer. \"B: The plentiful rare earths of elsewhere are dug up, and the supply chain is rebuilt outside China. \"My insistence is that B is going to be the outcome, and it'll be done, intervention or no.\" Read more from Sky News:At least 42 dead in bus crash in South AfricaDozens injured after train crash in Slovenia In practice, the new rules may simply represent an element in China's trade negotiations with the US. So it's hard to know whether they, or for that matter America's 100% extra tariffs, will ever really bite. Either way, it's yet more evidence of the rocky road the global economy remains on."
    },
    {
        "title": "Three children in hospital after pram hit by trailer",
        "description": "Three young children are in hospital after a trailer became detached from a vehicle and struck a pram while it was being pushed on the pavement in southwestern Scotland.",
        "url": "https://news.sky.com/story/three-children-in-hospital-after-pram-hit-by-trailer-13449775",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-pleasance-avenue-dumfres_7050376.jpg?20251013223848",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-13 21:28:00",
        "Headline": "Police appeal for witnesses after a trailer struck a pram in Dumfries, Scotland, injuring three young children.",
        "Content": "Three young children are in hospital after a trailer became detached from a vehicle and struck a pram while it was being pushed on the pavement in southwestern Scotland. Three children aged eight months, 14 months, and 18 months, were initially taken to Dumfries and Galloway Royal Infirmary and later transferred to the Royal Children's Hospital in Glasgow. Medical staff are currently assessing their injuries. The trailer is believed to have become detached from a Mitsubishi Outlander, which then mounted the pavement and struck the pram while it was being pushed by an 18-year-old woman. The woman was taken to hospital for treatment and was later discharged. The incident happened around 3.15pm on Monday on Pleasance Avenue in Dumfries, police said and the road remains closed while investigators examine the scene. Read more from Sky News:Vodafone internet services down for thousands of usersMan arrested over 1994 murder of 13-year-old \n                  With Reform on the rise and Labour stalling, the SNP won't need to do much to stay in power\n                 \n                  Scottish First Minister John Swinney joins call for pause on new asylum arrivals in Glasgow\n                 \n                  Murderer jailed for attacking Glasgow man with 'napalm cocktail' before stabbing him in heart\n                 Sergeant David Kerr, of Police Scotland's Road Policing Unit, said: \"Our enquiries into this incident are ongoing and we would urge anyone who have witnessed it to come forward. \"We would also be keen to speak to anyone who may have dashcam footage from the area.\" Anyone who can help is asked to call 101, quoting reference 1870 of 13 October, he said."
    },
    {
        "title": "Thousands of homes now need repairs after insulation fitted under government scheme",
        "description": "Thousands of homes fitted with insulation under a flagship government scheme now need major remedial work, or risk damp and mould, the public spending watchdog has warned.",
        "url": "https://news.sky.com/story/thousands-of-homes-now-need-repairs-after-insulation-fitted-under-government-scheme-13449541",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-insulation-wall-insulation_7050237.jpg?20251013190752",
        "type": "UK",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-10-13 14:13:00",
        "Headline": "More than 30,000 homes face damp or mould due to ill-fitted insulation, with a handful facing immediate risks like fires, a government watchdog warned. The energy department said it had plans to fix the issues at no cost to the household.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Thousands of homes fitted with insulation under a flagship government scheme now need major remedial work, or risk damp and mould, the public spending watchdog has warned. A damning report by the National Audit Office (NAO) said \"clear failures\" in the Energy Company Obligation (ECO) scheme to tackle fuel poverty and pollution had led to low quality installations and even potential fraud. It blamed incompetent subcontractors and weak monitoring and government oversight for the issues, which in extreme cases could cause fires. Fuel poverty campaigners warned the system had \"let cowboys through the front door\", saying it must be fixed to bring down energy bills and keep people warm. Almost all homes - some 98%, affecting 22,000 to 23,000 properties - fitted with external wall insulation under the ECO are affected, the NAO said. A further 29% of homes with internal wall insulation - around 9,000 to 13,000 dwellings - also face major issues that need fixing. A small percentage of homes - 6% with external insulation and 2% with internal - put people in immediate danger, such as poor ventilation that could cause carbon monoxide poisoning, and electrical safety issues that could start fires. ECO is a scheme that obliges energy companies to pay for energy efficiency measures in vulnerable households out of consumer bills. Gareth Davies, head of the NAO, said ECO is \"important to help reduce fuel poverty and meet the government's ambitions for energy efficiency\". But \"clear failures in the design and set-up\" had led to \"poor-quality installations, as well as suspected fraud\", he added. 'Gaming the system' The report says the reason things had gone so badly wrong could be down to work being subcontracted to individuals and firms who are not competent or certified, uncertainty over standards, and businesses \"cutting corners\" or \"gaming the system\". The energy regulator Ofgem last year estimated businesses had falsified claims for ECO installations in between 5,600 and 16,500 homes. That means they could have claimed between £56m and £165m from energy suppliers - ultimately paid for by bill-payers. Read more from Sky News:At least 42 killed as bus crashes on mountain roadDiscord hack shows risks of online age checks Martin McCluskey, the government minister for energy consumers, criticised the \"unacceptable, systemic failings\" that had affected thousands of families. He added: \"We are fixing the broken system the last government left by introducing comprehensive reforms to make this process clear and straightforward, and in the rare cases where things go wrong, there will be clear lines of accountability, so consumers are guaranteed to get any problems fixed quickly.\" The government urged households to take up the free audit that will be offered in a forthcoming letter, and said installers would be forced to remedy the issues free of charge. However, insulation has the potential to vastly improve homes, analysts pointed out. Jess Ralston from energy think tank ECIU said: \"The majority of households that have benefitted from insulation schemes have lower bills and warmer, healthy homes, particularly during the early years of the gas crisis when the UK's poor quality housing stock was one of the reasons we were so badly hit compared to other European countries.\" Simon Francis, co-ordinator of the End Fuel Poverty Coalition, said: \"Insulation and ventilation, when done properly, are among the safest and most effective ways to bring down energy bills and keep people warm.\" But the report had revealed a \"system that has let cowboys through the front door, leaving thousands of victims living in misery and undermining public trust\". Sue Davies, Which? head of consumer protection policy, called it \"a damning indictment of a failed scheme, where poor oversight has allowed rogue traders to cause huge damage to people's homes and lives\". She said the government must take swift action to rectify the damage, as well as ensuring \"there is no repeat of this scandal by putting in place robust consumer protections and effective oversight\"."
    },
    {
        "title": "Sir Keir Starmer has 'full confidence' in national security adviser after China spy trial collapse",
        "description": "Sir Keir Starmer has said he has \"full confidence\" in national security adviser Jonathan Powell following the collapse of the China spy trial.",
        "url": "https://news.sky.com/story/sir-keir-starmer-has-full-confidence-in-national-security-adviser-after-china-spy-trial-collapse-13449629",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer_7050270.jpg?20251013195032",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-10-13 20:25:00",
        "Headline": "The collapse of a trial against two men accused of spying for China has led to an extraordinary blame game in parliament - with the Tories accusing the government of seeking to \"curry favour\" with Beijing. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Sir Keir Starmer has said he has \"full confidence\" in national security adviser Jonathan Powell following the collapse of the China spy trial. The prime minister said the senior civil servant is doing an \"excellent job\", amid questions over whether he played a role in the case being abandoned. Christopher Cash, 30, a former parliamentary researcher, and teacher Christopher Berry, 33, were accused of spying for China - a charge they denied - but weeks before their trial was due to begin, it was suddenly dropped. The director of public prosecutions, Stephen Parkinson, has blamed ministers for failing to provide evidence that would support the assertion that China represented a threat to national security, leading to accusations of a cover-up from the Tories.  However, Downing Street blamed the Conservatives for failing to classify China as a threat while in office - when the charges were brought against the pair - and for failing to update the \"archaic\" Official Secrets Act. Asked today if he supported Mr Powell, Sir Keir told broadcasters: \"He's doing an excellent job. \"You heard what Steve Witkoff said about him today in relation to the role he's played behind the scenes [in Gaza]. So of course, I've got full confidence in him.\" \n                  Starmer and other leaders have fallen into line on Trump's Gaza plan - now it must deliver\n                 \n                  UK played 'vital role' in Gaza peace deal, says Trump aide, after minister branded 'delusional'\n                 \n                  Politics latest: Tony Blair dodges Sky News questions about Gaza peace board controversy\n                 Mr Witkoff, the US's Middle East envoy, this morning lauded \"the incredible input and tireless efforts\" of Mr Powell in helping to bring about a ceasefire. Sir Keir was speaking from Sharm el-Sheikh in Egypt, where world leaders have gathered for the Gaza peace summit. The dropped trial has sparked a political row, with Tory leader Kemi Badenoch accusing the government of deliberately collapsing the case in order to avoid angering China and losing investment into the UK - something ministers have strenuously denied. Security minister Dan Jarvis accused her of spreading \"baseless smears\" in a statement setting out the government's position in the House of Commons on Monday afternoon, as MPs returned to parliament following the party conference recess. Mr Cash, of Whitechapel, east London, and Mr Berry, of Witney, Oxfordshire, were charged in April 2024 with passing politically sensitive information to a Chinese intelligence agent between December 2021 and February 2023. Blame game continues Mr Jarvis told MPs the prosecution was \"based on the law at the time of the [alleged] offence and the policy position of the Conservative government at the time of the [alleged] offence\". He said \"every effort\" was made by the Labour government to provide evidence to proceed with the case on that basis, but the CPS was \"hamstrung\" by the Tories' failure to update the Official Secrets Act. This was the legislation under which the charges were brought, which specifies it is a crime to communicate any documents which might be useful to \"an enemy\" - language Mr Jarvis said was \"archaic in the modern threat landscape\". The Tories defined China only as a \"systemic challenge to UK security\" in 2021, and then as an \"epoch-defining challenge\" in 2023. Mr Jarvis said ministers \"cannot retrospectively\" change that, adding: \"The current government's policy position was immaterial to the assessment that was made by the CPS. \"The CPS decision to drop the case was not influenced by any member of this government, nor special adviser or senior official.\" China 'poses series of threats' Ms Badenoch doubled down on her accusations in response, saying the collapsed trial \"wasn't a mistake\". \"This looks like a deliberate decision to collapse the case and curry favour with the regime in China.\" On Labour's position on China, Mr Jarvis said: \"We fully recognise that China poses a series of threats to UK national security, yet we must also be alive to the fact that China does present us with opportunities.\" He said that requires a \"pragmatic approach to economic engagement without compromising on our national security\". Read More:The blame game over China spy trial collapse MI5 issues new guidance to MPs Another issue the row has raised is the safety of MPs - with Commons speaker Lindsey Hoyle opening Monday's debate saying he is \"angry and disappointed\" that politicians are not being adequately protected from foreign interference. MI5 has now issued new guidance to MPs, peers, councillors, candidates and parliamentary staff, warning them: \"You are a potential target.\" As well as urging vigilance at home, the advice warns that foreign intelligence services could seek to exploit politicians' overseas travel to access their data or use financial donations as a route to influence. The guidance specifically accused Russia, China and Iran of carrying out \"long-term strategic foreign interference and espionage\" but said \"other states\" could also seek to obtain information about \"the UK system\". Mr Jarvis said the guidance would \"kickstart a wider cross-government action plan.. to reduce foreign interference and espionage threats to UK democratic institutions\"."
    },
    {
        "title": "Alleged Madeleine McCann family stalker left voicemails saying 'I believe I'm really her'",
        "description": "A woman accused of stalking the parents of Madeleine McCann allegedly left voicemails asking the mother of the missing girl for a DNA test, a court heard.",
        "url": "https://news.sky.com/story/alleged-madeleine-mccann-family-stalker-left-voicemails-saying-i-believe-im-really-her-13449566",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-julia-wandelt-madeleine-mccann_7044386.jpg?20251006193949",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-13 14:57:00",
        "Headline": "Jurors heard that Julia Wandelt left Kate McCann a series of voicemails between June 2022 and February this year.",
        "Content": "A woman accused of stalking the parents of Madeleine McCann allegedly left voicemails asking the mother of the missing girl for a DNA test, a court heard. Jurors heard voicemails left by Julia Wandelt, 24, from Lubin, Poland, in which she was audibly upset. She allegedly left the messages last year, over a period of months, and at one point asked: \"What if I'm her?\" Co-defendant Karen Spragg, 61, began crying today at Leicester Crown Court and had to leave the dock when the voicemails were played. Wandelt, whose head was down while jurors were listening, was heard saying: \"I know you probably think Madeleine's dead. Well she is not. I really believe I'm her. \"Help me. Don't think Madeleine is dead. This is a chance. Please, I beg you. The police don't want to help me, they don't want to help Madeleine. It's all corrupt. \"I promise you that I will prove who I am because I know you love Madeleine.\" In another message, she said: \"You probably believe Madeleine is not alive anymore. \"What if I am her? What if there's a small chance that I'm her?\" Jurors also heard that, one night, Wandelt sent a message to Mrs McCann at 1am, saying: \"I don't understand why you don't want to do a DNA test.\" Prosecutors allege that Wandelt, a Polish national, falsely claimed she was Madeleine while stalking parents Kate and Gerry McCann by sending emails, making calls and turning up at their address between June 2022 and February this year. The court previously heard that Wandelt called and messaged Mrs McCann more than 60 times in a single day in April last year. This included alleged memories of Madeleine's abduction. Madeleine went missing during a family holiday to Praia da Luz in Portugal, in May 2007. Wandelt and Spragg, of Caerau Court Road in Caerau, Cardiff, both deny one count of stalking. The trial continues."
    },
    {
        "title": "Tommy Robinson refused to give phone pin to police as he drove his Bentley to Benidorm, court hears",
        "description": "Tommy Robinson refused to hand over his phone pin when police stopped his Bentley on the way to Benidorm, a court has heard.",
        "url": "https://news.sky.com/story/tommy-robinson-refused-to-give-phone-pin-to-police-as-he-drove-his-bentley-to-benidorm-court-hears-13449449",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-tommy-robinson_7049871.jpg?20251013123456",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-13 11:09:00",
        "Headline": "In a video on X before the hearing, Robinson said Elon Musk had \"picked up the legal bill\" for \"this absolute state persecution\".",
        "Content": "Tommy Robinson refused to hand over his phone pin when police stopped his Bentley on the way to Benidorm, a court has heard. He allegedly told officers \"Not a chance, bruv\" and said he was a journalist when they pulled him aside at the Channel Tunnel at Folkestone in July 2024. Robinson, real name Stephen Yaxley-Lennon, is accused of \"frustrating\" counter-terrorism powers by refusing to give access to the phone. He denies the charge. The right-wing political activist was flanked by security guards as he arrived at Westminster Magistrates Court for the opening of the trial on Monday. The 42-year-old faces three months in prison and/or a £2,500 fine if found guilty. Robinson had £13,000 and 1,900 euros on him when he was stopped and told police he was going to Benidorm in Spain for a few days, said prosecutor Jo Morris. \n                  Police trying to trace 11 people over disorder at 'Unite the Kingdom' march\n                 \n                  Why Tommy Robinson rally was different to any other\n                 \n                  'Minority' who attacked police at 'Unite the Kingdom' rally 'will pay a price', minister says as up to 150,000 people march in London\n                 He allegedly refused to give the pin as he claimed the phone had sensitive \"journalist material\" on it. He's said to have told police: \"It's my work, I'm a journalist,\" claiming it contained information about \"vulnerable girls\". The court heard Robinson was stopped in his silver Bentley SUV because he gave \"short, vague replies\" about what he was doing and \"made no eye contact\". PC Mitchell Thorogood told the court it was also \"unusual\" he bought tickets on the day rather than in advance and was in an expensive car not registered in his name. When police took Robinson into an interview room and demanded his phone, he allegedly told them: \"Not a chance bruv... you look like a c*** so you ain't having it.\" Officers said they recognised Robinson when they stopped him and his lawyer, Alisdair Williamson KC, suggested the stop may have been \"discriminatory\" against his political beliefs. Police can stop anyone at a UK port and hold them for six hours if they suspect they may be involved in planning or committing acts of terrorism. They are legally obliged to answer questions and must give access to their electronic devices or face a criminal charge. In a video on X before the hearing, Robinson said Elon Musk had \"picked up the legal bill\" for \"this absolute state persecution\". The case comes a month after Robinson led a huge rally in central London under the banner 'Unite the Kingdom'. The trial continues."
    },
    {
        "title": "Three children in hospital after pram hit by trailer",
        "description": "Three young children are in hospital after a trailer became detached from a vehicle and struck a pram while it was being pushed on the pavement in southwestern Scotland.",
        "url": "https://news.sky.com/story/three-children-in-hospital-after-pram-hit-by-trailer-13449775",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-pleasance-avenue-dumfres_7050376.jpg?20251013223848",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-13 21:28:00",
        "Headline": "Police appeal for witnesses after a trailer struck a pram in Dumfries, Scotland, injuring three young children.",
        "Content": "Three young children are in hospital after a trailer became detached from a vehicle and struck a pram while it was being pushed on the pavement in southwestern Scotland. Three children aged eight months, 14 months, and 18 months, were initially taken to Dumfries and Galloway Royal Infirmary and later transferred to the Royal Children's Hospital in Glasgow. Medical staff are currently assessing their injuries. The trailer is believed to have become detached from a Mitsubishi Outlander, which then mounted the pavement and struck the pram while it was being pushed by an 18-year-old woman. The woman was taken to hospital for treatment and was later discharged. The incident happened around 3.15pm on Monday on Pleasance Avenue in Dumfries, police said and the road remains closed while investigators examine the scene. Read more from Sky News:Vodafone internet services down for thousands of usersMan arrested over 1994 murder of 13-year-old \n                  With Reform on the rise and Labour stalling, the SNP won't need to do much to stay in power\n                 \n                  Scottish First Minister John Swinney joins call for pause on new asylum arrivals in Glasgow\n                 \n                  Murderer jailed for attacking Glasgow man with 'napalm cocktail' before stabbing him in heart\n                 Sergeant David Kerr, of Police Scotland's Road Policing Unit, said: \"Our enquiries into this incident are ongoing and we would urge anyone who have witnessed it to come forward. \"We would also be keen to speak to anyone who may have dashcam footage from the area.\" Anyone who can help is asked to call 101, quoting reference 1870 of 13 October, he said."
    },
    {
        "title": "Vodafone internet services down for thousands of users",
        "description": "Tens of thousands of Vodafone users are reporting problems with their internet",
        "url": "https://news.sky.com/story/vodafone-internet-services-down-for-thousands-of-users-13449569",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-vodafone-mobile_7050061.jpg?20251013162207",
        "type": "UK",
        "Author": "Mickey Carroll",
        "Date Published": "2025-10-13 15:09:00",
        "Headline": "The outages began on Monday afternoon, according to the monitoring website DownDetector, which had more than 130,000 reports of problems with Vodafone connections.",
        "Content": "\n          Science and technology reporter\n       Tens of thousands of Vodafone users are reporting problems with their internet The outages began on Monday afternoon, according to the monitoring website DownDetector, which reported more than 130,000 issues with Vodafone connections. A spokeswoman for the company said: \"We are aware of a major issue on our network currently affecting broadband, 4G and 5G services. \"We appreciate our customers' patience while we work to resolve this as soon as possible.\" The company has more than 18 million UK customers, with nearly 700,000 of those using Vodafone's home broadband connection. Vodafone users vented their frustration on social media. \"It's like Vodafone has just been wiped off the earth. Not a single thing works,\" said one X user. \n                  UK biggest phone network created as Three-Vodafone merger gets conditional approval\n                 \n                  Vodafone and Three merger could get green light, says UK's competition watchdog\n                 \n                  Tens of millions could pay more if Vodafone-Three merger goes ahead, CMA warns\n                 The Vodafone app also appeared to be down for users, with the company's website briefly going down too. The 'network status checker' on the website was also down, and when Sky News tried to test the customer helpline, it did not ring. \"There's Vodafone down and then there's Vodafone wiped off the face of the f***ing planet,\" posted another X user. Read more from Sky News:Gaza deal latest: Drones reveal devastationMadagascar president says coup under way Jake Moore, global cybersecurity advisor at ESET, said the outage shows how reliant we are on modern infrastructure like mobile networks. \"Outages will always naturally raise early suspicions of a potential cyber incident, though current evidence points more towards an internal network failure than a confirmed attack,\" said Mr Moore. \"The sudden outage, combined with the inability to access customer service lines, mirrors classic symptoms of a distributed denial-of-service (DDoS) attack, where attackers overwhelm the network so the site or systems collapse. \"However, malicious or not, this once again highlights our heavy reliance on digital infrastructure, especially in an age where we increasingly depend on mobile networks for everything,\" he said. \"Ultimately, resilience is essential, whether the cause is a direct cyberattack, a supply chain issue or a critical internal error.\""
    },
    {
        "title": "Man arrested over 1994 murder of 13-year-old Lindsay Rimer",
        "description": "A man has been arrested on suspicion of the 1994 murder of 13-year-old Lindsay Rimer.",
        "url": "https://news.sky.com/story/man-arrested-over-1994-murder-of-13-year-old-lindsay-rimer-13449502",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-lindsay-rimer-police_7049944.jpg?20251013141138",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-13 12:49:00",
        "Headline": "The man was arrested at an undisclosed prison where he is currently serving a sentence for other offences.",
        "Content": "A man has been arrested on suspicion of the 1994 murder of 13-year-old Lindsay Rimer. Police said the man was arrested at an undisclosed prison where he is serving a sentence for other offences. The man, who is being interviewed today and tomorrow, is expected to be bailed and returned to prison while enquires continue. Officers are also interviewing a number of potential witnesses in the Hebden Bridge and wider Halifax area. Lindsay left her home to buy a box of corn flakes late during the evening of 7 November, 1994, but didn't return home. Her body was then found in a canal close to her home six months later. Following today's arrest, senior investigating officer, detective chief inspector James Entwistle, said: \"We remain very firmly committed to doing everything we can to get justice for Lindsay, and to give her family the answers they still so desperately need after all these years. \"The arrest we have made today comes as a result of our continued focus on progressing the investigation. \"We are keeping Lindsay's family updated and, while we appreciate the understandable public interest that today's arrest will bring, we do not anticipate any immediate developments at this stage. \"Although it is now more than thirty years since Lindsay was murdered, we remain convinced there is someone out there who has vital information that could finally help to ease her family's pain, and we urge them do the right thing and tell us what they know.\" Anyone with further information has been urged to contact police by calling 101 quoting Operation Posemill, or sending a text or voicemail to 07707147314."
    },
    {
        "title": "'I'm a private investigator - here's how much we cost and common mistake that helps us crack cases'",
        "description": "If you've ever spent your morning commute daydreaming about starting afresh with your career, this feature is for you. Each Monday, the Money blog team speaks to someone from a different profession to discover what it's really like. This week, we chat to veteran private investigator Mike LaCorte.",
        "url": "https://news.sky.com/story/im-a-private-investigator-heres-how-much-we-cost-and-common-mistake-that-helps-us-crack-cases-13449332",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-money-wirltb-feature_7049441.jpg?20251013050356",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-13 07:17:00",
        "Headline": "Private investigator Mike LaCorte reveals how much he charges, which job won him the Investigator of the Year award and why being a detective has nothing to do with Sherlock Holmes.",
        "Content": "If you've ever spent your morning commute daydreaming about starting afresh with your career, this feature is for you. Each Monday, the Money blog team speaks to someone from a different profession to discover what it's really like. This week, we chat to veteran private investigator Mike LaCorte. Our fees vary depending on complexity, jurisdictions and objectives… A standard surveillance job might cost anywhere from £1,500-£2,500 a day. A due diligence report for a corporate merger could be £5,000-£15,000. Blackmail resolution involving travel, cyber support, and legal coordination might start at £25,000 and scale up. Longer-term retainer risk management models are where we earn the most. Here's one of my secrets for investigating... People often reuse usernames. By tracking a username across platforms, databases, and forums, you can build a surprisingly complete profile, even if the person thinks they've been discreet. Curiosity, genuine, relentless curiosity, is the single most important skill in this profession… You have to be deeply interested in people, behaviours, patterns, and anomalies. It's that instinct to ask why, to dig one layer deeper than everyone else, that often leads to the breakthrough. You can teach someone the technical elements, but curiosity, in my opinion, can't be taught. It's either part of your mindset, or it's not. Read more from our What It's Like To Be A.... series'I'm self-taught celeb photographer, can earn up to six figures for one job and work with celebrities all over the world''I've sculpted the late Queen and charge upwards of £40,000'What it's really like being a novelist There isn't one set path... I entered the industry at a time when training was scarce, so much of it was hands-on. Today, I encourage new investigators to take formal courses, join professional associations like the ABI and continually educate themselves. Reputation is everything... If you've delivered results under pressure and acted with integrity, people remember and recommend you. We don't advertise in the traditional sense. \n                  How to set your baby up to be a millionaire\n                 \n                  Location, Location, Location star Phil Spencer reveals his top tips for buying your dream home\n                 \n                  Savings guide: The accounts that will help you beat inflation\n                 Blackmail cases are increasingly common... especially in high-net-worth circles. Crypto scams and family disputes involving hidden wealth are also on the rise. Our other most common cases include... Success in my industry is often difficult to shout about… The most significant wins usually happen quietly, behind closed doors, under strict confidentiality. That said, one standout moment was being awarded Investigator of the Year by the World Association of Detectives in 2017 in Bucharest, which was a rare moment of public recognition in a very private world. The case involved a high-profile international blackmail scheme targeting an individual at extreme personal and reputational risk. We uncovered the blackmailers, neutralised the threat, and restored the client's safety and peace of mind. It was a complex operation involving digital forensics, covert surveillance, and cooperation with the UK police and is one of the most satisfying cases I've led. I've traced hidden assets across multiple jurisdictions in a contentious divorce... and exposed a romance scam that spanned two continents. I find myself deeply affected by any case involving... vulnerable individuals. Especially young people at risk, survivors of abuse, or families desperate for answers. A Canadian family reached out in absolute distress... Their daughter had travelled to the UK to meet a man she'd only known via an online chatroom. She was over 18, so the authorities weren't particularly responsive, despite growing concerns about her safety. The family feared she was being manipulated or held in a coercive environment. We stepped in, traced her location and quickly identified signs that she was in a highly vulnerable and potentially dangerous situation. Through sensitive and careful handling and liaising with the authorities, we were able to intervene, safeguard her and help facilitate a safe return. Afterwards, her family sent me a photo of them all reunited, smiling and hugging. That image is something I'll never forget. It reminds me that what we do isn't just investigative, it's personal. These aren't just cases; they're people's lives. Private investigation salaries can vary significantly… A newly qualified professional investigator might earn around £20-£30,000, often working irregular hours, subcontracting for agencies, or building up their own portfolio. Earnings can increase to more than £50,000. If you own your own agency, like I do with Conflict International, income potential becomes far greater. Running multi-jurisdictional investigations and serving high-net-worth clients or corporate entities can mean annual earnings stretching into six figures. I regularly work over 60 hours a week… Operating globally means my phone rings at all hours. When a client calls from Dubai at midnight UK time, you need to answer. It's not uncommon for me to jump on a flight the next day or manage multiple live cases across different time zones. That said, I do try to schedule three to four breaks a year, ideally somewhere quiet where I can get in lengthy cycles and switch off. But I'm never fully offline. It's a lifestyle, not a 9-to-5 job. The biggest misconception of being a private investigator is... That it is all action-packed, glamorous work, like something out of a James Bond film or a Sherlock Holmes novel. People imagine car chases, dramatic confrontations, or sitting in dark rooms connecting red string on cork boards. The reality is quite different. Most of the work is slow, deliberate, and detail-oriented. Some elements of the job match TV detectives... Like using disguises or running surveillance operations. But there's far more legal compliance, GDPR navigation, and ethical decision-making than TV ever shows. We're not vigilantes, we operate within strict legal frameworks, often under intense scrutiny. We routinely turn down work that raises red flags... Sometimes it's obvious: someone wants us to \"follow\" an ex-partner under suspicious circumstances, or they're trying to use our services to gain leverage in a personal dispute without legal cause. We've had people ask us to access private messages, hack social media accounts, or \"ruin someone's life\". There are a few things I sometimes dislike about my job... Chasing unpaid invoices is definitely one of them. We put in a huge amount of time, care, and specialist expertise into our work, often under immense pressure, so having to chase clients who go quiet once they've got what they need is not only frustrating but disheartening. But, sometimes, the hardest part is seeing the truth, knowing exactly what's happening, but being unable to act due to legal limitations, jurisdictional issues, or a client's decision not to pursue it. Despite all that, I wouldn't change what I do. But yes, like any job, it comes with its shadows."
    },
    {
        "title": "Trump warned his plan for future of Gaza 'doesn't make sense'",
        "description": "One of the most high-profile and influential Palestinian politicians has told Sky News that Donald Trump is now \"calling the shots\" for Israel - and warned it \"doesn't make sense\" to have a Western-led government ruling Gaza or the return of a \"British mandate\" under Sir Tony Blair.",
        "url": "https://news.sky.com/story/trump-warned-his-plan-for-future-of-gaza-doesnt-make-sense-13449795",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-nasser-al-qudwa-gaza_7050425.jpg?20251014011808",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-10-13 23:49:00",
        "Headline": "Nasser al-Qudwa has been tipped for a possible role in the governance of Gaza after Donald Trump led the signing of a peace agreement. But he has serious reservations about the president's plan. ",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  One of the most high-profile and influential Palestinian politicians has told Sky News that Donald Trump is now \"calling the shots\" for Israel - and warned it \"doesn't make sense\" to have a Western-led government ruling Gaza or the return of a \"British mandate\" under Sir Tony Blair. Nasser al-Qudwa, 72, insisted Hamas should be involved in the territory's future and that a new structure is needed that would allow a single authority to govern both the West Bank and Gaza. Gaza deal signed - as it happened It comes after Donald Trump hailed the signing of a peace deal in Egypt on Monday - the first phase of a plan to end the two-year Gaza war, which included the return of all 20 living Israeli hostages.  But there is much in the president's 20-point proposal for Gaza still to be made real, chiefly a \"board of peace\" to oversee the creation of a transitional authority. It would be chaired by Mr Trump, who has floated a role for former UK prime minister Sir Tony and does not want a role for Hamas. Al-Qudwa is strongly tipped for a return to the front line of politics, either within the existing Palestinian Authority or a new framework for Gaza. Since leaving his role as foreign minister for the Palestinian Authority in 2006, he has served in a variety of roles, including as a diplomat at the United Nations and as head of the Yasser Arafat Foundation. Al-Qudwa is the nephew of Arafat, ex-chairman of the Palestine Liberation Organisation, who died in 2004 aged 75. Trump's proposal 'doesn't make sense' Al-Qudwa has just been welcomed back into the central committee of Fatah, which runs the Palestinian Authority, the governing body of the West Bank. Asked how he feels about the prospect of an international body ruling Gaza, including both Mr Trump and Sir Tony, he told Sky News: \"The Palestinian people do not deserve to be put under international trusteeship or guardianship. \"And definitely it does not deserve to be put on the British mandate again. \"The whole notion that you are bringing a Western land to build a lot in Gaza after all these sacrifices and all this bloodshed, it doesn't make sense.\"  Netanyahu 'not calling the shots' Al-Qudwa is a strong advocate for a two-state solution and says the only way to stem the anger of Palestinian youths \"is to give them a better life\". Asked if he was confident Israel would observe the ceasefire and move into the second phase of the Trump plan, Al-Qudwa said: \"I don't trust anybody. \"But, to be frank with you, I don't think it's the Israeli leader that's calling the shots. \"I think it's Mr Donald Trump. And he has promised that repeatedly. \"It's going to be difficult because the second phase is going to be more difficult. But I do hope that it's going to happen because we need it to.\"  A role for Hamas Al-Qudwa wants a new unitary governing body for the West Bank and Gaza \"that is organically linked… to ensure the territorial integrity and the unity of the Palestinian people\". He said under his model, Hamas would be invited to be part of the political landscape. It would be a different form of Hamas - a political party rather than an organisation with a military wing. \"It would be a different Hamas,\" said al-Qudwa. \"What is missing from the debate is the serious, comprehensive positions. I spoke about ending the role of Hamas in Gaza, ending the control of Hamas over Gaza in all its forms, political, administrative, as well as security, which means the official body needs to have control over weapons. \"And then I think it's very right to transform into a political party and then participate in the Palestinian political life, including elections under Palestinian law enforcement.\" Despite being closely linked to a future role in Gaza, al-Qudwa, who was born in Khan Younis in the south of the strip, said you would have to be \"crazy\" to want to work in the territory now. He cast doubt over the plan to have elections within a year of the war coming to an end, saying it was impossible to imagine how you could hold such a logistically demanding event in a ruined country like Gaza. Israel's war in Gaza, launched following the killing of 1,200 people and capture of 251 more by Hamas during its October 7 attacks, has seen more than 67,000 Gazans killed, according to Palestinian health officials. Its figures don't differentiate between civilians and combatants but says around half of the victims are women and children. But al-Qudwa pointedly refused to deny speculation about his future ambitions. Asked if he would be interested in becoming the next president of the Palestinian Authority, after Mahmoud Abbas, al-Qudwa simply smiled. \"There is no vacancy,\" he said. \"That's not a no,\" I suggested. \"It's also not a yes,\" he replied."
    },
    {
        "title": "West Bank prisoner releases expose deeper wounds",
        "description": "When the bus came into view, there was a surge of expectation and a rush of people. ",
        "url": "https://news.sky.com/story/west-bank-prisoner-releases-expose-deeper-wounds-13449785",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ramallah-west-bank_7050414.jpg?20251013233530",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-10-13 22:01:00",
        "Headline": "As families gather to welcome loved ones, many are left devastated by last-minute deportations and broken expectations created by the Gaza ceasefire deal.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  When the bus came into view, there was a surge of expectation and a rush of people.  Everyone wanted to get a view, to see through the windows, to see if they could spot a familiar face, or a relative, or a friend. Gaza deal signed - as it happened These were the people being sent back to the West Bank as part of the ceasefire deal - the people exchanged for the hostages. The welcome they got was chaotic and joyful, just like previous prisoner releases. But there was something different this time - a changed, charged atmosphere and a heavier police presence. And as the minutes passed by, the sense of joy was also pockmarked by pockets of utter sadness. At first, it was a mistake. We saw a woman in floods of tears watching as prisoners filed off the two buses, showing victory signs at the waiting crowds. She had come to meet a cousin, but was sure that somehow he had been missed out and left behind. Her tears flowed until, some time later, she found him. But others were not so fortunate. Overnight, the Israeli authorities had decided to increase the number of prisoners deemed dangerous enough to be denied a return to the West Bank. Instead, this group, which makes up the majority of the 250 released prisoners, was taken to Gaza and released. Then they get the choice of whether to stay in Gaza or to be deported to another country - possibly Egypt or Turkey. It is one thing to be taken back to Gaza if you are Gazan. But for the prisoners who come from the West Bank, and who are confronted by the apocalyptic wasteland left behind by war, it is a ticket to deportation, and the knowledge they can never return to their homeland. You can only get to the West Bank by going through Israeli checkpoints or passport checks. And, clearly, having been deported, you won't be allowed back in. And so it is that we see Ghadeer in floods of tears. She is a police officer, in her uniform, and she runs back to the sanctuary of her car, to cry. 'Psychological terror' Her sister Abeer is also here, and also distraught. Their brother, who they expected to collect, has been taken to Gaza. They did not know until they got here, and realised he had not emerged from the bus. Her cousin, Yahya, is also here: \"We got a call from my cousin last night, and then we got a written warning taped on our door saying that we weren't allowed to celebrate. \"At midnight, they moved him south, and then to Gaza, all without our knowledge. We came here to see him, and we were shocked that he wasn't on the bus. \"It is part of their playbook - psychological terror, playing with our emotions, and those of the prisoners.\" To Israel, the release of these prisoners has been a cause of soul-searching, criticised by some as a reckless action that frees terrorists. But for Palestinians, these prisoners are a blend of freedom fighters and political prisoners, some of whom have spent years in detention despite never facing criminal trial. The prisoners have been told not to celebrate after their release, and these are warnings they take seriously. One man tells us: \"I can't talk, but I am happy.\" Another simply says\" \"I can't say anything today - come back tomorrow.\" Read more:UK played 'vital role' in Gaza dealDrones capture images of Gaza devastation  'They are taking our soul' But another tells us he is \"ashamed\" that it could have taken the death of so many people in Gaza to secure his release. Emotions run high. Among the crowds, we see Aman Nafa. Her husband is Nael Barghouti, who has spent 45 years in prison - more than any other Palestinian prisoner - and is now in exile in Turkey. He's banned from returning, she's banned from visiting him. I ask her about the ceasefire, and the chances of a new beginning between Israel and the Palestinians. She bristles. \"They don't want any peace with us,\" she says. \"They just want to take the land. It's like our soul - they are taking our soul. They are torturing us.\" I ask her about her emotions on a day when the focus of the world is on the return of the hostages. \"Double standards,\" she says, \"but the people around the world - they know what is happening in Palestine. We are not against Jewish people. We are against the Zionists who want to empty our land and take it.\" Acrimony, mistrust, and the fear of tomorrow are endemic among many in the West Bank. A ceasefire in Gaza has soothed some nerves, but, so far at least, it hasn't addressed the fundamental problems. And so the anxiety ripples onwards."
    },
    {
        "title": "Trump's plan has delivered a spectacular day - but has postponed harder decisions which now loom into view",
        "description": "It has been an extraordinary day of enormous emotion and high drama but, for all that, we have only witnessed the first phase of the Trump peace plan - and in many ways that is the easy bit.",
        "url": "https://news.sky.com/story/trumps-plan-has-delivered-a-spectacular-day-but-has-postponed-harder-decisions-which-now-loom-into-view-13449578",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-egypt_7050047.jpg?20251013161217",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-10-13 15:26:00",
        "Headline": "Rhetoric meets reality in Gaza as details of phase two remain unclear.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  It has been an extraordinary day of enormous emotion and high drama but, for all that, we have only witnessed the first phase of the Trump peace plan - and in many ways that is the easy bit. The first phase envisaged a ceasefire, the release of hostages, the release of many more Palestinians held in Israeli jails, a partial Israeli military withdrawal, and aid starting to flood back into Gaza. Job done, although the aid bit is still a work in progress. Trump and his team ripped up one of the golden rules of Middle Eastern negotiating to pull this off, no deal until a final deal. They have turned that on its head, pushing for a breakthrough on what can be agreed on, and then committing to sorting out the rest later. And it's worked in the sense that it has delivered a spectacular day of achievements. The catch is it has postponed the harder bits, which now loom into view. They include what happens to Hamas and whether it should be disarmed, creating a transitional authority to govern Gaza, and sending in a multinational peacekeeping force to provide security. There are plans for a \"board of peace\" to oversee everything, chaired by Donald Trump. If there is progress on all of that, the Israeli military withdrawal is committed to withdraw further back to a narrow buffer on the edges of Gaza's border. And ultimately, the hope is of continued momentum towards talks about Palestinian statehood and a \"two-state solution\". Donald Trump made it abundantly clear he believes this is only the start. This is, he said, \"the historic dawn of a new Middle East\". There seem few limits to his peacekeeping ambition.  Read more:UK played 'vital role' in Gaza peace dealDrones capture staggering images of Gaza devastation But if the diplomacy is going to fulfil on the promise of his rhetoric, there must be progress on at least the security force and the transitional government for Gaza. Because without that, the vacuum left by the retreating Israeli military could soon be filled by Hamas. It could then, in due course, rally, regroup, and at some point return to the fray. The president has gathered together an impressive coalition of countries in Sharm, on the face of it, committed to his 20-point plan. He must now harness them to give Gazans an alternative vision they can believe in. Without it, his ambitious rhetoric remains just that."
    },
    {
        "title": "'Peace in the Middle East,' declares Trump after leaders fly in to witness deal signing",
        "description": "US President Donald Trump has said the \"prayers of millions have finally been answered\" after a Gaza peace deal was signed at a global summit in Egypt.",
        "url": "https://news.sky.com/story/trump-says-prayers-of-millions-answered-as-he-hails-peace-in-the-middle-east-13449671",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-family-photo-peace-summit_7050152.jpg?20251013174006",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-13 18:45:00",
        "Headline": "Mr Trump flew to Sharm el-Sheikh from Jerusalem, where he got a rapturous welcome and at least 22 standing ovations as he addressed Israel's Knesset (parliament) - but was also heckled by some members.",
        "Content": " US President Donald Trump has said the \"prayers of millions have finally been answered\" after a Gaza peace deal was signed at a global summit in Egypt. Speaking from a podium in Sharm el-Sheikh, where other world leaders met to hold discussions on Gaza's future, Mr Trump said: \"With the historic agreement we've just signed, those prayers of millions have finally been answered.\" He added: \"We've achieved what everybody said was impossible, at long last, we have peace in the Middle East.\" Mr Trump, Egyptian President Abdel Fattah el-Sissi, Turkish President Recep Tayyip Erdogan and Qatari Emir Tamim bin Hamad Al Thani had earlier signed a document the US president said would lay the groundwork for Gaza's future. However, a copy was not made public.  Mr Trump flew to Sharm el-Sheikh from Jerusalem, where he got a rapturous welcome and at least 22 standing ovations as he addressed Israel's Knesset (parliament) - but was also heckled by some members. The US president, who was hailed by Israeli Prime Minister Benjamin Netanyahu as Israel's \"greatest friend\", said \"after so many years of unceasing war and endless danger, today the skies are calm, the guns are silent and the sirens are still\". He added: \"It's the start of a grand concord and lasting harmony for Israel and all the nations of what will soon be a truly magnificent region.\" Read more:How withdrawal of Israeli troops in Gaza could workWill the ceasefire between Israel and Hamas last? It comes after Israel and Hamas last week agreed to the first phase of a long-sought ceasefire deal aimed at bringing the devastating war in Gaza to an end after two years of bloodshed. Israel's war in Gaza, launched following the killing of 1,200 people and capture of 251 more by Hamas during its attacks on 7 October 2023, saw more than 67,000 Gazans killed, according to Palestinian health officials. Its figures do not differentiate between civilians and combatants but it says around half of those killed were women and children.  On Monday, Hamas freed all 20 living hostages, but only released the bodies of four dead hostages. As part of Mr Trump's peace deal, Hamas was given 72 hours (until 10am on Monday) to return the 48 hostages left in Gaza - 20 of whom were known to be alive and 28 who have died. Hamas previously indicated that recovering the bodies of some dead hostages may take longer, as not all burial sites are known. The Hostages and Missing Families Forum condemned Hamas's actions, calling it \"a blatant breach of the agreement\". Prime Minister Sir Keir Starmer attended the ceremony in Sharm el-Sheikh alongside other world leaders, including Italy's Giorgia Meloni and France's Emmanuel Macron. He said the UK could play a key role in monitoring the ceasefire. Sir Keir said: \"What happens tomorrow really matters, and that's why, what I've been discussing with leaders all day is, what part can we play? \"And we, the United Kingdom in particular, I think, can play a part in monitoring the ceasefire, but also decommissioning the capability of Hamas and their weaponry drawing on our experience in Northern Ireland. \"So the question today has already moved to, how do we implement how do we make sure this moves forward? It's really important we keep that focus. We mustn't have any missteps now.\""
    },
    {
        "title": "Chants of frustration turn into songs of celebration in Tel Aviv as crowds greet hostages",
        "description": "For two years, they have gathered in Hostages Square - parents, brothers, sisters, extended family and friends clutching photographs and signs reading \"bring them home\".",
        "url": "https://news.sky.com/story/chants-of-frustration-turn-into-songs-of-celebration-in-tel-aviv-as-crowds-greet-hostages-13449512",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-gaza-tel-aviv-israel_7049473.jpg?20251013054656",
        "type": "World",
        "Author": "Alex Rossi",
        "Date Published": "2025-10-13 13:02:00",
        "Headline": "Tens of thousands of people packed into an area of Tel Aviv to witness a moment many feared might never come - the homecoming of the remaining hostages.",
        "Content": "\n          International correspondent\n              @alexrossiSKY\n  For two years, they have gathered in Hostages Square - parents, brothers, sisters, extended family and friends clutching photographs and signs reading \"bring them home\". They have campaigned, protested and prayed for the return of loved ones taken in the 7 October attacks. But now the mood has shifted. The chants of frustration have turned into songs of celebration.  The tears that once fell in despair are now tears of relief. The square, normally a site of weekly demonstrations, has transformed into a sea of flags. Gaza: Follow the latest updates We watched as tens of thousands packed into this area of Tel Aviv to witness a moment many feared might never come - the homecoming of the remaining hostages. Every few minutes, the massive video screens behind the stage beamed new images - exhausted but smiling hostages embracing their families. Each clip is met with a roar of applause - the atmosphere is one of sheer elation, it is electric. When helicopters pass overhead, ferrying freed captives to nearby hospitals, the crowd erupts again and again, looking upwards to the sky in awe at the impossible that's now been made possible. The sense of catharsis here is palpable - at last some closure after a nightmare two years and a chance for the healing process of a nation to begin. But beneath the jubilation, there's a deep well of sorrow - and reckoning. The 7 October massacre was the deadliest single-day attack on Israel since the nation's founding in 1948 - an event that upended the country's sense of safety and unity. More than 1,000 were killed that day, and hundreds were taken into Gaza.  For the families who never stopped fighting for their return, this is both an ending and a beginning. Now that the living hostages are home, attention turns to those who did not survive. Officials say the process of identifying and repatriating remains will take time - and for some families, closure still remains heartbreakingly out of reach. But the questions that linger extend far beyond grief. Read more:Drones capture staggering images of Gaza devastationHostages released under Gaza ceasefire deal  In the days and weeks ahead, the Israeli government faces intense scrutiny. How could the country's fabled intelligence and defence apparatus fail so catastrophically? And what accountability, if any, will fall on Prime Minister Benjamin Netanyahu, who has faced mounting criticism over both the failures leading up to the attack and the protracted efforts to secure the hostages' release? This is a nation rejoicing, but also searching for answers. For now, though, the families in this square are holding tight to one immutable positive - after more than two long years, the living hostages, at least, are finally home."
    },
    {
        "title": "Dozens of released Palestinian prisoners are aged between 16 and 20, new data shows",
        "description": "Dozens of the Palestinian prisoners released on Monday are aged between 16 and 20, with at least two in their 70s, new data shows.",
        "url": "https://news.sky.com/story/dozens-of-released-palestinian-prisoners-are-aged-between-16-and-20-new-data-shows-13449678",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hostages-palestine_7050286.jpg?20251013200542",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-13 18:56:00",
        "Headline": "The first of 1,968 released prisoners arrived on Monday in the West Bank and the Gaza Strip.",
        "Content": " Dozens of the Palestinian prisoners released on Monday are aged between 16 and 20, with at least two in their 70s, new data shows. Buses carrying the freed prisoners arrived in the West Bank and the Gaza Strip. They are the first of 1,968 prisoners released by Israel after a ceasefire deal was struck with Hamas. New data assessed by Sky News, from Palestinian Authorities, has revealed the age range of those released. Of the 1,718 arrested after the war began, it shows two are in their 70s, 20 in their 60s, 67 in their 50s and 226 in their 40s. Three hundred and 83 are in their 30s, 383 in their 20s and 40 are aged between 16 and 20. At least five of those released have birthdays on Monday. There are also 250 Palestinians who were serving life sentences, long sentences or expected to be sentenced to life imprisonment. Of these, 157 belonged to Fatah, 65 to Hamas, 16 to Islamic Jihad, 11 to Popular Front and one to Democratic Front. Three were arrested in the 1980s, with the most recent arrest on 11 March. At least 154 of the Palestinians will be deported to Egypt from the West Bank as part of the deal. Many are members of Hamas and the Fatah faction, who were imprisoned over shootings, bombings or other attacks that killed or attempted to kill Israelis, along with others convicted on lesser charges. They will return to the West Bank, Gaza or be deported elsewhere. It follows the agreement of a new peace plan struck between Israel and Hamas following more than two years of war. As part of the deal, 20 Israeli hostages held by Hamas were released. Coffins of dead hostages were also handed over. US President Donald Trump, who signed the agreement on Monday, told Israel's parliament: \"The skies are calm, the guns are silent, the sirens are still and the sun rises on a Holy Land that is finally at peace.\""
    },
    {
        "title": "Got a pair of these? There's more to them than meets the eye - and it may mean global trade war",
        "description": "For most of human history, no one paid all that much attention to the 17 rare earth elements. ",
        "url": "https://news.sky.com/story/got-a-pair-of-these-theres-more-to-them-than-meets-the-eye-and-it-may-mean-global-trade-war-13449786",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-apple-airpods_7050429.jpg?20251014025929",
        "type": "World",
        "Author": "Ed Conway",
        "Date Published": "2025-10-13 22:02:00",
        "Headline": "Right now, about 70% of the world's rare earth elements - key to everything from AirPods to cars - are mined in China, which announced last week that anyone using Chinese rare earths would have to apply for a licence. This has been seen as a declaration of economic war in Washington.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  For most of human history, no one paid all that much attention to the 17 rare earth elements.  An obscure suite of elements that sit in their own corner of the periodic table, they were mostly renowned among chemists and geologists for being tricky and fiddly - incredibly hard to refine, but with chemical facets that made them, well… interesting. Not so much for a single thing they did by themselves, but for what they did in conjunction with other elements. Added to alloys, rare earths can make them stronger, more ductile, more heat-resistant, and so on. Think of them as a sort of metallic condiment: a seasoning you add to other substances to make them stronger, harder, better. The best example is probably neodymium. On its own, there's nothing especially spectacular about this rare earth element. But add it to iron and boron, and you end up with the strongest magnets in the world. Neodymium iron boron magnets are everywhere. If you have a pair of headphones or earbuds, the speakers inside them (\"drivers\" is the technical term) are driven by these rare earth magnets. If you have a pair of Apple AirPods, those magnets aren't just in the speakers; they're what's responsible for the satisfying \"click\" when the case snaps shut. Rare earth magnets are in your car: in the little motors that raise and lower the windows, inside the functioning of the airbag and the seat adjustment mechanism. And not just the little things. Most electric vehicles use rare-earth magnets in their motors, enabling them to accelerate more efficiently than the old all-copper ones. More sensitively, from the perspective of Western governments, in the military, there are tonnes of rare earths to be found in submarines, in fighter jets, in tanks and frigates. Much of this is in the form of magnets, but some is in the form of specialised alloys. So, for instance, there is no making a modern jet engine without yttrium and zirconium, which, together, help those metallic fan blades withstand the extraordinary temperatures inside the engine. Without rare earths, the blades would simply melt. Yet the amount of this stuff we mine from the ground each year is surprisingly small. According to Rob West of Thunder Said Energy, the total size of the rare earth market is roughly the same as the North American avocado market. But, says West, those numbers underplay its profound importance. \"Buyers would likely pay over 10-100x more for small but essential quantities of rare earths, if supplies were ever disrupted,\" he says. \"You cannot make long-distance fibre cables without erbium. You cannot make a gas turbine or jet engine without yttrium.\" China's dominance In short, these things matter. And that brings us to the politics. Right now, about 70% of the world's rare earth elements are mined in China. Roughly 90% of the finished products (in other words, those magnets) are made in China. China is dominant in this field in an extraordinary way. This is not, it's worth saying, for geological reasons. Contrary to what the name suggests, rare earth elements aren't all that rare. Pull a chunk of soil out of the ground and there will be trace amounts of most of them in there. True: finding concentrated ores is a bit harder, but even here, it's not as if they are all in China. There are plenty of rich rare earth ores in Brazil, India, Australia, and even the US (indeed, the Mountain Pass mine in California is where rare earth mining really began in earnest). Low cost of Chinese rare earths The main explanation for Chinese dominance is that China has simply become very good at extracting lots of rare earths at relatively low cost. According to figures from Benchmark Mineral Intelligence, the prevailing cost of Chinese rare earths is at least three times lower than the cost of similar minerals refined in Europe (to the extent that such things are available). At this point, perhaps you're wondering how China has managed to do it - to dominate global production at such low prices. Part of the explanation, says West, probably comes down to \"transfer pricing\" - in other words, China being China, refiners and producers are probably able to buy raw materials at below market prices. Another part of the explanation is that refining rare earth ores is phenomenally energy and carbon-intensive. Most European and American firms have pulled out of the sector because it is hideously dirty. Such qualms are less of an issue in China, especially since most of their mines, including the biggest of all, Bayan Obo in Inner Mongolia, are hundreds if not thousands of miles from the nearest city. Energy costs are less of a constraint in a country whose grid is still built mostly on a foundation of cheap thermal coal. Add it all up, and you end up with the situation we have today: where the vast majority of the world's rare earths, that go into all our devices, come from dirty mines in China, produced at such a low cost that device manufacturers are happy to put them anywhere. Anyway, that brings us to the politics. Global trade war flaring up again In recent months and years, China has periodically introduced controls on rare earth exports. Last week, it announced the most serious rule change yet, essentially insisting that anyone using Chinese rare earths would have to apply for a licence from them. It has been seen, in Washington at least, as a declaration of economic war, and, in response, Donald Trump has announced a fresh set of tariffs on China. In short, the global trade war seems to be flaring up all over again. Where this ends up is anyone's guess. Tim Worstall, a former scandium expert who has been in and out of the rare earths sector for decades, suspects China might have overplayed its hand. \"The end result here is that there can be two outcomes,\" he says. \"A: The entire world's usage of rare earths is mapped out in detail, end uses, end users, quantities, and times for the Chinese state and depends upon their bureaucracy to administer. \"B: The plentiful rare earths of elsewhere are dug up, and the supply chain is rebuilt outside China. \"My insistence is that B is going to be the outcome, and it'll be done, intervention or no.\" Read more from Sky News:At least 42 dead in bus crash in South AfricaDozens injured after train crash in Slovenia In practice, the new rules may simply represent an element in China's trade negotiations with the US. So it's hard to know whether they, or for that matter America's 100% extra tariffs, will ever really bite. Either way, it's yet more evidence of the rocky road the global economy remains on."
    },
    {
        "title": "Trump in Israel for hostages return ahead of Egypt peace summit",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈&#160; </a>",
        "url": "https://news.sky.com/story/trump-in-israel-for-hostages-return-ahead-of-egypt-peace-summit-13449276",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump100-100_7029094.jpg?20250923092054",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-13 01:53:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈   The world turns to the Middle East as hostages held by Hamas are returned to their families in Israel on Monday after over two years in captivity. Thousands of Palestinian prisoners will also be released from Israeli prisons in exchange. Mark Stone is in Sharm el Sheikh, Egypt, and Dominic Waghorn is in Jerusalem, Israel, as President Trump flies first to Israel to speak at the Israeli Parliament and celebrate the return of the hostages, before he flies to the Sinai Peninsula. Dozens of world leaders will follow him to Sharm el Sheikh to witness a peace summit that many hope is the start of true peace in the Middle East. You can also watch all episodes on our YouTube channel. Email us on trump100@sky.uk with your comments and questions."
    },
    {
        "title": "Got a pair of these? There's more to them than meets the eye - and it may mean global trade war",
        "description": "For most of human history, no one paid all that much attention to the 17 rare earth elements. ",
        "url": "https://news.sky.com/story/got-a-pair-of-these-theres-more-to-them-than-meets-the-eye-and-it-may-mean-global-trade-war-13449786",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-apple-airpods_7050429.jpg?20251014025929",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-10-13 22:02:00",
        "Headline": "Right now, about 70% of the world's rare earth elements - key to everything from AirPods to cars - are mined in China, which announced last week that anyone using Chinese rare earths would have to apply for a licence. This has been seen as a declaration of economic war in Washington.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  For most of human history, no one paid all that much attention to the 17 rare earth elements.  An obscure suite of elements that sit in their own corner of the periodic table, they were mostly renowned among chemists and geologists for being tricky and fiddly - incredibly hard to refine, but with chemical facets that made them, well… interesting. Not so much for a single thing they did by themselves, but for what they did in conjunction with other elements. Added to alloys, rare earths can make them stronger, more ductile, more heat-resistant, and so on. Think of them as a sort of metallic condiment: a seasoning you add to other substances to make them stronger, harder, better. The best example is probably neodymium. On its own, there's nothing especially spectacular about this rare earth element. But add it to iron and boron, and you end up with the strongest magnets in the world. Neodymium iron boron magnets are everywhere. If you have a pair of headphones or earbuds, the speakers inside them (\"drivers\" is the technical term) are driven by these rare earth magnets. If you have a pair of Apple AirPods, those magnets aren't just in the speakers; they're what's responsible for the satisfying \"click\" when the case snaps shut. Rare earth magnets are in your car: in the little motors that raise and lower the windows, inside the functioning of the airbag and the seat adjustment mechanism. And not just the little things. Most electric vehicles use rare-earth magnets in their motors, enabling them to accelerate more efficiently than the old all-copper ones. More sensitively, from the perspective of Western governments, in the military, there are tonnes of rare earths to be found in submarines, in fighter jets, in tanks and frigates. Much of this is in the form of magnets, but some is in the form of specialised alloys. So, for instance, there is no making a modern jet engine without yttrium and zirconium, which, together, help those metallic fan blades withstand the extraordinary temperatures inside the engine. Without rare earths, the blades would simply melt. Yet the amount of this stuff we mine from the ground each year is surprisingly small. According to Rob West of Thunder Said Energy, the total size of the rare earth market is roughly the same as the North American avocado market. But, says West, those numbers underplay its profound importance. \"Buyers would likely pay over 10-100x more for small but essential quantities of rare earths, if supplies were ever disrupted,\" he says. \"You cannot make long-distance fibre cables without erbium. You cannot make a gas turbine or jet engine without yttrium.\" China's dominance In short, these things matter. And that brings us to the politics. Right now, about 70% of the world's rare earth elements are mined in China. Roughly 90% of the finished products (in other words, those magnets) are made in China. China is dominant in this field in an extraordinary way. This is not, it's worth saying, for geological reasons. Contrary to what the name suggests, rare earth elements aren't all that rare. Pull a chunk of soil out of the ground and there will be trace amounts of most of them in there. True: finding concentrated ores is a bit harder, but even here, it's not as if they are all in China. There are plenty of rich rare earth ores in Brazil, India, Australia, and even the US (indeed, the Mountain Pass mine in California is where rare earth mining really began in earnest). Low cost of Chinese rare earths The main explanation for Chinese dominance is that China has simply become very good at extracting lots of rare earths at relatively low cost. According to figures from Benchmark Mineral Intelligence, the prevailing cost of Chinese rare earths is at least three times lower than the cost of similar minerals refined in Europe (to the extent that such things are available). At this point, perhaps you're wondering how China has managed to do it - to dominate global production at such low prices. Part of the explanation, says West, probably comes down to \"transfer pricing\" - in other words, China being China, refiners and producers are probably able to buy raw materials at below market prices. Another part of the explanation is that refining rare earth ores is phenomenally energy and carbon-intensive. Most European and American firms have pulled out of the sector because it is hideously dirty. Such qualms are less of an issue in China, especially since most of their mines, including the biggest of all, Bayan Obo in Inner Mongolia, are hundreds if not thousands of miles from the nearest city. Energy costs are less of a constraint in a country whose grid is still built mostly on a foundation of cheap thermal coal. Add it all up, and you end up with the situation we have today: where the vast majority of the world's rare earths, that go into all our devices, come from dirty mines in China, produced at such a low cost that device manufacturers are happy to put them anywhere. Anyway, that brings us to the politics. Global trade war flaring up again In recent months and years, China has periodically introduced controls on rare earth exports. Last week, it announced the most serious rule change yet, essentially insisting that anyone using Chinese rare earths would have to apply for a licence from them. It has been seen, in Washington at least, as a declaration of economic war, and, in response, Donald Trump has announced a fresh set of tariffs on China. In short, the global trade war seems to be flaring up all over again. Where this ends up is anyone's guess. Tim Worstall, a former scandium expert who has been in and out of the rare earths sector for decades, suspects China might have overplayed its hand. \"The end result here is that there can be two outcomes,\" he says. \"A: The entire world's usage of rare earths is mapped out in detail, end uses, end users, quantities, and times for the Chinese state and depends upon their bureaucracy to administer. \"B: The plentiful rare earths of elsewhere are dug up, and the supply chain is rebuilt outside China. \"My insistence is that B is going to be the outcome, and it'll be done, intervention or no.\" Read more from Sky News:At least 42 dead in bus crash in South AfricaDozens injured after train crash in Slovenia In practice, the new rules may simply represent an element in China's trade negotiations with the US. So it's hard to know whether they, or for that matter America's 100% extra tariffs, will ever really bite. Either way, it's yet more evidence of the rocky road the global economy remains on."
    },
    {
        "title": "Thousands of homes now need repairs after insulation fitted under government scheme",
        "description": "Thousands of homes fitted with insulation under a flagship government scheme now need major remedial work, or risk damp and mould, the public spending watchdog has warned.",
        "url": "https://news.sky.com/story/thousands-of-homes-now-need-repairs-after-insulation-fitted-under-government-scheme-13449541",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-insulation-wall-insulation_7050237.jpg?20251013190752",
        "type": "Business",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-10-13 14:13:00",
        "Headline": "More than 30,000 homes face damp or mould due to ill-fitted insulation, with a handful facing immediate risks like fires, a government watchdog warned. The energy department said it had plans to fix the issues at no cost to the household.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Thousands of homes fitted with insulation under a flagship government scheme now need major remedial work, or risk damp and mould, the public spending watchdog has warned. A damning report by the National Audit Office (NAO) said \"clear failures\" in the Energy Company Obligation (ECO) scheme to tackle fuel poverty and pollution had led to low quality installations and even potential fraud. It blamed incompetent subcontractors and weak monitoring and government oversight for the issues, which in extreme cases could cause fires. Fuel poverty campaigners warned the system had \"let cowboys through the front door\", saying it must be fixed to bring down energy bills and keep people warm. Almost all homes - some 98%, affecting 22,000 to 23,000 properties - fitted with external wall insulation under the ECO are affected, the NAO said. A further 29% of homes with internal wall insulation - around 9,000 to 13,000 dwellings - also face major issues that need fixing. A small percentage of homes - 6% with external insulation and 2% with internal - put people in immediate danger, such as poor ventilation that could cause carbon monoxide poisoning, and electrical safety issues that could start fires. ECO is a scheme that obliges energy companies to pay for energy efficiency measures in vulnerable households out of consumer bills. Gareth Davies, head of the NAO, said ECO is \"important to help reduce fuel poverty and meet the government's ambitions for energy efficiency\". But \"clear failures in the design and set-up\" had led to \"poor-quality installations, as well as suspected fraud\", he added. 'Gaming the system' The report says the reason things had gone so badly wrong could be down to work being subcontracted to individuals and firms who are not competent or certified, uncertainty over standards, and businesses \"cutting corners\" or \"gaming the system\". The energy regulator Ofgem last year estimated businesses had falsified claims for ECO installations in between 5,600 and 16,500 homes. That means they could have claimed between £56m and £165m from energy suppliers - ultimately paid for by bill-payers. Read more from Sky News:At least 42 killed as bus crashes on mountain roadDiscord hack shows risks of online age checks Martin McCluskey, the government minister for energy consumers, criticised the \"unacceptable, systemic failings\" that had affected thousands of families. He added: \"We are fixing the broken system the last government left by introducing comprehensive reforms to make this process clear and straightforward, and in the rare cases where things go wrong, there will be clear lines of accountability, so consumers are guaranteed to get any problems fixed quickly.\" The government urged households to take up the free audit that will be offered in a forthcoming letter, and said installers would be forced to remedy the issues free of charge. However, insulation has the potential to vastly improve homes, analysts pointed out. Jess Ralston from energy think tank ECIU said: \"The majority of households that have benefitted from insulation schemes have lower bills and warmer, healthy homes, particularly during the early years of the gas crisis when the UK's poor quality housing stock was one of the reasons we were so badly hit compared to other European countries.\" Simon Francis, co-ordinator of the End Fuel Poverty Coalition, said: \"Insulation and ventilation, when done properly, are among the safest and most effective ways to bring down energy bills and keep people warm.\" But the report had revealed a \"system that has let cowboys through the front door, leaving thousands of victims living in misery and undermining public trust\". Sue Davies, Which? head of consumer protection policy, called it \"a damning indictment of a failed scheme, where poor oversight has allowed rogue traders to cause huge damage to people's homes and lives\". She said the government must take swift action to rectify the damage, as well as ensuring \"there is no repeat of this scandal by putting in place robust consumer protections and effective oversight\"."
    },
    {
        "title": "Vodafone internet services down for thousands of users",
        "description": "Tens of thousands of Vodafone users are reporting problems with their internet",
        "url": "https://news.sky.com/story/vodafone-internet-services-down-for-thousands-of-users-13449569",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-vodafone-mobile_7050061.jpg?20251013162207",
        "type": "Business",
        "Author": "Mickey Carroll",
        "Date Published": "2025-10-13 15:09:00",
        "Headline": "The outages began on Monday afternoon, according to the monitoring website DownDetector, which had more than 130,000 reports of problems with Vodafone connections.",
        "Content": "\n          Science and technology reporter\n       Tens of thousands of Vodafone users are reporting problems with their internet The outages began on Monday afternoon, according to the monitoring website DownDetector, which reported more than 130,000 issues with Vodafone connections. A spokeswoman for the company said: \"We are aware of a major issue on our network currently affecting broadband, 4G and 5G services. \"We appreciate our customers' patience while we work to resolve this as soon as possible.\" The company has more than 18 million UK customers, with nearly 700,000 of those using Vodafone's home broadband connection. Vodafone users vented their frustration on social media. \"It's like Vodafone has just been wiped off the earth. Not a single thing works,\" said one X user. \n                  UK biggest phone network created as Three-Vodafone merger gets conditional approval\n                 \n                  Vodafone and Three merger could get green light, says UK's competition watchdog\n                 \n                  Tens of millions could pay more if Vodafone-Three merger goes ahead, CMA warns\n                 The Vodafone app also appeared to be down for users, with the company's website briefly going down too. The 'network status checker' on the website was also down, and when Sky News tried to test the customer helpline, it did not ring. \"There's Vodafone down and then there's Vodafone wiped off the face of the f***ing planet,\" posted another X user. Read more from Sky News:Gaza deal latest: Drones reveal devastationMadagascar president says coup under way Jake Moore, global cybersecurity advisor at ESET, said the outage shows how reliant we are on modern infrastructure like mobile networks. \"Outages will always naturally raise early suspicions of a potential cyber incident, though current evidence points more towards an internal network failure than a confirmed attack,\" said Mr Moore. \"The sudden outage, combined with the inability to access customer service lines, mirrors classic symptoms of a distributed denial-of-service (DDoS) attack, where attackers overwhelm the network so the site or systems collapse. \"However, malicious or not, this once again highlights our heavy reliance on digital infrastructure, especially in an age where we increasingly depend on mobile networks for everything,\" he said. \"Ultimately, resilience is essential, whether the cause is a direct cyberattack, a supply chain issue or a critical internal error.\""
    },
    {
        "title": "Lloyds estimates £1.95bn hit from motor finance scandal",
        "description": "Lloyds Banking Group has set aside a further &#163;800m to cover estimated costs associated with the car finance mis-selling scandal.",
        "url": "https://news.sky.com/story/lloyds-estimates-163195bn-hit-from-motor-finance-scandal-13449311",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-car-finance_6981997.jpg?20250803173726",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-10-13 06:05:00",
        "Headline": "The bank says its provision has been raised despite concerns over several elements of the FCA's compensation scheme proposals.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n  Lloyds Banking Group has set aside a further £800m to cover estimated costs associated with the car finance mis-selling scandal. The bank said the sum took its total provision to £1.95bn. It had been assessing the impact since the Financial Conduct Authority (FCA) revealed last week it was consulting on a compensation scheme, with up to 14.2 million car finance agreements potentially eligible for payouts. The regulator had previously found that many lenders failed to disclose commission paid to brokers, which could have led to customers paying more than they should have between April 2007 and November 2024. Money latest: How much a private investigator costs Eligible customers could receive an average of £700 each under the proposals. Lloyds said on Monday that it would be contributing to the consultation to argue a number of points. \n                  Got a pair of these? There's more to them than meets the eye - and it may mean global trade war\n                 \n                  Thousands of homes now need repairs after insulation fitted under government scheme\n                 \n                  Vodafone internet services down for thousands of users\n                 It said: \"The Group remains committed to ensuring customers receive appropriate redress where they suffered loss, however the Group does not believe that the proposed redress methodology outlined in the consultation document reflects the actual loss to the customer. Nor does it meet the objective of ensuring that consumers are compensated proportionately and reasonably where harm has been demonstrated. \"In addition, the approach to unfairness in the redress scheme does not align with the legal clarity provided by the recent Supreme Court judgment in Johnson, in which unfairness was assessed on a fact specific basis and against a non-exhaustive list of multiple factors. The Group will make representations to the FCA accordingly.\"  Shares in Lloyds, which fell last week when the bank warned of a potential \"material\" increase in its provisions, gained more than 0.5% on Monday. The estimated compensation figure came in below the sum some financial analysts had predicted. The shares remain more 50% up in the year to date. Another listed lender exposed to car loan mis-selling is also expected to raise the amount it has set aside. Close Brothers, which has a £165m provision currently, saw its shares tumble 7% when it admitted an increase was likely once its analysis of the compensation consultation documents was completed. Car finance makes up approximately a quarter of its total loan book."
    },
    {
        "title": "Goldman chief delivers warning to Reeves over bank tax hikes",
        "description": "The boss of Goldman Sachs has urged Rachel Reeves not to increase the financial burden on the banking sector amid industry concerns that it will be targeted for steep tax hikes in next month's budget.",
        "url": "https://news.sky.com/story/goldman-chief-delivers-warning-to-reeves-over-bank-tax-hikes-13449489",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-david-solomon-goldman_6970911.jpg?20250722162420",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-13 12:08:00",
        "Headline": "David Solomon urged the chancellor during a private meeting last week not to hit the industry with savage tax rises in her crucial budget statement next month, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The boss of Goldman Sachs has urged Rachel Reeves not to increase the financial burden on the banking sector amid industry concerns that it will be targeted for steep tax hikes in next month's budget. Sky News has learnt that David Solomon delivered the warning in a private meeting with the chancellor last week, when he is said to have told her that hitting banks with higher taxes would be damaging to Britain's wider economic growth prospects. The meeting came seven weeks ahead of a crucial Budget for the Labour government, which is racing to find ways to plug a fiscal hole estimated at between £20bn and £30bn. Goldman Sachs disclosed in its latest annual earnings statement that it paid more than $529m of corporation tax in the UK last year. Money latest: Pension budget rumours prompt 'erratic behaviour' It reported nearly $4.3bn of profit on revenues of $10.7bn in Britain in 2024. The Wall Street giant employs roughly 3,500 people in Britain. \n                  Got a pair of these? There's more to them than meets the eye - and it may mean global trade war\n                 \n                  Thousands of homes now need repairs after insulation fitted under government scheme\n                 \n                  Vodafone internet services down for thousands of users\n                 Because of its size, Goldman is liable to pay the UK Bank Levy, which is effectively a tax on its British balance sheet and liabilities. It also pays the 3% corporation tax surcharge levied on all banks registering profits of more than £100m. The surcharge was introduced in 2016 at a rate of 8%, before being cut to 3% seven years later. Major UK and international banks have been lobbying in recent weeks against a reversal of that reduction. The banking industry is vulnerable to being hit with additional taxes next month both because of the size of the fiscal challenge facing Ms Reeves and the fact that the sector is generating some of its biggest profits since the 2008 financial crisis. Mr Solomon's plea to the chancellor last week is not the first time this year that he has raised the implications of a rising UK tax burden. In an interview with Sky News presenter Wilfred Frost earlier this year, he said that London's status as one of the world's leading financial centres was \"fragile\". \"London continues to be an important financial centre, but because of Brexit, because of the way the world's evolving, the talent that was more centred here is more mobile,\" he said in July. \"We as a firm have many more people on the continent. \"Policy matters, incentives matter.\" Mr Solomon added that he had been \"encouraged by some of what the current government is talking about in terms of supporting business and trying to support a more growth-oriented agenda\". \"But if you don't set a policy that keeps talent here, that encourages capital formation here, I think over time you risk that.\" The Treasury did not provide an official readout of last week's discussion between Ms Reeves and Mr Solomon, but did say in relation to a separate meeting she held with Jamie Dimon, the JP Morgan chairman and chief executive, that he had previously welcomed financial services sector reforms in the UK. Spokespeople for Goldman Sachs and the Treasury both declined to comment."
    },
    {
        "title": "Dieselgate: Five carmakers go on trial in UK",
        "description": "Five major car brands have gone on trial in the UK over so-called dieselgate.",
        "url": "https://news.sky.com/story/dieselgate-five-carmakers-go-on-trial-in-uk-13449368",
        "image_url": "https://e3.365dm.com/21/05/1920x1080/skynews-petrol-diesel-car-emissions_5386663.jpg?20210518215534",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-13 08:44:00",
        "Headline": "The class action beginning at the High Court today could yet be expanded to include 1.8 million customers of 14 car brands, one law firm involved in the case says.",
        "Content": "Five major car brands have gone on trial in the UK over so-called dieselgate. The class action lawsuit, involving 850,000 drivers, is being heard at the High Court. It's been 10 years since dieselgate first came to light. Money latest: Pension budget rumours prompt 'erratic behaviour' That was the scandal which engulfed the Volkswagen group, later costing the company about £30bn in fines and compensation. It was revealed in 2015 that the German carmaker had fitted so-called defeat devices to most diesel models - software that would give a false, low reading when the vehicles were undergoing emissions testing. The bulk of VW's bill was paid out in the United States, where it was claimed that vehicles were emitting up to 40 times the legal limit of nitrogen dioxide when out on the road. \n                  Got a pair of these? There's more to them than meets the eye - and it may mean global trade war\n                 \n                  Thousands of homes now need repairs after insulation fitted under government scheme\n                 \n                  Vodafone internet services down for thousands of users\n                 Here in the UK, Volkswagen settled claims for a £193m total payout to 91,000 owners in May 2022.  The next stage of dieselgate-related legal action is expected to last three months at the High Court, with judgment tipped to be reserved to a later date in mid-2026. Owners of diesel vehicles made by Mercedes-Benz, Ford, Nissan, Renault and Stellantis - which owns Peugeot and Citroen - claim the companies, like VW, used unlawful software to ensure emissions were kept within legal limits during testing. They argue those limits were far exceeded during normal on-the-road use. The case will focus on a small sample of diesel vehicles produced by the five manufacturers. One of the lead solicitors' firms handling the claims, Leigh Day, said the class action was unprecedented in scale for the legal system in England and Wales, and could eventually take in up to 1.8 million people if expanded to the 14 brands it believes cheated testing regimes. The law firm says in that event, the case could be worth up to £6bn. The carmakers deny the allegations."
    },
    {
        "title": "Argentex founder secures Macquarie backing for new venture",
        "description": "The founder of Argentex Group, the foreign exchange group which collapsed this year amid market turmoil triggered by US President Donald Trump's tariffs regime, has secured backing from Australia's most powerful financial group for his latest venture.",
        "url": "https://news.sky.com/story/argentex-founder-secures-macquarie-backing-for-new-venture-13449476",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-euro-dollar-pound_6298824.jpg?20230926142720",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-13 11:47:00",
        "Headline": "Harry Adams, founder of the London-listed FX platform which collapsed this year amid tariff-induced market volatility, has secured backing for Tenora from the Australian financial giant, Sky News learns. ",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The founder of Argentex Group, the foreign exchange group which collapsed this year amid market turmoil triggered by US President Donald Trump's tariffs regime, has secured backing from Australia's most powerful financial group for his latest venture. Sky News has learnt that Macquarie's Commodities and Global Markets group has taken a minority stake in Tenora, an FX technology platform. Tenora was established earlier this year by Harry Adams, who left Argentex in the autumn of 2023. Money latest: Pension budget rumours prompt 'erratic behaviour' Its collapse during the summer came as its management team attempted to secure emergency funding through a sale that was ultimately stymied by regulatory delays. Macquarie's investment in Tenora, which values the start-up at £15m, allows the Australian financial giant to appoint two directors to its board. Tenora has been set up to offer business clients tools to manage their FX risk - which is especially valuable during periods of extreme market volatility. \n                  Got a pair of these? There's more to them than meets the eye - and it may mean global trade war\n                 \n                  Thousands of homes now need repairs after insulation fitted under government scheme\n                 \n                  Vodafone internet services down for thousands of users\n                 A number of the company's employees and a group of individual investors also participated in the funding round, according to Tenora. \"To attract the backing of a major financial institution at this early stage is a strong endorsement of both the market need for our differentiated solution,\" Mr Adams said. Based in London, Tenora's initial products include Truhedge, which it says will allow clients to make faster, data-driven decisions. Arturo Alonso, senior managing director at Macquarie, said Tenora offered \"a disruptive solution for the FX and payments industry\"."
    },
    {
        "title": "'I'm a private investigator - here's how much we cost and common mistake that helps us crack cases'",
        "description": "If you've ever spent your morning commute daydreaming about starting afresh with your career, this feature is for you. Each Monday, the Money blog team speaks to someone from a different profession to discover what it's really like. This week, we chat to veteran private investigator Mike LaCorte.",
        "url": "https://news.sky.com/story/im-a-private-investigator-heres-how-much-we-cost-and-common-mistake-that-helps-us-crack-cases-13449332",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-money-wirltb-feature_7049441.jpg?20251013050356",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-13 07:17:00",
        "Headline": "Private investigator Mike LaCorte reveals how much he charges, which job won him the Investigator of the Year award and why being a detective has nothing to do with Sherlock Holmes.",
        "Content": "If you've ever spent your morning commute daydreaming about starting afresh with your career, this feature is for you. Each Monday, the Money blog team speaks to someone from a different profession to discover what it's really like. This week, we chat to veteran private investigator Mike LaCorte. Our fees vary depending on complexity, jurisdictions and objectives… A standard surveillance job might cost anywhere from £1,500-£2,500 a day. A due diligence report for a corporate merger could be £5,000-£15,000. Blackmail resolution involving travel, cyber support, and legal coordination might start at £25,000 and scale up. Longer-term retainer risk management models are where we earn the most. Here's one of my secrets for investigating... People often reuse usernames. By tracking a username across platforms, databases, and forums, you can build a surprisingly complete profile, even if the person thinks they've been discreet. Curiosity, genuine, relentless curiosity, is the single most important skill in this profession… You have to be deeply interested in people, behaviours, patterns, and anomalies. It's that instinct to ask why, to dig one layer deeper than everyone else, that often leads to the breakthrough. You can teach someone the technical elements, but curiosity, in my opinion, can't be taught. It's either part of your mindset, or it's not. Read more from our What It's Like To Be A.... series'I'm self-taught celeb photographer, can earn up to six figures for one job and work with celebrities all over the world''I've sculpted the late Queen and charge upwards of £40,000'What it's really like being a novelist There isn't one set path... I entered the industry at a time when training was scarce, so much of it was hands-on. Today, I encourage new investigators to take formal courses, join professional associations like the ABI and continually educate themselves. Reputation is everything... If you've delivered results under pressure and acted with integrity, people remember and recommend you. We don't advertise in the traditional sense. \n                  How to set your baby up to be a millionaire\n                 \n                  Location, Location, Location star Phil Spencer reveals his top tips for buying your dream home\n                 \n                  Savings guide: The accounts that will help you beat inflation\n                 Blackmail cases are increasingly common... especially in high-net-worth circles. Crypto scams and family disputes involving hidden wealth are also on the rise. Our other most common cases include... Success in my industry is often difficult to shout about… The most significant wins usually happen quietly, behind closed doors, under strict confidentiality. That said, one standout moment was being awarded Investigator of the Year by the World Association of Detectives in 2017 in Bucharest, which was a rare moment of public recognition in a very private world. The case involved a high-profile international blackmail scheme targeting an individual at extreme personal and reputational risk. We uncovered the blackmailers, neutralised the threat, and restored the client's safety and peace of mind. It was a complex operation involving digital forensics, covert surveillance, and cooperation with the UK police and is one of the most satisfying cases I've led. I've traced hidden assets across multiple jurisdictions in a contentious divorce... and exposed a romance scam that spanned two continents. I find myself deeply affected by any case involving... vulnerable individuals. Especially young people at risk, survivors of abuse, or families desperate for answers. A Canadian family reached out in absolute distress... Their daughter had travelled to the UK to meet a man she'd only known via an online chatroom. She was over 18, so the authorities weren't particularly responsive, despite growing concerns about her safety. The family feared she was being manipulated or held in a coercive environment. We stepped in, traced her location and quickly identified signs that she was in a highly vulnerable and potentially dangerous situation. Through sensitive and careful handling and liaising with the authorities, we were able to intervene, safeguard her and help facilitate a safe return. Afterwards, her family sent me a photo of them all reunited, smiling and hugging. That image is something I'll never forget. It reminds me that what we do isn't just investigative, it's personal. These aren't just cases; they're people's lives. Private investigation salaries can vary significantly… A newly qualified professional investigator might earn around £20-£30,000, often working irregular hours, subcontracting for agencies, or building up their own portfolio. Earnings can increase to more than £50,000. If you own your own agency, like I do with Conflict International, income potential becomes far greater. Running multi-jurisdictional investigations and serving high-net-worth clients or corporate entities can mean annual earnings stretching into six figures. I regularly work over 60 hours a week… Operating globally means my phone rings at all hours. When a client calls from Dubai at midnight UK time, you need to answer. It's not uncommon for me to jump on a flight the next day or manage multiple live cases across different time zones. That said, I do try to schedule three to four breaks a year, ideally somewhere quiet where I can get in lengthy cycles and switch off. But I'm never fully offline. It's a lifestyle, not a 9-to-5 job. The biggest misconception of being a private investigator is... That it is all action-packed, glamorous work, like something out of a James Bond film or a Sherlock Holmes novel. People imagine car chases, dramatic confrontations, or sitting in dark rooms connecting red string on cork boards. The reality is quite different. Most of the work is slow, deliberate, and detail-oriented. Some elements of the job match TV detectives... Like using disguises or running surveillance operations. But there's far more legal compliance, GDPR navigation, and ethical decision-making than TV ever shows. We're not vigilantes, we operate within strict legal frameworks, often under intense scrutiny. We routinely turn down work that raises red flags... Sometimes it's obvious: someone wants us to \"follow\" an ex-partner under suspicious circumstances, or they're trying to use our services to gain leverage in a personal dispute without legal cause. We've had people ask us to access private messages, hack social media accounts, or \"ruin someone's life\". There are a few things I sometimes dislike about my job... Chasing unpaid invoices is definitely one of them. We put in a huge amount of time, care, and specialist expertise into our work, often under immense pressure, so having to chase clients who go quiet once they've got what they need is not only frustrating but disheartening. But, sometimes, the hardest part is seeing the truth, knowing exactly what's happening, but being unable to act due to legal limitations, jurisdictional issues, or a client's decision not to pursue it. Despite all that, I wouldn't change what I do. But yes, like any job, it comes with its shadows."
    },
    {
        "title": "Starmer and other leaders have fallen into line on Trump's Gaza plan - now it must deliver",
        "description": "I've been around a while and seen a lot of the insides of international summits over the years, but this one was truly extraordinary.",
        "url": "https://news.sky.com/story/starmer-and-other-leaders-have-fallen-into-line-on-trumps-gaza-plan-now-it-must-deliver-13449777",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-keir-starmer_7050224.jpg?20251013185127",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-10-13 21:24:00",
        "Headline": "This historic day in the Middle East was pure theatre for Trump from start to finish - but the task for all leaders is to help implement what he has set in train.",
        "Content": "\n          Political editor\n              @BethRigby\n  I've been around a while and seen a lot of the insides of international summits over the years, but this one was truly extraordinary. Over 20 leaders flew to Sharm el-Sheikh in Egypt from all over the world - Indonesia, Pakistan, Norway, Canada - to witness the signing of Donald Trump's peace plan. Gaza deal signed - as it happened  This historic day was pure theatre for Trump from start to finish. Flying in from Israel, where he had met hostage families and then addressed the Israeli parliament, he arrived a whopping three hours late, keeping a gaggle of world leaders waiting. We stood around in corridors watching them move from one room to another to hold meetings with each other, presumably to talk about phase two of Trump's peace deal. Testimony to the power of Trump At one point, Sir Keir Starmer's meeting with his Turkish counterpart included France's Emmanuel Macro. That then somehow morphed into a summit which also brought in the Germans, Italy's Prime Minister Giorgia Meloni, and the leaders of Egypt and Qatar. More chairs kept coming into the room until there was the equivalent of a cabinet table of leaders and advisors sitting in a long line facing each other. What they were talking about was how each country could help in phase two of the peace effort. Now Trump had, alongside fellow signatories of this deal - Egypt, Qatar, and Turkey - ended the war, could they maintain the peace? As Starmer put it: \"We can't treat today as historic and let it drop tomorrow.\" But these mini summits in the margins happened by fault rather than design. This day really was designed to bear witness - and offer acknowledgement - to Trump. All of these leaders turned up pretty much in the dark as to what the day held, with his peace summit convened 48 hours earlier. That they dropped plans to make their way to Egypt is testimony to the power Trump wields. He was utterly omnipotent. First, there was the greeting ceremony, in which each leader filed in individually for a photo and handshake with him before all returning to the stage for the family photo. Then, at the signing ceremony, Trump sat with his three fellow signatories as the world leaders stood behind him. \"This took 3,000 years to get to this point. Can you believe it?\" Trump said as he signed that deal. \"And it's going to hold up, too. It's going to hold up.\" Finally, in another giant hall, Trump gave a speech in which he ran through all the leaders who had turned up - praising them or fondly poking a bit of fun at them accordingly, as (most) of them stood behind him. He teased Macron for sitting in the front row rather than joining the others on the stage, joking it wasn't like him to be low-key. He described Meloni as a \"beautiful young woman\". \"I'm not allowed to say it because usually it's the end of your political career if you say it - she's a beautiful young woman,\" said Trump mid-speech. \"You don't mind being called beautiful, right? Because you are,\" he turned to say to her - her reaction obscured from view. Now for the 'easy part'? Soon after, the prime minister of Pakistan, invited to say a few remarks by Trump, renewed his call for the US president to be awarded the Nobel Peace Prize. Having brokered the deal, Trump took the moment and made it into his summit on his terms, as fellow leaders fell into line, literally standing behind him. And in his characteristic bullishness, he told his audience in this final speech that the hard part - the ceasefire - had been done, and rebuilding Gaza was the easy part. That isn't really what the rest of them believe: 92% of Gazans have been displaced, the Gaza Strip is a wasteland. Organising a peacekeeping force, getting Hamas to disarm and Israel to withdraw from the strip, putting together a technocratic team and peace board to oversee the running of Gaza still needs to be done. This was a largely celebratory day, but there are concerns whether this deal will hold up. Trump says Hamas needs to disarm and disband, and yet one of their most senior leaders told Sky News a few days ago, it won't. Meanwhile, there is a growing humanitarian crisis in Gaza. The UK has in short order sent in £20m of aid to try to help with sanitation. On the British side, the prime minister said he had offered to help demilitarise the strip, saying the UK can take a role in \"monitoring the ceasefire but also decommissioning the capability of Hamas and their weaponry, drawing on our experience in Northern Ireland\". \"It's really important we keep that focus. We mustn't have any missteps now,\" he said. Trump's peace board is still in its infancy - Starmer told me he isn't going to sit on it, with the make-up still being discussed, while Tony Blair's participation is controversial. Trump said on the way over to Egypt that he was going to canvass opinion to make sure everyone is happy with the former prime minister's presence. It comes after Bassem Naim of Hamas told Sky News that Blair was not welcome in Gaza after his role in the invasion of Iraq. When I asked Starmer if he thought Trump should be awarded the Nobel Peace Prize he said \"there'll be plenty of people, I'm sure, nominating him\" - as he paid tribute to him for getting \"leaders to this position\". Now the task for them all is to implement what Trump has set in train. If his plan works, he would be sitting on an achievement that has eluded successive US presidents for decades. Trump should rightly be lauded for ending the war, now he must bring the peace."
    },
    {
        "title": "Sir Keir Starmer has 'full confidence' in national security adviser after China spy trial collapse",
        "description": "Sir Keir Starmer has said he has \"full confidence\" in national security adviser Jonathan Powell following the collapse of the China spy trial.",
        "url": "https://news.sky.com/story/sir-keir-starmer-has-full-confidence-in-national-security-adviser-after-china-spy-trial-collapse-13449629",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer_7050270.jpg?20251013195032",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-10-13 20:25:00",
        "Headline": "The collapse of a trial against two men accused of spying for China has led to an extraordinary blame game in parliament - with the Tories accusing the government of seeking to \"curry favour\" with Beijing. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Sir Keir Starmer has said he has \"full confidence\" in national security adviser Jonathan Powell following the collapse of the China spy trial. The prime minister said the senior civil servant is doing an \"excellent job\", amid questions over whether he played a role in the case being abandoned. Christopher Cash, 30, a former parliamentary researcher, and teacher Christopher Berry, 33, were accused of spying for China - a charge they denied - but weeks before their trial was due to begin, it was suddenly dropped. The director of public prosecutions, Stephen Parkinson, has blamed ministers for failing to provide evidence that would support the assertion that China represented a threat to national security, leading to accusations of a cover-up from the Tories.  However, Downing Street blamed the Conservatives for failing to classify China as a threat while in office - when the charges were brought against the pair - and for failing to update the \"archaic\" Official Secrets Act. Asked today if he supported Mr Powell, Sir Keir told broadcasters: \"He's doing an excellent job. \"You heard what Steve Witkoff said about him today in relation to the role he's played behind the scenes [in Gaza]. So of course, I've got full confidence in him.\" \n                  Starmer and other leaders have fallen into line on Trump's Gaza plan - now it must deliver\n                 \n                  UK played 'vital role' in Gaza peace deal, says Trump aide, after minister branded 'delusional'\n                 \n                  Politics latest: Tony Blair dodges Sky News questions about Gaza peace board controversy\n                 Mr Witkoff, the US's Middle East envoy, this morning lauded \"the incredible input and tireless efforts\" of Mr Powell in helping to bring about a ceasefire. Sir Keir was speaking from Sharm el-Sheikh in Egypt, where world leaders have gathered for the Gaza peace summit. The dropped trial has sparked a political row, with Tory leader Kemi Badenoch accusing the government of deliberately collapsing the case in order to avoid angering China and losing investment into the UK - something ministers have strenuously denied. Security minister Dan Jarvis accused her of spreading \"baseless smears\" in a statement setting out the government's position in the House of Commons on Monday afternoon, as MPs returned to parliament following the party conference recess. Mr Cash, of Whitechapel, east London, and Mr Berry, of Witney, Oxfordshire, were charged in April 2024 with passing politically sensitive information to a Chinese intelligence agent between December 2021 and February 2023. Blame game continues Mr Jarvis told MPs the prosecution was \"based on the law at the time of the [alleged] offence and the policy position of the Conservative government at the time of the [alleged] offence\". He said \"every effort\" was made by the Labour government to provide evidence to proceed with the case on that basis, but the CPS was \"hamstrung\" by the Tories' failure to update the Official Secrets Act. This was the legislation under which the charges were brought, which specifies it is a crime to communicate any documents which might be useful to \"an enemy\" - language Mr Jarvis said was \"archaic in the modern threat landscape\". The Tories defined China only as a \"systemic challenge to UK security\" in 2021, and then as an \"epoch-defining challenge\" in 2023. Mr Jarvis said ministers \"cannot retrospectively\" change that, adding: \"The current government's policy position was immaterial to the assessment that was made by the CPS. \"The CPS decision to drop the case was not influenced by any member of this government, nor special adviser or senior official.\" China 'poses series of threats' Ms Badenoch doubled down on her accusations in response, saying the collapsed trial \"wasn't a mistake\". \"This looks like a deliberate decision to collapse the case and curry favour with the regime in China.\" On Labour's position on China, Mr Jarvis said: \"We fully recognise that China poses a series of threats to UK national security, yet we must also be alive to the fact that China does present us with opportunities.\" He said that requires a \"pragmatic approach to economic engagement without compromising on our national security\". Read More:The blame game over China spy trial collapse MI5 issues new guidance to MPs Another issue the row has raised is the safety of MPs - with Commons speaker Lindsey Hoyle opening Monday's debate saying he is \"angry and disappointed\" that politicians are not being adequately protected from foreign interference. MI5 has now issued new guidance to MPs, peers, councillors, candidates and parliamentary staff, warning them: \"You are a potential target.\" As well as urging vigilance at home, the advice warns that foreign intelligence services could seek to exploit politicians' overseas travel to access their data or use financial donations as a route to influence. The guidance specifically accused Russia, China and Iran of carrying out \"long-term strategic foreign interference and espionage\" but said \"other states\" could also seek to obtain information about \"the UK system\". Mr Jarvis said the guidance would \"kickstart a wider cross-government action plan.. to reduce foreign interference and espionage threats to UK democratic institutions\"."
    },
    {
        "title": "A Dynasty star and the Thatcher dynasty",
        "description": "It was the night I rescued Dame Joan Collins' silk evening glove.",
        "url": "https://news.sky.com/story/a-dynasty-star-and-the-thatcher-dynasty-13449721",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-joan-collins-jon-craig_7050354.jpg?20251013215440",
        "type": "Politics",
        "Author": "By Jon Craig, chief political correspondent",
        "Date Published": "2025-10-13 20:28:00",
        "Headline": "Joan Collins, of TV's Dynasty, was the star A-list celeb at a dinner to celebrate the 100th anniversary of the birth of Margaret Thatcher.",
        "Content": "By By Jon Craig, chief political correspondent   It was the night I rescued Dame Joan Collins' silk evening glove. The star of TV's Dynasty and countless film roles was the star A-list celeb at a dinner to celebrate the 100th anniversary of the birth of Margaret Thatcher. \"I adored her, I thought she was a wonderful, wonderful inspirational person,\" she told me as she arrived at the VIP entrance at the Guildhall in the City of London. \"I wish we had somebody like that today to look up to and I think it was very sad that she left us so soon - and I'm freezing!\" With husband Percy Gibson, 32 years younger than Joanie, on her arm, the 92-year-old national treasure was due to make a speech at the glitzy dinner. But as she and Percy went inside to escape the chill of the evening, she somehow dropped one of her gloves, which matched her bright red evening dress, beside her car. Eager to come to the aid of a 92-year-old TV and movie star, after spotting it lying in the road, I picked it up and handed it to the Guildhall's friendly head of security, Richard Gentry. \n                  Starmer and other leaders have fallen into line on Trump's Gaza plan - now it must deliver\n                 \n                  UK played 'vital role' in Gaza peace deal, says Trump aide, after minister branded 'delusional'\n                 \n                  Politics latest: Tony Blair dodges Sky News questions about Gaza peace board controversy\n                 Within minutes, Dame Joan's driver had returned in her large black Mercedes and Richard handed the glove to him. My good deed for the evening was complete. Of course, the evening was all about dynasty, the Thatcher dynasty. The principal speaker at the dinner was Sir Mark Thatcher, tall, stylish and elegant in his DJ at the age of 72. \"I think my mother would be really impressed and warmed that there's such an important occasion and surrounded by her friends,\" he told me just before Joan and Percy arrived. I then asked Sir Mark if there were lessons for Kemi Badenoch to learn from the tough time his mother had in her early years as Opposition leader in the 1970s. \"It's certainly true that in my mother's early years, by my recollection, it wasn't perhaps as easy as it became later on,\" he said. \"I think there's similarity between the first two years of my mother's leadership and Kemi's leadership of the party. \"Both of them have become leaders in the face of a bitter election defeat. So there are some similarities.\" Last of the arrivals at the VIP entrance - no surprise! - was a typically jaunty Boris Johnson, who told me: \"The world needs to recover the clarity and logic of Margaret Thatcher.\" And asked what lessons Kemi Badenoch should learn from Margaret Thatcher, he said: \"I think Kemi Badenoch is amply endowed with Thatcherian characteristics of bounce and zap. She's got it, don't worry!\" And with that, he gave me a playful punch in the chest and dashed inside: the box office politician - still, according to his supporters - off to join a box office star of the screen."
    },
    {
        "title": "Scottish govt to 'step in' to sponsor care home workers after skilled worker visa axed",
        "description": "The Scottish government will sponsor care home workers after Sir Keir Starmer changed the skilled worker visa this year, Scotland's first minister has announced.",
        "url": "https://news.sky.com/story/scottish-govt-to-step-in-to-sponsor-care-home-workers-after-skilled-worker-visa-axed-13449546",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-john-swinney-snp-scotland_7050015.jpg?20251013153259",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-13 14:15:00",
        "Headline": "John Swinney also announced the Scottish government will open up walk-in GP surgeries.",
        "Content": "The Scottish government will sponsor care home workers after Sir Keir Starmer changed the skilled worker visa this year, Scotland's first minister has announced. John Swinney, giving his keynote speech at the Scottish National Party (SNP) conference, said the government will \"step in\" to sponsor \"hundreds of dedicated workers\" so they can \"work, pay tax and help keep Scotland's care homes running\". He said they will be able to \"start work immediately\". Politics latest: Will rise of Reform benefit SNP? In July, the government halted new overseas applications for the social care worker visa, an arm of the skilled worker visa. Mr Swinney said this has meant \"thousands of care workers here in the UK entirely legally have been left high and dry\". \"Scotland's older people must not pay the price for Westminster's prejudice,\" he added. \n                  Starmer and other leaders have fallen into line on Trump's Gaza plan - now it must deliver\n                 \n                  UK played 'vital role' in Gaza peace deal, says Trump aide, after minister branded 'delusional'\n                 \n                  Politics latest: Tony Blair dodges Sky News questions about Gaza peace board controversy\n                 Walk-in GPs Mr Swinney also said the Scottish government will open a network of walk-in GP services across Scotland. Initially, there will be 15 sites, staffed by GPs and nurses, open from 12pm to 8pm, seven days a week. \"This is just the start, we will expand this network,\" he said. The SNP leader said no appointments will be needed, and they expect to deliver more than one million additional GP appointments within the next year. Independence Staying true to the SNP's roots, Mr Swinney presented Scottish independence as the solution to the challenges he says are posed by Westminster governance. He argued that self-governance and SNP leadership are delivering tangible benefits for Scotland. \"Today, I believe it will be revulsion at Westminster's race to the right that will change Scotland's status again,\" he said. \"From a so-called devolved nation, to what we can be: A modern, outward-looking, inclusive, compassionate country. \"Not a devolved nation, but the world's newest independent nation.\" Mr Swinney added that only Scotland can care for Scotland and its people, which he said included everyone in the country. \"Yes, I am proud to say that refugees are welcome here,\" he said to much applause."
    },
    {
        "title": "Got a pair of these? There's more to them than meets the eye - and it may mean global trade war",
        "description": "For most of human history, no one paid all that much attention to the 17 rare earth elements. ",
        "url": "https://news.sky.com/story/got-a-pair-of-these-theres-more-to-them-than-meets-the-eye-and-it-may-mean-global-trade-war-13449786",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-apple-airpods_7050429.jpg?20251014025929",
        "type": "Technology",
        "Author": "Ed Conway",
        "Date Published": "2025-10-13 22:02:00",
        "Headline": "Right now, about 70% of the world's rare earth elements - key to everything from AirPods to cars - are mined in China, which announced last week that anyone using Chinese rare earths would have to apply for a licence. This has been seen as a declaration of economic war in Washington.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  For most of human history, no one paid all that much attention to the 17 rare earth elements.  An obscure suite of elements that sit in their own corner of the periodic table, they were mostly renowned among chemists and geologists for being tricky and fiddly - incredibly hard to refine, but with chemical facets that made them, well… interesting. Not so much for a single thing they did by themselves, but for what they did in conjunction with other elements. Added to alloys, rare earths can make them stronger, more ductile, more heat-resistant, and so on. Think of them as a sort of metallic condiment: a seasoning you add to other substances to make them stronger, harder, better. The best example is probably neodymium. On its own, there's nothing especially spectacular about this rare earth element. But add it to iron and boron, and you end up with the strongest magnets in the world. Neodymium iron boron magnets are everywhere. If you have a pair of headphones or earbuds, the speakers inside them (\"drivers\" is the technical term) are driven by these rare earth magnets. If you have a pair of Apple AirPods, those magnets aren't just in the speakers; they're what's responsible for the satisfying \"click\" when the case snaps shut. Rare earth magnets are in your car: in the little motors that raise and lower the windows, inside the functioning of the airbag and the seat adjustment mechanism. And not just the little things. Most electric vehicles use rare-earth magnets in their motors, enabling them to accelerate more efficiently than the old all-copper ones. More sensitively, from the perspective of Western governments, in the military, there are tonnes of rare earths to be found in submarines, in fighter jets, in tanks and frigates. Much of this is in the form of magnets, but some is in the form of specialised alloys. So, for instance, there is no making a modern jet engine without yttrium and zirconium, which, together, help those metallic fan blades withstand the extraordinary temperatures inside the engine. Without rare earths, the blades would simply melt. Yet the amount of this stuff we mine from the ground each year is surprisingly small. According to Rob West of Thunder Said Energy, the total size of the rare earth market is roughly the same as the North American avocado market. But, says West, those numbers underplay its profound importance. \"Buyers would likely pay over 10-100x more for small but essential quantities of rare earths, if supplies were ever disrupted,\" he says. \"You cannot make long-distance fibre cables without erbium. You cannot make a gas turbine or jet engine without yttrium.\" China's dominance In short, these things matter. And that brings us to the politics. Right now, about 70% of the world's rare earth elements are mined in China. Roughly 90% of the finished products (in other words, those magnets) are made in China. China is dominant in this field in an extraordinary way. This is not, it's worth saying, for geological reasons. Contrary to what the name suggests, rare earth elements aren't all that rare. Pull a chunk of soil out of the ground and there will be trace amounts of most of them in there. True: finding concentrated ores is a bit harder, but even here, it's not as if they are all in China. There are plenty of rich rare earth ores in Brazil, India, Australia, and even the US (indeed, the Mountain Pass mine in California is where rare earth mining really began in earnest). Low cost of Chinese rare earths The main explanation for Chinese dominance is that China has simply become very good at extracting lots of rare earths at relatively low cost. According to figures from Benchmark Mineral Intelligence, the prevailing cost of Chinese rare earths is at least three times lower than the cost of similar minerals refined in Europe (to the extent that such things are available). At this point, perhaps you're wondering how China has managed to do it - to dominate global production at such low prices. Part of the explanation, says West, probably comes down to \"transfer pricing\" - in other words, China being China, refiners and producers are probably able to buy raw materials at below market prices. Another part of the explanation is that refining rare earth ores is phenomenally energy and carbon-intensive. Most European and American firms have pulled out of the sector because it is hideously dirty. Such qualms are less of an issue in China, especially since most of their mines, including the biggest of all, Bayan Obo in Inner Mongolia, are hundreds if not thousands of miles from the nearest city. Energy costs are less of a constraint in a country whose grid is still built mostly on a foundation of cheap thermal coal. Add it all up, and you end up with the situation we have today: where the vast majority of the world's rare earths, that go into all our devices, come from dirty mines in China, produced at such a low cost that device manufacturers are happy to put them anywhere. Anyway, that brings us to the politics. Global trade war flaring up again In recent months and years, China has periodically introduced controls on rare earth exports. Last week, it announced the most serious rule change yet, essentially insisting that anyone using Chinese rare earths would have to apply for a licence from them. It has been seen, in Washington at least, as a declaration of economic war, and, in response, Donald Trump has announced a fresh set of tariffs on China. In short, the global trade war seems to be flaring up all over again. Where this ends up is anyone's guess. Tim Worstall, a former scandium expert who has been in and out of the rare earths sector for decades, suspects China might have overplayed its hand. \"The end result here is that there can be two outcomes,\" he says. \"A: The entire world's usage of rare earths is mapped out in detail, end uses, end users, quantities, and times for the Chinese state and depends upon their bureaucracy to administer. \"B: The plentiful rare earths of elsewhere are dug up, and the supply chain is rebuilt outside China. \"My insistence is that B is going to be the outcome, and it'll be done, intervention or no.\" Read more from Sky News:At least 42 dead in bus crash in South AfricaDozens injured after train crash in Slovenia In practice, the new rules may simply represent an element in China's trade negotiations with the US. So it's hard to know whether they, or for that matter America's 100% extra tariffs, will ever really bite. Either way, it's yet more evidence of the rocky road the global economy remains on."
    },
    {
        "title": "China poses 'highly sophisticated' cyber threat to UK, NCSC warns",
        "description": "China poses a \"highly sophisticated and capable\" cyber threat, the UK's cyber agency has warned - as it revealed a 50% jump in significant attacks in Britain by criminals and hostile states.",
        "url": "https://news.sky.com/story/china-poses-highly-sophisticated-cyber-threat-to-uk-ncsc-warns-13449794",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-starmer-xi_7050426.jpg?20251014015646",
        "type": "Technology",
        "Author": "Deborah Haynes",
        "Date Published": "2025-10-13 23:41:00",
        "Headline": "The National Cyber Security Centre (NCSC) says China poses a \"capable\" cyber threat, \"targeting a wide range of sectors and institutions across the globe, including the UK\".",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  China poses a \"highly sophisticated and capable\" cyber threat, the UK's cyber agency has warned - as it revealed a 50% jump in significant attacks in Britain by criminals and hostile states. The National Cyber Security Centre (NCSC)'s verdict on the threat posed by Chinese cyber spies comes as Sir Keir Starmer is under mounting pressure over the sudden collapse of a trial against two British men accused of espionage on behalf of Beijing. The Crown Prosecution Service said the case was derailed because the government would not deliver evidence to show China had been a threat to Britain's national security at the time of the alleged offences between 2021 and 2023. The prime minister said Beijing had not been classed as an \"enemy\" back then. Yet a 2023 review by the NCSC - which is part of Government Communications Headquarters - refers to the \"advanced threats\" posed by China to the UK's critical national infrastructure. A similar alarm was raised in the annual review in 2022: \"The regimes that continued to present the most acute cyber threat to the UK and its interests were Russia, China, Iran, and North Korea.\" In its latest report, published on Tuesday, the cybersecurity agency stated: \"China continues to be a highly sophisticated and capable threat actor, targeting a wide range of sectors and institutions across the globe, including the UK.\" \n                  Got a pair of these? There's more to them than meets the eye - and it may mean global trade war\n                 \n                  Government accused of 'cover-up' over collapse of China spy trial\n                 \n                  Starmer's national security adviser played no role in collapse of China spy trial, cabinet minister says\n                 This review covers the year to August 2025. With hacks and ransomware increasingly crippling some of the UK's biggest brands, the NCSC said the number of \"highly significant\" cyberattacks - classed as those impacting the government, essential services, large chunks of the population or the economy - surged 50% to 18 cases over the past year compared with the previous 12 months. The government did not provide a breakdown of whether those suspected of being responsible for the attacks were lone wolves, criminals or hostile states. \"Cyber is being used by state and non-state actors to achieve their goals, and the overall cyber threat to the UK is growing from an already high level,\" it said. Among the most high-profile victims of cyber foul-play have been the car manufacturer Jaguar Land Rover (JLR) and retailers M&S, Co-op and Harrods. Investigators are reported to be looking at whether a Russian state-backed actor targeted JLR. That hack forced the company temporarily to close its factories and had a major impact on its supply chain, prompting the government to agree a £1.5bn loan. Separately, four people were arrested in July over the cyberattacks against the three retailers. Attacks should be 'wake-up call' Richard Horne, head of the NCSC, said such attacks should be a \"wake-up call\" and urged the bosses of every company - big and small - to build their resilience against cyber threats. \"The time to act is now,\" he will say, according to an advanced copy of a speech he is set to deliver this morning. He will say it is vital for businesses to know what they would do if their computer screens went blank. \"Could you run your payroll systems? Or keep your machinery working? Or stock your shelves?\" he will say. \"If the answer is no, or more likely 'don't know' - act now.\"  Offering a sense of the real-world impact of a cyber assault, Shirine Khoury-Haq, the boss of the Co-operative Group, shared how it felt to be targeted. \"The attack has had a significant impact on me, my colleagues and on our members,\" she wrote in a foreword to the review. \"While you can plan meticulously, invest in the right tools and run countless exercises, nothing truly prepares you for the moment a real cyber event unfolds. \"The intensity, urgency, and unpredictability of a live attack is unlike anything you can rehearse. That said, those drills are invaluable - they build muscle memory, sharpen instincts, and expose vulnerabilities in your systems.\" The cyberattack cost Co-op at least £206m in lost revenues after hackers penetrated its networks, prompting shortages of goods on shelves and the loss of customer data. As well as calling out China, the NCSC also focused on the threat posed by Russia, Iran, and North Korea. It further flagged concerns about how cyberattackers are using artificial intelligence to enhance their capabilities."
    },
    {
        "title": "Thousands of homes now need repairs after insulation fitted under government scheme",
        "description": "Thousands of homes fitted with insulation under a flagship government scheme now need major remedial work, or risk damp and mould, the public spending watchdog has warned.",
        "url": "https://news.sky.com/story/thousands-of-homes-now-need-repairs-after-insulation-fitted-under-government-scheme-13449541",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-insulation-wall-insulation_7050237.jpg?20251013190752",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-10-13 14:13:00",
        "Headline": "More than 30,000 homes face damp or mould due to ill-fitted insulation, with a handful facing immediate risks like fires, a government watchdog warned. The energy department said it had plans to fix the issues at no cost to the household.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Thousands of homes fitted with insulation under a flagship government scheme now need major remedial work, or risk damp and mould, the public spending watchdog has warned. A damning report by the National Audit Office (NAO) said \"clear failures\" in the Energy Company Obligation (ECO) scheme to tackle fuel poverty and pollution had led to low quality installations and even potential fraud. It blamed incompetent subcontractors and weak monitoring and government oversight for the issues, which in extreme cases could cause fires. Fuel poverty campaigners warned the system had \"let cowboys through the front door\", saying it must be fixed to bring down energy bills and keep people warm. Almost all homes - some 98%, affecting 22,000 to 23,000 properties - fitted with external wall insulation under the ECO are affected, the NAO said. A further 29% of homes with internal wall insulation - around 9,000 to 13,000 dwellings - also face major issues that need fixing. A small percentage of homes - 6% with external insulation and 2% with internal - put people in immediate danger, such as poor ventilation that could cause carbon monoxide poisoning, and electrical safety issues that could start fires. ECO is a scheme that obliges energy companies to pay for energy efficiency measures in vulnerable households out of consumer bills. Gareth Davies, head of the NAO, said ECO is \"important to help reduce fuel poverty and meet the government's ambitions for energy efficiency\". But \"clear failures in the design and set-up\" had led to \"poor-quality installations, as well as suspected fraud\", he added. 'Gaming the system' The report says the reason things had gone so badly wrong could be down to work being subcontracted to individuals and firms who are not competent or certified, uncertainty over standards, and businesses \"cutting corners\" or \"gaming the system\". The energy regulator Ofgem last year estimated businesses had falsified claims for ECO installations in between 5,600 and 16,500 homes. That means they could have claimed between £56m and £165m from energy suppliers - ultimately paid for by bill-payers. Read more from Sky News:At least 42 killed as bus crashes on mountain roadDiscord hack shows risks of online age checks Martin McCluskey, the government minister for energy consumers, criticised the \"unacceptable, systemic failings\" that had affected thousands of families. He added: \"We are fixing the broken system the last government left by introducing comprehensive reforms to make this process clear and straightforward, and in the rare cases where things go wrong, there will be clear lines of accountability, so consumers are guaranteed to get any problems fixed quickly.\" The government urged households to take up the free audit that will be offered in a forthcoming letter, and said installers would be forced to remedy the issues free of charge. However, insulation has the potential to vastly improve homes, analysts pointed out. Jess Ralston from energy think tank ECIU said: \"The majority of households that have benefitted from insulation schemes have lower bills and warmer, healthy homes, particularly during the early years of the gas crisis when the UK's poor quality housing stock was one of the reasons we were so badly hit compared to other European countries.\" Simon Francis, co-ordinator of the End Fuel Poverty Coalition, said: \"Insulation and ventilation, when done properly, are among the safest and most effective ways to bring down energy bills and keep people warm.\" But the report had revealed a \"system that has let cowboys through the front door, leaving thousands of victims living in misery and undermining public trust\". Sue Davies, Which? head of consumer protection policy, called it \"a damning indictment of a failed scheme, where poor oversight has allowed rogue traders to cause huge damage to people's homes and lives\". She said the government must take swift action to rectify the damage, as well as ensuring \"there is no repeat of this scandal by putting in place robust consumer protections and effective oversight\"."
    },
    {
        "title": "Vodafone internet services down for thousands of users",
        "description": "Tens of thousands of Vodafone users are reporting problems with their internet",
        "url": "https://news.sky.com/story/vodafone-internet-services-down-for-thousands-of-users-13449569",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-vodafone-mobile_7050061.jpg?20251013162207",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-10-13 15:09:00",
        "Headline": "The outages began on Monday afternoon, according to the monitoring website DownDetector, which had more than 130,000 reports of problems with Vodafone connections.",
        "Content": "\n          Science and technology reporter\n       Tens of thousands of Vodafone users are reporting problems with their internet The outages began on Monday afternoon, according to the monitoring website DownDetector, which reported more than 130,000 issues with Vodafone connections. A spokeswoman for the company said: \"We are aware of a major issue on our network currently affecting broadband, 4G and 5G services. \"We appreciate our customers' patience while we work to resolve this as soon as possible.\" The company has more than 18 million UK customers, with nearly 700,000 of those using Vodafone's home broadband connection. Vodafone users vented their frustration on social media. \"It's like Vodafone has just been wiped off the earth. Not a single thing works,\" said one X user. \n                  UK biggest phone network created as Three-Vodafone merger gets conditional approval\n                 \n                  Vodafone and Three merger could get green light, says UK's competition watchdog\n                 \n                  Tens of millions could pay more if Vodafone-Three merger goes ahead, CMA warns\n                 The Vodafone app also appeared to be down for users, with the company's website briefly going down too. The 'network status checker' on the website was also down, and when Sky News tried to test the customer helpline, it did not ring. \"There's Vodafone down and then there's Vodafone wiped off the face of the f***ing planet,\" posted another X user. Read more from Sky News:Gaza deal latest: Drones reveal devastationMadagascar president says coup under way Jake Moore, global cybersecurity advisor at ESET, said the outage shows how reliant we are on modern infrastructure like mobile networks. \"Outages will always naturally raise early suspicions of a potential cyber incident, though current evidence points more towards an internal network failure than a confirmed attack,\" said Mr Moore. \"The sudden outage, combined with the inability to access customer service lines, mirrors classic symptoms of a distributed denial-of-service (DDoS) attack, where attackers overwhelm the network so the site or systems collapse. \"However, malicious or not, this once again highlights our heavy reliance on digital infrastructure, especially in an age where we increasingly depend on mobile networks for everything,\" he said. \"Ultimately, resilience is essential, whether the cause is a direct cyberattack, a supply chain issue or a critical internal error.\""
    },
    {
        "title": "A Dynasty star and the Thatcher dynasty",
        "description": "It was the night I rescued Dame Joan Collins' silk evening glove.",
        "url": "https://news.sky.com/story/a-dynasty-star-and-the-thatcher-dynasty-13449721",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-joan-collins-jon-craig_7050354.jpg?20251013215440",
        "type": "Entertainment",
        "Author": "By Jon Craig, chief political correspondent",
        "Date Published": "2025-10-13 20:28:00",
        "Headline": "Joan Collins, of TV's Dynasty, was the star A-list celeb at a dinner to celebrate the 100th anniversary of the birth of Margaret Thatcher.",
        "Content": "By By Jon Craig, chief political correspondent   It was the night I rescued Dame Joan Collins' silk evening glove. The star of TV's Dynasty and countless film roles was the star A-list celeb at a dinner to celebrate the 100th anniversary of the birth of Margaret Thatcher. \"I adored her, I thought she was a wonderful, wonderful inspirational person,\" she told me as she arrived at the VIP entrance at the Guildhall in the City of London. \"I wish we had somebody like that today to look up to and I think it was very sad that she left us so soon - and I'm freezing!\" With husband Percy Gibson, 32 years younger than Joanie, on her arm, the 92-year-old national treasure was due to make a speech at the glitzy dinner. But as she and Percy went inside to escape the chill of the evening, she somehow dropped one of her gloves, which matched her bright red evening dress, beside her car. Eager to come to the aid of a 92-year-old TV and movie star, after spotting it lying in the road, I picked it up and handed it to the Guildhall's friendly head of security, Richard Gentry. \n                  Starmer and other leaders have fallen into line on Trump's Gaza plan - now it must deliver\n                 \n                  UK played 'vital role' in Gaza peace deal, says Trump aide, after minister branded 'delusional'\n                 \n                  Politics latest: Tony Blair dodges Sky News questions about Gaza peace board controversy\n                 Within minutes, Dame Joan's driver had returned in her large black Mercedes and Richard handed the glove to him. My good deed for the evening was complete. Of course, the evening was all about dynasty, the Thatcher dynasty. The principal speaker at the dinner was Sir Mark Thatcher, tall, stylish and elegant in his DJ at the age of 72. \"I think my mother would be really impressed and warmed that there's such an important occasion and surrounded by her friends,\" he told me just before Joan and Percy arrived. I then asked Sir Mark if there were lessons for Kemi Badenoch to learn from the tough time his mother had in her early years as Opposition leader in the 1970s. \"It's certainly true that in my mother's early years, by my recollection, it wasn't perhaps as easy as it became later on,\" he said. \"I think there's similarity between the first two years of my mother's leadership and Kemi's leadership of the party. \"Both of them have become leaders in the face of a bitter election defeat. So there are some similarities.\" Last of the arrivals at the VIP entrance - no surprise! - was a typically jaunty Boris Johnson, who told me: \"The world needs to recover the clarity and logic of Margaret Thatcher.\" And asked what lessons Kemi Badenoch should learn from Margaret Thatcher, he said: \"I think Kemi Badenoch is amply endowed with Thatcherian characteristics of bounce and zap. She's got it, don't worry!\" And with that, he gave me a playful punch in the chest and dashed inside: the box office politician - still, according to his supporters - off to join a box office star of the screen."
    }
]