[
    {
        "title": "'We put our faith in one of the best children's hospitals' - families criticise hospital failings ",
        "description": "Families and victims affected by disgraced former Great Ormond Street Hospital surgeon Yaser Jabbar have spoken to Sky News after a report found that 94 children were harmed during the care he provided. &#160;",
        "url": "https://news.sky.com/story/we-put-our-faith-in-one-of-the-best-childrens-hospitals-families-criticise-hospital-failings160-13500852",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/image_7149830.jpg?20260129205134",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-29 22:31:00",
        "Headline": "He \"is still left with all the scars and the trauma that he's had to endure since he could walk,\" says one mother - \"an apology isn't enough\".",
        "Content": "Families and victims affected by disgraced former Great Ormond Street Hospital surgeon Yaser Jabbar have spoken to Sky News after a report found that 94 children were harmed during the care he provided.   WARNING: Contains images of children's injuries  The report found that over five years, the former orthopaedic surgeon harmed almost 100 children. Janetta Nana-Owusu was 12 when she suffered a botched surgery to straighten her legs at the hands of Jabbar at Great Ormond Street six years ago. She was one of the 36 children who suffered \"severe harm\" at the hands of Jabbar. Speaking to Sky News, she described \"excruciating pain\" after her first operation, \"the pain was really horrible\". She was left with permanent scarring along the length of her leg, she still can't walk long distances and continues to suffer from pain. \n                  Paedophile nursery worker Vincent Chan admits 30 new charges\n                 \n                  Kieran Humphreys jailed for violently shaking baby to death and attempting to cover it up\n                 \n                  Multiple recalls of contaminated baby formula traced to shared supplier\n                 Her mother, Catherine, said the ordeal had been and continues to be \"very upsetting, very devastating\". She wants to know \"why?\" \"It should not have been that way. Could it have been avoided?\" Darren and Kate, the parents of another child harmed due to the doctor, explain how their son, Vinnie, who is now 16, has been with Great Ormond Street since he was around 10 months old. He has a deformity to his left knee which means it's much bigger than his right one. Kate described how Jabbar did a surgery for the condition where \"they basically go in and freeze it\". She says her son developed frostbite from the surgery and was discharged the day after the procedure despite living two-and-a-half hours away. She said the experience was \"all very scary at that time\". Her son's knee has gone downhill since the surgery - \"he's struggled, he's struggled with his mobility\". 'We put our faith in... one of the best children's hospital' Kate said that once Yaser Jabbar was struck off, the family wasn't seen by the hospital for four years, and \"we had eight cancellations in that time\". She goes on to say that no one noticed that her son's leg was growing at a bow angle. It wasn't until the beginning of this year after seeing a different doctor that the family was told Vinnie would definitely need a leg procedure, Kate said. Read more from Sky News:Anthony Joshua pays tribute to friends killed in car crashChina executes 11 members of scam mafia family'He has to put his life on hold' Darren said although his son \"always tried\", his injury \"really held Vinnie back, especially sports-wise\". \"It's not just affected Vinnie physiologically, it's affected the whole family,\" he adds. Darren adds: \"We kind of put our faith in what's known as one of the best children's hospitals in the world, and now they've missed a four-year window to correct his leg, which is now going to make the procedure much more difficult.\" Kate stressed the mental trauma caused by Jabbar's surgery, explaining how parents get \"that guilt that they should have picked up\" that things weren't right. \"An apology isn't enough, is it?\" \"Vinnie is still left with all the scars and the trauma that he's had to endure since he could walk,\" she said. Yaser Jabbar no longer works at the hospital and didn't respond to Sky News's requests for comment. Great Ormond Street Hospital's chief executive, Matthew Shaw, said: \"There are no excuses for what has happened.\" He said he was \"deeply and profoundly sorry\" for the harm victims suffered. However, he insisted: \"I can genuinely say the department today is safer than it has ever been.\" Great Ormond Street has been contacted for further comment."
    },
    {
        "title": "Anthony Joshua pays tribute to friends killed in Nigeria crash",
        "description": "Anthony Joshua has paid tribute to his two close friends killed in a car cash in Nigeria last year.&#160;",
        "url": "https://news.sky.com/story/anthony-joshua-pays-tribute-to-friends-killed-in-nigeria-crash-13500819",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sina-ghami-anthony-joshua_7121784.jpg?20260104112553",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-29 21:34:00",
        "Headline": "Latif Ayodele and Sina Ghami died when an SUV, also carrying the 36-year-old boxer, hit a stationary truck on a road near Lagos.",
        "Content": "Anthony Joshua has paid tribute to his two close friends killed in a car cash in Nigeria last year.  In an emotional video posted on social media, the 36-year-old boxer, who sustained minor injuries in the collision, called the two men \"my left and my right\" and said he had been through a \"tragic, traumatic time\". Joshua was travelling in the back of a black SUV when it struck a stationary truck on a major road near Lagos on 29 December, killing Latif Ayodele and Sina Ghami. The two-time world champion had been on holiday with his friends following his knockout victory over US YouTuber turned-boxer Jake Paul in Miami on 19 December. Mr Ghami, who had been part of Joshua's team for more than a decade, was a strength and conditioning coach specialising in musculoskeletal injuries and corrective exercise. Mr Ayodele, an old friend of the boxer, was a personal trainer. \"We went back home, went to see our families and everything just got flipped upside on its head,\" Joshua said in the video. \"That was such an unforeseen circumstance, that was out of all our control. \"Not only did their parents, their uncles, their cousins, their friends and myself lose two great men, we lost people that we dearly care about and have been major players in all of our lives.\" Joshua described Mr Ghami and Mr Ayodele as \"my brothers\" and admitted that while he has \"lost people before\", he had not \"lost people like that\". \"It's tough. It's really tough,\" he added. \"I'm not going to sit here and show all of my emotions. I know in today's day and age it's easy to micro-analyse people and pass judgement. I know what I feel and that's what matters to me. I know what my duty is. They're my brothers, they're my friends, first and foremost. \"I've lost people before. But I don't think I've lost people like that. My left and my right… They were very important team members, very important friends and two of my brothers. \"I'm the big guy but I was walking with giants that kept me protected, kept me shielded.\" Read more from Sky News:Hospital surgeon harmed almost 100 children - reportTeenager pleads guilty to murder of 12-year-old boy Joshua also said he would support their families and thanked people for their tributes. \"My goal is to continue to help them achieve their goals. \"I'm going to do what's right by them, I'm going to do what's right by their family. \"I still can't get my head around, just my two friends, just how popular [they are]. We just grew up together. I've known them as my friends but they built such strong characters over the years. \"I'm sure their parents are 100% are proud of them because I am. \"Thank you for the love worldwide. For anyone out there that's lost a son, a brother, one love to you.\" Adeniyi Mobolaji Kayode, 46, has been charged with dangerous driving causing death, reckless and negligent driving, driving without due care and attention, and driving without a valid national driver's licence in connection with the crash. Kayode appeared at Sagamu Magistrate Court, in southwestern Ogun State, earlier this month. The case was adjourned until 25 February at the prosecution's request."
    },
    {
        "title": "Man charged with impersonating FBI agent in apparent bid to free Luigi Mangione from New York jail",
        "description": "A man has been charged with impersonating an FBI agent after he turned up to a New York jail claiming to have a court order to release Luigi Mangione, authorities have said.&#160;",
        "url": "https://news.sky.com/story/man-charged-with-impersonating-fbi-agent-in-apparent-bid-to-free-luigi-mangione-from-new-york-jail-13500865",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-luigi-mangione-court_7114246.jpg?20251218163000",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-29 23:04:00",
        "Headline": "When they searched the man's bag, officers found a barbecue fork and circular steel blade that resembled a pizza cutter.",
        "Content": "A man has been charged with impersonating an FBI agent after he turned up to a New York jail claiming to have a court order to release Luigi Mangione, authorities have said.  Mark Anderson, 36, from Minnesota, was arrested at the Metropolitan Detention Center in Brooklyn where Mangione, 27, is being held while awaiting trial for the murder of UnitedHealthcare chief executive Brian Thompson in 2024. According to a complaint filed against Anderson, he told prison officers that he was an FBI agent in possession of paperwork \"signed by a judge\" authorising the release of a specific inmate, whom a law enforcement source identified as Mangione. When the officers asked him for his credentials, Anderson allegedly showed them a Minnesota driving licence and claimed to have weapons. After searching his bag, officers found a barbecue fork and circular steel blade that resembled a pizza cutter. A law enforcement official said Anderson had travelled to New York from Minnesota, and was working at a pizzeria after another job opportunity fell through. The attempt to free Mangione happened hours after the Manhattan district attorney's office had sent a letter urging the judge in Mangione's case, Gregory Carro, to set a trial date of 1 July. \n                  Luigi Mangione wrote notes to himself, saying 'pluck eyebrows' and 'keep momentum, FBI slower overnight'\n                 \n                  Luigi Mangione had handgun, silencer and 'manifesto' in backpack during arrest, police say\n                 \n                  Luigi Mangione shown videos of UnitedHealthcare CEO killing as defence seeks to bar evidence\n                 Mangione will appear in court on Friday for a conference in his federal case. The judge, Margaret Garnett, is expected to rule soon whether prosecutors can seek the death penalty and whether they can use certain evidence against him. Last week, Ms Garnett scheduled jury selection in the federal case for 8 September, with the rest of the trial happening in October or January, depending on whether she allows prosecutors to seek the death penalty. Mangione has pleaded not guilty in both cases. Read more from Sky News:Congresswoman attacked with unknown substanceTesla axes EV models in drive for robotics revenue Mr Thompson, 50, was killed on 4 December 2024 as he walked to a New York City hotel for his company's annual investor conference. Mangione, an Ivy League graduate, was arrested five days later in Pennsylvania. After several days of court proceedings, Mangione was then transferred to the Metropolitan Detention Center. The jail is also currently holding former Venezuelan president Nicolas Maduro and his wife, Cilia Flores, who are facing drug trafficking charges."
    },
    {
        "title": "Woman charged with murder after death of one-year-old girl on Isle of Wight",
        "description": "A woman has been charged with murder after the death of a one-year-old girl on the Isle of Wight in August last year.",
        "url": "https://news.sky.com/story/woman-charged-with-murder-after-death-of-one-year-old-girl-on-isle-of-wight-13500864",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jayla-jean-mclaren_6985237.jpg?20250808000929",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-29 23:01:00",
        "Headline": "Jayla-Jean Mclaren died in hospital on 3 August, two days after she was taken there with serious injuries, police said.",
        "Content": "A woman has been charged with murder after the death of a one-year-old girl on the Isle of Wight in August last year. Jayla-Jean Mclaren died in hospital on 3 August, two days after she was taken there with serious injuries, Hampshire Police said. On Thursday, the force said Samara Jay Glover has been charged with murder and causing or allowing the death of a child. The 27-year-old, of Newport, remains in custody, police said. A 31-year-old man, also from Newport, was previously arrested on suspicion of murder, causing or allowing the death of a child, and causing assault/ill treatment/neglect/abandonment of a child/young person to cause unnecessary suffering/injury. He has been released on conditional bail until 27 April. Detective Chief Inspector Gemma Hunter said: \"We understand that cases such as this are incredibly concerning and upsetting. \n                  Man dies after lorry crashes into river in New Forest during Storm Chandra\n                 \n                  Outrage over 'ridiculous' compensation for 'unethical research' victims, including boys infected with HIV and hepatitis\n                 \n                  Murder investigation launched after 68-year-old woman stabbed to death in village\n                 \"However, we kindly ask that you do not speculate on this case, as it could potentially impact any future court proceedings. \"We will provide further updates on this investigation when appropriate.\" In a statement previously issued by police, the girl's family said: \"Mummy, daddy, and nanny will always love you. Fly high princess.\""
    },
    {
        "title": "Sir Keir Starmer's China trip provides exquisite optics for the 'world's most reliable superpower'",
        "description": "Let's be frank, in China the UK is not seen as a particularly big or important player.",
        "url": "https://news.sky.com/story/starmers-china-trip-provides-exquisite-optics-for-the-worlds-most-reliable-superpower-13500628",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-sir-keir-starmer-china_7149624.jpg?20260129153514",
        "type": "Home",
        "Author": "Helen-Ann Smith",
        "Date Published": "2026-01-29 13:16:00",
        "Headline": "The prime minister's trip could not come at a better time for Beijing, which dreams of turning the world away from the US.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n Let's be frank, in China the UK is not seen as a particularly big or important player. It's seen as a middling power at best, one that does have some advantages to offer, particularly in the service and knowledge economies, but one that has a greatly diminished global impact, particularly in the post Brexit years. Add to that 10 years of flip-flopping on China policy, very limited outreach and increasingly hawkish attitudes both in the British parliament and the general public, and it's hardly surprising that China didn't roll out the full five-star treatment for Sir Keir Starmer that it does with some visiting leaders. But despite all that, there were plenty of signs that the Chinese are happy to have a British prime minister here, not least for the optics. Much of what was said for the cameras at least was notable for its optimism, even warmth, and there's a sense the Chinese do see this as a moment of reset and smell genuine opportunity. In terms of the specifics of deals that were done, the Chinese releases didn't include masses of detail, but there was a sense that progress was made. They spoke about a hope for further cooperation on education, healthcare and financial services and the potential for joint research into future-reaching areas like AI, biosciences, new energy and low-carbon technology. This looks like a win for both sides: services are the UK's most important export to China, while the country is the world leader in manufacturing green energy technologies and is on the constant hunt for expanded markets in which to sell them. China holding firm It is clear that some trickier things came up in the room, too, things on which China wants to control the narrative. On Taiwan, there was a reaffirmation from the UK that its position \"remains unchanged and will not change\". Taiwan is a self-governing island that China sees as its own, and officially, most countries, including the UK, do not recognise it as an independent entity - getting nations to publicly restate this is hugely important to China. And we know Sir Keir had promised to raise the case of Jimmy Lai, the jailed Hong Kong democracy campaigner. In the Chinese readout, it said simply the two had agreed \"Hong Kong's prosperity and stability are in the common interest of both countries\" - that's probably China speak for \"it came up and we're not budging\". But perhaps the most interesting takeaways were the not-so-subtle hints dropped about the other major power at play in this dynamic - the United States.  \"Unilateralism, protectionism, and power politics has been rampant\" and that times are currently \"turbulent and fluid\". Indeed, from the Chinese perspective, Thursday mattered not because of what was achieved but because of who was watching. Playing the long game The optics of the British prime minister being here, revamping this relationship, at exactly the moment that Donald Trump is seriously disrupting traditional transatlantic partnerships, is exquisite for the Chinese. Indeed, under President Xi Jinping, China has long nurtured the narrative that it is, in fact, the world's most reliable superpower, that countries should look to it, and not the US, for stable global leadership. Read more from Sky News:Doctors share accounts of Iran crackdownPretti clashes with federal agents The current chaos being sown by Trump and the list of European powers knocking down China's door very much helps with that sell. China doesn't expect sudden changes of allegiance, but they do think the whole situation brings opportunity. In his opening remarks on Thursday, Xi quoted from a Chinese Proverb written by Chairman Mao, \"range far your eyes over long vistas\", the inference being that it's best to step back, consider the bigger picture and not get too distracted by short-term gains or losses. China always plays the long and strategic game. Be in no doubt, rekindling a relationship with this middling power is part of that."
    },
    {
        "title": "Former Little Mix singer tells Sky News how it was her mum who first noticed twins' rare genetic condition",
        "description": "Former Little Mix singer Jesy Nelson said none of the healthcare workers who checked her twin babies realised they had a rare genetic condition which means they may never walk - and it was only thanks to her mum that they were diagnosed.",
        "url": "https://news.sky.com/story/thank-god-for-my-mum-former-little-mix-singer-on-how-experts-missed-twins-rare-medical-condition-13500670",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-jesy-nelson_7149662.png?20260129164344",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-29 14:48:00",
        "Headline": "Speaking to Sky News' The UK Tonight programme with Sarah-Jane Mee, Ms Nelson described how her girls were diagnosed with the condition only at six months, despite repeated visits to the GP and healthcare visitors checking in on them. ",
        "Content": "Former Little Mix singer Jesy Nelson said none of the healthcare workers who checked her twin babies realised they had a rare genetic condition which means they may never walk - and it was only thanks to her mum that they were diagnosed. Earlier this month, Nelson, 34, announced in an emotional Instagram video that her baby twins had spinal muscular atrophy type 1 (SMA1). Speaking to Sky News' The UK Tonight programme with Sarah-Jane Mee, Nelson described how her girls were diagnosed with the condition only at six months, despite repeated visits to the GP and healthcare visitors checking in on them. \"When I took them home, I was very on edge about everything,\" she said. \"But the one thing I wasn't taking notice of was the movement of the legs…it took for my mum to spot that sign and that's what's really worrying because we had healthcare visitors come a lot and none of them spotted those signs.\" There is treatment for SMA, but an early diagnosis is key to its effectiveness. Read more from Sky News:Bereaved mother describes 'harrowing' stillbirth aftercareDoula warning issued after baby's death \n                  Bereaved mother describes 'harrowing' stillbirth aftercare\n                 Nelson said she took the twins to the GP three times because they weren't feeding properly but was told \"they are absolutely fine\". \"It wasn't until they got their diagnosis that they were then like we've got to keep them in because they're very underweight and they need to go on feeding tubes... and now they are still on feeding tubes. \"That just goes to show how little awareness there is about it.\" Nelson continued: \"Thank God for my mum because I dread to think what position I'd be in now if my mum hadn't had said anything to me... \"It's one of those things that I constantly go over and I have to sometimes stop myself from doing it because I will just like drive myself insane.\" Nelson recently met with Health Secretary Wes Streeting to raise awareness about the condition and continue the conversation on SMA. She said she won't stop talking about it on her socials or in the media as there are still a lot of people who don't know about the condition, so \"I've got to stay noisy\". Watch the full interview with Jesy Nelson on Sky News' The UK Tonight from 8pm on Thursday."
    },
    {
        "title": "94 patients were harmed during care by Great Ormond Street Hospital orthopaedic surgeon Yaser Jabbar, report finds",
        "description": "A report into disgraced former Great Ormond Street Hospital surgeon Yaser Jabbar has found that 94 children were harmed during the care he provided.  ",
        "url": "https://news.sky.com/story/94-patients-were-harmed-during-care-by-great-ormond-street-hospital-orthopaedic-surgeon-yaser-jabbar-report-finds-13500503",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-yaser-jabbar-surgeon_7149469.jpg?20260129123534",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-29 13:29:00",
        "Headline": "The hospital has reviewed 789 cases in which surgeon Yaser Jabbar treated children over five years, with 36 children being found to have suffered severe harm. ",
        "Content": "A report into disgraced former Great Ormond Street Hospital surgeon Yaser Jabbar has found that 94 children were harmed during the care he provided.   The Great Ormond Street Hospital for Children (GOSH) released a report on Thursday into the actions of the former orthopaedic surgeon who treated hundreds of children over five years. The review found that 98 patients (12.4%) experienced some level of harm, and 94 of these cases were linked specifically to the care provided by Mr Jabbar. The London hospital undertook a clinical case review of 789 of Jabbar's cases after concerns were raised about his clinical practice. Some patients were left in continuous pain or needed further corrective surgeries, the independent review found. Harm gradings ranged from mild, such as an unnecessary general anaesthetic, to severe gradings for situations like delayed diagnosis of complications or surgery that did not achieve the intended outcome. Some 36 children suffered severe harm because of Jabbar, who worked at the hospital between 2017 and 2022 and focused on lower limb reconstructions. A further 39 patients suffered moderate harm and 19 patients came to mild harm, the report said. \"There were instances of premature removal of fixation devices, the combination of procedures without clear rationale, inadequate counselling on fracture risk, and an over-reliance on junior staff,\" the report said. Laura Bundock, Health correspondent Managers have apologised unreservedly to patients and their families. But those who've been left with life lasting injuries, harmed by the surgeon they believed would help them, are still angry.  They want to know how the poor practices of Yaser Jabbar went unnoticed for so long. Why the systems supposedly in place to protect patient safety failed with such serious consequences.  Ninety four young patients trusted Great Ormond Street and its global reputation as a leading centre of excellence. They have all suffered harm, and many continue to do so. Their lives changed not just by a rogue surgeon, but by a hospital which missed opportunities to pick up and prevent its own failings. \"There were some serious problems found, including poor planning before surgery, not making the area stable enough, unclear or incomplete notes, and putting implants in the wrong place. \"Other issues were making cuts in the bone at the wrong level or using the wrong method, making decisions that didn't match what was seen in the scans during surgery, problems with how frames and pins were used, and not involving the wider team when dealing with infections.\" Analysis of the independent expert case reports \"identified that Mr Jabbar was highly inconsistent in his approach to clinical care with recurrent deficiencies in documentation, assessment, and surgical decision-making\", the report said. James Wood, 19, from Great Yarmouth, was left in \"horrifying\" pain after Jabbar carried out a procedure to stretch the tissue in his knee by fixing a frame to his leg. He also carried out an Achilles tendon lengthening procedure. Mr Wood - who was born with multiple pterygium syndrome that caused skin webbing across the joints - experienced extreme pain and swelling in his right thigh. It was later found that one of the pins used to secure the frame had protruded into Mr Wood's thigh, causing bleeding and damage to the femoral artery when it was removed. In another case, a leg-lengthening procedure Jabbar carried out on Vivaan Sharma, 12, to correct a shortened and bowed right leg was found to have been \"incorrect and unsuitable\". Jabbar was found to have used a different frame to the one commonly used in such procedures, with the issue being too complex to resolve in a single procedure. Though the report found Vivaan had suffered moderate harm, his parents said the treatment had impacted his independence beyond six months and caused nightmares. \"It's appalling. Our boy will be affected for life,\" Mr Sharma said. In some cases, patient records were incomplete, meaning it was not possible to reach a clear conclusion. A very small number of children came to harm for reasons not related to Mr Jabbar, such as administrative delays or issues involving other clinicians. Read more from Sky News:Teenager pleads guilty to murder of 12-year-old boyLondon bus driver sacked for punching man who stole necklace GOSH chief executive Matthew Shaw apologised to affected families on Thursday, branding Jabbar's practice as \"entirely unacceptable\". \"We are profoundly sorry to all the patients and their families who have been affected by the care provided by Mr Jabbar,\" he said. \"The report we have published today sets out in full what happened, what we found in our review of patients, what we have learnt and what we have done as a consequence.\" Mr Shaw said significant changes had been made at the hospital but acknowledged \"this comes too late for the families affected by this issue\". A Metropolitan Police spokesperson said: \"We will review the report commissioned by GOSH and assess whether there is any requirement for police involvement.\" Mr Jabbar rescinded his UK medical licence in January 2024. He is believed to have since moved overseas. Sky News has attempted to contact representatives for Mr Jabbar."
    },
    {
        "title": "Teenager pleads guilty to murder of 12-year-old boy Leo Ross in Birmingham",
        "description": "A teenager has pleaded guilty to the murder of a 12-year-old boy from Birmingham.",
        "url": "https://news.sky.com/story/teenager-pleads-guilty-to-murder-of-12-year-old-boy-leo-ross-in-birmingham-13500583",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-leo-ross-stabbing-victim_6807648.jpg?20260129132429",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-29 13:09:00",
        "Headline": "The schoolboy suffered fatal injuries after he was stabbed in the stomach while on a riverside path in the Hall Green area of the city in January last year.",
        "Content": "A teenager has pleaded guilty to the murder of a 12-year-old boy from Birmingham. Leo Ross suffered fatal injuries after he was stabbed in the stomach while on a riverside path in the Hall Green area of the city in January last year. The 15-year-old killer, who was 14 at the time of the fatal attack, cannot be named for legal reasons. The boy also admitted two counts of causing grievous bodily harm with intent on 19 and 20 January 2025 and assault occasioning actual bodily harm on 21 January 2025 in relation to separate attacks on other victims, as well as having a bladed article on the day he murdered Leo. He denied assault occasioning actual bodily harm on 22 October 2024 and assault by beating on 29 December 2024 in relation to two other people and those charges were ordered to lie on file. Leo was walking home from the Christ Church, Church of England Secondary Academy in Yardley Wood when he was stabbed in the random and unprovoked attack. His foster family, the Westons, said his loss had impacted them \"deeply and his absence is felt constantly\". Leo's birth mother, Rachel Fisher, described her son as the \"sweetest, most kind-hearted boy\". She added: \"My baby's life was stolen for no reason whatsoever. My life will never be the same again without him.\" Subsequent police inquiries established that the murder weapon was thrown into a nearby river. The killer, riding a bike, was also found to have previously hunted down and attacked several women in local parkland. West Midlands Police also found that the killer opted to hang around to talk to officers at the murder scene, falsely claiming he had stumbled across Leo lying fatally injured beside the River Cole. The Crown Prosecution Service (CPS) said it built a comprehensive case using witness statements, forensic evidence and detailed analysis of CCTV to track the defendant's movements, \"which left him no option but to plead guilty\". CCTV placed the boy near the scene immediately before and after Leo's murder. A knife matching the dimensions of Leo's injury was recovered near the scene and forensic examination linked it to both the murder and the defendant, and clothing seized from the boy's home also contained Leo's blood. Senior Crown prosecutor Jonathan Roe said: \"This was a senseless act of violence that has devastated a family and robbed a 12-year-old boy of his life. \"Leo Ross should have had his whole future ahead of him, and he should have been able to walk home from school without harm. \"It seems unimaginable that a 14-year-old would use a knife to intend to murder another, or seriously injure them causing their death, but that is what occurred on that day. \"The defendant's guilty plea today means Leo's loved ones have at least been spared the ordeal of a trial. Our thoughts remain with them as they continue to cope with this unimaginable loss.\" Sentencing will take place at Birmingham Crown Court on 10 February, with Judge Paul Farrer KC remanding the boy into youth detention in the meantime. Read more from Sky News:Shoplifter killed Asda security guard during struggle over alcoholMan arrested after pensioner tied up during robbery bid Detective Inspector Joe Davenport described it as a \"heartbreaking and senseless attack\". He added: \"Because of this boy's actions, Leo and his family have been robbed of the life he could have lived. \"I'd like to thank the members of the community who tried to save Leo's life, as well as the paramedics at the scene. \"Thanks to the public, who responded to our appeals for information and provided witness accounts and images, we were able to piece together the events which led to Leo's death. \"Our thoughts remain with Leo's family and we hope they can gain some closure knowing justice has been done.\""
    },
    {
        "title": "Woman charged with murder after death of one-year-old girl on Isle of Wight",
        "description": "A woman has been charged with murder after the death of a one-year-old girl on the Isle of Wight in August last year.",
        "url": "https://news.sky.com/story/woman-charged-with-murder-after-death-of-one-year-old-girl-on-isle-of-wight-13500864",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jayla-jean-mclaren_6985237.jpg?20250808000929",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-29 23:01:00",
        "Headline": "Jayla-Jean Mclaren died in hospital on 3 August, two days after she was taken there with serious injuries, police said.",
        "Content": "A woman has been charged with murder after the death of a one-year-old girl on the Isle of Wight in August last year. Jayla-Jean Mclaren died in hospital on 3 August, two days after she was taken there with serious injuries, Hampshire Police said. On Thursday, the force said Samara Jay Glover has been charged with murder and causing or allowing the death of a child. The 27-year-old, of Newport, remains in custody, police said. A 31-year-old man, also from Newport, was previously arrested on suspicion of murder, causing or allowing the death of a child, and causing assault/ill treatment/neglect/abandonment of a child/young person to cause unnecessary suffering/injury. He has been released on conditional bail until 27 April. Detective Chief Inspector Gemma Hunter said: \"We understand that cases such as this are incredibly concerning and upsetting. \n                  Man dies after lorry crashes into river in New Forest during Storm Chandra\n                 \n                  Outrage over 'ridiculous' compensation for 'unethical research' victims, including boys infected with HIV and hepatitis\n                 \n                  Murder investigation launched after 68-year-old woman stabbed to death in village\n                 \"However, we kindly ask that you do not speculate on this case, as it could potentially impact any future court proceedings. \"We will provide further updates on this investigation when appropriate.\" In a statement previously issued by police, the girl's family said: \"Mummy, daddy, and nanny will always love you. Fly high princess.\""
    },
    {
        "title": "Anthony Joshua pays tribute to friends killed in Nigeria crash",
        "description": "Anthony Joshua has paid tribute to his two close friends killed in a car cash in Nigeria last year.&#160;",
        "url": "https://news.sky.com/story/anthony-joshua-pays-tribute-to-friends-killed-in-nigeria-crash-13500819",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sina-ghami-anthony-joshua_7121784.jpg?20260104112553",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-29 21:34:00",
        "Headline": "Latif Ayodele and Sina Ghami died when an SUV, also carrying the 36-year-old boxer, hit a stationary truck on a road near Lagos.",
        "Content": "Anthony Joshua has paid tribute to his two close friends killed in a car cash in Nigeria last year.  In an emotional video posted on social media, the 36-year-old boxer, who sustained minor injuries in the collision, called the two men \"my left and my right\" and said he had been through a \"tragic, traumatic time\". Joshua was travelling in the back of a black SUV when it struck a stationary truck on a major road near Lagos on 29 December, killing Latif Ayodele and Sina Ghami. The two-time world champion had been on holiday with his friends following his knockout victory over US YouTuber turned-boxer Jake Paul in Miami on 19 December. Mr Ghami, who had been part of Joshua's team for more than a decade, was a strength and conditioning coach specialising in musculoskeletal injuries and corrective exercise. Mr Ayodele, an old friend of the boxer, was a personal trainer. \"We went back home, went to see our families and everything just got flipped upside on its head,\" Joshua said in the video. \"That was such an unforeseen circumstance, that was out of all our control. \"Not only did their parents, their uncles, their cousins, their friends and myself lose two great men, we lost people that we dearly care about and have been major players in all of our lives.\" Joshua described Mr Ghami and Mr Ayodele as \"my brothers\" and admitted that while he has \"lost people before\", he had not \"lost people like that\". \"It's tough. It's really tough,\" he added. \"I'm not going to sit here and show all of my emotions. I know in today's day and age it's easy to micro-analyse people and pass judgement. I know what I feel and that's what matters to me. I know what my duty is. They're my brothers, they're my friends, first and foremost. \"I've lost people before. But I don't think I've lost people like that. My left and my right… They were very important team members, very important friends and two of my brothers. \"I'm the big guy but I was walking with giants that kept me protected, kept me shielded.\" Read more from Sky News:Hospital surgeon harmed almost 100 children - reportTeenager pleads guilty to murder of 12-year-old boy Joshua also said he would support their families and thanked people for their tributes. \"My goal is to continue to help them achieve their goals. \"I'm going to do what's right by them, I'm going to do what's right by their family. \"I still can't get my head around, just my two friends, just how popular [they are]. We just grew up together. I've known them as my friends but they built such strong characters over the years. \"I'm sure their parents are 100% are proud of them because I am. \"Thank you for the love worldwide. For anyone out there that's lost a son, a brother, one love to you.\" Adeniyi Mobolaji Kayode, 46, has been charged with dangerous driving causing death, reckless and negligent driving, driving without due care and attention, and driving without a valid national driver's licence in connection with the crash. Kayode appeared at Sagamu Magistrate Court, in southwestern Ogun State, earlier this month. The case was adjourned until 25 February at the prosecution's request."
    },
    {
        "title": "British girl, 7, missing after being hit by wave in Morocco",
        "description": "A seven-year-old girl is missing after she was \"swept away by a wave\" in Morocco, an MP has said.",
        "url": "https://news.sky.com/story/british-girl-7-missing-after-being-hit-by-wave-in-morocco-13500826",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-inaayah-makda_7149913.jpg?20260129222322",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-29 21:54:00",
        "Headline": "The girl, who is from Blackburn in Lancashire and was named locally as Inaayah Makda, was on holiday with her family in the coastal city of Casablanca when she vanished on Wednesday.",
        "Content": "A seven-year-old girl is missing after she was \"swept away by a wave\" in Morocco, an MP has said. The girl, who is from Blackburn in Lancashire and was named locally as Inaayah Makda, on holiday with her family in the coastal city of Casablanca when she vanished on Wednesday. In a post on social media on Thursday morning, independent MP for Blackburn Adnan Hussain said he had spoken directly with Inaayah's father and aunt to offer his support and that the Blackburn community was \"united in hope and prayer\" for the girl and her loved ones. He wrote: \"I am heartbroken by the news that 7-year-old Inaayah from Blackburn has been swept away by a wave while on holiday in Casablanca. \"My thoughts and prayers are with her family at this unimaginably painful time.\" Read more:Postponed local elections - what is happening?Will renewable licences put off budding police officers? The girl's family told the BBC she was hit by a large wave on Wednesday as she sat on rocks at the beach with her parents. \n                  Third person arrested after Blackburn man hit by car after bar argument on Christmas Day\n                 \n                  Blackburn Rovers manager John Eustace charged over clash with Coventry midfielder Kasey Palmer\n                 \n                  Two jailed after police seize £17.2m worth of cocaine hidden inside blocks of cheese\n                 A Foreign, Commonwealth and Development Office spokesperson said: \"We are supporting the family of a British national reported missing in Morocco and are in contact with the local authorities.\" Masters of Martial Arts Blackburn said in a statement on social media: \"It is with heavy hearts that we share our love and support for Inaayah Makda, a young student from our club, and her family during this unimaginably distressing time. \"Inaayah, aged 7 and from Blackburn, was tragically swept out to sea by a large wave while on holiday with her family in Morocco and is missing. Family members have been desperately searching for her. \"Words cannot express how deeply saddened we are by this news. We are holding Inaayah, her parents, and their entire family in our thoughts and prayers.\""
    },
    {
        "title": "Former Little Mix singer tells Sky News how it was her mum who first noticed twins' rare genetic condition",
        "description": "Former Little Mix singer Jesy Nelson said none of the healthcare workers who checked her twin babies realised they had a rare genetic condition which means they may never walk - and it was only thanks to her mum that they were diagnosed.",
        "url": "https://news.sky.com/story/thank-god-for-my-mum-former-little-mix-singer-on-how-experts-missed-twins-rare-medical-condition-13500670",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-jesy-nelson_7149662.png?20260129164344",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-29 14:48:00",
        "Headline": "Speaking to Sky News' The UK Tonight programme with Sarah-Jane Mee, Ms Nelson described how her girls were diagnosed with the condition only at six months, despite repeated visits to the GP and healthcare visitors checking in on them. ",
        "Content": "Former Little Mix singer Jesy Nelson said none of the healthcare workers who checked her twin babies realised they had a rare genetic condition which means they may never walk - and it was only thanks to her mum that they were diagnosed. Earlier this month, Nelson, 34, announced in an emotional Instagram video that her baby twins had spinal muscular atrophy type 1 (SMA1). Speaking to Sky News' The UK Tonight programme with Sarah-Jane Mee, Nelson described how her girls were diagnosed with the condition only at six months, despite repeated visits to the GP and healthcare visitors checking in on them. \"When I took them home, I was very on edge about everything,\" she said. \"But the one thing I wasn't taking notice of was the movement of the legs…it took for my mum to spot that sign and that's what's really worrying because we had healthcare visitors come a lot and none of them spotted those signs.\" There is treatment for SMA, but an early diagnosis is key to its effectiveness. Read more from Sky News:Bereaved mother describes 'harrowing' stillbirth aftercareDoula warning issued after baby's death \n                  Bereaved mother describes 'harrowing' stillbirth aftercare\n                 Nelson said she took the twins to the GP three times because they weren't feeding properly but was told \"they are absolutely fine\". \"It wasn't until they got their diagnosis that they were then like we've got to keep them in because they're very underweight and they need to go on feeding tubes... and now they are still on feeding tubes. \"That just goes to show how little awareness there is about it.\" Nelson continued: \"Thank God for my mum because I dread to think what position I'd be in now if my mum hadn't had said anything to me... \"It's one of those things that I constantly go over and I have to sometimes stop myself from doing it because I will just like drive myself insane.\" Nelson recently met with Health Secretary Wes Streeting to raise awareness about the condition and continue the conversation on SMA. She said she won't stop talking about it on her socials or in the media as there are still a lot of people who don't know about the condition, so \"I've got to stay noisy\". Watch the full interview with Jesy Nelson on Sky News' The UK Tonight from 8pm on Thursday."
    },
    {
        "title": "'We put our faith in one of the best children's hospitals' - families criticise hospital failings ",
        "description": "Families and victims affected by disgraced former Great Ormond Street Hospital surgeon Yaser Jabbar have spoken to Sky News after a report found that 94 children were harmed during the care he provided. &#160;",
        "url": "https://news.sky.com/story/we-put-our-faith-in-one-of-the-best-childrens-hospitals-families-criticise-hospital-failings160-13500852",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/image_7149830.jpg?20260129205134",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-29 22:31:00",
        "Headline": "He \"is still left with all the scars and the trauma that he's had to endure since he could walk,\" says one mother - \"an apology isn't enough\".",
        "Content": "Families and victims affected by disgraced former Great Ormond Street Hospital surgeon Yaser Jabbar have spoken to Sky News after a report found that 94 children were harmed during the care he provided.   WARNING: Contains images of children's injuries  The report found that over five years, the former orthopaedic surgeon harmed almost 100 children. Janetta Nana-Owusu was 12 when she suffered a botched surgery to straighten her legs at the hands of Jabbar at Great Ormond Street six years ago. She was one of the 36 children who suffered \"severe harm\" at the hands of Jabbar. Speaking to Sky News, she described \"excruciating pain\" after her first operation, \"the pain was really horrible\". She was left with permanent scarring along the length of her leg, she still can't walk long distances and continues to suffer from pain. \n                  Paedophile nursery worker Vincent Chan admits 30 new charges\n                 \n                  Kieran Humphreys jailed for violently shaking baby to death and attempting to cover it up\n                 \n                  Multiple recalls of contaminated baby formula traced to shared supplier\n                 Her mother, Catherine, said the ordeal had been and continues to be \"very upsetting, very devastating\". She wants to know \"why?\" \"It should not have been that way. Could it have been avoided?\" Darren and Kate, the parents of another child harmed due to the doctor, explain how their son, Vinnie, who is now 16, has been with Great Ormond Street since he was around 10 months old. He has a deformity to his left knee which means it's much bigger than his right one. Kate described how Jabbar did a surgery for the condition where \"they basically go in and freeze it\". She says her son developed frostbite from the surgery and was discharged the day after the procedure despite living two-and-a-half hours away. She said the experience was \"all very scary at that time\". Her son's knee has gone downhill since the surgery - \"he's struggled, he's struggled with his mobility\". 'We put our faith in... one of the best children's hospital' Kate said that once Yaser Jabbar was struck off, the family wasn't seen by the hospital for four years, and \"we had eight cancellations in that time\". She goes on to say that no one noticed that her son's leg was growing at a bow angle. It wasn't until the beginning of this year after seeing a different doctor that the family was told Vinnie would definitely need a leg procedure, Kate said. Read more from Sky News:Anthony Joshua pays tribute to friends killed in car crashChina executes 11 members of scam mafia family'He has to put his life on hold' Darren said although his son \"always tried\", his injury \"really held Vinnie back, especially sports-wise\". \"It's not just affected Vinnie physiologically, it's affected the whole family,\" he adds. Darren adds: \"We kind of put our faith in what's known as one of the best children's hospitals in the world, and now they've missed a four-year window to correct his leg, which is now going to make the procedure much more difficult.\" Kate stressed the mental trauma caused by Jabbar's surgery, explaining how parents get \"that guilt that they should have picked up\" that things weren't right. \"An apology isn't enough, is it?\" \"Vinnie is still left with all the scars and the trauma that he's had to endure since he could walk,\" she said. Yaser Jabbar no longer works at the hospital and didn't respond to Sky News's requests for comment. Great Ormond Street Hospital's chief executive, Matthew Shaw, said: \"There are no excuses for what has happened.\" He said he was \"deeply and profoundly sorry\" for the harm victims suffered. However, he insisted: \"I can genuinely say the department today is safer than it has ever been.\" Great Ormond Street has been contacted for further comment."
    },
    {
        "title": "Body found in search for missing kayaker",
        "description": "A body has been found in the search for a missing kayaker in Devon.&#160;",
        "url": "https://news.sky.com/story/body-found-in-search-for-missing-kayaker-13500762",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-devon-police_7149766.jpg?20260129185732",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-29 18:22:00",
        "Headline": "Devon and Cornwall Police said the family of a man in his 40s had been informed following the discovery in the River Exe.",
        "Content": "A body has been found in the search for a missing kayaker in Devon.  Police said the remains were recovered from the River Exe on Thursday. Officers were first called to the river, near the Great Western Bridge in Tiverton, at 3.50pm on Saturday. It was reported that a man in his 40s had got into difficulties while kayaking. His boat was later recovered following a search. A spokeswoman for Devon and Cornwall Police said: \"Formal identification has yet to take place but the family of the missing kayaker - a man in his 40s - has been made aware of this development.\" Read more from Sky News:Surgeon harmed 94 children, report findsTeenager admits murdering 12-year-oldSantander UK to shut 44 branches It comes after two bodies were found in the search for two men who went missing after going for a swim from a beach in Devon on Christmas Day. The body of one of the men, believed to be antiques shop owner Matthew Upham, was recovered on Sunday, although formal identification is yet to be carried out. The body of a 47-year-old man, thought to be the other swimmer, was recovered on 20 January."
    },
    {
        "title": "British girl, 7, missing after being hit by wave in Morocco",
        "description": "A seven-year-old girl is missing after she was \"swept away by a wave\" in Morocco, an MP has said.",
        "url": "https://news.sky.com/story/british-girl-7-missing-after-being-hit-by-wave-in-morocco-13500826",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-inaayah-makda_7149913.jpg?20260129222322",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-29 21:54:00",
        "Headline": "The girl, who is from Blackburn in Lancashire and was named locally as Inaayah Makda, was on holiday with her family in the coastal city of Casablanca when she vanished on Wednesday.",
        "Content": "A seven-year-old girl is missing after she was \"swept away by a wave\" in Morocco, an MP has said. The girl, who is from Blackburn in Lancashire and was named locally as Inaayah Makda, on holiday with her family in the coastal city of Casablanca when she vanished on Wednesday. In a post on social media on Thursday morning, independent MP for Blackburn Adnan Hussain said he had spoken directly with Inaayah's father and aunt to offer his support and that the Blackburn community was \"united in hope and prayer\" for the girl and her loved ones. He wrote: \"I am heartbroken by the news that 7-year-old Inaayah from Blackburn has been swept away by a wave while on holiday in Casablanca. \"My thoughts and prayers are with her family at this unimaginably painful time.\" Read more:Postponed local elections - what is happening?Will renewable licences put off budding police officers? The girl's family told the BBC she was hit by a large wave on Wednesday as she sat on rocks at the beach with her parents. \n                  Third person arrested after Blackburn man hit by car after bar argument on Christmas Day\n                 \n                  Blackburn Rovers manager John Eustace charged over clash with Coventry midfielder Kasey Palmer\n                 \n                  Two jailed after police seize £17.2m worth of cocaine hidden inside blocks of cheese\n                 A Foreign, Commonwealth and Development Office spokesperson said: \"We are supporting the family of a British national reported missing in Morocco and are in contact with the local authorities.\" Masters of Martial Arts Blackburn said in a statement on social media: \"It is with heavy hearts that we share our love and support for Inaayah Makda, a young student from our club, and her family during this unimaginably distressing time. \"Inaayah, aged 7 and from Blackburn, was tragically swept out to sea by a large wave while on holiday with her family in Morocco and is missing. Family members have been desperately searching for her. \"Words cannot express how deeply saddened we are by this news. We are holding Inaayah, her parents, and their entire family in our thoughts and prayers.\""
    },
    {
        "title": "China executes 11 members of Myanmar-based scam mafia family ",
        "description": "China has executed 11 members of a mafia family for killing 14 people and running a crime syndicate worth more than $1bn, authorities said.&#160;",
        "url": "https://news.sky.com/story/china-executes-11-members-of-myanmar-based-scam-mafia-family-13500512",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-china-myanmar-ming_7149224.png?20260129073446",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-29 09:25:00",
        "Headline": "Members of the Ming family had been found guilty of killing 14 Chinese citizens, as well as illegal detention and fraud.",
        "Content": "China has executed 11 members of a mafia family for killing 14 people and running a crime syndicate worth more than $1bn, authorities said.  In September, the Ming family members, including Ming Guoping, Ming Zhenzhen, Zhou Weichang, Wu Hongming and Luao Jianzhang, were sentenced to death for a host of crimes. They had been found guilty of killing 14 Chinese citizens, as well as illegal detention and fraud. The Wenzhou city Intermediate People's Court announced the execution in a statement on Thursday morning. Members of the group were detained in 2013 after Chinese authorities pressured authorities in the border areas shared with Myanmar to crack down on scams. After being sentenced to death in September the group filed an appeal, which was rejected. Myanmar's military claimed the family's patriarch, Ming Xuechang, took his own life in 2023 to avoid being captured. Read more from Sky News:Alex Pretti seen in altercation days before ICE killingDoctors share accounts of Iran crackdown Scam parks have grown to an industrial-scale business in Southeast Asia, especially in Myanmar, Cambodia and Laos. Authorities in the region face growing international pressure from China, the US and other nations to address the proliferation of criminal activity. In recent years, China executed more people than any other country - sometimes more than every other country in the world combined."
    },
    {
        "title": "Man charged with impersonating FBI agent in apparent bid to free Luigi Mangione from New York jail",
        "description": "A man has been charged with impersonating an FBI agent after he turned up to a New York jail claiming to have a court order to release Luigi Mangione, authorities have said.&#160;",
        "url": "https://news.sky.com/story/man-charged-with-impersonating-fbi-agent-in-apparent-bid-to-free-luigi-mangione-from-new-york-jail-13500865",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-luigi-mangione-court_7114246.jpg?20251218163000",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-29 23:04:00",
        "Headline": "When they searched the man's bag, officers found a barbecue fork and circular steel blade that resembled a pizza cutter.",
        "Content": "A man has been charged with impersonating an FBI agent after he turned up to a New York jail claiming to have a court order to release Luigi Mangione, authorities have said.  Mark Anderson, 36, from Minnesota, was arrested at the Metropolitan Detention Center in Brooklyn where Mangione, 27, is being held while awaiting trial for the murder of UnitedHealthcare chief executive Brian Thompson in 2024. According to a complaint filed against Anderson, he told prison officers that he was an FBI agent in possession of paperwork \"signed by a judge\" authorising the release of a specific inmate, whom a law enforcement source identified as Mangione. When the officers asked him for his credentials, Anderson allegedly showed them a Minnesota driving licence and claimed to have weapons. After searching his bag, officers found a barbecue fork and circular steel blade that resembled a pizza cutter. A law enforcement official said Anderson had travelled to New York from Minnesota, and was working at a pizzeria after another job opportunity fell through. The attempt to free Mangione happened hours after the Manhattan district attorney's office had sent a letter urging the judge in Mangione's case, Gregory Carro, to set a trial date of 1 July. \n                  Luigi Mangione wrote notes to himself, saying 'pluck eyebrows' and 'keep momentum, FBI slower overnight'\n                 \n                  Luigi Mangione had handgun, silencer and 'manifesto' in backpack during arrest, police say\n                 \n                  Luigi Mangione shown videos of UnitedHealthcare CEO killing as defence seeks to bar evidence\n                 Mangione will appear in court on Friday for a conference in his federal case. The judge, Margaret Garnett, is expected to rule soon whether prosecutors can seek the death penalty and whether they can use certain evidence against him. Last week, Ms Garnett scheduled jury selection in the federal case for 8 September, with the rest of the trial happening in October or January, depending on whether she allows prosecutors to seek the death penalty. Mangione has pleaded not guilty in both cases. Read more from Sky News:Congresswoman attacked with unknown substanceTesla axes EV models in drive for robotics revenue Mr Thompson, 50, was killed on 4 December 2024 as he walked to a New York City hotel for his company's annual investor conference. Mangione, an Ivy League graduate, was arrested five days later in Pennsylvania. After several days of court proceedings, Mangione was then transferred to the Metropolitan Detention Center. The jail is also currently holding former Venezuelan president Nicolas Maduro and his wife, Cilia Flores, who are facing drug trafficking charges."
    },
    {
        "title": "Colombia plane crash kills 15 including politician",
        "description": "A small passenger plane has crashed in northern Colombia, killing all 15 people on board, including a congressman.",
        "url": "https://news.sky.com/story/colombia-plane-crash-kills-15-including-politician-13500469",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-colombia-playa-de-belen_7149194.jpg?20260129070828",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-29 06:51:00",
        "Headline": "Rescue crews located the crash site in the mountainous rural area of Norte de Santander near the Venezuelan border and \"regrettably confirmed that there were no survivors\", officials said.",
        "Content": "A small passenger plane has crashed in northern Colombia, killing all 15 people on board, including a congressman. Rescuers located the crash site and \"regrettably confirmed that there were no survivors\", Colombia's transportation ministry said. Two crew members and 13 passengers - including Diogenes Quintero, 36, a member of the House of Representatives for Catatumbo, and Carlos Salcedo, who was running for Congress - died in the incident. The aircraft, operated by state-owned airline Satena, took off on Wednesday at 11.42am local time from Cucuta bound for Ocana, a mountainous region, on a flight that typically lasts about 40 minutes. The aircraft's final contact with air traffic control came minutes after take off, Satena said. Satena did not say what caused the Beechcraft 1900 twin-engine turboprop ​plane to crash, adding the aircraft's emergency beacon had not been activated. The cause of the crash - in the rural area of Norte de Santander near the Venezuelan border - is being investigated. Mr Quintero was a renowned human rights activist in the troubled border region. The lawyer was elected in 2022 as one of 16 representatives in the lower chamber to represent the more than nine million victims of Colombia's decades-long armed conflict. His party, the U Party, paid tribute to him, describing him as \"a leader committed to his region, with a firm vocation for service\". Read more from Sky News:Doctors share disturbing accounts of Iran crackdownICE victim seen in earlier clash with agents in new video 👉 Tap here to follow The World with Richard Engel and Yalda Hakim wherever you get your podcasts 👈 Colombian President Gustavo Petro said in a post on social media: \"I am deeply saddened by these deaths. \"My heartfelt condolences to their families. May they rest in peace.\" Satena said officials in the community of Curasica alerted authorities about where the plane had gone down, and a rescue team was deployed to the site."
    },
    {
        "title": "Sir Keir Starmer's China trip provides exquisite optics for the 'world's most reliable superpower'",
        "description": "Let's be frank, in China the UK is not seen as a particularly big or important player.",
        "url": "https://news.sky.com/story/starmers-china-trip-provides-exquisite-optics-for-the-worlds-most-reliable-superpower-13500628",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-sir-keir-starmer-china_7149624.jpg?20260129153514",
        "type": "World",
        "Author": "Helen-Ann Smith",
        "Date Published": "2026-01-29 13:16:00",
        "Headline": "The prime minister's trip could not come at a better time for Beijing, which dreams of turning the world away from the US.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n Let's be frank, in China the UK is not seen as a particularly big or important player. It's seen as a middling power at best, one that does have some advantages to offer, particularly in the service and knowledge economies, but one that has a greatly diminished global impact, particularly in the post Brexit years. Add to that 10 years of flip-flopping on China policy, very limited outreach and increasingly hawkish attitudes both in the British parliament and the general public, and it's hardly surprising that China didn't roll out the full five-star treatment for Sir Keir Starmer that it does with some visiting leaders. But despite all that, there were plenty of signs that the Chinese are happy to have a British prime minister here, not least for the optics. Much of what was said for the cameras at least was notable for its optimism, even warmth, and there's a sense the Chinese do see this as a moment of reset and smell genuine opportunity. In terms of the specifics of deals that were done, the Chinese releases didn't include masses of detail, but there was a sense that progress was made. They spoke about a hope for further cooperation on education, healthcare and financial services and the potential for joint research into future-reaching areas like AI, biosciences, new energy and low-carbon technology. This looks like a win for both sides: services are the UK's most important export to China, while the country is the world leader in manufacturing green energy technologies and is on the constant hunt for expanded markets in which to sell them. China holding firm It is clear that some trickier things came up in the room, too, things on which China wants to control the narrative. On Taiwan, there was a reaffirmation from the UK that its position \"remains unchanged and will not change\". Taiwan is a self-governing island that China sees as its own, and officially, most countries, including the UK, do not recognise it as an independent entity - getting nations to publicly restate this is hugely important to China. And we know Sir Keir had promised to raise the case of Jimmy Lai, the jailed Hong Kong democracy campaigner. In the Chinese readout, it said simply the two had agreed \"Hong Kong's prosperity and stability are in the common interest of both countries\" - that's probably China speak for \"it came up and we're not budging\". But perhaps the most interesting takeaways were the not-so-subtle hints dropped about the other major power at play in this dynamic - the United States.  \"Unilateralism, protectionism, and power politics has been rampant\" and that times are currently \"turbulent and fluid\". Indeed, from the Chinese perspective, Thursday mattered not because of what was achieved but because of who was watching. Playing the long game The optics of the British prime minister being here, revamping this relationship, at exactly the moment that Donald Trump is seriously disrupting traditional transatlantic partnerships, is exquisite for the Chinese. Indeed, under President Xi Jinping, China has long nurtured the narrative that it is, in fact, the world's most reliable superpower, that countries should look to it, and not the US, for stable global leadership. Read more from Sky News:Doctors share accounts of Iran crackdownPretti clashes with federal agents The current chaos being sown by Trump and the list of European powers knocking down China's door very much helps with that sell. China doesn't expect sudden changes of allegiance, but they do think the whole situation brings opportunity. In his opening remarks on Thursday, Xi quoted from a Chinese Proverb written by Chairman Mao, \"range far your eyes over long vistas\", the inference being that it's best to step back, consider the bigger picture and not get too distracted by short-term gains or losses. China always plays the long and strategic game. Be in no doubt, rekindling a relationship with this middling power is part of that."
    },
    {
        "title": "Video shows Alex Pretti clash with federal agents the week before he was killed",
        "description": "New footage has emerged of Alex Pretti in an altercation with federal agents in Minneapolis, 11 days before he was shot dead.",
        "url": "https://news.sky.com/story/video-shows-alex-pretti-clash-with-federal-agents-a-week-before-he-was-killed-13500437",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-alex-pretti-minneapolis_7149125.png?20260129010523",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-29 00:38:00",
        "Headline": "A representative for the Pretti family confirmed to Sky's US partner network NBC News that the man in the video is Alex Pretti. He can be seen in the video with a holstered handgun behind his back.",
        "Content": "New footage has emerged of Alex Pretti in an altercation with federal agents in Minneapolis, 11 days before he was shot dead. The video, shared by outlet The News Movement, shows Mr Pretti, 37, at the corner of East 36th and Park Avenue on 13 January, where federal agents were blocking a street. It was just four days after an ICE agent shot and killed 37-year-old Renee Good in her vehicle in nearby Portland Avenue South, and 11 before Mr Pretti was shot dead by immigration enforcement agents last Saturday. Mr Pretti's family have confirmed it is him in the new footage. Sky News has not been able to verify what happened in the build-up to the incident. What does the video show? As the agents start driving away from the crowd of observers, Mr Pretti appears to spit at the vehicle. He then is seen kicking the vehicle's taillight, before kicking it again and knocking it loose. An agent then got out of the vehicle, grabs him and pushes him to the ground. During the altercation, agents fire tear gas and pepper balls into the crowd. They continue to hold the man down before he breaks free. A gun can be seen holstered behind his back as he shouts at the officials, who are retreating. What's been said about the footage? A representative for the Pretti family confirmed to Sky's US partner network NBC News that the man in the video is Mr Pretti. Steve Schleicher, the attorney for the Pretti family, said in a statement: \"A week before Alex was gunned down in the street - despite posing no threat to anyone - he was violently assaulted by a group of ICE agents. \"Nothing that happened a full week before could possibly have justified Alex's killing at the hands of ICE on Jan 24.\" A Homeland Security spokesperson added to NBC News that its investigations team is reviewing the video. Later, Donald Trump shared the full video of the 13 January incident on Truth Social, and then reposted an X user saying \"such a peaceful protester\" of Mr Pretti. Read more:Watch: 'It's coming to your city if we don't stand up''The normal rules of engagement have been thrown out' Mr Pretti, an ICU nurse who had been protesting the presence of ICE agents in the city following the death of Ms Good, was shot 10 times by two federal officers on 24 January. Since then, top White House officials, notably Trump adviser Stephen Miller and homeland security secretary Kristi Noem, have described Mr Pretti as a \"would-be assassin\" as he had a gun on him at the time of his death. Under the Second Amendment of the US Constitution, the rights of citizens to carry a gun are protected. Local officials in Minnesota have also said Mr Pretti was carrying a handgun legally at the time. Mr Trump had appeared to distance himself from those remarks, telling reporters before a rally in Iowa: \"No [I wouldn't call Mr Pretti a would-be assassin]. Not as a - no... Listen, you can't walk in with guns. \"You can't do that, but it's just a very unfortunate incident.\" The agents involved in his death have been placed on leave after Mr Trump said he wanted to \"de-escalate\" the situation."
    },
    {
        "title": "Man charged with impersonating FBI agent in apparent bid to free Luigi Mangione from New York jail",
        "description": "A man has been charged with impersonating an FBI agent after he turned up to a New York jail claiming to have a court order to release Luigi Mangione, authorities have said.&#160;",
        "url": "https://news.sky.com/story/man-charged-with-impersonating-fbi-agent-in-apparent-bid-to-free-luigi-mangione-from-new-york-jail-13500865",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-luigi-mangione-court_7114246.jpg?20251218163000",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-29 23:04:00",
        "Headline": "When they searched the man's bag, officers found a barbecue fork and circular steel blade that resembled a pizza cutter.",
        "Content": "A man has been charged with impersonating an FBI agent after he turned up to a New York jail claiming to have a court order to release Luigi Mangione, authorities have said.  Mark Anderson, 36, from Minnesota, was arrested at the Metropolitan Detention Center in Brooklyn where Mangione, 27, is being held while awaiting trial for the murder of UnitedHealthcare chief executive Brian Thompson in 2024. According to a complaint filed against Anderson, he told prison officers that he was an FBI agent in possession of paperwork \"signed by a judge\" authorising the release of a specific inmate, whom a law enforcement source identified as Mangione. When the officers asked him for his credentials, Anderson allegedly showed them a Minnesota driving licence and claimed to have weapons. After searching his bag, officers found a barbecue fork and circular steel blade that resembled a pizza cutter. A law enforcement official said Anderson had travelled to New York from Minnesota, and was working at a pizzeria after another job opportunity fell through. The attempt to free Mangione happened hours after the Manhattan district attorney's office had sent a letter urging the judge in Mangione's case, Gregory Carro, to set a trial date of 1 July. \n                  Luigi Mangione wrote notes to himself, saying 'pluck eyebrows' and 'keep momentum, FBI slower overnight'\n                 \n                  Luigi Mangione had handgun, silencer and 'manifesto' in backpack during arrest, police say\n                 \n                  Luigi Mangione shown videos of UnitedHealthcare CEO killing as defence seeks to bar evidence\n                 Mangione will appear in court on Friday for a conference in his federal case. The judge, Margaret Garnett, is expected to rule soon whether prosecutors can seek the death penalty and whether they can use certain evidence against him. Last week, Ms Garnett scheduled jury selection in the federal case for 8 September, with the rest of the trial happening in October or January, depending on whether she allows prosecutors to seek the death penalty. Mangione has pleaded not guilty in both cases. Read more from Sky News:Congresswoman attacked with unknown substanceTesla axes EV models in drive for robotics revenue Mr Thompson, 50, was killed on 4 December 2024 as he walked to a New York City hotel for his company's annual investor conference. Mangione, an Ivy League graduate, was arrested five days later in Pennsylvania. After several days of court proceedings, Mangione was then transferred to the Metropolitan Detention Center. The jail is also currently holding former Venezuelan president Nicolas Maduro and his wife, Cilia Flores, who are facing drug trafficking charges."
    },
    {
        "title": "FBI probes attack on Democrat Ilhan Omar - as she blames Trump",
        "description": "The FBI is investigating an attack on Democrat politician Ilhan Omar by a man who sprayed her with an unknown substance.",
        "url": "https://news.sky.com/story/fbi-probes-attack-on-democrat-ilhan-omar-as-she-blames-trump-13500438",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-ilhan-omar-donald-trump_7148417.jpg?20260128122437",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-29 01:24:00",
        "Headline": "Ilhan Omar said of Donald Trump after the attack: \"Every time the president of the United States has chosen to use hateful rhetoric to talk about me and the community that I represent, my death threats skyrocket.\"",
        "Content": "The FBI is investigating an attack on Democrat politician Ilhan Omar by a man who sprayed her with an unknown substance. The Minnesota representative was targeted at an event in Minneapolis on Tuesday, where she called for ICE - the controversial immigration enforcement unit - to be scrapped. The man who attacked her during her address was identified by police as Anthony Kazmierczak, 55, who was arrested for third-degree assault. US federal law explicitly states that assaults on lawmakers must be investigated by the FBI. The agency had stayed largely quiet about the incident until Wednesday evening. It told Sky's US partner network NBC News: \"The FBI is investigating this matter. To maintain the integrity of the ongoing investigation, no additional details are available for release at this time.\" Ms Omar gave a news conference the day after the attack, and blamed Donald Trump. He has repeatedly criticised her and called her \"garbage\" last month. He has also denigrated her birthplace, Somalia, describing it as a \"disaster\" and \"not even a country\". 'Trump is obsessed with me' Ms Omar declared: \"Every time the president of the United States has chosen to use hateful rhetoric to talk about me and the community that I represent, my death threats skyrocket.\" She said she would not be such a target \"if Donald Trump wasn't in office and if he wasn't so obsessed with me\". \"I do believe that the facts of the situation are that I wouldn't be where I am at today, having to pay for security, having the government to think about providing me security, if Donald Trump wasn't in office,\" she added. Read more from Sky News:King speaks out about backlashUS plans to check tourists' social media Ms Omar, now a US citizen, fled Somalia with her family when she was a child during a civil war. She is the first Somali-American member of Congress. The Minneapolis-St Paul area is home to some 84,000 people of Somali descent - nearly a third of the total number of Somalis living in the US. Thousands of ICE agents started to be deployed to the city, the largest in the state of Minnesota, on 5 January. The aim, according to the government department, was to arrest \"fraudsters, murderers, rapists, and gang members\". It came after a right-wing online influencer alleged a number of childcare facilities run by Somali residents in Minnesota had committed welfare fraud. Two protesters, Renee Good and Alex Pretti, have since been shot and killed by agents. Those involved in the latter have been placed on leave amid growing backlash."
    },
    {
        "title": "Tesla axes EV models in drive for robotics revenue",
        "description": "Tesla is to axe production of two electric vehicle (EV) models as part of a shift towards robotics after the company reported its first ever decline in annual revenue.",
        "url": "https://news.sky.com/story/tesla-axes-ev-models-in-drive-for-robotics-revenue-13500444",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-optimus-tesla_7149143.jpg?20260129054949",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-29 05:42:00",
        "Headline": "Investors liked what they heard about the future following the company's latest results, but Elon Musk is under huge pressure to deliver on his vision as a series of targets have been missed.",
        "Content": "Tesla is to axe production of two electric vehicle (EV) models as part of a shift towards robotics after the company reported its first ever decline in annual revenue. Chief executive Elon Musk told analysts on a conference call that the company would stop selling its older Model S and Model X vehicles and convert factory space to manufacture its Optimus robots instead. Tesla revealed that investment would more than double this year to $20bn (£14.5bn), with $2bn of that sum going to his artificial intelligence division xAI. Money latest: Check how much your water bill is due to rise The spending seeks to make good on a series of promises by Mr Musk relating to Tesla's transition towards self-driving cars and robotics that have, so far, fallen short of targets. Mr Musk's plans to build Cybercabs - robotaxis - have been hampered to date by a lack of capacity and regulatory clearances. He has previously warned that a shortage of memory chips amid the wider rush for AI globally, risks hampering production as it ramps up later this year. \n                  Man given Musk's Neuralink brain chip in UK trial says it 'feels magical' and gives new hope\n                 \n                  Why is Ryanair fighting with Elon Musk?\n                 \n                  Ofcom welcomes Grok sexualised image restrictions and says investigation 'ongoing'\n                 Tesla is looking to new revenue streams as its traditional EV space becomes ever more crowded, with China's BYD overtaking the company last year to become the world's biggest EV maker. The US company's revenues and profits suffered in 2025 as core EV sales were battered by a backlash against Mr Musk for his cost-cutting role at the heart of the Trump administration and interventions in foreign elections. The sales Tesla did make were on the back of steep discounts, reflecting not only the often violent boycott of Tesla by political opponents but also the fact that vehicles made by Tesla's competitors are cheaper. A US tax incentive for electric vehicles was also ended by the Trump administration amid Mr Musk's on-off relationship with the president. Read more from Sky News:Man given Musk's Neuralink brain chip in UKDriverless cars coming to London 'this year Tesla shares were up by 2% in after-hours trading - building on cautious gains of last year that have been largely explained by the AI-driven turnaround plans promised by Mr Musk. He is under pressure to meet a share price-based incentive plan, potentially worth up to $1trn over 10 years, but there are fears among some investors that his focus is spread too thin. Mr Musk plans to take his rocket company SpaceX public, possibly in June."
    },
    {
        "title": "Santander UK to shut 44 branches - is yours affected?",
        "description": "Santander has announced plans to close 44 bank branches, placing almost 300 jobs at risk.",
        "url": "https://news.sky.com/story/santander-uk-to-shut-44-branches-is-yours-affected-13500481",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-santander-current-account_7079306.jpg?20251111152121",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-01-29 07:14:00",
        "Headline": "No subtitle found",
        "Content": "Santander has announced plans to close 44 bank branches, placing almost 300 jobs at risk. The lender said its move was a continuing response to the changing needs of its customers as more people bank online. News of the fresh closures come less than a year after it revealed plans to shut 95 sites. Santander UK said its latest decision would leave it with just 244 full service branches. Money latest: Check how much your water bill is due to rise The company revealed a list of the locations affected and the dates when closures are due to take place: Andover, Hampshire, 12 MayBanbridge, County Down, 19 MayBangor, County Down, 29 AprilBerwick Upon Tweed, Northumberland, 28 AprilBishop Auckland, County Durham, 5 MayBoston, Lincolnshire, 28 AprilBridgend, Mid Glamorgan, 12 MayBridgwater, Somerset, 29 AprilCwmbran, Gwent, 13 MayEnniskillen, County Fermanagh, 12 MayEvesham, Worcestershire, 28 AprilGlengormley, County Antrim, 6 MayGolders Green, London, 13 MayGosport, Hampshire, 5 MayHaverfordwest, Pembrokeshire, 5 MayHeswall, Merseyside, 13 MayHuntingdon, Cambridgeshire, 5 MayKirkintilloch, Lanarkshire, 29 AprilLeighton Buzzard, Bedfordshire, by end of January 2027Leyland, Lancashire, 6 MayLiskeard, Cornwall, 20 MayMacclesfield, Cheshire, 12 MayMansfield, Nottinghamshire, 6 MayMelton Mowbray, Leicestershire, 29 AprilMerthyr Tydfil, Mid Glamorgan, 6 MayMold, Clwyd, 28 AprilNewbury, Berkshire, 29 AprilNewton Abbot, Devon, 19 MayNorthallerton, North Yorkshire, 6 MayOrmskirk, Lancashire, by the end of January 2027Pontefract, West Yorkshire, 5 MayRamsgate, Kent, 28 AprilRedditch, Worcestershire, 13 MayRingwood, Hampshire, 6 MayScunthorpe, South Humberside, 29 AprilShirley, West Midlands, 20 MayStafford, Staffordshire, 19 MayStranraer, Wigtownshire, 13 MayStratford Upon Avon, Warwickshire, 12 MayTonbridge, Kent, 29 AprilWelwyn Garden City, Hertfordshire, 5 MayWhitehaven, Cumbria, by the end of January 2027Wilmslow, Cheshire, by the end of January 2027Woking, Surrey, 28 April \n                  Major bank loses 20,000 customers to rivals in just three months in bank switch shocker | Money blog\n                 \n                  WASPI women compensation bid rejected again after government review\n                 \n                  Who does tastiest fried chicken? Taste test ranks top 12 (and KFC isn't top)\n                 The Spain-based bank group said 96% of all transactions were now being completed on digital channels. It moved to reassure critics of wider industry branch closures around access to banking, insisting its community bankers programme would help in the areas where full branches were shutting. Its surviving network will also consist of 19 counter-free branches, 36 reduced-hour branches, six work cafes and 111 Santander Locals. The industry's shift away from costly branch services has seen two-thirds of the UK's network disappear over the past 10 years but branch services have been reduced at pace since the fallout from the financial crisis in 2008/9. A Santander spokeswoman said: \"We will continue to invest in both our branch network - comprising of full-service branches, counter-free branches, reduced-hour branches, Santander Locals, and our increasingly popular work cafes - as well as our digital banking services, so we can be there to support our customers however they choose to bank with us.\" This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version. You can receive Breaking News alerts on a smartphone or tablet via the Sky News App. You can also follow @SkyNews on X or subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "WASPI women compensation bid rejected again after government review",
        "description": "The government has restated its rejection of the campaign from women who claimed they were owed billions after their state pensions age was changed.",
        "url": "https://news.sky.com/story/waspi-women-compensation-bid-rejected-again-after-government-review-13500571",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-waspi-women_7079421.jpg?20251111170531",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-01-29 11:08:00",
        "Headline": "Campaigners - the Women Against State Pension Inequality - will not get the billions of pounds they claim they are owed.",
        "Content": "The government has restated its rejection of the campaign from women who claimed they were owed billions after their state pensions age was changed. The Women Against State Pension Inequality - WASPI - campaign has lobbied extensively after claiming they were not given sufficient warning of the state pension age for women being lifted to be in line with men. Having rejected this claim in December 2024, the government announced a review in November last year when it would consider new evidence. Politics latest: Starmer's big China announcement Campaigners' argument centres on the claim the change of pension age was done too quickly, leaving some women financially unprepared to cope with the number of years when they were no longer able to claim their state pension. The government said in 2024 that they would not be compensated because most women knew the changes were coming, before announcing the review in late 2025. This review was into a specific claim around how the decision was communicated. Work and Pensions Secretary Pat McFadden said in the House of Commons on Thursday that after the review \"the government has come to the same conclusion on compensation as... announced in December 2024\". He added: \"There are legitimate and sincerely held views about whether it was wise to increase the state pension age, in particular, whether the decision taken in 2011 by the coalition government to accelerate equalisation and the rise to the age of 66 was the right thing to do or not.\" Read more:Workers being 'hammered' while pensioners benefitThree major pension reforms happening in 2026 Mr McFadden said the review was about \"how changes to the state pension age were communicated\", not the way the policy was decided. The minister told MPs: \"We accept that individual letters about changes to the state pension age could have been sent earlier. \"For this, I want to repeat the apology [from former work and pensions secretary Liz Kendall] on behalf of the government. \"And I am sorry that those letters were not sent sooner. \"We also agree with the [Parliamentary and Health Service] ombudsman that women did not suffer any direct financial loss from the delay.\" Campaigners considering legal action Angela Madden, the chair of WASPI, said: \"This is a disgraceful political choice by a small group of very powerful people who have decided the harm and injustice suffered by millions of ordinary women simply does not matter. \"The parliamentary ombudsman says economic circumstances should not be used as an excuse to deny compensation. The government has magically found billions to fund policies not made in their election manifesto, proving money can quickly become available when ministers consider something a priority. \"WASPI is taking legal advice, and all options remain on the table. We stand ready to pursue every avenue in Parliament and in the courts to secure the justice that has been so shamefully denied.\" Around 3.6 million women were affected by the change to the state pension age. The government has previously said compensating them could cost £10.5bn. Women born between April 1951 and 1960 were affected. 👉Listen to Politics at Sam and Anne's on your podcast app👈 The changes were first announced in the 1995 Pensions Act, with a target to equalise male and female pensions by 2020."
    },
    {
        "title": "Tesla axes EV models in drive for robotics revenue",
        "description": "Tesla is to axe production of two electric vehicle (EV) models as part of a shift towards robotics after the company reported its first ever decline in annual revenue.",
        "url": "https://news.sky.com/story/tesla-axes-ev-models-in-drive-for-robotics-revenue-13500444",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-optimus-tesla_7149143.jpg?20260129054949",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-01-29 05:42:00",
        "Headline": "Investors liked what they heard about the future following the company's latest results, but Elon Musk is under huge pressure to deliver on his vision as a series of targets have been missed.",
        "Content": "Tesla is to axe production of two electric vehicle (EV) models as part of a shift towards robotics after the company reported its first ever decline in annual revenue. Chief executive Elon Musk told analysts on a conference call that the company would stop selling its older Model S and Model X vehicles and convert factory space to manufacture its Optimus robots instead. Tesla revealed that investment would more than double this year to $20bn (£14.5bn), with $2bn of that sum going to his artificial intelligence division xAI. Money latest: Check how much your water bill is due to rise The spending seeks to make good on a series of promises by Mr Musk relating to Tesla's transition towards self-driving cars and robotics that have, so far, fallen short of targets. Mr Musk's plans to build Cybercabs - robotaxis - have been hampered to date by a lack of capacity and regulatory clearances. He has previously warned that a shortage of memory chips amid the wider rush for AI globally, risks hampering production as it ramps up later this year. \n                  Man given Musk's Neuralink brain chip in UK trial says it 'feels magical' and gives new hope\n                 \n                  Why is Ryanair fighting with Elon Musk?\n                 \n                  Ofcom welcomes Grok sexualised image restrictions and says investigation 'ongoing'\n                 Tesla is looking to new revenue streams as its traditional EV space becomes ever more crowded, with China's BYD overtaking the company last year to become the world's biggest EV maker. The US company's revenues and profits suffered in 2025 as core EV sales were battered by a backlash against Mr Musk for his cost-cutting role at the heart of the Trump administration and interventions in foreign elections. The sales Tesla did make were on the back of steep discounts, reflecting not only the often violent boycott of Tesla by political opponents but also the fact that vehicles made by Tesla's competitors are cheaper. A US tax incentive for electric vehicles was also ended by the Trump administration amid Mr Musk's on-off relationship with the president. Read more from Sky News:Man given Musk's Neuralink brain chip in UKDriverless cars coming to London 'this year Tesla shares were up by 2% in after-hours trading - building on cautious gains of last year that have been largely explained by the AI-driven turnaround plans promised by Mr Musk. He is under pressure to meet a share price-based incentive plan, potentially worth up to $1trn over 10 years, but there are fears among some investors that his focus is spread too thin. Mr Musk plans to take his rocket company SpaceX public, possibly in June."
    },
    {
        "title": "'Outrageous': Assisted dying critics attack 'unprecedented' plan to force through bill",
        "description": "It would be \"outrageous\" to use the Parliament Act to force through the assisted dying bill without the approval of the House of Lords, a leading opponent of the bill has said.",
        "url": "https://news.sky.com/story/outrageous-assisted-dying-critics-attack-unprecedented-plan-to-force-through-bill-13500549",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-house-of-lords-chamber_7106790.jpg?20251210193628",
        "type": "Politics",
        "Author": "Oscar Bentley, political reporter",
        "Date Published": "2026-01-29 10:48:00",
        "Headline": "The bill's sponsor Lord Falconer has suggested he could bypass the Lords to ensure elected Commons gets its way.",
        "Content": "By Oscar Bentley, political reporter  It would be \"outrageous\" to use the Parliament Act to force through the assisted dying bill without the approval of the House of Lords, a leading opponent of the bill has said. It comes after the backer in the Lords admitted using the procedure would be \"unprecedented\" but justified to ensure the will of elected MPs is not blocked. Crossbench peer Baroness Ilora Finlay told Sky News: \"I think that's outrageous, I really do\". Politics Hub: Follow the latest updates Baroness Finlay, a doctor, professor of palliative care and former president of the Royal Society of Medicine, said \"trying to hammer the bill through with all the dangers [in it] is incredibly irresponsible\". Conservative former transport secretary Lord Mark Harper told Sky News that Lord Falconer \"wants to force through a bill which is unsafe and deficient\". Former justice secretary Lord Falconer, who is shepherding the bill through the Lords, told Mornings with Ridge and Frost that using the Parliament Act for a private members' bill \"would be unprecedented\". He added: \"But the essence of the Parliament Act is in order to give the Commons primacy over the Lords, because we are not elected, we're all appointed for a whole variety of reasons, whereas the Commons are elected by the public. \"If anybody is to decide whether or not... this really important change is to take place, surely it shouldn't be a minority of Lords blocking it. It should be a decision made by the elected representatives.\" The Parliament Act allows for an identical bill that has been passed by the Commons in two consecutive sessions of parliament to become law even if the Lords don't agree. The act has only been used seven times in the century-plus since it was introduced. The bill has made slow progress in the Lords so far, and looks like it will run out of time on its current trajectory. Peers are next set to debate it on Friday. A source close to Labour MPs and peers opposed to the bill suggested MPs might be unwilling to vote through the bill if the \"nuclear option\" of the Parliament Act was used, calling Lord Falconer's claim he could use it \"the act of a bully who knows they are losing the argument on the substance\". Labour MP Jess Asato, who is opposed to the bill, said: \"If we mess this up and force this through in this deeply flawed state we will be held responsible.\" The bill has to complete its passage through the Lords and return to the Commons to agree changes before the end of the parliamentary session, expected in May. If it doesn't, it will fall and fail to become law. The bill can only be debated on Fridays. The government recently extended the number of hours peers sit on a Friday to allow for more debate, but has refused to give it any further time. 'Scrutiny is not filibustering,' say opponents Backers of the bill say peers have made slow progress in their scrutiny. In the seven days of committee stage peers have had so far, they have considered just 20 groups of amendments out of a total of 88. They are still scrutinising clause 1 of a 59-clause bill. Home Office minister Alex Norris told Sky News peers needed to \"do their job\". \"I would hope that they would use that as a process of revising and improving as the Lords is meant to, rather than trying to artificially stop it,\" he said. But opponents of the bill fiercely deny they are purposefully obstructing it from passing, and insist they are simply trying to improve what they think is a poorly designed piece of legislation. Baroness Finlay and Lord Harper have tabled more than 230 amendments to the bill between them. Over 1,200 amendments have been tabled in total, which is one of the highest numbers in modern history. \"Scrutiny is not filibustering. This bill as written is really unsafe,\" Baroness Finlay said. She said the bill didn't contain anything to protect vulnerable people: \"They're not safeguards, they're just vague qualifying conditions.\" Baroness Finlay named issues like whether pregnant women would be eligible, people feeling like a burden or being coerced into seeking an assisted death, and which drugs would be used to end life as issues that still needed ironing out. She said peers debated 100 amendments last Friday, comparable to other bills, and said the debate would move faster if Lord Falconer and the government provided answers to questions more quickly. \"To imply that the rest of us haven't been turning up and working [on the bill] is really rude actually,\" she added. Baroness Finlay said many MPs backed the bill on the basis the Lords would \"sort it out\". Lord Harper said claims of a filibuster are \"just not correct\", and that Lord Falconer had \"himself accepted the bill has flaws... all we're doing is working through the bill\". He said peers were \"moving at a reasonable pace, [given the] size and complexity of the bill... [we've] still got an awful lot of work to do as the bill is in a terrible shape\". He also criticised a private members' bill being used for an \"issue like this of its complexity\", saying it was \"completely unsuitable\". But Lord Falconer told Sky News it was the right route for the bill, given it is a conscience issue. He said it would be wrong for a government to put it in a manifesto: \"There's been conscience issues right throughout our history where no party will agree in that manifesto because their own parties are all divided.\""
    },
    {
        "title": "Another arrest over fires at properties and car linked to Sir Keir Starmer",
        "description": "A fifth man has been arrested in relation to arson attacks on properties and a car linked to Sir Keir Starmer last year. ",
        "url": "https://news.sky.com/story/another-arrest-over-fires-at-properties-and-car-linked-to-sir-keir-starmer-13500448",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-fire-starmer_6915167.jpg?20250520091039",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-29 10:24:00",
        "Headline": "The 19-year-old has been released under investigation after being taken to an Essex police station on Wednesday for questioning, the Metropolitan Police said.",
        "Content": "A fifth man has been arrested in relation to arson attacks on properties and a car linked to Sir Keir Starmer last year.  The 19-year-old has been released under investigation after being taken to an Essex police station on Wednesday for questioning, the Metropolitan Police said. The man, of Harlow, Essex, was arrested on suspicion of conspiracy to commit arson, police added. It comes after a Toyota RAV4, which Sir Keir had previously sold, was set alight in Kentish Town, north London on 8 May 2025. There was another blaze at the front door of a house converted into flats in Islington, also linked to the prime minister, on 11 May. Then, in the early hours of 12 May, there was a fire at the house where Sir Keir lived before he became prime minister and moved into Downing Street. As part of the same investigation, three other men have been charged over the fires: Ukrainians Petro Pochynok, 34, and Roman Lavrynovych, 21, and Ukrainian-born Romanian national Stanislav Carpiuc, 26. Lavrynovych is charged with three counts of arson with intent to endanger life, while Pochynok and Carpiuc are accused of conspiring to commit arson with intent to endanger life. \n                  Politics latest: Trump warns UK about 'dangerous' China strategy - as Starmer hails deals on visa-free travel and cuts to whisky tariff\n                 \n                  94 patients were harmed during care by Great Ormond Street Hospital orthopaedic surgeon Yaser Jabbar, report finds\n                 \n                  Watch: Anthony Joshua pays tribute to his two friends that died in a car crash in Nigeria\n                 Lavrynovych and Pochynok both previously pleaded not guilty at a hearing in October. Carpiuc pleaded not guilty to the same charge in November, a court spokesman said. They are due to stand trial at the Old Bailey on 27 April. A fourth man has been released without charge, a force spokesman said."
    },
    {
        "title": "WASPI women compensation bid rejected again after government review",
        "description": "The government has restated its rejection of the campaign from women who claimed they were owed billions after their state pensions age was changed.",
        "url": "https://news.sky.com/story/waspi-women-compensation-bid-rejected-again-after-government-review-13500571",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-waspi-women_7079421.jpg?20251111170531",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-29 11:08:00",
        "Headline": "Campaigners - the Women Against State Pension Inequality - will not get the billions of pounds they claim they are owed.",
        "Content": "The government has restated its rejection of the campaign from women who claimed they were owed billions after their state pensions age was changed. The Women Against State Pension Inequality - WASPI - campaign has lobbied extensively after claiming they were not given sufficient warning of the state pension age for women being lifted to be in line with men. Having rejected this claim in December 2024, the government announced a review in November last year when it would consider new evidence. Politics latest: Starmer's big China announcement Campaigners' argument centres on the claim the change of pension age was done too quickly, leaving some women financially unprepared to cope with the number of years when they were no longer able to claim their state pension. The government said in 2024 that they would not be compensated because most women knew the changes were coming, before announcing the review in late 2025. This review was into a specific claim around how the decision was communicated. Work and Pensions Secretary Pat McFadden said in the House of Commons on Thursday that after the review \"the government has come to the same conclusion on compensation as... announced in December 2024\". He added: \"There are legitimate and sincerely held views about whether it was wise to increase the state pension age, in particular, whether the decision taken in 2011 by the coalition government to accelerate equalisation and the rise to the age of 66 was the right thing to do or not.\" Read more:Workers being 'hammered' while pensioners benefitThree major pension reforms happening in 2026 Mr McFadden said the review was about \"how changes to the state pension age were communicated\", not the way the policy was decided. The minister told MPs: \"We accept that individual letters about changes to the state pension age could have been sent earlier. \"For this, I want to repeat the apology [from former work and pensions secretary Liz Kendall] on behalf of the government. \"And I am sorry that those letters were not sent sooner. \"We also agree with the [Parliamentary and Health Service] ombudsman that women did not suffer any direct financial loss from the delay.\" Campaigners considering legal action Angela Madden, the chair of WASPI, said: \"This is a disgraceful political choice by a small group of very powerful people who have decided the harm and injustice suffered by millions of ordinary women simply does not matter. \"The parliamentary ombudsman says economic circumstances should not be used as an excuse to deny compensation. The government has magically found billions to fund policies not made in their election manifesto, proving money can quickly become available when ministers consider something a priority. \"WASPI is taking legal advice, and all options remain on the table. We stand ready to pursue every avenue in Parliament and in the courts to secure the justice that has been so shamefully denied.\" Around 3.6 million women were affected by the change to the state pension age. The government has previously said compensating them could cost £10.5bn. Women born between April 1951 and 1960 were affected. 👉Listen to Politics at Sam and Anne's on your podcast app👈 The changes were first announced in the 1995 Pensions Act, with a target to equalise male and female pensions by 2020."
    },
    {
        "title": "Tesla axes EV models in drive for robotics revenue",
        "description": "Tesla is to axe production of two electric vehicle (EV) models as part of a shift towards robotics after the company reported its first ever decline in annual revenue.",
        "url": "https://news.sky.com/story/tesla-axes-ev-models-in-drive-for-robotics-revenue-13500444",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-optimus-tesla_7149143.jpg?20260129054949",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-29 05:42:00",
        "Headline": "Investors liked what they heard about the future following the company's latest results, but Elon Musk is under huge pressure to deliver on his vision as a series of targets have been missed.",
        "Content": "Tesla is to axe production of two electric vehicle (EV) models as part of a shift towards robotics after the company reported its first ever decline in annual revenue. Chief executive Elon Musk told analysts on a conference call that the company would stop selling its older Model S and Model X vehicles and convert factory space to manufacture its Optimus robots instead. Tesla revealed that investment would more than double this year to $20bn (£14.5bn), with $2bn of that sum going to his artificial intelligence division xAI. Money latest: Check how much your water bill is due to rise The spending seeks to make good on a series of promises by Mr Musk relating to Tesla's transition towards self-driving cars and robotics that have, so far, fallen short of targets. Mr Musk's plans to build Cybercabs - robotaxis - have been hampered to date by a lack of capacity and regulatory clearances. He has previously warned that a shortage of memory chips amid the wider rush for AI globally, risks hampering production as it ramps up later this year. \n                  Man given Musk's Neuralink brain chip in UK trial says it 'feels magical' and gives new hope\n                 \n                  Why is Ryanair fighting with Elon Musk?\n                 \n                  Ofcom welcomes Grok sexualised image restrictions and says investigation 'ongoing'\n                 Tesla is looking to new revenue streams as its traditional EV space becomes ever more crowded, with China's BYD overtaking the company last year to become the world's biggest EV maker. The US company's revenues and profits suffered in 2025 as core EV sales were battered by a backlash against Mr Musk for his cost-cutting role at the heart of the Trump administration and interventions in foreign elections. The sales Tesla did make were on the back of steep discounts, reflecting not only the often violent boycott of Tesla by political opponents but also the fact that vehicles made by Tesla's competitors are cheaper. A US tax incentive for electric vehicles was also ended by the Trump administration amid Mr Musk's on-off relationship with the president. Read more from Sky News:Man given Musk's Neuralink brain chip in UKDriverless cars coming to London 'this year Tesla shares were up by 2% in after-hours trading - building on cautious gains of last year that have been largely explained by the AI-driven turnaround plans promised by Mr Musk. He is under pressure to meet a share price-based incentive plan, potentially worth up to $1trn over 10 years, but there are fears among some investors that his focus is spread too thin. Mr Musk plans to take his rocket company SpaceX public, possibly in June."
    },
    {
        "title": "Former Little Mix singer tells Sky News how it was her mum who first noticed twins' rare genetic condition",
        "description": "Former Little Mix singer Jesy Nelson said none of the healthcare workers who checked her twin babies realised they had a rare genetic condition which means they may never walk - and it was only thanks to her mum that they were diagnosed.",
        "url": "https://news.sky.com/story/thank-god-for-my-mum-former-little-mix-singer-on-how-experts-missed-twins-rare-medical-condition-13500670",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-jesy-nelson_7149662.png?20260129164344",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-29 14:48:00",
        "Headline": "Speaking to Sky News' The UK Tonight programme with Sarah-Jane Mee, Ms Nelson described how her girls were diagnosed with the condition only at six months, despite repeated visits to the GP and healthcare visitors checking in on them. ",
        "Content": "Former Little Mix singer Jesy Nelson said none of the healthcare workers who checked her twin babies realised they had a rare genetic condition which means they may never walk - and it was only thanks to her mum that they were diagnosed. Earlier this month, Nelson, 34, announced in an emotional Instagram video that her baby twins had spinal muscular atrophy type 1 (SMA1). Speaking to Sky News' The UK Tonight programme with Sarah-Jane Mee, Nelson described how her girls were diagnosed with the condition only at six months, despite repeated visits to the GP and healthcare visitors checking in on them. \"When I took them home, I was very on edge about everything,\" she said. \"But the one thing I wasn't taking notice of was the movement of the legs…it took for my mum to spot that sign and that's what's really worrying because we had healthcare visitors come a lot and none of them spotted those signs.\" There is treatment for SMA, but an early diagnosis is key to its effectiveness. Read more from Sky News:Bereaved mother describes 'harrowing' stillbirth aftercareDoula warning issued after baby's death \n                  Bereaved mother describes 'harrowing' stillbirth aftercare\n                 Nelson said she took the twins to the GP three times because they weren't feeding properly but was told \"they are absolutely fine\". \"It wasn't until they got their diagnosis that they were then like we've got to keep them in because they're very underweight and they need to go on feeding tubes... and now they are still on feeding tubes. \"That just goes to show how little awareness there is about it.\" Nelson continued: \"Thank God for my mum because I dread to think what position I'd be in now if my mum hadn't had said anything to me... \"It's one of those things that I constantly go over and I have to sometimes stop myself from doing it because I will just like drive myself insane.\" Nelson recently met with Health Secretary Wes Streeting to raise awareness about the condition and continue the conversation on SMA. She said she won't stop talking about it on her socials or in the media as there are still a lot of people who don't know about the condition, so \"I've got to stay noisy\". Watch the full interview with Jesy Nelson on Sky News' The UK Tonight from 8pm on Thursday."
    }
]