[
    {
        "title": "How Donald Trump's tariffs could impact consumers",
        "description": "Donald Trump has long threatened increasing tariffs on goods from Mexico, Canada, and China.",
        "url": "https://news.sky.com/story/how-donald-trumps-tariffs-could-impact-consumers-13300714",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-trump-white-house_6813901.jpg?20250129200117",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-01 12:31:00",
        "Headline": "President Trump has now confirmed that Mexican and Canadian goods will be subject to the full 25% tariff - and Chinese imports to 10%.",
        "Content": "Donald Trump has long threatened increasing tariffs on goods from Mexico, Canada, and China. The second-time president argues higher levies will help reduce illegal migration and the smuggling of fentanyl to the US. On Saturday, the president confirmed that he would subject Mexican and Canadian goods to the full 25% tariff - and Chinese imports to 10%. Although the Trump administration says the changes will boost domestic production, there will likely be wide-ranging negative consequences for the US consumer. Economists argue supply chains will be disrupted and businesses will suffer increased costs - leading to an overall rise in prices. Analysis:Why has Trump targeted Mexico and Canada? Both Mexico and Canada rely heavily on their imports and exports, which make up around 70% of their Gross Domestic Products (GDPs), putting them at even greater risk from the new tariffs. China only relies on trade for 37% of its economy, having made a concerted effort to ramp up domestic production, making it relatively less vulnerable. Here we look at where US consumers will feel the biggest impact.  Avocados - and other fruit and veg The US imports between half and 60% of its fresh produce from Mexico - and 80% of its avocados, according to figures from the US Department of Agriculture. Canada also supplies a lot of the US's fruit and vegetables, which are mainly grown in greenhouses on the other side of the US border. This means that increased tariffs will quickly be passed on to consumers in the form of higher prices. The US still grows a considerable amount of its own produce, however, so the changes could boost domestic production. But economists warn that overreliance on domestic goods will see those suppliers increase their prices too. Petrol and oil prices Oil and gas prices are likely to be impacted - as Canada provides around 60% of US crude oil imports and Mexico roughly 10%. According to the US Energy Information Administration, the US received around 4.6 million barrels of oil a day from Canada last year - and 563,000 from Mexico. Most US oil refineries are designed specifically to process Canadian products, which would make changing supply sources complex and costly. There has been some speculation that Mr Trump may exempt oil from the new changes - but if he doesn't, the US could see an increase in fuel prices of up to 50 cents (40p) a gallon, economists have predicted. Cars and vehicle parts The US car industry is a delicate mix of foreign and domestic manufacturers. The supply chain is so complex, car parts and half-finished vehicles can sometimes cross the US-Mexico border several times before they are ready for the showroom. If this continues, the parts would be taxed every time they move countries, which would lead to an even bigger increase in prices. To mitigate this, General Motors has said it will try to rush through Mexican and Canadian exports - while brainstorming on how to relocate manufacturing to the US.  Electronic goods  When Donald Trump imposed a 50% tariff on imported washing machines during his first term in 2018, prices suffered for years afterwards. China produces a lot of the world's consumer electronics - and smartphones and computers specifically - so the 10% tariff could have a similar effect on those devices. The Biden administration tried to legislate to promote domestic production of semiconductors (microchips needed for all smart devices) - but for now, the US is still heavily reliant on China for its personal electronics. This will mean an increase in prices for consumers unless tech companies can relocate their operations away from Beijing. Boost for the steel industry The sector that could feel the most benefit from the Trump tariffs is the steel and aluminium industry. It has long been lobbying the government to put tariffs on foreign suppliers - claiming they are dominating the market and leaving US factories without enough business and at risk of closure. Steel imports increasing in price would promote domestic production - and possibly save some of the plants. But when Mr Trump increased steel tariffs during his first term, prices also increased - which business leaders said forced them to pass on costs and left them struggling to complete construction projects on budget. Overall inflation  An increase in the prices of all these goods would inevitably lead to widespread overall inflation. According to analysis by Capital Economics, the Canadian and Mexican tariffs would put inflation above 3% - which is much higher than the Federal Reserve's target of 2% - and the Chinese levies would see it rise even further."
    },
    {
        "title": "Man and woman arrested over deaths of two children in Essex crash after car failed to stop",
        "description": "A man and a woman have been arrested after two children died following a crash in Essex.",
        "url": "https://news.sky.com/story/man-and-woman-arrested-over-deaths-of-two-children-in-essex-crash-after-car-failed-to-stop-13301426",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-crash-essex_6817138.jpg?20250201215743",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-01 21:29:00",
        "Headline": "A boy and a girl died after the collision in Basildon, Essex Police said. ",
        "Content": "A man and a woman have been arrested after two children died following a crash in Essex. Police said a car failed to stop after a collision involving a girl and a boy in Basildon on Saturday evening. Emergency services attended the scene in Walthams Place, Pitsea, but both children died. A man and a woman were arrested on suspicion of causing death by careless driving and failing to stop at the scene of a collision, Essex Police said. They both remain in custody. Temporary Assistant Chief Constable Stuart Hooper said: \"My thoughts are with the friends and family of the girl and boy who have died this evening. \"Specialist officers are supporting them at this truly unimaginably difficult time. \"Our officers will be carrying out enquiries in the area this evening to establish the circumstances which led up to the collision so if you saw anything or have any information please get in contact.\" Police were called to the scene at around 6.25pm and officers are appealing for information, CCTV, dashcam or other footage to come forward."
    },
    {
        "title": "Trump says US airstrikes have 'killed many' ISIS terrorists in Somalia",
        "description": "Donald Trump has said \"many\" ISIS terrorists have been killed in caves in Somalia by US airstrikes he ordered this morning.",
        "url": "https://news.sky.com/story/trump-says-us-airstrikes-have-killed-many-isis-terrorists-13300856",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-somalia-donald-trump_6817083.jpg?20250201205114",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-01 13:41:00",
        "Headline": "The US president said a senior attack planner was targeted. ",
        "Content": "Donald Trump has said \"many\" ISIS terrorists have been killed in caves in Somalia by US airstrikes he ordered this morning. Posting on his social media site Truth Social, the US president said: \"This morning I ordered precision Military air strikes on the Senior ISIS Attack Planner and other terrorists he recruited and led in Somalia. \"These killers, who we found hiding in caves, threatened the United States and our Allies. \"The strikes destroyed the caves they live in, and killed many terrorists without, in any way, harming civilians.\" Mr Trump did not name any of the people targeted in the strikes, say whether the target was among those killed, or give further details about the location. US defence secretary Pete Hegseth said the strikes by the US Africa Command were directed by Mr Trump and coordinated with Somalia's government. An initial Pentagon assessment indicated \"multiple\" operatives were killed and no civilians were harmed. Mr Hegseth said the strikes degrade ISIS's ability \"to plot and conduct terrorist attacks\" threatening the US, itspartners and innocent civilians. \"(It) sends a clear signal that the United States always stands ready to find and eliminate terrorists who threaten the United States and our allies, even as we conduct robust border-protection and many other operations under President Trump's leadership,\" he said in a statement. The office of Somalia's president, Hassan Sheikh Mohamud, said the operation \"reinforces the strong security partnership\" between the two countries in \"combating extremist threats.\" In a post on X, it said Somalia \"remains resolute in working with its allies to eliminate international terrorism and ensure regional stability.\" Mr Trump said the US military had targeted the attack planner for years, but former president Joe Biden \"and his cronies wouldn't act quickly enough to get the job done\". \"I did! The message to ISIS and all others who would attack Americans is that 'WE WILL FIND YOU, AND WE WILL KILL YOU!'\" But the US has periodically carried out strikes in Somalia for years under both Republican and Democratic administrations, including Mr Biden's. A US military airstrike last May targeted ISIS militants and killed three, according to the US Africa Command. US special forces also killed a senior ISIS leader and 10 other militants in a raid on a mountain cave complex in a remote part of northern Somalia in 2023, in an operation ordered by Mr Biden. The latest operation came after military airstrikes on 30 January in northwest Syria, which killed a senior operative in Hurras al Din, an al Qaeda affiliate, US Central Command said. Read more US news:Car driver among dead after Philadelphia plane crashHelicopter was on evacuation trial run before Washington crash US military officials have warned ISIS cells have received increasing direction from the group's leadership that relocated to northern Somalia. That has included how to kidnap Westerners for ransom, how to learn better military tactics, how to hide from drones and how to build their own small quadcopters. There are estimated to be hundreds of ISIS militants in Somalia, mostly scattered in the Cal Miskaat mountains in Puntland's Bari region, according to the International Crisis Group."
    },
    {
        "title": "Man and woman arrested over deaths of two children in Essex crash after car failed to stop",
        "description": "A man and a woman have been arrested after two children died following a crash in Essex.",
        "url": "https://news.sky.com/story/man-and-woman-arrested-over-deaths-of-two-children-in-essex-crash-after-car-failed-to-stop-13301426",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-crash-essex_6817138.jpg?20250201215743",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-01 21:29:00",
        "Headline": "A boy and a girl died after the collision in Basildon, Essex Police said. ",
        "Content": "A man and a woman have been arrested after two children died following a crash in Essex. Police said a car failed to stop after a collision involving a girl and a boy in Basildon on Saturday evening. Emergency services attended the scene in Walthams Place, Pitsea, but both children died. A man and a woman were arrested on suspicion of causing death by careless driving and failing to stop at the scene of a collision, Essex Police said. They both remain in custody. Temporary Assistant Chief Constable Stuart Hooper said: \"My thoughts are with the friends and family of the girl and boy who have died this evening. \"Specialist officers are supporting them at this truly unimaginably difficult time. \"Our officers will be carrying out enquiries in the area this evening to establish the circumstances which led up to the collision so if you saw anything or have any information please get in contact.\" Police were called to the scene at around 6.25pm and officers are appealing for information, CCTV, dashcam or other footage to come forward."
    },
    {
        "title": "Barclays tells customers to contact friends and family or foodbanks after IT glitch",
        "description": "Barclays has advised customers to seek help from friends and family or even contact food banks after a major IT glitch left some locked out of their accounts.",
        "url": "https://news.sky.com/story/barclays-tells-customers-to-contact-friends-and-family-or-foodbanks-after-it-glitch-13300931",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-barclays-swindon-branch_6816406.jpg?20250201145421",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-01 15:30:00",
        "Headline": "Bank apologises as hundreds of customers complain about service disruption and missing funds.  ",
        "Content": "Barclays has advised customers to seek help from friends and family or even contact food banks after a major IT glitch left some locked out of their accounts. Hundreds of people reportedly claim they are experiencing interrupted services and missing funds after the issue struck on what was payday for many British workers and the deadline for self-assessment tax returns. The bank has apologised to those affected, saying the company is facing ongoing technical issues, and promised no one would be left out of pocket. But its handling of complaints has provoked an angry reaction online. Customers have posted on X that they were unable to buy shopping for themselves and their young children, pay their bills or withdraw cash. But the bank insists its ATMs are unaffected. In a statement after the complaints online, Barclays said: \"We are proactively contacting vulnerable customers to offer dedicated help and support. Their calls are being prioritised on our telephony lines meaning their calls get answered first. \"Our ATMs are unaffected by this technical issue so customers can withdraw cash and use their cards to make payments.\" Barclays later added: \"Some may continue to see an outdated balance, and payments made or received may not show. Customers should not try to make the payment again. \"We will ensure that no impacted customer is left out of pocket. \"We are keeping our call centres open for longer this weekend and we will be proactively contacting customers who may be vulnerable.\" Bank's response criticised as 'triggering' On social media site X, in response to one user who said her household \"has no access to money\", the Barclays UK Help account asked: \"Are there any friends or family who can offer support?\" When she said she didn't and criticised the reply as \"so triggering\", the bank's X account posted links to the Trussell Trust, a charity that runs food banks, and Citizens Advice, which offers help for a range of problems. Further afield, David Marsh and his new wife, from Cumbria, told Sky News they had been locked out of their account while on their honeymoon in Australia. And Karen Bannister, 52, from Wakefield, West Yorkshire, said she had transferred all her money into her Barclays account to pay her bills but the funds never arrived. \"My card got declined at the supermarket which was completely embarrassing and by 9pm I was without heating because my gas had run out,\" she said. 'My four-month-old is out of milk powder' One mother said she was unable to buy milk for her baby due to the glitch. \"My four-month-old is out of milk powder and screaming for a feed and I still haven't been paid,\" she said in a post on X. \"I've been in tears for hours.\" Another customer said: \"Due to you Barclays I'm left without money had a food shop due for delivery this morning which now will get cancelled, leave my four kids with no food it's a joke as [it is] my money.\" One asked: \"How can I eat and keep warm if I can't get to my funds?\" And another said: \"Well I've just had to put all my shopping back in Tesco - never been so embarrassed in my life… as can't access my own money.\" Read more from Sky News:What it's really like to live on a canal boatShould we be worried about our drinking water? 'We're incredibly sorry' Barclays has been posting apologetic responses to the complaints. A spokesperson for the bank said earlier: \"We're incredibly sorry for the ongoing technical issues that are impacting our customers' accounts. \"Some may see an outdated balance, and payments made or received may not show. \"We're working hard to fix this issue, and customers should not try to make the payment again. \"Customers can use their cards and withdraw cash, and as soon as these remaining issues are resolved, we'll let our customers know. We will ensure that no impacted customer is left out of pocket.\" In a statement, HMRC said it is \"working closely\" with Barclays to minimise any impact on those submitting their self-assessments. An HMRC spokesperson said: \"Our services are working as normal, so customers will still have been able to file their returns on time. \"Also, the issues will not result in late payment penalties as they don't apply until 1 March.\""
    },
    {
        "title": "Four people killed after vehicle crashes into building in Colchester",
        "description": "Four people have died after a vehicle crashed into a building in Colchester.",
        "url": "https://news.sky.com/story/four-people-killed-after-vehicle-crashes-into-building-in-colchester-13301157",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-essex-colchester-police_6816776.jpg?20250201175828",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-01 17:29:00",
        "Headline": "Police officers were called just before 4.40am on Saturday. They are now asking the public for any information linked to the crash.",
        "Content": "Four people have died after a vehicle crashed into a building in Colchester. Essex Police said the deaths were confirmed at the scene on Magdalen Street. Officers were called just before 4.40am on Saturday. The families of the victims have been informed and will be supported by specialist police officers. The road has been closed for much of the day while the vehicle was recovered. 'Difficult and tragic situation' In an update issued just before 5pm, temporary Assistant Chief Constable Stuart Hooper said: \"My thoughts, and those of everyone at Essex Police, is with the friends and families of the four people who died this morning. \n                  Man and woman arrested over deaths of two children in Essex crash after car failed to stop\n                 \n                  Barclays tells customers to contact friends and family or foodbanks after IT glitch\n                 \n                  AI tools used to generate child abuse images made illegal in 'world leading' move \n                 \"I want to thank the businesses and residents in Magdalen Street area for their support and understanding today in what has been a really difficult and tragic situation. \"I also want to pay tribute to emergency services personnel who have worked diligently, professionally, and compassionately to ensure the dignity of those who have died. \"Our enquiries to establish what led up to the collision are ongoing and I need anyone with information to contact us.\" Read more from Sky News:Second body found in search for missing sistersBarclays bank suffers major IT glitchShould we be worried about our drinking water? Earlier in the day, police described it as a \"serious collision\" and asked people to avoid the area."
    },
    {
        "title": "Second body found in search for missing sisters, Police Scotland say",
        "description": "A second body has been found in the search for two missing sisters in Aberdeen.",
        "url": "https://news.sky.com/story/second-body-found-in-search-for-missing-sisters-police-scotland-say-13300097",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-police-scotland-huszti-sisters_6795781.jpg?20250131115527",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-01 10:20:00",
        "Headline": "The woman has yet to be identified but the sisters' family has been informed, police said.",
        "Content": "A second body has been found in the search for two missing sisters in Aberdeen. Eliza and Henrietta Huszti, both aged 32, were last spotted on CCTV in the city's Market Street at Victoria Bridge at about 2.12am on Tuesday 7 January. Around 9.05pm last night, the body of a woman was recovered from the River Dee in Aberdeen. The woman is yet to be formally identified but the sisters' family has been told, say police. Earlier yesterday, a body, believed to be that of Henrietta, was also recovered from the water. On Tuesday 7 January, the women were seen crossing the bridge and turning right on to a footpath next to the River Dee in the direction of Aberdeen Boat Club. The siblings' disappearance sparked a major Police Scotland operation. Officers previously said there were \"no apparent suspicious circumstances\" as the search was continuing. \n                  Woman's body found close to where two sisters vanished in Scotland\n                 \n                  Police end river search for sisters missing in Aberdeen for three weeks\n                 \n                  Aberdeen Harbour searched in hunt for sisters who went missing almost two weeks ago\n                 The police revealed that the siblings - who are part of a set of triplets and originally from Hungary - visited the bridge where they were last seen about 12 hours before they disappeared. They also sent a text message to their landlady on the morning they vanished, indicating they would not be returning to the flat."
    },
    {
        "title": "EastEnders actor and Chuckle Brother among stars at Linda Nolan's funeral",
        "description": "EastEnders actor Shane Ritchie and comedian Paul Chuckle were among the stars at singer Linda Nolan's funeral in Blackpool on Saturday.",
        "url": "https://news.sky.com/story/eastenders-actor-and-chuckle-brother-among-stars-at-linda-nolans-funeral-13300672",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-linda-nolan-funeral_6816139.jpg?20250201124735",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-01 11:15:00",
        "Headline": "The Nolan sister's pink sparkly coffin was carried into St Paul's Church in Blackpool by her sons and others - while her siblings wore pink breast cancer broaches and earrings - opting for pink handbags to contrast with their black outfits.",
        "Content": "EastEnders actor Shane Ritchie and comedian Paul Chuckle were among the stars at singer Linda Nolan's funeral in Blackpool on Saturday. Nolan died at the age of 65 last month having been diagnosed with breast cancer in 2005. Her pink, sparkly coffin was carried into St Paul's Church in her home city by her sons and others - while her sisters wore pink breast cancer broaches and earrings - opting for pink handbags to contrast with their black outfits. Sisters Linda, Coleen, Bernie, Maureen, Anne, and Denise formed The Nolans in the 1970s and had hits including I'm In The Mood For Dancing and Gotta Pull Myself Together. Linda Nolan also had a career in musical theatre, starring in Blood Brothers, Prisoner Cell Block H, and Pump Boys And Dinettes. In her later years, she appeared on Celebrity Big Brother and wrote a column for the Daily Mirror newspaper. A framed photo of her was placed outside the church and There You'll Be by Faith Hill was played as mourners arrived. In her eulogy, Denise Nolan-Anderson said: \"She really loved going to premieres and opening nights, having her beautiful hair and make-up done, and always was the life and soul of any big occasion. She would have loved all the fuss today.\" She also said Linda showed \"courage in the face of adversity\", adding: \"It's time to rest now Linda. The battle is over, you are free.\" Speaking before the service, Paul Elliott, better known as Paul Chuckle of the Chuckle Brothers, said he last saw her in 2024, adding: \"She was just a fun, bubbly person. The world's a darker place without her.\" Shane Richie was previously married to Coleen Nolan. Other stars who paid their respects at the funeral included Charlotte Dawson, singer Lisa Maffia, and comedian Tommy Cannon. The family statement announcing her death read: \"At around 10.20am on Wednesday 15th January, she passed peacefully, with her loving siblings by her bedside, ensuring she was embraced with love and comfort during her final moments, aged 65.\" After her initial diagnosis, Nolan helped to raise £20m for charities Breast Cancer Now and the Irish Cancer Society. She had a mastectomy and was given the all-clear in 2011 - but was diagnosed with secondary breast cancer that spread to her liver in 2020 and her brain in 2023. The singer was born in Dublin but made Blackpool her home - marrying her husband of more than two decades, the late Brian Hudson, there. The family are raising money for Trinity Hospice in her memory - another organisation Nolan supported."
    },
    {
        "title": "The builder shortage challenging the government's growth plans",
        "description": "Chancellor Rachel Reeves this week confirmed government support for dozens of big projects to boost growth, on top of Labour's existing promise to build 1.5 million new homes.",
        "url": "https://news.sky.com/story/the-builder-shortage-challenging-the-governments-growth-plans-13301354",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-rachel-reeves-chancellor_6812943.jpg?20250128174417",
        "type": "UK",
        "Author": "Jack Parker, Sunday Morning With Trevor Phillips producer",
        "Date Published": "2025-02-01 19:41:00",
        "Headline": "The UK's population growth is far outpacing the size of its construction workforce, according to an analysis carried out for Sky's Sunday Morning With Trevor Phillips. ",
        "Content": "By Jack Parker, Sunday Morning With Trevor Phillips producer  Chancellor Rachel Reeves this week confirmed government support for dozens of big projects to boost growth, on top of Labour's existing promise to build 1.5 million new homes. Major planning system reforms are under way in a bid to meet targets, but among the challenges the government faces in delivery is who will build them. Construction bosses warn of a chronic worker shortage. The Construction Industry Training Board (CITB) estimates at least 50,000 extra workers are needed annually to meet current demand. But analysis for Sky News' Sunday Morning With Trevor Phillips now shows the UK's population growth is far outpacing the size of its construction workforce. Despite growing by 2.5 million people since 2019, the UK has lost 320,000 construction workers. There are now just 29 workers per 1,000 people, the lowest on record. To address the shortage, construction has increasingly turned to overseas. Analysis of the Office for National Statistics' Annual Population Survey (APS) shows that in 2007, one in 12 construction or civil engineering workers was foreign-born. By 2016, this had risen to one in seven. The APS stopped recording occupation by country of birth in 2022, so we don't fully know the current picture. Rishi Sunak's Conservative government tried to attract more overseas construction workers by adding roles including bricklayers and stonemasons to the Shortage Occupation List in July 2023. Since renamed the Immigration Salary List (ISL), over a quarter of roles now on the list are in construction. Labour says it wants to reduce net legal migration, which was an estimated 728,000 in the year to June 2024. Home Secretary Yvette Cooper has commissioned a Migration Advisory Committee report, expected in June, assessing which sectors are \"over-reliant\" on international recruitment. Read more:Growth is fight Starmer and Reeves can't afford to loseShell to install gas platform in North Sea So if the number of construction workers coming into the country is limited, home-grown apprentices might be expected to cover any shortfall. Government figures show around 15,500 people start construction apprenticeships every year, but nearly one in two (47%) do not finish their course. The dropout rate has risen sharply, up from 30% in 2014/15. A survey last year by the British Association of Construction Heads concluded the main reasons for dropping out included redundancies, firings, and low salaries. It means under 9,000 people a year finish their apprenticeship, one-fifth of the CITB estimate of the annual demand. The government has funded 32 skills hubs to offer fast-track training for 5,000 extra apprentices a year by 2028, in trades such as bricklaying and scaffolding. On this weekend's Sunday Morning With Trevor Phillips, Trevor will be joined by Home Secretary Yvette Cooper to discuss whether the solution is more immigration or more domestic training. Watch Sunday Morning With Trevor Phillips every Sunday on Sky News from 8.30am."
    },
    {
        "title": "More British people than ever trapped in modern slavery - as Sky News joins police on abattoir raid",
        "description": "More British people than ever before are being trapped in modern slavery, according to the latest available Home Office figures. &#160;",
        "url": "https://news.sky.com/story/more-british-people-than-ever-trapped-in-modern-slavery-as-sky-news-joins-police-on-abattoir-raid-13300349",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-greater-manchester_6815764.jpg?20250131180748",
        "type": "UK",
        "Author": "Katerina Vittozzi",
        "Date Published": "2025-02-01 00:01:00",
        "Headline": "One alleged victim of modern slavery in the Greater Manchester abattoir was living in conditions deemed \"unsuitable for human habitation\", police said, just metres from where live animals were being slaughtered.",
        "Content": "\n          North of England correspondent\n              @kvittozzi\n  More British people than ever before are being trapped in modern slavery, according to the latest available Home Office figures.   A quarter of all referrals to the UK's national modern slavery safeguarding scheme were related to British nationals. Albanian and Vietnamese nationals were the second and third most referred, respectively. But despite some police forces seeing a rise in charges for human trafficking, conviction rates remain proportionately low. Sky News joined Greater Manchester Police on a raid at an abattoir, following intelligence claims that its owners were suspected of exploiting labour. One alleged victim of modern slavery in the abattoir was living in conditions deemed \"unsuitable for human habitation\", police said, just metres from where live animals were being slaughtered. The man, who was brought to the UK on a legitimate skilled worker visa, told police he was then forced to work long hours for little or no pay. \"The area where our survivor was required to sleep was essentially a converted office space... next to the main slaughter hall,\" DS Lee Attenborough, of Greater Manchester Police, says. \"It's a noisy mechanised site, with a pungent smell from the activity that goes on here and is really not suitable for human habitation as far as we're concerned.\" On this raid, police did not identify any additional suspected victims of modern slavery. But authorities warn that these types of environments are typically where they find the most people who need their help. Following the abattoir raid, a man and a woman, both in their 30s, were arrested on suspicion of human trafficking and an offence of slavery, servitude and forced or compulsory labour on Friday evening. An Albanian national, also in his thirties, was arrested at the same abattoir after he tried to evade police, fleeing from the site and hiding on a nearby roof, DS Attenborough said. Read more from Sky News:Woman's body found near where sisters vanishedFamily want reinvestigation into abuse victim's deathMan jailed after XL bully attacked girl Darren Wright from the Gangmasters and Labour Abuse Authority said: \"Abattoirs, farms, takeaways - anywhere there's money to be made you usually find exploitation. \"It's all about telling these potential victims what support we can offer and what support we can offer to gain their trust. \"But by the very nature of the job, they are very distrustful.\""
    },
    {
        "title": "Mum of baby with rare blood disorder HLH urges people to sign stem cell register in bid to save daughter's life",
        "description": "The mother of a baby girl who was diagnosed with a rare blood disorder has urged people to sign the stem cell register in a bid to save her daughter's life.",
        "url": "https://news.sky.com/story/mum-of-baby-with-rare-blood-disorder-hlh-urges-people-to-sign-stem-cell-register-in-bid-to-save-daughters-life-13300230",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-dolcie-mae-edwards-raymond_6815577.jpg?20250131152605",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-01 00:01:00",
        "Headline": "Dolcie-Mae Edwards-Raymond was diagnosed with hemophagocytic lymphohistiocystosis (HLH) shortly after she was born and will remain in hospital until a stem cell donor is found.",
        "Content": "The mother of a baby girl who was diagnosed with a rare blood disorder has urged people to sign the stem cell register in a bid to save her daughter's life. Doctors initially suspected a viral infection when three-month-old Dolcie-Mae Edwards-Raymond, from Newport in South Wales, fell ill and failed to gain weight shortly after she was born. However, when she was just a month old, her parents Courtney-Jade Edwards, 22, and Ashley David Raymond, 28, were told she has hemophagocytic lymphohistiocystosis (HLH). The immune deficiency disorder occurs when certain types of white blood cells, known as histiocytes and lymphocytes, become overactive and attack the body. It can be life-threatening if left untreated or not diagnosed promptly. Following her diagnosis, Dolcie-Mae was airlifted to the Royal Victoria Infirmary in Newcastle from her home where she is receiving specialist treatment. She will remain in hospital until a matching stem cell donor can be found. \n                  Man and woman arrested over deaths of two children in Essex crash after car failed to stop\n                 \n                  Barclays tells customers to contact friends and family or foodbanks after IT glitch\n                 \n                  AI tools used to generate child abuse images made illegal in 'world leading' move \n                 Ms Edwards said: \"No family should have to go through such an awful journey, watching their child fight a battle bigger than themselves. \"You could help give families like ours a chance to make memories by signing up to the register today. \"When Dolcie-Mae's dad, Ashley, and I found out our daughter had HLH we were devastated. We had no idea about this rare blood disorder until she was diagnosed. \"To hear that our daughter's body was attacking itself was just so heartbreaking. Knowing there was absolutely nothing we could do but sit beside her and pray for better days was awful, leaving us feeling so helpless.\" The family are now appealing for people between the ages of 16 and 30 to join the Anthony Nolan stem cell register to find a donor for Dolcie-Mae. \"Help give patients like my baby girl a second chance at life,\" Ms Edwards said. \"A stem cell transplant from a stranger, someone like you, can be their only hope. Please join the stem cell register.\" Read more:Champion figure skaters on crashed planeUK and US defence secretaries speak for first timeNatalie Cassidy to leave EastEnders after more than 30 years Charlotte Cunliffe, director of register development at Anthony Nolan, said: \"It's heartbreaking to think about what little Dolcie-Mae and her family are going through and we are supporting them through this uncertain time. \"At Anthony Nolan we give hope to families affected by blood cancers and disorders, but we can't do it without the lifesavers that sign up to our register. \"If you are aged 16-30, please sign up to the Anthony Nolan register online and send back your swabs. You could be the match that someone like baby Dolcie-Mae needs to survive.\" According to a study published in 2022, there were 1,674 people with HLH diagnosed in England between 2003 and 2018 There are two types of HLH. One is inherited and usually affects babies under the age of one, while secondary HLH is caused by infections and usually happens after age six."
    },
    {
        "title": "Trump says US airstrikes have 'killed many' ISIS terrorists in Somalia",
        "description": "Donald Trump has said \"many\" ISIS terrorists have been killed in caves in Somalia by US airstrikes he ordered this morning.",
        "url": "https://news.sky.com/story/trump-says-us-airstrikes-have-killed-many-isis-terrorists-13300856",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-somalia-donald-trump_6817083.jpg?20250201205114",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-01 13:41:00",
        "Headline": "The US president said a senior attack planner was targeted. ",
        "Content": "Donald Trump has said \"many\" ISIS terrorists have been killed in caves in Somalia by US airstrikes he ordered this morning. Posting on his social media site Truth Social, the US president said: \"This morning I ordered precision Military air strikes on the Senior ISIS Attack Planner and other terrorists he recruited and led in Somalia. \"These killers, who we found hiding in caves, threatened the United States and our Allies. \"The strikes destroyed the caves they live in, and killed many terrorists without, in any way, harming civilians.\" Mr Trump did not name any of the people targeted in the strikes, say whether the target was among those killed, or give further details about the location. US defence secretary Pete Hegseth said the strikes by the US Africa Command were directed by Mr Trump and coordinated with Somalia's government. An initial Pentagon assessment indicated \"multiple\" operatives were killed and no civilians were harmed. Mr Hegseth said the strikes degrade ISIS's ability \"to plot and conduct terrorist attacks\" threatening the US, itspartners and innocent civilians. \"(It) sends a clear signal that the United States always stands ready to find and eliminate terrorists who threaten the United States and our allies, even as we conduct robust border-protection and many other operations under President Trump's leadership,\" he said in a statement. The office of Somalia's president, Hassan Sheikh Mohamud, said the operation \"reinforces the strong security partnership\" between the two countries in \"combating extremist threats.\" In a post on X, it said Somalia \"remains resolute in working with its allies to eliminate international terrorism and ensure regional stability.\" Mr Trump said the US military had targeted the attack planner for years, but former president Joe Biden \"and his cronies wouldn't act quickly enough to get the job done\". \"I did! The message to ISIS and all others who would attack Americans is that 'WE WILL FIND YOU, AND WE WILL KILL YOU!'\" But the US has periodically carried out strikes in Somalia for years under both Republican and Democratic administrations, including Mr Biden's. A US military airstrike last May targeted ISIS militants and killed three, according to the US Africa Command. US special forces also killed a senior ISIS leader and 10 other militants in a raid on a mountain cave complex in a remote part of northern Somalia in 2023, in an operation ordered by Mr Biden. The latest operation came after military airstrikes on 30 January in northwest Syria, which killed a senior operative in Hurras al Din, an al Qaeda affiliate, US Central Command said. Read more US news:Car driver among dead after Philadelphia plane crashHelicopter was on evacuation trial run before Washington crash US military officials have warned ISIS cells have received increasing direction from the group's leadership that relocated to northern Somalia. That has included how to kidnap Westerners for ransom, how to learn better military tactics, how to hide from drones and how to build their own small quadcopters. There are estimated to be hundreds of ISIS militants in Somalia, mostly scattered in the Cal Miskaat mountains in Puntland's Bari region, according to the International Crisis Group."
    },
    {
        "title": "US wants Ukraine to hold elections following potential ceasefire, Trump envoy says",
        "description": "The US wants Ukraine to hold presidential and parliamentary elections, a special envoy to President Donald Trump has said.",
        "url": "https://news.sky.com/story/us-wants-ukraine-to-hold-elections-following-potential-ceasefire-trump-envoy-says-13301316",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-ukraine-united-states_6817036.jpg?20250201195833",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-01 20:23:00",
        "Headline": "Keith Kellogg, Mr Trump's special envoy for Ukraine and Russia, said the elections could take place by the end of the year, adding such votes \"need to be done\".",
        "Content": "The US wants Ukraine to hold presidential and parliamentary elections, a special envoy to President Donald Trump has said. Keith Kellogg, Mr Trump's special envoy for Ukraine and Russia, said the elections could take place by the end of the year, especially if a truce with Russia was reached, but added such votes \"need to be done\". \"Most democratic nations have elections in their time of war. I think it is important they do so,\" Mr Kellogg told the Reuters news agency. He added: \"I think it is good for democracy. That's the beauty of a solid democracy, you have more than one person potentially running.\" It comes as President Volodymyr Zelenskyy warned that excluding Ukraine from US-Russia talks could be \"very dangerous\". \"They [Russia and US] may have their own relations, but talking about Ukraine without us - it is dangerous for everyone,\" Mr Zelenskyy said. Before being elected, Mr Trump claimed he could end Russia's war in Ukraine in just one day. Both Mr Trump and Mr Kellogg have said they are working on a plan to broker a deal to bring to an end the fighting Russia started with its all-out invasion in February 2022. They have offered scant details about such a plan, nor any timescale for its implementation. Mr Kellogg and other White House officials have discussed pushing Ukraine to agree to elections as part of any initial truce with Russia, according to two people with knowledge of those conversations, Reuters also reported. Other Eastern European nations that have held elections in recent months and years have seen allegations of interference from Russia. It isn't clear how Mr Trump's plan would be received within Ukraine. President Zelenskyy previously said Ukraine could hold elections this year if the fighting ends and strong security guarantees are in place to deter Russia from renewing hostilities.  Mr Zelenskyy's five-year term was supposed to end in 2024 but presidential and parliamentary elections cannot be held under martial law - which Ukraine imposed in February 2022. According to two former senior US officials, Washington raised the issue of elections with officials inside Mr Zelenskyy's office in 2023 and 2024. Officials within Kyiv have pushed back on election conversations with Washington before the most recent election, telling Biden officials that holding votes at such a volatile moment risks weakening Ukraine and potentially inviting Russian influence campaigns. Read more from Sky News:At least 54 killed in Sudan market attackUS airstrikes have 'killed many' ISIS terroristsMore Britons than ever trapped in modern slavery Amid ongoing questions over any potential end to the conflict, the fighting itself continues. Ukraine's military said on Saturday that Russian forces had struck a dormitory housing people preparing for evacuation in a part of Russia's Kursk region held by Ukrainian forces. The military's general staff issued a statement saying that a Russian guided or glide bomb had hit the dormitory in the town of Sudzha, on the Ukrainian border, in the late afternoon. Oleksiy Dmytrashkivskyi, a Ukrainian military spokesman, had earlier said in a video posted on Facebook that nearly 100 people were under rubble at the site and that moans and cries had been heard. He added the building had mostly been housing elderly and infirm people. Elsewhere, a Russian drone and missile strike on Ukraine on Saturday killed 12 people and damaged dozens of residential buildings, as well as energy infrastructure, officials said. The majority of these deaths, eight of them, took place in the central city of Poltava, Ukraine's emergency services said. One person was also killed in Kharkiv in a drone attack, and three police officers were killed while patrolling the streets of a village in the northeastern Sumy region."
    },
    {
        "title": "Emotional reunions as Israeli hostages and Palestinian prisoners back with families",
        "description": "Israeli hostages and Palestinian prisoners have reunited with their families in emotional scenes after being released on Saturday.",
        "url": "https://news.sky.com/story/hamas-starts-releasing-three-hostages-held-in-gaza-13300613",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-hostage-gaza-israel_6816207.jpg?20250201124742",
        "type": "World",
        "Author": "Michael Drummond",
        "Date Published": "2025-02-01 06:42:00",
        "Headline": "Ofer Kalderon, Yarden Bibas and Keith Samuel Siegel were released this morning by Hamas. In return, Israel freed 183 Palestinian prisoners.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n  Israeli hostages and Palestinian prisoners have reunited with their families in emotional scenes after being released on Saturday. Israeli Yarden Bibas hugged his parents and sister for the first time after spending 15 months in captivity in Gaza. The fate of his wife and two young children, who were also taken as hostages, is uncertain. Hamas previously claimed they died in an Israeli airstrike. \"Yarden is a father who left his safe room to protect his family, bravely survived captivity, and returned to an unbearable reality,\" his family said in a statement. Latest updates on freed hostages Israel welcomed Saturday's release of hostages by Hamas, which follows a number of others who were freed on Thursday. In exchange, 183 Palestinian prisoners were freed from Israeli prisons. Israeli hostages released Israelis Ofer Kalderon and Yarden Bibas were the first two released by Hamas into the custody of the Red Cross in Khan Younis this morning and later handed over to Israeli forces. They were seen standing on a stage and waving. American-Israeli Keith Samuel Siegel was released separately, a short time after the first two. In exchange, 183 Palestinian prisoners, some of whom have been serving life sentences in Israel, were released, the Red Cross said. Palestinian prisoners freed There were scenes of celebration in Beitunia in the West Bank when the first of these detainees got off a bus after being released by Israel. Among those prisoners freed on Saturday was Sidqi Hamed al Zaro, 63. The Palestine News Agency reported Zaro, the father of 18 children, has been in Israeli prisons for 24 years. The news outlet cited the Palestinian Prisoners' Club as saying he suffered from several chronic illnesses in jail. Another prisoner released was Imad Abu Ramouz, 50, from Hebron, who was sentenced to 25 years in prison, of which he served 21. In the ongoing first phase of the ceasefire, Hamas is returning 33 hostages over six weeks. In return, Israel is freeing 737 Palestinian prisoners.  Read more:The hostages still to return home 'Indescribable excitement' The family of Ofer Kalderon said they are \"overwhelmed with joy\" after an \"unbearable\" 484 days waiting for him to be freed. \"Today, we finally embrace Ofer, seeing and truly comprehending that he is here with us. \"We have witnessed how, through extraordinary mental strength, he survived this hell. \"Ofer endured months in a nightmare, and we are proud of his ability to survive and hold onto the hope of embracing his children again.\" The family of Keith Siegel said they were filled with \"indescribable excitement\" at his release. \"Finally, after 484 long, terrifying days and nights, full of immense worry for our father, we can breathe again. \"Thank you President Trump, for bringing our father back to us.\" There was an emotional moment when Yarden Bibas, whose wife and two young children have yet to be returned from captivity amid fears for their welfare, was reunited with his parents and sister.  The office of Prime Minister Benjamin Netanyahu said: \"The government, together with all security agencies, will accompany them and their families. \"The Israeli government is committed to the return of all the kidnapped and missing.\"  Meanwhile, the first Palestinians have been allowed through the newly reopened Rafah crossing between Gaza and Egypt. Some 50 injured militants and 50 wounded civilians were expected to be permitted to cross into Egypt on Saturday. Also on Saturday, Egypt, Jordan, Saudi Arabia, Qatar, the UAE, the Palestinian Authority and the Arab League issued a joint statement rejecting the notion of transferring Palestinians outside their land under any circumstances. It appears to be referring to recent comments from Donald Trump suggesting Gazans should be relocated to other countries."
    },
    {
        "title": "'He has left hell': Israelis welcome home hostages after 15 months in Gaza",
        "description": "At first, it was a gentle noise in the distance, but then it became louder and more rhythmic. People started pointing into the sky, and the cheering began, rumbling through Hostages Square.",
        "url": "https://news.sky.com/story/he-has-left-hell-israelis-welcome-home-hostages-after-15-months-in-gaza-13301241",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-israel-gaza_6816834.jpg?20250201181515",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-02-01 19:10:00",
        "Headline": "Sky's Adam Parsons was on the scene in Hostages Square, Tel Aviv, while the latest hostage-prisoner exchange took place. ",
        "Content": "\n          Europe correspondent\n              @adamparsons\n  At first, it was a gentle noise in the distance, but then it became louder and more rhythmic. People started pointing into the sky, and the cheering began, rumbling through Hostages Square. A helicopter came into view, descending towards a nearby hospital. Around us, hundreds of people were waving up into the air - a greeting for Keith Siegel. He began the day as a hostage, his plight for nearly 500 days, but now, peering down at Tel Aviv, he was free. This square has seen so much emotion since 7 October 2023. It is now a mass of pictures, posters and displays, a focal point for a nation that wants its people back and a forum to share both pain and celebration. Today, as the hundreds who came to the square watched on a big screen, there was both joy and anguish. The delight of seeing three hostages released; the pain of knowing that their pain has been profound, and that, for one of them, it simply carries on. 'He has hell ahead of him' When we first saw Yarden Bibas, there was no trace of a smile, no sign of relief. This was a man who was violently assaulted when he was captured: smashed in the head with a hammer. His wife, Shiri, and his children Ariel, aged four at the time, and Kfir, just nine months old, were taken hostage at the same time. But after barely a month as captives, Hamas claimed that Shiri, Ariel and Kfir had been killed in an Israeli airstrike. Many hoped it was simply a lie designed to spread anger and create division. Images of Ariel and Kfir, red-headed and smiling, became a familiar symbol of hope and optimism. But here, as Yarden Bibas stood alone, the hope began to dissipate. \"He has left hell,\" said a man watching quietly in the square, \"but I think he has hell ahead of him\". Later, as Yarden Bibas met his father and sister - in the reception centre set up at a military base in Israel before he was transported to hospital - he held them tight, his smile transforming into an expression of such sadness that it was hard to watch. Such is the uneasy blend of emotions. Dan Lifshitz's grandfather, Oded, a neighbour of both Ofer Calderon and Yarden Bibas, is still a hostage. \"He would be so happy that they have been released,\" he told me. \"He would want them to live their life. I am hopeful for him, to see him again. But I don't wish anyone, not even my worst enemy, to go through this.\" Urgent desire for peace faces new test this week When a hostage is released, there is a wave of euphoria that sweeps alongside and washes away any unease at trading Israeli hostages for far greater numbers of Palestinian prisoners. There is a sense among many in this country that the return of hostages was such a fundamental, visceral need that almost any price was worth paying.  Early next week, ceasefire negotiations will start again, this time about shaping the second phase of this fragile deal. This, crucially, is about designing a permanent ceasefire, the return of all living hostages and the withdrawal of all Israeli troops. These are huge ambitions and it is clear that talks will be complicated, difficult and politically charged. But when you talk to people in either Hostages Square, or on the streets of Ramallah in the West Bank, it is also clear there is an urgent desire for peace. The question is what concessions each side is prepared to accept in pursuing that goal."
    },
    {
        "title": "Bodies in streets as morgues exceed capacity after 700 killed in just four days of fighting around Goma in Congo",
        "description": "More than 700 people have been killed in fighting in the Democratic Republic of Congo this week, the UN has said.",
        "url": "https://news.sky.com/story/bodies-in-streets-as-morgues-exceed-capacity-after-700-killed-in-just-four-days-of-fighting-around-goma-in-congo-13300930",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-dcr-congo-goma-m23_6816495.jpg?20250201154639",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-01 21:02:00",
        "Headline": "Fighting between Rwandan-backed rebels and government forces in the Democratic Republic of Congo has displaced millions already.",
        "Content": "More than 700 people have been killed in fighting in the Democratic Republic of Congo this week, the UN has said. The Congolese health ministry said on Saturday there were 773 bodies in hospital morgues in and around Goma following a recent offensive by rebels who seized the eastern city. More bodies were lying in the street after morgues in the area exceeded their capacity, the ministry added. The UN shared similar figures and added that around 2,800 people are thought to have been injured in the Goma area between 26 and 30 January.  Congo has been wracked by fighting between the Rwandan-backed rebels and government forces. Recently, M23 rebels took control of Goma - east Congo's largest city and the capital of the North Kivu province, which is home to lucrative gold, coltan and tin mines. After taking the city, the Tutsi-led rebels were said to be moving toward Bukavu, in South Kivu, but appeared held up on Friday by Congolese troops supported by Burundi's army. Read more on Congo crisis:Eyewitness: Fears in Goma after rebel advanceExplained: Why is there fighting and is Rwanda invading? Well-trained and professionally armed, M23 is the latest in a long line of Rwandan-supported rebel movements to emerge in Congo's volatile eastern borderlands following two successive wars stemming from Rwanda's 1994 genocide. It is the most potent of more than 100 armed groups vying for control of the eastern region.  The central African nation's military was weakened after it lost hundreds of troops and mercenaries in the fall of Goma. But Congo's military recently recaptured the villages of Sanzi, Muganzo and Mukwidja in South Kivu's Kalehe territory, which had fallen to the rebels earlier this week, according to two civil society officials. UN peacekeeping chief Jean-Pierre Lacroix said the M23 and Rwandan forces were around 37 miles (60km) north of South Kivu's provincial capital of Bukavu, having covered almost the same distance in the previous two days. Mr Lacroix said the rebels \"seem to be moving quite fast,\" and had the chance to capture an airport a few kilometres away which \"would be another really significant step.\" The seizure of Goma also resulted in a humanitarian crisis, the UN said. It had served as a humanitarian hub and was vital for many of the six million people displaced by the conflict. Rose Tchwenko, country director for the Mercy Corps aid group in Congo, said the capture had led to \"a standstill, cutting off a vital lifeline for aid delivery across eastern Congo\". She added: \"The escalation of violence toward Bukavu raises fears of even greater displacement, while the breakdown of humanitarian access is leaving entire communities stranded without support.\" The rebels have vowed to march all the way to Congo's capital Kinshasa, 1,000 miles (1,600km) to the west. The rebel advance has been marked by \"summary executions of at least 12 people\" by the M23 group, UN human rights office spokesman Jeremy Laurence said on Friday, adding the group has also occupied schools and hospitals and subjected civilians to conscription and forced labour. On the other side, Congolese forces have been accused of sexual violence in the region, Mr Laurence added. He said the UN was verifying reports that Congolese troops raped 52 women in South Kivu."
    },
    {
        "title": "Sudan: At least 54 people killed in market attack by Rapid Support Forces paramilitary fighters  ",
        "description": "At least 54 people were killed when paramilitary fighters attacked an open market in Sudan, authorities say.",
        "url": "https://news.sky.com/story/sudan-at-least-54-people-killed-in-market-attack-by-rapid-support-forces-paramilitary-fighters-13300927",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-rsf-khartoum-sudan_6767088.jpg?20241205002629",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-01 15:29:00",
        "Headline": "It is the latest in a series of deadly attacks in the brutal civil war with the Sudanese military.",
        "Content": "At least 54 people were killed when paramilitary fighters attacked an open market in Sudan, authorities say. The attack by the Rapid Support Forces (RSF) on the Sabrein Market in the city of Omdurman also wounded at least 158 others. It's the latest in a series of deadly attacks as the brutal civil war between the RSF and the Sudanese military for control of the country continues. Khalid al Aleisir, minister of culture and government spokesperson, condemned the attack, saying the casualties included many women and children. \"This criminal act adds to the bloody record of this militia,\" he said in a statement. \"It constitutes a blatant violation of international humanitarian law.\"  Sudan's Doctors Syndicate said a mortar shell hit metres away from al Naw Hospital, where most of the casualties from the market attack were taken. The hospital has a significant shortage of medical teams, especially surgeons and nurses, it said. A video posted on social media showed body bags numbered and placed next to each other outside the hospital, with the wounded being treated, and some people on the hospital floor. Read more:History of pyramids and warrior queens at riskSudan war: Massacre on the streets The current conflict in Sudan erupted in April 2023 when a power struggle between the leaders of the military and the RSF boiled over into open fighting in the capital, Khartoum, and other cities. More than 28,000 people have been killed in the conflict and millions forced to flee their homes. Some families have been left eating grass in a desperate attempt to survive, as famine sweeps parts of the country. Last week, about 70 people were killed in an RSF attack on the only functional hospital in the besieged city of Al Fashir in the western region of Darfur. The International Criminal Court has said it was investigating alleged war crimes and crimes against humanity, while the US has accused the RSF and its proxies of committing genocide. In recent months the RSF has suffered multiple battlefield blows, giving the military the upper hand in the war."
    },
    {
        "title": "China has avoided the same tariffs as Mexico and Canada for now - and is taking Trump in its stride",
        "description": "President Donald Trump has been threatening increased tariffs on China for months and now he says he's delivering it.",
        "url": "https://news.sky.com/story/china-has-avoided-the-same-tariffs-as-mexico-and-canada-for-now-and-is-taking-trump-in-its-stride-13300632",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-xi-jinping_6816079.jpg?20250201083304",
        "type": "World",
        "Author": "Nicole Johnston, Asia correspondent",
        "Date Published": "2025-02-01 08:15:00",
        "Headline": "China has side-stepped the 25% hitting Canada and Mexico. Some analysts are suggesting there could be a grand deal between the US and China in the works.",
        "Content": "By Nicole Johnston, Asia correspondent  President Donald Trump has been threatening increased tariffs on China for months and now he says he's delivering it. Trump has said nothing can delay these tariffs, and for China that means an extra 10% slapped on to the cost of its exports. For China's government, this is all part of the great game of handling the new US president. However, the game is increasingly complicated and fraught. Trump previously spoke on the phone to China's President Xi Jinping - they discussed trade, TikTok, and fentanyl. Fentanyl has fuelled the US opioid drug crisis. Chinese companies export chemical precursors that are used by Mexican cartels to make fentanyl. This has outraged Trump. China has restricted some of these chemicals, but its pharmaceutical industry is massive and it is not difficult to modify the chemicals and circumvent government restrictions. Under the previous Biden administration, there was increased cooperation between both countries on the fentanyl problem. Trump clearly believes it has not achieved enough and is applying pressure on China, through tariffs, to do more. Read moreAnalysis: Trump has changed tack - but why?Illegal Colombian migrants in US should go homeTrump signs order for new Guantanamo It is uncertain how China will respond. Beijing says it should not be blamed for US drug addiction. On the issue of trade, China says it is against protectionism and wants a \"win-win solution\". It rarely expands on what that means but at the World Economic Forum in Davos, a government official said the country wants to expand its import of high-quality products. China's trade surplus hit almost $1trn (£810bn) last year. For now, China has side-stepped the 25% hitting Canada and Mexico. Some analysts are suggesting there could be a grand deal between the US and China in the works. But as the rivalry between the countries over artificial intelligence dominance heats up, the stakes grow higher and negotiation more challenging. This week, the release of the new Chinese App DeepSeek was a wake-up call and a watershed moment for the world. The US is alarmed. China is taking it all in its stride."
    },
    {
        "title": "How Donald Trump's tariffs could impact consumers",
        "description": "Donald Trump has long threatened increasing tariffs on goods from Mexico, Canada, and China.",
        "url": "https://news.sky.com/story/how-donald-trumps-tariffs-could-impact-consumers-13300714",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-trump-white-house_6813901.jpg?20250129200117",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-01 12:31:00",
        "Headline": "President Trump has now confirmed that Mexican and Canadian goods will be subject to the full 25% tariff - and Chinese imports to 10%.",
        "Content": "Donald Trump has long threatened increasing tariffs on goods from Mexico, Canada, and China. The second-time president argues higher levies will help reduce illegal migration and the smuggling of fentanyl to the US. On Saturday, the president confirmed that he would subject Mexican and Canadian goods to the full 25% tariff - and Chinese imports to 10%. Although the Trump administration says the changes will boost domestic production, there will likely be wide-ranging negative consequences for the US consumer. Economists argue supply chains will be disrupted and businesses will suffer increased costs - leading to an overall rise in prices. Analysis:Why has Trump targeted Mexico and Canada? Both Mexico and Canada rely heavily on their imports and exports, which make up around 70% of their Gross Domestic Products (GDPs), putting them at even greater risk from the new tariffs. China only relies on trade for 37% of its economy, having made a concerted effort to ramp up domestic production, making it relatively less vulnerable. Here we look at where US consumers will feel the biggest impact.  Avocados - and other fruit and veg The US imports between half and 60% of its fresh produce from Mexico - and 80% of its avocados, according to figures from the US Department of Agriculture. Canada also supplies a lot of the US's fruit and vegetables, which are mainly grown in greenhouses on the other side of the US border. This means that increased tariffs will quickly be passed on to consumers in the form of higher prices. The US still grows a considerable amount of its own produce, however, so the changes could boost domestic production. But economists warn that overreliance on domestic goods will see those suppliers increase their prices too. Petrol and oil prices Oil and gas prices are likely to be impacted - as Canada provides around 60% of US crude oil imports and Mexico roughly 10%. According to the US Energy Information Administration, the US received around 4.6 million barrels of oil a day from Canada last year - and 563,000 from Mexico. Most US oil refineries are designed specifically to process Canadian products, which would make changing supply sources complex and costly. There has been some speculation that Mr Trump may exempt oil from the new changes - but if he doesn't, the US could see an increase in fuel prices of up to 50 cents (40p) a gallon, economists have predicted. Cars and vehicle parts The US car industry is a delicate mix of foreign and domestic manufacturers. The supply chain is so complex, car parts and half-finished vehicles can sometimes cross the US-Mexico border several times before they are ready for the showroom. If this continues, the parts would be taxed every time they move countries, which would lead to an even bigger increase in prices. To mitigate this, General Motors has said it will try to rush through Mexican and Canadian exports - while brainstorming on how to relocate manufacturing to the US.  Electronic goods  When Donald Trump imposed a 50% tariff on imported washing machines during his first term in 2018, prices suffered for years afterwards. China produces a lot of the world's consumer electronics - and smartphones and computers specifically - so the 10% tariff could have a similar effect on those devices. The Biden administration tried to legislate to promote domestic production of semiconductors (microchips needed for all smart devices) - but for now, the US is still heavily reliant on China for its personal electronics. This will mean an increase in prices for consumers unless tech companies can relocate their operations away from Beijing. Boost for the steel industry The sector that could feel the most benefit from the Trump tariffs is the steel and aluminium industry. It has long been lobbying the government to put tariffs on foreign suppliers - claiming they are dominating the market and leaving US factories without enough business and at risk of closure. Steel imports increasing in price would promote domestic production - and possibly save some of the plants. But when Mr Trump increased steel tariffs during his first term, prices also increased - which business leaders said forced them to pass on costs and left them struggling to complete construction projects on budget. Overall inflation  An increase in the prices of all these goods would inevitably lead to widespread overall inflation. According to analysis by Capital Economics, the Canadian and Mexican tariffs would put inflation above 3% - which is much higher than the Federal Reserve's target of 2% - and the Chinese levies would see it rise even further."
    },
    {
        "title": "Trump says US airstrikes have 'killed many' ISIS terrorists in Somalia",
        "description": "Donald Trump has said \"many\" ISIS terrorists have been killed in caves in Somalia by US airstrikes he ordered this morning.",
        "url": "https://news.sky.com/story/trump-says-us-airstrikes-have-killed-many-isis-terrorists-13300856",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-somalia-donald-trump_6817083.jpg?20250201205114",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-01 13:41:00",
        "Headline": "The US president said a senior attack planner was targeted. ",
        "Content": "Donald Trump has said \"many\" ISIS terrorists have been killed in caves in Somalia by US airstrikes he ordered this morning. Posting on his social media site Truth Social, the US president said: \"This morning I ordered precision Military air strikes on the Senior ISIS Attack Planner and other terrorists he recruited and led in Somalia. \"These killers, who we found hiding in caves, threatened the United States and our Allies. \"The strikes destroyed the caves they live in, and killed many terrorists without, in any way, harming civilians.\" Mr Trump did not name any of the people targeted in the strikes, say whether the target was among those killed, or give further details about the location. US defence secretary Pete Hegseth said the strikes by the US Africa Command were directed by Mr Trump and coordinated with Somalia's government. An initial Pentagon assessment indicated \"multiple\" operatives were killed and no civilians were harmed. Mr Hegseth said the strikes degrade ISIS's ability \"to plot and conduct terrorist attacks\" threatening the US, itspartners and innocent civilians. \"(It) sends a clear signal that the United States always stands ready to find and eliminate terrorists who threaten the United States and our allies, even as we conduct robust border-protection and many other operations under President Trump's leadership,\" he said in a statement. The office of Somalia's president, Hassan Sheikh Mohamud, said the operation \"reinforces the strong security partnership\" between the two countries in \"combating extremist threats.\" In a post on X, it said Somalia \"remains resolute in working with its allies to eliminate international terrorism and ensure regional stability.\" Mr Trump said the US military had targeted the attack planner for years, but former president Joe Biden \"and his cronies wouldn't act quickly enough to get the job done\". \"I did! The message to ISIS and all others who would attack Americans is that 'WE WILL FIND YOU, AND WE WILL KILL YOU!'\" But the US has periodically carried out strikes in Somalia for years under both Republican and Democratic administrations, including Mr Biden's. A US military airstrike last May targeted ISIS militants and killed three, according to the US Africa Command. US special forces also killed a senior ISIS leader and 10 other militants in a raid on a mountain cave complex in a remote part of northern Somalia in 2023, in an operation ordered by Mr Biden. The latest operation came after military airstrikes on 30 January in northwest Syria, which killed a senior operative in Hurras al Din, an al Qaeda affiliate, US Central Command said. Read more US news:Car driver among dead after Philadelphia plane crashHelicopter was on evacuation trial run before Washington crash US military officials have warned ISIS cells have received increasing direction from the group's leadership that relocated to northern Somalia. That has included how to kidnap Westerners for ransom, how to learn better military tactics, how to hide from drones and how to build their own small quadcopters. There are estimated to be hundreds of ISIS militants in Somalia, mostly scattered in the Cal Miskaat mountains in Puntland's Bari region, according to the International Crisis Group."
    },
    {
        "title": "US wants Ukraine to hold elections following potential ceasefire, Trump envoy says",
        "description": "The US wants Ukraine to hold presidential and parliamentary elections, a special envoy to President Donald Trump has said.",
        "url": "https://news.sky.com/story/us-wants-ukraine-to-hold-elections-following-potential-ceasefire-trump-envoy-says-13301316",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-ukraine-united-states_6817036.jpg?20250201195833",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-01 20:23:00",
        "Headline": "Keith Kellogg, Mr Trump's special envoy for Ukraine and Russia, said the elections could take place by the end of the year, adding such votes \"need to be done\".",
        "Content": "The US wants Ukraine to hold presidential and parliamentary elections, a special envoy to President Donald Trump has said. Keith Kellogg, Mr Trump's special envoy for Ukraine and Russia, said the elections could take place by the end of the year, especially if a truce with Russia was reached, but added such votes \"need to be done\". \"Most democratic nations have elections in their time of war. I think it is important they do so,\" Mr Kellogg told the Reuters news agency. He added: \"I think it is good for democracy. That's the beauty of a solid democracy, you have more than one person potentially running.\" It comes as President Volodymyr Zelenskyy warned that excluding Ukraine from US-Russia talks could be \"very dangerous\". \"They [Russia and US] may have their own relations, but talking about Ukraine without us - it is dangerous for everyone,\" Mr Zelenskyy said. Before being elected, Mr Trump claimed he could end Russia's war in Ukraine in just one day. Both Mr Trump and Mr Kellogg have said they are working on a plan to broker a deal to bring to an end the fighting Russia started with its all-out invasion in February 2022. They have offered scant details about such a plan, nor any timescale for its implementation. Mr Kellogg and other White House officials have discussed pushing Ukraine to agree to elections as part of any initial truce with Russia, according to two people with knowledge of those conversations, Reuters also reported. Other Eastern European nations that have held elections in recent months and years have seen allegations of interference from Russia. It isn't clear how Mr Trump's plan would be received within Ukraine. President Zelenskyy previously said Ukraine could hold elections this year if the fighting ends and strong security guarantees are in place to deter Russia from renewing hostilities.  Mr Zelenskyy's five-year term was supposed to end in 2024 but presidential and parliamentary elections cannot be held under martial law - which Ukraine imposed in February 2022. According to two former senior US officials, Washington raised the issue of elections with officials inside Mr Zelenskyy's office in 2023 and 2024. Officials within Kyiv have pushed back on election conversations with Washington before the most recent election, telling Biden officials that holding votes at such a volatile moment risks weakening Ukraine and potentially inviting Russian influence campaigns. Read more from Sky News:At least 54 killed in Sudan market attackUS airstrikes have 'killed many' ISIS terroristsMore Britons than ever trapped in modern slavery Amid ongoing questions over any potential end to the conflict, the fighting itself continues. Ukraine's military said on Saturday that Russian forces had struck a dormitory housing people preparing for evacuation in a part of Russia's Kursk region held by Ukrainian forces. The military's general staff issued a statement saying that a Russian guided or glide bomb had hit the dormitory in the town of Sudzha, on the Ukrainian border, in the late afternoon. Oleksiy Dmytrashkivskyi, a Ukrainian military spokesman, had earlier said in a video posted on Facebook that nearly 100 people were under rubble at the site and that moans and cries had been heard. He added the building had mostly been housing elderly and infirm people. Elsewhere, a Russian drone and missile strike on Ukraine on Saturday killed 12 people and damaged dozens of residential buildings, as well as energy infrastructure, officials said. The majority of these deaths, eight of them, took place in the central city of Poltava, Ukraine's emergency services said. One person was also killed in Kharkiv in a drone attack, and three police officers were killed while patrolling the streets of a village in the northeastern Sumy region."
    },
    {
        "title": "Car driver on ground among dead after Philadelphia plane crash which killed mother and daughter",
        "description": "The driver of a car was also killed when a medical transport plane crashed in Philadelphia, the mayor of the US city has confirmed.",
        "url": "https://news.sky.com/story/car-driver-on-ground-among-dead-after-philadelphia-plane-crash-which-killed-mother-and-daughter-13300792",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-philadelphia-plane-crash_6816024.jpg?20250201015327",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-01 13:57:00",
        "Headline": "In total, at least seven people are confirmed to have died after a medical plane crashed in a residential area in Philadelphia.",
        "Content": " The driver of a car was also killed when a medical transport plane crashed in Philadelphia, the mayor of the US city has confirmed. All six on board were killed in the crash - a young patient and her mother, on their way home to Tijuana, Mexico, along with four crew members. At least 19 others were also injured in the crash, which left several homes engulfed in flames.  The child on board had just completed treatment for a life-threatening condition. The plane crashed around 30 seconds after taking off. In a news conference on Saturday, Philadelphia mayor Cherelle Parker confirmed another person had died, who was on the ground in a car when the plane crashed. She added the number of injured may rise. Adam Thiel, managing director for the city of Philadelphia, said there were \"a lot of unknowns\" as to who was where on the streets when the plane came down. It would likely be days until the total number of dead and injured was known, he said, adding teams were now going house to house to inspect dwellings as part of efforts to get a sense of how far debris was scattered.  The plane came down near the Roosevelt Mall in the Rhawnhurst area of Pennsylvania at 6.30pm local time on Friday (11.30pm UK time). Jet Rescue Air Ambulance, which operated the Learjet 55, previously said in a statement: \"We cannot confirm any survivors.\" Read more from Sky News:What we know about Washington crash passengersSecond body found in search for missing sistersTrump hits Canada, Mexico and China with tariffs On Saturday, in a statement on social media, Mexican President Claudia Sheinbaum said the six people who died on board the plane were all Mexican nationals. The child had received care at Shriners Children's hospital and was heading to Missouri before flying onward to Mexico. The crash came just two days after the deadliest US air disaster in a generation. An American Airlines passenger jet and a military helicopter collided mid-air in Washington DC, killing 67 people."
    },
    {
        "title": "Black Hawk helicopter was on emergency evacuation trial run before Washington DC crash, officials say",
        "description": "The Black Hawk helicopter which collided with a passenger plane above Washington DC was training for a hypothetical evacuation of US leaders at the time, according to US officials.",
        "url": "https://news.sky.com/story/black-hawk-helicopter-was-on-doomsday-practice-mission-before-washington-dc-crash-with-passenger-plane-officials-say-13300782",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-black-hawk-us-army_6816399.jpg?20250201145223",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-01 13:53:00",
        "Headline": "A senior army chief defended the helicopter's flight near a busy airport, pointing to the sensitive nature of its mission.",
        "Content": "The Black Hawk helicopter which collided with a passenger plane above Washington DC was training for a hypothetical evacuation of US leaders at the time, according to US officials. Three soldiers inside the military aircraft were killed as well as 64 people aboard the American Airlines jet. A total of 42 bodies have been recovered from the wreckage in the Potomac River so far. The US military named the third soldier killed in the crash on Saturday evening as Captain Rebecca M Lobach, of Durham, North Carolina. The army had previously identified two of the soldiers killed as Staff Sergeant Ryan Austin O'Hara and Chief Warrant Officer 2 Andrew Loyd Eaves. The scenario the helicopter crew was practising involved the evacuation of high-ranking US officials, Reuters reported. An investigation into the cause of the catastrophe is ongoing. It has emerged that the helicopter had been on a training flight along a route core to a seldom-discussed military mission - to evacuate senior officials to safety in the event of an attack on the US, officials say. The mission is known as \"continuity of government\" and \"continuity of operations\" and is meant to preserve the ability of the government to operate in a disaster scenario. New US defence secretary Pete Hegseth revealed the Black Hawk crew's training mission on Thursday, saying they \"were on a routine, annual re-training of night flights on a standard corridor for a continuity of government mission\". The army has come under scrutiny for flying at night near a busy airport, but officials pointed to the sensitive nature of the operation. Read more:What we know about the passengersWhat air traffic audio tells us  \"Some of their mission is to support the department of defence if something really bad happens in this area, and we need to move our senior leaders,\" said Jonathan Koziol, the chief of staff of the army's aviation directorate. The most recent time the mission is known to have been carried out - for real - was on September 11, 2001, when a Black Hawk was sent to collect then deputy secretary of defence Paul Wolfowitz following the terror attacks on New York and Washington."
    },
    {
        "title": "Los Angeles Eaton and Palisades wildfires, that killed 29, now 100% contained",
        "description": "The two Los Angeles wildfires that killed 29 people and scorched thousands of acres have been 100% contained at last after 24 days, local firefighters have said.",
        "url": "https://news.sky.com/story/los-angeles-eaton-and-palisades-wildfires-that-killed-29-now-100-contained-13301395",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-los-angeles-fiers-los-angeles-fires_6796642.jpg?20250111120058",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-01 20:32:00",
        "Headline": "Last month, Los Angeles was rocked by a number of wildfires that saw tens of thousands flee their homes.",
        "Content": "The two Los Angeles wildfires that killed 29 people and scorched thousands of acres have been 100% contained at last after 24 days, local firefighters have said. More than 18,000 structures were damaged or destroyed in the deadly Eaton and Palisades blazes, which swept across California last month. The fires were declared fully contained by the California Department of Forestry and Fire Protection on Saturday. Containment means the percentage of the fire's perimeter that firefighters have under control, with confidence those lines can be maintained. Parts of the interior of the blaze may still be alight. Strong winds made the two fires, which began on 7 January and broke out on either side of Los Angeles, so deadly. The Palisades fire erupted in Pacific Palisades, east of Malibu, as a brush fire. It quickly exploded in dry weather. The Eaton Fire began in the foothills of Angeles National Forest, feasting on seven months of rain-free brush as strong winds helped spread it. The containment is a largely symbolic milestone after one of the worst natural disasters in Los Angeles County history. The remaining fires had been limited to isolated steep mountain terrain. Long overdue rain reached Southern California in the past week, helping firefighters contain the fires. However, it was partly a hindrance to emergency responders, causing mudslides and flash floods. \"Had this rain come two weeks ago, it might have been more helpful,\" Margaret Stewart, a spokesperson for the Los Angeles Fire Department said. On Friday, some of music's biggest acts came together for FireAid to raise money for the relief efforts, with Green Day and Billie Eilish kicking off the benefit concert which saw a surprise Nirvana performance. Read more from Sky News:Four killed after vehicle crashes into buildingSeven dead after Philadelphia plane crashUS airstrikes 'killed many' ISIS terrorists Private forecasters projected damage and economic losses from the fire of more than $250bn (£201bn)."
    },
    {
        "title": "Barclays tells customers to contact friends and family or foodbanks after IT glitch",
        "description": "Barclays has advised customers to seek help from friends and family or even contact food banks after a major IT glitch left some locked out of their accounts.",
        "url": "https://news.sky.com/story/barclays-tells-customers-to-contact-friends-and-family-or-foodbanks-after-it-glitch-13300931",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-barclays-swindon-branch_6816406.jpg?20250201145421",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-02-01 15:30:00",
        "Headline": "Bank apologises as hundreds of customers complain about service disruption and missing funds.  ",
        "Content": "Barclays has advised customers to seek help from friends and family or even contact food banks after a major IT glitch left some locked out of their accounts. Hundreds of people reportedly claim they are experiencing interrupted services and missing funds after the issue struck on what was payday for many British workers and the deadline for self-assessment tax returns. The bank has apologised to those affected, saying the company is facing ongoing technical issues, and promised no one would be left out of pocket. But its handling of complaints has provoked an angry reaction online. Customers have posted on X that they were unable to buy shopping for themselves and their young children, pay their bills or withdraw cash. But the bank insists its ATMs are unaffected. In a statement after the complaints online, Barclays said: \"We are proactively contacting vulnerable customers to offer dedicated help and support. Their calls are being prioritised on our telephony lines meaning their calls get answered first. \"Our ATMs are unaffected by this technical issue so customers can withdraw cash and use their cards to make payments.\" Barclays later added: \"Some may continue to see an outdated balance, and payments made or received may not show. Customers should not try to make the payment again. \"We will ensure that no impacted customer is left out of pocket. \"We are keeping our call centres open for longer this weekend and we will be proactively contacting customers who may be vulnerable.\" Bank's response criticised as 'triggering' On social media site X, in response to one user who said her household \"has no access to money\", the Barclays UK Help account asked: \"Are there any friends or family who can offer support?\" When she said she didn't and criticised the reply as \"so triggering\", the bank's X account posted links to the Trussell Trust, a charity that runs food banks, and Citizens Advice, which offers help for a range of problems. Further afield, David Marsh and his new wife, from Cumbria, told Sky News they had been locked out of their account while on their honeymoon in Australia. And Karen Bannister, 52, from Wakefield, West Yorkshire, said she had transferred all her money into her Barclays account to pay her bills but the funds never arrived. \"My card got declined at the supermarket which was completely embarrassing and by 9pm I was without heating because my gas had run out,\" she said. 'My four-month-old is out of milk powder' One mother said she was unable to buy milk for her baby due to the glitch. \"My four-month-old is out of milk powder and screaming for a feed and I still haven't been paid,\" she said in a post on X. \"I've been in tears for hours.\" Another customer said: \"Due to you Barclays I'm left without money had a food shop due for delivery this morning which now will get cancelled, leave my four kids with no food it's a joke as [it is] my money.\" One asked: \"How can I eat and keep warm if I can't get to my funds?\" And another said: \"Well I've just had to put all my shopping back in Tesco - never been so embarrassed in my life… as can't access my own money.\" Read more from Sky News:What it's really like to live on a canal boatShould we be worried about our drinking water? 'We're incredibly sorry' Barclays has been posting apologetic responses to the complaints. A spokesperson for the bank said earlier: \"We're incredibly sorry for the ongoing technical issues that are impacting our customers' accounts. \"Some may see an outdated balance, and payments made or received may not show. \"We're working hard to fix this issue, and customers should not try to make the payment again. \"Customers can use their cards and withdraw cash, and as soon as these remaining issues are resolved, we'll let our customers know. We will ensure that no impacted customer is left out of pocket.\" In a statement, HMRC said it is \"working closely\" with Barclays to minimise any impact on those submitting their self-assessments. An HMRC spokesperson said: \"Our services are working as normal, so customers will still have been able to file their returns on time. \"Also, the issues will not result in late payment penalties as they don't apply until 1 March.\""
    },
    {
        "title": "Honeymoon couple unable to access their money online as Barclays suffers major IT glitch",
        "description": "A newlywed couple say they have been locked out of their bank accounts while on their honeymoon as Barclays suffered a major IT glitch.",
        "url": "https://news.sky.com/story/honeymoon-couple-unable-to-access-their-money-online-as-barclays-suffers-major-it-glitch-13300654",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-barclays-app-file_6816172.jpg?20250201120435",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-02-01 09:30:00",
        "Headline": "People have been unable to access money overnight after the issue struck on what was payday for many British workers. The bank has apologised.",
        "Content": "A newlywed couple say they have been locked out of their bank accounts while on their honeymoon as Barclays suffered a major IT glitch. Read latest on Barclays glitch:Bank tells customers to contact family or foodbanks People were unable to access money overnight after the issue struck on what was payday for many British workers. Hundreds of customers reportedly claim they are experiencing interrupted services and missing funds, with some alleging they have had no access to their cash for nearly 24 hours. David Marsh and his wife, from Cumbria, told Sky News they've been experiencing problems accessing their money while on holiday in Australia to celebrate their marriage. \"I'm unable to receive money for my honeymoon into my current account or use my current account to clear my credit card before departing,\" he said. \"My message to Barclays is: I've been a current account holder with Barclays since 1986. The day I return to the UK, I will be moving my current account to another provider and leaving them.\" \n                  Barclays tells customers to contact friends and family or foodbanks after IT glitch\n                 \n                  Barclays to slash CEO's fixed pay as package capped at £14m\n                 \n                  Barclays in talks with Brookfield about deal for UK payments division\n                 What has Barclays said? Barclays has apologised to customers, saying the company is facing ongoing technical issues. It warned that some people may see an outdated balance, and payments made or received may not show. \"We will ensure that no customer is left out of pocket,\" the bank said in a statement on Saturday. Mum 'unable to buy milk' A mother claimed she was unable to buy milk for her baby due to the IT glitch. \"My four-month-old is out of milk powder and screaming for a feed and I still haven't been paid,\" she said. She added: \"I've been in tears for hours.\" 'Money never arrived in my account' Karen Bannister, 52, from Wakefield, West Yorkshire, told Sky News: \"I had transferred all my money into Barclays to cover paying for gas, electric, rent, petrol, food etc. The money never arrived in my Barclays account. She added: \"My card got declined at the supermarket which was completely embarrassing and by 9pm I was without heating because my gas had run out.\" \"Yesterday was awful. Barclays need to pay compensation to those affected. People were without salary and some couldn't pay their tax before the deadline. \"Following this, I'm leaving Barclays - and I've been a customer for 40 years.\" Read more from Sky News:'I bought my dream home for £35,000'Should we be worried about our drinking water? Frustrated customers have also been reaching out to Barclays support via social media. \"Due to you Barclays I'm left without money had a food shop due for delivery this morning which now will get cancelled, leave my four kids with no food it's a joke as (it is) my money,\" one X user claimed. Another added: \"How can I eat and keep warm if I can't get to my funds?\" A third person claimed: \"Well I've just had to put all my shopping back in Tesco never been so embarrassed in my life .. as can't access my own money.\" The Down Detector tracker has shown more than 1,600 reports of outages for Barclays banking services since Friday. In its statement on Saturday, Barclays said: \"We're incredibly sorry for the ongoing technical issues that are impacting our customers' accounts. \"Some may see an outdated balance, and payments made or received may not show. \"We're working hard to fix this issue, and customers should not try to make the payment again.\""
    },
    {
        "title": "NatWest finalises £450m bonus pot as return to private ownership looms",
        "description": "NatWest Group is finalising plans to pay out close to &#163;450m in bonuses for last year as it prepares for a return to&#160;full private ownership nearly 17 years&#160;after its bailout.",
        "url": "https://news.sky.com/story/natwest-finalises-163450m-bonus-pot-as-return-to-private-ownership-looms-13300658",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-natwest-bank_6816102.jpg?20250201101426",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-01 10:11:00",
        "Headline": "The bank's annual results will come with the government on the brink of no longer being its single-biggest shareholder after nearly 17 years, Sky News can reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n NatWest Group is finalising plans to pay out close to £450m in bonuses for last year as it prepares for a return to full private ownership nearly 17 years after its bailout. Sky News has learnt that the bank's remuneration committee is close to signing off the bonus pool ahead of its annual results announcement later this month. The figure of roughly £450m will be about 25% higher than last year's bonus pot of £356m, reflecting NatWest's sharply improved performance in 2024, according to City sources. Shares in the bank, which at one point was more than 80%-owned by British taxpayers, have nearly doubled over the last 12 months. The Treasury has been rapidly reducing its stake in NatWest, with it now standing at just under 8%. This weekend, Sky News can also reveal that the state will cease to become the company's single-biggest shareholder within a matter of weeks, based on the current pace of the government's trading plan, which drip-feeds stock into the market. BlackRock, the world's largest asset manager, holds a stake in NatWest of roughly 6%, meaning it could replace the Treasury as NatWest's biggest investor as early as this month. \n                  Barclays tells customers to contact friends and family or foodbanks after IT glitch\n                 \n                  Honeymoon couple unable to access their money online as Barclays suffers major IT glitch\n                 \n                  Donald Trump plans to hit Canada, Mexico and China with tariffs - amid fears US consumers could suffer\n                 That would represent another significant milestone for NatWest's board, chaired by Rick Haythornthwaite. In October, the bank raised its profit outlook after posting a 26% rise in third-quarter income. After its shares closed at 433.1p on Friday afternoon, it now has a market capitalisation of close to £35bn. Last year, Sky News revealed that NatWest was planning to hand its chief executive a potential multimillion pound pay boost as it returns to full private ownership. Lena Wilson, the chair of the bank's remuneration committee has been consulting leading institutional shareholders about an overhaul of its boardroom pay policy, with the proposals to be put to a vote at its spring AGM. Under the plans, Paul Thwaite, who took over as the bank's interim chief executive in July 2023 before being handed the role on a permanent basis in February, would be in line for an increase in his maximum annual bonus from 100% of his base salary to 150%. NatWest also intends to replace its restricted share plan (RSP) for Mr Thwaite, which awarded him stock worth a maximum of 150% of his salary, with a performance share plan (PSP) which could pay him up to three times his basic pay each year. Assuming his salary of just under £1.2m remains unchanged, that would mean him being in line for a maximum reward package - excluding pension contributions and other items - of about £6.6m, up from roughly £4.2m today. The prospective increase would bring Mr Thwaite's compensation more closely into line with peers including Charlie Nunn at Lloyds Banking Group and CS Venkatakrishnan at Barclays - who himself is expected to see his annual pay capped at just over £14m under a new policy. Mr Thwaite replaced Dame Alison Rose after she was forced to step down over the debanking row involving Nigel Farage, the Reform Party leader. Leading City investors who have been part of the consultation process are said to be overwhelmingly supportive of the pay overhaul. During its previous incarnation as Royal Bank of Scotland, the bank encountered annual controversy over its remuneration - for its chief executives and the wider workforce. In the immediate aftermath of its £45.5bn rescue by taxpayers during the financial crisis of 2008, the pension package of Fred Goodwin, RBS's former chief, and bonuses awarded to his successor, Stephen Hester, became political headaches for the governments of Gordon Brown and David Cameron. In recent years, however, such conflagrations have been defused by a combination of pay restraint and improved performance. Even after the recent recovery in its valuation, taxpayers will see a loss running to billions of pounds from NatWest's emergency bailout. A NatWest Group spokesperson declined to comment."
    },
    {
        "title": "China has avoided the same tariffs as Mexico and Canada for now - and is taking Trump in its stride",
        "description": "President Donald Trump has been threatening increased tariffs on China for months and now he says he's delivering it.",
        "url": "https://news.sky.com/story/china-has-avoided-the-same-tariffs-as-mexico-and-canada-for-now-and-is-taking-trump-in-its-stride-13300632",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-xi-jinping_6816079.jpg?20250201083304",
        "type": "Business",
        "Author": "Nicole Johnston, Asia correspondent",
        "Date Published": "2025-02-01 08:15:00",
        "Headline": "China has side-stepped the 25% hitting Canada and Mexico. Some analysts are suggesting there could be a grand deal between the US and China in the works.",
        "Content": "By Nicole Johnston, Asia correspondent  President Donald Trump has been threatening increased tariffs on China for months and now he says he's delivering it. Trump has said nothing can delay these tariffs, and for China that means an extra 10% slapped on to the cost of its exports. For China's government, this is all part of the great game of handling the new US president. However, the game is increasingly complicated and fraught. Trump previously spoke on the phone to China's President Xi Jinping - they discussed trade, TikTok, and fentanyl. Fentanyl has fuelled the US opioid drug crisis. Chinese companies export chemical precursors that are used by Mexican cartels to make fentanyl. This has outraged Trump. China has restricted some of these chemicals, but its pharmaceutical industry is massive and it is not difficult to modify the chemicals and circumvent government restrictions. Under the previous Biden administration, there was increased cooperation between both countries on the fentanyl problem. Trump clearly believes it has not achieved enough and is applying pressure on China, through tariffs, to do more. Read moreAnalysis: Trump has changed tack - but why?Illegal Colombian migrants in US should go homeTrump signs order for new Guantanamo It is uncertain how China will respond. Beijing says it should not be blamed for US drug addiction. On the issue of trade, China says it is against protectionism and wants a \"win-win solution\". It rarely expands on what that means but at the World Economic Forum in Davos, a government official said the country wants to expand its import of high-quality products. China's trade surplus hit almost $1trn (£810bn) last year. For now, China has side-stepped the 25% hitting Canada and Mexico. Some analysts are suggesting there could be a grand deal between the US and China in the works. But as the rivalry between the countries over artificial intelligence dominance heats up, the stakes grow higher and negotiation more challenging. This week, the release of the new Chinese App DeepSeek was a wake-up call and a watershed moment for the world. The US is alarmed. China is taking it all in its stride."
    },
    {
        "title": "Wine-lovers left to drown sorrows as tax hike hits cost of a bottle - but it's not all bad news for drinkers",
        "description": "Consumers will see the price of alcohol rise from Saturday when a hike in tax and duties comes into effect.",
        "url": "https://news.sky.com/story/wine-lovers-left-to-drown-sorrows-as-tax-hike-hits-cost-of-a-bottle-but-its-not-all-bad-news-for-drinkers-13300603",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-wine-glass-stock-generic_6717773.jpg?20241016164457",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-02-01 04:06:00",
        "Headline": "In some relief to drinkers, duty on draught products - or pints pulled in pubs - will be cut by 1.7%, meaning a penny off a pint in the pub.",
        "Content": " Consumers will see the price of alcohol rise from Saturday when a hike in tax and duties comes into effect. The alcohol tax itself will rise in line with the Retail Price Index at 3.6%, but a new system to tax wines and spirits based on strength will be introduced at the same time. This means the duty on a bottle of gin will rise by 32p, while wine at 14.5% ABV (alcohol by volume) will increase by 54p. The changes to excise duty and taxing wine according to strength came into effect on 1 August, 2023 but the Conservative government introduced a temporary reprieve for wines with a strength between 11.5% and 14.5%, taxed at a flat rate of 12.5%. The Wine and Spirit Trade Association (WSTA) has calculated that a 14.5% ABV bottle of red wine would have risen by 98p in 18 months, taking into account new duty hikes introduced in August 2023. Read more:FTSE 100 reaches another record highElectric cargo bike firm Zedify crashes into administration It also warned of further costs in April due to waste packaging recycling fees coming into effect, adding an additional cost of 12p for a bottle of wine and 18p for a bottle of spirits. \n                  How Gen Z are impacting Guinness sales and supplies\n                 \n                  'More welcoming than ever': 86% of pubs now selling no and low-alcohol beer as they seek to be 'even more inclusive'\n                 \n                  Budweiser clarifies '100% renewable electricity' claim on UK website after complaint to ASA\n                 WSTA chief executive Miles Beale said: \"There are no winners under the UK's punishing alcohol tax regime. \"Higher duty rates mean people buy less which results in reduced income to the Exchequer, businesses are being squeezed and consumers have to pay more.\" However, in some relief to drinkers, duty on draught products - or pints pulled in pubs - will be cut by 1.7%, meaning a penny off a pint in the pub. Exchequer Secretary to the Treasury James Murray said: \"Our pubs and brewers are an essential part the fabric of the UK and our brilliant high streets. \"Through draught relief, small producer relief, and expanding market access for smaller brewers, we will help boost sector growth and deliver our Plan for Change to put more money in working people's pockets.\" Richard Naisby, chairman of the Society of Independent Brewers and Associates, said: \"The government's increased investment in draught relief means that draught beer sold in our community pubs has a lower rate of alcohol duty than beer sold in supermarkets and should encourage more people to support their local. \"At the same time by going further on small producer relief, the government can help small breweries to compete and grow their businesses.\""
    },
    {
        "title": "The builder shortage challenging the government's growth plans",
        "description": "Chancellor Rachel Reeves this week confirmed government support for dozens of big projects to boost growth, on top of Labour's existing promise to build 1.5 million new homes.",
        "url": "https://news.sky.com/story/the-builder-shortage-challenging-the-governments-growth-plans-13301354",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-rachel-reeves-chancellor_6812943.jpg?20250128174417",
        "type": "Politics",
        "Author": "Jack Parker, Sunday Morning With Trevor Phillips producer",
        "Date Published": "2025-02-01 19:41:00",
        "Headline": "The UK's population growth is far outpacing the size of its construction workforce, according to an analysis carried out for Sky's Sunday Morning With Trevor Phillips. ",
        "Content": "By Jack Parker, Sunday Morning With Trevor Phillips producer  Chancellor Rachel Reeves this week confirmed government support for dozens of big projects to boost growth, on top of Labour's existing promise to build 1.5 million new homes. Major planning system reforms are under way in a bid to meet targets, but among the challenges the government faces in delivery is who will build them. Construction bosses warn of a chronic worker shortage. The Construction Industry Training Board (CITB) estimates at least 50,000 extra workers are needed annually to meet current demand. But analysis for Sky News' Sunday Morning With Trevor Phillips now shows the UK's population growth is far outpacing the size of its construction workforce. Despite growing by 2.5 million people since 2019, the UK has lost 320,000 construction workers. There are now just 29 workers per 1,000 people, the lowest on record. To address the shortage, construction has increasingly turned to overseas. Analysis of the Office for National Statistics' Annual Population Survey (APS) shows that in 2007, one in 12 construction or civil engineering workers was foreign-born. By 2016, this had risen to one in seven. The APS stopped recording occupation by country of birth in 2022, so we don't fully know the current picture. Rishi Sunak's Conservative government tried to attract more overseas construction workers by adding roles including bricklayers and stonemasons to the Shortage Occupation List in July 2023. Since renamed the Immigration Salary List (ISL), over a quarter of roles now on the list are in construction. Labour says it wants to reduce net legal migration, which was an estimated 728,000 in the year to June 2024. Home Secretary Yvette Cooper has commissioned a Migration Advisory Committee report, expected in June, assessing which sectors are \"over-reliant\" on international recruitment. Read more:Growth is fight Starmer and Reeves can't afford to loseShell to install gas platform in North Sea So if the number of construction workers coming into the country is limited, home-grown apprentices might be expected to cover any shortfall. Government figures show around 15,500 people start construction apprenticeships every year, but nearly one in two (47%) do not finish their course. The dropout rate has risen sharply, up from 30% in 2014/15. A survey last year by the British Association of Construction Heads concluded the main reasons for dropping out included redundancies, firings, and low salaries. It means under 9,000 people a year finish their apprenticeship, one-fifth of the CITB estimate of the annual demand. The government has funded 32 skills hubs to offer fast-track training for 5,000 extra apprentices a year by 2028, in trades such as bricklaying and scaffolding. On this weekend's Sunday Morning With Trevor Phillips, Trevor will be joined by Home Secretary Yvette Cooper to discuss whether the solution is more immigration or more domestic training. Watch Sunday Morning With Trevor Phillips every Sunday on Sky News from 8.30am."
    },
    {
        "title": "Shell to install Jackdaw gas platform in North Sea despite being blocked from drilling, Sky News understands",
        "description": "Energy giant Shell is due to install a multi-billion pound gas platform in the North Sea this spring despite being blocked from drilling, Sky News understands.",
        "url": "https://news.sky.com/story/shell-to-install-jackdaw-gas-platform-in-north-sea-despite-being-blocked-from-drilling-sky-news-understands-13300335",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-jackdaw-scotland_6815456.jpg?20250131131010",
        "type": "Politics",
        "Author": "Connor Gillies",
        "Date Published": "2025-02-01 00:01:00",
        "Headline": "The ban on drilling is in place after a judge decided the previous Conservative government acted \"unlawfully\" when it gave consent to Shell's Jackdaw and Rosebank fields.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n Energy giant Shell is due to install a multi-billion pound gas platform in the North Sea this spring despite being blocked from drilling, Sky News understands. The Jackdaw field, which it is claimed could eventually power more than a million UK homes, has to get fresh approval from Downing Street to extract gas after a ruling this week by a Scottish court. A judge in Edinburgh decided the previous Conservative government acted \"unlawfully\" when it gave consent to Shell's Jackdaw and Rosebank, the UK's largest untapped oilfield containing around 350 million barrels of oil. The pair could eventually still proceed. But the court said the original assessments failed to acknowledge the impact of burning the oil and gas, rather than just from getting them out of the ground. A ban on drilling is in place until new permissions are given. Shell, which says it welcomes the decision, is continuing to prepare its platform which is currently in the final stages of construction in Norway. The company has not confirmed its next steps, but it is understood the structure is due to be towed into British waters in the coming months by barge. A Shell spokesman said: \"The ruling rightly allows work to progress on this nationally important energy project while new consents are sought.\"We have spent more than £800m since the regulator approved Jackdaw in 2022. \"Swift action is needed from the government so that we and other North Sea operators can make decisions about vital UK energy infrastructure.\" Read more from Sky News:Scottish govt 'unlikely' to meet target on reducing car usePublic backlash not only issue Heathrow plans face Rosebank is operated by Equinor and Ithaca Energy. Sir Keir Starmer's government says it will work \"at speed\" to reassess permissions. The case creates a possible political quandary for the prime minister who pledged during the general election campaign not to issue new oil and gas licences. Downing Street is currently on a well-publicised mission to improve economic growth in the UK and the oil giants, who have already invested hundreds of millions of pounds in these projects, will be hoping the political fallout of rejecting these licences would be too excruciating for Labour to bear. There is still a way Labour could sign them off while still sticking to its election promise, as these projects already have licences, but just need final government consent. The court ruling is being seen as a victory among climate campaigners. Commenting on the decisions the prime minister now faces, Tessa Khan, executive director of the campaign group Uplift, said: \"The government must reject it. \"To do otherwise would undermine its ambitious clean growth plans by sending a signal to investors that the UK isn't serious about transitioning away from expensive oil and gas.\""
    },
    {
        "title": "Wine-lovers left to drown sorrows as tax hike hits cost of a bottle - but it's not all bad news for drinkers",
        "description": "Consumers will see the price of alcohol rise from Saturday when a hike in tax and duties comes into effect.",
        "url": "https://news.sky.com/story/wine-lovers-left-to-drown-sorrows-as-tax-hike-hits-cost-of-a-bottle-but-its-not-all-bad-news-for-drinkers-13300603",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-wine-glass-stock-generic_6717773.jpg?20241016164457",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-01 04:06:00",
        "Headline": "In some relief to drinkers, duty on draught products - or pints pulled in pubs - will be cut by 1.7%, meaning a penny off a pint in the pub.",
        "Content": " Consumers will see the price of alcohol rise from Saturday when a hike in tax and duties comes into effect. The alcohol tax itself will rise in line with the Retail Price Index at 3.6%, but a new system to tax wines and spirits based on strength will be introduced at the same time. This means the duty on a bottle of gin will rise by 32p, while wine at 14.5% ABV (alcohol by volume) will increase by 54p. The changes to excise duty and taxing wine according to strength came into effect on 1 August, 2023 but the Conservative government introduced a temporary reprieve for wines with a strength between 11.5% and 14.5%, taxed at a flat rate of 12.5%. The Wine and Spirit Trade Association (WSTA) has calculated that a 14.5% ABV bottle of red wine would have risen by 98p in 18 months, taking into account new duty hikes introduced in August 2023. Read more:FTSE 100 reaches another record highElectric cargo bike firm Zedify crashes into administration It also warned of further costs in April due to waste packaging recycling fees coming into effect, adding an additional cost of 12p for a bottle of wine and 18p for a bottle of spirits. \n                  How Gen Z are impacting Guinness sales and supplies\n                 \n                  'More welcoming than ever': 86% of pubs now selling no and low-alcohol beer as they seek to be 'even more inclusive'\n                 \n                  Budweiser clarifies '100% renewable electricity' claim on UK website after complaint to ASA\n                 WSTA chief executive Miles Beale said: \"There are no winners under the UK's punishing alcohol tax regime. \"Higher duty rates mean people buy less which results in reduced income to the Exchequer, businesses are being squeezed and consumers have to pay more.\" However, in some relief to drinkers, duty on draught products - or pints pulled in pubs - will be cut by 1.7%, meaning a penny off a pint in the pub. Exchequer Secretary to the Treasury James Murray said: \"Our pubs and brewers are an essential part the fabric of the UK and our brilliant high streets. \"Through draught relief, small producer relief, and expanding market access for smaller brewers, we will help boost sector growth and deliver our Plan for Change to put more money in working people's pockets.\" Richard Naisby, chairman of the Society of Independent Brewers and Associates, said: \"The government's increased investment in draught relief means that draught beer sold in our community pubs has a lower rate of alcohol duty than beer sold in supermarkets and should encourage more people to support their local. \"At the same time by going further on small producer relief, the government can help small breweries to compete and grow their businesses.\""
    },
    {
        "title": "Shell to install Jackdaw gas platform in North Sea despite being blocked from drilling, Sky News understands",
        "description": "Energy giant Shell is due to install a multi-billion pound gas platform in the North Sea this spring despite being blocked from drilling, Sky News understands.",
        "url": "https://news.sky.com/story/shell-to-install-jackdaw-gas-platform-in-north-sea-despite-being-blocked-from-drilling-sky-news-understands-13300335",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-jackdaw-scotland_6815456.jpg?20250131131010",
        "type": "Technology",
        "Author": "Connor Gillies",
        "Date Published": "2025-02-01 00:01:00",
        "Headline": "The ban on drilling is in place after a judge decided the previous Conservative government acted \"unlawfully\" when it gave consent to Shell's Jackdaw and Rosebank fields.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n Energy giant Shell is due to install a multi-billion pound gas platform in the North Sea this spring despite being blocked from drilling, Sky News understands. The Jackdaw field, which it is claimed could eventually power more than a million UK homes, has to get fresh approval from Downing Street to extract gas after a ruling this week by a Scottish court. A judge in Edinburgh decided the previous Conservative government acted \"unlawfully\" when it gave consent to Shell's Jackdaw and Rosebank, the UK's largest untapped oilfield containing around 350 million barrels of oil. The pair could eventually still proceed. But the court said the original assessments failed to acknowledge the impact of burning the oil and gas, rather than just from getting them out of the ground. A ban on drilling is in place until new permissions are given. Shell, which says it welcomes the decision, is continuing to prepare its platform which is currently in the final stages of construction in Norway. The company has not confirmed its next steps, but it is understood the structure is due to be towed into British waters in the coming months by barge. A Shell spokesman said: \"The ruling rightly allows work to progress on this nationally important energy project while new consents are sought.\"We have spent more than £800m since the regulator approved Jackdaw in 2022. \"Swift action is needed from the government so that we and other North Sea operators can make decisions about vital UK energy infrastructure.\" Read more from Sky News:Scottish govt 'unlikely' to meet target on reducing car usePublic backlash not only issue Heathrow plans face Rosebank is operated by Equinor and Ithaca Energy. Sir Keir Starmer's government says it will work \"at speed\" to reassess permissions. The case creates a possible political quandary for the prime minister who pledged during the general election campaign not to issue new oil and gas licences. Downing Street is currently on a well-publicised mission to improve economic growth in the UK and the oil giants, who have already invested hundreds of millions of pounds in these projects, will be hoping the political fallout of rejecting these licences would be too excruciating for Labour to bear. There is still a way Labour could sign them off while still sticking to its election promise, as these projects already have licences, but just need final government consent. The court ruling is being seen as a victory among climate campaigners. Commenting on the decisions the prime minister now faces, Tessa Khan, executive director of the campaign group Uplift, said: \"The government must reject it. \"To do otherwise would undermine its ambitious clean growth plans by sending a signal to investors that the UK isn't serious about transitioning away from expensive oil and gas.\""
    },
    {
        "title": "Should we be worried about our drinking water?",
        "description": "Louise stopped drinking tap water around 12 years ago.",
        "url": "https://news.sky.com/story/should-we-be-worried-about-our-drinking-water-13270874",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-graphic-water-drinking-water_6775011.jpg?20241213151153",
        "type": "Technology",
        "Author": "Lara Keay",
        "Date Published": "2025-02-01 00:01:00",
        "Headline": "Experts tell Sky News that although the UK's water treatment system is unable to get rid of tiny traces of \"forever chemicals\" that have been linked to cancers and other long-term health conditions, filtering your water at home will eliminate most of them.",
        "Content": "\n          News reporter\n              @LaraKeay\n Louise stopped drinking tap water around 12 years ago. Since then, she has spent hundreds of pounds on all manner of at-home filtration systems in a bid to ease her anxieties about water quality. \"It's always been a concern for me,\" the 34-year-old nurse, from Greater Manchester, tells Sky News. \"In my line of work, I deal with a lot of bacteria. E-coli, legionella, norovirus - and they can all come from water. It's a scary thought.\" She says that while her worries may just be \"speculation\" - and there are strict rules on hand hygiene and infection control on her NHS ward - water has been a \"personal concern\" for more than a decade. Women, well-educated and city-dwellers are most worried A study published last year showed 52.3% of people across 141 countries were worried about being harmed by their drinking water in the next two years. The research, which used 2019 polling data from more than 148,000 people, also found that water concerns were more common among women, people who live in urban areas, those with higher levels of education, and people experiencing financial difficulties. In the UK, more than 20% reported being worried, while the latest trust in water survey by regulator OFWAT also showed trust in water companies had dropped to 65% by the end of 2022 - compared with 76% at the beginning of that year. Claire, 59, from Cheltenham, says she stopped drinking tap water after her father was diagnosed with Parkinson's disease and cancer more than a decade ago. \"My father is very unwell,\" she says. \"And very early on in his treatment one of the consultants told him making small changes would help - eating organic food and drinking filtered water.\" Her parents bought a filter jug and an under-sink filtration system - and she soon followed suit. Claire says she also questioned local water quality after the 2007 flash flooding across Gloucestershire left her and her neighbours without drinking water for three weeks. When the River Severn flooded, the contaminated floodwater inundated the local treatment plant, leaving supplies undrinkable. Claire now uses refillable filter cartridges called Pure Pods, while Louise opts for Water2 - a below-tap filter co-owned by Bear Grylls. Read morePFAs found in food and drink samplesWhat went wrong with Britain's water system?New water industry review launched  \"When the water got turned back on - the smell that came out of the tap was unbelievable,\" she recalls. \"The amount of chemicals they were having to pump into the tap to make it drinkable.\" Last May, a damaged air valve in South West Water's network allowed the parasite cryptosporidium to get into a reservoir near Brixham, Devon - which left many with a diarrhoea bug and 17,000 households without water for eight weeks. Illness-inducing pathogens are 'rare' The UK's Drinking Water Inspectorate (DWI) and other regulatory agencies elsewhere apply very strict rules to make sure microbial contaminants like bacteria and viruses and chemical contaminants such as metals and pesticides are removed, says Professor Luisa Orsini, professor of evolutionary systems biology and environmental omics at the University of Birmingham. Her colleague, Dr Mohamed Abdallah, associate professor of environmental sciences, adds: \"The tolerance is nearly zero for any of those pathogens in drinking water. \"But our research shows that while the DWI is happy about the things they are monitoring - there are things that are not being monitored.\" Forever chemicals (PFAs) are 'silent killers' Perfluoroalkyl and polyfluoroalkyl substances (PFAs) are a group of around 10,000 \"forever chemicals\", so called because there is little evidence they biodegrade over time. They are used to make domestic and industrial products including carpets, floor polish, frying pans, cosmetics, and food packaging. A study by the experts' team at the University of Birmingham found 10 target PFAs present in 99% of tap and bottled water samples taken from cities in the UK and 14 other countries. While substances like cryptosporidium and E.coli can be deadly for people with weakened immune systems, while very unpleasant, their impacts are immediate and for most people relatively short-lived. But PFAs have been linked to several cancers, Parkinson's disease, reduced fertility, and resistance to both antibiotics and vaccines. Infants are particularly vulnerable as their nervous and immune systems are not fully formed. \"Forever chemicals are silent killers,\" Professor Orsini says. \"They have very strong adverse effects over time even at very low doses - and that's the message we want to share from our research.\" According to the experts, PFAs are particularly concerning for the dual reason that the UK's current wastewater treatment technology is not sufficient in removing them - and regulation is not strict enough. Most works have a primary and secondary treatment process, which is efficient at getting rid of pathogens and some chemicals - but not PFAs as they are extremely persistent. Tertiary treatment is therefore needed to remove them, even when they occur at very low levels, says Prof Orsini. The academics and their team have developed a tertiary treatment that can reduce PFAs, other toxic chemicals, and pesticides in wastewater by using tiny water fleas - known as daphnia - to hoover them up. They argue this is a better, environmentally friendly alternative to some of the energy-intensive systems currently being developed. No legal duty to remove PFAs As for regulation, there is no statutory requirement for water companies to remove PFAs in England and Wales. The World Health Organisation has no framework for them either, but recommends countries aim for \"concentrations that are as low as reasonably practical\". Before Brexit, the UK was going to adopt a limit of 0.1 micrograms per litre - the equivalent of one part per billion - in line with the European Union. This is the current guidance in England and Wales - but there is no legal requirement. Last year, Scotland introduced the 0.1 micrograms per litre standard in law for 20 PFAs. Earlier this year, the US Environmental Protection Agency enforced much stricter rules - a maximum limit of 0.4 nanograms per litre - or four parts per trillion - because of the potential human harm. Prof Orsini and Dr Abdallah are among 50 scientists who have written to the government calling for stricter, statutory regulation on PFAs. A cross-party bill has now been put forward by Liberal Democrat MP Munira Wilson and will get a second reading in the Commons. But Professor Ian Cousins, an environmental chemist at Stockholm University in Sweden who also signed the letter, warns: \"Because the UK has been slow in acting on PFAs pollution, many British people have been unnecessarily and unknowingly exposed to a whole cocktail of PFAs.\" Sky News has contacted the Department for Environment, Food and Rural Affairs for further comment. At-home filters remove 'considerable amount' Feeling worried? \"It's not all doom and gloom,\" Dr Abdallah says. \"There are simple things that can be done at home to help. \"Carbon filters - either cartridges you buy or those already fitted in fridges that dispense water - are efficient in removing PFAs.\" Both experts say they use these kinds of filters themselves. \"Carbon filtration removes a considerable amount of different contaminants - including PFAs - which is good news for everyone who's worried about it, including myself,\" Dr Abdallah adds. At-home filter systems either come in jug, or countertop form, or they attach directly to the tap, or the pipes under the sink. They vary in price from around £50 to £350. Reverse osmosis filters, which remove all impurities, are much more expensive, and often need to be installed outside - directly where water enters the home. They also remove some of the beneficial minerals in water, however - such as zinc and calcium - but these can be restored either by the system itself or in droplets you can buy. In some parts of the world, and when bugs are found in the water supply in the UK, people boil their water to get rid of pathogens. But research shows that boiling only removes microbial contaminants - and will not eliminate PFAs. What about bottled water? For the past five years, Raza, 26, his parents, and his siblings have been buying their water - and not drinking any from the tap. The family, who live in London, buy roughly three packs of six two-litre bottles a week. Raza, who works as an adviser at a humanitarian think tank, says he made the initial decision to help increase and monitor his water intake - having suffered kidney problems as a teenager. \"It encourages me to drink more,\" he tells Sky News. \"It's a sort of pressure to finish the bottle - and allows me to track how much I've drunk throughout the day.\" He says travelling a lot - to countries where bottled water is considered the gold standard - and media reports of water supplies getting contaminated have \"reinforced\" his bottled water habit. But what do the experts say? Bottled water has its own regulations - but they impose the same limits on pathogens and chemicals as those for tap water. Testing and enforcement are down to the Food Standards Agency and local councils - but this is based on representative sampling - so not every bottle on the shelves is tested. \"People tend to think water from the tap isn't as safe as water from a bottle - but exactly the opposite is true,\" Prof Orsini says. \"Tap water goes through regular and stringent controls before it's even distributed - so it's way safer than any other source. \"Bottled water also runs the risk of exposing you to microplastics - so tap is the better option - especially when combined with filtering.\" From last year bottled water manufacturers have had to prove compliance with the 0.1 micrograms per litre guidance limit on PFAs as part of their business plans. A DEFRA spokesperson said: \"Bottled water is tightly regulated to ensure consumer protection, with the water sources for spring water and natural mineral water protected from pollution. \"UK drinking water standards are of an exceptionally high standard and are among the best in the world. Water companies are required to carry out regular risk assessments and sampling to make sure that drinking water supplies remain safe.\""
    },
    {
        "title": "EastEnders actor and Chuckle Brother among stars at Linda Nolan's funeral",
        "description": "EastEnders actor Shane Ritchie and comedian Paul Chuckle were among the stars at singer Linda Nolan's funeral in Blackpool on Saturday.",
        "url": "https://news.sky.com/story/eastenders-actor-and-chuckle-brother-among-stars-at-linda-nolans-funeral-13300672",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-linda-nolan-funeral_6816139.jpg?20250201124735",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-01 11:15:00",
        "Headline": "The Nolan sister's pink sparkly coffin was carried into St Paul's Church in Blackpool by her sons and others - while her siblings wore pink breast cancer broaches and earrings - opting for pink handbags to contrast with their black outfits.",
        "Content": "EastEnders actor Shane Ritchie and comedian Paul Chuckle were among the stars at singer Linda Nolan's funeral in Blackpool on Saturday. Nolan died at the age of 65 last month having been diagnosed with breast cancer in 2005. Her pink, sparkly coffin was carried into St Paul's Church in her home city by her sons and others - while her sisters wore pink breast cancer broaches and earrings - opting for pink handbags to contrast with their black outfits. Sisters Linda, Coleen, Bernie, Maureen, Anne, and Denise formed The Nolans in the 1970s and had hits including I'm In The Mood For Dancing and Gotta Pull Myself Together. Linda Nolan also had a career in musical theatre, starring in Blood Brothers, Prisoner Cell Block H, and Pump Boys And Dinettes. In her later years, she appeared on Celebrity Big Brother and wrote a column for the Daily Mirror newspaper. A framed photo of her was placed outside the church and There You'll Be by Faith Hill was played as mourners arrived. In her eulogy, Denise Nolan-Anderson said: \"She really loved going to premieres and opening nights, having her beautiful hair and make-up done, and always was the life and soul of any big occasion. She would have loved all the fuss today.\" She also said Linda showed \"courage in the face of adversity\", adding: \"It's time to rest now Linda. The battle is over, you are free.\" Speaking before the service, Paul Elliott, better known as Paul Chuckle of the Chuckle Brothers, said he last saw her in 2024, adding: \"She was just a fun, bubbly person. The world's a darker place without her.\" Shane Richie was previously married to Coleen Nolan. Other stars who paid their respects at the funeral included Charlotte Dawson, singer Lisa Maffia, and comedian Tommy Cannon. The family statement announcing her death read: \"At around 10.20am on Wednesday 15th January, she passed peacefully, with her loving siblings by her bedside, ensuring she was embraced with love and comfort during her final moments, aged 65.\" After her initial diagnosis, Nolan helped to raise £20m for charities Breast Cancer Now and the Irish Cancer Society. She had a mastectomy and was given the all-clear in 2011 - but was diagnosed with secondary breast cancer that spread to her liver in 2020 and her brain in 2023. The singer was born in Dublin but made Blackpool her home - marrying her husband of more than two decades, the late Brian Hudson, there. The family are raising money for Trinity Hospice in her memory - another organisation Nolan supported."
    },
    {
        "title": "Sterling K Brown on Black Panther, taping up his basketball shoes and Paradise",
        "description": "Sterling K Brown says being part of Black Panther was a \"cultural moment\" that allowed him to be \"part of history\" - and he'd jump at the chance to become part of the Marvel world again.",
        "url": "https://news.sky.com/story/sterling-k-brown-on-black-panther-taping-up-his-basketball-shoes-and-paradise-13300237",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-stirling-k-brown-paradise_6815612.jpg?20250131172029",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-02-01 00:01:00",
        "Headline": "Sterling K Brown played N'Jobu in Black Panther, and was beloved as Randall Pearson in This Is Us - now he's playing a very different role in Paradise - a murder mystery with something much bigger underneath.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Sterling K Brown says being part of Black Panther was a \"cultural moment\" that allowed him to be \"part of history\" - and he'd jump at the chance to become part of the Marvel world again. The 48-year-old actor, who's currently starring in the mind-bending drama Paradise, told Sky News: \"I remember reading that script - they don't give it to you - you have to read it and then turn it back or your hands burn off or something like that… \"I remember thinking, this is a cultural moment. This is so big, not only for black America but for black people across the globe to see themselves front and centre in the largest, most zeitgeisty pop cultural machine in the world right now, the MCU [Marvel Cinematic Universe]. The superhero movie won three Oscars - Marvel's first ever Academy Awards - including a win for costume design and best production design, the first in both categories for women of colour. Brown goes on: \"I just want to be a part of history. It was history. It was awesome.\" The Missouri-born star's career trajectory has been impressive, from \"living beneath the poverty line\" to being nominated for an Oscar, he's always been single-minded in his pursuit of acting. He explains: \"I didn't have a hard knock life. We grew up in a house. My mom was a schoolteacher. My dad was a grocery clerk. All our needs were met. \n                  Black Panther actress Connie Chiume dies aged 72\n                 \n                  Black Panther returns - but the cast say it felt 'hollow' without Chadwick Boseman\n                 \n                  Wakanda Forever: Stars of Black Panther sequel say they hope actor Chadwick Boseman 'would be proud'\n                 \"But I would tape my basketball shoes up if the sole came apart because that fixed them. And my mom got mad at me one time, she's like, 'You know, we can buy you shoes?' I was like, 'Yeah, but I fixed them. What's the big deal?'\" He says making his living through his craft was always his focus, adding, \"I know that's a luxury that's not afforded to a lot of people. The fact that it's gone my way, I'm incredibly thankful for.\" A three-time Emmy winner, The People V O J Simpson: American Crime Story saw him gain public attention, followed by a season in The Marvellous Mrs Maisel, an episode of Brooklyn Nine-Nine and the multi-award-winning This Is Us. 'I've got good taste' When his role in American Fiction earned him an Oscar nomination, he insists he didn't see it coming, saying: \"I just knew it was a great story, a great script, and I wanted to be a part of it.\" He goes on: \"They're all sort of game-changers. People will give me credit. I'll take credit for having good taste, but you never know when lightning is going to strike, right?\" A fatalist, he says: \"I leave it in the hands of the universe and just say, 'If you want me to step here, I'll step there and whatever happens, happens'.\" Now he's leading the cast of Disney+ drama Paradise, playing Agent Xavier Collins, a man charged with protecting a second-term president - played by James Marsden - in a serene community of high-net-worth individuals. Brown admits the role came with obligations: \"There is a different level of responsibility when you're one on the call sheet. I think people do look to you to help set the tone of what the environment is going to be like, and I don't mind that.\" The brainchild of Dan Fogelman, best known for his work on This Is Us and Only Murders In The Building, Paradise is a murder mystery with something much bigger underneath. 'Billionaires on camera' Impossible to elaborate on further without giving away spoilers, it's enough to say the first episode throws up a twist few will see coming. Despite various parallels with the current political climate, Fogelman says he came up with the idea over a decade ago, but concedes the timing is \"certainly unusual\". Fogelman tells Sky News: \"We're openly seeing billionaires on camera having a big hand in government. And while money and wealth have always been a factor in things behind the scenes, it's very out front and centre right now in a way that the show openly discusses [and] things about the environment and climate change.\" Brown too says the themes are prescient: \"The world is unpredictable and a little bit nutty and a lot of people are on edge as to what is next. I don't know if it's across the world. I definitely know that it's in the United States for certain. \"I think the show in a very strange way, is sort of asking the same questions like, 'All right, we're in new territory right now. I have no idea what happens next. I'm a little scared about that.'\" He goes on: \"People are going to draw all sorts of conclusions and inferences and comparisons. I will leave them to draw whatever they wish because if I was an audience member, I would too.\" The first three episodes of Paradise are available on Disney+ now, with new episodes dropping each Tuesday."
    },
    {
        "title": "Nickel Boys: RaMell Ross's portrait of the harsh life in a US reform school is a surprise Oscars contender",
        "description": "Nickel Boys has become one of the surprise additions to the 97th Academy Awards.",
        "url": "https://news.sky.com/story/nickel-boys-ramell-rosss-portrait-of-the-harsh-life-in-a-us-reform-school-is-a-surprise-oscars-contender-13300591",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-nickel-boys-brandon-wilson_6799214.jpg?20250114175447",
        "type": "Entertainment",
        "Author": "Debbie Ridgard",
        "Date Published": "2025-02-01 00:01:00",
        "Headline": "A tale of two black teenagers coping with the harrowing environment of a US reform school in the 1960s is up for best picture and best adapted screenplay at the Academy Awards.",
        "Content": "\n          Entertainment reporter\n              @Debbie_Ridgard\n  Nickel Boys has become one of the surprise additions to the 97th Academy Awards. Based on the 2019 Colson Whitehead novel of the same name, it has been nominated in the best picture and best adapted screenplay categories at the Oscars this March. Shot entirely in the first-person perspective, it follows the friendship between two black teenagers living in the harrowing environment of a racially segregated reform school in 1960s Florida. In trying to give a voice to the voiceless, director RaMell Ross tells Sky News he made a conscious decision to shift the narrative away from the violence and instead shine the spotlight on the people at the centre of the story. He describes it as \"a multiple fold\". \"One of the folds is just the history of cinema and its relationship to the voyeurism of black folks being harassed, tortured, and beaten. And knowing that enough, the image is already in our heads,\" he says. \"The second fold would be that there's so many ways to explore trauma, and I would say most of them are by far unexplored. And so, what other ways are there?\" \n                  Grammy Awards: Everything to know ahead of the show\n                 \n                  EastEnders actor and Chuckle Brother among stars at Linda Nolan's funeral\n                 \n                  Sterling K Brown on Black Panther, taping up his basketball shoes and Paradise\n                 What makes Nickel Boys even more distressing is the fact that it was inspired by a real place, the Dozier School in Florida, where mass graves containing the bodies of young black boys were discovered. Ethan Herisse plays Elwood in the film, a promising teenager who unknowingly gets into a stolen car and is arrested just as he's on the cusp of creating the life he desires. The When They See Us actor says being involved in the project was a unique experience. Herisse says: \"While we were making it, it felt like we were doing something special and there was so much love from all the people that were working on that set. So, I was just hoping that it was able to come across when it was all said and done. \"I can't remember the last time that I had been so absorbed and immersed in a world of a movie. It was in such a unique way with this one. \"I wasn't necessarily in my own body, and I think that that's a really rewarding experience to have as a viewer.\" Read more:Nirvana re-form for LA FireAidStars close to agreeing cult sequelNatalie Cassidy quits EastEnders Nickel Boys takes some bold risks in cinematography and Herisse believes audiences are looking for films that challenge the viewer. Herisse says: \"I think there is a real deep desire from audience members to watch, like original and exciting and unique new films that bring them to a different place or force them into a different perspective. \"I think it's a beautiful thing.\" The film is something of an underdog for best picture, simply because the others, like Conclave, A Complete Unknown, Emilia Perez and Dune: Part Two, received much wider releases and are currently available to watch either in cinema or on streaming platforms."
    }
]