[
    {
        "title": "Liverpool parade incident: Two people - including child - seriously injured after car drove into crowd",
        "description": "Two people, one of them a child, have sustained serious injuries after a car ploughed into crowds at the Liverpool FC trophy parade.",
        "url": "https://news.sky.com/story/liverpool-parade-incident-two-people-including-child-seriously-injured-after-car-drives-into-crowd-13375148",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-liverpool-parade_6928256.jpg?20250526213252",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-26 19:18:00",
        "Headline": "A total of 27 people were taken to hospital by ambulance after Monday evening's incident in the city centre. Four were trapped under the vehicle.",
        "Content": " Two people, one of them a child, have sustained serious injuries after a car ploughed into crowds at the Liverpool FC trophy parade. A total of 27 people were taken to hospital by ambulance after Monday evening's incident on Water Street in the city centre. Four of them were trapped under the vehicle, with fire crews moving \"rapidly\" to free them so they could be treated. Follow the latest developments in our live blog  Twenty others were treated at the scene for minor injuries, and a cyclist paramedic was among those struck by the vehicle. At a news conference, Assistant Chief Constable Jenny Sims stressed that the incident is not being treated as terror-related. She said a 53-year-old white British man from the Liverpool area remains in custody, who is believed to be the person driving the vehicle. \"What I can tell you is that we believe this to be an isolated incident, and we are not currently looking for anyone else in connection to it,\" she added. Hundreds of thousands of people were lining the streets to celebrate Liverpool winning the Premier League. Footage shows car drive into crowd at speed  ACC Sims described the collision, which unfolded as the parade was winding down, as a \"terrible tragedy\" - with detectives declaring a major incident. She added it is \"vital people do not speculate or spread misinformation on social media\" - and urged the public to refrain from sharing distressing content. David Kitchin from the North West Ambulance Service said paramedics already had a \"substantial presence\" close to the parade route, meaning they were able to respond quickly. The 27 who needed hospital treatment - four of them children - were taken to four nearby hospitals: Royal Liverpool, Alder Hey, Arrowe Park and Aintree. Liverpool parade collision: What we know so far Sir Keir Starmer described the scenes as \"appalling\" - and praised \"the remarkable bravery shown by the police and other emergency services\". The prime minister said: \"Everyone, especially children, should be able to celebrate their heroes without this horror. \"The city has a long and proud history of coming together through difficult times. \"Liverpool stands together and the whole country stands with Liverpool.\"  Eyewitness Natasha Rinaldi said she was watching the parade from her friend's living room window when \"we heard some screams\". She added: \"People started rushing to go after the driver and they tried to break the car. The police did everything to block and to push people away.\" Harry Rashid - who was attending with his wife and two young daughters - said the people carrier was \"extremely fast\". The 48-year-old heard people being knocked off the bonnet of a car. He said the car stalled for 10 seconds before \"he put his foot down again and just ploughed through the rest of them\". \"It was horrible. My daughter started screaming and there were people on the ground,\" Mr Rashid said."
    },
    {
        "title": "Liverpool parade collision: Footage shows people carrier drive into crowds at speed",
        "description": "Footage shows a car driving into crowds at Liverpool FC's trophy parade. ",
        "url": "https://news.sky.com/story/liverpool-parade-collision-footage-shows-people-carrier-drive-into-crowds-at-speed-13375166",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-liverpool-parade_6928243.jpg?20250526210854",
        "type": "Home",
        "Author": "Connor Sephton",
        "Date Published": "2025-05-26 20:05:00",
        "Headline": "Fans in the streets race to move out of the vehicle's path - with some attempting to drag their loved ones out of danger.",
        "Content": "\n          News reporter\n              @ConnorSephton\n  Footage shows a car driving into crowds at Liverpool FC's trophy parade.  Warning: Contains details some readers may find distressing In the video, filmed from a window overlooking the business district, a people carrier can be seen travelling at speed. Fans in the street quickly move out of the vehicle's path - with some attempting to drag their loved ones out of danger. Latest updates: 53-year-old British suspect arrested  A man trying to get to safety is hit with force, colliding with the windscreen before falling to the ground. The car then suddenly veers to the right, where dozens are lining up against buildings and trying to protect themselves. Over five seconds, the driver gathered speed again - crashing into several people. The vehicle then turns towards the centre of the road and gradually comes to a stop. What we know so far about the collision Moments later, the car is surrounded by eyewitnesses trying to help the injured. Others are attempting to open the driver door and smash through the passenger windows. Police officers in hi-vis jackets sprint down the road to help. The footage corroborates accounts from people attending the parade. Eyewitness: 'It was extremely fast'  Natasha Rinaldi, who was watching the parade from her friend's living room window, said: \"People started rushing to go after the driver and they tried to break the car. The police did everything to block and to push people away. \"We could just hear screams. We were very confused. Some of my friends were down there and the car was so near them. It was a horrible scene, nobody was expecting it.\" Harry Rashid, a 48-year-old from Solihull attending the parade with his family, said the people carrier was travelling \"extremely fast\". Chelsea Yuen told Sky News said the car had driven straight towards her - with her friend Francesca jumping out of the way, dragging her little daughter to safety. A different video, filmed from the ground, shows several men striking the people carrier, moments before it drives into the crowd at speed. Merseyside Police have arrested a 53-year-old white British man following the incident on Water Street, just after 6pm on Bank Holiday Monday. It is not yet known how many people are injured, or if anyone has been killed."
    },
    {
        "title": "Liverpool parade collision: What we know so far",
        "description": "Police are not treating an incident in which a car ploughed through crowds of people near Liverpool FC's trophy parade as terrorism, a senior officer has said.",
        "url": "https://news.sky.com/story/liverpool-collision-what-we-know-so-far-13375146",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-liverpool-parade_6928217.jpg?20250526203747",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-26 19:17:00",
        "Headline": "A man has been arrested after a car ploughed into pedestrians in Liverpool city centre, as the football club celebrated their Premier League title victory nearby. ",
        "Content": " Police are not treating an incident in which a car ploughed through crowds of people near Liverpool FC's trophy parade as terrorism, a senior officer has said. Thousands of fans were lining the streets to celebrate the club winning the Premier League title at the time. At least 27 people, including four children, were taken to hospital on Monday evening but no deaths have been reported so far. Follow live: Man arrested after pedestrians hit during Liverpool parade Following a press conference by the emergency services on Monday night, here's what we know so far. What happened? The incident occurred on Water Street in the city centre - near Liverpool Town Hall and the Liver Building - when a car drove through a crowd of pedestrians. Witnesses described a people carrier driving into a crowd who had been out celebrating in their tens of thousands on Monday. A 53-year-old white British man, who is believed to be the driver, was arrested at the scene. Footage filmed from a nearby building showed the incident unfold. What are the emergency services saying? At a press conference, deputy chief constable of Merseyside Police, Jenny Sims, said the force received reports at 6pm that a car had hit a number of pedestrians. \"A number of people have been injured and were taken to hospital. In addition, a large number of people of all ages were treated at the scene that did not require hospital treatment.\" Ms Sims described the collision, which unfolded as the parade was winding down, as a \"terrible tragedy\" - with detectives immediately declaring a major incident. DCC Simms said police believe it was an isolated incident and is not being treated as terror-related, without providing any detail about why it may have happened. Giving updates on the injured, Dave Kitchin, head of service at the North West Ambulance Service NHS Trust, said 27 people were taken to hospital by ambulance. Two of those, including one child, sustained serious injuries, he said. Mr Kitchin added that 20 patients were treated at the scene for minor injuries and did not need hospital treatment. What has the response been so far? Prime Minister Keir Starmer said he was being updated on the situation and thanked police for their swift action. \"The scenes in Liverpool are appalling - my thoughts are with all those injured or affected,\" he said. Liverpool Football Club said it was in contact with the force and would \"continue to offer our full support to the emergency services and local authorities who are dealing with this incident\". Liverpool's city rivals Everton FC said in a statement on social media: \"Our thoughts are with all those who have been affected by this serious incident in our city.\" Home Secretary Yvette Cooper thanked police and called the incident \"truly shocking and horrendous\". \"Thinking of all those affected at this very difficult time. The police are investigating and I'm being kept updated on developments.\""
    },
    {
        "title": "Video shows Emmanuel Macron being pushed in face by wife",
        "description": "A video showing Emmanuel Macron being pushed in the face by his wife has been played down by the French president's office.",
        "url": "https://news.sky.com/story/emmanuel-macron-pushed-in-face-by-wife-as-his-office-plays-down-video-of-squabble-13374861",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-emmanuel-macron-brigitte-macron_6927889.jpg?20250526153809",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-26 09:26:00",
        "Headline": "The French president's office sought to downplay the incident, which happened as he prepared to disembark from his plane after touching down in Vietnam.",
        "Content": " A video showing Emmanuel Macron being pushed in the face by his wife has been played down by the French president's office. Brigitte Macron placed her hands on her husband's face as they prepared to exit their plane after touching down in Vietnam at the start of a southeast Asia tour. President Macron is seen taking a step back before he recovers and waves to the cameras at the bottom of the aircraft stairs. The pair then walk down the steps together. The Elysee initially denied the authenticity of images of the interaction before eventually verifying they were real, French media reported. Read more from Sky News:'Momentous occasion' as King heads for CanadaTrump puts potential US-EU trade war on ice The clip has sparked suggestions of an argument between the pair but Mr Macron said afterwards it was a case of \"simply joking with my wife as we often do\". Speaking to French media after landing in Hanoi he rubbished claims of a \"domestic incident\", instead telling broadcasters \"it was nothing\" and that people on social media were making \"nonsense\" out of the video. Appearing frustrated, he claimed it is the third time in three weeks that he has had to clarify the true nature of video clips he has appeared in - after conspiracy theorists claimed it looked like he took cocaine with Prime Minister Sir Keir Starmer and German Chancellor Friedrich Merz, and that he had a heated exchange with Turkish President Recep Erdogan. \"I haven't got lots of time to spare,\" he said. \"And yet, I'm spending a lot of time explaining the interpretation of these types of videos. \"It's been three weeks, from Kyiv, to Tirana, and now Hanoi, there are people who have watched videos and believe that I've shared a packet of cocaine, had a head-to-head with the Turkish president, and now that I'm having a domestic with my wife. \"None of these things are true - however the videos are real.\" He finished by insisting everyone needed to \"calm down\" and \"interest themselves in current affairs\" instead. Europe correspondent Whatever happened in the moments before Emmanuel Macron left his plane, the French president reacted like a politician, momentarily startled before turning to face the world with a smile and a wave. What he couldn't stop was the viral reaction to the images of his wife, Brigitte, laying hands on his face. In reality, perhaps only the Macrons themselves know what really happened, but that hasn't stopped a vast number of people from speculating and spreading. And foremost among them has, of course, been the blend of political opponents and pro-Russian social media accounts that thrive on trying to discredit Mr Macron. Over the past year, they have variously claimed Mrs Macron was born a man, the president (along with other EU leaders) is \"drug-dependent\", and Mr Macron has a secret handshake he uses with, among others, Turkish President Recep Tayyip Erdogan. All nonsense, of course, but stirred up to try to diminish the EU's most prominent centrist politician. Mr Macron's team first claimed it was all \"fake news\", but then they pivoted - wisely - into admitting something had happened, but playing down the value of that \"something\". A tiff - a bit of light-hearted bickering. Something pretty much every couple in the world does regularly and certainly something the president seemed genuinely to laugh off. Is there more to come from this? It's possible someone else who was on that plane will spill the beans about what led to the incident. And if they do, expect it to be spun with ever greater ferocity. But perhaps the main thing it does is to add a fraction more pressure upon Mr Macron's shoulders.  French politics is fracturing, the political centre is struggling and he is increasingly used as a hate figure by European populists. Just like that moment in Hanoi, Mr Macron has to keep smiling - but it must be getting harder. A source close to the president previously told the Le Figaro newspaper the pair had \"squabbled\" but it was a \"moment of closeness\". An Elysee official denied the video showed a row between the couple, who have been married since 2007. \"It was a moment when the president and his wife were relaxing one last time before the start of the trip by having a laugh,\" the official said."
    },
    {
        "title": "Cheese-loving daredevils hurl themselves down Cooper's Hill in Gloucestershire for famous race",
        "description": "Dairy-loving daredevils from around the world have descended on Gloucestershire and thrown themselves down Cooper's Hill in the annual cheese-rolling race.",
        "url": "https://news.sky.com/story/cheese-loving-daredevils-hurl-themselves-down-coopers-hill-in-gloucestershire-for-famous-race-13374975",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gloucestershire-brockworth_6927814.jpg?20250526134713",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-26 12:56:00",
        "Headline": "Competitors sprint, slide and tumble down the near-vertical incline to win an 8lb wheel of Double Gloucester during the notoriously dangerous race - made tougher this year with a harder racetrack due to the recent dry weather.",
        "Content": " Dairy-loving daredevils from around the world have descended on Gloucestershire and thrown themselves down Cooper's Hill in the annual cheese-rolling race. Competitors ran, slid and tumbled down the near-vertical incline in an effort to try and win an 8lb wheel of Double Gloucester - a semi-hard cheese renowned for its strong and savoury flavour. They were cheered on by thousands of spectators during the notoriously dangerous race - made tougher this year with a harder racetrack due to the recent dry weather. People have been staging their own unofficial event after health and safety fears caused the official competition to be cancelled in 2010. Since then, it has been held unofficially with the police keeping a watchful eye on the event. Several races took place this year, with German YouTuber Tom Kopke winning the first men's downhill race. \"It was crazy. This year was different,\" said the 23-year-old from Munich after retaining the title he won last year. \"Last year the hill was muddy and this year it was dry and dangerous and people got injured. \"I shut off my brain and went for it. \"All the people at the top said they were going to steal my title but this is mine. \"I worked for this. I risked my life for this. It's my cheese. Back to back.\" Read more from Sky News:Man, 60, dies trying to help children at beachLineker bows out from Match Of The Day The cheese is chased 200 yards down the 1:2 gradient hill in Brockworth. Competitors travelled from across the world to take part in the series of madcap races. The women's race was won by Ava Sender Logan, 20, who was racing for the Refugee Community Kitchen, which supports displaced people in northern France and homeless people in London and Edinburgh. The second men's race was won by Luke Preece, from Gloucester, who flew down the hill race dressed in a Superman costume - and the final men's downhill race was won by Byron Smith, 33, from New Zealand. The unusual event is a centuries-old tradition and is thought to have its roots in a heathen festival to celebrate the return of spring."
    },
    {
        "title": "Display of saint's remains draws huge crowds - but bishop says it 'encourages morbid curiosity'",
        "description": "Tens of thousands of people have flocked to see the remains of a revered Spanish saint, more than 440 years after her death, prompting debate over whether such displays \"encourage morbid curiosity\".",
        "url": "https://news.sky.com/story/display-of-saints-remains-draws-huge-crowds-but-bishop-says-it-encourages-morbid-curiosity-13374993",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-spain-sant-saint_6927879.jpg?20250526145143",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-26 13:27:00",
        "Headline": "Catholic worshippers travelled to Alba de Tormes to view relics of Saint Teresa of Avila, a 16th century religious reformer. ",
        "Content": "Tens of thousands of people have flocked to see the remains of a revered Spanish saint, more than 440 years after her death, prompting debate over whether such displays \"encourage morbid curiosity\". Catholic worshippers in their droves have travelled to Alba de Tormes in western Spain to view relics of Saint Teresa of Avila, a 16th-century religious reformer. Faithful lined up to see her, silent and wonderstruck as the remains of the mystic were put on display in a silver casket for the first time in more than 100 years. \"It gave me a feeling of fulfilment, of joy, and of sadness,\" said Guiomar Sanchez, who travelled from Madrid with her two daughters on Sunday, the last full day of the exhibit. \"Seeing her was an inexplicable experience,\" she added, praising the saint as being ahead of her time. After weeks on display, the casket of Saint Teresa was resealed on Monday and carried through the streets with pilgrims following behind her. Saint Teresa, who died in 1582, is a towering figure from Spain's Golden Age and 16th-century counter-reformation. \n                  Johann Strauss' The Blue Danube to be broadcast into deep space\n                 \n                  Former Ukrainian politician living abroad shot dead on school run\n                 \n                  Death of man on Benidorm holiday 'being treated as possible murder', family say\n                 Her explorations of the inner life and meditations on her relationship with God were controversial, yet they have been held up over the centuries as a \"profound treatise on spirituality,\" said Jose Calvo, a professor of theology at the Pontifical University of Salamanca who specialises in Medieval history. Her admirers include Spanish dictator General Francisco Franco, who was rumoured to have kept a relic of the saint's hand next to his bed, and new Pope Leo XIV, who visited her birthplace last year. Read more from Sky News:Pope Leo's hug with brother shows how his life has changedPope Leo calls for end to polarising 'war of words' Some worshippers this month were visibly moved. On Sunday, a group of nuns from India wept as they looked upon the saint's remains behind a glass case. But the exhibition has also provoked debate over the appropriateness of displaying the remains of long-dead people in public. \"It is not a good idea to display the body of Saint Teresa in this way,\" said nearby Bishop of Salamanca, Jose Luis Retana. \"It only serves to encourage people's morbid curiosity.\" But local church officials and experts downplayed such reactions, saying the display was nothing out of the ordinary for how Catholics have revered their saints for centuries. \"It was just something people always did when they thought somebody might be a saint,\" said Cathleen Medwick, who wrote a book about Saint Teresa. \"And the fact that her body hadn't decayed very much was also considered a sign of her sanctity,\" she added."
    },
    {
        "title": "Liverpool parade incident: Two people - including child - seriously injured after car drove into crowd",
        "description": "Two people, one of them a child, have sustained serious injuries after a car ploughed into crowds at the Liverpool FC trophy parade.",
        "url": "https://news.sky.com/story/liverpool-parade-incident-two-people-including-child-seriously-injured-after-car-drives-into-crowd-13375148",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-liverpool-parade_6928256.jpg?20250526213252",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-26 19:18:00",
        "Headline": "A total of 27 people were taken to hospital by ambulance after Monday evening's incident in the city centre. Four were trapped under the vehicle.",
        "Content": " Two people, one of them a child, have sustained serious injuries after a car ploughed into crowds at the Liverpool FC trophy parade. A total of 27 people were taken to hospital by ambulance after Monday evening's incident on Water Street in the city centre. Four of them were trapped under the vehicle, with fire crews moving \"rapidly\" to free them so they could be treated. Follow the latest developments in our live blog  Twenty others were treated at the scene for minor injuries, and a cyclist paramedic was among those struck by the vehicle. At a news conference, Assistant Chief Constable Jenny Sims stressed that the incident is not being treated as terror-related. She said a 53-year-old white British man from the Liverpool area remains in custody, who is believed to be the person driving the vehicle. \"What I can tell you is that we believe this to be an isolated incident, and we are not currently looking for anyone else in connection to it,\" she added. Hundreds of thousands of people were lining the streets to celebrate Liverpool winning the Premier League. Footage shows car drive into crowd at speed  ACC Sims described the collision, which unfolded as the parade was winding down, as a \"terrible tragedy\" - with detectives declaring a major incident. She added it is \"vital people do not speculate or spread misinformation on social media\" - and urged the public to refrain from sharing distressing content. David Kitchin from the North West Ambulance Service said paramedics already had a \"substantial presence\" close to the parade route, meaning they were able to respond quickly. The 27 who needed hospital treatment - four of them children - were taken to four nearby hospitals: Royal Liverpool, Alder Hey, Arrowe Park and Aintree. Liverpool parade collision: What we know so far Sir Keir Starmer described the scenes as \"appalling\" - and praised \"the remarkable bravery shown by the police and other emergency services\". The prime minister said: \"Everyone, especially children, should be able to celebrate their heroes without this horror. \"The city has a long and proud history of coming together through difficult times. \"Liverpool stands together and the whole country stands with Liverpool.\"  Eyewitness Natasha Rinaldi said she was watching the parade from her friend's living room window when \"we heard some screams\". She added: \"People started rushing to go after the driver and they tried to break the car. The police did everything to block and to push people away.\" Harry Rashid - who was attending with his wife and two young daughters - said the people carrier was \"extremely fast\". The 48-year-old heard people being knocked off the bonnet of a car. He said the car stalled for 10 seconds before \"he put his foot down again and just ploughed through the rest of them\". \"It was horrible. My daughter started screaming and there were people on the ground,\" Mr Rashid said."
    },
    {
        "title": "Liverpool parade collision: Footage shows people carrier drive into crowds at speed",
        "description": "Footage shows a car driving into crowds at Liverpool FC's trophy parade. ",
        "url": "https://news.sky.com/story/liverpool-parade-collision-footage-shows-people-carrier-drive-into-crowds-at-speed-13375166",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-liverpool-parade_6928243.jpg?20250526210854",
        "type": "UK",
        "Author": "Connor Sephton",
        "Date Published": "2025-05-26 20:05:00",
        "Headline": "Fans in the streets race to move out of the vehicle's path - with some attempting to drag their loved ones out of danger.",
        "Content": "\n          News reporter\n              @ConnorSephton\n  Footage shows a car driving into crowds at Liverpool FC's trophy parade.  Warning: Contains details some readers may find distressing In the video, filmed from a window overlooking the business district, a people carrier can be seen travelling at speed. Fans in the street quickly move out of the vehicle's path - with some attempting to drag their loved ones out of danger. Latest updates: 53-year-old British suspect arrested  A man trying to get to safety is hit with force, colliding with the windscreen before falling to the ground. The car then suddenly veers to the right, where dozens are lining up against buildings and trying to protect themselves. Over five seconds, the driver gathered speed again - crashing into several people. The vehicle then turns towards the centre of the road and gradually comes to a stop. What we know so far about the collision Moments later, the car is surrounded by eyewitnesses trying to help the injured. Others are attempting to open the driver door and smash through the passenger windows. Police officers in hi-vis jackets sprint down the road to help. The footage corroborates accounts from people attending the parade. Eyewitness: 'It was extremely fast'  Natasha Rinaldi, who was watching the parade from her friend's living room window, said: \"People started rushing to go after the driver and they tried to break the car. The police did everything to block and to push people away. \"We could just hear screams. We were very confused. Some of my friends were down there and the car was so near them. It was a horrible scene, nobody was expecting it.\" Harry Rashid, a 48-year-old from Solihull attending the parade with his family, said the people carrier was travelling \"extremely fast\". Chelsea Yuen told Sky News said the car had driven straight towards her - with her friend Francesca jumping out of the way, dragging her little daughter to safety. A different video, filmed from the ground, shows several men striking the people carrier, moments before it drives into the crowd at speed. Merseyside Police have arrested a 53-year-old white British man following the incident on Water Street, just after 6pm on Bank Holiday Monday. It is not yet known how many people are injured, or if anyone has been killed."
    },
    {
        "title": "Liverpool parade collision: What we know so far",
        "description": "Police are not treating an incident in which a car ploughed through crowds of people near Liverpool FC's trophy parade as terrorism, a senior officer has said.",
        "url": "https://news.sky.com/story/liverpool-collision-what-we-know-so-far-13375146",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-liverpool-parade_6928217.jpg?20250526203747",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-26 19:17:00",
        "Headline": "A man has been arrested after a car ploughed into pedestrians in Liverpool city centre, as the football club celebrated their Premier League title victory nearby. ",
        "Content": " Police are not treating an incident in which a car ploughed through crowds of people near Liverpool FC's trophy parade as terrorism, a senior officer has said. Thousands of fans were lining the streets to celebrate the club winning the Premier League title at the time. At least 27 people, including four children, were taken to hospital on Monday evening but no deaths have been reported so far. Follow live: Man arrested after pedestrians hit during Liverpool parade Following a press conference by the emergency services on Monday night, here's what we know so far. What happened? The incident occurred on Water Street in the city centre - near Liverpool Town Hall and the Liver Building - when a car drove through a crowd of pedestrians. Witnesses described a people carrier driving into a crowd who had been out celebrating in their tens of thousands on Monday. A 53-year-old white British man, who is believed to be the driver, was arrested at the scene. Footage filmed from a nearby building showed the incident unfold. What are the emergency services saying? At a press conference, deputy chief constable of Merseyside Police, Jenny Sims, said the force received reports at 6pm that a car had hit a number of pedestrians. \"A number of people have been injured and were taken to hospital. In addition, a large number of people of all ages were treated at the scene that did not require hospital treatment.\" Ms Sims described the collision, which unfolded as the parade was winding down, as a \"terrible tragedy\" - with detectives immediately declaring a major incident. DCC Simms said police believe it was an isolated incident and is not being treated as terror-related, without providing any detail about why it may have happened. Giving updates on the injured, Dave Kitchin, head of service at the North West Ambulance Service NHS Trust, said 27 people were taken to hospital by ambulance. Two of those, including one child, sustained serious injuries, he said. Mr Kitchin added that 20 patients were treated at the scene for minor injuries and did not need hospital treatment. What has the response been so far? Prime Minister Keir Starmer said he was being updated on the situation and thanked police for their swift action. \"The scenes in Liverpool are appalling - my thoughts are with all those injured or affected,\" he said. Liverpool Football Club said it was in contact with the force and would \"continue to offer our full support to the emergency services and local authorities who are dealing with this incident\". Liverpool's city rivals Everton FC said in a statement on social media: \"Our thoughts are with all those who have been affected by this serious incident in our city.\" Home Secretary Yvette Cooper thanked police and called the incident \"truly shocking and horrendous\". \"Thinking of all those affected at this very difficult time. The police are investigating and I'm being kept updated on developments.\""
    },
    {
        "title": "Nurse, 29, struck off after filming men and child in Asda toilets",
        "description": "A nurse has been struck off after filming men and a child in Asda toilets.",
        "url": "https://news.sky.com/story/nurse-29-struck-off-after-filming-men-and-child-in-asda-toilets-13375079",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-asda-swindon_6928034.jpg?20250526175716",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-26 16:38:00",
        "Headline": "Pheddie Delos Reyes was convicted of two counts of voyeurism and one count of making an indecent image of a child.",
        "Content": "A nurse has been struck off after filming men and a child in Asda toilets. Pheddie Delos Reyes, 29, was convicted of two counts of voyeurism and one count of making an indecent image of a child after filming people while urinating in the men's toilets at Asda in Swindon in July 2023, according to a Nursing and Midwifery Council (NMC) tribunal panel judgment. Delos Reyes, who had been a registered nurse since 2019, was given a suspended sentence at Swindon Magistrates' Court last June. Wiltshire Police were called to Asda by a customer, who said he had been filmed. Officers arrested Delos Reyes and informed the Great Western Hospitals NHS Foundation Trust, where he was working at the time. CCTV footage from the supermarket revealed that Delos Reyes had been in the toilets for nearly three hours after arriving at 6pm, with about fifty men and children entering the toilets during this time. The urinals in the facility were out of order, and only one cubicle was available, as Delos Reyes occupied the other one. Officers found several videos of men and of one child urinating in the toilet on devices seized from Delos Reyes, filmed through a hole between the cubicles. Read more from Sky News:King arrives in Canada for first head of state visitVideo shows Emmanuel Macron being pushed in face by wife The NMC panel, which handed Delos Reyes an interim suspension order for 18 months to cover a potential appeal period, said his fitness to practice as a nurse was impaired as his convictions \"demonstrate a significant attitudinal concern\". While Delos Reyes had indicated \"some remorse\", the panel found he had a \"limited understanding\" of the impact of his offending and his conduct \"was a significant departure from the standards expected of a registered nurse\"."
    },
    {
        "title": "Cheese-loving daredevils hurl themselves down Cooper's Hill in Gloucestershire for famous race",
        "description": "Dairy-loving daredevils from around the world have descended on Gloucestershire and thrown themselves down Cooper's Hill in the annual cheese-rolling race.",
        "url": "https://news.sky.com/story/cheese-loving-daredevils-hurl-themselves-down-coopers-hill-in-gloucestershire-for-famous-race-13374975",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gloucestershire-brockworth_6927814.jpg?20250526134713",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-26 12:56:00",
        "Headline": "Competitors sprint, slide and tumble down the near-vertical incline to win an 8lb wheel of Double Gloucester during the notoriously dangerous race - made tougher this year with a harder racetrack due to the recent dry weather.",
        "Content": " Dairy-loving daredevils from around the world have descended on Gloucestershire and thrown themselves down Cooper's Hill in the annual cheese-rolling race. Competitors ran, slid and tumbled down the near-vertical incline in an effort to try and win an 8lb wheel of Double Gloucester - a semi-hard cheese renowned for its strong and savoury flavour. They were cheered on by thousands of spectators during the notoriously dangerous race - made tougher this year with a harder racetrack due to the recent dry weather. People have been staging their own unofficial event after health and safety fears caused the official competition to be cancelled in 2010. Since then, it has been held unofficially with the police keeping a watchful eye on the event. Several races took place this year, with German YouTuber Tom Kopke winning the first men's downhill race. \"It was crazy. This year was different,\" said the 23-year-old from Munich after retaining the title he won last year. \"Last year the hill was muddy and this year it was dry and dangerous and people got injured. \"I shut off my brain and went for it. \"All the people at the top said they were going to steal my title but this is mine. \"I worked for this. I risked my life for this. It's my cheese. Back to back.\" Read more from Sky News:Man, 60, dies trying to help children at beachLineker bows out from Match Of The Day The cheese is chased 200 yards down the 1:2 gradient hill in Brockworth. Competitors travelled from across the world to take part in the series of madcap races. The women's race was won by Ava Sender Logan, 20, who was racing for the Refugee Community Kitchen, which supports displaced people in northern France and homeless people in London and Edinburgh. The second men's race was won by Luke Preece, from Gloucester, who flew down the hill race dressed in a Superman costume - and the final men's downhill race was won by Byron Smith, 33, from New Zealand. The unusual event is a centuries-old tradition and is thought to have its roots in a heathen festival to celebrate the return of spring."
    },
    {
        "title": "HS2: Investigation launched into two firms supplying construction workers",
        "description": "An investigation has been launched into \"whistleblower allegations\" about the practices of some \"labour suppliers\" to the company building the embattled HS2 rail line.",
        "url": "https://news.sky.com/story/hs2-investigation-launched-into-two-firms-supplying-construction-workers-13374994",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-hs2-transport_6927868.jpg?20250526144244",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-26 13:24:00",
        "Headline": "HS2 says it \"treats all whistleblower allegations seriously\" and launched an investigation earlier this year, while the Department for Transport says it will ensure any claims of wrongdoing are \"thoroughly investigated\".",
        "Content": "An investigation has been launched into \"whistleblower allegations\" about the practices of some \"labour suppliers\" to the company building the embattled HS2 rail line. HS2 Ltd is investigating two companies that supply workers to build part of the London to Birmingham section of the line, which the i Paper, which first reported the story, says relates to the billing for the staff supplied. The company, which is owned by the government, says it \"treats all whistleblower allegations seriously\" and launched an investigation earlier this year, while the Department for Transport adds that it will ensure any claims of wrongdoing are \"thoroughly investigated\". Politics latest: More welfare headaches for Starmer The paper reports that the allegations relate to staff being misclassified, and therefore an inflated rate being charged to employ them. It is understood the two firms under investigation were providing workers to one of HS2's contractors on the West Midlands section of the line, Balfour Beatty Vinci (BBV), which is not accused of wrongdoing.  A spokesperson for HS2 Ltd says BBV has \"implemented additional monitoring and controls\". It is understood that one contractor remains suspended from new contracts while the probe continues. An HS2 spokesperson said: \"HS2 Ltd treats all whistleblower allegations seriously and we are aware of the claims made in relation to labour suppliers on part of the route. \"An investigation was launched earlier this year into a number of different allegations and our contractor Balfour Beatty VINCI has implemented additional monitoring and controls.\" A Department for Transport spokesperson added: \"The government and HS2 Ltd take all whistleblower allegations extremely seriously and have a zero-tolerance attitude towards fraud, bribery, and corruption. We will therefore ensure any claims of wrongdoing in HS2's supply chain are thoroughly investigated. \"We have taken action to grip the delivery of HS2, tasking CEO Mark Wild to fundamentally reset the project and change the company's culture and capability to deliver the line as cost effectively as possible.\" It is understood that there is currently no police or HMRC involvement. BBV has been approached for comment. What is HS2? The HS2 rail line was announced in 2009 to boost capacity and cut the journey time between London and the north of England. The initial plan was to build the first phase connecting London and Birmingham, followed by adding two branches to Manchester and Leeds - but the previous Conservative government decided to scrap the second phase due to spiralling costs and numerous setbacks, and the new Labour administration has said it will not reverse the decision. Read more:Sam Coates: PM declares war on £100m HS2 bat shedChanges to HS2 explainedGovernment doesn't know how much HS2 will cost Sir Keir Starmer's government has pledged to \"get a grip\" on the rising costs of the project that, according to a House of Commons research briefing, have been driven \"by high inflation, as well as scope changes, worse ground conditions than expected and optimism bias\". In 2012, it was estimated that HS2 Phase 1 would cost £20.5bn (in 2019 prices) to complete - but forecasts have since grown, with the most recent estimate in January 2024 estimating it would cost £49bn to £56.6bn (in 2019 prices)."
    },
    {
        "title": "Western allies lift range restrictions for weapons supplied to Ukraine",
        "description": "Western allies are lifting range restrictions for weapons supplied to Ukraine, Germany's chancellor has announced.",
        "url": "https://news.sky.com/story/western-allies-lift-range-restrictions-for-weapons-supplied-to-ukraine-13374996",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-friedrich-merz-wdr-forum_6927903.jpg?20250526153955",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-26 13:29:00",
        "Headline": "Previously, long-range missiles supplied to Ukraine were only allowed to be used against Russian military targets in occupied Ukrainian territory.",
        "Content": "Western allies are lifting range restrictions for weapons supplied to Ukraine, Germany's chancellor has announced. Previously, long-range missiles supplied to Ukraine by the US, the UK and France were only allowed to be used against Russian military targets in occupied Ukrainian territory. Friedrich Merz announced during a Europe forum organised by German broadcaster WDR: \"There are no longer any restrictions on the range of weapons delivered to Ukraine, neither by the UK, France, nor us. There are no restrictions by the US either.\" \"Ukraine can now also defend itself by attacking military positions in Russia,\" Mr Merz added on X. \"Until recently, it couldn't do that, and apart from very few exceptions, it hadn't done so either.\" Lifting the range restrictions will make \"the decisive difference in Ukraine's warfare\", according to Mr Merz. The previous chancellor, Olaf Scholz, was reluctant to send Germany's most advanced weapons, notably long-range Taurus cruise missiles, to Ukraine, but Mr Merz had indicated that he would be open to sending Taurus missiles to Ukraine before being elected. The chancellor also said earlier this month that Germany would stop publishing details of military aid to Ukraine to achieve \"strategic ambiguity\" and prevent Russia from gaining any strategic advantages. \"Under my leadership, the debate about arms deliveries, calibre, weapons systems and so on will be taken out of the public eye,\" Mr Merz told RTL/ntv broadcasters during a visit to Kyiv on 10 May. Germany's government only sporadically reported military aid supplied to Ukraine following Russia's full-scale invasion in February 2022, until pressure from politicians and media resulted in it publishing a list of systems and goods. Ukrainian President Volodymyr Zelenskyy is set to meet Mr Merz during a visit to Berlin on Wednesday, sources told Reuters. During Monday's forum, Mr Merz also addressed the war in Gaza, criticising Israel's new military offensive in the enclave. Read more:Trump criticises Putin after strikes across UkraineDozens killed in Israeli strikes on Gaza He said that \"what the Israeli army is now doing in Gaza - I don't understand, to say it openly\". \"Harming the civilian population to the extent that has increasingly been the case in recent days can no longer be justified by a fight against the terrorism of Hamas,\" Mr Merz added. The German chancellor said he planned to call Benjamin Netanyahu, Israel's prime minister, this week to tell him \"to not overdo it,\" though for \"historical reasons\", Germany would always be more guarded in its criticism than other European allies."
    },
    {
        "title": "Video shows Emmanuel Macron being pushed in face by wife",
        "description": "A video showing Emmanuel Macron being pushed in the face by his wife has been played down by the French president's office.",
        "url": "https://news.sky.com/story/emmanuel-macron-pushed-in-face-by-wife-as-his-office-plays-down-video-of-squabble-13374861",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-emmanuel-macron-brigitte-macron_6927889.jpg?20250526153809",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-26 09:26:00",
        "Headline": "The French president's office sought to downplay the incident, which happened as he prepared to disembark from his plane after touching down in Vietnam.",
        "Content": " A video showing Emmanuel Macron being pushed in the face by his wife has been played down by the French president's office. Brigitte Macron placed her hands on her husband's face as they prepared to exit their plane after touching down in Vietnam at the start of a southeast Asia tour. President Macron is seen taking a step back before he recovers and waves to the cameras at the bottom of the aircraft stairs. The pair then walk down the steps together. The Elysee initially denied the authenticity of images of the interaction before eventually verifying they were real, French media reported. Read more from Sky News:'Momentous occasion' as King heads for CanadaTrump puts potential US-EU trade war on ice The clip has sparked suggestions of an argument between the pair but Mr Macron said afterwards it was a case of \"simply joking with my wife as we often do\". Speaking to French media after landing in Hanoi he rubbished claims of a \"domestic incident\", instead telling broadcasters \"it was nothing\" and that people on social media were making \"nonsense\" out of the video. Appearing frustrated, he claimed it is the third time in three weeks that he has had to clarify the true nature of video clips he has appeared in - after conspiracy theorists claimed it looked like he took cocaine with Prime Minister Sir Keir Starmer and German Chancellor Friedrich Merz, and that he had a heated exchange with Turkish President Recep Erdogan. \"I haven't got lots of time to spare,\" he said. \"And yet, I'm spending a lot of time explaining the interpretation of these types of videos. \"It's been three weeks, from Kyiv, to Tirana, and now Hanoi, there are people who have watched videos and believe that I've shared a packet of cocaine, had a head-to-head with the Turkish president, and now that I'm having a domestic with my wife. \"None of these things are true - however the videos are real.\" He finished by insisting everyone needed to \"calm down\" and \"interest themselves in current affairs\" instead. Europe correspondent Whatever happened in the moments before Emmanuel Macron left his plane, the French president reacted like a politician, momentarily startled before turning to face the world with a smile and a wave. What he couldn't stop was the viral reaction to the images of his wife, Brigitte, laying hands on his face. In reality, perhaps only the Macrons themselves know what really happened, but that hasn't stopped a vast number of people from speculating and spreading. And foremost among them has, of course, been the blend of political opponents and pro-Russian social media accounts that thrive on trying to discredit Mr Macron. Over the past year, they have variously claimed Mrs Macron was born a man, the president (along with other EU leaders) is \"drug-dependent\", and Mr Macron has a secret handshake he uses with, among others, Turkish President Recep Tayyip Erdogan. All nonsense, of course, but stirred up to try to diminish the EU's most prominent centrist politician. Mr Macron's team first claimed it was all \"fake news\", but then they pivoted - wisely - into admitting something had happened, but playing down the value of that \"something\". A tiff - a bit of light-hearted bickering. Something pretty much every couple in the world does regularly and certainly something the president seemed genuinely to laugh off. Is there more to come from this? It's possible someone else who was on that plane will spill the beans about what led to the incident. And if they do, expect it to be spun with ever greater ferocity. But perhaps the main thing it does is to add a fraction more pressure upon Mr Macron's shoulders.  French politics is fracturing, the political centre is struggling and he is increasingly used as a hate figure by European populists. Just like that moment in Hanoi, Mr Macron has to keep smiling - but it must be getting harder. A source close to the president previously told the Le Figaro newspaper the pair had \"squabbled\" but it was a \"moment of closeness\". An Elysee official denied the video showed a row between the couple, who have been married since 2007. \"It was a moment when the president and his wife were relaxing one last time before the start of the trip by having a laugh,\" the official said."
    },
    {
        "title": "Egypt: Archaeologists discover three ancient tombs dating back more than 3,500 years",
        "description": "Archaeologists in Egypt have discovered three tombs dating back more than 3,500 years.",
        "url": "https://news.sky.com/story/egypt-archaeologists-discover-three-ancient-tombs-dating-back-more-than-3500-years-13375066",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-egypt-luxor_6927970.jpg?20250526165409",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-26 15:58:00",
        "Headline": "The new discoveries date back to the New Kingdom period (1550 BC), according to officials.",
        "Content": "Archaeologists in Egypt have discovered three tombs dating back more than 3,500 years. The tombs of prominent statesmen were discovered in the Dra Abu el-Naga necropolis in the southern Egyptian city of Luxor, according to officials. The new discoveries date back to the New Kingdom period (1550 BC), with the names and titles of the tombs' owners also found through inscriptions within. Mohamed Ismail Khaled, secretary-general of Egypt's Supreme Council of Antiquities, said a further study of other inscriptions was needed to gain a greater understanding of the tombs' owners. The tourism and antiquities ministry released pictures of items discovered in the tombs, including artefacts and statues. One of the tombs, which was mostly destroyed, belonged to Amum-em-Ipet, from the Ramesside period. The other tombs date back to the 18th Dynasty - one belonging to a man called Baki and another to an individual named S. \n                  EgyptAir plane crash which killed British man caused by oxygen fire, says coroner\n                 \n                  The competing plans for rebuilding Gaza after the war\n                 \n                  Tomb of Egyptian pharaoh found in 'remarkable discovery' - the first since Tutankhamun\n                 Baki worked as a supervisor of the grain silo, while S was a supervisor at the Temple of Amun, a write and the mayor of the northern oases. Read more from Sky News:Macron pushed in face by wife - as he downplays incidentSix people dead after California plane crash Sherif Fathir, Egypt's tourism and antiquities minister, described the discovery as a significant scientific and archaeological achievement. Archaeology is one of the areas expected to greatly boost cultural tourism in the country, according to Mr Fathir."
    },
    {
        "title": "Display of saint's remains draws huge crowds - but bishop says it 'encourages morbid curiosity'",
        "description": "Tens of thousands of people have flocked to see the remains of a revered Spanish saint, more than 440 years after her death, prompting debate over whether such displays \"encourage morbid curiosity\".",
        "url": "https://news.sky.com/story/display-of-saints-remains-draws-huge-crowds-but-bishop-says-it-encourages-morbid-curiosity-13374993",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-spain-sant-saint_6927879.jpg?20250526145143",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-26 13:27:00",
        "Headline": "Catholic worshippers travelled to Alba de Tormes to view relics of Saint Teresa of Avila, a 16th century religious reformer. ",
        "Content": "Tens of thousands of people have flocked to see the remains of a revered Spanish saint, more than 440 years after her death, prompting debate over whether such displays \"encourage morbid curiosity\". Catholic worshippers in their droves have travelled to Alba de Tormes in western Spain to view relics of Saint Teresa of Avila, a 16th-century religious reformer. Faithful lined up to see her, silent and wonderstruck as the remains of the mystic were put on display in a silver casket for the first time in more than 100 years. \"It gave me a feeling of fulfilment, of joy, and of sadness,\" said Guiomar Sanchez, who travelled from Madrid with her two daughters on Sunday, the last full day of the exhibit. \"Seeing her was an inexplicable experience,\" she added, praising the saint as being ahead of her time. After weeks on display, the casket of Saint Teresa was resealed on Monday and carried through the streets with pilgrims following behind her. Saint Teresa, who died in 1582, is a towering figure from Spain's Golden Age and 16th-century counter-reformation. \n                  Johann Strauss' The Blue Danube to be broadcast into deep space\n                 \n                  Former Ukrainian politician living abroad shot dead on school run\n                 \n                  Death of man on Benidorm holiday 'being treated as possible murder', family say\n                 Her explorations of the inner life and meditations on her relationship with God were controversial, yet they have been held up over the centuries as a \"profound treatise on spirituality,\" said Jose Calvo, a professor of theology at the Pontifical University of Salamanca who specialises in Medieval history. Her admirers include Spanish dictator General Francisco Franco, who was rumoured to have kept a relic of the saint's hand next to his bed, and new Pope Leo XIV, who visited her birthplace last year. Read more from Sky News:Pope Leo's hug with brother shows how his life has changedPope Leo calls for end to polarising 'war of words' Some worshippers this month were visibly moved. On Sunday, a group of nuns from India wept as they looked upon the saint's remains behind a glass case. But the exhibition has also provoked debate over the appropriateness of displaying the remains of long-dead people in public. \"It is not a good idea to display the body of Saint Teresa in this way,\" said nearby Bishop of Salamanca, Jose Luis Retana. \"It only serves to encourage people's morbid curiosity.\" But local church officials and experts downplayed such reactions, saying the display was nothing out of the ordinary for how Catholics have revered their saints for centuries. \"It was just something people always did when they thought somebody might be a saint,\" said Cathleen Medwick, who wrote a book about Saint Teresa. \"And the fact that her body hadn't decayed very much was also considered a sign of her sanctity,\" she added."
    },
    {
        "title": "King to visit Canada for first time as head of state in 'impactful' trip",
        "description": "The King is preparing for a two-day visit to Canada - his first as the country's head of state.",
        "url": "https://news.sky.com/story/king-to-visit-canada-for-first-time-as-head-of-state-in-impactful-trip-13374777",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-king-queen-canada-house_6927504.jpg?20250526163642",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-26 02:24:00",
        "Headline": "The centrepiece will come on Tuesday, when the British monarch attends the state opening of parliament and delivers the words of the Canadian government.",
        "Content": " The King is preparing for a two-day visit to Canada - his first as the country's head of state. The centrepiece will be on Tuesday when he will become only the second monarch, after his mother Queen Elizabeth II, to attend the state opening of parliament where he will set out the government's legislative agenda in a speech. The 76-year-old will be accompanied by his wife the Queen during the short visit to the Commonwealth nation, which they hope will be \"impactful\", according to Buckingham Palace. On Monday, the King, who is still undergoing treatment for an undisclosed cancer, is due to meet newly-elected prime minister and ex-Bank of England governor Mark Carney. There will also be a short ceremony to swear in the Queen as a member of the Canadian Privy Council. Earlier this month, Mr Carney told Sky News presenter Samantha Washington that Canadians \"weren't impressed\" by the decision of the UK government to offer Donald Trump an unprecedented second state visit to the UK. Sir Keir Starmer handed the invitation to the US president during a visit to the Oval Office. Mr Carney said that the invitation \"cut across clear messages\" that the Canadian government was trying to send to the White House in response to their threats against Canada's sovereignty, including Mr Trump's idea for it to be America's 51st state. The Canadian prime minister invited the King to open the country's parliament in a \"clear message of sovereignty\" and said it was \"not coincidental\". \"All issues around Canada's sovereignty have been accentuated by the president. So no, it's not coincidental, but it is also a reaffirming moment for Canadians,\" Mr Carney said. Read more from Sky News:Beckham meets King and Queen at Chelsea Flower ShowKing 'flabbergasted' by magician's money trick  'A momentous occasion' The tour begins on Monday with the royal couple celebrating the country's cultural heritage and diversity at a Lansdowne Park community event in the capital Ottawa. The late queen was the first sovereign to deliver the speech at the state opening of the Canadian parliament in October 1957, her first visit to the country as head of state. Steven Guilbeault, Canada's minister of identity and culture, said: \"His Majesty's delivery of the Speech from the Throne to open the 45th Parliament is a momentous occasion, one that brings Canadians together in celebration of our rich history, our democracy, and the institutions that serve us all. \"This visit offers an opportunity to showcase the special relationship between Canada and the Crown, while also highlighting the strength, diversity, and unity that define us on the world stage.\""
    },
    {
        "title": "Repairs under way on North Korean warship that embarrassed Kim Jong Un",
        "description": "Repairs are under way on a new North Korean warship which failed to launch last week, state media has said.",
        "url": "https://news.sky.com/story/repairs-under-way-on-north-korean-warship-that-embarrassed-kim-jong-un-13374827",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-chongjin-north-korea_6927580.jpg?20250526085905",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-26 08:05:00",
        "Headline": "Catastrophe struck when the destroyer sustained damage during what was supposed to be a proud display of the country's naval power.",
        "Content": "Repairs are under way on a new North Korean warship which failed to launch last week, state media has said. The 5,000-tonne vessel ended up on its side and taking on water with leader Kim Jong Un looking on in dismay. \"The work for completely restoring the balance of the warship is being actively conducted... according to its schedule,\" KCNA said on Monday. The destroyer was launched on Wednesday at the northeastern port of Chongjin - but a loss of balance saw the vessel sustain damage.  The North Korean leader called the failed launch a \"criminal act\" and said the incident \"brought the dignity and self-respect of our state to a collapse\" as he vowed to punish those found responsible. An investigation has been launched and authorities have arrested the chief engineer of the shipyard, the head of the hull construction workshop and the deputy manager for administrative affairs. \n                  North Korean officials arrested after warship blunder 'brought dignity of country to collapse'\n                 \n                  'Careless' warship accident 'brought dignity of North Korea to a collapse', Kim says\n                 \n                  South Korean military fire at North Korean soldiers 'crossing demarcation line'\n                 Read more from Sky News:Trump: Putin has gone absolutely crazyDozens killed in Israeli strikes on Gaza An internal inspection found there were no holes at the bottom of the warship, but the starboard hull was scratched and seawater flowed into the stern section through the rescue channel. The extent of the damage was claimed to be \"not serious\". Satellite imagery of the shipyard showed the warship on its side and covered in what appears to be blue tarpaulin. Mr Kim has ordered the ship to be restored before a ruling party meeting in June."
    },
    {
        "title": "UK to open talks with Kosovo about hosting 'return hub' for failed asylum seekers - report",
        "description": "Kosovo will be one of the countries asked to take failed asylum seekers from the UK as part of the government's plan for \"return hubs\" abroad, according to reports.",
        "url": "https://news.sky.com/story/uk-to-open-talks-with-kosovo-about-hosting-return-hub-for-failed-asylum-seekers-report-13374897",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-osmani_6918429.jpg?20250516152338",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-26 10:07:00",
        "Headline": "The president of Kosovo has previously told Sky News the country would be \"open to discussing it\", but there have been \"no formal talks\" so far.",
        "Content": "Kosovo will be one of the countries asked to take failed asylum seekers from the UK as part of the government's plan for \"return hubs\" abroad, according to reports. The Western Balkan country is on a list of nine countries drawn up by the government of potential places to deport illegal migrants who have exhausted all avenues of appeal for asylum in the UK, according to The Times newspaper. The report comes after the president of Kosovo revealed to Sky News that they would be \"open to discussing it\", but there had been \"no formal talks\" so far. The Tories say that return hubs will \"not work as a deterrent\", and the \"vast majority who illegally cross the [English] Channel have their asylum claims accepted, so would never be removed under the return hubs plan\".  Politics latest: More welfare headaches for Starmer Sir Keir Starmer revealed last Thursday at a news conference with the Albanian Prime Minister Edi Rama that the UK \"is in talks with a number of countries about return hubs\". \n                  UK has not asked about asylum return hubs, other Balkan countries say\n                 \n                  Eight people arrested and weapons seized after Kosovo canal explosion \n                 \n                  Catherine 'Kasha' Rigby: Renowned US skier dies in Kosovo avalanche\n                 They would be for processing failed asylum seekers prior to their eventual deportation, wherever that might be.  Downing Street said they would be for people \"who have exhausted all legal routes to remain in the UK\", but who may be employing tactics to delay their removal - like \"losing their paperwork\". The hubs would effectively buy time to return or deport illegal migrants without the government having to house them in Britain in the meantime, such as in the asylum hotels, which the government has promised to close. The prime minister described the hubs as a \"really important innovation\" that complements other measures the government is taking to crack down on criminal smuggling gangs and stop small boat crossings. He refused to reveal which countries the government is in talks with, but he was left slightly red-faced after the Albanian prime minister publicly slapped down the idea of a UK return hub in his country, saying their agreement with Italy was a \"one-off\" deal for a key ally.  But speaking exclusively to Sky's Tamara Cohen, the president of Kosovo said her government is open to the idea. Vjosa Osmani said: \"There's been no formal talks with the UK on this issue. It hasn't been raised so far. \"We would be open to discussing it, however I can't say more than that because I don't know the details. I cannot give an answer on a request that hasn't been made so far.\" Ms Osmani called the UK a \"steadfast ally\". UK-supplied technology is being used in Kosovo to stop illicit goods and vulnerable people from reaching British shores. Nearly 22,000 people used the Western Balkans to enter Europe last year, the Foreign Office said earlier this year. There are six countries in the Western Balkans which are seen as central to UK efforts to tackling illegal migration. Croatia, Bosnia and Herzegovina, and Montenegro are the others, alongside Albania, Kosovo and North Macedonia. The Times reports that countries outside Europe are on a shortlist to be approached for talks about return hubs. The plan is part of the broader government efforts to stop small boat crossings. Over 12,000 people have crossed the Channel illegally on small boats so far this year, with 2025 on course to a record year for crossings, which will cause a major headache for Labour after being elected on a manifesto promise to \"smash the gangs\". Chris Philp, shadow home secretary, said in response to the report: \"The prime minister's attempt to get Albania to act as a return hub was humiliatingly dismissed by the Albanian prime minister. \"Return hubs will anyway not work as a deterrent because only illegal immigrants whose asylum claims fail get removed. The vast majority who illegally cross the channel have their asylum claims accepted, so would never be removed under the return hubs plan.\""
    },
    {
        "title": "HS2: Investigation launched into two firms supplying construction workers",
        "description": "An investigation has been launched into \"whistleblower allegations\" about the practices of some \"labour suppliers\" to the company building the embattled HS2 rail line.",
        "url": "https://news.sky.com/story/hs2-investigation-launched-into-two-firms-supplying-construction-workers-13374994",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-hs2-transport_6927868.jpg?20250526144244",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-26 13:24:00",
        "Headline": "HS2 says it \"treats all whistleblower allegations seriously\" and launched an investigation earlier this year, while the Department for Transport says it will ensure any claims of wrongdoing are \"thoroughly investigated\".",
        "Content": "An investigation has been launched into \"whistleblower allegations\" about the practices of some \"labour suppliers\" to the company building the embattled HS2 rail line. HS2 Ltd is investigating two companies that supply workers to build part of the London to Birmingham section of the line, which the i Paper, which first reported the story, says relates to the billing for the staff supplied. The company, which is owned by the government, says it \"treats all whistleblower allegations seriously\" and launched an investigation earlier this year, while the Department for Transport adds that it will ensure any claims of wrongdoing are \"thoroughly investigated\". Politics latest: More welfare headaches for Starmer The paper reports that the allegations relate to staff being misclassified, and therefore an inflated rate being charged to employ them. It is understood the two firms under investigation were providing workers to one of HS2's contractors on the West Midlands section of the line, Balfour Beatty Vinci (BBV), which is not accused of wrongdoing.  A spokesperson for HS2 Ltd says BBV has \"implemented additional monitoring and controls\". It is understood that one contractor remains suspended from new contracts while the probe continues. An HS2 spokesperson said: \"HS2 Ltd treats all whistleblower allegations seriously and we are aware of the claims made in relation to labour suppliers on part of the route. \"An investigation was launched earlier this year into a number of different allegations and our contractor Balfour Beatty VINCI has implemented additional monitoring and controls.\" A Department for Transport spokesperson added: \"The government and HS2 Ltd take all whistleblower allegations extremely seriously and have a zero-tolerance attitude towards fraud, bribery, and corruption. We will therefore ensure any claims of wrongdoing in HS2's supply chain are thoroughly investigated. \"We have taken action to grip the delivery of HS2, tasking CEO Mark Wild to fundamentally reset the project and change the company's culture and capability to deliver the line as cost effectively as possible.\" It is understood that there is currently no police or HMRC involvement. BBV has been approached for comment. What is HS2? The HS2 rail line was announced in 2009 to boost capacity and cut the journey time between London and the north of England. The initial plan was to build the first phase connecting London and Birmingham, followed by adding two branches to Manchester and Leeds - but the previous Conservative government decided to scrap the second phase due to spiralling costs and numerous setbacks, and the new Labour administration has said it will not reverse the decision. Read more:Sam Coates: PM declares war on £100m HS2 bat shedChanges to HS2 explainedGovernment doesn't know how much HS2 will cost Sir Keir Starmer's government has pledged to \"get a grip\" on the rising costs of the project that, according to a House of Commons research briefing, have been driven \"by high inflation, as well as scope changes, worse ground conditions than expected and optimism bias\". In 2012, it was estimated that HS2 Phase 1 would cost £20.5bn (in 2019 prices) to complete - but forecasts have since grown, with the most recent estimate in January 2024 estimating it would cost £49bn to £56.6bn (in 2019 prices)."
    },
    {
        "title": "Gary Lineker bows out from Match Of The Day",
        "description": "Gary Lineker bid a tearful farewell to Match Of The Day as he presented the show for the final time.",
        "url": "https://news.sky.com/story/gary-lineker-bows-out-from-match-of-the-day-13374776",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gary-lineker-bbc_6921487.jpg?20250519141316",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-26 02:34:00",
        "Headline": "The footballer turned presenter signed off from the BBC's flagship highlights programme after 26 years in the role, departing the broadcaster after a social media post sparked an antisemitism row.",
        "Content": " Gary Lineker bid a tearful farewell to Match Of The Day as he presented the show for the final time. The ex-England striker, 64, announced his departure earlier this month after sharing a social media post from the Palestine Lobby group titled: \"Zionism explained in two minutes.\" The Instagram post was illustrated with a rat, which has been used to represent Jewish people in antisemitic propaganda - including Nazi Germany. Lineker \"apologised unreservedly\" for sharing it, saying he was unaware of the reference and it was a mistake. He maintained the importance of \"speaking out on humanitarian issues, including the tragedy unfolding in Gaza\".  Presenting his final Match Of The Day alongside regular colleagues Alan Shearer and Micah Richards, Lineker did not directly address the circumstances of his departure during the programme. \"It wasn't meant to end this way,\" he quipped in his opening line, continuing: \"But with the title race over and the relegation places confirmed, the Champions League was all we had left to talk about.\" Manchester City, Chelsea, and Newcastle secured the remaining places in Europe's elite competition. After running through highlights of all 10 games from the final day of the Premier League season, Lineker thanked his fellow pundits, viewers and those who work behind the scenes, before wishing good luck to his replacements. Gabby Logan, Mark Chapman and Kelly Cates will take on presenting duties for the 2025-26 campaign. Read more:BBC can breathe easier after Lineker leavesA history of Gary Lineker's most controversial posts  'It has been so special' Lineker wiped away tears at the end of the show, having been played a montage of messages including from Richards, Shearer, Ian Wright, Alan Hansen, Paul Gascoigne, Pep Guardiola, and Claudio Ranieri. Italian manager Ranieri led Lineker's beloved Leicester City to the Premier League title in 2016, which memorably saw the BBC's highest paid star present an episode of Match Of The Day in a pair of boxers. He had promised to appear on the show half naked if Leicester won the league. Lineker started presenting Match Of The Day back in 1999, and has also fronted the BBC's coverage of World Cups, Euros tournaments, and the Olympics. \"It has been so special,\" Lineker said as he signed off, \"and I am sorry that your team was always on last. \"Time to say goodbye. Goodbye.\""
    },
    {
        "title": "Urdd Eisteddfod: Why Strictly star Amy Dowden is supporting Welsh festival that is 'like Britain's Got Talent'",
        "description": "Thousands of people are expected to attend Port Talbot this weekend as the town gears up to welcome an annual Welsh festival.",
        "url": "https://news.sky.com/story/urdd-eisteddfod-why-strictly-star-amy-dowden-is-supporting-welsh-festival-that-is-like-britains-got-talent-13373437",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-wales-urdd-eisteddfod_6915200.jpg?20250513134838",
        "type": "Entertainment",
        "Author": "Tomos Evans",
        "Date Published": "2025-05-26 05:00:00",
        "Headline": "The first Urdd Eisteddfod was staged in 1929 in Corwen, Denbighshire, seven years after the youth organisation was established. Almost 100 years on, and a star of Strictly Come Dancing is among those involved in the latest edition.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n Thousands of people are expected to attend Port Talbot this weekend as the town gears up to welcome an annual Welsh festival. The Urdd Eisteddfod is a celebration of Welsh culture when children and young people up to the age of 25 take part in a variety of competitions. There are 400 of them in total, including singing, reciting poetry and dancing. The Urdd organisation itself was established more than a century ago in 1922, with the aim of giving children and young people in Wales the opportunity to learn and socialise in the Welsh language. Its six-day Eisteddfod is held during May half-term and in a different part of Wales each year. The Urdd Eisteddfod broke its own records last year, with more than 100,000 registrations to compete. Margam Park is home to this year's event - the first time since 2003 that it's played host. Among the main prizes up for grabs this year are the chair (awarded to the main poetry competition winner) and the crown (awarded to the main prose competition winner). This year's crown and chair have been made using some of the final pieces of steel produced at Port Talbot steelworks before the closure of the blast furnaces last year. There are some new additions to this year's Eisteddfod, including awards for singing, musical theatre and acting, named in honour of Sir Bryn Terfel, Callum Scott Howells and Matthew Rhys. Another new award - the Amy Dowden award for dance - will also be awarded for the first time this week. Speaking to Sky News, Strictly Come Dancing star Dowden said it was a \"real honour\" to be supporting the next generation of dancers. \"The arts and the industry is tough, and I just hope that [the young people] can see that I've managed to push myself through it,\" she said. \"I've worked hard, I've had a few challenges along the way. Hopefully I can help inspire them as well.\" 'It's like Britain's Got Talent' As a former competitor herself in what is one of Europe's largest touring youth festivals, Dowden says she \"couldn't imagine [her] childhood without it\". \"I've loved Eisteddfods since I can remember. Every year at school I took part in everything, from the baking to the reciting poems, to the folk dancing, to the creative dancing,\" she said. \"The Urdd Eisteddfod is literally like one big talent competition, it's like Britain's Got Talent.\" Read more:Prince William meets Urdd Eisteddfod winnerWales: The land of song - but for how much longer? The winner of the Amy Dowden award will get one-to-one sessions with her as part of the prize, as well as masterclasses at the Royal Welsh College of Music and Drama. They will have the opportunity to perform on an international stage and also win a cash prize. \"I know from my dance training and everything, each of those is so beneficial to getting yourself to that professional level,\" Dowden added."
    },
    {
        "title": "Cheese-loving daredevils hurl themselves down Cooper's Hill in Gloucestershire for famous race",
        "description": "Dairy-loving daredevils from around the world have descended on Gloucestershire and thrown themselves down Cooper's Hill in the annual cheese-rolling race.",
        "url": "https://news.sky.com/story/cheese-loving-daredevils-hurl-themselves-down-coopers-hill-in-gloucestershire-for-famous-race-13374975",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gloucestershire-brockworth_6927814.jpg?20250526134713",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-05-26 12:56:00",
        "Headline": "Competitors sprint, slide and tumble down the near-vertical incline to win an 8lb wheel of Double Gloucester during the notoriously dangerous race - made tougher this year with a harder racetrack due to the recent dry weather.",
        "Content": " Dairy-loving daredevils from around the world have descended on Gloucestershire and thrown themselves down Cooper's Hill in the annual cheese-rolling race. Competitors ran, slid and tumbled down the near-vertical incline in an effort to try and win an 8lb wheel of Double Gloucester - a semi-hard cheese renowned for its strong and savoury flavour. They were cheered on by thousands of spectators during the notoriously dangerous race - made tougher this year with a harder racetrack due to the recent dry weather. People have been staging their own unofficial event after health and safety fears caused the official competition to be cancelled in 2010. Since then, it has been held unofficially with the police keeping a watchful eye on the event. Several races took place this year, with German YouTuber Tom Kopke winning the first men's downhill race. \"It was crazy. This year was different,\" said the 23-year-old from Munich after retaining the title he won last year. \"Last year the hill was muddy and this year it was dry and dangerous and people got injured. \"I shut off my brain and went for it. \"All the people at the top said they were going to steal my title but this is mine. \"I worked for this. I risked my life for this. It's my cheese. Back to back.\" Read more from Sky News:Man, 60, dies trying to help children at beachLineker bows out from Match Of The Day The cheese is chased 200 yards down the 1:2 gradient hill in Brockworth. Competitors travelled from across the world to take part in the series of madcap races. The women's race was won by Ava Sender Logan, 20, who was racing for the Refugee Community Kitchen, which supports displaced people in northern France and homeless people in London and Edinburgh. The second men's race was won by Luke Preece, from Gloucester, who flew down the hill race dressed in a Superman costume - and the final men's downhill race was won by Byron Smith, 33, from New Zealand. The unusual event is a centuries-old tradition and is thought to have its roots in a heathen festival to celebrate the return of spring."
    },
    {
        "title": "Display of saint's remains draws huge crowds - but bishop says it 'encourages morbid curiosity'",
        "description": "Tens of thousands of people have flocked to see the remains of a revered Spanish saint, more than 440 years after her death, prompting debate over whether such displays \"encourage morbid curiosity\".",
        "url": "https://news.sky.com/story/display-of-saints-remains-draws-huge-crowds-but-bishop-says-it-encourages-morbid-curiosity-13374993",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-spain-sant-saint_6927879.jpg?20250526145143",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-05-26 13:27:00",
        "Headline": "Catholic worshippers travelled to Alba de Tormes to view relics of Saint Teresa of Avila, a 16th century religious reformer. ",
        "Content": "Tens of thousands of people have flocked to see the remains of a revered Spanish saint, more than 440 years after her death, prompting debate over whether such displays \"encourage morbid curiosity\". Catholic worshippers in their droves have travelled to Alba de Tormes in western Spain to view relics of Saint Teresa of Avila, a 16th-century religious reformer. Faithful lined up to see her, silent and wonderstruck as the remains of the mystic were put on display in a silver casket for the first time in more than 100 years. \"It gave me a feeling of fulfilment, of joy, and of sadness,\" said Guiomar Sanchez, who travelled from Madrid with her two daughters on Sunday, the last full day of the exhibit. \"Seeing her was an inexplicable experience,\" she added, praising the saint as being ahead of her time. After weeks on display, the casket of Saint Teresa was resealed on Monday and carried through the streets with pilgrims following behind her. Saint Teresa, who died in 1582, is a towering figure from Spain's Golden Age and 16th-century counter-reformation. \n                  Johann Strauss' The Blue Danube to be broadcast into deep space\n                 \n                  Former Ukrainian politician living abroad shot dead on school run\n                 \n                  Death of man on Benidorm holiday 'being treated as possible murder', family say\n                 Her explorations of the inner life and meditations on her relationship with God were controversial, yet they have been held up over the centuries as a \"profound treatise on spirituality,\" said Jose Calvo, a professor of theology at the Pontifical University of Salamanca who specialises in Medieval history. Her admirers include Spanish dictator General Francisco Franco, who was rumoured to have kept a relic of the saint's hand next to his bed, and new Pope Leo XIV, who visited her birthplace last year. Read more from Sky News:Pope Leo's hug with brother shows how his life has changedPope Leo calls for end to polarising 'war of words' Some worshippers this month were visibly moved. On Sunday, a group of nuns from India wept as they looked upon the saint's remains behind a glass case. But the exhibition has also provoked debate over the appropriateness of displaying the remains of long-dead people in public. \"It is not a good idea to display the body of Saint Teresa in this way,\" said nearby Bishop of Salamanca, Jose Luis Retana. \"It only serves to encourage people's morbid curiosity.\" But local church officials and experts downplayed such reactions, saying the display was nothing out of the ordinary for how Catholics have revered their saints for centuries. \"It was just something people always did when they thought somebody might be a saint,\" said Cathleen Medwick, who wrote a book about Saint Teresa. \"And the fact that her body hadn't decayed very much was also considered a sign of her sanctity,\" she added."
    }
]