[
    {
        "title": "MPs to debate emergency law to keep British Steel open as prime minister warns national security 'on the line'",
        "description": "MPs will today debate emergency laws to save British Steel after the prime minister warned the country's \"economic and national security is on the line\".",
        "url": "https://news.sky.com/story/mps-to-debate-emergency-law-to-keep-british-steel-open-as-prime-minister-warns-national-security-on-the-line-13346516",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-blast-furnace-conway_6875399.jpg?20250404000520",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-11 14:08:00",
        "Headline": "MPs and Lords will return to parliament for a rare Saturday sitting after the prime minister said the future of British Steel \"hangs in the balance\".",
        "Content": " MPs will today debate emergency laws to save British Steel after the prime minister warned the country's \"economic and national security is on the line\". Sir Keir Starmer said the future of the company's Scunthorpe plant - which employs about 3,500 people - \"hangs in the balance\" after its owner said the cost of running it was unsustainable. The prime minister said legislation would be passed in one day to allow the government to \"take control of the plant and preserve all viable options\". Follow latest: Live politics updates MPs and Lords are being summoned from their Easter recess to debate the move and will sit from 11am. The last time parliament was recalled was on 18 August 2021 to debate the situation in Afghanistan. The government has been considering nationalising British Steel after Jingye, the Chinese owner, cancelled future orders for iron ore, coal and other raw materials needed to keep the blast furnaces running. \n                  This is a remarkable step by the government - and Donald Trump, China and Reform UK have all played their part\n                 \n                  Defence secretary warns this is 'the critical year' for Ukraine - as £450m in funding allocated\n                 \n                  Michael Gove handed peerage - as Jeremy Hunt and cricketer James Anderson knighted\n                 The furnaces are the last in the UK capable of making virgin steel. Jingye last month rejected a £500m state rescue package - raising fresh doubts about the Lincolnshire plant and fears it could close in the coming days. The steel from the plant is used in the rail network and the construction and automotive industries. Without it, Britain would be reliant on imports at a time of trade wars and geopolitical instability.  In a statement on Friday, Sir Keir said: \"I will always act in the national interest to protect British jobs and British workers. \"This afternoon, the future of British Steel hangs in the balance. Jobs, investment, growth, our economic and national security are all on the line.\" The prime minister said steel was \"part of our national story, part of the pride and heritage of this nation\" and \"essential for our future\". He said the emergency law would give the business secretary powers to do \"everything possible to stop the closure of these blast furnaces\". This includes the power to direct the company's board and workforce. It will also ensure it can order the raw materials to keep the furnaces running and ensure staff are paid. Chancellor Rachel Reeves said the government was \"taking action to save British steel production and protect British jobs\", while Business Secretary Jonathan Reynolds said the owner had left the government with \"no choice\". Mr Reynolds said Jingye had confirmed plans to close the Scunthorpe furnaces immediately despite months of talks and the offer of £500m of co-investment. The company said it had invested £1.2bn since taking over in 2020, but that the plant is losing £700,000 a day. Read more:Govt intervention in British Steel 'a remarkable step' - analysis  Conservative leader Kemi Badenoch said the government had landed itself in a \"steel crisis entirely of their own making\". She said when she was business secretary, she had negotiated a plan with British Steel \"to limit job losses and keep the plant running\". Ms Badenoch said the government had \"bungled the negotiations, insisting on a Scunthorpe-only deal that the company has deemed unviable\". She added: \"Keir Starmer should have seen this coming. But instead of addressing it earlier in the week when parliament was sitting, their incompetence has led to a last-minute recall of parliament.\" The Unite union said the prime minister's recalling of parliament was \"absolutely the right thing to do to begin the process of nationalisation\". While the government hasn't confirmed those plans, the chancellor also said earlier this week that \"all options\" are on the table. Sky News understands accountancy firm EY is being lined up to play a role in a nationalisation process. The government's intervention over British Steel comes six months after the last blast furnace was closed at Port Talbot in Wales. Plaid Cymru has questioned why the government didn't take similar action there. The party's Westminster leader, Liz Saville Roberts, said: \"Parliament is being recalled to debate the nationalisation of Scunthorpe steelworks. \"But when global market forces devastated Welsh livelihoods in Port Talbot, Labour dismissed Plaid Cymru's calls for nationalisation as 'pipe dreams'.\""
    },
    {
        "title": "This is a remarkable step by the government - and Donald Trump, China and Reform UK have all played their part",
        "description": "When the sun sets on Scunthorpe this Saturday, the town's steelworks will likely have a new boss - Jonathan Reynolds.",
        "url": "https://news.sky.com/story/this-is-a-remarkable-step-by-the-government-and-donald-trump-china-and-reform-uk-have-all-played-their-part-13346752",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-british-steel-scunthorpe_6883347.jpg?20250411201025",
        "type": "Home",
        "Author": "Rob Powell",
        "Date Published": "2025-04-11 20:09:00",
        "Headline": "The government's response to Donald Trump's stance on tariffs and security has been to emphasise the need to increase the UK's resilience in both business and defence - allowing the Scunthorpe site to close would hardly fit with that narrative.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n  When the sun sets on Scunthorpe this Saturday, the town's steelworks will likely have a new boss - Jonathan Reynolds. The law that parliament will almost certainly approve this weekend hands the business secretary the powers to direct staff at British Steel, order raw materials and, crucially, keep the blast furnaces at the plant open. This is not full nationalisation. But it is an extraordinary step. The Chinese firm Jingye will - on paper - remain the owner of British Steel. But the UK state will insert itself into the corporate set-up to legally override the wishes of the multinational company.  A form of martial law invoked and applied to private enterprise. \n                  Defence secretary warns this is 'the critical year' for Ukraine - as £450m in funding allocated\n                 \n                  MPs to debate emergency law to keep British Steel open as prime minister warns national security 'on the line'\n                 \n                  Michael Gove handed peerage - as Jeremy Hunt and cricketer James Anderson knighted\n                 That will come at a cost to the taxpayer. Follow latest: Live politics updates No number has been specified, but there are wages to pay and orders to make at a site estimated to already be losing £700,000 a day. There is also clear frustration in government at how the Chinese owners have engaged in negotiations around modernising the Scunthorpe site. \"Jingye have not been forthright throughout this process\", said the business secretary in his department's official announcement about the new laws. Time is so tight because of the nature of the steel-making process.  Once switched off, blast furnaces are very hard to turn back on. If this had happened in Scunthorpe - as seemed likely in a matter of days - then it would have been game over. This move keeps the show on the road and opens up more time for talks over the long-term future of the plant. While the official line in Whitehall is that \"all options are on the table\", nationalisation seems increasingly likely. That would need more legislation, if it was done - as seems likely - without the approval of the current owner. Finding an alternative commercial partner has not been ruled out, but one is not waiting in the wings either. As for what that long-term future looks like, with just five years of life left in the Scunthorpe blast furnaces, modernisation is inevitable. Port Talbot's plant saw its blast furnaces closed last year amid a switch to the more environmentally friendly electric arc furnaces and a loss of thousands of jobs. Political figures in Wales are now questioning why nationalisation wasn't on the table for this site. The response from government is that the deal was done by the previous Tory administration and the owners of the South Wales site agreed to the terms. But there is also a sense that this decision over British Steel is being shaped by the domestic and international political context. Labour came to power promising to revitalise left-behind communities and inject a sense of pride back into places still reeling from the loss of traditional industry. With that in mind, it would be politically intolerable to see the UK's last two blast furnaces closed and thousands of jobs lost in a relatively deprived part of the country. Read more from Sky News:Michael Gove handed peerageTickets on sale for Electoral Dysfunction live showBadenoch denies supporting local coalitions Reform UK's position of pushing for full and immediate nationalisation is also relevant, given the party is in electoral pursuit of Labour in many parts of the country where decline in manufacturing has been felt most acutely. The geo-political situation is perhaps more pressing though. Just look at the strength of the prime minister's language in his Downing Street address - \"our economic and national security are all on the line\". The government's reaction to the turmoil caused by President Donald Trump's pronouncements on tariffs and security has been to emphasise the need to increase domestic resilience in both business and defence. Becoming the only G7 nation unable to produce virgin steel at a time when globalisation appears to be in retreat hardly fits with that narrative. It would also present serious practical questions about the ability of the UK to produce steel for defence and the broader switch to green energy production. Then there is the intriguing subplot around US-China trade. While this decision is separate from discussions with the White House on tariffs, one can imagine how a UK move to wrestle control of a site of national importance from its Chinese owner might go down with a US president currently engaged in a fierce trade war with Beijing. This is a remarkable step from the government, but it is more a punctuation mark than a full answer. The tension between manufacturing and decarbonisation remains, as do the challenges presented by a global economy appearing to fragment significantly. But one thing is for sure. As a political parable about changes to traditional industry and the challenges of globalisation, the saga of British Steel is hard to beat."
    },
    {
        "title": "President Duda says Trump best chance for Ukraine peace - and urges allies to stay calm over tariffs 'shock therapy' ",
        "description": "Poland's outgoing President Andrzej Duda has kept few revelations for the final weeks of his presidency. ",
        "url": "https://news.sky.com/story/president-duda-says-trump-best-chance-for-ukraine-peace-and-urges-allies-to-stay-calm-over-tariffs-shock-therapy-13346892",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-duda-president-poland_6883564.jpg?20250412005108",
        "type": "Home",
        "Author": "Diana Magnay",
        "Date Published": "2025-04-11 23:01:00",
        "Headline": "Andrzej Duda tells Sky News he hopes a huge US military base in Poland - nicknamed 'Fort Trump' - will end up becoming a reality.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n Poland's outgoing President Andrzej Duda has kept few revelations for the final weeks of his presidency.  Ten years in office - a tenure spanning Donald Trump's first and current term - his admiration for the incumbent leader of the free world remains undimmed. As is his conviction that Ukraine's only chance of peace lies with the US leader. In an interview with Sky News in the presidential palace in Warsaw, President Duda described Mr Trump's tariff policy as \"shock therapy\", a negotiating tactic from a man \"of huge business and commercial success\" that he now brings to the arena of politics. That may not be what European politicians are used to, Mr Duda says, but Donald Trump is answerable to the US taxpayer and not to his European counterparts, and allies must \"stay calm\" in the face of this new transatlantic modus operandi. As for negotiations with Vladimir Putin, President Duda is sure that Donald Trump has the measure of the Russian leader, while refusing to be drawn on the competencies of his chief negotiator Steve Witkoff who landed on Friday in Moscow for further talks with Vladimir Putin - a man Mr Witkoff has described as \"trustworthy\" and \"not a bad guy\". Putting the kybosh on Nord Stream 2 in his first term and thwarting President Putin's energy ambitions via his state-owned energy giant Gazprom are evidence enough that Mr Trump knows where to hit so it hurts, Mr Duda says. Given the failures of Europe's leaders to negotiate peace through the Minsk accords, he believes the onus now falls on Donald Trump. \n                  Inside a NATO base in Poland - as residents bordering Russia say 'scare tactic' is needed\n                 \n                  'New reality' of landmine use in Europe\n                 \n                  Auschwitz survivor: 'You worked until you could work no more - then you went to the chimney'\n                 \"If anyone is able to force the end of Russia's war, it is most likely only the President of the United States,\" he says. \"The question is whether he will be determined enough to do that in a way - because it is also very important here in Europe being a neighbour of Russian aggression against Ukraine - that the peace is fair and lasting.\"  President Duda has just weeks left in office before the country votes for a new president in May. Originally from Poland's conservative Law and Justice party, one of the few points of alignment with the liberal and euro-centric prime minister Donald Tusk is the emphasis both place on security. Hopes for 'Fort Trump' base So did the announcement this week that the US would be withdrawing from the Jasionka air base near Rzeszow, which is the key logistics hub for allied support into Ukraine, come as a shock to the president, as it did to many Poles? Not at all, Mr Duda says. \"We were warned that the change was planned. I have not received any information from [the US] about decreasing the number of American soldiers. Quite the opposite.\" He referred back to talks with US defence secretary Pete Hegseth in February, saying: \"We discussed strengthening the American presence in Poland, and I mentioned the idea of creating a huge base of US troops. Then, we called it Fort Trump. I do still hope that this idea will be implemented.\" Read more:Eyewitness: Inside Polish NATO base on frontline with Russia Andrzej Duda has staked his legacy on close ties with Donald Trump at a time when many NATO allies are considering a form of de-Americanisation, as they consider new trading realities and build up their own defence capabilities. Poland has proven itself a model in terms of defence spending, investing more than any other NATO member - a massive 4.7% of GDP for 2025. But as the case of Canada shows, even the best of friendships can turn sour. The Canadian conservative party, once dubbed a maple MAGA, was flying high in the polls before Donald Trump decided to savage links with his closest trading partner. Now in the space of just a few months they are floundering behind the ruling liberal party. Is this a cautionary tale for Poland's conservative Law and Justice party? \"For Canadian conservatives it is a kind of side effect of President Trump's very tough economic policy,\" Mr Duda says. \"In Poland, this does not have such an impact. The security issues are the most important. That's the most important issue in Poland.\""
    },
    {
        "title": "Protests in coastal 'ghost town' where £400m ships don't fit the harbour",
        "description": "Those unfamiliar with Scotland's so-called 'ferry fiasco' would barely believe it is a true story.",
        "url": "https://news.sky.com/story/protests-in-coastal-ghost-town-where-163400m-ships-dont-fit-the-harbour-13346313",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ardrossan-harbour-ayrshire_6882725.jpg?20250411110459",
        "type": "Home",
        "Author": "Connor Gillies",
        "Date Published": "2025-04-11 23:01:00",
        "Headline": "Locals in the coastal town of Ardrossan are protesting today, saying the situation is \"completely and utterly nuts\" after a series of expensive blunders which have plagued the launch of two new ferries to the Isle of Arran.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n Those unfamiliar with Scotland's so-called 'ferry fiasco' would barely believe it is a true story. The new vessels cost quadruple their original price tag, one was delivered seven years late, the other is still being built, and both are too big to fit the main harbour for their daily journeys to and from the Isle of Arran. But in this latest chapter of the scandal, the unbelievable is very much part of the script. And, as Sky News has been hearing, the consequences are brutal. \"It is completely and utterly nuts,\" one exasperated campaigner exclaims as we stand overlooking the deserted Ardrossan Harbour on Scotland's mainland. Ardrossan, on the Ayrshire coast, has been the main port for the ferry service to and from Arran for decades. It is the quickest, most efficient route. But the 30-year-old ferry serving the islands for generations is failing and two new bespoke-designed ones were ordered, with them due to enter service from 2017. The original £100m cost ballooned to £400m, the shipyard was bought by taxpayers amid financial crisis, one vessel finally started carrying passengers in January 2025 while the other is still being built. \n                  Fourth person in court over damage to Trump Turnberry golf resort in Scotland\n                 \n                  Man who murdered taxi driver after being refused cigarette is jailed\n                 \n                  NHS Fife seeking to block public from watching livestream of Sandie Peggie trans row employment tribunal\n                 And to add insult to injury, both are too big for Ardrossan Harbour's jetty to cope with and require an £80m upgrade. In the meantime, services are being diverted along the coast to Troon. Protest as tensions rise in 'ghost town' Ardrossan was promised it would remain the primary port for connectivity to Arran. But now the community is in limbo and is fearing for its future. Christine Cowie, from Save Ardrossan Harbour, told Sky News: \"It is completely and utterly nuts. \"Why anybody would commission a ferry which doesn't fit the harbour for the route it is meant for is crazy. I cannot understand it at all. \"Ardrossan is like an extension of Arran. A lot of people come here to the dentist and use other businesses they don't have on the island which are losing money since the ferries have gone away.\" A botched design process, mismanagement and a string of costly blunders have given the project the label of one of the biggest procurement disasters in the history of Scottish devolution. People from Arran are joining Ardrossan campaigners on the mainland for a protest on Saturday. Hundreds are expected to gather as tensions boil over. The group's chairwoman Frances Gilmour said Ardrossan has become a \"ghost town\". She said: \"It is so quiet. It is spooky. It's frankly a disgrace. Businesses are suffering. \"Economically, this is the route. This is the economic route. We have the infrastructure. We just need the berths fixed.\" The 33-year-old MV Caledonian Isles, which has been away over the winter for extensive repairs, is expected to return to Ardrossan next month. But locals question how reliable and sustainable that vessel is. On the edge of the once bustling harbour carpark is the Bute MOT garage. Manager Scott Revans says they rely on customers from Arran previously hopping off the ferry and leaving their car for repairs at their centre. He told Sky News: \"The harbour is a ghost town. We'd get the passing trade doing whatever customers need from batteries to punctures. It has had an impact on us.\" Could taxpayers pick up the bill? Ardrossan Harbour is owned by private company Peel Ports. The Scottish government is currently exploring buying the port, but the talks are a secret, with campaigners feeling left in the dark. No one involved in the discussions would answer questions from Sky News about when they expect to alert communities to the next steps. Read more from Sky News:Delayed ferry formally begins sailingsFiasco-hit ferry removed from service A spokesman for the Scottish government agency Transport Scotland said: \"We absolutely understand people and communities' views in favour of retaining Ardrossan as the mainland port and remain committed to ensuring the Arran ferry service is fit for the future. \"The Scottish government has instructed officials… to explore options on purchasing Ardrossan Port. \"We will of course update parliament once there is progress and an outcome to report, however, it would be inappropriate to get in the way of these complex and sensitive discussions.\" Jim McSporran, port director at Peel Ports Clydeport, said: \"Peel Ports Group welcomes the Scottish government's statement that it intends to explore the potential purchase of Ardrossan Harbour. \"Regardless of the outcome of this process, our willingness to invest in the harbour remains steadfast. We take comfort that the port continues to operate this lifeline route and that it remains the port of choice for the people and businesses of Arran and Ardrossan.\""
    },
    {
        "title": "Menendez brothers' resentencing hearing can go ahead next week, says judge",
        "description": "The Menendez brothers' bid for freedom through resentencing can continue with the hearing scheduled for Thursday, a judge has ruled.",
        "url": "https://news.sky.com/story/menendez-brothers-resentencing-hearing-can-go-ahead-next-week-says-judge-13346541",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-erik-menendez-lyle-menendez_6883058.jpg?20250411155722",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-11 14:51:00",
        "Headline": "The Menendez brothers were sentenced to life after being convicted of murdering their parents, Jose and Kitty, at their Beverly Hills home in 1989. A Netflix drama series and documentary thrust them back into the spotlight last year, leading to renewed calls for their release.",
        "Content": "The Menendez brothers' bid for freedom through resentencing can continue with the hearing scheduled for Thursday, a judge has ruled. Lyle, 57, and Erik, 54, received life sentences without the possibility of parole after being convicted of murdering their parents, Jose and Kitty Menendez, at their Beverly Hills home in 1989. Lyle was 21 at the time, Erik was 18. Last year, Los Angeles district attorney George Gascon asked a judge to change the brothers' sentence from life without the possibility of parole to 50 years to life. That would make them immediately eligible for parole because they committed the crime when they were younger than 26. But Mr Gascon's successor Nathan Hochman submitted a motion last month to withdraw the resentencing request, saying the brothers must fully acknowledge lies they told about the murder of their parents before he would support their release from prison. Separately, Governor Gavin Newsom, who has the power to commute their sentences, has asked the parole board to consider whether the brothers would represent a public safety risk if released. In light of Mr Hochman's opposition, Los Angeles County Superior Court judge Michael Jesic ruled on Friday that the court can move forward with the hearing. \"Everything you argued today is absolutely fair game for the resentencing hearing next Thursday,\" he said. From prison, the brothers watched through a video link and could be seen in court seated next to each other in blue. Speaking after the hearing, the brothers' lawyer said: \"Today is a good day. Justice won over politics.\" Prosecutors accused the brothers of killing their parents for a multimillion-dollar inheritance, although their defence team argued they acted out of self-defence after years of sexual abuse by their father. The brothers have maintained their parents abused them since they were first charged with the murders. A Netflix drama series and subsequent documentary about the brothers thrust them back into the spotlight last year, and led to renewed calls for their release - including from some members of their family."
    },
    {
        "title": "Will Katy Perry sing in space - and will the all-female Blue Origin rocket crew count as astronauts?",
        "description": "It's been more than 60 years since a woman travelled into space without a man. And now six of them are blasting off from Earth.",
        "url": "https://news.sky.com/story/will-katy-perry-sing-in-space-and-will-the-all-female-blue-origin-rocket-crew-count-as-astronauts-13345042",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-space-blue-origin_6882943.png?20250411135414",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-11 23:01:00",
        "Headline": "A popstar, a journalist, a civil rights activist, rocket scientist and filmmaker are heading into space. And the mission is being led by Lauren Sanchez, an author and the fiance of Amazon's Jeff Bezos.",
        "Content": "It's been more than 60 years since a woman travelled into space without a man. And now six of them are blasting off from Earth. Popstar Katy Perry, author Lauren Sanchez, journalist and TV presenter Gayle King, civil rights activist Amanda Nguyen, former rocket scientist Aisha Bowe and filmmaker Kerianne Flynn are due to launch in Jeff Bezos' Blue Origin rocket on Sunday. It will be the latest flight of the New Shepard programme, named NS-31, and is aiming to \"create a lasting impact that will inspire generations\", with the women forming the first all-female crew since Russian engineer Valentina Tereshkova's solo flight to space in 1963. The trip is only expected to last around 11 minutes, with the reusable self-driving rocket taking off from Launch Site One in west Texas, at 8.30am local time (2.30pm BST) on Monday. It will reach a maximum height of 100km (62 miles) above Earth, with the women technically entering space as the capsule crosses the Karman line, which is internationally recognised as the boundary of space. They will not, however, be classed as astronauts by the Federal Aviation Administration, NASA or US military, which all have different eligibility requirements for people to become commercial astronauts. While in space, the crew will have about four minutes of weightlessness to float around and take in the views of Earth from the capsule's large windows. The crew capsule will then descend back to Earth using three parachutes. So far, 52 people have been taken into space as part of billionaire and Amazon chief Mr Bezos's programme, including the man himself, who joined the New Shepard's maiden voyage in 2021. Star Trek actor William Shatner became the oldest person in space when he joined the mission at the age of 90. How the crew was picked Mr Bezos' fiancee is leading the mission. Sanchez told Elle magazine she chose her fellow crew members because each had \"proven their ability to inspire others\". She said all the women will be able to spread the word on what they felt like during the trip, and also expand on ideas of what the next generation of space explorers will look like. Perry, who is one of the best-selling music artists of all time, told Elle that she has been wanting to go to space for almost 20 years, so it was a no-brainer when she got the call. She said: \"Even when Blue Origin was first talking about commercial travel to space, I was like, 'Sign me up! I'm first in line'. And then they called me, and I was like, 'Really? I get an invite?'.\" For King, who is best known as the co-host of US breakfast show CBS Mornings, the decision wasn't quite so easy. \"When I got the call from Lauren and Jeff, my first reaction was a no,\" she said, adding that she still has \"a lot of trepidation\" ahead of the trip. Bowe, a former NASA rocket scientist and chief executive of technology company STEMBoard, said she feels like she has been \"training for and waiting for this moment [her] entire life\", while civil rights activist Nguyen and film producer Flynn both said the opportunity was a dream come true. \"I can't wait to touch down on Earth and share what we bring back with the world,\" Flynn said. Glammed-up astronauts? As well as making history by being the first all-female crew in space, the women may also be the first group of astronauts to have their hair and makeup done for a mission. \"Who would not get glam before the flight,\" Sanchez said, before joking that fake eyelashes would be \"flying round the capsule\".  Bowe said she had already tested out the hairstyle she plans to have on launch day - by skydiving in Dubai. \"I think it's so important for people to see us like that,\" Nguyen said. \"This dichotomy of engineer and scientist, and then beauty and fashion. We contain multitudes. Women are multitudes. I'm going to be wearing lipstick.\" Perry put it another way: \"We are going to put the 'ass' in astronaut.\" The women also shared details of what they plan to take to space, including the original flag from Apollo 12 - the second mission to the moon - a stuffed animal, shells from Malaysia, and conch chowder, the national dish of The Bahamas, which Bowe grew up eating. Read more:Is Bezos chasing down Musk in the billionaire space race?SpaceX tourists return to Earth As a singer, Perry said she feels like she should perform while floating above the Earth, which would make her the first artist to sing in space. She added that she is also taking part in the flight for her daughter Daisy Dove Bloom, who she shares with British actor Orlando Bloom, to teach her that \"any type of person can reach their dreams\"."
    },
    {
        "title": "US envoy meets Putin for talks - as Trump urges Russia to 'get moving' on Ukraine",
        "description": "Donald Trump's special envoy Steve Witkoff has met Vladimir Putin for talks in Russia - as the US president called on Moscow to \"get moving\" with ending the war in Ukraine.",
        "url": "https://news.sky.com/story/putin-meets-us-envoy-for-talks-as-trump-calls-for-russia-to-get-moving-to-end-war-in-ukraine-13346557",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-vladimir-putin-steve-witkoff_6883275.jpg?20250411183229",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-11 15:30:00",
        "Headline": "Despite Russia playing down expectations of a breakthrough at the talks, Sky's Ivor Bennett believes the meeting - Mr Witkoff's third with Vladimir Putin this year - is significant as a sign of the Trump administration's \"increasing frustration at the lack of progress\".",
        "Content": " Donald Trump's special envoy Steve Witkoff has met Vladimir Putin for talks in Russia - as the US president called on Moscow to \"get moving\" with ending the war in Ukraine. Mr Witkoff, who has been pressing the Kremlin to accept a truce, visited Mr Putin in St Petersburg after earlier meeting the Russian leader's international co-operation envoy Kirill Dmitriev. Mr Putin was shown on state TV greeting Mr Witkoff at the city's presidential library at the start of the latest discussions about the search for a peace deal on Ukraine. Before Friday's meeting, Kremlin spokesman Dmitry Peskov played down expectations of a breakthrough and told state media the visit would not be \"momentous\". Follow the latest updates on the war in Ukraine However, Sky News Moscow correspondent Ivor Bennett said he believes the meeting - Mr Witkoff's third with Mr Putin this year - is significant as a sign of the Trump administration's \"increasing frustration at the lack of progress on peace talks\". Moscow correspondent This is the third time Steve Witkoff has met Vladimir Putin but it's the first time we've actually seen them shaking hands and talking face-to-face. And that itself feels significant.\n Their previous meetings over the past couple of months have been away from the cameras, but this time the Kremlin made the conscious decision to film the moment and publicise it. I think it reflects how confident Russia feels right now in these negotiations - regarding the war in Ukraine and its relationship with the US. Witkoff was in St Petersburg to push for a peace deal, with the White House apparently growing frustrated at the lack of progress. But judging by the footage, Vladimir Putin was quite clearly the dominant figure in the meeting. He was the one leading and the more relaxed, while Witkoff appeared more like an embarrassed fanboy rather than a tough negotiator. And the Kremlin has released this footage knowing that it'll be splashed all over state media here and news bulletins abroad. I think there are two aims. One is to show the Russian public that despite the talk from the Trump administration that they are calling the shots, it's actually the Kremlin in control. And the other is to taunt Ukraine, saying that we - Russia and America - are the ones who will decide your future, not you. Earlier on Friday, Mr Trump issued his latest social media statement on trying to end the war, writing on Truth Social: \"Russia has to get moving. Too many people ere [sic] DYING, thousands a week, in a terrible and senseless war - A war that should have never happened, and wouldn't have happened, if I were President!!!\" Dialogue between the US and Russia, aimed at agreeing a ceasefire ahead of a possible peace deal to end the war, has recently appeared to have stalled over disagreements around conditions for a full pause. Read more:Prince Harry visits war victims in UkraineTwo Chinese citizens captured during fighting, Zelenskyy says Secondary sanctions could be imposed on countries that buy Russian oil, Mr Trump has said, if he feels Moscow is dragging its feet on a deal. Mr Putin has said he is ready in principle to agree a full ceasefire, but argues crucial conditions have yet to be agreed - and that what he calls the root causes of the war have yet to be addressed. The Russian president wants to dismantle Ukraine as an independent, functioning state and has demanded Kyiv recognise Moscow's annexation of Crimea and other partly occupied areas, and pull its forces out, as well as a pledge for Ukraine to never join NATO and for the size of its army to be limited. Zelenskyy renews support calls after attack on home city  Meanwhile, Ukrainian president Volodymyr Zelenskyy has renewed his appeals for more Patriot air defence systems after the deaths of 20 people, including nine children, who were killed when a Russian missile hit apartment buildings and a playground in his home city of Kryvyi Rih last week. Speaking online at a meeting of the so-called Ramstein group of about 50 nations that provide military support to Ukraine, named after a previous meeting at America's Ramstein air base in Germany in 2022, Mr Zelenskyy said recent Russian attacks showed Moscow was not ready to accept and implement any realistic and effective peace proposals. Mr Zelenskyy also made his evening address to the nation, saying: \"Ukraine is not just asking - we are ready to buy appropriate additional systems.\" The UK's defence secretary, John Healy, has said this is \"the critical year\" for Ukraine - and has confirmed £450m in funding for a military support package."
    },
    {
        "title": "Michael Gove handed peerage - as Jeremy Hunt and cricketer James Anderson knighted",
        "description": "Veteran cabinet minister Michael Gove has been awarded a peerage in Rishi Sunak's resignation honours list.",
        "url": "https://news.sky.com/story/veteran-cabinet-minister-michael-gove-awarded-peerage-in-rishi-sunaks-resignation-honours-13346250",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-michael-gove-honour_6882649.jpg?20250411142743",
        "type": "Home",
        "Author": "Ben Bloch",
        "Date Published": "2025-04-11 07:04:00",
        "Headline": "An outgoing prime minister can request that the reigning monarch grants peerages, knighthoods, damehoods or other awards in the British honours system to any number of people.",
        "Content": "\n          Political reporter\n              @realBenBloch\n Veteran cabinet minister Michael Gove has been awarded a peerage in Rishi Sunak's resignation honours list. Mr Gove - now editor of The Spectator magazine - was first elected to parliament in 2005 and immediately joined then-Conservative leader David Cameron's shadow cabinet. He was appointed education secretary when the party entered government in 2010 and held multiple cabinet posts until the 2024 general election, when he stood down from parliament. Mr Sunak elevated seven allies to the House of Lords, including former cabinet ministers Mark Harper, Victoria Prentis, Alister Jack, and Simon Hart. Former chief executive of the Conservative Party, Stephen Massey, also becomes a peer, as well as Eleanor Shawcross, former head of the No10 policy unit. He also awarded a number of honours. It is traditional for prime ministers to award peerages and other gongs upon their resignation from office - with key political allies, donors and staff often rewarded. An outgoing prime minister can request that the reigning monarch grants peerages, knighthoods, damehoods or other awards in the British honours system to any number of people. In the case of peerages, the House of Lords Appointments Commission vets the list, and for other honours, the Cabinet Office conducts checks. \n                  'Not ill at all' young people getting diagnosed with 'fashionable' ADHD, peer claims\n                 \n                  Sue Gray, Sir Keir Starmer's former chief of staff, nominated for peerage\n                 \n                  Syria, Lords, Christmas - Answer the question special\n                 Resignation honours are separate from dissolution honours, which are awarded by the incumbent prime minister and opposition leaders after the dissolution of parliament preceding a general election. Here are the biggest names given honours by Mr Sunak: Michael Gove - peerage From when the Conservatives returned to government in 2010, Michael Gove spent almost the whole time in a ministerial role. After reforming the education system, he went on to hold roles like chief whip, environment secretary, justice secretary and housing secretary. He led the pro-Brexit side of the 2016 referendum alongside Boris Johnson, and famously sunk the latter's leadership bid with his own. However, both failed at that juncture, and Mr Gove's reputation never recovered to allow him another go at the top job. The debt was repaid when Mr Johnson fired Mr Gove as his administration collapsed in 2022. Mr Gove returned to government under Rishi Sunak, and ultimately retired from the Commons at the 2024 election. James Anderson - knighthood One of England's most successful cricketers, Jimmy Anderson, has been awarded a knighthood in avid cricket fan Rishi Sunak's resignation honours list. He is regarded as one of the greatest bowlers in the history of the sport, and holds the record for the most wickets taken by a fast bowler in Test cricket. Jeremy Hunt - knighthood A former chancellor and serial runner-up in Tory leadership competitions, Jeremy Hunt was ever present in Conservative cabinets while the party was in government. He was both foreign secretary and defence secretary before failing to take over the party after Theresa May stood aside. Following a stint on the backbenches, Mr Hunt returned as chancellor under Liz Truss in a bid to stabilise markets - retaining this position under Rishi Sunak. Despite persistent speculation he was set to be ditched in favour of Claire Coutinho, Mr Hunt kept his job until the 2024 general election - where he won his seat and now sits as a backbencher. James Cleverly - knighthood A former leader of the Conservatives in the London Assembly, James Cleverly entered parliament at the 2015 general election as the MP for Braintree. In 2018, he was appointed deputy chairman of the party, and in April 2019, was appointed a minister in the Brexit department. Boris Johnson appointed him as party chairman after taking over the top job, and he took on a succession of junior ministerial posts before becoming education secretary following Mr Johnson's resignation as prime minister. Liz Truss appointed him as foreign secretary - a post he held until November 2023 when Rishi Sunak brought back David Cameron for the role, and he took over as home secretary - a post he held until the general election. Mr Cleverly was one of the lucky cabinet ministers to survive the Labour landslide and retained his seat. But he was less successful in the Conservative Party leadership contest, losing out in the final round of MP voting. Andrew Mitchell - knighthood The former deputy foreign secretary has been a fixture in Westminster since 1987, when he was first elected as the MP for Gedling. He was appointed to the government in 1994, but lost his seat in the 1997 Tony Blair landslide. He returned to parliament in 2001 as the MP for Sutton Coldfield, and took on a number of shadow cabinet and then cabinet roles, culminating in his appointment to the Foreign Office in 2022, before becoming deputy foreign secretary to David Cameron in 2024. He rose to public prominence in September 2012 when he allegedly swore when a police officer told him to dismount his bicycle and leave Downing Street through the pedestrian gate rather than the main gate. The incident became known as \"Plebgate\". Mel Stride - knighthood One of Rishi Sunak's closest aides, he chaired his campaign to be Tory leader against Liz Truss and was rewarded with the Work and Pensions brief when his man finally entered Number 10. He was also a prominent figure in the downfall of Ms Truss as chair of the Treasury select committee - regularly requesting information from the Treasury and Bank of England that highlighted damaging information. A capable media performer, he was ever present during the general election as he tried unsuccessfully to get Mr Sunak back into office. Mr Stride kept his seat after the vote, and was rewarded by Kemi Badenoch with a role as shadow chancellor of the exchequer. Stephen Massey - peerage Described as a \"sensible man\" by former chancellor George Osborne, Stephen Massey was appointed chief executive of the Conservative Party in November 2022 after Rishi Sunak took over as leader in the coronation leadership contest following the collapse of the Truss government. Having spent his career as a financial adviser, Mr Sunak probably thought he was a safe pair of hands in which to entrust the leadership of the party machinery as they built their war chest ahead of the general election to come. The personal donations of £343,000 to the party and £25,000 to Mr Sunak's leadership campaign also likely made him an attractive candidate for the job. Has Rishi Sunak previously awarded honours? Mr Sunak previously granted peerages to former prime minister Theresa May, Sir Graham Brady, the former chairman of the influential Conservative backbench 1922 committee, as well as his right-hand man Liam Booth-Smith on 4 July 2024 - the day of the general election. He lost the election by a landslide to Sir Keir Starmer's Labour Party, and resigned as prime minister that day. He remains in parliament as the MP for Richmond and Northallerton."
    },
    {
        "title": "MPs to debate emergency law to keep British Steel open as prime minister warns national security 'on the line'",
        "description": "MPs will today debate emergency laws to save British Steel after the prime minister warned the country's \"economic and national security is on the line\".",
        "url": "https://news.sky.com/story/mps-to-debate-emergency-law-to-keep-british-steel-open-as-prime-minister-warns-national-security-on-the-line-13346516",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-blast-furnace-conway_6875399.jpg?20250404000520",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-11 14:08:00",
        "Headline": "MPs and Lords will return to parliament for a rare Saturday sitting after the prime minister said the future of British Steel \"hangs in the balance\".",
        "Content": " MPs will today debate emergency laws to save British Steel after the prime minister warned the country's \"economic and national security is on the line\". Sir Keir Starmer said the future of the company's Scunthorpe plant - which employs about 3,500 people - \"hangs in the balance\" after its owner said the cost of running it was unsustainable. The prime minister said legislation would be passed in one day to allow the government to \"take control of the plant and preserve all viable options\". Follow latest: Live politics updates MPs and Lords are being summoned from their Easter recess to debate the move and will sit from 11am. The last time parliament was recalled was on 18 August 2021 to debate the situation in Afghanistan. The government has been considering nationalising British Steel after Jingye, the Chinese owner, cancelled future orders for iron ore, coal and other raw materials needed to keep the blast furnaces running. \n                  This is a remarkable step by the government - and Donald Trump, China and Reform UK have all played their part\n                 \n                  Defence secretary warns this is 'the critical year' for Ukraine - as £450m in funding allocated\n                 \n                  Michael Gove handed peerage - as Jeremy Hunt and cricketer James Anderson knighted\n                 The furnaces are the last in the UK capable of making virgin steel. Jingye last month rejected a £500m state rescue package - raising fresh doubts about the Lincolnshire plant and fears it could close in the coming days. The steel from the plant is used in the rail network and the construction and automotive industries. Without it, Britain would be reliant on imports at a time of trade wars and geopolitical instability.  In a statement on Friday, Sir Keir said: \"I will always act in the national interest to protect British jobs and British workers. \"This afternoon, the future of British Steel hangs in the balance. Jobs, investment, growth, our economic and national security are all on the line.\" The prime minister said steel was \"part of our national story, part of the pride and heritage of this nation\" and \"essential for our future\". He said the emergency law would give the business secretary powers to do \"everything possible to stop the closure of these blast furnaces\". This includes the power to direct the company's board and workforce. It will also ensure it can order the raw materials to keep the furnaces running and ensure staff are paid. Chancellor Rachel Reeves said the government was \"taking action to save British steel production and protect British jobs\", while Business Secretary Jonathan Reynolds said the owner had left the government with \"no choice\". Mr Reynolds said Jingye had confirmed plans to close the Scunthorpe furnaces immediately despite months of talks and the offer of £500m of co-investment. The company said it had invested £1.2bn since taking over in 2020, but that the plant is losing £700,000 a day. Read more:Govt intervention in British Steel 'a remarkable step' - analysis  Conservative leader Kemi Badenoch said the government had landed itself in a \"steel crisis entirely of their own making\". She said when she was business secretary, she had negotiated a plan with British Steel \"to limit job losses and keep the plant running\". Ms Badenoch said the government had \"bungled the negotiations, insisting on a Scunthorpe-only deal that the company has deemed unviable\". She added: \"Keir Starmer should have seen this coming. But instead of addressing it earlier in the week when parliament was sitting, their incompetence has led to a last-minute recall of parliament.\" The Unite union said the prime minister's recalling of parliament was \"absolutely the right thing to do to begin the process of nationalisation\". While the government hasn't confirmed those plans, the chancellor also said earlier this week that \"all options\" are on the table. Sky News understands accountancy firm EY is being lined up to play a role in a nationalisation process. The government's intervention over British Steel comes six months after the last blast furnace was closed at Port Talbot in Wales. Plaid Cymru has questioned why the government didn't take similar action there. The party's Westminster leader, Liz Saville Roberts, said: \"Parliament is being recalled to debate the nationalisation of Scunthorpe steelworks. \"But when global market forces devastated Welsh livelihoods in Port Talbot, Labour dismissed Plaid Cymru's calls for nationalisation as 'pipe dreams'.\""
    },
    {
        "title": "This is a remarkable step by the government - and Donald Trump, China and Reform UK have all played their part",
        "description": "When the sun sets on Scunthorpe this Saturday, the town's steelworks will likely have a new boss - Jonathan Reynolds.",
        "url": "https://news.sky.com/story/this-is-a-remarkable-step-by-the-government-and-donald-trump-china-and-reform-uk-have-all-played-their-part-13346752",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-british-steel-scunthorpe_6883347.jpg?20250411201025",
        "type": "UK",
        "Author": "Rob Powell",
        "Date Published": "2025-04-11 20:09:00",
        "Headline": "The government's response to Donald Trump's stance on tariffs and security has been to emphasise the need to increase the UK's resilience in both business and defence - allowing the Scunthorpe site to close would hardly fit with that narrative.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n  When the sun sets on Scunthorpe this Saturday, the town's steelworks will likely have a new boss - Jonathan Reynolds. The law that parliament will almost certainly approve this weekend hands the business secretary the powers to direct staff at British Steel, order raw materials and, crucially, keep the blast furnaces at the plant open. This is not full nationalisation. But it is an extraordinary step. The Chinese firm Jingye will - on paper - remain the owner of British Steel. But the UK state will insert itself into the corporate set-up to legally override the wishes of the multinational company.  A form of martial law invoked and applied to private enterprise. \n                  Defence secretary warns this is 'the critical year' for Ukraine - as £450m in funding allocated\n                 \n                  MPs to debate emergency law to keep British Steel open as prime minister warns national security 'on the line'\n                 \n                  Michael Gove handed peerage - as Jeremy Hunt and cricketer James Anderson knighted\n                 That will come at a cost to the taxpayer. Follow latest: Live politics updates No number has been specified, but there are wages to pay and orders to make at a site estimated to already be losing £700,000 a day. There is also clear frustration in government at how the Chinese owners have engaged in negotiations around modernising the Scunthorpe site. \"Jingye have not been forthright throughout this process\", said the business secretary in his department's official announcement about the new laws. Time is so tight because of the nature of the steel-making process.  Once switched off, blast furnaces are very hard to turn back on. If this had happened in Scunthorpe - as seemed likely in a matter of days - then it would have been game over. This move keeps the show on the road and opens up more time for talks over the long-term future of the plant. While the official line in Whitehall is that \"all options are on the table\", nationalisation seems increasingly likely. That would need more legislation, if it was done - as seems likely - without the approval of the current owner. Finding an alternative commercial partner has not been ruled out, but one is not waiting in the wings either. As for what that long-term future looks like, with just five years of life left in the Scunthorpe blast furnaces, modernisation is inevitable. Port Talbot's plant saw its blast furnaces closed last year amid a switch to the more environmentally friendly electric arc furnaces and a loss of thousands of jobs. Political figures in Wales are now questioning why nationalisation wasn't on the table for this site. The response from government is that the deal was done by the previous Tory administration and the owners of the South Wales site agreed to the terms. But there is also a sense that this decision over British Steel is being shaped by the domestic and international political context. Labour came to power promising to revitalise left-behind communities and inject a sense of pride back into places still reeling from the loss of traditional industry. With that in mind, it would be politically intolerable to see the UK's last two blast furnaces closed and thousands of jobs lost in a relatively deprived part of the country. Read more from Sky News:Michael Gove handed peerageTickets on sale for Electoral Dysfunction live showBadenoch denies supporting local coalitions Reform UK's position of pushing for full and immediate nationalisation is also relevant, given the party is in electoral pursuit of Labour in many parts of the country where decline in manufacturing has been felt most acutely. The geo-political situation is perhaps more pressing though. Just look at the strength of the prime minister's language in his Downing Street address - \"our economic and national security are all on the line\". The government's reaction to the turmoil caused by President Donald Trump's pronouncements on tariffs and security has been to emphasise the need to increase domestic resilience in both business and defence. Becoming the only G7 nation unable to produce virgin steel at a time when globalisation appears to be in retreat hardly fits with that narrative. It would also present serious practical questions about the ability of the UK to produce steel for defence and the broader switch to green energy production. Then there is the intriguing subplot around US-China trade. While this decision is separate from discussions with the White House on tariffs, one can imagine how a UK move to wrestle control of a site of national importance from its Chinese owner might go down with a US president currently engaged in a fierce trade war with Beijing. This is a remarkable step from the government, but it is more a punctuation mark than a full answer. The tension between manufacturing and decarbonisation remains, as do the challenges presented by a global economy appearing to fragment significantly. But one thing is for sure. As a political parable about changes to traditional industry and the challenges of globalisation, the saga of British Steel is hard to beat."
    },
    {
        "title": "Michael Gove handed peerage - as Jeremy Hunt and cricketer James Anderson knighted",
        "description": "Veteran cabinet minister Michael Gove has been awarded a peerage in Rishi Sunak's resignation honours list.",
        "url": "https://news.sky.com/story/veteran-cabinet-minister-michael-gove-awarded-peerage-in-rishi-sunaks-resignation-honours-13346250",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-michael-gove-honour_6882649.jpg?20250411142743",
        "type": "UK",
        "Author": "Ben Bloch",
        "Date Published": "2025-04-11 07:04:00",
        "Headline": "An outgoing prime minister can request that the reigning monarch grants peerages, knighthoods, damehoods or other awards in the British honours system to any number of people.",
        "Content": "\n          Political reporter\n              @realBenBloch\n Veteran cabinet minister Michael Gove has been awarded a peerage in Rishi Sunak's resignation honours list. Mr Gove - now editor of The Spectator magazine - was first elected to parliament in 2005 and immediately joined then-Conservative leader David Cameron's shadow cabinet. He was appointed education secretary when the party entered government in 2010 and held multiple cabinet posts until the 2024 general election, when he stood down from parliament. Mr Sunak elevated seven allies to the House of Lords, including former cabinet ministers Mark Harper, Victoria Prentis, Alister Jack, and Simon Hart. Former chief executive of the Conservative Party, Stephen Massey, also becomes a peer, as well as Eleanor Shawcross, former head of the No10 policy unit. He also awarded a number of honours. It is traditional for prime ministers to award peerages and other gongs upon their resignation from office - with key political allies, donors and staff often rewarded. An outgoing prime minister can request that the reigning monarch grants peerages, knighthoods, damehoods or other awards in the British honours system to any number of people. In the case of peerages, the House of Lords Appointments Commission vets the list, and for other honours, the Cabinet Office conducts checks. \n                  'Not ill at all' young people getting diagnosed with 'fashionable' ADHD, peer claims\n                 \n                  Sue Gray, Sir Keir Starmer's former chief of staff, nominated for peerage\n                 \n                  Syria, Lords, Christmas - Answer the question special\n                 Resignation honours are separate from dissolution honours, which are awarded by the incumbent prime minister and opposition leaders after the dissolution of parliament preceding a general election. Here are the biggest names given honours by Mr Sunak: Michael Gove - peerage From when the Conservatives returned to government in 2010, Michael Gove spent almost the whole time in a ministerial role. After reforming the education system, he went on to hold roles like chief whip, environment secretary, justice secretary and housing secretary. He led the pro-Brexit side of the 2016 referendum alongside Boris Johnson, and famously sunk the latter's leadership bid with his own. However, both failed at that juncture, and Mr Gove's reputation never recovered to allow him another go at the top job. The debt was repaid when Mr Johnson fired Mr Gove as his administration collapsed in 2022. Mr Gove returned to government under Rishi Sunak, and ultimately retired from the Commons at the 2024 election. James Anderson - knighthood One of England's most successful cricketers, Jimmy Anderson, has been awarded a knighthood in avid cricket fan Rishi Sunak's resignation honours list. He is regarded as one of the greatest bowlers in the history of the sport, and holds the record for the most wickets taken by a fast bowler in Test cricket. Jeremy Hunt - knighthood A former chancellor and serial runner-up in Tory leadership competitions, Jeremy Hunt was ever present in Conservative cabinets while the party was in government. He was both foreign secretary and defence secretary before failing to take over the party after Theresa May stood aside. Following a stint on the backbenches, Mr Hunt returned as chancellor under Liz Truss in a bid to stabilise markets - retaining this position under Rishi Sunak. Despite persistent speculation he was set to be ditched in favour of Claire Coutinho, Mr Hunt kept his job until the 2024 general election - where he won his seat and now sits as a backbencher. James Cleverly - knighthood A former leader of the Conservatives in the London Assembly, James Cleverly entered parliament at the 2015 general election as the MP for Braintree. In 2018, he was appointed deputy chairman of the party, and in April 2019, was appointed a minister in the Brexit department. Boris Johnson appointed him as party chairman after taking over the top job, and he took on a succession of junior ministerial posts before becoming education secretary following Mr Johnson's resignation as prime minister. Liz Truss appointed him as foreign secretary - a post he held until November 2023 when Rishi Sunak brought back David Cameron for the role, and he took over as home secretary - a post he held until the general election. Mr Cleverly was one of the lucky cabinet ministers to survive the Labour landslide and retained his seat. But he was less successful in the Conservative Party leadership contest, losing out in the final round of MP voting. Andrew Mitchell - knighthood The former deputy foreign secretary has been a fixture in Westminster since 1987, when he was first elected as the MP for Gedling. He was appointed to the government in 1994, but lost his seat in the 1997 Tony Blair landslide. He returned to parliament in 2001 as the MP for Sutton Coldfield, and took on a number of shadow cabinet and then cabinet roles, culminating in his appointment to the Foreign Office in 2022, before becoming deputy foreign secretary to David Cameron in 2024. He rose to public prominence in September 2012 when he allegedly swore when a police officer told him to dismount his bicycle and leave Downing Street through the pedestrian gate rather than the main gate. The incident became known as \"Plebgate\". Mel Stride - knighthood One of Rishi Sunak's closest aides, he chaired his campaign to be Tory leader against Liz Truss and was rewarded with the Work and Pensions brief when his man finally entered Number 10. He was also a prominent figure in the downfall of Ms Truss as chair of the Treasury select committee - regularly requesting information from the Treasury and Bank of England that highlighted damaging information. A capable media performer, he was ever present during the general election as he tried unsuccessfully to get Mr Sunak back into office. Mr Stride kept his seat after the vote, and was rewarded by Kemi Badenoch with a role as shadow chancellor of the exchequer. Stephen Massey - peerage Described as a \"sensible man\" by former chancellor George Osborne, Stephen Massey was appointed chief executive of the Conservative Party in November 2022 after Rishi Sunak took over as leader in the coronation leadership contest following the collapse of the Truss government. Having spent his career as a financial adviser, Mr Sunak probably thought he was a safe pair of hands in which to entrust the leadership of the party machinery as they built their war chest ahead of the general election to come. The personal donations of £343,000 to the party and £25,000 to Mr Sunak's leadership campaign also likely made him an attractive candidate for the job. Has Rishi Sunak previously awarded honours? Mr Sunak previously granted peerages to former prime minister Theresa May, Sir Graham Brady, the former chairman of the influential Conservative backbench 1922 committee, as well as his right-hand man Liam Booth-Smith on 4 July 2024 - the day of the general election. He lost the election by a landslide to Sir Keir Starmer's Labour Party, and resigned as prime minister that day. He remains in parliament as the MP for Richmond and Northallerton."
    },
    {
        "title": "Kara Alexander: Dagenham mother who murdered her two young sons in the bath jailed",
        "description": "A \"skunk-smoking\" mother who murdered her two young sons in the bath while in a psychotic state has been jailed for life with a minimum term of more than 21 years.",
        "url": "https://news.sky.com/story/kara-alexander-dagenham-mother-who-murdered-her-two-young-sons-in-the-bath-jailed-13346244",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kara-alexander-marley-thomas_6835605.jpg?20250221140845",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-11 09:56:00",
        "Headline": "Mr Justice Bennathan said Kara Alexander was in a psychotic state when she killed her sons and that it was cannabis induced.",
        "Content": "A \"skunk-smoking\" mother who murdered her two young sons in the bath while in a psychotic state has been jailed for life with a minimum term of more than 21 years. Kara Alexander was found guilty of drowning Elijah Thomas, two, and Marley Thomas, five, at the home they shared in Dagenham, east London, in December 2022. Alexander, 47, who had denied two counts of murder, was convicted at Kingston Crown Court in February. Post-mortems on the boys found they had either been drowned or suffocated - but Alexander accepted at trial that she had placed them in the bath before they \"accidentally\" drowned. Returning to Kingston Crown Court on Friday, Mr Justice Bennathan sentenced Alexander to life imprisonment with a minimum term of 21 years and 252 days. The judge referred to the children's father finding his deceased sons next to one another as \"the stuff of nightmares\". Mr Justice Bennathan said: \"On the evening of 15 December 2022, you'd been smoking skunk. \"You'd been doing so every night for weeks, probably much longer. At some stage, both the boys were in their pyjamas ready for bed, with Elijah also wearing his nappy. \"You drowned them both by your deliberate acts.\" The judge said Alexander \"unspeakably\" held the boys under water for \"up to a minute or two\". \"The bath was probably still run from their normal evening routine and I do not think for a moment that your dreadful acts were premeditated,\" he said. The judge said Alexander dried the boys, put them in clean pyjamas and laid them together, tucked in under duvets, on the same bunk bed. \"The next morning, their father, worried by your unusual silence, came and found them. The stuff of nightmares,\" he said. The jury heard how the boys' father was due to have them that weekend and became increasingly concerned when he had not heard back from Alexander. When he arrived at their home, she told him the children were upstairs sleeping. When the father returned downstairs to call for help, Alexander had run away. It took the police around an hour to find her. The Metropolitan Police said forensic analysis of Alexander's phone, which had been found in a filled sink, showed it had been in regular use in the run-up to the murders, but on the day the children were found, no calls were made or messages sent. This led detectives to believe that she had intentionally been avoiding people following their deaths. Prosecutors said they built their case on showing the boys could not have accidentally drowned and that the only reasonable explanation for their deaths was that Alexander caused them to drown. Read more from Sky News:Family die in sightseeing helicopter crashMan who murdered taxi driver after being refused cigarette is jailed The judge said there was every sign Alexander was a \"caring and affectionate\" mother to both children before the events of 15 December 2022. He pointed out that their father said Alexander \"never shouted or raised her voice at the boys\" and \"never showed violence to the boys\". The judge said: \"From all that I have read and seen of you, I have no doubt that every day when you awake you will remember and grieve for the little boys whose lives you snatched away.\" Mr Justice Bennathan said Alexander was in a psychotic state when she killed her sons and that it was cannabis induced. He said Alexander had a previous psychotic episode in 2016 in which cannabis also probably played a part, but acknowledged he could not be sure she was aware that the drug could trigger another psychotic state. In his sentencing remarks, Mr Justice Bennathan warned of the dangers of drugs. He said: \"The heavy use of skunk or other hyper-strong strains of cannabis can plunge people into a mental health crisis in which they may harm themselves or others. \"If any drug user does not know that, it's about time they did. \"At your trial, Kara Alexander, the three psychiatrists who gave evidence disagreed about a number of things, but on that they were unanimous. \"It will comfort nobody connected to this case, but if these events bring home that message to even a few people, some slight good may come from what is otherwise an unmitigated tragedy.\" Detective Chief Inspector Paul Waller, who led the investigation, said: \"This is an incredibly tragic case, which has left a father without his two beloved boys and a family without two young brothers. \"Kara Alexander will spend the next two decades behind bars, where the memory of what she has done will haunt her forever. \"To the family and friends of Elijah and Marley, while no amount of time will erase the pain of such a loss, I hope this sentence serves to bring some semblance of justice. \"I hope you can now move on with your life, remembering the boys as you knew them, and treasuring the happy times you spent with them.\""
    },
    {
        "title": "Protests in coastal 'ghost town' where £400m ships don't fit the harbour",
        "description": "Those unfamiliar with Scotland's so-called 'ferry fiasco' would barely believe it is a true story.",
        "url": "https://news.sky.com/story/protests-in-coastal-ghost-town-where-163400m-ships-dont-fit-the-harbour-13346313",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ardrossan-harbour-ayrshire_6882725.jpg?20250411110459",
        "type": "UK",
        "Author": "Connor Gillies",
        "Date Published": "2025-04-11 23:01:00",
        "Headline": "Locals in the coastal town of Ardrossan are protesting today, saying the situation is \"completely and utterly nuts\" after a series of expensive blunders which have plagued the launch of two new ferries to the Isle of Arran.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n Those unfamiliar with Scotland's so-called 'ferry fiasco' would barely believe it is a true story. The new vessels cost quadruple their original price tag, one was delivered seven years late, the other is still being built, and both are too big to fit the main harbour for their daily journeys to and from the Isle of Arran. But in this latest chapter of the scandal, the unbelievable is very much part of the script. And, as Sky News has been hearing, the consequences are brutal. \"It is completely and utterly nuts,\" one exasperated campaigner exclaims as we stand overlooking the deserted Ardrossan Harbour on Scotland's mainland. Ardrossan, on the Ayrshire coast, has been the main port for the ferry service to and from Arran for decades. It is the quickest, most efficient route. But the 30-year-old ferry serving the islands for generations is failing and two new bespoke-designed ones were ordered, with them due to enter service from 2017. The original £100m cost ballooned to £400m, the shipyard was bought by taxpayers amid financial crisis, one vessel finally started carrying passengers in January 2025 while the other is still being built. \n                  Fourth person in court over damage to Trump Turnberry golf resort in Scotland\n                 \n                  Man who murdered taxi driver after being refused cigarette is jailed\n                 \n                  NHS Fife seeking to block public from watching livestream of Sandie Peggie trans row employment tribunal\n                 And to add insult to injury, both are too big for Ardrossan Harbour's jetty to cope with and require an £80m upgrade. In the meantime, services are being diverted along the coast to Troon. Protest as tensions rise in 'ghost town' Ardrossan was promised it would remain the primary port for connectivity to Arran. But now the community is in limbo and is fearing for its future. Christine Cowie, from Save Ardrossan Harbour, told Sky News: \"It is completely and utterly nuts. \"Why anybody would commission a ferry which doesn't fit the harbour for the route it is meant for is crazy. I cannot understand it at all. \"Ardrossan is like an extension of Arran. A lot of people come here to the dentist and use other businesses they don't have on the island which are losing money since the ferries have gone away.\" A botched design process, mismanagement and a string of costly blunders have given the project the label of one of the biggest procurement disasters in the history of Scottish devolution. People from Arran are joining Ardrossan campaigners on the mainland for a protest on Saturday. Hundreds are expected to gather as tensions boil over. The group's chairwoman Frances Gilmour said Ardrossan has become a \"ghost town\". She said: \"It is so quiet. It is spooky. It's frankly a disgrace. Businesses are suffering. \"Economically, this is the route. This is the economic route. We have the infrastructure. We just need the berths fixed.\" The 33-year-old MV Caledonian Isles, which has been away over the winter for extensive repairs, is expected to return to Ardrossan next month. But locals question how reliable and sustainable that vessel is. On the edge of the once bustling harbour carpark is the Bute MOT garage. Manager Scott Revans says they rely on customers from Arran previously hopping off the ferry and leaving their car for repairs at their centre. He told Sky News: \"The harbour is a ghost town. We'd get the passing trade doing whatever customers need from batteries to punctures. It has had an impact on us.\" Could taxpayers pick up the bill? Ardrossan Harbour is owned by private company Peel Ports. The Scottish government is currently exploring buying the port, but the talks are a secret, with campaigners feeling left in the dark. No one involved in the discussions would answer questions from Sky News about when they expect to alert communities to the next steps. Read more from Sky News:Delayed ferry formally begins sailingsFiasco-hit ferry removed from service A spokesman for the Scottish government agency Transport Scotland said: \"We absolutely understand people and communities' views in favour of retaining Ardrossan as the mainland port and remain committed to ensuring the Arran ferry service is fit for the future. \"The Scottish government has instructed officials… to explore options on purchasing Ardrossan Port. \"We will of course update parliament once there is progress and an outcome to report, however, it would be inappropriate to get in the way of these complex and sensitive discussions.\" Jim McSporran, port director at Peel Ports Clydeport, said: \"Peel Ports Group welcomes the Scottish government's statement that it intends to explore the potential purchase of Ardrossan Harbour. \"Regardless of the outcome of this process, our willingness to invest in the harbour remains steadfast. We take comfort that the port continues to operate this lifeline route and that it remains the port of choice for the people and businesses of Arran and Ardrossan.\""
    },
    {
        "title": "Hundreds of barbers, car washes and American sweet shops raided in money laundering crackdown",
        "description": "Hundreds of barber shops and other cash-heavy businesses have been targeted in a three-week money laundering blitz.",
        "url": "https://news.sky.com/story/hundreds-of-barbers-car-washes-and-american-sweet-shops-raided-in-money-laundering-crackdown-13346272",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-nca-operation-machinize_6882639.jpg?20250411154900",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-11 08:01:00",
        "Headline": "The National Crime Agency estimates £12bn of criminal cash is generated in the UK every year. ",
        "Content": " Hundreds of barber shops and other cash-heavy businesses have been targeted in a three-week money laundering blitz. Police went to 265 premises, including vape shops, nail bars, American-themed sweet shops and car washes across England in a crackdown on high street crime. The National Crime Agency (NCA) said 35 arrests were made, 97 people suspected to be victims of modern slavery were placed under police protection, and bank accounts containing more than £1m were frozen. More than £40,000 in cash, some 200,000 cigarettes, 7,000 packs of tobacco, and more than 8,000 illegal vapes were also seized during Operation Machinize, which involved 19 different police forces and regional organised crime units. Officers also found two cannabis farms containing a total of 150 plants, while 10 shops have been shut down. The NCA estimates that £12bn of criminal cash is generated in the UK each year with businesses such as barber shops, vape shops, nail bars, American-themed sweet shops and car washes often used by criminals. Rachael Herbert, deputy director of the National Economic Crime Centre at the NCA, said: \"Operation Machinize targeted barber shops and other high street businesses being used as cover for a whole range of criminality, all across the country. \n                  MPs to debate emergency law to keep British Steel open as prime minister warns national security 'on the line'\n                 \n                  This is a remarkable step by the government - and Donald Trump, China and Reform UK have all played their part\n                 \n                  Michael Gove handed peerage - as Jeremy Hunt and cricketer James Anderson knighted\n                 \"We have seen links to drug trafficking and distribution, organised immigration crime, modern slavery and human trafficking, firearms, and the sale of illicit tobacco and vapes. \"We know cash-intensive businesses are used as fronts for money laundering, facilitating some of the highest harm and highest impact offending in the UK.\" Security minister Dan Jarvis said the operation \"highlights the scale and complexity of the criminality our towns and cities face\". \"High street crime undermines our security, our borders, and the confidence of our communities, and I am determined to take the decisive action necessary to bring those responsible to justice,\" he said."
    },
    {
        "title": "Nursery worker charged over death of 14-month-old Noah Sibanda",
        "description": "A nursery worker has been charged with the manslaughter of a 14-month-old boy in the West Midlands.",
        "url": "https://news.sky.com/story/nursery-worker-charged-over-death-of-14-month-old-noah-sibanda-13346545",
        "image_url": "https://e3.365dm.com/23/01/1920x1080/skynews-fairytales-day-nursery_6015591.jpg?20230105190524",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-11 14:46:00",
        "Headline": "The former owner of the now closed Fairytales Nursery is also charged in relation to the death of the boy in Dudley, West Midlands.",
        "Content": "A nursery worker has been charged with the manslaughter of a 14-month-old boy in the West Midlands. Noah Sibanda died following an incident at the Fairytales Day Nursery in Bourne Street, Dudley, on 9 December 2022. The Crown Prosecution Service (CPS) said it had charged Kimberley Cookson, 22, with gross negligence manslaughter after reviewing evidence supplied by West Midlands Police. Fairytales Nursery Limited has been charged with one count of corporate manslaughter and a health and safety violation, the CPS added. Deborah Latewood, 54, who owned the business, has been charged with one count of failing to comply with general duties under the Health and Safety at Work Act. Read more from Sky News:Michael Gove handed peerageFamily die in helicopter crashTommy Robinson challenges prison sentence Malcolm McHaffie, head of the CPS's special division, said: \"Our thoughts remain with the family of Noah Sibanda at this time. \n                  MPs to debate emergency law to keep British Steel open as prime minister warns national security 'on the line'\n                 \n                  This is a remarkable step by the government - and Donald Trump, China and Reform UK have all played their part\n                 \n                  Michael Gove handed peerage - as Jeremy Hunt and cricketer James Anderson knighted\n                 \"The Crown Prosecution Service reminds all concerned that criminal proceedings against these defendants are active and that they have the right to a fair trial. \"It is extremely important that there should be no reporting, commentary or sharing of information online which could in any way prejudice these proceedings.\" The defendants are due to appear at Dudley Magistrates' Court on Tuesday 13 May. Fairytales Nursery is no longer in business."
    },
    {
        "title": "Tommy Robinson challenges prison sentence at Court of Appeal ",
        "description": "Tommy&#160;Robinson is challenging his sentence for contempt of court on compassionate grounds, claiming his segregation in prison means he can't \"regulate his emotions\".",
        "url": "https://news.sky.com/story/tommy-robinson-challenges-prison-sentence-at-court-of-appeal-13346390",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-tommy-robinson-folkestone_6727529.jpg?20241025152007",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-11 10:57:00",
        "Headline": "Robinson, whose real name is Stephen Yaxley-Lennon, was jailed for 18 months for contempt of court. ",
        "Content": "Tommy Robinson is challenging his sentence for contempt of court on compassionate grounds, claiming his segregation in prison means he can't \"regulate his emotions\". The 42-year-old was jailed for 18 months in October last year after admitting 10 breaches of a High Court order made in 2021 that banned him from repeating false allegations against a Syrian refugee who successfully sued him for libel. A film called Silenced, containing the libellous allegations, was pinned to the top of Robinson's profile on X and shown at a demonstration in Trafalgar Square, while he also repeated the claims in interviews. Robinson, whose real name is Stephen Yaxley-Lennon, was told his sentence would be shortened by four months if he \"purged\" the contempt by removing the claims from his social media accounts. His lawyer Alisdair Williamson KC told the Court of Appeal that Robinson has suffered an \"evident decline in his mental health\" after being held in segregation at Woodhill prison in Milton Keynes. \"He is being kept safe by the authorities in segregation, but being kept safe is making him ill,\" he said. The court heard Robinson is suffering from complex PTSD and has been diagnosed with ADHD, and his barrister said his prison conditions mean he can't \"regulate his emotions\". \n                  MPs to debate emergency law to keep British Steel open as prime minister warns national security 'on the line'\n                 \n                  This is a remarkable step by the government - and Donald Trump, China and Reform UK have all played their part\n                 \n                  Michael Gove handed peerage - as Jeremy Hunt and cricketer James Anderson knighted\n                 The court heard his phone contact has been restricted \"because of the way he conducted himself on the telephone\" on two occasions. Aidan Eardley KC, for the Solicitor General, said it is \"in his gift\" for Robinson to shorten his own sentence, meaning he would be released at the end of May, by removing the film from social media and preventing its dissemination. But he said Robinson \"remains defiantly in breach\" of the order with further publication of his film occurring \"every time it is viewed\" and is asking for an \"indulgence\". Robinson previously lost a bid to bring a High Court challenge over his segregation after intelligence suggested he \"would be killed by a lifer if located on a wing\". The court heard details of his privileges, including hundreds of emails, dozens of visits and 1,250 phone calls. The Court of Appeal on Friday was told he orders his daily meals on a laptop and has a television \"but complains he can't watch GB News on it\". Read more from Sky News:Mother jailed for murdering two sonsBarbers, car washes and sweet shops raided Robinson twice held up a sign to the camera, which said a statement from the governor of HMP Woodhill was \"lies\". The judges Lord Justice Edis, Baroness Carr and Lord Justice Warby reserved judgment, which will be delivered on a date to be fixed. Robinson is due to be released on 26 July."
    },
    {
        "title": "Man who murdered taxi driver after being refused cigarette is jailed",
        "description": "A serial criminal who murdered a stranger after being refused a cigarette has been jailed for at least 16 years after being prosecuted under special double jeopardy laws.",
        "url": "https://news.sky.com/story/man-who-murdered-taxi-driver-after-being-refused-cigarette-is-jailed-13346305",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-steven-greig-police-scotland_6882658.jpg?20250411100917",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-04-11 09:07:00",
        "Headline": "Mark Ward relied on round-the-clock nursing care and was unable to properly speak or digest food due to the severity of his disabilities caused by the attack - before dying a year later.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n A serial criminal who murdered a stranger after being refused a cigarette has been jailed for at least 16 years after being prosecuted under special double jeopardy laws. Steven Greig, 47, left taxi driver Mark Ward severely disabled and requiring 24-hour care following a brutal assault in Dundee in April 2022. Greig was under the influence of drugs when he pushed Mr Ward down a grassy embankment, causing the victim to strike his head off the road. While lying defenceless on the ground, Greig repeatedly kicked his stricken victim. A judge told a court Greig walked away \"without stopping or showing any concern\", leaving Mr Ward \"to his fate\". Lady Drummond stated: \"This was a senseless, violent, unprovoked attack on Mr Ward, who was a stranger to you.\" Mr Ward suffered catastrophic brain injuries and later required life-saving surgery. \n                  'Devoted daughter' avoids prison after 'mercy killing' of terminally ill father\n                 \n                  Weezer bassist's wife shot and arrested on suspicion of attempted murder\n                 \n                  Daughter's plea for help to solve mother's murder 30 years ago\n                 The Crown Office and Procurator Fiscal Service (COPFS) said Mr Ward subsequently relied on round-the-clock nursing care and was unable to properly speak or digest food due to the severity of his disabilities. In January 2023, Greig was sentenced to five years and four months in prison after pleading guilty to a charge of assault to severe injury, permanent impairment, permanent disfigurement and danger of life. However, three months later and one year on from the initial attack, Mr Ward died at the age of 55 at Ninewells Hospital. After a post-mortem examination found a direct link between the assault and Mr Ward's death, Crown Counsel instructed that Greig be indicted for murder under the Double Jeopardy (Scotland) Act 2011. Greig admitted culpable homicide but went on trial for murder and was convicted at the High Court in Dundee in January. He returned to the dock at the High Court in Edinburgh on Thursday, where he was handed a mandatory life sentence with at least 16 years behind bars. Lady Drummond acknowledged a victim impact statement from Mr Ward's sister and brother-in-law. The judge said: \"They describe him as a much-loved, highly intelligent, social and family man. He had been in employment all his life and a taxi driver for the last 20 years. \"The impact of the severe injuries you inflicted left him fully dependent on others for his care. \"Those injuries and his subsequent death had a devastating impact on his parents, sisters, brothers-in-law, nieces and wider family. They have been left in shock, enduring distress and with deep loss.\" Read more from Sky News:Family die in sightseeing helicopter crash'Gringo hunter' shot dead by US fugitive in Mexico Lady Drummond highlighted Greig's \"adverse childhood circumstances\" and noted the father-of-two had abused drugs from an early age. But the judge stated Greig was on five bail orders at the time of the offence, adding: \"You have a long criminal record dating from 1993 to 2022. \"Your record of offending began when you were 13, coming before the courts aged 16 and continued unabated over 34 years.\" Despite having been offered \"many community disposals\", the judge said Greig had continually \"failed to engage and make long-term change\". Lady Drummond also acknowledged the criminal justice and social work report, in which the author described Greig as \"having shown no meaningful remorse\" for his actions. Moira Orr, who leads on homicide and major crime for COPFS, said: \"This is a rare situation where someone has already previously been convicted of a crime and is prosecuted again under the same circumstances but for a different crime. \"As prosecutors, we have worked hard to deliver justice for Mark Ward and his family in what have been particularly traumatic circumstances for them since the assault in April 2022. Our thoughts remain with them at this time. \"Steven Greig's appalling actions robbed a much-loved family man of his life following a shocking attack. He will now serve a lengthy prison sentence for his crime.\""
    },
    {
        "title": "British Steel employees express fears over future of Scunthorpe plant",
        "description": "MPs are set to debate emergency legislation to keep the British Steel plant in Scunthorpe open in a move that would pave the way for nationalisation.",
        "url": "https://news.sky.com/story/british-steel-employees-express-fears-over-future-of-scunthorpe-plant-13346832",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-steve-woodcock_6883532.jpg?20250411225307",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-11 20:28:00",
        "Headline": "People who work at the steelworks have told Sky News they hope it will be nationalised as MPs prepare to debate legislation about taking over the site.",
        "Content": "MPs are set to debate emergency legislation to keep the British Steel plant in Scunthorpe open in a move that would pave the way for nationalisation. The rare Saturday sitting of parliament will come after Jingye, the steelwork's Chinese owner, cancelled orders for the raw materials needed to keep the UK's last blast furnaces running. Jingye also rejected a £500m state rescue package in a move which raised fresh doubts about the 3,500 jobs at the Lincolnshire plant - with it feared the site would be forced to close as early as next week. Follow live: Politics updates Here we speak to current employees of the steelworks about how they feel about the uncertainty over its future. 'A lot of anxiety on the steelworks' Steve, who did not give his surname, works for British Steel and believes it's important for the plant to be taken into public ownership. \n                  MPs to debate emergency law to keep British Steel open as prime minister warns national security 'on the line'\n                 \n                  This is a remarkable step by the government - and Donald Trump, China and Reform UK have all played their part\n                 \n                  Michael Gove handed peerage - as Jeremy Hunt and cricketer James Anderson knighted\n                 He said: \"If the government doesn't step up and nationalise British steel in some form, they're basically sending us back down to the Stone Age. \"We will not be in a position where we can produce pure iron, pure steel, with all the conflicts going on in the world and all the rest of it. \"And if you don't have them furnaces, you're going to be tied to a barrel with the rest of the world charging you what they want to charge you to produce steel.\" He added: \"I don't believe the Chinese have got any interest in keeping the place open.\" Steve said as an employee he has seen \"a lot of anxiety on the steelworks\" and continued: \"A lot of people are worried about losing their houses, their mortgages... it's not a good situation to be in at the moment.\" 'We've been through a lot of turmoil' Steve Woodcock, a lead engineer at the steelworks, said the \"Chinese need to go\" and the government should nationalise the plant. He said: \"The government need to step in, start leading it from the front and then we can move forward. The country needs us... We want to be there for the country. \"We've been let down I think by a lot of companies over the years... we have been through a lot of turmoil over the years... so the government definitely need to step in.\" Asked how he feels about the future of his job, he said: \"I don't want anybody to lose their job. We've got a lot of skilled people and that's why I want it to stay like that. I'm passionate about the business, as everybody that works there that I know is. \"I don't want to get a job elsewhere. I enjoy the job that I do there.\" 'A really scary situation' Martin Grimbleby has worked at the plant for 20 years and is concerned about losing his job. He continued: \"I've got a young family... They're saying to me 'what's going to happen, dad, if the place shuts?' Are we going to have to move house?' \"It's just a really scary situation. I'm at an age where I don't want to be going to go for another interview or anything like that. \"To me, it was a job for life and it was a job for me to look after my family. \"My father worked there before me, I just don't know what's going to happen.\" Asked what he thinks the impact would be if the plant had to close, he replied: \"It would destroy this place. \"It might as well be a waste site after that. Once the steelworks shuts, that is it. There's nothing left of Scunthorpe after the steelworks. In my opinion, nothing.\" Mr Grimbleby also believes the best thing for the plant for now is \"pure government nationalisation\". Scunthorpe 'as a town will end' if plant closes Steve Brown does not work at the plant but said he knows a lot of retired former employees who are \"devastated\" about the problems facing the steelworks. He also knows apprentices who are learning their trade at the plant and added: \"They're 18 to 20 years old - it's devastating for them because if it closes, which I understand it's not going to because I've heard the government is going to take it on and nationalise it, but if they don't, Scunthorpe as a town will end.\" Mr Brown added he thinks it's a shame the legislation being debated on Saturday stops short of full nationalisation. He continued: \"It's not just the steelworkers... it's all the companies that support them and rely on their business.\" Mr Brown added he was \"devastated\" when Jingye took over the steelworks and he does not think it \"should ever have happened\". He said: \"I said from day one that all the Chinese want to do is learn how to make brilliant steel, like we've always done in Scunthorpe, and as soon as they learn how to do it, take it back to China and close British Steel down - and that's exactly what's happening, because imported steel is rubbish.\""
    },
    {
        "title": "US envoy meets Putin for talks - as Trump urges Russia to 'get moving' on Ukraine",
        "description": "Donald Trump's special envoy Steve Witkoff has met Vladimir Putin for talks in Russia - as the US president called on Moscow to \"get moving\" with ending the war in Ukraine.",
        "url": "https://news.sky.com/story/putin-meets-us-envoy-for-talks-as-trump-calls-for-russia-to-get-moving-to-end-war-in-ukraine-13346557",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-vladimir-putin-steve-witkoff_6883275.jpg?20250411183229",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-11 15:30:00",
        "Headline": "Despite Russia playing down expectations of a breakthrough at the talks, Sky's Ivor Bennett believes the meeting - Mr Witkoff's third with Vladimir Putin this year - is significant as a sign of the Trump administration's \"increasing frustration at the lack of progress\".",
        "Content": " Donald Trump's special envoy Steve Witkoff has met Vladimir Putin for talks in Russia - as the US president called on Moscow to \"get moving\" with ending the war in Ukraine. Mr Witkoff, who has been pressing the Kremlin to accept a truce, visited Mr Putin in St Petersburg after earlier meeting the Russian leader's international co-operation envoy Kirill Dmitriev. Mr Putin was shown on state TV greeting Mr Witkoff at the city's presidential library at the start of the latest discussions about the search for a peace deal on Ukraine. Before Friday's meeting, Kremlin spokesman Dmitry Peskov played down expectations of a breakthrough and told state media the visit would not be \"momentous\". Follow the latest updates on the war in Ukraine However, Sky News Moscow correspondent Ivor Bennett said he believes the meeting - Mr Witkoff's third with Mr Putin this year - is significant as a sign of the Trump administration's \"increasing frustration at the lack of progress on peace talks\". Moscow correspondent This is the third time Steve Witkoff has met Vladimir Putin but it's the first time we've actually seen them shaking hands and talking face-to-face. And that itself feels significant.\n Their previous meetings over the past couple of months have been away from the cameras, but this time the Kremlin made the conscious decision to film the moment and publicise it. I think it reflects how confident Russia feels right now in these negotiations - regarding the war in Ukraine and its relationship with the US. Witkoff was in St Petersburg to push for a peace deal, with the White House apparently growing frustrated at the lack of progress. But judging by the footage, Vladimir Putin was quite clearly the dominant figure in the meeting. He was the one leading and the more relaxed, while Witkoff appeared more like an embarrassed fanboy rather than a tough negotiator. And the Kremlin has released this footage knowing that it'll be splashed all over state media here and news bulletins abroad. I think there are two aims. One is to show the Russian public that despite the talk from the Trump administration that they are calling the shots, it's actually the Kremlin in control. And the other is to taunt Ukraine, saying that we - Russia and America - are the ones who will decide your future, not you. Earlier on Friday, Mr Trump issued his latest social media statement on trying to end the war, writing on Truth Social: \"Russia has to get moving. Too many people ere [sic] DYING, thousands a week, in a terrible and senseless war - A war that should have never happened, and wouldn't have happened, if I were President!!!\" Dialogue between the US and Russia, aimed at agreeing a ceasefire ahead of a possible peace deal to end the war, has recently appeared to have stalled over disagreements around conditions for a full pause. Read more:Prince Harry visits war victims in UkraineTwo Chinese citizens captured during fighting, Zelenskyy says Secondary sanctions could be imposed on countries that buy Russian oil, Mr Trump has said, if he feels Moscow is dragging its feet on a deal. Mr Putin has said he is ready in principle to agree a full ceasefire, but argues crucial conditions have yet to be agreed - and that what he calls the root causes of the war have yet to be addressed. The Russian president wants to dismantle Ukraine as an independent, functioning state and has demanded Kyiv recognise Moscow's annexation of Crimea and other partly occupied areas, and pull its forces out, as well as a pledge for Ukraine to never join NATO and for the size of its army to be limited. Zelenskyy renews support calls after attack on home city  Meanwhile, Ukrainian president Volodymyr Zelenskyy has renewed his appeals for more Patriot air defence systems after the deaths of 20 people, including nine children, who were killed when a Russian missile hit apartment buildings and a playground in his home city of Kryvyi Rih last week. Speaking online at a meeting of the so-called Ramstein group of about 50 nations that provide military support to Ukraine, named after a previous meeting at America's Ramstein air base in Germany in 2022, Mr Zelenskyy said recent Russian attacks showed Moscow was not ready to accept and implement any realistic and effective peace proposals. Mr Zelenskyy also made his evening address to the nation, saying: \"Ukraine is not just asking - we are ready to buy appropriate additional systems.\" The UK's defence secretary, John Healy, has said this is \"the critical year\" for Ukraine - and has confirmed £450m in funding for a military support package."
    },
    {
        "title": "President Duda says Trump best chance for Ukraine peace - and urges allies to stay calm over tariffs 'shock therapy' ",
        "description": "Poland's outgoing President Andrzej Duda has kept few revelations for the final weeks of his presidency. ",
        "url": "https://news.sky.com/story/president-duda-says-trump-best-chance-for-ukraine-peace-and-urges-allies-to-stay-calm-over-tariffs-shock-therapy-13346892",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-duda-president-poland_6883564.jpg?20250412005108",
        "type": "World",
        "Author": "Diana Magnay",
        "Date Published": "2025-04-11 23:01:00",
        "Headline": "Andrzej Duda tells Sky News he hopes a huge US military base in Poland - nicknamed 'Fort Trump' - will end up becoming a reality.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n Poland's outgoing President Andrzej Duda has kept few revelations for the final weeks of his presidency.  Ten years in office - a tenure spanning Donald Trump's first and current term - his admiration for the incumbent leader of the free world remains undimmed. As is his conviction that Ukraine's only chance of peace lies with the US leader. In an interview with Sky News in the presidential palace in Warsaw, President Duda described Mr Trump's tariff policy as \"shock therapy\", a negotiating tactic from a man \"of huge business and commercial success\" that he now brings to the arena of politics. That may not be what European politicians are used to, Mr Duda says, but Donald Trump is answerable to the US taxpayer and not to his European counterparts, and allies must \"stay calm\" in the face of this new transatlantic modus operandi. As for negotiations with Vladimir Putin, President Duda is sure that Donald Trump has the measure of the Russian leader, while refusing to be drawn on the competencies of his chief negotiator Steve Witkoff who landed on Friday in Moscow for further talks with Vladimir Putin - a man Mr Witkoff has described as \"trustworthy\" and \"not a bad guy\". Putting the kybosh on Nord Stream 2 in his first term and thwarting President Putin's energy ambitions via his state-owned energy giant Gazprom are evidence enough that Mr Trump knows where to hit so it hurts, Mr Duda says. Given the failures of Europe's leaders to negotiate peace through the Minsk accords, he believes the onus now falls on Donald Trump. \n                  Inside a NATO base in Poland - as residents bordering Russia say 'scare tactic' is needed\n                 \n                  'New reality' of landmine use in Europe\n                 \n                  Auschwitz survivor: 'You worked until you could work no more - then you went to the chimney'\n                 \"If anyone is able to force the end of Russia's war, it is most likely only the President of the United States,\" he says. \"The question is whether he will be determined enough to do that in a way - because it is also very important here in Europe being a neighbour of Russian aggression against Ukraine - that the peace is fair and lasting.\"  President Duda has just weeks left in office before the country votes for a new president in May. Originally from Poland's conservative Law and Justice party, one of the few points of alignment with the liberal and euro-centric prime minister Donald Tusk is the emphasis both place on security. Hopes for 'Fort Trump' base So did the announcement this week that the US would be withdrawing from the Jasionka air base near Rzeszow, which is the key logistics hub for allied support into Ukraine, come as a shock to the president, as it did to many Poles? Not at all, Mr Duda says. \"We were warned that the change was planned. I have not received any information from [the US] about decreasing the number of American soldiers. Quite the opposite.\" He referred back to talks with US defence secretary Pete Hegseth in February, saying: \"We discussed strengthening the American presence in Poland, and I mentioned the idea of creating a huge base of US troops. Then, we called it Fort Trump. I do still hope that this idea will be implemented.\" Read more:Eyewitness: Inside Polish NATO base on frontline with Russia Andrzej Duda has staked his legacy on close ties with Donald Trump at a time when many NATO allies are considering a form of de-Americanisation, as they consider new trading realities and build up their own defence capabilities. Poland has proven itself a model in terms of defence spending, investing more than any other NATO member - a massive 4.7% of GDP for 2025. But as the case of Canada shows, even the best of friendships can turn sour. The Canadian conservative party, once dubbed a maple MAGA, was flying high in the polls before Donald Trump decided to savage links with his closest trading partner. Now in the space of just a few months they are floundering behind the ruling liberal party. Is this a cautionary tale for Poland's conservative Law and Justice party? \"For Canadian conservatives it is a kind of side effect of President Trump's very tough economic policy,\" Mr Duda says. \"In Poland, this does not have such an impact. The security issues are the most important. That's the most important issue in Poland.\""
    },
    {
        "title": "Ksenia Karelina: Ballerina arrives home in US after 'nightmare' of Russian penal colony",
        "description": "A former ballerina who spent more than a year in a Russian jail for donating &#163;40 to a charity supporting Ukraine has returned home to the US after being freed in a prisoner exchange.",
        "url": "https://news.sky.com/story/ksenia-karelina-hugs-and-smiles-as-ballerina-jailed-in-russia-arrives-home-in-us-after-prisoner-exchange-13346287",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ksenia-karelina-andrews_6882552.jpg?20250411075546",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-11 08:27:00",
        "Headline": "The 34-year-old US-Russian citizen was accused of treason over a £40 donation to a charity that provides aid to Ukraine after being arrested while visiting family in Russia last year.",
        "Content": " A former ballerina who spent more than a year in a Russian jail for donating £40 to a charity supporting Ukraine has returned home to the US after being freed in a prisoner exchange. Ksenia Karelina landed at Joint Base Andrews in Maryland at around 11pm, local time, on Thursday. A smiling Ms Karelina was greeted on the runway by her fiance, the professional boxer Chris van Heerden, and given flowers by Morgan Ortagus, President Donald Trump's deputy special envoy to the Middle East. China hits back in US tariffs row - latest Van Heerden said in a statement he was \"overjoyed to hear that the love of my life, Ksenia Karelina, is on her way home from wrongful detention in Russia. \"She has endured a nightmare for 15 months and I cannot wait to hold her. Our dog, Boots, is also eagerly awaiting her return.\" He thanked Mr Trump and his envoys, as well as prominent public figures who had championed her case, including Dana White, a friend of Mr Trump and CEO of the Ultimate Fighting Championship (UFC). \n                  US envoy meets Putin for talks - as Trump urges Russia to 'get moving' on Ukraine\n                 \n                  Donald Trump undergoes annual medical check-up - but report likely to be scarce on details\n                 \n                  Fourth person in court over damage to Trump Turnberry golf resort in Scotland\n                 Ms Karelina, 34, a US-Russian citizen also identified as Ksenia Khavana, was accused of treason when she was arrested in Yekaterinburg, in southwestern Russia, while visiting family in February last year. Investigators searched her mobile phone and found she made a $51.80 (£40) donation to Razom, a charity that provides aid to Ukraine, on the first day of Russia's invasion in 2022. She admitted the charge at a closed trial in the city in August last year and was later jailed for 12 years, to be served in a penal colony. At a cabinet meeting on Thursday, Mr Trump, who wants to normalise relations with Moscow, said the Kremlin \"released the young ballerina and she is now out, and that was good. So we appreciate that\". He said the release followed conversations with Russian President Vladimir Putin. Russian security services accused her of \"proactively\" collecting money for a Ukrainian organisation that was supplying gear to Kyiv's forces. The First Department, a Russian rights group, said the charges stemmed from a $51.80 donation to a US charity aiding Ukraine. Washington, which had called her case \"absolutely ludicrous\", released Arthur Petrov, who it was holding on charges of smuggling sensitive microelectronics to Russia, in the prisoner swap in Abu Dhabi. Read more:Children die in helicopter crashWolf of Wall St defends Trump23C possible in UK on Friday Karelina was among a growing number of Americans arrested in Russia in recent years as tensions between Moscow and Washington spiked over the war in Ukraine. Her release is the latest in a series of high-profile prisoner exchanges Russia and the US carried out in the last three years - and the second since Mr Trump took office. White House national security adviser Mike Waltz said members of the Trump administration \"continue to work around the clock to ensure Americans detained abroad are returned home to their families\"."
    },
    {
        "title": "'Gringo hunter' shot dead by US fugitive in Mexico",
        "description": "An elite Mexican police officer from its so-called \"Gringo Hunters\" unit has been shot dead by a fugitive they were trying to arrest.",
        "url": "https://news.sky.com/story/gringo-hunter-shot-dead-by-us-fugitive-in-mexico-13346251",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-abigail-esparza-reyes_6882572.jpg?20250411083548",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-11 07:11:00",
        "Headline": "Mexican police commander Abigail Esparza Reyes was fatally shot while trying to track down a US fugitive in Tijuana, authorities say.",
        "Content": "An elite Mexican police officer from its so-called \"Gringo Hunters\" unit has been shot dead by a fugitive they were trying to arrest. The dedicated team of elite officers follows and detains US criminals and suspects who are hiding in Mexico. It had been trying to pin down a man in the northern Mexican border city of Tijuana, authorities said, when the man opened fire. The head of the regional unit in Baja California state, 33-year-old Abigail Esparza Reyes, was hit in the shoot out. Reyes, who had led the regional team for eight years and carried out more than 400 operations on US fugitives in Mexico, died from the injury. According to local media reports, the target of the Gringo Hunters was Cesar Hernandez, a convicted murderer who escaped from a California courthouse in December. Upon arriving for a court appearance, Hernandez managed to jump out of the van and run away, the California Department of Corrections and Rehabilitation confirmed at the time. \n                  US envoy meets Putin for talks - as Trump urges Russia to 'get moving' on Ukraine\n                 \n                  Investigators looking into reports flock of birds spotted near New York helicopter crash site\n                 \n                  President Duda says Trump best chance for Ukraine peace - and urges allies to stay calm over tariffs 'shock therapy' \n                 He was serving an 80-year life sentence but could have become eligible for parole. Following the shoot out in Mexico on Wednesday, Hernandez again managed to getaway, this time in disguise as a worker, local media reported. For decades, suspects on the run in the US have crossed the border into Mexico. In 2002 the Latin American country set up in cooperation with US law enforcement a dedicated squad to track down fugitives who cross the border. The highly trained team has gained prominence in recent years and will be the subject of a new crime drama TV series expected on Netflix later this year. Baja California state governor Marina del Pilar paid tribute to the killed police officer on social media. \"Abigail's life will be honoured, and her death will not go unpunished,\" she said."
    },
    {
        "title": "Will Katy Perry sing in space - and will the all-female Blue Origin rocket crew count as astronauts?",
        "description": "It's been more than 60 years since a woman travelled into space without a man. And now six of them are blasting off from Earth.",
        "url": "https://news.sky.com/story/will-katy-perry-sing-in-space-and-will-the-all-female-blue-origin-rocket-crew-count-as-astronauts-13345042",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-space-blue-origin_6882943.png?20250411135414",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-11 23:01:00",
        "Headline": "A popstar, a journalist, a civil rights activist, rocket scientist and filmmaker are heading into space. And the mission is being led by Lauren Sanchez, an author and the fiance of Amazon's Jeff Bezos.",
        "Content": "It's been more than 60 years since a woman travelled into space without a man. And now six of them are blasting off from Earth. Popstar Katy Perry, author Lauren Sanchez, journalist and TV presenter Gayle King, civil rights activist Amanda Nguyen, former rocket scientist Aisha Bowe and filmmaker Kerianne Flynn are due to launch in Jeff Bezos' Blue Origin rocket on Sunday. It will be the latest flight of the New Shepard programme, named NS-31, and is aiming to \"create a lasting impact that will inspire generations\", with the women forming the first all-female crew since Russian engineer Valentina Tereshkova's solo flight to space in 1963. The trip is only expected to last around 11 minutes, with the reusable self-driving rocket taking off from Launch Site One in west Texas, at 8.30am local time (2.30pm BST) on Monday. It will reach a maximum height of 100km (62 miles) above Earth, with the women technically entering space as the capsule crosses the Karman line, which is internationally recognised as the boundary of space. They will not, however, be classed as astronauts by the Federal Aviation Administration, NASA or US military, which all have different eligibility requirements for people to become commercial astronauts. While in space, the crew will have about four minutes of weightlessness to float around and take in the views of Earth from the capsule's large windows. The crew capsule will then descend back to Earth using three parachutes. So far, 52 people have been taken into space as part of billionaire and Amazon chief Mr Bezos's programme, including the man himself, who joined the New Shepard's maiden voyage in 2021. Star Trek actor William Shatner became the oldest person in space when he joined the mission at the age of 90. How the crew was picked Mr Bezos' fiancee is leading the mission. Sanchez told Elle magazine she chose her fellow crew members because each had \"proven their ability to inspire others\". She said all the women will be able to spread the word on what they felt like during the trip, and also expand on ideas of what the next generation of space explorers will look like. Perry, who is one of the best-selling music artists of all time, told Elle that she has been wanting to go to space for almost 20 years, so it was a no-brainer when she got the call. She said: \"Even when Blue Origin was first talking about commercial travel to space, I was like, 'Sign me up! I'm first in line'. And then they called me, and I was like, 'Really? I get an invite?'.\" For King, who is best known as the co-host of US breakfast show CBS Mornings, the decision wasn't quite so easy. \"When I got the call from Lauren and Jeff, my first reaction was a no,\" she said, adding that she still has \"a lot of trepidation\" ahead of the trip. Bowe, a former NASA rocket scientist and chief executive of technology company STEMBoard, said she feels like she has been \"training for and waiting for this moment [her] entire life\", while civil rights activist Nguyen and film producer Flynn both said the opportunity was a dream come true. \"I can't wait to touch down on Earth and share what we bring back with the world,\" Flynn said. Glammed-up astronauts? As well as making history by being the first all-female crew in space, the women may also be the first group of astronauts to have their hair and makeup done for a mission. \"Who would not get glam before the flight,\" Sanchez said, before joking that fake eyelashes would be \"flying round the capsule\".  Bowe said she had already tested out the hairstyle she plans to have on launch day - by skydiving in Dubai. \"I think it's so important for people to see us like that,\" Nguyen said. \"This dichotomy of engineer and scientist, and then beauty and fashion. We contain multitudes. Women are multitudes. I'm going to be wearing lipstick.\" Perry put it another way: \"We are going to put the 'ass' in astronaut.\" The women also shared details of what they plan to take to space, including the original flag from Apollo 12 - the second mission to the moon - a stuffed animal, shells from Malaysia, and conch chowder, the national dish of The Bahamas, which Bowe grew up eating. Read more:Is Bezos chasing down Musk in the billionaire space race?SpaceX tourists return to Earth As a singer, Perry said she feels like she should perform while floating above the Earth, which would make her the first artist to sing in space. She added that she is also taking part in the flight for her daughter Daisy Dove Bloom, who she shares with British actor Orlando Bloom, to teach her that \"any type of person can reach their dreams\"."
    },
    {
        "title": "Defence secretary warns this is 'the critical year' for Ukraine - as £450m in funding allocated",
        "description": "The defence secretary has said that 2025 is \"the critical year\" for Ukraine as he confirmed &#163;450m in funding for a military support package.",
        "url": "https://news.sky.com/story/defence-secretary-warns-this-is-the-critical-year-for-ukraine-as-163450m-in-funding-allocated-13346314",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-john-healey-ukraine_6882677.jpg?20250411102201",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-11 09:13:00",
        "Headline": "The money will fund repairs to and maintenance of UK-provided materials and equipment already given to Ukraine, as well as radar systems, anti-tank mines and hundreds of thousands of drones.",
        "Content": "The defence secretary has said that 2025 is \"the critical year\" for Ukraine as he confirmed £450m in funding for a military support package. The funding includes £350m from this year's previously announced pot of £4.5bn in financial support, while the rest of the cash is being provided by Norway via the UK-led International Fund for Ukraine. The money will fund repairs to and maintenance of UK-provided materials and equipment already given to Ukraine, as well as radar systems, anti-tank mines and hundreds of thousands of drones. Follow the latest on the war in Ukraine here It was announced on Friday by Defence Secretary John Healey, who is in Brussels chairing a meeting of the Ukraine Contact Group alongside his German counterpart Boris Pistorius. The group is an alliance of about 50 countries - all 32 NATO member states, including the US, and about 20 other nations - that has been supporting Ukraine by sending military equipment there since April 2022, a few weeks after Russia launched its full-scale invasion. Speaking at the start of the meeting, Mr Healey warned: \"2025 is the critical year for the war in Ukraine, and this is the critical moment. \"A moment for our defence industries to step up, and they are; a moment for our militaries to step up, and they are; a moment for our governments to step up, and they are. \"Together, we are sending a signal to Russia and we are saying to Ukraine that we stand with you in the fight and we will stand with you in the peace.\" At a news conference following the talks, Mr Healey told journalists that Ukraine's allies have agreed to provide a \"record boost\" €21bn (£18.2bn) in total of military support for Kyiv. The German defence minister confirmed that US secretary of defence, Pete Hegseth, attended virtually, while special envoy Steve Witkoff travelled to Moscow, which Mr Pistorius insisted was not a matter of \"priorities\", but of \"schedules\".  'Coalition of the willing' planning continues The meeting comes one day after the UK defence secretary and his French counterpart Sebastien Lecornu led 30 defence ministers from the \"coalition of the willing\" in Brussels. The group, which does not include the US, discussed operational plans on Thursday afternoon for a multinational peacekeeping force in Ukraine. It looked at each nation's capabilities and how they could be best used to support Ukraine's long-term defence and security as part of what the Ministry of Defence called a \"reassurance force\". UK and French military chiefs discussed planning with Ukrainian President Volodymyr Zelenskyy and his military chiefs in Kyiv last weekend. Peace negotiations are ongoing between the US and Russia, however, US officials appear to be growing increasingly impatient with the lack of progress after Donald Trump publicly suggested a month ago that Vladimir Putin wants to end the war.  Last Tuesday, the Kremlin described the latest US peace proposal as unacceptable in its current form because it does not solve the \"root causes\" of the conflict. Read more:Two Chinese citizens 'fighting for Russia' captured in UkraineZelenskyy makes dig at US over response to Russian attack Mr Putin wants to dismantle Ukraine as an independent, functioning state and has demanded Kyiv recognise Moscow's annexation of Crimea and other partly occupied areas and pull its forces out, as well as a pledge for Ukraine to never join NATO and to demilitarise. US secretary of state Marco Rubio said on Friday that Mr Trump is not \"going to fall into the trap of endless negotiations\" with Moscow. Despite the apparent impasse in talks, the coalition of the willing is continuing with its plans for when peace is agreed."
    },
    {
        "title": "Menendez brothers' resentencing hearing can go ahead next week, says judge",
        "description": "The Menendez brothers' bid for freedom through resentencing can continue with the hearing scheduled for Thursday, a judge has ruled.",
        "url": "https://news.sky.com/story/menendez-brothers-resentencing-hearing-can-go-ahead-next-week-says-judge-13346541",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-erik-menendez-lyle-menendez_6883058.jpg?20250411155722",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-11 14:51:00",
        "Headline": "The Menendez brothers were sentenced to life after being convicted of murdering their parents, Jose and Kitty, at their Beverly Hills home in 1989. A Netflix drama series and documentary thrust them back into the spotlight last year, leading to renewed calls for their release.",
        "Content": "The Menendez brothers' bid for freedom through resentencing can continue with the hearing scheduled for Thursday, a judge has ruled. Lyle, 57, and Erik, 54, received life sentences without the possibility of parole after being convicted of murdering their parents, Jose and Kitty Menendez, at their Beverly Hills home in 1989. Lyle was 21 at the time, Erik was 18. Last year, Los Angeles district attorney George Gascon asked a judge to change the brothers' sentence from life without the possibility of parole to 50 years to life. That would make them immediately eligible for parole because they committed the crime when they were younger than 26. But Mr Gascon's successor Nathan Hochman submitted a motion last month to withdraw the resentencing request, saying the brothers must fully acknowledge lies they told about the murder of their parents before he would support their release from prison. Separately, Governor Gavin Newsom, who has the power to commute their sentences, has asked the parole board to consider whether the brothers would represent a public safety risk if released. In light of Mr Hochman's opposition, Los Angeles County Superior Court judge Michael Jesic ruled on Friday that the court can move forward with the hearing. \"Everything you argued today is absolutely fair game for the resentencing hearing next Thursday,\" he said. From prison, the brothers watched through a video link and could be seen in court seated next to each other in blue. Speaking after the hearing, the brothers' lawyer said: \"Today is a good day. Justice won over politics.\" Prosecutors accused the brothers of killing their parents for a multimillion-dollar inheritance, although their defence team argued they acted out of self-defence after years of sexual abuse by their father. The brothers have maintained their parents abused them since they were first charged with the murders. A Netflix drama series and subsequent documentary about the brothers thrust them back into the spotlight last year, and led to renewed calls for their release - including from some members of their family."
    },
    {
        "title": "Donald Trump undergoes annual medical check-up - but report likely to be scarce on details",
        "description": "Donald Trump has had his annual medical check-up, although the US president has consistently chosen to keep basic facts about his health secret.",
        "url": "https://news.sky.com/story/donald-trump-undergoes-annual-medical-check-up-but-report-likely-to-be-scarce-on-details-13346542",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-white-house_6883130.jpg?20250411171459",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-11 14:53:00",
        "Headline": "The US president, who is reluctant to share medical information, has had his annual physical check-up.",
        "Content": "Donald Trump has had his annual medical check-up, although the US president has consistently chosen to keep basic facts about his health secret. There is no guarantee the public will be told about the health of a man who, at the age of 78, was the oldest in US history to be sworn in as president. \"I have never felt better, but nevertheless, these things must be done!\" Mr Trump posted on his social media site. He will be examined at Walter Reed National Military Medical Centre in Washington DC, but he will have leeway over what details are released. If history is repeated, his latest physical examination is likely to produce a flattering report that is scarce on details. It represents the first potential opportunity to discover the status of Mr Trump's health since an assassination attempt against him in Butler, Pennsylvania, in July last year. At that time, Ronny Jackson, a staunch supporter who served as his White House doctor, wrote a memo describing a gunshot wound to Mr Trump's right ear. He once joked that the president could live to be 200 if he had a healthier diet. \n                  US envoy meets Putin for talks - as Trump urges Russia to 'get moving' on Ukraine\n                 \n                  Fourth person in court over damage to Trump Turnberry golf resort in Scotland\n                 \n                  Head of US base in Greenland, Colonel Susan Meyers, sacked after criticising JD Vance's remarks during his visit\n                 Despite Mr Trump promising in a CBS interview last August that he would \"very gladly\" release his medical records, he never did.  During President Biden's time in office, medical reports have typically included vital statistics like height, weight, heart rate, blood pressure and cholesterol results, along with any medical symptoms. Other checks have included the vital organs and a neurological assessment. Mr Trump has offered few details about his health over the years, despite repeatedly questioning the physical and mental capacity of his predecessor Mr Biden, who is three years older. In 2020, President Trump contracted COVID-19. After his recovery, more details emerged that he had been sicker than he had let on. In November 2023, Mr Trump's doctor released a letter to coincide with Mr Biden's 81st birthday, saying Mr Trump was in \"excellent\" physical and mental health. Read more:Meet Donald Trump's doctorsKey questions about Trump's health It said that his \"physical exams were well within the normal range and his cognitive exams were exceptional\", adding he had \"reduced his weight\". But there were a lot of details missing, including weight, blood pressure and cholesterol levels, or the results of any tests. Trump takes anti-baldness pills During his first term in office, his first medical check-up as president included details of his daily anti-baldness pills. But subsequent medical examinations were less transparent. In November 2019, Mr Trump underwent a medical examination which was not revealed until three days later. He would only say it was a \"very routine physical\". A year later, an examination found he was technically obese and was taking medication to treat high cholesterol. Before Mr Trump first ran for office in 2015, the results of a medical examination were described as \"astonishingly excellent\" by his personal doctor. Dr Harold Bornstein stated at the time that Mr Trump would be the \"healthiest individual ever elected to the presidency.\" The doctor later admitted to CNN that Mr Trump had dictated those words to him."
    },
    {
        "title": "Menendez brothers' resentencing hearing can go ahead next week, says judge",
        "description": "The Menendez brothers' bid for freedom through resentencing can continue with the hearing scheduled for Thursday, a judge has ruled.",
        "url": "https://news.sky.com/story/menendez-brothers-resentencing-hearing-can-go-ahead-next-week-says-judge-13346541",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-erik-menendez-lyle-menendez_6883058.jpg?20250411155722",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-11 14:51:00",
        "Headline": "The Menendez brothers were sentenced to life after being convicted of murdering their parents, Jose and Kitty, at their Beverly Hills home in 1989. A Netflix drama series and documentary thrust them back into the spotlight last year, leading to renewed calls for their release.",
        "Content": "The Menendez brothers' bid for freedom through resentencing can continue with the hearing scheduled for Thursday, a judge has ruled. Lyle, 57, and Erik, 54, received life sentences without the possibility of parole after being convicted of murdering their parents, Jose and Kitty Menendez, at their Beverly Hills home in 1989. Lyle was 21 at the time, Erik was 18. Last year, Los Angeles district attorney George Gascon asked a judge to change the brothers' sentence from life without the possibility of parole to 50 years to life. That would make them immediately eligible for parole because they committed the crime when they were younger than 26. But Mr Gascon's successor Nathan Hochman submitted a motion last month to withdraw the resentencing request, saying the brothers must fully acknowledge lies they told about the murder of their parents before he would support their release from prison. Separately, Governor Gavin Newsom, who has the power to commute their sentences, has asked the parole board to consider whether the brothers would represent a public safety risk if released. In light of Mr Hochman's opposition, Los Angeles County Superior Court judge Michael Jesic ruled on Friday that the court can move forward with the hearing. \"Everything you argued today is absolutely fair game for the resentencing hearing next Thursday,\" he said. From prison, the brothers watched through a video link and could be seen in court seated next to each other in blue. Speaking after the hearing, the brothers' lawyer said: \"Today is a good day. Justice won over politics.\" Prosecutors accused the brothers of killing their parents for a multimillion-dollar inheritance, although their defence team argued they acted out of self-defence after years of sexual abuse by their father. The brothers have maintained their parents abused them since they were first charged with the murders. A Netflix drama series and subsequent documentary about the brothers thrust them back into the spotlight last year, and led to renewed calls for their release - including from some members of their family."
    },
    {
        "title": "Ex-Abercrombie & Fitch chief executive Mike Jeffries 'unfit to stand trial due to dementia', prosecutors and defence team say",
        "description": "Abercrombie & Fitch's former chief executive is not fit to stand trial on sex trafficking charges as he is suffering from dementia, both prosecutors and his lawyers have said.",
        "url": "https://news.sky.com/story/ex-abercrombie-fitch-chief-executive-mike-jeffries-unfit-to-stand-trial-due-to-dementia-prosecutors-and-defence-team-say-13346723",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-mike-jeffries-abercrombie_6727988.jpg?20241025213234",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-11 18:21:00",
        "Headline": "Mike Jeffries, who led fashion retailer Abercrombie & Fitch from 1992 to 2014, pleaded not guilty to federal sex trafficking and interstate prostitution charges in October, and was released on a $10m (£7.65m) bond.",
        "Content": "Abercrombie & Fitch's former chief executive is not fit to stand trial on sex trafficking charges as he is suffering from dementia, both prosecutors and his lawyers have said. Mike Jeffries has Alzheimer's disease, Lewy body dementia and the \"residual effects of a traumatic brain injury\", his defence attorneys wrote in a letter filed at a federal court in Central Islip, New York. The 80-year-old needs around-the-clock care, they added, citing evaluations by medical professionals. Prosecutors and defence lawyers are calling for Jeffries to be placed in the custody of the federal bureau of prisons for up to four months. They say he should be admitted to hospital to have treatment that could allow his criminal case to proceed. The business tycoon, who led fashion retailer A&F from 1992 to 2014, pleaded not guilty to federal sex trafficking and interstate prostitution charges in October, and was released on a $10m (£7.65m) bond. A total of 15 men allege they were induced by \"force, fraud and coercion\" to engage in drug-fuelled sex parties. Prosecutors have accused Jeffries, his partner Matthew Smith, and the couple's alleged \"recruiter\" James Jacobson, of luring men to parties in New York City, the Hamptons and other locations, by dangling the prospect of modelling for A&F advertisements. Smith and Jacobson have also pleaded not guilty to the charges against them. 'Progressive and incurable' In their latest letter on Jeffries' health, his defence lawyers said at least four medical professionals had concluded his cognitive issues are \"progressive and incurable\", and that he will not \"regain his competency and cannot be restored to competency in the future\". These issues \"significantly impair\" his ability to understand the charges against him, they wrote. Read more from Sky News:Tech executive and family die after helicopter crashes in New York'Wolf of Wall Street' speaks to Sky News about Trump tariffs \"The progressive nature of his neurocognitive disorder ensures continued decline over time, further diminishing his already limited functional capacity,\" said Dr Alexander Bardey, a forensic psychiatrist, and Dr Cheryl Paradis, a forensic psychologist, following evaluations made in December. \"It is, therefore, our professional opinion, within a reasonable degree of psychological and psychiatric certainty, that Mr Jeffries is not competent to proceed in the current case and cannot be restored to competency in the future.\" Jeffries left A&F in 2014 after leading the company for more than two decades, taking the retailer from a hunting and outdoor goods store founded in 1892 to a fixture of early 2000s fashion. His lawyers did not immediately respond to requests by the Associated Press news agency for comment. The US attorney's office for the eastern district of New York declined to comment."
    },
    {
        "title": "Head of US base in Greenland, Colonel Susan Meyers, sacked after criticising JD Vance's remarks during his visit",
        "description": "The head of the US military base in Greenland has been fired for criticising Washington's agenda for the Arctic island.",
        "url": "https://news.sky.com/story/head-of-us-base-in-greenland-colonel-susan-meyers-sacked-after-criticising-jd-vances-remarks-during-his-visit-13346424",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-susannah-meyers-colonel_6882781.jpg?20250411114923",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-11 11:42:00",
        "Headline": "Ms Meyers fell below the standard of neutrality required of commanders, according to the Pentagon, after saying Mr Vance's critique of Denmark over its handling of Greenland was \"not reflective of Pituffik Space Base\".",
        "Content": " The head of the US military base in Greenland has been fired for criticising Washington's agenda for the Arctic island. Colonel Susan Meyers distanced herself from remarks made by vice president JD Vance when he visited the Pituffik base on 28 March. Ms Meyers, commander of the 821st Space Base Group, emailed all base personnel on 31 March, days after Mr Vance's visit, Military.com said. She told them she \"spent the weekend thinking about Friday's visit - the actions taken, the words spoken, and how it must have affected each of you\". \"I do not presume to understand current politics, but what I do know is the concerns of the US administration discussed by vice president Vance on Friday are not reflective of Pituffik Space Base.\" The US Space Force said in a statement issued late on Thursday that commanders \"are expected to adhere to the highest standards of conduct, especially as it relates to remaining non-partisan in the performance of their duties\". Mr Vance condemned Denmark's oversight of the island and told Greenlanders they would be better off as part of the US. \n                  US envoy meets Putin for talks - as Trump urges Russia to 'get moving' on Ukraine\n                 \n                  Donald Trump undergoes annual medical check-up - but report likely to be scarce on details\n                 \n                  Fourth person in court over damage to Trump Turnberry golf resort in Scotland\n                 US President Donald Trump has called for the territory to be absorbed by Washington, saying it is essential for both national and international security, and refusing to rule out using military force to acquire it. As well as having staff from the US and Greenland, the base employs Danes and Canadians, according to Military.com. Chief Pentagon spokesman Sean Parnell said on X that actions which \"subvert President Trump's agenda will not be tolerated at the Department of Defence\". The dismissal of Ms Meyers, base commander since July, was welcomed by Republican senator Eric Schmitt, who praised the \"quick action\" of defence secretary Pete Hegseth. Another Republican senator, Jim Banks, accused Colonel Meyers of trying to \"politicise the Space Force\". Greenland is a territory of Denmark, and while there is support for independence among Greenlanders, polls suggest there is little support for US annexation, just as there was little appetite for the visit of the vice president and his wife. Read more:How Greenlanders view Trump's threatsWhy does Trump want Greenland?Arctic plans a challenge for Europe Mr Vance criticised Denmark, claiming that incursions by China and Russia had put the territory at risk. He told Copenhagen it had \"not done a good job by the people of Greenland. You have underinvested in the people of Greenland, and you have underinvested in the security of this incredible, beautiful landmass\". His remarks were widely condemned."
    },
    {
        "title": "'Wolf of Wall Street' Jordan Belfort breaks silence on Trump's tariffs",
        "description": "'Wolf of Wall Street' Jordan Belfort has told Sky News there's \"no way\" Donald Trump is guilty of insider trading or market manipulation.",
        "url": "https://news.sky.com/story/no-way-trump-guilty-of-inside-trading-says-wolf-of-wall-street-jordan-belfort-13346196",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jordan-belfort-wolf_6882341.jpg?20250410220602",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-11 02:24:00",
        "Headline": "Mr Belfort - famously played by Leonardo DiCaprio in the hit movie - says Democrats criticising the president are just trying to \"earn brownie points with the media and their party\".",
        "Content": " 'Wolf of Wall Street' Jordan Belfort has told Sky News there's \"no way\" Donald Trump is guilty of insider trading or market manipulation. Opponents say the president has questions to answer after he said it was a \"great time to buy\" shares - four hours before the stock market surged on Wednesday when he paused tariffs. Mr Belfort told Gillian Joseph the fact Mr Trump made the statement on social media meant it was public, rather than him tipping off a few people. Tariffs latest: Trump - 'everything will be beautiful in the end' Speaking on The World programme, Mr Belfort said: \"I personally don't find it overly suspicious. Especially since he's told it to everybody at once. \"If he hadn't said anything and told five of his best friends 'I'm gonna ease this tariff situation - you should be buying', that would be illegal.\" Insider trading is when people take advantage of non-public information to buy or sell shares and make a gain. \n                  Donald Trump undergoes annual medical check-up - but report likely to be scarce on details\n                 \n                  Investigators looking into reports flock of birds spotted near New York helicopter crash site\n                 \n                  Menendez brothers' resentencing hearing can go ahead next week, says judge\n                 The former stockbroker was famously played by Leonardo DiCaprio in the film about his early life and admitted crimes related to stock manipulation. Mr Belfort said Mr Trump's post was just repeating what the president had said previously, and that buying when share prices plunge is a well-known investment move.  \"He had been saying that all along [to buy], it wasn't the only time he'd said that,\" said Mr Belfort. \"[Treasury] Secretary Bessent had been saying that too. It's a really basic piece of advice.\" Stock markets around the world plunged dramatically on Monday due to the start of America's wide-ranging tariffs on imports from around the world. The world economy was rattled again just two days later when the president said nearly all of the taxes would go on hold for 90 days. The key S&P 500 index jumped nearly 10% - a huge daily increase.  Rival Democrat politicians say Mr Trump's encouragement to buy raises \"grave ethics concerns\". Some are calling for an urgent inquiry into whether any of his family or administration officials benefited by dealing in the stock market ahead of time. The White House said the president's post was simply reassuring Americans \"about their economic security in the face of nonstop media fearmongering\". Mr Belfort accused Democrat figures of trying to \"earn brownie points with the media and their party\". 'Not gonna be pretty' Despite the mid-week surge, turbulence in stock markets appears far from over - chiefly because China and the US remain locked in a tariffs stare down. American indexes closed down again on Thursday, Japan's Nikkei fell about 5% early on Friday, and Hong Kong stocks are heading for their worst week since 2008. Gold meanwhile, considered a \"safe haven\" asset, has climbed to a record price and earlier today passed the $3,200/oz level for the first time. Mr Belfort told Sky News that while he was against tariffs generally, President Trump's dramatic intervention was necessary as the US has an \"insane\" trade imbalance and imports far more than it exports. \"The United States has been drained of its wealth, drained of its factories,\" he said. \"It's not gonna be pretty,\" added Mr Belfort. \"There's going to be pain - but the path we were on before is simply unsustainable. It had to change.\"  He said he was sceptical over fears the tariffs will hit US consumers hard, with some predicting goods - including popular items such as the iPhone - could jump in price if costs are passed on. The former trader said he believes firms would shift production from China, which is subject to a tariff of more than 100%, to places such as India, and that exemptions would eventually be agreed. He also gave the thumbs up to Elon Musk's controversial government efficiency role which has forced thousands of jobs cut. Read more:China ready for trade war and it's unclear Trump knows what he's taking onTrump has blinked - but it's not the markets that forced him to act \"I love what is being done because the amount of abuse and waste and fraud, it's absolutely insane,\" said Mr Belfort. \"It's a great thing that's happening. Obama talked about doing it, Clinton tried it; this is not a new idea to try to make the government more efficient.\" If Mr Musk leaves or quits in the near future, as is rumoured, Mr Belfort said the world's richest man has installed \"some very seasoned business people that really care about the country\"."
    },
    {
        "title": "China-US tariff war could be reaching stalemate, but more danger lingers",
        "description": "China's most recent retaliation raises the stakes, but it does so within what are now relatively predictable parameters.",
        "url": "https://news.sky.com/story/china-us-tariff-war-could-be-reaching-stalemate-but-more-danger-lingers-13346350",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-yiwu-market-china_6882754.jpg?20250411112314",
        "type": "US",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-04-11 10:05:00",
        "Headline": "Tariffs have soared so high that any further increases will make little difference. But the leaders could escalate tensions in other ways.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n China's most recent retaliation raises the stakes, but it does so within what are now relatively predictable parameters. The latest tariff hike follows the pattern we have seen throughout the week, when Chinese retaliation has exactly matched what Donald Trump has done. There is, however, one key difference to the announcement this time. China has said that anything further is just a \"numbers game\" and they will simply ignore any subsequent raises from Trump. There's a sense they are calling time on what has felt like a relentless tit-for-tat escalation. They are right, of course. Once tariffs exceed 50% or so, trade is basically impossible anyway and the numbers don't make any substantive difference. \n                  China is ready for trade war with the US - and it's not clear Trump knows what he's taking on\n                 \n                  China believes capitulating to Trump on tariffs serves no purpose and isn't an option\n                 \n                  Day 81: Can the US and China avoid an all-out trade-war?\n                 But there are big questions about whether this move successfully enforces a stalemate of sorts. Trump could either just leave things as they are (perhaps with a nominal raise in the tariff numbers so he can be seen to have the last word), or he could opt to raise the stakes by invoking some other form of non-tariff measure on China. Read more: The more 'nuclear' option China could pick in trade war Regardless of whether any such measure was economic or political, China would almost certainly want to be seen to respond - and escalation over non-trade issues has the potential to be far more dangerous geopolitically. Even in the event of a stalemate, whether either side is in the mood to come to the negotiating table is another matter altogether. A truce makes it marginally more likely, but trust between the two is arguably at an all-time low and this moment still feels perilous."
    },
    {
        "title": "'Gringo hunter' shot dead by US fugitive in Mexico",
        "description": "An elite Mexican police officer from its so-called \"Gringo Hunters\" unit has been shot dead by a fugitive they were trying to arrest.",
        "url": "https://news.sky.com/story/gringo-hunter-shot-dead-by-us-fugitive-in-mexico-13346251",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-abigail-esparza-reyes_6882572.jpg?20250411083548",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-11 07:11:00",
        "Headline": "Mexican police commander Abigail Esparza Reyes was fatally shot while trying to track down a US fugitive in Tijuana, authorities say.",
        "Content": "An elite Mexican police officer from its so-called \"Gringo Hunters\" unit has been shot dead by a fugitive they were trying to arrest. The dedicated team of elite officers follows and detains US criminals and suspects who are hiding in Mexico. It had been trying to pin down a man in the northern Mexican border city of Tijuana, authorities said, when the man opened fire. The head of the regional unit in Baja California state, 33-year-old Abigail Esparza Reyes, was hit in the shoot out. Reyes, who had led the regional team for eight years and carried out more than 400 operations on US fugitives in Mexico, died from the injury. According to local media reports, the target of the Gringo Hunters was Cesar Hernandez, a convicted murderer who escaped from a California courthouse in December. Upon arriving for a court appearance, Hernandez managed to jump out of the van and run away, the California Department of Corrections and Rehabilitation confirmed at the time. \n                  US envoy meets Putin for talks - as Trump urges Russia to 'get moving' on Ukraine\n                 \n                  Investigators looking into reports flock of birds spotted near New York helicopter crash site\n                 \n                  President Duda says Trump best chance for Ukraine peace - and urges allies to stay calm over tariffs 'shock therapy' \n                 He was serving an 80-year life sentence but could have become eligible for parole. Following the shoot out in Mexico on Wednesday, Hernandez again managed to getaway, this time in disguise as a worker, local media reported. For decades, suspects on the run in the US have crossed the border into Mexico. In 2002 the Latin American country set up in cooperation with US law enforcement a dedicated squad to track down fugitives who cross the border. The highly trained team has gained prominence in recent years and will be the subject of a new crime drama TV series expected on Netflix later this year. Baja California state governor Marina del Pilar paid tribute to the killed police officer on social media. \"Abigail's life will be honoured, and her death will not go unpunished,\" she said."
    },
    {
        "title": "Ksenia Karelina: Ballerina arrives home in US after 'nightmare' of Russian penal colony",
        "description": "A former ballerina who spent more than a year in a Russian jail for donating &#163;40 to a charity supporting Ukraine has returned home to the US after being freed in a prisoner exchange.",
        "url": "https://news.sky.com/story/ksenia-karelina-hugs-and-smiles-as-ballerina-jailed-in-russia-arrives-home-in-us-after-prisoner-exchange-13346287",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ksenia-karelina-andrews_6882552.jpg?20250411075546",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-11 08:27:00",
        "Headline": "The 34-year-old US-Russian citizen was accused of treason over a £40 donation to a charity that provides aid to Ukraine after being arrested while visiting family in Russia last year.",
        "Content": " A former ballerina who spent more than a year in a Russian jail for donating £40 to a charity supporting Ukraine has returned home to the US after being freed in a prisoner exchange. Ksenia Karelina landed at Joint Base Andrews in Maryland at around 11pm, local time, on Thursday. A smiling Ms Karelina was greeted on the runway by her fiance, the professional boxer Chris van Heerden, and given flowers by Morgan Ortagus, President Donald Trump's deputy special envoy to the Middle East. China hits back in US tariffs row - latest Van Heerden said in a statement he was \"overjoyed to hear that the love of my life, Ksenia Karelina, is on her way home from wrongful detention in Russia. \"She has endured a nightmare for 15 months and I cannot wait to hold her. Our dog, Boots, is also eagerly awaiting her return.\" He thanked Mr Trump and his envoys, as well as prominent public figures who had championed her case, including Dana White, a friend of Mr Trump and CEO of the Ultimate Fighting Championship (UFC). \n                  US envoy meets Putin for talks - as Trump urges Russia to 'get moving' on Ukraine\n                 \n                  Donald Trump undergoes annual medical check-up - but report likely to be scarce on details\n                 \n                  Fourth person in court over damage to Trump Turnberry golf resort in Scotland\n                 Ms Karelina, 34, a US-Russian citizen also identified as Ksenia Khavana, was accused of treason when she was arrested in Yekaterinburg, in southwestern Russia, while visiting family in February last year. Investigators searched her mobile phone and found she made a $51.80 (£40) donation to Razom, a charity that provides aid to Ukraine, on the first day of Russia's invasion in 2022. She admitted the charge at a closed trial in the city in August last year and was later jailed for 12 years, to be served in a penal colony. At a cabinet meeting on Thursday, Mr Trump, who wants to normalise relations with Moscow, said the Kremlin \"released the young ballerina and she is now out, and that was good. So we appreciate that\". He said the release followed conversations with Russian President Vladimir Putin. Russian security services accused her of \"proactively\" collecting money for a Ukrainian organisation that was supplying gear to Kyiv's forces. The First Department, a Russian rights group, said the charges stemmed from a $51.80 donation to a US charity aiding Ukraine. Washington, which had called her case \"absolutely ludicrous\", released Arthur Petrov, who it was holding on charges of smuggling sensitive microelectronics to Russia, in the prisoner swap in Abu Dhabi. Read more:Children die in helicopter crashWolf of Wall St defends Trump23C possible in UK on Friday Karelina was among a growing number of Americans arrested in Russia in recent years as tensions between Moscow and Washington spiked over the war in Ukraine. Her release is the latest in a series of high-profile prisoner exchanges Russia and the US carried out in the last three years - and the second since Mr Trump took office. White House national security adviser Mike Waltz said members of the Trump administration \"continue to work around the clock to ensure Americans detained abroad are returned home to their families\"."
    },
    {
        "title": "MPs to debate emergency law to keep British Steel open as prime minister warns national security 'on the line'",
        "description": "MPs will today debate emergency laws to save British Steel after the prime minister warned the country's \"economic and national security is on the line\".",
        "url": "https://news.sky.com/story/mps-to-debate-emergency-law-to-keep-british-steel-open-as-prime-minister-warns-national-security-on-the-line-13346516",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-blast-furnace-conway_6875399.jpg?20250404000520",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-11 14:08:00",
        "Headline": "MPs and Lords will return to parliament for a rare Saturday sitting after the prime minister said the future of British Steel \"hangs in the balance\".",
        "Content": " MPs will today debate emergency laws to save British Steel after the prime minister warned the country's \"economic and national security is on the line\". Sir Keir Starmer said the future of the company's Scunthorpe plant - which employs about 3,500 people - \"hangs in the balance\" after its owner said the cost of running it was unsustainable. The prime minister said legislation would be passed in one day to allow the government to \"take control of the plant and preserve all viable options\". Follow latest: Live politics updates MPs and Lords are being summoned from their Easter recess to debate the move and will sit from 11am. The last time parliament was recalled was on 18 August 2021 to debate the situation in Afghanistan. The government has been considering nationalising British Steel after Jingye, the Chinese owner, cancelled future orders for iron ore, coal and other raw materials needed to keep the blast furnaces running. \n                  This is a remarkable step by the government - and Donald Trump, China and Reform UK have all played their part\n                 \n                  Defence secretary warns this is 'the critical year' for Ukraine - as £450m in funding allocated\n                 \n                  Michael Gove handed peerage - as Jeremy Hunt and cricketer James Anderson knighted\n                 The furnaces are the last in the UK capable of making virgin steel. Jingye last month rejected a £500m state rescue package - raising fresh doubts about the Lincolnshire plant and fears it could close in the coming days. The steel from the plant is used in the rail network and the construction and automotive industries. Without it, Britain would be reliant on imports at a time of trade wars and geopolitical instability.  In a statement on Friday, Sir Keir said: \"I will always act in the national interest to protect British jobs and British workers. \"This afternoon, the future of British Steel hangs in the balance. Jobs, investment, growth, our economic and national security are all on the line.\" The prime minister said steel was \"part of our national story, part of the pride and heritage of this nation\" and \"essential for our future\". He said the emergency law would give the business secretary powers to do \"everything possible to stop the closure of these blast furnaces\". This includes the power to direct the company's board and workforce. It will also ensure it can order the raw materials to keep the furnaces running and ensure staff are paid. Chancellor Rachel Reeves said the government was \"taking action to save British steel production and protect British jobs\", while Business Secretary Jonathan Reynolds said the owner had left the government with \"no choice\". Mr Reynolds said Jingye had confirmed plans to close the Scunthorpe furnaces immediately despite months of talks and the offer of £500m of co-investment. The company said it had invested £1.2bn since taking over in 2020, but that the plant is losing £700,000 a day. Read more:Govt intervention in British Steel 'a remarkable step' - analysis  Conservative leader Kemi Badenoch said the government had landed itself in a \"steel crisis entirely of their own making\". She said when she was business secretary, she had negotiated a plan with British Steel \"to limit job losses and keep the plant running\". Ms Badenoch said the government had \"bungled the negotiations, insisting on a Scunthorpe-only deal that the company has deemed unviable\". She added: \"Keir Starmer should have seen this coming. But instead of addressing it earlier in the week when parliament was sitting, their incompetence has led to a last-minute recall of parliament.\" The Unite union said the prime minister's recalling of parliament was \"absolutely the right thing to do to begin the process of nationalisation\". While the government hasn't confirmed those plans, the chancellor also said earlier this week that \"all options\" are on the table. Sky News understands accountancy firm EY is being lined up to play a role in a nationalisation process. The government's intervention over British Steel comes six months after the last blast furnace was closed at Port Talbot in Wales. Plaid Cymru has questioned why the government didn't take similar action there. The party's Westminster leader, Liz Saville Roberts, said: \"Parliament is being recalled to debate the nationalisation of Scunthorpe steelworks. \"But when global market forces devastated Welsh livelihoods in Port Talbot, Labour dismissed Plaid Cymru's calls for nationalisation as 'pipe dreams'.\""
    },
    {
        "title": "Some good news for the British economy - but the celebration might not last long ",
        "description": "We've been waiting for a while for the Office for National Statistics to deliver us some good news on the British economy - and today it came.",
        "url": "https://news.sky.com/story/some-good-news-for-the-british-economy-but-the-celebration-might-not-last-long-13346301",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rachel-reeves-chancellor_6882657.jpg?20250411100720",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-04-11 08:55:00",
        "Headline": "The chancellor will be buoyed by news the economy grew by more than expected in February - but celebrations will be short lived.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n We've been waiting for a while for the Office for National Statistics to deliver us some good news on the British economy - and today it came. Output grew by 0.5% in February, up from zero growth in January and higher than the 0.1% forecast by economists. Some usual caveats apply. Monthly data can be volatile and prone to revision - but it can go up as well as down. While publishing the latest figures, the ONS also revised up its January figure from -0.1% to zero. It's clear that, across the economy, sectors performed robustly. The big surprise was manufacturing. Business surveys told us that UK factories were on their knees, anxious about Trump's tariffs and impending tax rises that came into effect in April. \n                  UK economy grows - ONS\n                 \n                  Starmer to announce more support for businesses as Trump tariffs take hold\n                 \n                  Living standards boost for households but surge in costs looms large\n                 Yet the production sector grew by 1.5% - led by pharmaceuticals, metals and transport equipment. Businesses have been resilient. The chancellor will be pleased, but the celebrations are likely to be fleeting.  The world has already moved on, with Donald Trump unleashing policy chaos on the global economy. Britain is now facing a 10% tariff on exports to the US and there will be pockets of acute stress, particularly for our car manufacturers, who have been hit with a 25% tariff. They export more to the US than any other country in the world. Indeed, some of the growth in manufacturing may have been driven by businesses rushing to do deals before tariffs came into force. The tariffs alone on the UK will be painful - but the most significant damage is likely to come from a slowdown in the global economy. The US and China are engaged in a tit-for-tat trade war and that will have negative spillovers, especially for an open economy like ours. We won't escape the fallout. Businesses here in the UK might curtail hiring and investment in response, their hesitancy compounded by uncertainty over what Donald Trump might do next. Consumers may also retreat, especially if the pound weakens and imports become more expensive, causing inflationary consequences. So, while we've finally been given something to cheer, darker days beckon. We should enjoy it while it lasts."
    },
    {
        "title": "Hilco and Lakeland management close in on deal for family-owned retailer ",
        "description": "The prolific high street investor Hilco Capital is closing in on a deal to fund a buyout of Lakeland, the family-owned homewares retailer.",
        "url": "https://news.sky.com/story/hilco-and-lakeland-management-close-in-on-deal-for-family-owned-retailer160-13346348",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-lakeland-kitchenware_6867290.jpg?20250326095456",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-11 10:00:00",
        "Headline": "The former owner of HMV is in advanced talks about an agreement to back a management-led takeover of the 61 year-old homewares retailer, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The prolific high street investor Hilco Capital is closing in on a deal to fund a buyout of Lakeland, the family-owned homewares retailer. Sky News has learnt that Hilco, which has backed retailers including HMV and Superdry, and Lakeland's management are in advanced talks with its shareholders about a deal to take control of the 61 year-old business.  A deal could be formally agreed in the coming days, according to insiders.  If confirmed, a sale of Lakeland would follow months of talks with a number of potential buyers, including Modella Capital, the firm which recently agreed to buy WH Smith's high street chain.  \n                  MPs to debate emergency law to keep British Steel open as prime minister warns national security 'on the line'\n                 \n                  Some good news for the British economy - but the celebration might not last long \n                 \n                  Ex-Abercrombie & Fitch chief executive Mike Jeffries 'unfit to stand trial due to dementia', prosecutors and defence team say\n                 Lakeland is controlled by the three sons of founder Alan Rayner, and has been seeking tens of millions of pounds of new funding as it faces headwinds including the national insurance hike which came into effect this month.  Established in 1964 as Lakeland Plastics, the company employs roughly 1,000 people across a chain of nearly 60 stores, at its head office in Windermere and its distribution centres.  Sky News revealed in January that the company had hired Teneo as financial advisers to help it explore options.  PricewaterhouseCoopers, the accountancy firm, has been advising HSBC, Lakeland's principal lender, which is expected to end its involvement with the company.  The increase in employers' national insurance has provoked protest from retailers and hospitality businesses, with industry bodies warning that the changes represented a tipping point for many employers.  A Lakeland spokesperson said in January that it was \"considering a number of options to ensure a sustainable and long-term capital structure, which builds on our sixty-year heritage as one of the UK's most innovative homeware retailers\".  Lakeland was founded when Mr Rayner began selling plastic bags for home freezing from his family garage in the Lake District.  It now sells more than 4,000 home and kitchen products.  Accounts filed at Companies House for 2023 warned that it entered that year \"facing the most challenging economic conditions for several decades with high inflation leading to falls in demand for many traditional categories\".  Sales during the year were broadly flat at £153m, with Lakeland's auditors warning of a \"material uncertainty…[about] the company's ability to continue as a going concern\".  The accounts added that it completed the renewal of its banking facilities with HSBC after the year-end, comprising a £7.5m revolving credit facility expiring in May 2028 and £10m trade finance facility.  A spokesman for Hilco declined to comment on Friday, while Lakeland has been contacted for comment."
    },
    {
        "title": "Ex-Abercrombie & Fitch chief executive Mike Jeffries 'unfit to stand trial due to dementia', prosecutors and defence team say",
        "description": "Abercrombie & Fitch's former chief executive is not fit to stand trial on sex trafficking charges as he is suffering from dementia, both prosecutors and his lawyers have said.",
        "url": "https://news.sky.com/story/ex-abercrombie-fitch-chief-executive-mike-jeffries-unfit-to-stand-trial-due-to-dementia-prosecutors-and-defence-team-say-13346723",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-mike-jeffries-abercrombie_6727988.jpg?20241025213234",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-11 18:21:00",
        "Headline": "Mike Jeffries, who led fashion retailer Abercrombie & Fitch from 1992 to 2014, pleaded not guilty to federal sex trafficking and interstate prostitution charges in October, and was released on a $10m (£7.65m) bond.",
        "Content": "Abercrombie & Fitch's former chief executive is not fit to stand trial on sex trafficking charges as he is suffering from dementia, both prosecutors and his lawyers have said. Mike Jeffries has Alzheimer's disease, Lewy body dementia and the \"residual effects of a traumatic brain injury\", his defence attorneys wrote in a letter filed at a federal court in Central Islip, New York. The 80-year-old needs around-the-clock care, they added, citing evaluations by medical professionals. Prosecutors and defence lawyers are calling for Jeffries to be placed in the custody of the federal bureau of prisons for up to four months. They say he should be admitted to hospital to have treatment that could allow his criminal case to proceed. The business tycoon, who led fashion retailer A&F from 1992 to 2014, pleaded not guilty to federal sex trafficking and interstate prostitution charges in October, and was released on a $10m (£7.65m) bond. A total of 15 men allege they were induced by \"force, fraud and coercion\" to engage in drug-fuelled sex parties. Prosecutors have accused Jeffries, his partner Matthew Smith, and the couple's alleged \"recruiter\" James Jacobson, of luring men to parties in New York City, the Hamptons and other locations, by dangling the prospect of modelling for A&F advertisements. Smith and Jacobson have also pleaded not guilty to the charges against them. 'Progressive and incurable' In their latest letter on Jeffries' health, his defence lawyers said at least four medical professionals had concluded his cognitive issues are \"progressive and incurable\", and that he will not \"regain his competency and cannot be restored to competency in the future\". These issues \"significantly impair\" his ability to understand the charges against him, they wrote. Read more from Sky News:Tech executive and family die after helicopter crashes in New York'Wolf of Wall Street' speaks to Sky News about Trump tariffs \"The progressive nature of his neurocognitive disorder ensures continued decline over time, further diminishing his already limited functional capacity,\" said Dr Alexander Bardey, a forensic psychiatrist, and Dr Cheryl Paradis, a forensic psychologist, following evaluations made in December. \"It is, therefore, our professional opinion, within a reasonable degree of psychological and psychiatric certainty, that Mr Jeffries is not competent to proceed in the current case and cannot be restored to competency in the future.\" Jeffries left A&F in 2014 after leading the company for more than two decades, taking the retailer from a hunting and outdoor goods store founded in 1892 to a fixture of early 2000s fashion. His lawyers did not immediately respond to requests by the Associated Press news agency for comment. The US attorney's office for the eastern district of New York declined to comment."
    },
    {
        "title": "Nintendo Switch 2 launches straight into Trump's trade war",
        "description": "It was going to be the revivifying event the video games industry desperately needed - instead, thanks to Donald Trump's tariffs, the launch of the Nintendo Switch 2 is experiencing a troubled birth.&#160;",
        "url": "https://news.sky.com/story/nintendo-switch-2-launches-straight-into-trumps-trade-war-13346374",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-nintendo-switch-2_6882911.jpg?20250411131951",
        "type": "Business",
        "Author": "Martin Kimber, gaming reporter",
        "Date Published": "2025-04-11 10:39:00",
        "Headline": "China, a significant manufacturing base for the Switch 2, is now subject to a 145% duty on shipments to the US.",
        "Content": "By Martin Kimber, gaming reporter   It was going to be the revivifying event the video games industry desperately needed - instead, thanks to Donald Trump's tariffs, the launch of the Nintendo Switch 2 is experiencing a troubled birth.  Barely had Nintendo announced the pre-order date and price point of the hotly awaited new handheld console when the US president slapped tariffs on China and Vietnam, among others, prompting the Japanese gaming giant to immediately suspend US pre-orders of the Switch 2. Today, Nintendo invited Sky News to be a part of the first group of journalists in the UK to try the console, and get to grips with a product that is fast becoming a totemic casualty of the global trade war. It was already a challenging market for the successor to the third best-selling console of all time, the original Switch, which has sold more than 150 million units. When the Switch first launched in 2017 it had next to no rivals - that landscape now looks very different. Valve Corporation's Steam Deck, whose release was also anything but smooth thanks to supply chain issues caused by Taiwanese semiconductor shortages, has gained considerable market share. Its ability to play most Windows-based games, of which there are many more than for the Switch, and the option to use it in desktop mode - essentially turning it into a handheld PC - made it appealing to consumers looking for a more powerful, versatile unit. \n                  MPs to debate emergency law to keep British Steel open as prime minister warns national security 'on the line'\n                 \n                  Some good news for the British economy - but the celebration might not last long \n                 \n                  Hilco and Lakeland management close in on deal for family-owned retailer \n                 To make matters worse, few could have expected the extent to which Mr Trump would sanction countries in the Asia Pacific region. China, a significant manufacturing base for the Switch 2, is now subject to 145% American trade tariffs. Vietnamese imports were due to be taxed at 46%, however these were paused for 90 days by Mr Trump following turbulence in the financial markets. Nintendo announced pre-orders in the US would open on the 9 April, with the console costing $449.99 (£395.99 for shoppers in the UK). Read moreBAFTA Games Awards: Full list of winnersExpert predicts GTA VI will cost $100 However, before even a single American order could be placed, pre-orders were indefinitely suspended following sweeping tariffs imposed on east Asian countries by the US on the 4 April. UK consumers are still able to place pre-orders. The delay could well come with further changes for gamers, said Gareth Sutcliffe, Head of Gaming at consultancy Enders Analysis. \"The other significant impact is the tariff consequences on Nintendo’s physical game sales, given they are all produced in Japan, and whether they can be imported as a finished game or as a component.\" He foresees the upset in global trade potentially leading to unprecedented prices for gaming hardware, saying: \"The price points for consoles overall could hasten the decline of this generation of consoles if you suddenly have price points nearing the $1,000 (£764) mark.\" Nintendo’s rivals, Xbox and PlayStation, are not insulated from the trade war because their supply chains also run predominantly through east Asia. Nintendo are hoping to sell 10 million units this year - whether they succeed, may well depend on the whims of the President of the United States of America."
    },
    {
        "title": "China-US tariff war could be reaching stalemate, but more danger lingers",
        "description": "China's most recent retaliation raises the stakes, but it does so within what are now relatively predictable parameters.",
        "url": "https://news.sky.com/story/china-us-tariff-war-could-be-reaching-stalemate-but-more-danger-lingers-13346350",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-yiwu-market-china_6882754.jpg?20250411112314",
        "type": "Business",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-04-11 10:05:00",
        "Headline": "Tariffs have soared so high that any further increases will make little difference. But the leaders could escalate tensions in other ways.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n China's most recent retaliation raises the stakes, but it does so within what are now relatively predictable parameters. The latest tariff hike follows the pattern we have seen throughout the week, when Chinese retaliation has exactly matched what Donald Trump has done. There is, however, one key difference to the announcement this time. China has said that anything further is just a \"numbers game\" and they will simply ignore any subsequent raises from Trump. There's a sense they are calling time on what has felt like a relentless tit-for-tat escalation. They are right, of course. Once tariffs exceed 50% or so, trade is basically impossible anyway and the numbers don't make any substantive difference. \n                  China is ready for trade war with the US - and it's not clear Trump knows what he's taking on\n                 \n                  China believes capitulating to Trump on tariffs serves no purpose and isn't an option\n                 \n                  Day 81: Can the US and China avoid an all-out trade-war?\n                 But there are big questions about whether this move successfully enforces a stalemate of sorts. Trump could either just leave things as they are (perhaps with a nominal raise in the tariff numbers so he can be seen to have the last word), or he could opt to raise the stakes by invoking some other form of non-tariff measure on China. Read more: The more 'nuclear' option China could pick in trade war Regardless of whether any such measure was economic or political, China would almost certainly want to be seen to respond - and escalation over non-trade issues has the potential to be far more dangerous geopolitically. Even in the event of a stalemate, whether either side is in the mood to come to the negotiating table is another matter altogether. A truce makes it marginally more likely, but trust between the two is arguably at an all-time low and this moment still feels perilous."
    },
    {
        "title": "This is a remarkable step by the government - and Donald Trump, China and Reform UK have all played their part",
        "description": "When the sun sets on Scunthorpe this Saturday, the town's steelworks will likely have a new boss - Jonathan Reynolds.",
        "url": "https://news.sky.com/story/this-is-a-remarkable-step-by-the-government-and-donald-trump-china-and-reform-uk-have-all-played-their-part-13346752",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-british-steel-scunthorpe_6883347.jpg?20250411201025",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-04-11 20:09:00",
        "Headline": "The government's response to Donald Trump's stance on tariffs and security has been to emphasise the need to increase the UK's resilience in both business and defence - allowing the Scunthorpe site to close would hardly fit with that narrative.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n  When the sun sets on Scunthorpe this Saturday, the town's steelworks will likely have a new boss - Jonathan Reynolds. The law that parliament will almost certainly approve this weekend hands the business secretary the powers to direct staff at British Steel, order raw materials and, crucially, keep the blast furnaces at the plant open. This is not full nationalisation. But it is an extraordinary step. The Chinese firm Jingye will - on paper - remain the owner of British Steel. But the UK state will insert itself into the corporate set-up to legally override the wishes of the multinational company.  A form of martial law invoked and applied to private enterprise. \n                  Defence secretary warns this is 'the critical year' for Ukraine - as £450m in funding allocated\n                 \n                  MPs to debate emergency law to keep British Steel open as prime minister warns national security 'on the line'\n                 \n                  Michael Gove handed peerage - as Jeremy Hunt and cricketer James Anderson knighted\n                 That will come at a cost to the taxpayer. Follow latest: Live politics updates No number has been specified, but there are wages to pay and orders to make at a site estimated to already be losing £700,000 a day. There is also clear frustration in government at how the Chinese owners have engaged in negotiations around modernising the Scunthorpe site. \"Jingye have not been forthright throughout this process\", said the business secretary in his department's official announcement about the new laws. Time is so tight because of the nature of the steel-making process.  Once switched off, blast furnaces are very hard to turn back on. If this had happened in Scunthorpe - as seemed likely in a matter of days - then it would have been game over. This move keeps the show on the road and opens up more time for talks over the long-term future of the plant. While the official line in Whitehall is that \"all options are on the table\", nationalisation seems increasingly likely. That would need more legislation, if it was done - as seems likely - without the approval of the current owner. Finding an alternative commercial partner has not been ruled out, but one is not waiting in the wings either. As for what that long-term future looks like, with just five years of life left in the Scunthorpe blast furnaces, modernisation is inevitable. Port Talbot's plant saw its blast furnaces closed last year amid a switch to the more environmentally friendly electric arc furnaces and a loss of thousands of jobs. Political figures in Wales are now questioning why nationalisation wasn't on the table for this site. The response from government is that the deal was done by the previous Tory administration and the owners of the South Wales site agreed to the terms. But there is also a sense that this decision over British Steel is being shaped by the domestic and international political context. Labour came to power promising to revitalise left-behind communities and inject a sense of pride back into places still reeling from the loss of traditional industry. With that in mind, it would be politically intolerable to see the UK's last two blast furnaces closed and thousands of jobs lost in a relatively deprived part of the country. Read more from Sky News:Michael Gove handed peerageTickets on sale for Electoral Dysfunction live showBadenoch denies supporting local coalitions Reform UK's position of pushing for full and immediate nationalisation is also relevant, given the party is in electoral pursuit of Labour in many parts of the country where decline in manufacturing has been felt most acutely. The geo-political situation is perhaps more pressing though. Just look at the strength of the prime minister's language in his Downing Street address - \"our economic and national security are all on the line\". The government's reaction to the turmoil caused by President Donald Trump's pronouncements on tariffs and security has been to emphasise the need to increase domestic resilience in both business and defence. Becoming the only G7 nation unable to produce virgin steel at a time when globalisation appears to be in retreat hardly fits with that narrative. It would also present serious practical questions about the ability of the UK to produce steel for defence and the broader switch to green energy production. Then there is the intriguing subplot around US-China trade. While this decision is separate from discussions with the White House on tariffs, one can imagine how a UK move to wrestle control of a site of national importance from its Chinese owner might go down with a US president currently engaged in a fierce trade war with Beijing. This is a remarkable step from the government, but it is more a punctuation mark than a full answer. The tension between manufacturing and decarbonisation remains, as do the challenges presented by a global economy appearing to fragment significantly. But one thing is for sure. As a political parable about changes to traditional industry and the challenges of globalisation, the saga of British Steel is hard to beat."
    },
    {
        "title": "Defence secretary warns this is 'the critical year' for Ukraine - as £450m in funding allocated",
        "description": "The defence secretary has said that 2025 is \"the critical year\" for Ukraine as he confirmed &#163;450m in funding for a military support package.",
        "url": "https://news.sky.com/story/defence-secretary-warns-this-is-the-critical-year-for-ukraine-as-163450m-in-funding-allocated-13346314",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-john-healey-ukraine_6882677.jpg?20250411102201",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-11 09:13:00",
        "Headline": "The money will fund repairs to and maintenance of UK-provided materials and equipment already given to Ukraine, as well as radar systems, anti-tank mines and hundreds of thousands of drones.",
        "Content": "The defence secretary has said that 2025 is \"the critical year\" for Ukraine as he confirmed £450m in funding for a military support package. The funding includes £350m from this year's previously announced pot of £4.5bn in financial support, while the rest of the cash is being provided by Norway via the UK-led International Fund for Ukraine. The money will fund repairs to and maintenance of UK-provided materials and equipment already given to Ukraine, as well as radar systems, anti-tank mines and hundreds of thousands of drones. Follow the latest on the war in Ukraine here It was announced on Friday by Defence Secretary John Healey, who is in Brussels chairing a meeting of the Ukraine Contact Group alongside his German counterpart Boris Pistorius. The group is an alliance of about 50 countries - all 32 NATO member states, including the US, and about 20 other nations - that has been supporting Ukraine by sending military equipment there since April 2022, a few weeks after Russia launched its full-scale invasion. Speaking at the start of the meeting, Mr Healey warned: \"2025 is the critical year for the war in Ukraine, and this is the critical moment. \"A moment for our defence industries to step up, and they are; a moment for our militaries to step up, and they are; a moment for our governments to step up, and they are. \"Together, we are sending a signal to Russia and we are saying to Ukraine that we stand with you in the fight and we will stand with you in the peace.\" At a news conference following the talks, Mr Healey told journalists that Ukraine's allies have agreed to provide a \"record boost\" €21bn (£18.2bn) in total of military support for Kyiv. The German defence minister confirmed that US secretary of defence, Pete Hegseth, attended virtually, while special envoy Steve Witkoff travelled to Moscow, which Mr Pistorius insisted was not a matter of \"priorities\", but of \"schedules\".  'Coalition of the willing' planning continues The meeting comes one day after the UK defence secretary and his French counterpart Sebastien Lecornu led 30 defence ministers from the \"coalition of the willing\" in Brussels. The group, which does not include the US, discussed operational plans on Thursday afternoon for a multinational peacekeeping force in Ukraine. It looked at each nation's capabilities and how they could be best used to support Ukraine's long-term defence and security as part of what the Ministry of Defence called a \"reassurance force\". UK and French military chiefs discussed planning with Ukrainian President Volodymyr Zelenskyy and his military chiefs in Kyiv last weekend. Peace negotiations are ongoing between the US and Russia, however, US officials appear to be growing increasingly impatient with the lack of progress after Donald Trump publicly suggested a month ago that Vladimir Putin wants to end the war.  Last Tuesday, the Kremlin described the latest US peace proposal as unacceptable in its current form because it does not solve the \"root causes\" of the conflict. Read more:Two Chinese citizens 'fighting for Russia' captured in UkraineZelenskyy makes dig at US over response to Russian attack Mr Putin wants to dismantle Ukraine as an independent, functioning state and has demanded Kyiv recognise Moscow's annexation of Crimea and other partly occupied areas and pull its forces out, as well as a pledge for Ukraine to never join NATO and to demilitarise. US secretary of state Marco Rubio said on Friday that Mr Trump is not \"going to fall into the trap of endless negotiations\" with Moscow. Despite the apparent impasse in talks, the coalition of the willing is continuing with its plans for when peace is agreed."
    },
    {
        "title": "MPs to debate emergency law to keep British Steel open as prime minister warns national security 'on the line'",
        "description": "MPs will today debate emergency laws to save British Steel after the prime minister warned the country's \"economic and national security is on the line\".",
        "url": "https://news.sky.com/story/mps-to-debate-emergency-law-to-keep-british-steel-open-as-prime-minister-warns-national-security-on-the-line-13346516",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-blast-furnace-conway_6875399.jpg?20250404000520",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-11 14:08:00",
        "Headline": "MPs and Lords will return to parliament for a rare Saturday sitting after the prime minister said the future of British Steel \"hangs in the balance\".",
        "Content": " MPs will today debate emergency laws to save British Steel after the prime minister warned the country's \"economic and national security is on the line\". Sir Keir Starmer said the future of the company's Scunthorpe plant - which employs about 3,500 people - \"hangs in the balance\" after its owner said the cost of running it was unsustainable. The prime minister said legislation would be passed in one day to allow the government to \"take control of the plant and preserve all viable options\". Follow latest: Live politics updates MPs and Lords are being summoned from their Easter recess to debate the move and will sit from 11am. The last time parliament was recalled was on 18 August 2021 to debate the situation in Afghanistan. The government has been considering nationalising British Steel after Jingye, the Chinese owner, cancelled future orders for iron ore, coal and other raw materials needed to keep the blast furnaces running. \n                  This is a remarkable step by the government - and Donald Trump, China and Reform UK have all played their part\n                 \n                  Defence secretary warns this is 'the critical year' for Ukraine - as £450m in funding allocated\n                 \n                  Michael Gove handed peerage - as Jeremy Hunt and cricketer James Anderson knighted\n                 The furnaces are the last in the UK capable of making virgin steel. Jingye last month rejected a £500m state rescue package - raising fresh doubts about the Lincolnshire plant and fears it could close in the coming days. The steel from the plant is used in the rail network and the construction and automotive industries. Without it, Britain would be reliant on imports at a time of trade wars and geopolitical instability.  In a statement on Friday, Sir Keir said: \"I will always act in the national interest to protect British jobs and British workers. \"This afternoon, the future of British Steel hangs in the balance. Jobs, investment, growth, our economic and national security are all on the line.\" The prime minister said steel was \"part of our national story, part of the pride and heritage of this nation\" and \"essential for our future\". He said the emergency law would give the business secretary powers to do \"everything possible to stop the closure of these blast furnaces\". This includes the power to direct the company's board and workforce. It will also ensure it can order the raw materials to keep the furnaces running and ensure staff are paid. Chancellor Rachel Reeves said the government was \"taking action to save British steel production and protect British jobs\", while Business Secretary Jonathan Reynolds said the owner had left the government with \"no choice\". Mr Reynolds said Jingye had confirmed plans to close the Scunthorpe furnaces immediately despite months of talks and the offer of £500m of co-investment. The company said it had invested £1.2bn since taking over in 2020, but that the plant is losing £700,000 a day. Read more:Govt intervention in British Steel 'a remarkable step' - analysis  Conservative leader Kemi Badenoch said the government had landed itself in a \"steel crisis entirely of their own making\". She said when she was business secretary, she had negotiated a plan with British Steel \"to limit job losses and keep the plant running\". Ms Badenoch said the government had \"bungled the negotiations, insisting on a Scunthorpe-only deal that the company has deemed unviable\". She added: \"Keir Starmer should have seen this coming. But instead of addressing it earlier in the week when parliament was sitting, their incompetence has led to a last-minute recall of parliament.\" The Unite union said the prime minister's recalling of parliament was \"absolutely the right thing to do to begin the process of nationalisation\". While the government hasn't confirmed those plans, the chancellor also said earlier this week that \"all options\" are on the table. Sky News understands accountancy firm EY is being lined up to play a role in a nationalisation process. The government's intervention over British Steel comes six months after the last blast furnace was closed at Port Talbot in Wales. Plaid Cymru has questioned why the government didn't take similar action there. The party's Westminster leader, Liz Saville Roberts, said: \"Parliament is being recalled to debate the nationalisation of Scunthorpe steelworks. \"But when global market forces devastated Welsh livelihoods in Port Talbot, Labour dismissed Plaid Cymru's calls for nationalisation as 'pipe dreams'.\""
    },
    {
        "title": "Michael Gove handed peerage - as Jeremy Hunt and cricketer James Anderson knighted",
        "description": "Veteran cabinet minister Michael Gove has been awarded a peerage in Rishi Sunak's resignation honours list.",
        "url": "https://news.sky.com/story/veteran-cabinet-minister-michael-gove-awarded-peerage-in-rishi-sunaks-resignation-honours-13346250",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-michael-gove-honour_6882649.jpg?20250411142743",
        "type": "Politics",
        "Author": "Ben Bloch",
        "Date Published": "2025-04-11 07:04:00",
        "Headline": "An outgoing prime minister can request that the reigning monarch grants peerages, knighthoods, damehoods or other awards in the British honours system to any number of people.",
        "Content": "\n          Political reporter\n              @realBenBloch\n Veteran cabinet minister Michael Gove has been awarded a peerage in Rishi Sunak's resignation honours list. Mr Gove - now editor of The Spectator magazine - was first elected to parliament in 2005 and immediately joined then-Conservative leader David Cameron's shadow cabinet. He was appointed education secretary when the party entered government in 2010 and held multiple cabinet posts until the 2024 general election, when he stood down from parliament. Mr Sunak elevated seven allies to the House of Lords, including former cabinet ministers Mark Harper, Victoria Prentis, Alister Jack, and Simon Hart. Former chief executive of the Conservative Party, Stephen Massey, also becomes a peer, as well as Eleanor Shawcross, former head of the No10 policy unit. He also awarded a number of honours. It is traditional for prime ministers to award peerages and other gongs upon their resignation from office - with key political allies, donors and staff often rewarded. An outgoing prime minister can request that the reigning monarch grants peerages, knighthoods, damehoods or other awards in the British honours system to any number of people. In the case of peerages, the House of Lords Appointments Commission vets the list, and for other honours, the Cabinet Office conducts checks. \n                  'Not ill at all' young people getting diagnosed with 'fashionable' ADHD, peer claims\n                 \n                  Sue Gray, Sir Keir Starmer's former chief of staff, nominated for peerage\n                 \n                  Syria, Lords, Christmas - Answer the question special\n                 Resignation honours are separate from dissolution honours, which are awarded by the incumbent prime minister and opposition leaders after the dissolution of parliament preceding a general election. Here are the biggest names given honours by Mr Sunak: Michael Gove - peerage From when the Conservatives returned to government in 2010, Michael Gove spent almost the whole time in a ministerial role. After reforming the education system, he went on to hold roles like chief whip, environment secretary, justice secretary and housing secretary. He led the pro-Brexit side of the 2016 referendum alongside Boris Johnson, and famously sunk the latter's leadership bid with his own. However, both failed at that juncture, and Mr Gove's reputation never recovered to allow him another go at the top job. The debt was repaid when Mr Johnson fired Mr Gove as his administration collapsed in 2022. Mr Gove returned to government under Rishi Sunak, and ultimately retired from the Commons at the 2024 election. James Anderson - knighthood One of England's most successful cricketers, Jimmy Anderson, has been awarded a knighthood in avid cricket fan Rishi Sunak's resignation honours list. He is regarded as one of the greatest bowlers in the history of the sport, and holds the record for the most wickets taken by a fast bowler in Test cricket. Jeremy Hunt - knighthood A former chancellor and serial runner-up in Tory leadership competitions, Jeremy Hunt was ever present in Conservative cabinets while the party was in government. He was both foreign secretary and defence secretary before failing to take over the party after Theresa May stood aside. Following a stint on the backbenches, Mr Hunt returned as chancellor under Liz Truss in a bid to stabilise markets - retaining this position under Rishi Sunak. Despite persistent speculation he was set to be ditched in favour of Claire Coutinho, Mr Hunt kept his job until the 2024 general election - where he won his seat and now sits as a backbencher. James Cleverly - knighthood A former leader of the Conservatives in the London Assembly, James Cleverly entered parliament at the 2015 general election as the MP for Braintree. In 2018, he was appointed deputy chairman of the party, and in April 2019, was appointed a minister in the Brexit department. Boris Johnson appointed him as party chairman after taking over the top job, and he took on a succession of junior ministerial posts before becoming education secretary following Mr Johnson's resignation as prime minister. Liz Truss appointed him as foreign secretary - a post he held until November 2023 when Rishi Sunak brought back David Cameron for the role, and he took over as home secretary - a post he held until the general election. Mr Cleverly was one of the lucky cabinet ministers to survive the Labour landslide and retained his seat. But he was less successful in the Conservative Party leadership contest, losing out in the final round of MP voting. Andrew Mitchell - knighthood The former deputy foreign secretary has been a fixture in Westminster since 1987, when he was first elected as the MP for Gedling. He was appointed to the government in 1994, but lost his seat in the 1997 Tony Blair landslide. He returned to parliament in 2001 as the MP for Sutton Coldfield, and took on a number of shadow cabinet and then cabinet roles, culminating in his appointment to the Foreign Office in 2022, before becoming deputy foreign secretary to David Cameron in 2024. He rose to public prominence in September 2012 when he allegedly swore when a police officer told him to dismount his bicycle and leave Downing Street through the pedestrian gate rather than the main gate. The incident became known as \"Plebgate\". Mel Stride - knighthood One of Rishi Sunak's closest aides, he chaired his campaign to be Tory leader against Liz Truss and was rewarded with the Work and Pensions brief when his man finally entered Number 10. He was also a prominent figure in the downfall of Ms Truss as chair of the Treasury select committee - regularly requesting information from the Treasury and Bank of England that highlighted damaging information. A capable media performer, he was ever present during the general election as he tried unsuccessfully to get Mr Sunak back into office. Mr Stride kept his seat after the vote, and was rewarded by Kemi Badenoch with a role as shadow chancellor of the exchequer. Stephen Massey - peerage Described as a \"sensible man\" by former chancellor George Osborne, Stephen Massey was appointed chief executive of the Conservative Party in November 2022 after Rishi Sunak took over as leader in the coronation leadership contest following the collapse of the Truss government. Having spent his career as a financial adviser, Mr Sunak probably thought he was a safe pair of hands in which to entrust the leadership of the party machinery as they built their war chest ahead of the general election to come. The personal donations of £343,000 to the party and £25,000 to Mr Sunak's leadership campaign also likely made him an attractive candidate for the job. Has Rishi Sunak previously awarded honours? Mr Sunak previously granted peerages to former prime minister Theresa May, Sir Graham Brady, the former chairman of the influential Conservative backbench 1922 committee, as well as his right-hand man Liam Booth-Smith on 4 July 2024 - the day of the general election. He lost the election by a landslide to Sir Keir Starmer's Labour Party, and resigned as prime minister that day. He remains in parliament as the MP for Richmond and Northallerton."
    },
    {
        "title": "Some good news for the British economy - but the celebration might not last long ",
        "description": "We've been waiting for a while for the Office for National Statistics to deliver us some good news on the British economy - and today it came.",
        "url": "https://news.sky.com/story/some-good-news-for-the-british-economy-but-the-celebration-might-not-last-long-13346301",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rachel-reeves-chancellor_6882657.jpg?20250411100720",
        "type": "Politics",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-04-11 08:55:00",
        "Headline": "The chancellor will be buoyed by news the economy grew by more than expected in February - but celebrations will be short lived.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n We've been waiting for a while for the Office for National Statistics to deliver us some good news on the British economy - and today it came. Output grew by 0.5% in February, up from zero growth in January and higher than the 0.1% forecast by economists. Some usual caveats apply. Monthly data can be volatile and prone to revision - but it can go up as well as down. While publishing the latest figures, the ONS also revised up its January figure from -0.1% to zero. It's clear that, across the economy, sectors performed robustly. The big surprise was manufacturing. Business surveys told us that UK factories were on their knees, anxious about Trump's tariffs and impending tax rises that came into effect in April. \n                  UK economy grows - ONS\n                 \n                  Starmer to announce more support for businesses as Trump tariffs take hold\n                 \n                  Living standards boost for households but surge in costs looms large\n                 Yet the production sector grew by 1.5% - led by pharmaceuticals, metals and transport equipment. Businesses have been resilient. The chancellor will be pleased, but the celebrations are likely to be fleeting.  The world has already moved on, with Donald Trump unleashing policy chaos on the global economy. Britain is now facing a 10% tariff on exports to the US and there will be pockets of acute stress, particularly for our car manufacturers, who have been hit with a 25% tariff. They export more to the US than any other country in the world. Indeed, some of the growth in manufacturing may have been driven by businesses rushing to do deals before tariffs came into force. The tariffs alone on the UK will be painful - but the most significant damage is likely to come from a slowdown in the global economy. The US and China are engaged in a tit-for-tat trade war and that will have negative spillovers, especially for an open economy like ours. We won't escape the fallout. Businesses here in the UK might curtail hiring and investment in response, their hesitancy compounded by uncertainty over what Donald Trump might do next. Consumers may also retreat, especially if the pound weakens and imports become more expensive, causing inflationary consequences. So, while we've finally been given something to cheer, darker days beckon. We should enjoy it while it lasts."
    },
    {
        "title": "Teachers in England gearing up for potential strike action",
        "description": "Teachers in England are once again gearing up for potential strike action after an overwhelming majority of National Education Union (NEU) members rejected the government's latest pay offer.",
        "url": "https://news.sky.com/story/teachers-in-england-gearing-up-for-potential-strike-action-13346774",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-leeds-rally-neu-carol_6774876.jpg?20241213130604",
        "type": "Politics",
        "Author": "Anjum Peerbacos",
        "Date Published": "2025-04-11 19:02:00",
        "Headline": "Some 93.7% of National Education Union (NEU) members turned down a proposed 2.8% pay rise, labelling it inadequate and unfunded - as schools would have had to find the cash from existing budgets.",
        "Content": "\n          Education reporter\n       Teachers in England are once again gearing up for potential strike action after an overwhelming majority of National Education Union (NEU) members rejected the government's latest pay offer. In an electronic ballot, 93.7% of respondents turned down the proposed 2.8% pay rise, labelling it inadequate and unfunded. If the pay offer had been accepted, schools would have had to find the money from existing budgets to pay for the increase - with many saying they are already overstretched. Some 83% of teachers said they would be willing to take industrial action to secure a better deal. The vote, which included 134,487 teachers in state schools across England (a turnout of 47.2%), was a clear signal that union leaders are not backing down. In a statement after the vote, Education Secretary Bridget Phillipson said a move towards industrial action by teaching unions \"would be indefensible\", given work being done to increase school attendance and urged the NEU to \"put children first\". NEU general secretary Daniel Kebede said years of what he called \"real-terms pay cuts\" had left the profession in crisis. He also took aim at the government's decision not to fund the offer centrally. \"This will only make things worse,\" Mr Kebede said. \"Our members tell us every day of the desperate state their schools are in due to lack of funding.\" Read more from Sky News:Fears over decision to remove specialist police from London schools'UK's strictest headteacher' criticises 'appalling' billTeaching unions gear up for fight with No 10 over AI job-loss fears The union says the offer falls below inflation and lags behind private-sector wage growth. But critics argue strike threats will only cause more damage to students still recovering from the disruption of the pandemic. The union's national executive is due to meet at its Harrogate conference next week, and all eyes will be on whether full-blown strike action will be announced."
    },
    {
        "title": "Will Katy Perry sing in space - and will the all-female Blue Origin rocket crew count as astronauts?",
        "description": "It's been more than 60 years since a woman travelled into space without a man. And now six of them are blasting off from Earth.",
        "url": "https://news.sky.com/story/will-katy-perry-sing-in-space-and-will-the-all-female-blue-origin-rocket-crew-count-as-astronauts-13345042",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-space-blue-origin_6882943.png?20250411135414",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-11 23:01:00",
        "Headline": "A popstar, a journalist, a civil rights activist, rocket scientist and filmmaker are heading into space. And the mission is being led by Lauren Sanchez, an author and the fiance of Amazon's Jeff Bezos.",
        "Content": "It's been more than 60 years since a woman travelled into space without a man. And now six of them are blasting off from Earth. Popstar Katy Perry, author Lauren Sanchez, journalist and TV presenter Gayle King, civil rights activist Amanda Nguyen, former rocket scientist Aisha Bowe and filmmaker Kerianne Flynn are due to launch in Jeff Bezos' Blue Origin rocket on Sunday. It will be the latest flight of the New Shepard programme, named NS-31, and is aiming to \"create a lasting impact that will inspire generations\", with the women forming the first all-female crew since Russian engineer Valentina Tereshkova's solo flight to space in 1963. The trip is only expected to last around 11 minutes, with the reusable self-driving rocket taking off from Launch Site One in west Texas, at 8.30am local time (2.30pm BST) on Monday. It will reach a maximum height of 100km (62 miles) above Earth, with the women technically entering space as the capsule crosses the Karman line, which is internationally recognised as the boundary of space. They will not, however, be classed as astronauts by the Federal Aviation Administration, NASA or US military, which all have different eligibility requirements for people to become commercial astronauts. While in space, the crew will have about four minutes of weightlessness to float around and take in the views of Earth from the capsule's large windows. The crew capsule will then descend back to Earth using three parachutes. So far, 52 people have been taken into space as part of billionaire and Amazon chief Mr Bezos's programme, including the man himself, who joined the New Shepard's maiden voyage in 2021. Star Trek actor William Shatner became the oldest person in space when he joined the mission at the age of 90. How the crew was picked Mr Bezos' fiancee is leading the mission. Sanchez told Elle magazine she chose her fellow crew members because each had \"proven their ability to inspire others\". She said all the women will be able to spread the word on what they felt like during the trip, and also expand on ideas of what the next generation of space explorers will look like. Perry, who is one of the best-selling music artists of all time, told Elle that she has been wanting to go to space for almost 20 years, so it was a no-brainer when she got the call. She said: \"Even when Blue Origin was first talking about commercial travel to space, I was like, 'Sign me up! I'm first in line'. And then they called me, and I was like, 'Really? I get an invite?'.\" For King, who is best known as the co-host of US breakfast show CBS Mornings, the decision wasn't quite so easy. \"When I got the call from Lauren and Jeff, my first reaction was a no,\" she said, adding that she still has \"a lot of trepidation\" ahead of the trip. Bowe, a former NASA rocket scientist and chief executive of technology company STEMBoard, said she feels like she has been \"training for and waiting for this moment [her] entire life\", while civil rights activist Nguyen and film producer Flynn both said the opportunity was a dream come true. \"I can't wait to touch down on Earth and share what we bring back with the world,\" Flynn said. Glammed-up astronauts? As well as making history by being the first all-female crew in space, the women may also be the first group of astronauts to have their hair and makeup done for a mission. \"Who would not get glam before the flight,\" Sanchez said, before joking that fake eyelashes would be \"flying round the capsule\".  Bowe said she had already tested out the hairstyle she plans to have on launch day - by skydiving in Dubai. \"I think it's so important for people to see us like that,\" Nguyen said. \"This dichotomy of engineer and scientist, and then beauty and fashion. We contain multitudes. Women are multitudes. I'm going to be wearing lipstick.\" Perry put it another way: \"We are going to put the 'ass' in astronaut.\" The women also shared details of what they plan to take to space, including the original flag from Apollo 12 - the second mission to the moon - a stuffed animal, shells from Malaysia, and conch chowder, the national dish of The Bahamas, which Bowe grew up eating. Read more:Is Bezos chasing down Musk in the billionaire space race?SpaceX tourists return to Earth As a singer, Perry said she feels like she should perform while floating above the Earth, which would make her the first artist to sing in space. She added that she is also taking part in the flight for her daughter Daisy Dove Bloom, who she shares with British actor Orlando Bloom, to teach her that \"any type of person can reach their dreams\"."
    },
    {
        "title": "Nintendo Switch 2 launches straight into Trump's trade war",
        "description": "It was going to be the revivifying event the video games industry desperately needed - instead, thanks to Donald Trump's tariffs, the launch of the Nintendo Switch 2 is experiencing a troubled birth.&#160;",
        "url": "https://news.sky.com/story/nintendo-switch-2-launches-straight-into-trumps-trade-war-13346374",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-nintendo-switch-2_6882911.jpg?20250411131951",
        "type": "Technology",
        "Author": "Martin Kimber, gaming reporter",
        "Date Published": "2025-04-11 10:39:00",
        "Headline": "China, a significant manufacturing base for the Switch 2, is now subject to a 145% duty on shipments to the US.",
        "Content": "By Martin Kimber, gaming reporter   It was going to be the revivifying event the video games industry desperately needed - instead, thanks to Donald Trump's tariffs, the launch of the Nintendo Switch 2 is experiencing a troubled birth.  Barely had Nintendo announced the pre-order date and price point of the hotly awaited new handheld console when the US president slapped tariffs on China and Vietnam, among others, prompting the Japanese gaming giant to immediately suspend US pre-orders of the Switch 2. Today, Nintendo invited Sky News to be a part of the first group of journalists in the UK to try the console, and get to grips with a product that is fast becoming a totemic casualty of the global trade war. It was already a challenging market for the successor to the third best-selling console of all time, the original Switch, which has sold more than 150 million units. When the Switch first launched in 2017 it had next to no rivals - that landscape now looks very different. Valve Corporation's Steam Deck, whose release was also anything but smooth thanks to supply chain issues caused by Taiwanese semiconductor shortages, has gained considerable market share. Its ability to play most Windows-based games, of which there are many more than for the Switch, and the option to use it in desktop mode - essentially turning it into a handheld PC - made it appealing to consumers looking for a more powerful, versatile unit. \n                  MPs to debate emergency law to keep British Steel open as prime minister warns national security 'on the line'\n                 \n                  Some good news for the British economy - but the celebration might not last long \n                 \n                  Hilco and Lakeland management close in on deal for family-owned retailer \n                 To make matters worse, few could have expected the extent to which Mr Trump would sanction countries in the Asia Pacific region. China, a significant manufacturing base for the Switch 2, is now subject to 145% American trade tariffs. Vietnamese imports were due to be taxed at 46%, however these were paused for 90 days by Mr Trump following turbulence in the financial markets. Nintendo announced pre-orders in the US would open on the 9 April, with the console costing $449.99 (£395.99 for shoppers in the UK). Read moreBAFTA Games Awards: Full list of winnersExpert predicts GTA VI will cost $100 However, before even a single American order could be placed, pre-orders were indefinitely suspended following sweeping tariffs imposed on east Asian countries by the US on the 4 April. UK consumers are still able to place pre-orders. The delay could well come with further changes for gamers, said Gareth Sutcliffe, Head of Gaming at consultancy Enders Analysis. \"The other significant impact is the tariff consequences on Nintendo’s physical game sales, given they are all produced in Japan, and whether they can be imported as a finished game or as a component.\" He foresees the upset in global trade potentially leading to unprecedented prices for gaming hardware, saying: \"The price points for consoles overall could hasten the decline of this generation of consoles if you suddenly have price points nearing the $1,000 (£764) mark.\" Nintendo’s rivals, Xbox and PlayStation, are not insulated from the trade war because their supply chains also run predominantly through east Asia. Nintendo are hoping to sell 10 million units this year - whether they succeed, may well depend on the whims of the President of the United States of America."
    },
    {
        "title": "Menendez brothers' resentencing hearing can go ahead next week, says judge",
        "description": "The Menendez brothers' bid for freedom through resentencing can continue with the hearing scheduled for Thursday, a judge has ruled.",
        "url": "https://news.sky.com/story/menendez-brothers-resentencing-hearing-can-go-ahead-next-week-says-judge-13346541",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-erik-menendez-lyle-menendez_6883058.jpg?20250411155722",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-11 14:51:00",
        "Headline": "The Menendez brothers were sentenced to life after being convicted of murdering their parents, Jose and Kitty, at their Beverly Hills home in 1989. A Netflix drama series and documentary thrust them back into the spotlight last year, leading to renewed calls for their release.",
        "Content": "The Menendez brothers' bid for freedom through resentencing can continue with the hearing scheduled for Thursday, a judge has ruled. Lyle, 57, and Erik, 54, received life sentences without the possibility of parole after being convicted of murdering their parents, Jose and Kitty Menendez, at their Beverly Hills home in 1989. Lyle was 21 at the time, Erik was 18. Last year, Los Angeles district attorney George Gascon asked a judge to change the brothers' sentence from life without the possibility of parole to 50 years to life. That would make them immediately eligible for parole because they committed the crime when they were younger than 26. But Mr Gascon's successor Nathan Hochman submitted a motion last month to withdraw the resentencing request, saying the brothers must fully acknowledge lies they told about the murder of their parents before he would support their release from prison. Separately, Governor Gavin Newsom, who has the power to commute their sentences, has asked the parole board to consider whether the brothers would represent a public safety risk if released. In light of Mr Hochman's opposition, Los Angeles County Superior Court judge Michael Jesic ruled on Friday that the court can move forward with the hearing. \"Everything you argued today is absolutely fair game for the resentencing hearing next Thursday,\" he said. From prison, the brothers watched through a video link and could be seen in court seated next to each other in blue. Speaking after the hearing, the brothers' lawyer said: \"Today is a good day. Justice won over politics.\" Prosecutors accused the brothers of killing their parents for a multimillion-dollar inheritance, although their defence team argued they acted out of self-defence after years of sexual abuse by their father. The brothers have maintained their parents abused them since they were first charged with the murders. A Netflix drama series and subsequent documentary about the brothers thrust them back into the spotlight last year, and led to renewed calls for their release - including from some members of their family."
    },
    {
        "title": "Ex-Abercrombie & Fitch chief executive Mike Jeffries 'unfit to stand trial due to dementia', prosecutors and defence team say",
        "description": "Abercrombie & Fitch's former chief executive is not fit to stand trial on sex trafficking charges as he is suffering from dementia, both prosecutors and his lawyers have said.",
        "url": "https://news.sky.com/story/ex-abercrombie-fitch-chief-executive-mike-jeffries-unfit-to-stand-trial-due-to-dementia-prosecutors-and-defence-team-say-13346723",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-mike-jeffries-abercrombie_6727988.jpg?20241025213234",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-11 18:21:00",
        "Headline": "Mike Jeffries, who led fashion retailer Abercrombie & Fitch from 1992 to 2014, pleaded not guilty to federal sex trafficking and interstate prostitution charges in October, and was released on a $10m (£7.65m) bond.",
        "Content": "Abercrombie & Fitch's former chief executive is not fit to stand trial on sex trafficking charges as he is suffering from dementia, both prosecutors and his lawyers have said. Mike Jeffries has Alzheimer's disease, Lewy body dementia and the \"residual effects of a traumatic brain injury\", his defence attorneys wrote in a letter filed at a federal court in Central Islip, New York. The 80-year-old needs around-the-clock care, they added, citing evaluations by medical professionals. Prosecutors and defence lawyers are calling for Jeffries to be placed in the custody of the federal bureau of prisons for up to four months. They say he should be admitted to hospital to have treatment that could allow his criminal case to proceed. The business tycoon, who led fashion retailer A&F from 1992 to 2014, pleaded not guilty to federal sex trafficking and interstate prostitution charges in October, and was released on a $10m (£7.65m) bond. A total of 15 men allege they were induced by \"force, fraud and coercion\" to engage in drug-fuelled sex parties. Prosecutors have accused Jeffries, his partner Matthew Smith, and the couple's alleged \"recruiter\" James Jacobson, of luring men to parties in New York City, the Hamptons and other locations, by dangling the prospect of modelling for A&F advertisements. Smith and Jacobson have also pleaded not guilty to the charges against them. 'Progressive and incurable' In their latest letter on Jeffries' health, his defence lawyers said at least four medical professionals had concluded his cognitive issues are \"progressive and incurable\", and that he will not \"regain his competency and cannot be restored to competency in the future\". These issues \"significantly impair\" his ability to understand the charges against him, they wrote. Read more from Sky News:Tech executive and family die after helicopter crashes in New York'Wolf of Wall Street' speaks to Sky News about Trump tariffs \"The progressive nature of his neurocognitive disorder ensures continued decline over time, further diminishing his already limited functional capacity,\" said Dr Alexander Bardey, a forensic psychiatrist, and Dr Cheryl Paradis, a forensic psychologist, following evaluations made in December. \"It is, therefore, our professional opinion, within a reasonable degree of psychological and psychiatric certainty, that Mr Jeffries is not competent to proceed in the current case and cannot be restored to competency in the future.\" Jeffries left A&F in 2014 after leading the company for more than two decades, taking the retailer from a hunting and outdoor goods store founded in 1892 to a fixture of early 2000s fashion. His lawyers did not immediately respond to requests by the Associated Press news agency for comment. The US attorney's office for the eastern district of New York declined to comment."
    }
]