[
    {
        "title": "No 10 will think this US trip could not have gone better",
        "description": "With Donald Trump, it's all about relationships.",
        "url": "https://news.sky.com/story/no-10-will-think-this-us-trip-could-not-have-gone-better-13318391",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-keir-starmer-beth-rigby_6840848.png?20250226214749",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-02-27 22:40:00",
        "Headline": "There seemed to be a genuine rapport between Sir Keir Starmer and Donald Trump, who seemed amenable to the UK prime minister even though they are so different.",
        "Content": "\n          Political editor\n              @BethRigby\n  With Donald Trump, it's all about relationships. Going into this bilateral summit, those around Sir Keir Starmer were stressing that these guys genuinely got on well, they liked each other, and that the prime minister could say things to Mr Trump in private and not get his head blown off. What we saw today was a genuine rapport between the two men, and Mr Trump seems amenable to Sir Keir. Number 10 will have thought that this could not have gone better. Politics latest: Trump tells Starmer UK may get 'great' trade deal  One key element for the UK side was convincing Mr Trump to give security guarantees for Ukraine in any kind of peace deal with Russia, but he didn't really bite on that topic. Nonetheless, Sir Keir will have plenty to discuss with European leaders at the big London summit on Sunday.  The big story that emerged out of the press conference was, however, about trade. Mr Trump has been threatening allies around the world with tariffs. Read more:Top moments from Trump and Starmer's press conferenceInside the Oval Office with Trump and Starmer He didn't completely rule out tariffs on the UK, but he did say that what he wanted to do was a trade deal where maybe this could be avoided. That would be a huge win for a prime minister who did not necessarily think he would come out with that, and also for a UK government that really needs to strengthen trade ties with the US because they're looking for economic growth. Whether they can agree on things such as food standards and NHS access is not so clear. But Sir Keir will be pleased with how well this played out today."
    },
    {
        "title": "Deaths of Gene Hackman and wife 'suspicious enough' to require 'investigation' - police warrant",
        "description": "Hollywood legend Gene Hackman and his wife have been found dead, with authorities saying the couple had seemingly been deceased for some time when their bodies were discovered. ",
        "url": "https://news.sky.com/story/oscar-winning-actor-gene-hackman-and-wife-found-dead-at-home-13317861",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gene-hackman-wife-betsy-arakawa_6841175.jpg?20250227093419",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-27 06:36:00",
        "Headline": "Santa Fe County Sheriff's Office said deputies responded to a request to do a welfare check on Wednesday around 1.45pm local time and found Hackman, his wife Betsy Arakawa and a dog dead.",
        "Content": " Hollywood legend Gene Hackman and his wife have been found dead, with authorities saying the couple had seemingly been deceased for some time when their bodies were discovered.  Hackman, 95, and his 63-year-old wife Betsy Arakawa were found dead in their New Mexico home on Wednesday, it was announced this morning. One of their pet dogs also died. Santa Fe County Sheriff's Office spokesperson Denise Avila said deputies found the bodies while carrying out a welfare check on Wednesday at around 1.45pm local time. The actor's body was discovered in a mudroom while Arakawa was found in a bathroom next to a heater, detectives from the sheriff's office wrote in a search warrant. There were scattered pills and an open prescription bottle on a countertop near the 63-year-old. There was no indication they had been shot and they had no other wounds, Ms Avila said. The warrant added the door to the property was found ajar and there were no signs of forced entry. A German Shepherd was found dead in a bathroom closet near Arakawa, police added. Two healthy dogs were on the property. The police have since said the deaths of Hackman and his wife are \"suspicious enough in nature to require a thorough search and investigation\". The actor's daughter had earlier suggested they may have been killed by carbon monoxide - but the cause of death remains unclear. Speaking to TMZ, Elizabeth Jean Hackman said the family was not sure but thought the couple may have died from toxic fumes. The local utility company tested gas lines in and around the home after the bodies were found and did not find any sign of problems, the warrant said. In a statement issued to Sky News, the sheriff's office said: \"We do not believe foul play was a factor in their deaths, however exact cause of death has not been determined at this time.\" Hackman's daughters, Elizabeth and Leslie, and granddaughter, Annie, said: \"He was loved and admired by millions around the world for his brilliant acting career, but to us he was always just Dad and Grandpa. \"We will miss him sorely and are devastated by the loss,\" they added in a statement. Hackman won an Oscar for a leading role in The French Connection, a 1971 action movie by William Friedkin, and another for best supporting actor in Clint Eastwood's 1992 western, Unforgiven. He was also known for playing Lex Luthor in the Superman films of the late 1970s and 1980s.  Roles in the Francis Ford Coppola mystery thriller The Conversation and in the historical drama Mississippi Burning, where he starred as an FBI agent alongside Willem Dafoe, helped cement his career as one of Hollywood's greats. Long career The former US Marine appeared in more than 80 films, as well as on television and the stage, during a lengthy career that started in the early 1960s. He earned his first Oscar nomination for his breakout role as the brother of bank robber Clyde Barrow in 1967's Bonnie and Clyde. He is also remembered for playing Captain Frank Ramsey alongside Denzel Washington in the 1995 thriller Crimson Tide. Read more:Follow latest: Actor and wife were dead for some timeIn pictures: Hollywood legend on silver screen In the early 2000s, he starred as an eccentric patriarch in The Royal Tenenbaums by Wes Anderson. Hackman's final film appearance was in 2004's Welcome to Mooseport, after which he retired from acting and began co-writing adventure novels with friend and underwater archaeologist Daniel Lenihan. \"It's very relaxing for me,\" Hackman told Empire Magazine in 2020. \"I don't picture myself as a great writer, but I really enjoy the process.\" 'He could play anyone' Michael Caine revered Hackman as \"one of the greatest actors\" he had known while presenting him with the Cecil B DeMille Award in 2003. Arakawa was a classical pianist. The couple married in 1991 and lived outside Santa Fe, New Mexico. Hackman had three children, Christopher, Elizabeth Jean and Leslie Anne, with his late ex-wife, Faye Maltese, who died in 2017. Star Trek star George Takei said: \"We have lost one of the true giants of the screen,\" in a tribute on X. \"Gene Hackman could play anyone, and you could feel a whole life behind it. \"He could be everyone and no one, a towering presence or an everyday Joe. That's how powerful an actor he was,\" Takei wrote on X. \"He will be missed, but his work will live on forever.\" Read more from arts and entertainment:Oscars A-Z: From Anora to a (disqualified) Hans ZimmerGossip Girl and Buffy The Vampire Slayer actress dies aged 39 Irish comedian Dara O Briain called Hackman \"the finest screen actor ever\". \"Not a single duff performance, in a long, long career,\" he wrote in a post on X. Hackman was versatile on screen, working with a face that he described to the New York Times in 1989 as that of \"your everyday mine worker.\" StudioCanal, the UK arm of the leading European film studio, called Hackman's death \"a colossal loss for cinema\" in a tribute posted on X."
    },
    {
        "title": "Major internal investigation reveals IDF failures in October 7 attack",
        "description": "The Israel Defence Forces has admitted the attacks by Hamas on October 7 2023 were \"a complete failure\" of Israeli security and the result of many years of planning and deception by the Gaza-based militant group.",
        "url": "https://news.sky.com/story/idf-admits-israeli-security-completely-failed-when-hamas-launched-october-7-attack-13318202",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-nova-festival-israel_6841586.jpg?20250227170949",
        "type": "Home",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-02-27 16:48:00",
        "Headline": "The inquiry, which is the result of tens of thousands of hours of work by the IDF Southern Command, found as many as 5,600 terrorists broke into Israel in three waves.",
        "Content": "\n          Middle East correspondent\n              @AliBunkallSKY\n The Israel Defence Forces has admitted the attacks by Hamas on October 7 2023 were \"a complete failure\" of Israeli security and the result of many years of planning and deception by the Gaza-based militant group. Announcing some of the findings from a major internal investigation, the Israeli military said \"the IDF failed in its mission to protect people\" and it was \"one of the greatest failures\" in the military's history. Nobody in the Israeli security establishment knew of, or predicted, the attacks and the force stationed on the border was the minimum required for everyday threats. The primary focus at the time was on the threat from Iran and Hezbollah. The inquiry concluded that those actors were aware of Hamas's plans but probably didn't know the exact timing of the attacks. Gaza was seen as a secondary threat and while Hamas was considered an illegitimate governing body of Gaza, there was no effort to develop an alternative. The inquiry, which is the result of tens of thousands of hours of work by the IDF Southern Command, found as many as 5,600 terrorists broke into Israel in three waves. On October 7 2023, 4,694 mortars and rockets were fired from Gaza into Israel, and 1,320 people were killed and 251 taken hostage. \n                  Hamas releases bodies of last hostages included in first phase of ceasefire - as hundreds of Palestinian prisoners are freed\n                 \n                  Thousands line streets in Israel for Bibas family funeral procession\n                 \n                  Operation Iron Wall: West Bank areas 'turning into mini-Gaza' as Israeli troops bulldoze homes\n                 As the IDF battled to regain control of southern Israel the same day, some of its commanders were forced to use google maps and mobile phones to communicate and co-ordinate. The majority of killings and kidnappings occurred during the first two waves of attacks, between 6.29am and 9am on that Saturday morning. Many Palestinians who entered Gaza in the third wave, during the afternoon, were from other terror organisations or \"a mob taking advantage\" rather than Hamas fighters trained for the attack. In the chaos, the Israeli air force struggled to distinguish between Hamas fighters and Israeli civilians. The IDF accepts there were some deaths caused by friendly fire but haven't elaborated how or where. By 5pm, there were still hundreds of Hamas fighters spread out along the so-called Gaza envelope of Israeli communities, many in open areas. It's thought they planned to reach deeper into Israel, including Ashkelon and key air bases.  Intelligence assessments at the time believed that Hamas didn't want a full-scale war and lacked the capability to launch one. IDF officials believed there would be early warnings if an attack was imminent, and the strategy was to \"maintain the threat\" rather than neutralise it. Based on that, officials said soldiers \"were addicted to the precise intelligence information\" and failed to challenge the assumptions internally. Although there were some unusual indications an attack was under way overnight, such as the activation of Israeli SIM cards inside Gaza, duty officers didn't think it was time-critical and further investigation was needed. More from Sky News:Trump shares bizarre AI video of vision for GazaHamas release bodies of hostagesWest Bank 'turning into mini Gaza' Hamas activity in a specific area was dismissed as a training exercise. After consultation with senior commanders in the middle of the night, it was decided to hold a situational assessment early in the morning. The attack happened before that took place. The scale and brutality of the attack took the IDF by surprise and their defensive strategies, including a vastly expensive subterranean wall, proved ineffective. The barrier was designed to stop mass protests and limited infiltration but not a large-scale attack. Forces along the border had been reduced because of other requirements on the Lebanon border and in the West Bank, and the IDF had too much confidence in the barrier defences. Through various intelligence sources, including material found in Gaza, it's now understood that Hamas's leader at the time, Yahya Sinwar, first conceived the idea in November 2016. A plan to attack Israel was approved in July 2019. During those years, Hamas deceived Israel, convincing leaders it wanted economic prosperity rather than conflict. A short war between the two in 2021 didn't inflict as much damage on Hamas infrastructure and capabilities as Israel believed. Hamas was close to launching the attacks on three occasions during 2022 but decided not to for unknown reasons. They eventually did so to take advantage of a Jewish religious holiday in 2023. The inquiry has also compiled 41 separate findings of battles in specific kibbutzim, military bases and key roads. Those details are being presented to the individual communities over the coming days. The Israeli government has repeatedly rejected calls for a State Commission of Inquiry, saying the time is not yet right because of the ongoing war. Critics of Israeli Prime Minister Benjamin Netanyahu say he is avoiding personal responsibility for his role as Israel's leader at the time."
    },
    {
        "title": "Princess Eugenie posts tribute to 'special friend' Michelle Trachtenberg",
        "description": "Princess Eugenie has posted a tribute to Michelle Trachtenberg after the actress's death.",
        "url": "https://news.sky.com/story/princess-eugenie-posts-tribute-to-special-friend-michelle-trachtenberg-13318177",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-michelle-trachtenberg_6841747.jpg?20250227202349",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-27 15:58:00",
        "Headline": "Tributes to the Buffy the Vampire Slayer star have poured in following her death aged 39, with Sarah Michelle Gellar and Blake Lively among the famous faces who have shared messages online. ",
        "Content": "Princess Eugenie has posted a tribute to Michelle Trachtenberg after the actress's death. The Gossip Girl and Buffy the Vampire Slayer star, 39, was found dead at her home in New York City on Wednesday. An investigation into her death has been opened but \"criminality is not suspected\", police said. In a post on Instagram today, Princess Eugenie thanked Trachtenberg for \"so many memories\". \"Goodbye special friend. You are so loved and missed,\" she wrote. \"Thank you for so many memories of laughter and fun. You were so thoughtful and generous and sooo funny. \"My favourite was listening to you order food, always done with precision so you got exactly what we all wanted. \"I'm thinking of you up there friend, of your spirit that was so bright and your joy you brought to so many.\" Eugenie previously lived in New York and in 2013, she was seen attending a basketball game at Madison Square Garden with Trachtenberg. The actress shared numerous social media updates featuring the princess over the years. In 2020, she hailed her as \"one of the most dearest, kindest, most genuine friends I have ever had in my life\" and four years prior, she wrote: \"There are few people in life that you meet that you know are true and real. This lady happens to be one of them.\" Buffy and Gossip Girl co-stars pay tribute Trachtenberg was best known for playing Dawn Summers in Buffy, the younger sister of the title character played by Sarah Michelle Gellar, and starring as Georgina Sparks in Gossip Girl. Paying tribute to her co-star, Gellar shared a series of pictures of herself and Trachtenberg, alongside a caption referencing a scene from the hit show. \"Michelle listen to me. Listen. I love you. I will always love you. The hardest thing in this world, is to live in it. I will be brave. I will live… for you,\" she wrote. James Marsters, who played punk vampire Spike, told fans on Instagram: \"My heart is heavy today. We have lost a beautiful soul. \"Michelle was fiercely intelligent, howlingly funny, and a very talented person. She died much too young, and leaves behind scores of people who knew and loved her.\" A number of Trachtenberg's Gossip Girl co-stars have also shared tributes on social media, with Blake Lively - who starred as Serena van der Woodsen in the teen drama - writing on Instagram: \"Everything she did, she did 200%.\" Lively added: \"She laughed the fullest at someone's joke, she faced authority head on when she felt something was wrong, she cared deeply about her work, she was proud to be a part of this community and industry as painful as it could be sometimes, she was fiercely loyal to her friends and brave for those she loved, she was big and bold and distinctly herself.\" Taylor Momsen, Gossip Girl's Jenny Humphrey, said: \"I will miss you everyday my love.\" \"I'll miss our late night calls that no one should ever hear but us,\" she wrote. \"She was always in my corner and there to support me whether I was right or wrong. \"I think we truly understood each other and I am so grateful to have had a friend like you in my life for so long.\" More from Sky News:Deaths of Gene Hackman and wife 'suspicious enough' to require 'investigation'Nineties boyband to reunite with UK tour \"Michelle was one of a kind,\" wrote fellow Gossip Girl star Chace Crawford. \"I remember her coming on set for the first time and just absolutely owning it. \"She was a force of nature and just so so unapologetically funny and magnetic.. remembering those years with a big smile. Just a terrible loss. Love you.\" \"Rest in peace sweet Michelle,\" Kim Cattrall wrote alongside a picture of herself and Trachtenberg in the 2005 film Ice Princess. Kate Beckinsale posted: \"What a terrible shock and loss, my god. My heart aches for your mama. Fly safe little bird.\" Trachtenberg's most recent film appearance came last year, when she played the role of Michelle Cody White in Spyral. Police said an investigation into her death has been opened but \"criminality is not suspected\"."
    },
    {
        "title": "Andrew Tate arrives in US after travel ban was lifted - as Trump says he knows 'nothing about that'",
        "description": "Andrew Tate and his brother Tristan have landed in Florida in the US after a travel ban in Romania was lifted - as Donald Trump insisted he knows \"nothing about that\".",
        "url": "https://news.sky.com/story/andrew-tate-and-his-brother-tristan-have-left-romania-for-the-us-reports-13317873",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-andrew-tate_6841694.jpg?20250227190455",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-27 07:26:00",
        "Headline": "Self-described misogynist Andrew Tate - a champion of Donald Trump - and his brother are facing a series of charges in Romania. ",
        "Content": " Andrew Tate and his brother Tristan have landed in Florida in the US after a travel ban in Romania was lifted - as Donald Trump insisted he knows \"nothing about that\". The Tates landed in Fort Lauderdale in a private plane at around 11:30am local time, their representative Mateea Petrescu added. Speaking around an hour later, Andrew Tate told reporters: \"We've yet to be convicted of any crimes in our lives ever. We have no criminal record anywhere on the planet ever. \"Our case was dismissed on 19 December in Romania under the Biden administration, and our prosecutor recently decided, because we have no active indictment in court, to let us go and return. \"This is a Democratic society, we're supposed to be innocent until proven guilty, as my brother and I are.\" The brothers, who champion US President Trump, are facing charges in Romania of human trafficking, sexual misconduct and money laundering, as well as starting an organised crime group. The self-styled misogynists are dual UK and US nationals whose controversial views are shared widely on social media platforms such as TikTok and X. Their arrival in Fort Lauderdale comes after the Financial Times reported last week that the Trump administration had lobbied their Romanian counterparts to ease restrictions on the brothers while they face charges. Romanian foreign minister Emil Hurezeanu said the Tates were mentioned during his brief hallway meeting with Mr Trump's special envoy Richard Grenell at the Munich Security Conference earlier this month. Mr Trump was asked about the arrival of the Tates in the US while meeting with UK Prime Minister Sir Keir Starmer at the White House this evening. Asked by a reporter if his administration pressured the Romanian government to let the Tates travel, the US president told reporters: \"I know nothing about that. You're saying (Andrew Tate) is on a plane right now? \"I just know nothing about it, we'll check it out, we'll let you know.\" Romanian prosecutors later said they had approved a request from Andrew Tate, 38, to travel outside of the country, pending the outcome of a criminal investigation. The pair had been released from house arrest, but were not allowed to leave the country and were required to check in with the police regularly. Read more:How Tate's business made millions - despite sex trafficking chargesWho is the self-styled 'king of toxic masculinity? \"The request to change the obligation of not leaving Romania was approved,\" prosecutors said in a statement on Thursday. \"All the other obligations have been maintained, including the requirement to check in with judicial authorities every time they are called.\" A spokeswoman for the Tates told Sky News the Romanian courts had decided they will return to the brothers all of their assets. This includes restoring their ownership of all previously frozen bank accounts, five properties, six cars including two Audis and a Ferrari, and company shares. Some assets will remain under precautionary seizure, according to the court ruling. The brothers are fighting a series of legal battles not just in Romania, but also in the UK and the US. They have consistently denied any wrongdoing in connection with all the legal action taking place. The Tates grew up in Luton and have millions of social media followers. Andrew Tate also appeared in the UK version of Big Brother in 2016. The pair are often criticised for their misogynistic views online - particularly as they have a predominately young, male audience. A number of banned Twitter accounts have been reinstated by Elon Musk. Tate was among those brought back on 18 November 2022 after Musk took over and rebranded it X. A British court ruled in March that the brothers are also under a European arrest warrant and will be extradited to the UK - where allegations of rape and human trafficking are being investigated by Bedfordshire Police - after Romanian trial proceedings finish for a separate investigation. A recent lawsuit filed in Florida accuses both Tate brothers of conspiring to coerce a woman into sex work, luring her to Romania and defaming her after her testimony to Romanian authorities. The Tate brothers had previously sued her for defamation in 2023. Read more from Sky News:Actor Gene Hackman and wife found dead at homeStarmer in Washington for Trump talksProbe blasts off to chase asteroid Four British women who allege they were raped and coercively controlled by Andrew Tate said they have been \"retraumatised\" by today's events. \"It is clear that there is now a major risk that the criminal prosecution for his alleged crimes in Romania will not proceed, and he may use this development as an opportunity to harass further and intimidate witnesses and his accusers as well as continue to spread a violent, misogynistic doctrine around the world,\" the alleged victims said in a joint statement. Tate is facing civil action brought by the women at the High Court. He denies the allegations and has threatened to pursue the women for defamation. Matthew Jury, their solicitor at McCue Jury & Partners, said: \"The news that pressure by the Trump administration has led to Andrew Tate, and his brother Tristan, being allowed to leave Romania by its authorities is equal parts disgusting and dismaying.\" He added: \"The UK government knew this might happen more than a week ago. The fact that nothing seems to have been done to prevent it is concerning. One can only hope action will now be taken. Given that Prime Minister Starmer is in the US today to meet with President Trump, perhaps his team may take the opportunity to raise this issue.\""
    },
    {
        "title": "Could Man City be stripped of titles? Or have points deducted? Experts give their opinions",
        "description": "In the next month or so, we're expecting an independent commission to announce whether Manchester City will face any punishment over more than a hundred counts of alleged financial rule breaches.",
        "url": "https://news.sky.com/story/could-man-city-be-stripped-of-titles-or-have-points-deducted-experts-give-their-opinions-13318083",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-man-city-sergio-aguero_6841494.jpg?20250227153943",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-27 12:57:00",
        "Headline": "Sports correspondent Rob Harris spoke with experts at the Business of Football Summit to hear what they think will happen with the charges Man City are facing.",
        "Content": " In the next month or so, we're expecting an independent commission to announce whether Manchester City will face any punishment over more than a hundred counts of alleged financial rule breaches. The club are facing around 115 charges laid by the Premier League which have been the subject to a hearing which has been held in private. Ahead of the verdicts, Sky News' sports correspondent Rob Harris spoke with some of the world's top football finance experts at the Financial Times' Business of Football Summit 2025 to hear what they think will happen next, and to answer questions from readers. But before we get to their thoughts, let's look at the background of the case. What is the nature of the charges? The greatest proportion of the charges relate to rules that require clubs to provide accurate financial information, and which City are alleged to have breached. They include details concerning the accuracy of information about sponsorship deals and player and manager payment. There are also allegations of breaches of rules requiring clubs to comply with UEFA Financial Fair Play (FFP) regulations - and the Premier League's own profit and sustainability rules (PSR). They are also accused of failing to cooperate with the league's investigation. In all, there are charges relating to every season between 2009-10 and 2022-23. During that period, City won the Premier League title seven times, the FA Cup on three occasions, six League Cups and a Champions League. City have strongly denied the allegations and said they welcomed the opportunity for an independent commission \"to impartially consider the comprehensive body of irrefutable evidence that exists in support of our position\". More context:Rob Harris explains the charges and their impactYour guide to Financial Fair Play in football What's next? Since the charges were announced, hearings have been held in private, during which lawyers from the Premier League and Manchester City have presented evidence and arguments on the case. A panel of retired senior judges sits on an independent commission which will rule on the case very soon. They could find City guilty on all of the charges, guilty of some of them, or clear the club of any wrongdoing. Your questions While we wait for the verdict, readers posed their questions to experts. At the Financial Times' Business of Football Summit 2025, Rob Harris spoke to: 'We've never seen anything like it' Matt Hughes said the case is the clearest example of how football can change radically in just a few years. \"Five, ten years ago, I couldn't have imagined journalists and football fans arguing over arcane matters of competition law and issues such as associated party transactions - it feels like the last ten years of the Premier League has all crystallised in this one case,\" he said. That was echoed by Simon Leaf, who said the case was \"truly unprecedented in the history of football and financial regulation in football\", before adding that such regulation is only 10 or 15 years old itself. \"We've never quite seen anything like it,\" he said. And with a case of that size comes the challenge of proving it. Martin Lipton said it's a \"huge ask\" for the Premier League to prove any of the charges, as they'd have to show beyond any doubt that City knowingly \"defrauded football\". Could only a few guilty verdicts lead to a points deduction? As we mentioned above, it's not yet clear whether the independent commission will find City guilty on all charges - but what if they were found to have broken a few rules? Could we expect a heavy fine or points deduction for each charge broken? Our experts explained that the first problem is that we're effectively in the dark until the verdict is released in full. \"We still don't know exactly how many charges [City] are facing,\" Hughes said, noting that figures have been floating around the 115, 129 or even 130 mark, but nothing is certain yet. \"Everything's been done confidentially,\" Lipton said, adding that we will only get an understanding of what they've actually been charged with with the verdicts. Others may look to precedent. Last season, Everton were twice docked points for breaching the Premier League's PSR. Nottingham Forest were also deducted four points during the last campaign. But, as the experts explained, these were for more straightforward charges of overspending - something fairly straightforward to prove (additionally, this, alongside the number of charges, is one of the main reasons the case has taken so long to reach a conclusion). Many of City's charges relate to overinflated sponsorship deals - which is entirely more subjective and therefore much more difficult to prove. For instance, a sponsorship deal involving a global superclub like Manchester United would have a vastly different value to one with a newly promoted side like Southampton. \"What it comes down to is trying to assess the market value of these deals... and it's very hard to know what the value should be from club to club,\" Leaf said. \"Equally, the rights are not the same [in every deal] - some include hospitality access for sponsors,\" he added. \"One of the deals we did a few years ago involved a country's national ballet being able to appear at the [club's] stadium - how do you put a [market] value on something like that?\" Could City have Premier League titles stripped from them? \"There seems to be no appetite to take retrospective punishment,\" said Hughes when asked this question. But Leaf said it was still too early to say. \"I suspect there will be certain clubs looking at this and saying, actually we would have been entitled to payments for qualifying for Champions League... or even bonuses from sponsors from finishing in a different position,\" he said, suggesting this would give the commission something else to think about when making its decisions. But Lipton said he'd be very surprised if City were to be stripped of titles, given that that would undermine the Premier League's history. \"If you were to strip titles, the single most iconic moment in the history of the Premier League - Sergio Aguero's 94th minute goal against QPR to win the league - didn't happen,\" he said. \"You can't rewrite history to that extent,\" he said, adding title stripping is just \"not going to happen\". What if City are cleared? If City's position is vindicated, it is likely to lead to serious questions about the Premier League's ability to effectively govern its clubs and enforce financial regulations. This is at a time when football is on course to become subject to wider independent regulation, something which is widely supported by supporter groups. Other clubs who have faced punishment in the past will also want to pick through the details of the verdict and may have further questions about how the rules are being applied. But it also opens the door for City to go for the jugular, our experts said. \"If City were to be cleared of absolutely everything, then the next question will be - what happens to the Premier League leadership?\" Lipton asked. He described the case as nothing more than a \"brutal civil war\" and should City win it, they'll seek \"the complete decapitation of the entire leadership\". What about an appeal? Either side can appeal against any ruling. \"We're hoping to get an initial judgment next month,\" Hughes said, adding the issue as a whole won't be resolved for a long time, whatever the verdict is. Leaf noted that it's highly unlikely there will be a finding that both sides are happy with, making the possibility of a lengthy appeals process high. \"If there's an appeal, there's a separate commission [that presides over it],\" Lipton said, suggesting that we'd effectively be starting again. You can watch Rob's full Q&A with Matt, Simon and Martin at the top of this page."
    },
    {
        "title": "Rhianan Rudd: Groomed teenage girl who was accused of terrorism had 'obsession with Hitler', inquest told",
        "description": "A 16-year-old girl, who is believed to have taken her own life after facing terror charges, had wanted to \"blow up\" a Jewish place of worship and was obsessed with Adolf Hitler, an inquest has been told.",
        "url": "https://news.sky.com/story/rhianan-rudd-groomed-teenage-girl-who-was-accused-of-terrorism-had-obsession-with-hitler-inquest-told-13318293",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-rhianan-rudd-inquest_6841721.jpg?20250227195316",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-27 19:37:00",
        "Headline": "The girl was investigated after she downloaded a bombmaking manual and scratched a swastika mark on to her forehead, and she became the youngest person to be charged with terror offences in the UK, a court heard.",
        "Content": "A 16-year-old girl, who is believed to have taken her own life after facing terror charges, had wanted to \"blow up\" a Jewish place of worship and was obsessed with Adolf Hitler, an inquest has been told. Rhianan Rudd was a victim of grooming by a \"neo-Nazi\" American extremist who had \"encouraged her to read some books\" about Jewish and black people, Chesterfield Coroner's Court heard. Rhianan's mother Emily Carter said in a statement: \"My daughter being groomed was huge and I saw Rhianan change. This had a great impact on her and I did all I thought was right by her. \"She was one of the kindest and most loving children I ever had the honour to know. \"I miss her more than life itself, I miss her smile, her laugh, her conversations - I just miss her.\" Rhianan, from Chesterfield in Derbyshire, had been born into a domestic violence relationship, her mother also said. The teenager was investigated by authorities after she downloaded a bombmaking manual and scratched a swastika mark on to her forehead, and she became the youngest person to be charged with terror offences in the UK, the court heard. But her charges were dropped five months before her death when evidence emerged she had been exploited. Rhianan's death She died on 19 May 2022 at a children's home in Nottinghamshire, the inquest was told. It heard that at the time of her death, the teenager was a looked-after child in the care of the local authority, had autism and self-harmed because she had \"too many emotions\" and \"did not know how to deal with them\". Rhianan's mother wrote in a 7 September 2020 email to the Home Office counter-terrorism programme Prevent that the teenager had a \"massive dislike for certain races\", counsel to the inquest Edward Pleeth said. 'Shrine in bedroom to Hitler' It was recorded during that month that Rhianan had an \"obsession with Hitler\", whom the court heard she had a shrine to in her bedroom, and was a \"Holocaust denier\". The court was told that WhatsApp messages sent by Rhianan were contained in a student incident statement in September 2020, saying she \"wants to kill someone in the school or blow up a Jewish place of worship\" and that she \"does not care who she kills and nothing matters anymore\". Also that month, it was recorded she said she had stopped speaking to the American extremist in March but then \"seemed to contradict herself\", meaning it was possible they were still communicating, the court heard. Read more from Sky News:Woman, 19, dies in dog attack - two people heldKaty Perry set to travel to space as part of all-female mission Home searched Two police officers went to Rhianan's home address on 9 October 2020 and seized a USB memory stick and a diary from her. PDF files related to bomb making, guerrilla warfare and homemade weapons, were recovered and her diary referenced firearms, the inquest was told. That month, Counter Terrorism Policing East Midlands shared information with MI5 who opened an investigation into Rhianan, and on 20 October 2020 police decided not to arrest her because it was \"believed to risk some impact on her mental health\" and \"could possibly lead to further self harm and suicide attempts\", the court heard. But after she was admitted to hospital that same day after scratching a swastika on to her face, the court was told that a decision was made on 21 October to arrest her. Mr Pleeth told the court that Rhianan's charges were discontinued on 29 December 2021. Chief coroner Judge Alexia Durran said the scope of the inquest includes how Rhianan's risk of self-harm and suicide was acted upon, such as the circumstances leading up to her charges being dropped, and how her care and support was coordinated. The inquest continues. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "No 10 will think this US trip could not have gone better",
        "description": "With Donald Trump, it's all about relationships.",
        "url": "https://news.sky.com/story/no-10-will-think-this-us-trip-could-not-have-gone-better-13318391",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-keir-starmer-beth-rigby_6840848.png?20250226214749",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-02-27 22:40:00",
        "Headline": "There seemed to be a genuine rapport between Sir Keir Starmer and Donald Trump, who seemed amenable to the UK prime minister even though they are so different.",
        "Content": "\n          Political editor\n              @BethRigby\n  With Donald Trump, it's all about relationships. Going into this bilateral summit, those around Sir Keir Starmer were stressing that these guys genuinely got on well, they liked each other, and that the prime minister could say things to Mr Trump in private and not get his head blown off. What we saw today was a genuine rapport between the two men, and Mr Trump seems amenable to Sir Keir. Number 10 will have thought that this could not have gone better. Politics latest: Trump tells Starmer UK may get 'great' trade deal  One key element for the UK side was convincing Mr Trump to give security guarantees for Ukraine in any kind of peace deal with Russia, but he didn't really bite on that topic. Nonetheless, Sir Keir will have plenty to discuss with European leaders at the big London summit on Sunday.  The big story that emerged out of the press conference was, however, about trade. Mr Trump has been threatening allies around the world with tariffs. Read more:Top moments from Trump and Starmer's press conferenceInside the Oval Office with Trump and Starmer He didn't completely rule out tariffs on the UK, but he did say that what he wanted to do was a trade deal where maybe this could be avoided. That would be a huge win for a prime minister who did not necessarily think he would come out with that, and also for a UK government that really needs to strengthen trade ties with the US because they're looking for economic growth. Whether they can agree on things such as food standards and NHS access is not so clear. But Sir Keir will be pleased with how well this played out today."
    },
    {
        "title": "A 'beautiful' accent and peace deals: Top five moments from Trump and Starmer's press conference",
        "description": "All eyes have been on Sir Keir Starmer as he held the most consequential news conference of his premiership so far.",
        "url": "https://news.sky.com/story/five-key-points-from-starmers-talks-with-trump-including-a-great-trade-deal-13318300",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-keir-starmer-donald-trump_6841833.jpg?20250227221422",
        "type": "UK",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-02-27 19:58:00",
        "Headline": "From praising the prime minister's \"beautiful\" accent to brushing off Canada, the UK-US press conference was an eventful one.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  All eyes have been on Sir Keir Starmer as he held the most consequential news conference of his premiership so far. By Donald Trump's own admission, Sir Keir's first trip to Washington as prime minister got off to an \"outstanding start\". The love-in between the prime minister and the US president continued on stage, as they heaped praise on each other and paid tribute to the special relationship. Here Sky News takes you through the key moments from the conference. Politics latest: Trump praises 'tough negotiator' Starmer after White House talks Ukraine deal still in the balance Sir Keir's defining mission on this trip has been to try and persuade Mr Trump to provide a security guarantee for Ukraine in any peace deal reached with Russia, so that Vladimir Putin does not invade its neighbour again following an initial ceasefire. It appears that no such deal has yet been reached - but the US president did say the White House was \"working towards a very achievable ceasefire in Ukraine\". \"If you want peace, you have to talk both sides,\" he said - which has not been the approach of the international community. \"The next step we are making is toward a very achievable ceasefire.\" However, in language that may sound alarm in Kyiv, Mr Trump said: \"If it doesn't happen quickly, it may not happen at all.\" That statement may spark fear that the US president would be prepared to do a deal at any cost which would favour Vladimir Putin at the expense of Ukraine. By contrast, Sir Keir struck a different tone and said: \"History must be on the side of the peacemaker, not the invader.\" 'Very good chance' of trade deal - and maybe no tariffs? The main news takeaway from the conference was about trade. Sir Keir has been at pains to charm Mr Trump into striking a good trade deal with the UK, following the wilderness years under former president Barack Obama when the UK was famously \"at the back of the queue\". As part of that, the prime minister is hoping the US will not impose punitive tariffs on the UK, as it minded to do with close neighbour Canada - because any such move would make his mission to grow the economy nigh on impossible. Asked if Sir Keir had convinced him not to impose trade tariffs on the UK, Mr Trump said to laughter: \"He tried.\" \"He was working hard, I'll tell you that,\" he joked. \"He earned whatever the hell they pay him over there, but he tried.\" He added: \"I think there's a very good chance that in the case of these two great, friendly countries, I think we could very well end up with a real trade deal where the tariffs wouldn't be necessary. We'll see.\" Talking of Canada... Uh oh, Canada Sir Keir was asked about the president's recent comments about wanting to make Canada the 51st US state. The prime minister gave the question short shrift, saying: \"I think you're trying to find a divide between us that simply doesn't exist. \"We're the closest of nations, and we had very good discussions today, but we didn't discuss Canada.\" 'What a beautiful accent' More praise came when Sir Keir said the UK was \"ready to put boots on the ground and planes in the air\" to support a deal on Ukraine working with allies. \"That is the only way peace will last,\" he added As he wrapped up his speech, Mr Trump remarked: \"What a beautiful accent. \"I would have been president 20 years ago if I had that accent.\" Read more:Inside the Oval Office with Donald Trump and Keir StarmerWhat does the King's letter to Trump say? In it to win it Throughout the conference, Sir Keir spoke in language that at times felt alien to his personality - he spoke in Trump rhetoric and appealed to his competitive spirit. \"We believe it's not taking part that counts,\" he said. \"What counts is winning. If you don't win, you don't deliver. \"We're both in a hurry to get things done. And that's what the UK and US do - when we work together, we win and we get things done.\""
    },
    {
        "title": "What does the King's letter to Trump say?",
        "description": "Usually, correspondence written by the King is not made public, but Donald Trump held up the letter in the Oval Office.",
        "url": "https://news.sky.com/story/what-does-the-kings-letter-to-trump-say-13318305",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-letter_6841735.jpg?20250227200818",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-27 20:05:00",
        "Headline": "The King says the UK and the US have \"a vital role to play\" - and mentions the president visiting golf courses.",
        "Content": "Usually, correspondence written by the King is not made public, but Donald Trump held up the letter in the Oval Office. The letter, which was inviting him to the UK for a historic second state visit, was handed to him by Prime Minister Sir Keir Starmer. Here is what we have been able to make out from the photos. In the opening paragraph, the King references the \"breadth of challenges across the world\", and says the UK and the US have \"a vital role to play\". Follow live: Trump questioned about Zelenskyy 'dictator' comment He goes on to say that he remembers \"with great fondness\" Mr Trump's visits to the UK during his \"previous presidency\". The King mentions Mr Trump visiting the golf course the US president owns in Turnberry and then appears to suggest a visit to Balmoral or Dumfries House in Scotland at some stage - estates owned or run by the monarch. \n                  Politics latest: Trump tells Starmer UK may get 'great' trade deal following White House talks\n                 \n                  No 10 will think this US trip could not have gone better\n                 \n                  A 'beautiful' accent and peace deals: Top five moments from Trump and Starmer's press conference\n                 He writes: \"There is much on both Estates which I think you might find interesting and enjoy - particularly as my Foundation at Dumfries House provides hospitality skills-training for young people who often end up as staff in your own establishments! \"Quite apart from this presenting an opportunity to discuss a wide range of issues of mutual interest, it would also offer a valuable chance to plan a historic second State Visit to the United Kingdom. \"As you will know, this is unprecedented by a US president. That is why I would find it helpful for us to be able to discuss, together, a range of options for location and programme content. \"In so doing, working together, I know we will further enhance the special relationship between our two countries, of which we are both so proud.\" After reading the letter Mr Trump said: \"That's a great, great honour. And that says at Windsor - that's really something.\" Mr Trump, the first ever convicted felon to become US president, accepted the invitation from the King - making him the only elected political leader in modern times to be invited to two state visits by a British monarch. Sky News contacted Buckingham Palace to ask when the second state visit might take place and they said: \"When diaries allow.\" Questions remain as to what form the state visit will take, who would accompany Mr Trump in his presidential party and whether this could include his close ally, billionaire businessman Elon Musk who is acting as his senior adviser on federal spending. Mr Trump's first UK state visit took place during his initial term as president - when he was hosted by the late Queen in 2019. Precedent for second-term US presidents who have already made a state visit is usually tea or lunch with the monarch at Windsor Castle, as was the case for George W Bush and Barack Obama. President Trump has earlier separately said he would be visiting the UK in the \"near future\". The Royal Family's soft power diplomacy is viewed as a way of engaging with the controversial billionaire-turned-politician, who is well known for his love of the monarchy. Read more:Inside the Oval Office with Trump and StarmerTrump questioned about Zelenksyy 'dictator' commentStarmer contradicts Vance over free speech claims  A stay at Balmoral in the Scottish Highlands could be seen as appealing to Mr Trump's heritage - his mother Mary Anne was born on the Isle of Lewis in the Outer Hebrides and he has two golf resorts in the country. Buckingham Palace's ongoing £369m refurbishment is focusing on its grandest state rooms, meaning it is unlikely to host any state visits for the next two years. Balmoral - the turreted grey stone castle by the River Dee - is the King's private Scottish home which has served as a summer sanctuary for generations of monarchs since it was bought for Queen Victoria by Prince Albert in 1852. The only other US president to stay at Balmoral was Dwight D Eisenhower in the summer of 1959, but it was an informal trip rather than a state visit. Mr Eisenhower had an affectionate relationship with the late Queen, who made a last minute decision to drive down to Balmoral's Lodge Gate to personally greet her guest when he inspected a guard of honour."
    },
    {
        "title": "Princess Eugenie posts tribute to 'special friend' Michelle Trachtenberg",
        "description": "Princess Eugenie has posted a tribute to Michelle Trachtenberg after the actress's death.",
        "url": "https://news.sky.com/story/princess-eugenie-posts-tribute-to-special-friend-michelle-trachtenberg-13318177",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-michelle-trachtenberg_6841747.jpg?20250227202349",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-27 15:58:00",
        "Headline": "Tributes to the Buffy the Vampire Slayer star have poured in following her death aged 39, with Sarah Michelle Gellar and Blake Lively among the famous faces who have shared messages online. ",
        "Content": "Princess Eugenie has posted a tribute to Michelle Trachtenberg after the actress's death. The Gossip Girl and Buffy the Vampire Slayer star, 39, was found dead at her home in New York City on Wednesday. An investigation into her death has been opened but \"criminality is not suspected\", police said. In a post on Instagram today, Princess Eugenie thanked Trachtenberg for \"so many memories\". \"Goodbye special friend. You are so loved and missed,\" she wrote. \"Thank you for so many memories of laughter and fun. You were so thoughtful and generous and sooo funny. \"My favourite was listening to you order food, always done with precision so you got exactly what we all wanted. \"I'm thinking of you up there friend, of your spirit that was so bright and your joy you brought to so many.\" Eugenie previously lived in New York and in 2013, she was seen attending a basketball game at Madison Square Garden with Trachtenberg. The actress shared numerous social media updates featuring the princess over the years. In 2020, she hailed her as \"one of the most dearest, kindest, most genuine friends I have ever had in my life\" and four years prior, she wrote: \"There are few people in life that you meet that you know are true and real. This lady happens to be one of them.\" Buffy and Gossip Girl co-stars pay tribute Trachtenberg was best known for playing Dawn Summers in Buffy, the younger sister of the title character played by Sarah Michelle Gellar, and starring as Georgina Sparks in Gossip Girl. Paying tribute to her co-star, Gellar shared a series of pictures of herself and Trachtenberg, alongside a caption referencing a scene from the hit show. \"Michelle listen to me. Listen. I love you. I will always love you. The hardest thing in this world, is to live in it. I will be brave. I will live… for you,\" she wrote. James Marsters, who played punk vampire Spike, told fans on Instagram: \"My heart is heavy today. We have lost a beautiful soul. \"Michelle was fiercely intelligent, howlingly funny, and a very talented person. She died much too young, and leaves behind scores of people who knew and loved her.\" A number of Trachtenberg's Gossip Girl co-stars have also shared tributes on social media, with Blake Lively - who starred as Serena van der Woodsen in the teen drama - writing on Instagram: \"Everything she did, she did 200%.\" Lively added: \"She laughed the fullest at someone's joke, she faced authority head on when she felt something was wrong, she cared deeply about her work, she was proud to be a part of this community and industry as painful as it could be sometimes, she was fiercely loyal to her friends and brave for those she loved, she was big and bold and distinctly herself.\" Taylor Momsen, Gossip Girl's Jenny Humphrey, said: \"I will miss you everyday my love.\" \"I'll miss our late night calls that no one should ever hear but us,\" she wrote. \"She was always in my corner and there to support me whether I was right or wrong. \"I think we truly understood each other and I am so grateful to have had a friend like you in my life for so long.\" More from Sky News:Deaths of Gene Hackman and wife 'suspicious enough' to require 'investigation'Nineties boyband to reunite with UK tour \"Michelle was one of a kind,\" wrote fellow Gossip Girl star Chace Crawford. \"I remember her coming on set for the first time and just absolutely owning it. \"She was a force of nature and just so so unapologetically funny and magnetic.. remembering those years with a big smile. Just a terrible loss. Love you.\" \"Rest in peace sweet Michelle,\" Kim Cattrall wrote alongside a picture of herself and Trachtenberg in the 2005 film Ice Princess. Kate Beckinsale posted: \"What a terrible shock and loss, my god. My heart aches for your mama. Fly safe little bird.\" Trachtenberg's most recent film appearance came last year, when she played the role of Michelle Cody White in Spyral. Police said an investigation into her death has been opened but \"criminality is not suspected\"."
    },
    {
        "title": "Could Man City be stripped of titles? Or have points deducted? Experts give their opinions",
        "description": "In the next month or so, we're expecting an independent commission to announce whether Manchester City will face any punishment over more than a hundred counts of alleged financial rule breaches.",
        "url": "https://news.sky.com/story/could-man-city-be-stripped-of-titles-or-have-points-deducted-experts-give-their-opinions-13318083",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-man-city-sergio-aguero_6841494.jpg?20250227153943",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-27 12:57:00",
        "Headline": "Sports correspondent Rob Harris spoke with experts at the Business of Football Summit to hear what they think will happen with the charges Man City are facing.",
        "Content": " In the next month or so, we're expecting an independent commission to announce whether Manchester City will face any punishment over more than a hundred counts of alleged financial rule breaches. The club are facing around 115 charges laid by the Premier League which have been the subject to a hearing which has been held in private. Ahead of the verdicts, Sky News' sports correspondent Rob Harris spoke with some of the world's top football finance experts at the Financial Times' Business of Football Summit 2025 to hear what they think will happen next, and to answer questions from readers. But before we get to their thoughts, let's look at the background of the case. What is the nature of the charges? The greatest proportion of the charges relate to rules that require clubs to provide accurate financial information, and which City are alleged to have breached. They include details concerning the accuracy of information about sponsorship deals and player and manager payment. There are also allegations of breaches of rules requiring clubs to comply with UEFA Financial Fair Play (FFP) regulations - and the Premier League's own profit and sustainability rules (PSR). They are also accused of failing to cooperate with the league's investigation. In all, there are charges relating to every season between 2009-10 and 2022-23. During that period, City won the Premier League title seven times, the FA Cup on three occasions, six League Cups and a Champions League. City have strongly denied the allegations and said they welcomed the opportunity for an independent commission \"to impartially consider the comprehensive body of irrefutable evidence that exists in support of our position\". More context:Rob Harris explains the charges and their impactYour guide to Financial Fair Play in football What's next? Since the charges were announced, hearings have been held in private, during which lawyers from the Premier League and Manchester City have presented evidence and arguments on the case. A panel of retired senior judges sits on an independent commission which will rule on the case very soon. They could find City guilty on all of the charges, guilty of some of them, or clear the club of any wrongdoing. Your questions While we wait for the verdict, readers posed their questions to experts. At the Financial Times' Business of Football Summit 2025, Rob Harris spoke to: 'We've never seen anything like it' Matt Hughes said the case is the clearest example of how football can change radically in just a few years. \"Five, ten years ago, I couldn't have imagined journalists and football fans arguing over arcane matters of competition law and issues such as associated party transactions - it feels like the last ten years of the Premier League has all crystallised in this one case,\" he said. That was echoed by Simon Leaf, who said the case was \"truly unprecedented in the history of football and financial regulation in football\", before adding that such regulation is only 10 or 15 years old itself. \"We've never quite seen anything like it,\" he said. And with a case of that size comes the challenge of proving it. Martin Lipton said it's a \"huge ask\" for the Premier League to prove any of the charges, as they'd have to show beyond any doubt that City knowingly \"defrauded football\". Could only a few guilty verdicts lead to a points deduction? As we mentioned above, it's not yet clear whether the independent commission will find City guilty on all charges - but what if they were found to have broken a few rules? Could we expect a heavy fine or points deduction for each charge broken? Our experts explained that the first problem is that we're effectively in the dark until the verdict is released in full. \"We still don't know exactly how many charges [City] are facing,\" Hughes said, noting that figures have been floating around the 115, 129 or even 130 mark, but nothing is certain yet. \"Everything's been done confidentially,\" Lipton said, adding that we will only get an understanding of what they've actually been charged with with the verdicts. Others may look to precedent. Last season, Everton were twice docked points for breaching the Premier League's PSR. Nottingham Forest were also deducted four points during the last campaign. But, as the experts explained, these were for more straightforward charges of overspending - something fairly straightforward to prove (additionally, this, alongside the number of charges, is one of the main reasons the case has taken so long to reach a conclusion). Many of City's charges relate to overinflated sponsorship deals - which is entirely more subjective and therefore much more difficult to prove. For instance, a sponsorship deal involving a global superclub like Manchester United would have a vastly different value to one with a newly promoted side like Southampton. \"What it comes down to is trying to assess the market value of these deals... and it's very hard to know what the value should be from club to club,\" Leaf said. \"Equally, the rights are not the same [in every deal] - some include hospitality access for sponsors,\" he added. \"One of the deals we did a few years ago involved a country's national ballet being able to appear at the [club's] stadium - how do you put a [market] value on something like that?\" Could City have Premier League titles stripped from them? \"There seems to be no appetite to take retrospective punishment,\" said Hughes when asked this question. But Leaf said it was still too early to say. \"I suspect there will be certain clubs looking at this and saying, actually we would have been entitled to payments for qualifying for Champions League... or even bonuses from sponsors from finishing in a different position,\" he said, suggesting this would give the commission something else to think about when making its decisions. But Lipton said he'd be very surprised if City were to be stripped of titles, given that that would undermine the Premier League's history. \"If you were to strip titles, the single most iconic moment in the history of the Premier League - Sergio Aguero's 94th minute goal against QPR to win the league - didn't happen,\" he said. \"You can't rewrite history to that extent,\" he said, adding title stripping is just \"not going to happen\". What if City are cleared? If City's position is vindicated, it is likely to lead to serious questions about the Premier League's ability to effectively govern its clubs and enforce financial regulations. This is at a time when football is on course to become subject to wider independent regulation, something which is widely supported by supporter groups. Other clubs who have faced punishment in the past will also want to pick through the details of the verdict and may have further questions about how the rules are being applied. But it also opens the door for City to go for the jugular, our experts said. \"If City were to be cleared of absolutely everything, then the next question will be - what happens to the Premier League leadership?\" Lipton asked. He described the case as nothing more than a \"brutal civil war\" and should City win it, they'll seek \"the complete decapitation of the entire leadership\". What about an appeal? Either side can appeal against any ruling. \"We're hoping to get an initial judgment next month,\" Hughes said, adding the issue as a whole won't be resolved for a long time, whatever the verdict is. Leaf noted that it's highly unlikely there will be a finding that both sides are happy with, making the possibility of a lengthy appeals process high. \"If there's an appeal, there's a separate commission [that presides over it],\" Lipton said, suggesting that we'd effectively be starting again. You can watch Rob's full Q&A with Matt, Simon and Martin at the top of this page."
    },
    {
        "title": "Woman, 19, dies in dog attack in Bristol - two people arrested",
        "description": "A 19-year-old woman has died after being attacked by a dog in Bristol, police have said.",
        "url": "https://news.sky.com/story/woman-19-dies-in-dog-attack-in-bristol-two-people-arrested-13318074",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-cobhorn-drive-bristol_6841345.jpg?20250227125433",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-27 12:39:00",
        "Headline": "Two people - a man and a woman both aged in their 20s - have been arrested and remain in police custody.",
        "Content": "A 19-year-old woman has died after being attacked by a dog in Bristol, police have said. Two people - a man and a woman both aged in their 20s - have been arrested and remain in police custody. Neighbourhood Inspector Terry Murphy said: \"A full investigation is now well under way to establish the full circumstances of the events that led to her death.\" At 7.19pm, police received a report from the ambulance service of the incident inside a flat in Cobhorn Drive, Bristol. Despite the efforts of the emergency services, the victim died at the scene. Two people were arrested on suspicion of offences under the Dangerous Dogs Act, including being in possession of a prohibited breed of dog. A neighbour paid tribute to the victim, saying she \"seemed a lovely girl\" and had only lived in the property for a few weeks. \"I was up all night awake trying to process this,\" the neighbour, who did not want to be named, said. \"I am shocked. I just can't believe it's happened and she hasn't been there that long.\" Initial reports suggested the dog may be an XL bully, but confirming the breed will form part of the police assessment process, according to Avon and Somerset Police. It was sedated and seized by officers. The neighbour said she had seen the dog on a lead with its owner and was certain it was an XL bully. \"I do feel so sad for the dog owner,\" she said. \"She did mention the dog wasn't great with men, fine with women and children. \"I feel for her so, so much. It wasn't her fault.\" She added: \"I genuinely feel that this was one of those freak accidents and wasn't her fault - that's how I feel.\" Read more from Sky News:Actor Gene Hackman and wife found dead at homeStarmer in Washington for Trump talksProbe blasts off to chase asteroid Avon and Somerset Police inspector Terry Murphy said: \"As part of this work, Cobhorn Drive was closed last night and I thank everyone for their patience and understanding about our need to do this,\" said Inspector Murphy. \"There will be an increased police presence in the area over the coming days, including neighbourhood officers, and if you have any concerns please do speak to them.\"  In February 2024, it became a criminal offence to own the XL bully breed in England and Wales without an exemption certificate. Anyone who owns one of the dogs must have had the animal neutered, have it microchipped and keep it muzzled and on a lead in public, among other restrictions. The government moved to ban XL bullies followed a series of attacks on people and other dogs."
    },
    {
        "title": "Christopher Hughes: Eggheads star and former Mastermind and Brain of Britain winner dies",
        "description": "Christopher Hughes, who was one of the stars of the hit TV show Eggheads, has died.",
        "url": "https://news.sky.com/story/christopher-hughes-eggheads-star-and-former-mastermind-and-brain-of-britain-winner-dies-13318182",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-christopher-hughes_6841524.jpg?20250227162237",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-27 15:53:00",
        "Headline": "Hughes was in the original line-up and joined the show after winning Mastermind, International Mastermind. He was also crowned Brain of Britain.",
        "Content": "Christopher Hughes, who was one of the stars of the hit TV show Eggheads, has died. Hughes was a member of the regular panel of quiz experts on the programme, which was first broadcast in 2003. He passed away at his home in Crewe at the age of 77, according to reports. Hughes was in the original line-up and joined the show more than 20 years ago after winning Mastermind and International Mastermind in 1983. He was also crowned Brain of Britain in 2005. The Eggheads programme wrote on social media: \"It is with immense sadness that we announce the passing of Eggheads great Chris Hughes. \"Chris joined the show at the very start in 2003 and over the next 20 years gave us not only brilliant answers but very many laughs and happy memories. \n                  Deaths of Gene Hackman and wife 'suspicious enough' to require 'investigation' - police warrant\n                 \n                  Princess Eugenie posts tribute to 'special friend' Michelle Trachtenberg\n                 \n                  Gene Hackman death latest: Deaths of actor and wife 'suspicious enough' to require 'investigation' - police warrant\n                 \"He loved being an Egghead and will be hugely missed by all his Eggheads family.\" Read more from Sky News:Nineties boyband reunite and will tour the UKPeppa Pig due to get another sibling 'An amazing Egghead' Eggheads producer Robert Dean wrote on X: \"Very sad to say that our brilliant Egghead Chris has sadly passed away. He was an amazing Egghead who considered everyone on the production team part of his family. \"I have such fond memories of him and count myself lucky to have known him. I'll miss him tremendously.\" The general knowledge challenge programme began on the BBC before moving to Channel 5. In the show, a team made up of members of the public tried to beat the \"eggheads\". If they were successful, they would take home a cash prize, and if not £1,000 would roll over to the next show. The series was fronted by news presenter Dermot Murnaghan, before Radio 2 DJ and Channel 5 talk show host Jeremy Vine took over the role."
    },
    {
        "title": "Andrew Tate arrives in US after travel ban was lifted - as Trump says he knows 'nothing about that'",
        "description": "Andrew Tate and his brother Tristan have landed in Florida in the US after a travel ban in Romania was lifted - as Donald Trump insisted he knows \"nothing about that\".",
        "url": "https://news.sky.com/story/andrew-tate-and-his-brother-tristan-have-left-romania-for-the-us-reports-13317873",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-andrew-tate_6841694.jpg?20250227190455",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-27 07:26:00",
        "Headline": "Self-described misogynist Andrew Tate - a champion of Donald Trump - and his brother are facing a series of charges in Romania. ",
        "Content": " Andrew Tate and his brother Tristan have landed in Florida in the US after a travel ban in Romania was lifted - as Donald Trump insisted he knows \"nothing about that\". The Tates landed in Fort Lauderdale in a private plane at around 11:30am local time, their representative Mateea Petrescu added. Speaking around an hour later, Andrew Tate told reporters: \"We've yet to be convicted of any crimes in our lives ever. We have no criminal record anywhere on the planet ever. \"Our case was dismissed on 19 December in Romania under the Biden administration, and our prosecutor recently decided, because we have no active indictment in court, to let us go and return. \"This is a Democratic society, we're supposed to be innocent until proven guilty, as my brother and I are.\" The brothers, who champion US President Trump, are facing charges in Romania of human trafficking, sexual misconduct and money laundering, as well as starting an organised crime group. The self-styled misogynists are dual UK and US nationals whose controversial views are shared widely on social media platforms such as TikTok and X. Their arrival in Fort Lauderdale comes after the Financial Times reported last week that the Trump administration had lobbied their Romanian counterparts to ease restrictions on the brothers while they face charges. Romanian foreign minister Emil Hurezeanu said the Tates were mentioned during his brief hallway meeting with Mr Trump's special envoy Richard Grenell at the Munich Security Conference earlier this month. Mr Trump was asked about the arrival of the Tates in the US while meeting with UK Prime Minister Sir Keir Starmer at the White House this evening. Asked by a reporter if his administration pressured the Romanian government to let the Tates travel, the US president told reporters: \"I know nothing about that. You're saying (Andrew Tate) is on a plane right now? \"I just know nothing about it, we'll check it out, we'll let you know.\" Romanian prosecutors later said they had approved a request from Andrew Tate, 38, to travel outside of the country, pending the outcome of a criminal investigation. The pair had been released from house arrest, but were not allowed to leave the country and were required to check in with the police regularly. Read more:How Tate's business made millions - despite sex trafficking chargesWho is the self-styled 'king of toxic masculinity? \"The request to change the obligation of not leaving Romania was approved,\" prosecutors said in a statement on Thursday. \"All the other obligations have been maintained, including the requirement to check in with judicial authorities every time they are called.\" A spokeswoman for the Tates told Sky News the Romanian courts had decided they will return to the brothers all of their assets. This includes restoring their ownership of all previously frozen bank accounts, five properties, six cars including two Audis and a Ferrari, and company shares. Some assets will remain under precautionary seizure, according to the court ruling. The brothers are fighting a series of legal battles not just in Romania, but also in the UK and the US. They have consistently denied any wrongdoing in connection with all the legal action taking place. The Tates grew up in Luton and have millions of social media followers. Andrew Tate also appeared in the UK version of Big Brother in 2016. The pair are often criticised for their misogynistic views online - particularly as they have a predominately young, male audience. A number of banned Twitter accounts have been reinstated by Elon Musk. Tate was among those brought back on 18 November 2022 after Musk took over and rebranded it X. A British court ruled in March that the brothers are also under a European arrest warrant and will be extradited to the UK - where allegations of rape and human trafficking are being investigated by Bedfordshire Police - after Romanian trial proceedings finish for a separate investigation. A recent lawsuit filed in Florida accuses both Tate brothers of conspiring to coerce a woman into sex work, luring her to Romania and defaming her after her testimony to Romanian authorities. The Tate brothers had previously sued her for defamation in 2023. Read more from Sky News:Actor Gene Hackman and wife found dead at homeStarmer in Washington for Trump talksProbe blasts off to chase asteroid Four British women who allege they were raped and coercively controlled by Andrew Tate said they have been \"retraumatised\" by today's events. \"It is clear that there is now a major risk that the criminal prosecution for his alleged crimes in Romania will not proceed, and he may use this development as an opportunity to harass further and intimidate witnesses and his accusers as well as continue to spread a violent, misogynistic doctrine around the world,\" the alleged victims said in a joint statement. Tate is facing civil action brought by the women at the High Court. He denies the allegations and has threatened to pursue the women for defamation. Matthew Jury, their solicitor at McCue Jury & Partners, said: \"The news that pressure by the Trump administration has led to Andrew Tate, and his brother Tristan, being allowed to leave Romania by its authorities is equal parts disgusting and dismaying.\" He added: \"The UK government knew this might happen more than a week ago. The fact that nothing seems to have been done to prevent it is concerning. One can only hope action will now be taken. Given that Prime Minister Starmer is in the US today to meet with President Trump, perhaps his team may take the opportunity to raise this issue.\""
    },
    {
        "title": "Andrew Tate arrives in US after travel ban was lifted - as Trump says he knows 'nothing about that'",
        "description": "Andrew Tate and his brother Tristan have landed in Florida in the US after a travel ban in Romania was lifted - as Donald Trump insisted he knows \"nothing about that\".",
        "url": "https://news.sky.com/story/andrew-tate-and-his-brother-tristan-have-left-romania-for-the-us-reports-13317873",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-andrew-tate_6841694.jpg?20250227190455",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-27 07:26:00",
        "Headline": "Self-described misogynist Andrew Tate - a champion of Donald Trump - and his brother are facing a series of charges in Romania. ",
        "Content": " Andrew Tate and his brother Tristan have landed in Florida in the US after a travel ban in Romania was lifted - as Donald Trump insisted he knows \"nothing about that\". The Tates landed in Fort Lauderdale in a private plane at around 11:30am local time, their representative Mateea Petrescu added. Speaking around an hour later, Andrew Tate told reporters: \"We've yet to be convicted of any crimes in our lives ever. We have no criminal record anywhere on the planet ever. \"Our case was dismissed on 19 December in Romania under the Biden administration, and our prosecutor recently decided, because we have no active indictment in court, to let us go and return. \"This is a Democratic society, we're supposed to be innocent until proven guilty, as my brother and I are.\" The brothers, who champion US President Trump, are facing charges in Romania of human trafficking, sexual misconduct and money laundering, as well as starting an organised crime group. The self-styled misogynists are dual UK and US nationals whose controversial views are shared widely on social media platforms such as TikTok and X. Their arrival in Fort Lauderdale comes after the Financial Times reported last week that the Trump administration had lobbied their Romanian counterparts to ease restrictions on the brothers while they face charges. Romanian foreign minister Emil Hurezeanu said the Tates were mentioned during his brief hallway meeting with Mr Trump's special envoy Richard Grenell at the Munich Security Conference earlier this month. Mr Trump was asked about the arrival of the Tates in the US while meeting with UK Prime Minister Sir Keir Starmer at the White House this evening. Asked by a reporter if his administration pressured the Romanian government to let the Tates travel, the US president told reporters: \"I know nothing about that. You're saying (Andrew Tate) is on a plane right now? \"I just know nothing about it, we'll check it out, we'll let you know.\" Romanian prosecutors later said they had approved a request from Andrew Tate, 38, to travel outside of the country, pending the outcome of a criminal investigation. The pair had been released from house arrest, but were not allowed to leave the country and were required to check in with the police regularly. Read more:How Tate's business made millions - despite sex trafficking chargesWho is the self-styled 'king of toxic masculinity? \"The request to change the obligation of not leaving Romania was approved,\" prosecutors said in a statement on Thursday. \"All the other obligations have been maintained, including the requirement to check in with judicial authorities every time they are called.\" A spokeswoman for the Tates told Sky News the Romanian courts had decided they will return to the brothers all of their assets. This includes restoring their ownership of all previously frozen bank accounts, five properties, six cars including two Audis and a Ferrari, and company shares. Some assets will remain under precautionary seizure, according to the court ruling. The brothers are fighting a series of legal battles not just in Romania, but also in the UK and the US. They have consistently denied any wrongdoing in connection with all the legal action taking place. The Tates grew up in Luton and have millions of social media followers. Andrew Tate also appeared in the UK version of Big Brother in 2016. The pair are often criticised for their misogynistic views online - particularly as they have a predominately young, male audience. A number of banned Twitter accounts have been reinstated by Elon Musk. Tate was among those brought back on 18 November 2022 after Musk took over and rebranded it X. A British court ruled in March that the brothers are also under a European arrest warrant and will be extradited to the UK - where allegations of rape and human trafficking are being investigated by Bedfordshire Police - after Romanian trial proceedings finish for a separate investigation. A recent lawsuit filed in Florida accuses both Tate brothers of conspiring to coerce a woman into sex work, luring her to Romania and defaming her after her testimony to Romanian authorities. The Tate brothers had previously sued her for defamation in 2023. Read more from Sky News:Actor Gene Hackman and wife found dead at homeStarmer in Washington for Trump talksProbe blasts off to chase asteroid Four British women who allege they were raped and coercively controlled by Andrew Tate said they have been \"retraumatised\" by today's events. \"It is clear that there is now a major risk that the criminal prosecution for his alleged crimes in Romania will not proceed, and he may use this development as an opportunity to harass further and intimidate witnesses and his accusers as well as continue to spread a violent, misogynistic doctrine around the world,\" the alleged victims said in a joint statement. Tate is facing civil action brought by the women at the High Court. He denies the allegations and has threatened to pursue the women for defamation. Matthew Jury, their solicitor at McCue Jury & Partners, said: \"The news that pressure by the Trump administration has led to Andrew Tate, and his brother Tristan, being allowed to leave Romania by its authorities is equal parts disgusting and dismaying.\" He added: \"The UK government knew this might happen more than a week ago. The fact that nothing seems to have been done to prevent it is concerning. One can only hope action will now be taken. Given that Prime Minister Starmer is in the US today to meet with President Trump, perhaps his team may take the opportunity to raise this issue.\""
    },
    {
        "title": "Major internal investigation reveals IDF failures in October 7 attack",
        "description": "The Israel Defence Forces has admitted the attacks by Hamas on October 7 2023 were \"a complete failure\" of Israeli security and the result of many years of planning and deception by the Gaza-based militant group.",
        "url": "https://news.sky.com/story/idf-admits-israeli-security-completely-failed-when-hamas-launched-october-7-attack-13318202",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-nova-festival-israel_6841586.jpg?20250227170949",
        "type": "World",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-02-27 16:48:00",
        "Headline": "The inquiry, which is the result of tens of thousands of hours of work by the IDF Southern Command, found as many as 5,600 terrorists broke into Israel in three waves.",
        "Content": "\n          Middle East correspondent\n              @AliBunkallSKY\n The Israel Defence Forces has admitted the attacks by Hamas on October 7 2023 were \"a complete failure\" of Israeli security and the result of many years of planning and deception by the Gaza-based militant group. Announcing some of the findings from a major internal investigation, the Israeli military said \"the IDF failed in its mission to protect people\" and it was \"one of the greatest failures\" in the military's history. Nobody in the Israeli security establishment knew of, or predicted, the attacks and the force stationed on the border was the minimum required for everyday threats. The primary focus at the time was on the threat from Iran and Hezbollah. The inquiry concluded that those actors were aware of Hamas's plans but probably didn't know the exact timing of the attacks. Gaza was seen as a secondary threat and while Hamas was considered an illegitimate governing body of Gaza, there was no effort to develop an alternative. The inquiry, which is the result of tens of thousands of hours of work by the IDF Southern Command, found as many as 5,600 terrorists broke into Israel in three waves. On October 7 2023, 4,694 mortars and rockets were fired from Gaza into Israel, and 1,320 people were killed and 251 taken hostage. \n                  Hamas releases bodies of last hostages included in first phase of ceasefire - as hundreds of Palestinian prisoners are freed\n                 \n                  Thousands line streets in Israel for Bibas family funeral procession\n                 \n                  Operation Iron Wall: West Bank areas 'turning into mini-Gaza' as Israeli troops bulldoze homes\n                 As the IDF battled to regain control of southern Israel the same day, some of its commanders were forced to use google maps and mobile phones to communicate and co-ordinate. The majority of killings and kidnappings occurred during the first two waves of attacks, between 6.29am and 9am on that Saturday morning. Many Palestinians who entered Gaza in the third wave, during the afternoon, were from other terror organisations or \"a mob taking advantage\" rather than Hamas fighters trained for the attack. In the chaos, the Israeli air force struggled to distinguish between Hamas fighters and Israeli civilians. The IDF accepts there were some deaths caused by friendly fire but haven't elaborated how or where. By 5pm, there were still hundreds of Hamas fighters spread out along the so-called Gaza envelope of Israeli communities, many in open areas. It's thought they planned to reach deeper into Israel, including Ashkelon and key air bases.  Intelligence assessments at the time believed that Hamas didn't want a full-scale war and lacked the capability to launch one. IDF officials believed there would be early warnings if an attack was imminent, and the strategy was to \"maintain the threat\" rather than neutralise it. Based on that, officials said soldiers \"were addicted to the precise intelligence information\" and failed to challenge the assumptions internally. Although there were some unusual indications an attack was under way overnight, such as the activation of Israeli SIM cards inside Gaza, duty officers didn't think it was time-critical and further investigation was needed. More from Sky News:Trump shares bizarre AI video of vision for GazaHamas release bodies of hostagesWest Bank 'turning into mini Gaza' Hamas activity in a specific area was dismissed as a training exercise. After consultation with senior commanders in the middle of the night, it was decided to hold a situational assessment early in the morning. The attack happened before that took place. The scale and brutality of the attack took the IDF by surprise and their defensive strategies, including a vastly expensive subterranean wall, proved ineffective. The barrier was designed to stop mass protests and limited infiltration but not a large-scale attack. Forces along the border had been reduced because of other requirements on the Lebanon border and in the West Bank, and the IDF had too much confidence in the barrier defences. Through various intelligence sources, including material found in Gaza, it's now understood that Hamas's leader at the time, Yahya Sinwar, first conceived the idea in November 2016. A plan to attack Israel was approved in July 2019. During those years, Hamas deceived Israel, convincing leaders it wanted economic prosperity rather than conflict. A short war between the two in 2021 didn't inflict as much damage on Hamas infrastructure and capabilities as Israel believed. Hamas was close to launching the attacks on three occasions during 2022 but decided not to for unknown reasons. They eventually did so to take advantage of a Jewish religious holiday in 2023. The inquiry has also compiled 41 separate findings of battles in specific kibbutzim, military bases and key roads. Those details are being presented to the individual communities over the coming days. The Israeli government has repeatedly rejected calls for a State Commission of Inquiry, saying the time is not yet right because of the ongoing war. Critics of Israeli Prime Minister Benjamin Netanyahu say he is avoiding personal responsibility for his role as Israel's leader at the time."
    },
    {
        "title": "Authorities failed to investigate original claims of British woman accused of lying about being gang-raped on holiday",
        "description": "Cypriot authorities failed to investigate the original claims of a British woman who was later convicted of lying about being gang-raped on holiday there, the European Court of Human Rights has ruled.",
        "url": "https://news.sky.com/story/authorities-failed-to-investigate-original-claims-of-british-woman-accused-of-lying-about-being-gang-raped-on-holiday-13317455",
        "image_url": "https://e3.365dm.com/22/01/1920x1080/skynews-cyprus-rape_5657939.jpg?20250226134610",
        "type": "World",
        "Author": "Lara Keay",
        "Date Published": "2025-02-27 11:00:00",
        "Headline": "The woman was 19 in the summer of 2019 when she claims she was raped by 12 Israeli men at a hotel in the party resort of Ayia Napa. The men denied the claims. The woman's lawyer has told Sky News he welcomes a ruling from the European Court of Human Rights.",
        "Content": "\n          News reporter\n              @LaraKeay\n Cypriot authorities failed to investigate the original claims of a British woman who was later convicted of lying about being gang-raped on holiday there, the European Court of Human Rights has ruled. The woman, who is now in her 20s, was 19 in the summer of 2019 when she claims she was raped by 12 Israeli men at a hotel in the party resort of Ayia Napa. After retracting her statement 10 days later, she was charged with \"public mischief\" for making the allegations. The woman, from Derbyshire, ended up spending more than a month in jail awaiting trial and was eventually given a suspended prison sentence. She appealed her case at the Cypriot Supreme Court in Nicosia and got her conviction quashed, with the judge ruling she had likely been forced into changing her statement and was not given a fair trial. But the island's attorney general refused to reopen the original case, leading her lawyers to take it to the European Court of Human Rights (ECHR) in Strasbourg. On Thursday, the ECHR highlighted a \"series of shortcomings by the investigative authorities\" and ruled they \"had fallen short of the state's duty to effectively investigate the applicant's allegations\". The judgment adds that \"certain biases concerning women in Cyprus... impeded the effective protection of [the woman's] rights as a possible victim of gender-based violence\". \"The credibility of her allegations appeared to have been assessed through prejudicial gender stereotypes and victim-blaming attitudes,\" it reads. The court also ruled that the mishandling of the case constituted a violation of the woman's right to a private and family life and awarded her €20,000 (£16,500) in damages and €5,000 (£4,100) in costs. Read moreTimeline of how British woman accused of lying won human rights case Michael Polak, the woman's lawyer and director of the group Justice Abroad that has been supporting her, told Sky News: \"This landmark judgment means a lot to her - but it also means a lot to victims of sexual violence across Europe. \"She's obviously very pleased. It's a complete vindication of everything she's said all along - but what a terrible journey she's been on in this case, and of course, these offences leave lifelong scars. \"So we welcome the decision, but it's a pity we had to take it all the way to the European Court of Human Rights to get some form of justice.\" He added that the ruling reveals a \"systematic, cultural problem in relation to lack of belief and treatment of those who complain about sexual offences\" in Cyprus. Mr Polak believes there is now an \"obligation\" for Cypriot authorities to \"do the right thing\" and launch a fresh investigation into the original rape claims, which his legal team says should be carried out by a separate police force. During previous court hearings, Mr Polak's team pointed out that the judge in the public mischief trial had repeatedly shouted \"this is not a rape trial\" and \"I don't want to hear evidence about rape\" as she gave her testimony. On Thursday, the ECHR judgment said that \"the numerous times [the woman] had had to repeat what had happened to the authorities, and their failure to adopt a victim-sensitive approach, constituted evidence of re-victimisation\". The case sparked concern about fair trial guarantees in Cyprus, with the Foreign Office vowing to raise the case with authorities there, and protests being held in support of the woman in Cyprus, London, and elsewhere. All 12 of the original suspects were freed without charge and allowed to return to Israel. They denied the allegations against them. The Cypriot authorities have also denied any wrongdoing regarding to their investigation."
    },
    {
        "title": "Jailed Kurdish leader Abdullah Ocalan urges PKK to disarm as part of Turkey peace effort",
        "description": "Jailed Kurdish leader Abdullah Ocalan has called on his militant group to disarm as part of a fresh bid to end a decades-long conflict with the Turkish state.",
        "url": "https://news.sky.com/story/jailed-kurdish-leader-abdullah-ocalan-urges-pkk-to-disarm-as-part-of-turkey-peace-effort-13318149",
        "image_url": "https://e3.365dm.com/22/12/1920x1080/skynews-france-protests_6005431.jpg?20221224125311",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-27 14:56:00",
        "Headline": "In a message from prison, Ocalan said the Kurdistan Workers' Party (PKK) should lay down arms and disband.",
        "Content": "Jailed Kurdish leader Abdullah Ocalan has called on his militant group to disarm as part of a fresh bid to end a decades-long conflict with the Turkish state. In a message from his prison on an island off Istanbul, Ocalan said the Kurdistan Workers' Party (PKK) should hold a congress and formally agree to disband. Ocalan told members to \"lay their arms\" and said the PKK \"must dissolve itself\", according to a message relayed by pro-Kurdish politicians who visited him on Thursday. His intervention comes amid a new effort to establish peace between the militant group and the Turkish state. The peace bid was initiated in October by President Recep Tayyip Erdogan's coalition partner, Devlet Bahceli. As part of the deal, Ocalan could be granted parole if the PKK were to renounce violence and disband. Ocalan, 75, continues to have significant influence over the PKK, despite having been imprisoned in 1999 after he was convicted of treason. Read more from Sky News:MP jailed for punching constituent walks free after appealOscar-winning actor Gene Hackman found dead with wife and dog The PKK was founded by Ocalan in 1978 and has led an insurgency in Turkey's south-east region since 1984. Considered a terrorist organisation by Turkey and its Western allies, previous peace efforts with the PKK have ended in failure. Despite the latest peace efforts, Mr Erdogan's government has widened a crackdown on the opposition, arresting journalists and politicians."
    },
    {
        "title": "Inside a Ukrainian titanium mine – one of the minerals Donald Trump may well be after",
        "description": "It looks like the surface of an alien planet.",
        "url": "https://news.sky.com/story/inside-a-ukrainian-titanium-mine-a-mineral-donald-trump-may-well-be-after-13317847",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-deborah-haynes-ukraine_6841029.jpg?20250227055433",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2025-02-27 05:47:00",
        "Headline": "Sky News was given access to one of Ukraine's open-pit titanium mines where one company has been excavating for 15 years - and has barely touched the surface.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  It looks like the surface of an alien planet. Giant, pointed mounds of soil form ridges around huge frozen ponds across a vast landscape of sandy earth and enormous craters. As if borrowed from the set of Star Wars, a colossal rectangular metal box, fitted with a long metallic arm, chain and gigantic scoop, gouges out chunks of land from one of the sprawling cavities, the arm swinging back and forth to empty its load on to another mini mountain of dirt. This is one of Ukraine's open-pit titanium mines - a natural resource Donald Trump may well be after as he prepares to sign a deal with Kyiv to access Ukrainian minerals, rare earth and other raw materials. The site in Zhytomyr region, in the northwest of the country, is owned by Group DF, an international collection of companies founded by a Ukrainian businessman. 'We've barely touched the surface' Its director of mining told Sky News that it would take at least 200 years - probably more - to extract all the titanium ore from across Ukraine. At this location alone, the company has been excavating for 15 years and has barely touched the surface. \"Ukraine is Europe's titanium hub. That's a fact,\" said Dmytro Holik, whose full job title is Group DF director of mining and concentrating plant. \"Our plant produces around 15,000 tonnes of ilmenite per month, or approximately 200,000 tonnes annually,\" he said. One tonne is worth about $250. Foreign investment would be a 'game-changer'  Ilmenite is a black iron-titanium oxide mineral and the primary ore of titanium - a hugely useful material that is used in an array of products from paint to dental implants. As a lightweight, durable metal, it is also a valuable component in weapons. However, the titanium extracted from the Zhytomyr site is only used in civilian products. Mr Holik said he would welcome American or any other foreign investment into Ukraine to help the country improve its ability to extract its mineral reserves. \"There's an abundance of raw materials,\" he said. \"Right now, our local investors simply lack the financial capacity to fund large-scale factories, deep-processing facilities, and advanced technologies... \"If a major international investor steps in - one with a long-term vision, not just for five or 10 years, but for 40 to 50 years - it would be a game-changer.\" He said his nation has all the expertise - the scientists, engineers and other skilled professionals. Read more:Which countries could Putin go for next?Who has given Ukraine the most aid?Ukraine 'agrees terms with US on minerals deal' \"What Ukraine lacks right now is investment and advanced technologies, which could be developed through partnerships.\" He said this would enable mines to modernise and improve their ability to extract minerals from the soil. But Mr Holik said it was important that any investment deal benefits Ukraine. \"The shareholder could be a private investor, a government entity, or even international stakeholders - it doesn't really matter. What matters is that the people are protected,\" he said. \"It's about ensuring that I, my family, and my fellow citizens can work with confidence in the future. It's about making sure the country is secure. Ideally, a portion of these profits should go toward defence and security so that Ukraine can protect itself.\" Ukraine's president also wants to use his deal with Mr Trump - which could be signed on Friday when the two leaders are due to meet in the White House - to secure American military support against Russia in the event of a ceasefire deal.  Sky News was given a tour around the mining site to see how titanium ore is retrieved from the sand. An excavator - the giant digging device - is used to dig through a top layer of grass-covered clay to a depth of about 15 metres. This is where the ilmenite is found. It can take about six months to reach that point.  The digger then works for another six months, painstakingly scooping up huge chunks of sand - about 20 tonnes per scoop - to a depth of 15 to 20 metres. The sand contains varying quantities of the titanium ore - from 1% to 10%. It is mixed with water and flushed along large pipes that frame the mine and are connected to two processing plants. In one of the facilities, the titanium is enriched to about 70%. Read more from Sky News:Hamas releases bodies of last hostagesStarmer arrives in US for Trump talksProbe blasts off to chase asteroid It is then transferred to the second factory where it is dried inside enormous rotating tubes, before being passed through magnetic and electrical machines to enrich it to 97%. At that point, the titanium is ready to be exported. Once an area of land is mined, the company says it fills the holes back up to avoid causing long-term harm to the environment. \"When we've removed all the valuable minerals and the rest of the material returns from the plant - 100% of the material is sent there, but only 5% of it is valuable titanium ore - the remaining 95% is returned here, spread out, and the land will be reclaimed,\" Mr Holik said. \"We'll replant trees.\""
    },
    {
        "title": "Campbell Scott: Kenyan police 'confident' of catching killer of Scottish man found in sack of pineapples",
        "description": "Police have said they are \"confident\" they will catch whoever murdered a Scottish businessman whose body was found in a sack of pineapples in Kenya.",
        "url": "https://news.sky.com/story/campbell-scott-kenyan-police-confident-of-catching-killer-of-scottish-man-found-in-sack-of-pineapples-13318055",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-campbell-scott-fico_6838871.jpg?20250227120059",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-27 12:00:00",
        "Headline": "The death of Campbell Scott is being treated as murder with two people arrested as inquiries continue.",
        "Content": "Police have said they are \"confident\" they will catch whoever murdered a Scottish businessman whose body was found in a sack of pineapples in Kenya. Campbell Scott, believed to be from Dunfermline in Fife, was last seen attending a conference at the JW Marriot Hotel in Nairobi on 16 February. His body was days later discovered in a sack of pineapples in a forest around 66 miles southeast of the city. His death is being treated as murder and two people have been arrested as inquiries continue. A National Police Service spokesperson described it as a \"heinous, heinous crime\". The case is being investigated by the homicide unit of Kenya's Directorate of Criminal Investigations. The police spokesperson added: \"It's really tragic, but we're all told that the authorities are going to get to the bottom of this. \n                  Missing British businessman Campbell Scott found dead in Kenya\n                 \n                  Kenya: At least 17 students killed in school fire\n                 \n                  Rebecca Cheptegei: Ugandan Olympic athlete dies after being doused in petrol and set on fire by boyfriend\n                 \"We are confident somebody will be held accountable for this.\" Thomas Maitha, a local administrator and Kivani location chief, previously told Kenya's The Standard newspaper that Mr Scott's hands had been tied at the back. He added: \"He appeared to have been tortured. The body, which was in bad state, prompted us to escalate the matter further.\" Read more from Sky News:Oscar-winning actor and wife found dead at home with their dogTate brothers have left Romania for the US Mr Scott was a senior director at credit scoring firm Fico. After his death was confirmed, a Fico spokesperson said: \"We are devastated by this tragic news. Campbell was a leader in our international Scores business. \"He joined Fico in 2014 and was instrumental in introducing Scores to new markets and growing our business with existing partnerships. \"We mourn his passing and will miss his humour and kindness. \"Our thoughts are with Campbell's family and friends.\" The Foreign, Commonwealth and Development Office (FCDO) said it is supporting Mr Scott's family and is in contact with the local authorities in Kenya."
    },
    {
        "title": "Hunt for missing Malaysia Airlines Flight MH370 to resume 10 years after plane vanished",
        "description": "The hunt for the missing&#160;Malaysia Airlines Flight MH370 is set to resume - more than a decade after it vanished in one of the greatest ever aviation mysteries.",
        "url": "https://news.sky.com/story/hunt-for-missing-malaysia-airlines-flight-mh370-to-resume-10-years-after-plane-vanished-13317933",
        "image_url": "https://e3.365dm.com/16/02/1920x1080/rtr4sccx-1-2048x1536_3420870.jpg?20160224132833",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-27 09:33:00",
        "Headline": "The disappearance of Malaysia Airlines Flight MH370 is one of the greatest ever aviation mysteries. Could it finally be solved this time?",
        "Content": "The hunt for the missing Malaysia Airlines Flight MH370 is set to resume - more than a decade after it vanished in one of the greatest ever aviation mysteries. There were 239 people on board the Boeing 777 when it disappeared on its way from Kuala Lumpur to Beijing on 8 March 2014. Based on satellite data analysis, it's thought the plane likely crashed somewhere in the southern Indian Ocean, off the coast of western Australia, but two major searches have failed to yield significant findings. In December, Malaysia agreed to resume the hunt and exploration company Ocean Infinity has now deployed to the search zone.  Malaysia has not yet signed off on the contract to search the seabed for wreckage, however, so there's some uncertainty over whether the search has begun yet. Transport minister Anthony Loke welcomed the company's \"proactiveness\" to deploy its ships, adding: \"Since Ocean Infinity already started to mobilise their ships, of course we welcome it because we have given the principle approval for the search to resume and just need to finalise the contract.\" But the search, which last paused in 2018, will not be open-ended, he said. \n                  Search for Malaysia Airlines flight MH370 to resume a decade after it vanished\n                 \n                  Partner of MH370 passenger believes there was 'intentional' cover up of flight's disappearance\n                 \n                  Flight MH370 debris suggests pilot lowered plane's landing gear and crashed deliberately, report says\n                 \"It is not indefinite; there is a certain timeframe given for the contract. These are the details that we need to finalise before we sign.\" An enduring mystery Contact was lost with Flight MH370 about 40 minutes after it took off from Kuala Lumpur. Captain Zaharie Ahmad Shah signed off with \"Good night, Malaysian three seven zero\", as the plane entered Vietnamese airspace. Soon afterwards, its transponder was turned off, making it much more difficult to track. Military radar showed the plane left its flight path to swing back over northern Malaysia and Penang Island and then out towards the tip of the Indonesian island of Sumatra. It then turned south and all contact was lost. Malaysia, Australia and China launched an underwater search covering 120,000 sq km (46,332 sq miles) costing $143m (£113m) but no traces of the plane were found. Despite no major pieces of the aircraft - or the crucial black box devices - being found, some pieces of suspected aircraft debris have been collected along the coast of Africa and on islands in the Indian Ocean. Only three wing fragments have been confirmed to be from MH370. The Boeing 777 plane vanished from radar shortly after taking off from Malaysia's capital, Kuala Lumpur, on 8 March 2014. An expensive multinational search covering a 120,000 sq km (46,332 sq mile) area failed to turn up any clues. A 495-page report into the disappearance in 2018 said the plane's controls were likely deliberately manipulated to go off course. Investigators stopped short of offering a conclusion on what happened, saying that depended on finding the wreckage. Investigators found nothing suspicious in the background, financial affairs, training and mental health of both the captain and co-pilot."
    },
    {
        "title": "Inside the Oval Office with Donald Trump and Keir Starmer",
        "description": "Wow. That was a lot.",
        "url": "https://news.sky.com/story/inside-the-oval-office-with-donald-trump-and-keir-starmer-13318185",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-keir-starmer-beth-rigby_6840848.png?20250226214749",
        "type": "US",
        "Author": "Beth Rigby",
        "Date Published": "2025-02-27 16:17:00",
        "Headline": "\"I've never been into the Oval Office and had a situation where a president would answer so many questions from journalists,\" Sky's political editor Beth Rigby says.",
        "Content": "\n          Political editor\n              @BethRigby\n  Wow. That was a lot. I had two tactics going in: one - smile at Donald Trump, try to catch his eye because then he might ask you for a question, and I did get called. And two, wear something bright so he sees you in the sea of grey. Well, that worked. The colourful approach also really worked for Sir Keir Starmer, who produced a letter from the King inviting Trump for a second state visit.  The US president genuinely seemed utterly delighted. He loves the Royal Family, so this was really some smart diplomacy from the prime minister. Starmer will be so happy with how that went off, because there were lots of potential landmines on certain areas. Mr Trump was charming. He did not get into it with the prime minister on the issue of the Chagos Islands and that deal - he was pretty nice about that. And he did not say anything controversial. On tariffs, the president chose to really lay into the European Union and did not really go to town on tariffs when it comes to the UK. On Ukraine, he was asked about a peace deal. He thinks it's going to happen. He was asked about security guarantees. He said: \"We're going to get the deal, and then we're going to work all of that stuff out.\" When he was asked about whether he would back up UK troops if necessary - well, he did not say no. Read more:Donald Trump says he will visit UK in 'near future'Two reasons why Starmer's meeting with Trump really matters Overall, it was a pretty good outing for Starmer and the atmospherics were good. But blimey - Trump, it is free-flowing. I've never been into the Oval Office and had a situation where a president would answer so many questions from journalists. In the past with President Biden, it was all very ordered and certain people got to ask questions. Here, it really is free-flowing. It was quite an intense session."
    },
    {
        "title": "What does the King's letter to Trump say?",
        "description": "Usually, correspondence written by the King is not made public, but Donald Trump held up the letter in the Oval Office.",
        "url": "https://news.sky.com/story/what-does-the-kings-letter-to-trump-say-13318305",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-letter_6841735.jpg?20250227200818",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-27 20:05:00",
        "Headline": "The King says the UK and the US have \"a vital role to play\" - and mentions the president visiting golf courses.",
        "Content": "Usually, correspondence written by the King is not made public, but Donald Trump held up the letter in the Oval Office. The letter, which was inviting him to the UK for a historic second state visit, was handed to him by Prime Minister Sir Keir Starmer. Here is what we have been able to make out from the photos. In the opening paragraph, the King references the \"breadth of challenges across the world\", and says the UK and the US have \"a vital role to play\". Follow live: Trump questioned about Zelenskyy 'dictator' comment He goes on to say that he remembers \"with great fondness\" Mr Trump's visits to the UK during his \"previous presidency\". The King mentions Mr Trump visiting the golf course the US president owns in Turnberry and then appears to suggest a visit to Balmoral or Dumfries House in Scotland at some stage - estates owned or run by the monarch. \n                  Politics latest: Trump tells Starmer UK may get 'great' trade deal following White House talks\n                 \n                  No 10 will think this US trip could not have gone better\n                 \n                  A 'beautiful' accent and peace deals: Top five moments from Trump and Starmer's press conference\n                 He writes: \"There is much on both Estates which I think you might find interesting and enjoy - particularly as my Foundation at Dumfries House provides hospitality skills-training for young people who often end up as staff in your own establishments! \"Quite apart from this presenting an opportunity to discuss a wide range of issues of mutual interest, it would also offer a valuable chance to plan a historic second State Visit to the United Kingdom. \"As you will know, this is unprecedented by a US president. That is why I would find it helpful for us to be able to discuss, together, a range of options for location and programme content. \"In so doing, working together, I know we will further enhance the special relationship between our two countries, of which we are both so proud.\" After reading the letter Mr Trump said: \"That's a great, great honour. And that says at Windsor - that's really something.\" Mr Trump, the first ever convicted felon to become US president, accepted the invitation from the King - making him the only elected political leader in modern times to be invited to two state visits by a British monarch. Sky News contacted Buckingham Palace to ask when the second state visit might take place and they said: \"When diaries allow.\" Questions remain as to what form the state visit will take, who would accompany Mr Trump in his presidential party and whether this could include his close ally, billionaire businessman Elon Musk who is acting as his senior adviser on federal spending. Mr Trump's first UK state visit took place during his initial term as president - when he was hosted by the late Queen in 2019. Precedent for second-term US presidents who have already made a state visit is usually tea or lunch with the monarch at Windsor Castle, as was the case for George W Bush and Barack Obama. President Trump has earlier separately said he would be visiting the UK in the \"near future\". The Royal Family's soft power diplomacy is viewed as a way of engaging with the controversial billionaire-turned-politician, who is well known for his love of the monarchy. Read more:Inside the Oval Office with Trump and StarmerTrump questioned about Zelenksyy 'dictator' commentStarmer contradicts Vance over free speech claims  A stay at Balmoral in the Scottish Highlands could be seen as appealing to Mr Trump's heritage - his mother Mary Anne was born on the Isle of Lewis in the Outer Hebrides and he has two golf resorts in the country. Buckingham Palace's ongoing £369m refurbishment is focusing on its grandest state rooms, meaning it is unlikely to host any state visits for the next two years. Balmoral - the turreted grey stone castle by the River Dee - is the King's private Scottish home which has served as a summer sanctuary for generations of monarchs since it was bought for Queen Victoria by Prince Albert in 1852. The only other US president to stay at Balmoral was Dwight D Eisenhower in the summer of 1959, but it was an informal trip rather than a state visit. Mr Eisenhower had an affectionate relationship with the late Queen, who made a last minute decision to drive down to Balmoral's Lodge Gate to personally greet her guest when he inspected a guard of honour."
    },
    {
        "title": "Deaths of Gene Hackman and wife 'suspicious enough' to require 'investigation' - police warrant",
        "description": "Hollywood legend Gene Hackman and his wife have been found dead, with authorities saying the couple had seemingly been deceased for some time when their bodies were discovered. ",
        "url": "https://news.sky.com/story/oscar-winning-actor-gene-hackman-and-wife-found-dead-at-home-13317861",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gene-hackman-wife-betsy-arakawa_6841175.jpg?20250227093419",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-27 06:36:00",
        "Headline": "Santa Fe County Sheriff's Office said deputies responded to a request to do a welfare check on Wednesday around 1.45pm local time and found Hackman, his wife Betsy Arakawa and a dog dead.",
        "Content": " Hollywood legend Gene Hackman and his wife have been found dead, with authorities saying the couple had seemingly been deceased for some time when their bodies were discovered.  Hackman, 95, and his 63-year-old wife Betsy Arakawa were found dead in their New Mexico home on Wednesday, it was announced this morning. One of their pet dogs also died. Santa Fe County Sheriff's Office spokesperson Denise Avila said deputies found the bodies while carrying out a welfare check on Wednesday at around 1.45pm local time. The actor's body was discovered in a mudroom while Arakawa was found in a bathroom next to a heater, detectives from the sheriff's office wrote in a search warrant. There were scattered pills and an open prescription bottle on a countertop near the 63-year-old. There was no indication they had been shot and they had no other wounds, Ms Avila said. The warrant added the door to the property was found ajar and there were no signs of forced entry. A German Shepherd was found dead in a bathroom closet near Arakawa, police added. Two healthy dogs were on the property. The police have since said the deaths of Hackman and his wife are \"suspicious enough in nature to require a thorough search and investigation\". The actor's daughter had earlier suggested they may have been killed by carbon monoxide - but the cause of death remains unclear. Speaking to TMZ, Elizabeth Jean Hackman said the family was not sure but thought the couple may have died from toxic fumes. The local utility company tested gas lines in and around the home after the bodies were found and did not find any sign of problems, the warrant said. In a statement issued to Sky News, the sheriff's office said: \"We do not believe foul play was a factor in their deaths, however exact cause of death has not been determined at this time.\" Hackman's daughters, Elizabeth and Leslie, and granddaughter, Annie, said: \"He was loved and admired by millions around the world for his brilliant acting career, but to us he was always just Dad and Grandpa. \"We will miss him sorely and are devastated by the loss,\" they added in a statement. Hackman won an Oscar for a leading role in The French Connection, a 1971 action movie by William Friedkin, and another for best supporting actor in Clint Eastwood's 1992 western, Unforgiven. He was also known for playing Lex Luthor in the Superman films of the late 1970s and 1980s.  Roles in the Francis Ford Coppola mystery thriller The Conversation and in the historical drama Mississippi Burning, where he starred as an FBI agent alongside Willem Dafoe, helped cement his career as one of Hollywood's greats. Long career The former US Marine appeared in more than 80 films, as well as on television and the stage, during a lengthy career that started in the early 1960s. He earned his first Oscar nomination for his breakout role as the brother of bank robber Clyde Barrow in 1967's Bonnie and Clyde. He is also remembered for playing Captain Frank Ramsey alongside Denzel Washington in the 1995 thriller Crimson Tide. Read more:Follow latest: Actor and wife were dead for some timeIn pictures: Hollywood legend on silver screen In the early 2000s, he starred as an eccentric patriarch in The Royal Tenenbaums by Wes Anderson. Hackman's final film appearance was in 2004's Welcome to Mooseport, after which he retired from acting and began co-writing adventure novels with friend and underwater archaeologist Daniel Lenihan. \"It's very relaxing for me,\" Hackman told Empire Magazine in 2020. \"I don't picture myself as a great writer, but I really enjoy the process.\" 'He could play anyone' Michael Caine revered Hackman as \"one of the greatest actors\" he had known while presenting him with the Cecil B DeMille Award in 2003. Arakawa was a classical pianist. The couple married in 1991 and lived outside Santa Fe, New Mexico. Hackman had three children, Christopher, Elizabeth Jean and Leslie Anne, with his late ex-wife, Faye Maltese, who died in 2017. Star Trek star George Takei said: \"We have lost one of the true giants of the screen,\" in a tribute on X. \"Gene Hackman could play anyone, and you could feel a whole life behind it. \"He could be everyone and no one, a towering presence or an everyday Joe. That's how powerful an actor he was,\" Takei wrote on X. \"He will be missed, but his work will live on forever.\" Read more from arts and entertainment:Oscars A-Z: From Anora to a (disqualified) Hans ZimmerGossip Girl and Buffy The Vampire Slayer actress dies aged 39 Irish comedian Dara O Briain called Hackman \"the finest screen actor ever\". \"Not a single duff performance, in a long, long career,\" he wrote in a post on X. Hackman was versatile on screen, working with a face that he described to the New York Times in 1989 as that of \"your everyday mine worker.\" StudioCanal, the UK arm of the leading European film studio, called Hackman's death \"a colossal loss for cinema\" in a tribute posted on X."
    },
    {
        "title": "Princess Eugenie posts tribute to 'special friend' Michelle Trachtenberg",
        "description": "Princess Eugenie has posted a tribute to Michelle Trachtenberg after the actress's death.",
        "url": "https://news.sky.com/story/princess-eugenie-posts-tribute-to-special-friend-michelle-trachtenberg-13318177",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-michelle-trachtenberg_6841747.jpg?20250227202349",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-27 15:58:00",
        "Headline": "Tributes to the Buffy the Vampire Slayer star have poured in following her death aged 39, with Sarah Michelle Gellar and Blake Lively among the famous faces who have shared messages online. ",
        "Content": "Princess Eugenie has posted a tribute to Michelle Trachtenberg after the actress's death. The Gossip Girl and Buffy the Vampire Slayer star, 39, was found dead at her home in New York City on Wednesday. An investigation into her death has been opened but \"criminality is not suspected\", police said. In a post on Instagram today, Princess Eugenie thanked Trachtenberg for \"so many memories\". \"Goodbye special friend. You are so loved and missed,\" she wrote. \"Thank you for so many memories of laughter and fun. You were so thoughtful and generous and sooo funny. \"My favourite was listening to you order food, always done with precision so you got exactly what we all wanted. \"I'm thinking of you up there friend, of your spirit that was so bright and your joy you brought to so many.\" Eugenie previously lived in New York and in 2013, she was seen attending a basketball game at Madison Square Garden with Trachtenberg. The actress shared numerous social media updates featuring the princess over the years. In 2020, she hailed her as \"one of the most dearest, kindest, most genuine friends I have ever had in my life\" and four years prior, she wrote: \"There are few people in life that you meet that you know are true and real. This lady happens to be one of them.\" Buffy and Gossip Girl co-stars pay tribute Trachtenberg was best known for playing Dawn Summers in Buffy, the younger sister of the title character played by Sarah Michelle Gellar, and starring as Georgina Sparks in Gossip Girl. Paying tribute to her co-star, Gellar shared a series of pictures of herself and Trachtenberg, alongside a caption referencing a scene from the hit show. \"Michelle listen to me. Listen. I love you. I will always love you. The hardest thing in this world, is to live in it. I will be brave. I will live… for you,\" she wrote. James Marsters, who played punk vampire Spike, told fans on Instagram: \"My heart is heavy today. We have lost a beautiful soul. \"Michelle was fiercely intelligent, howlingly funny, and a very talented person. She died much too young, and leaves behind scores of people who knew and loved her.\" A number of Trachtenberg's Gossip Girl co-stars have also shared tributes on social media, with Blake Lively - who starred as Serena van der Woodsen in the teen drama - writing on Instagram: \"Everything she did, she did 200%.\" Lively added: \"She laughed the fullest at someone's joke, she faced authority head on when she felt something was wrong, she cared deeply about her work, she was proud to be a part of this community and industry as painful as it could be sometimes, she was fiercely loyal to her friends and brave for those she loved, she was big and bold and distinctly herself.\" Taylor Momsen, Gossip Girl's Jenny Humphrey, said: \"I will miss you everyday my love.\" \"I'll miss our late night calls that no one should ever hear but us,\" she wrote. \"She was always in my corner and there to support me whether I was right or wrong. \"I think we truly understood each other and I am so grateful to have had a friend like you in my life for so long.\" More from Sky News:Deaths of Gene Hackman and wife 'suspicious enough' to require 'investigation'Nineties boyband to reunite with UK tour \"Michelle was one of a kind,\" wrote fellow Gossip Girl star Chace Crawford. \"I remember her coming on set for the first time and just absolutely owning it. \"She was a force of nature and just so so unapologetically funny and magnetic.. remembering those years with a big smile. Just a terrible loss. Love you.\" \"Rest in peace sweet Michelle,\" Kim Cattrall wrote alongside a picture of herself and Trachtenberg in the 2005 film Ice Princess. Kate Beckinsale posted: \"What a terrible shock and loss, my god. My heart aches for your mama. Fly safe little bird.\" Trachtenberg's most recent film appearance came last year, when she played the role of Michelle Cody White in Spyral. Police said an investigation into her death has been opened but \"criminality is not suspected\"."
    },
    {
        "title": "Katy Perry set to travel to space as part of all-female mission",
        "description": "Katy Perry is set to head to space as part of an all-female mission.",
        "url": "https://news.sky.com/story/katy-perry-set-to-travel-to-space-as-part-of-all-female-mission-13318183",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-katy-perry-us_6841527.jpg?20250227163004",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-27 16:11:00",
        "Headline": "The 40-year-old singer will travel on the next launch of Jeff Bezos' Blue Origin rocket.",
        "Content": "Katy Perry is set to head to space as part of an all-female mission. The 40-year-old singer will travel on the next launch of Jeff Bezos' Blue Origin rocket, the aerospace engineering company said. The Teenage Dream singer will be joined on the New Shepard programme's 11th human flight by former NASA rocket scientist Aisha Bowe, research scientist Amanda Nguyen, film producer Kerianne Flynn and TV hosts Gayle King and Lauren Sanchez - who is also Bezos' fiancee. The mission will \"challenge [the crew's] perspectives of Earth\", \"empower them\" and \"create lasting impact that will inspire generations\", according to organisers. Perry is one of the best-selling music artists of all time, with more than 115 billion streams. She said she hopes her journey will encourage her daughter and others to \"reach for the stars, literally and figuratively\". So far, the New Shepard programme has flown 52 people above the Karman line, which is internationally recognised as the boundary of space. Read more from Sky News:Woman, 19, dies in dog attack - two arrestedActor Gene Hackman found dead with wife and dog This is the first all-female crew since Valentina Tereshkova's solo flight to space in 1963. New Shepard is a reusable sub-orbital launch vehicle developed for space tourism. Named after Alan Shepard, the first American to travel into space, it can take off and land vertically. Other notable people who have joined the flights include Bezos, Star Trek actor William Shatner and former NFL player Michael Strahan. The latest flight, NS-31, will launch in the spring."
    },
    {
        "title": "Andrew Tate arrives in US after travel ban was lifted - as Trump says he knows 'nothing about that'",
        "description": "Andrew Tate and his brother Tristan have landed in Florida in the US after a travel ban in Romania was lifted - as Donald Trump insisted he knows \"nothing about that\".",
        "url": "https://news.sky.com/story/andrew-tate-and-his-brother-tristan-have-left-romania-for-the-us-reports-13317873",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-andrew-tate_6841694.jpg?20250227190455",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-27 07:26:00",
        "Headline": "Self-described misogynist Andrew Tate - a champion of Donald Trump - and his brother are facing a series of charges in Romania. ",
        "Content": " Andrew Tate and his brother Tristan have landed in Florida in the US after a travel ban in Romania was lifted - as Donald Trump insisted he knows \"nothing about that\". The Tates landed in Fort Lauderdale in a private plane at around 11:30am local time, their representative Mateea Petrescu added. Speaking around an hour later, Andrew Tate told reporters: \"We've yet to be convicted of any crimes in our lives ever. We have no criminal record anywhere on the planet ever. \"Our case was dismissed on 19 December in Romania under the Biden administration, and our prosecutor recently decided, because we have no active indictment in court, to let us go and return. \"This is a Democratic society, we're supposed to be innocent until proven guilty, as my brother and I are.\" The brothers, who champion US President Trump, are facing charges in Romania of human trafficking, sexual misconduct and money laundering, as well as starting an organised crime group. The self-styled misogynists are dual UK and US nationals whose controversial views are shared widely on social media platforms such as TikTok and X. Their arrival in Fort Lauderdale comes after the Financial Times reported last week that the Trump administration had lobbied their Romanian counterparts to ease restrictions on the brothers while they face charges. Romanian foreign minister Emil Hurezeanu said the Tates were mentioned during his brief hallway meeting with Mr Trump's special envoy Richard Grenell at the Munich Security Conference earlier this month. Mr Trump was asked about the arrival of the Tates in the US while meeting with UK Prime Minister Sir Keir Starmer at the White House this evening. Asked by a reporter if his administration pressured the Romanian government to let the Tates travel, the US president told reporters: \"I know nothing about that. You're saying (Andrew Tate) is on a plane right now? \"I just know nothing about it, we'll check it out, we'll let you know.\" Romanian prosecutors later said they had approved a request from Andrew Tate, 38, to travel outside of the country, pending the outcome of a criminal investigation. The pair had been released from house arrest, but were not allowed to leave the country and were required to check in with the police regularly. Read more:How Tate's business made millions - despite sex trafficking chargesWho is the self-styled 'king of toxic masculinity? \"The request to change the obligation of not leaving Romania was approved,\" prosecutors said in a statement on Thursday. \"All the other obligations have been maintained, including the requirement to check in with judicial authorities every time they are called.\" A spokeswoman for the Tates told Sky News the Romanian courts had decided they will return to the brothers all of their assets. This includes restoring their ownership of all previously frozen bank accounts, five properties, six cars including two Audis and a Ferrari, and company shares. Some assets will remain under precautionary seizure, according to the court ruling. The brothers are fighting a series of legal battles not just in Romania, but also in the UK and the US. They have consistently denied any wrongdoing in connection with all the legal action taking place. The Tates grew up in Luton and have millions of social media followers. Andrew Tate also appeared in the UK version of Big Brother in 2016. The pair are often criticised for their misogynistic views online - particularly as they have a predominately young, male audience. A number of banned Twitter accounts have been reinstated by Elon Musk. Tate was among those brought back on 18 November 2022 after Musk took over and rebranded it X. A British court ruled in March that the brothers are also under a European arrest warrant and will be extradited to the UK - where allegations of rape and human trafficking are being investigated by Bedfordshire Police - after Romanian trial proceedings finish for a separate investigation. A recent lawsuit filed in Florida accuses both Tate brothers of conspiring to coerce a woman into sex work, luring her to Romania and defaming her after her testimony to Romanian authorities. The Tate brothers had previously sued her for defamation in 2023. Read more from Sky News:Actor Gene Hackman and wife found dead at homeStarmer in Washington for Trump talksProbe blasts off to chase asteroid Four British women who allege they were raped and coercively controlled by Andrew Tate said they have been \"retraumatised\" by today's events. \"It is clear that there is now a major risk that the criminal prosecution for his alleged crimes in Romania will not proceed, and he may use this development as an opportunity to harass further and intimidate witnesses and his accusers as well as continue to spread a violent, misogynistic doctrine around the world,\" the alleged victims said in a joint statement. Tate is facing civil action brought by the women at the High Court. He denies the allegations and has threatened to pursue the women for defamation. Matthew Jury, their solicitor at McCue Jury & Partners, said: \"The news that pressure by the Trump administration has led to Andrew Tate, and his brother Tristan, being allowed to leave Romania by its authorities is equal parts disgusting and dismaying.\" He added: \"The UK government knew this might happen more than a week ago. The fact that nothing seems to have been done to prevent it is concerning. One can only hope action will now be taken. Given that Prime Minister Starmer is in the US today to meet with President Trump, perhaps his team may take the opportunity to raise this issue.\""
    },
    {
        "title": "Nvidia signals strong AI chip demand despite DeepSeek threat",
        "description": "Nvidia has signalled no drop in demand for its flagship chips among big artificial intelligence (AI) spenders despite the low-cost challenge posed by Chinese rival DeepSeek.",
        "url": "https://news.sky.com/story/nvidia-signals-strong-ai-chip-demand-despite-deepseek-threat-13317849",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-nvidia-logo_6669295.jpg?20240828164051",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2025-02-27 05:55:00",
        "Headline": "Investors appear largely satisfied that Nvidia's big AI-spending customers have not been frightened off by DeepSeek's emergence.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Nvidia has signalled no drop in demand for its flagship chips among big artificial intelligence (AI) spenders despite the low-cost challenge posed by Chinese rival DeepSeek. The leading AI chipmaker said it expected Blackwell sales to continue to grow after its latest earnings beat market expectations. Nvidia forecast revenue of around $43bn (£34bn) for its first quarter after achieving a figure of $39.3bn (£31bn) over its last three months - up 12% from the previous quarter and 78% from one year ago. Just a month ago, its shares took a hammering when it emerged DeepSeek's primary chatbot, which uses lower-cost chips, had become the most popular free application on Apple's App Store across the US. Nvidia's shares lost almost $600bn in market value in a day. It also prompted investors to question whether the AI-led stock market rally of recent years was overblown. There was anxiety ahead of Nvidia's earnings report though shares only fell fractionally in after-hours dealing. \n                  Gatwick second runway decision deadline is extended on green concerns\n                 \n                  Money blog: Unlikely UK cities top 'trending' locations for spring holiday - as cheapest and least busy dates to fly abroad revealed\n                 \n                  Paul Flowers: Disgraced former Co-op Bank boss jailed for three years for fraud\n                 Market analysts suggested demand from Microsoft, Amazon and other heavyweight tech companies racing to buildAI infrastructure remained robust, given Nvidia's revenue guidance even though the bulk of it is accounted for through data centres.  Read more: What is DeepSeek? Nvidia founder Jensen Huang said Nvidia has ramped up the massive-scale production of Blackwell and achieved \"billions of dollars in sales in its first quarter\". They were put at $11bn. \"Demand for Blackwell is amazing as reasoning AI adds another scaling law - increasing compute for training makes models smarter and increasing compute for long thinking makes the answer smarter,\" he added. \"AI is advancing at light speed as agentic AI and physical AI set the stage for the next wave of AI to revolutionise the largest industries.\" Derren Nathan, head of equity research at Hargreaves Lansdown, said of the report: \"The longer-term investment case for the driver of the AI train is looking difficult to pick holes in, with Meta's $200bn just one of the latest mega investments in data centres to be unveiled recently. \"By virtue of scale, growth may be slowing a little but upgrades to analysts full-year numbers can be expected off the back of today's results. At a around 30x forward earnings, the valuation still doesn't look overcooked.\""
    },
    {
        "title": "In pictures: Hollywood legend Gene Hackman on the silver screen",
        "description": "Hollywood legend Gene Hackman, his wife and their dog have been found dead at their home in Santa Fe, New Mexico.",
        "url": "https://news.sky.com/story/in-pictures-hollywood-legend-gene-hackman-on-the-silver-screen-13317910",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gene-hackman-the-quick-and-the-dead_6841162.jpg?20250227112312",
        "type": "US",
        "Author": "Jenness Mitchell, news reporter",
        "Date Published": "2025-02-27 09:03:00",
        "Headline": "Gene Hackman has won a number of gongs throughout his career, including two Academy Awards, two BAFTA Awards, four Golden Globes, and one Screen Actors Guild Award.",
        "Content": "By Jenness Mitchell, news reporter   Hollywood legend Gene Hackman, his wife and their dog have been found dead at their home in Santa Fe, New Mexico. In a career spanning more than six decades, the much-loved actor won a number of gongs - including two Academy Awards, two BAFTA Awards, four Golden Globes, and one Screen Actors Guild Award. Here are some of his best-known roles: The French Connection Hackman, 95, won a best actor Oscar for his performance as Detective Jimmy \"Popeye\" Doyle in The French Connection. The 1971 action thriller, directed by William Friedkin (The Exorcist), follows two dogged New York Police Department detectives as they aim to take down a French heroin smuggler. The Poseidon Adventure Hackman played Reverend Frank Scott in the 1972 disaster film. The movie follows a group of passengers who find themselves fighting for survival after a rogue wave capsizes aging ocean liner SS Poseidon during its final voyage from New York to Athens before being scrapped. The ensemble cast featured five Oscar winners, including Hackman, Ernest Borgnine, Jack Albertson, Shelley Winters and Red Buttons. Superman Hackman stole the show as villainous Lex Luthor opposite Christopher Reeve in the 1978 movie Superman. His performance earned him a best supporting actor BAFTA nomination. Hackman portrayed the Man of Steel's arch nemesis two more times, in 1980 (Superman II) and 1987 (Superman IV: The Quest for Peace). Mississippi Burning Mississippi Burning is set in 1964 and revolves around the disappearance of three civil rights workers - loosely based on a real-life murder investigation. The 1988 crime thriller follows two FBI agents as they are met with hostility by the fictional town's residents, local police and the Ku Klux Klan. Hackman earned a best actor Oscar nomination for his performance as FBI agent Rupert Anderson. Unforgiven Unforgiven was a smash hit at the box office in 1992. Hackman picked up the best supporting actor Oscar for his performance as Sheriff \"Little\" Bill Daggett. Clint Eastwood's western won an additional three Academy Awards, including best picture, best director and best film editing. The movie, also starring Morgan Freeman, follows aging outlaw and killer William \"Bill\" Munny (Eastwood) who takes on one more job to avenge an injustice. Read more:Oscar-winning actor and wife found dead at home with their dog The Firm John Grisham's legal thriller The Firm was given the silver screen treatment in 1993 with Hackman going toe-to-toe against Tom Cruise. The movie follows promising Harvard Law graduate Mitch McDeere (Cruise) who joins a prestigious law firm only to discover that it has a sinister dark side. Unlike in Grisham's novel, Hackman's role of Avery Tolar is more of a reluctant villain than downright baddie. The Quick And The Dead Unlike Unforgiven, western The Quick And The Dead failed to dominate the box office and received mixed reviews from critics. Directed by Sam Raimi (Evil Dead, Spider-Man), the 1995 action film revolves around a female gunfighter who returns to a frontier town to take part in a shooting tournament to avenge her father's death. Hackman, playing ruthless outlaw-turned-mayor John Herod, is joined by Sharon Stone, Russell Crowe and Leonardo DiCaprio. Crimson Tide Directed by Tony Scott, Denzel Washington clashes with Hackman in this 1995 submarine action thriller. The movie - which parallels a real-life incident during the Cuban Missile Crisis - takes place on a US nuclear missile submarine and sees a young officer (Washington) staging a mutiny to prevent his trigger-happy captain (Hackman) from launching the boat's weapons before confirming his orders to do so. The movie earned composer Hans Zimmer a Grammy Award for the main theme. Absolute Power Eastwood once again takes on Hackman in 1997 political thriller Absolute Power. Eastwood, also behind the camera, plays a master jewel thief who witnesses the death of a woman involving the crooked president of the United States (Hackman). The cat-and-mouse thriller, based on David Baldacci's novel, also stars Ed Harris, Laura Linney, Scott Glenn and Judy Davis. Runaway Jury Based on Grisham's 1996 novel of the same name, Runaway Jury pits Hackman against long-time friend Dustin Hoffman. The 2003 movie sees Hackman portray shady jury consultant Rankin Fitch, with Hoffman playing rival attorney Wendell Rohr in the trial against a gun manufacturer. In the legal thriller, Hackman's character meets his match in a couple played by John Cusack and Rachel Weisz, who appear to be able to sway the jury to deliver any verdict they want. The Royal Tenenbaums The Royal Tenenbaums boasts a stacked cast that includes Hackman, Owen and Luke Wilson, Anjelica Huston, Bill Murray, Gwyneth Paltrow, Danny Glover and Ben Stiller. The 2001 Wes Anderson comedy-drama follows the lives of three gifted siblings who experience great success in youth, and even greater disappointment and failure in adulthood. Hackman won a Golden Globe for his performance as eccentric father Royal Tenenbaum."
    },
    {
        "title": "Gene Hackman obituary: From Lex Luthor to Royal Tenenbaum, a reluctant celebrity who could turn his hand to any role",
        "description": "To many, he will always be Superman supervillain Lex Luthor, but with a career spanning six decades, Gene Hackman's acting CV was as varied as it was long.",
        "url": "https://news.sky.com/story/gene-hackman-obituary-from-lex-luthor-to-royal-tenenbaum-a-reluctant-celebrity-who-could-turn-his-hand-to-any-role-13318024",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gene-hackman-christopher-reeve_6841113.jpg?20250227111840",
        "type": "US",
        "Author": "Bethany Minelle",
        "Date Published": "2025-02-27 11:14:00",
        "Headline": "Gene Hackman played villains, heroes and antiheroes across action, comedy and drama. Despite worldwide recognition, the reluctant star, who has died aged 95, had no time for fame, insisting his own movies gave him an \"icky feeling\".",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n To many, he will always be Superman supervillain Lex Luthor, but with a career spanning six decades, Gene Hackman's acting CV was as varied as it was long. A former Marine, his work on the screen began with an uncredited TV role in 1961. He would go on to become a Hollywood star - despite his disdain for all things showbiz - playing villains, heroes and antiheroes in more than 80 movies spanning all genres, as well as small screen roles and performances on Broadway. His most memorable performances include New York City detective Jimmy \"Popeye\" Doyle in The French Connection and surveillance expert Harry Caul in Francis Ford Coppola's The Conversation. Decorated with multiple Oscars, BAFTAs and Golden Globes across his career, he would step away from acting in 2004, pivoting to novel writing, a pursuit he said better suited his solitary nature.  Born Eugene Allen Hackman in California in 1930, his parents divorced when he was 13, leaving him to be largely bought up by his British-born grandmother Beatrice Gray in Illinois. Leaving home at 16 to enlist in the Marine Corps, he served as a field radio operator and then as a broadcast journalist from 1947 to 1952, working in post-war China and Japan. During his service, his dislike for authority saw him demoted from corporal three times. Hackman would go on to study journalism and television production at the University of Illinois but later decided to pursue an acting career. Read more: Follow latest: Actor and wife were dead for some timeIn pictures: Hollywood legend on silver screen Breakout role Joining the Pasadena Playhouse in 1956, he would meet fellow jobbing actor Dustin Hoffman, with the pair sharing a flat before both found worldwide fame. He would also study with fellow future Hollywood star Robert Duvall. After TV bit-parts and stage work, Hackman's breakout role came in 1967 in Bonnie And Clyde, which saw him receive his first Oscar nomination. His first Oscar win came in 1972 for his role as detective Jimmy \"Popeye\" Doyle in The French Connection, following it with a second 20 years later for his performance in Clint Eastwood's Western Unforgiven. Already well respected in the acting industry, he would earn household fame after he was cast as supervillain Lex Luthor in 1978, the ultimate nemesis to Christopher Reeve's Superman. It was a role he would reprise in the film's subsequent sequels, 1980's Superman II and 1987's Superman IV: The Quest For Peace. An immense body of work Part of so many movies now regarded as classics, other films he starred in over the decades include The Poseidon Adventure, A Bridge Too Far, Under Fire, Mississippi Burning, Crimson Tide, Get Shorty, The Royal Tenenbaums and Runaway Jury. With his comedy chops as impressive as his dramatic skills, he also gave a memorable cameo as the blind man in Mel Brooks' 1974 horror spoof Young Frankenstein. While never considering himself a true star, Hackman acted opposite Hollywood heavyweights including Al Pacino, Gene Wilder, Oliver Reed, Warren Beatty, Faye Dunaway and Diane Keaton. Hackman had three children with his first wife, Faye Maltese, to whom he was married for 30 years, until their divorce in 1986. He married classical pianist Betsy Arakawa in 1991. Largely retiring from public life since the early 2000s, he had moved from buzzy LA to Santa Fe in New Mexico in 2004 and was rarely seen on the Hollywood social circuit. 'I'll get this icky feeling' Hackman, a reluctant celebrity, made no secret of his disdain for the business side of show business and was self-effacing about his achievements. He once told Time magazine if he ever caught his films on TV: \"I'll watch maybe five minutes of it, and I'll get this icky feeling, and I turn the channel.\" Writing at his hilltop ranch overlooking the Colorado Rockies, Hackman published three historical novels, written alongside his friend and underwater archaeologist Daniel Lenihan. Speaking about his passion for novel writing in his later years, Hackman told Reuters in 2008: \"I like the loneliness of it… It's similar in some ways to acting, but it's more private and I feel like I have more control over what I'm trying to say and do.\" He added: \"There's always a compromise in acting and in film, you work with so many people and everyone has an opinion. … I don't know that I like it better than acting, it's just different. I find it relaxing and comforting.\" 'I've fulfilled a lot of my dreams' Hackman's final film role was in the 2004 political satire Welcome To Mooseport, opposite comedian Ray Romano. He also voiced two Marine documentaries in 2016 and 2017. In 2003, when awarded the prestigious Cecil B Demille award at the Golden Globes, Hackman said of his acting career: \"It's all I ever wanted to do. \"So few people ever get what they really want in life. You give up a lot in terms of family, you are always in North Africa or someplace, but it is a make-believe world and it is what I wanted to do as a child.. I fulfilled a lot of my dreams.\" He leaves behind his three children from his first marriage, Christopher Allen, Elizabeth Jean, and Leslie Anne Hackman."
    },
    {
        "title": "Paul Flowers: Disgraced former Co-op Bank boss jailed for three years for fraud",
        "description": "The disgraced former chair of the Co-op Bank, Paul Flowers, has been jailed for three years on fraud charges.",
        "url": "https://news.sky.com/story/paul-flowers-disgraced-former-co-op-bank-boss-jailed-for-three-years-for-fraud-13318070",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-paul-flowers-police_6841418.jpg?20250227135657",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-02-27 12:18:00",
        "Headline": "A court hears how Paul Flowers, dubbed the \"crystal Methodist\" by the press, took advantage of a trusting friend to fund his drug habit and lavish lifestyle.",
        "Content": "The disgraced former chair of the Co-op Bank, Paul Flowers, has been jailed for three years on fraud charges. The 74-year old, who was forced out of the lender in 2013 amid claims of inappropriate expenses and illegal drugs allegations, admitted 18 counts of fraud worth nearly £100,000. Flowers, also a former Methodist minister, committed the offences against an elderly and vulnerable friend as executor of her will. Manchester Crown Court heard how Margaret Jarvis trusted him because of his high profile public roles but he went on to plunder the cash to spend on drugs, holidays and gifts for himself once dementia took hold. He continued to drain her funds following the spinster's death in Amersham, Buckinghamshire, in 2016. Flowers had previously made headlines for the wrong reasons after his three-year oversight tenure at the bank came under scrutiny in the wake of its 2017 rescue by US hedge funds. He was later banned from the financial services industry by the City watchdog. \n                  Gatwick second runway decision deadline is extended on green concerns\n                 \n                  Money blog: Unlikely UK cities top 'trending' locations for spring holiday - as cheapest and least busy dates to fly abroad revealed\n                 \n                  Ex-Manchester United chief Woodward pitched Eagle Football role\n                 Flowers was fined £400 in 2014 after pleading guilty to possessing cocaine, ketamine and crystal meth - leading him to being dubbed \"the Crystal Methodist\" in the press. He missed a previous sentencing hearing on the fraud charges a fortnight ago and handed himself in after a warrant was issued for his arrest. Passing sentence Judge Nicholas Dean KC, Recorder of Manchester, said: \"This is a story of betrayal, no less than that. \"Betrayal by you of an old friend, someone who trusted you, who had every reason to believe she could trust you. \"In truth, you knew all along she could not, because of your own weaknesses and failings.\" Detective Constable Kate Riley, from Greater Manchester Police, said: \"Flowers completely abused his position as a will executor and as a friend, fraudulently taking tens of thousands of pounds that he simply was not entitled to. \"The money should have been going to good causes, but instead went to satisfying Flowers' indulgent lifestyle of holidays, cruises, and expensive food and wine. \"He and his victim had worked together on charitable projects, so he was fully aware of the importance of charitable gifts in her will. \"This self-serving behaviour has now rightly been punished, and Flowers has time behind bars to think about his deceitful actions.\""
    },
    {
        "title": "Ex-Manchester United chief Woodward pitched Eagle Football role",
        "description": "Ed Woodward, the former Manchester United chief, has been approached about joining the vehicle which owns stakes in clubs including Crystal Palace and Olympique Lyonnais.",
        "url": "https://news.sky.com/story/ex-manchester-united-chief-woodward-pitched-eagle-football-role-13318041",
        "image_url": "https://e3.365dm.com/21/04/1920x1080/skynews-ed-woodward-manchester-united_5349887.jpg?20210420201739",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-27 11:33:00",
        "Headline": "Ed Woodward, who left Old Trafford in 2022, is being lined up to join the board of Crystal Palace and Olympique Lyonnais-backer Eagle Football Holdings as it prepares to go public in the US, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Ed Woodward, the former Manchester United chief, has been approached about joining the vehicle which owns stakes in clubs including Crystal Palace and Olympique Lyonnais. Sky News has learnt that Mr Woodward, who left Old Trafford in 2022, a year after United's involvement in the ill-fated European Super League project, is being lined up as an independent director of Eagle Football Holdings as it prepares to list in the US. Sources said on Thursday that it was not certain that Mr Woodward's appointment would go ahead, but confirmed that he had been approached about his first mainstream football directorship since ending his long stint at the former Premier League champions. Mr Woodward spent 17 years at Old Trafford, having played a key role in the Glazer family's debt-fuelled takeover of the club in 2005. Money latest: UK's favourite DIY shops ranked Eagle Football, which is controlled by the American businessman John Textor, is expected to file confidentially with US regulators for an initial public offering in the next fortnight. The vehicle owns a 45% stake in Crystal Palace, which it has been trying to sell for months but may now retain as a result of the club's improved performance in English football's top flight. \n                  Gatwick second runway decision deadline is extended on green concerns\n                 \n                  Money blog: Unlikely UK cities top 'trending' locations for spring holiday - as cheapest and least busy dates to fly abroad revealed\n                 \n                  Paul Flowers: Disgraced former Co-op Bank boss jailed for three years for fraud\n                 Last summer, Sky News revealed that Eagle Football had hired investment banks including Stifel and TD Cowen to advise on the IPO, with Bloomberg News adding this week that UBS is also working on the deal. The Eagle Football board is understood to have added Mr Textor's former FuboTV colleague Alex Bafer, the Trilith Studios president and chief executive Frank Patterson and finance executive Sam Lynn as directors in recent weeks. Its lenders are currently represented on the board, although these directors are expected to step down in the event of the company becoming publicly traded. If the IPO proceeds, Eagle Football is expected to try to raise several hundred million dollars at a valuation of more than $2bn. The vehicle also owns the Brazilian champions Botafogo, RW Molenbeek in Belgium and FC Florida. Last year, Mr Textor held talks about buying Everton FC, but was eventually outbid by the AS Roma owner, Dan Friedkin. Had he been successful, Mr Textor would have had to complete the sale of his Palace stake under Premier League ownership rules. Raine Group, which handled the sale of Chelsea in 2022 and a minority stake in Manchester United to Sir Jim Ratcliffe the following year, has been overseeing the potential disposal of Eagle Football's Crystal Palace stake. A number of parties have expressed serious interest, including a group advised by the football financier Keith Harris. However, a transaction is not thought to be imminent. In the past, Mr Textor has spoken about his belief that public ownership of football teams provides fans with greater transparency about the running of their clubs. He has described this as the democratisation of ownership - an issue likely to be at the heart of a bill on football regulation when it is reintroduced to parliament by the new Labour government. If Eagle Football's filing with the US Securities and Exchange Commission proceeds in the coming weeks, its stock would be expected to commence trading several months later. Mr Textor could not be reached for comment, while Mr Woodward did not respond to a request for comment on Thursday."
    },
    {
        "title": "Could Man City be stripped of titles? Or have points deducted? Experts give their opinions",
        "description": "In the next month or so, we're expecting an independent commission to announce whether Manchester City will face any punishment over more than a hundred counts of alleged financial rule breaches.",
        "url": "https://news.sky.com/story/could-man-city-be-stripped-of-titles-or-have-points-deducted-experts-give-their-opinions-13318083",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-man-city-sergio-aguero_6841494.jpg?20250227153943",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-02-27 12:57:00",
        "Headline": "Sports correspondent Rob Harris spoke with experts at the Business of Football Summit to hear what they think will happen with the charges Man City are facing.",
        "Content": " In the next month or so, we're expecting an independent commission to announce whether Manchester City will face any punishment over more than a hundred counts of alleged financial rule breaches. The club are facing around 115 charges laid by the Premier League which have been the subject to a hearing which has been held in private. Ahead of the verdicts, Sky News' sports correspondent Rob Harris spoke with some of the world's top football finance experts at the Financial Times' Business of Football Summit 2025 to hear what they think will happen next, and to answer questions from readers. But before we get to their thoughts, let's look at the background of the case. What is the nature of the charges? The greatest proportion of the charges relate to rules that require clubs to provide accurate financial information, and which City are alleged to have breached. They include details concerning the accuracy of information about sponsorship deals and player and manager payment. There are also allegations of breaches of rules requiring clubs to comply with UEFA Financial Fair Play (FFP) regulations - and the Premier League's own profit and sustainability rules (PSR). They are also accused of failing to cooperate with the league's investigation. In all, there are charges relating to every season between 2009-10 and 2022-23. During that period, City won the Premier League title seven times, the FA Cup on three occasions, six League Cups and a Champions League. City have strongly denied the allegations and said they welcomed the opportunity for an independent commission \"to impartially consider the comprehensive body of irrefutable evidence that exists in support of our position\". More context:Rob Harris explains the charges and their impactYour guide to Financial Fair Play in football What's next? Since the charges were announced, hearings have been held in private, during which lawyers from the Premier League and Manchester City have presented evidence and arguments on the case. A panel of retired senior judges sits on an independent commission which will rule on the case very soon. They could find City guilty on all of the charges, guilty of some of them, or clear the club of any wrongdoing. Your questions While we wait for the verdict, readers posed their questions to experts. At the Financial Times' Business of Football Summit 2025, Rob Harris spoke to: 'We've never seen anything like it' Matt Hughes said the case is the clearest example of how football can change radically in just a few years. \"Five, ten years ago, I couldn't have imagined journalists and football fans arguing over arcane matters of competition law and issues such as associated party transactions - it feels like the last ten years of the Premier League has all crystallised in this one case,\" he said. That was echoed by Simon Leaf, who said the case was \"truly unprecedented in the history of football and financial regulation in football\", before adding that such regulation is only 10 or 15 years old itself. \"We've never quite seen anything like it,\" he said. And with a case of that size comes the challenge of proving it. Martin Lipton said it's a \"huge ask\" for the Premier League to prove any of the charges, as they'd have to show beyond any doubt that City knowingly \"defrauded football\". Could only a few guilty verdicts lead to a points deduction? As we mentioned above, it's not yet clear whether the independent commission will find City guilty on all charges - but what if they were found to have broken a few rules? Could we expect a heavy fine or points deduction for each charge broken? Our experts explained that the first problem is that we're effectively in the dark until the verdict is released in full. \"We still don't know exactly how many charges [City] are facing,\" Hughes said, noting that figures have been floating around the 115, 129 or even 130 mark, but nothing is certain yet. \"Everything's been done confidentially,\" Lipton said, adding that we will only get an understanding of what they've actually been charged with with the verdicts. Others may look to precedent. Last season, Everton were twice docked points for breaching the Premier League's PSR. Nottingham Forest were also deducted four points during the last campaign. But, as the experts explained, these were for more straightforward charges of overspending - something fairly straightforward to prove (additionally, this, alongside the number of charges, is one of the main reasons the case has taken so long to reach a conclusion). Many of City's charges relate to overinflated sponsorship deals - which is entirely more subjective and therefore much more difficult to prove. For instance, a sponsorship deal involving a global superclub like Manchester United would have a vastly different value to one with a newly promoted side like Southampton. \"What it comes down to is trying to assess the market value of these deals... and it's very hard to know what the value should be from club to club,\" Leaf said. \"Equally, the rights are not the same [in every deal] - some include hospitality access for sponsors,\" he added. \"One of the deals we did a few years ago involved a country's national ballet being able to appear at the [club's] stadium - how do you put a [market] value on something like that?\" Could City have Premier League titles stripped from them? \"There seems to be no appetite to take retrospective punishment,\" said Hughes when asked this question. But Leaf said it was still too early to say. \"I suspect there will be certain clubs looking at this and saying, actually we would have been entitled to payments for qualifying for Champions League... or even bonuses from sponsors from finishing in a different position,\" he said, suggesting this would give the commission something else to think about when making its decisions. But Lipton said he'd be very surprised if City were to be stripped of titles, given that that would undermine the Premier League's history. \"If you were to strip titles, the single most iconic moment in the history of the Premier League - Sergio Aguero's 94th minute goal against QPR to win the league - didn't happen,\" he said. \"You can't rewrite history to that extent,\" he said, adding title stripping is just \"not going to happen\". What if City are cleared? If City's position is vindicated, it is likely to lead to serious questions about the Premier League's ability to effectively govern its clubs and enforce financial regulations. This is at a time when football is on course to become subject to wider independent regulation, something which is widely supported by supporter groups. Other clubs who have faced punishment in the past will also want to pick through the details of the verdict and may have further questions about how the rules are being applied. But it also opens the door for City to go for the jugular, our experts said. \"If City were to be cleared of absolutely everything, then the next question will be - what happens to the Premier League leadership?\" Lipton asked. He described the case as nothing more than a \"brutal civil war\" and should City win it, they'll seek \"the complete decapitation of the entire leadership\". What about an appeal? Either side can appeal against any ruling. \"We're hoping to get an initial judgment next month,\" Hughes said, adding the issue as a whole won't be resolved for a long time, whatever the verdict is. Leaf noted that it's highly unlikely there will be a finding that both sides are happy with, making the possibility of a lengthy appeals process high. \"If there's an appeal, there's a separate commission [that presides over it],\" Lipton said, suggesting that we'd effectively be starting again. You can watch Rob's full Q&A with Matt, Simon and Martin at the top of this page."
    },
    {
        "title": "Chef reveals his pet hate from customers and cheaper olive oil substitute",
        "description": "Every Thursday we interview chefs from around the UK, hearing about their cheap food hacks and more. Today we chat to chef Alex Navarro from Maray in Liverpool.",
        "url": "https://news.sky.com/story/chef-reveals-his-pet-hate-from-customers-and-cheaper-olive-oil-substitute-13317901",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-alex-navarro-chef_6841452.png?20250227144732",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-02-27 08:30:00",
        "Headline": "Chef Alex Navarro sits down with Money to talk about his one piece of advice for an aspiring chef and the biggest mistake he's seen in the kitchen - as well as sharing a cheaper substitute for olive oil and his go-to weeknight spaghetti recipe.",
        "Content": "Every Thursday we interview chefs from around the UK, hearing about their cheap food hacks and more. Today we chat to chef Alex Navarro from Maray in Liverpool. My chef hero is...not a famous chef but my own dad, who is a very good cook, and also my father-in-law, who is Sicilian and also very good. From a young age I've always been around good food and kitchens full of fun and family. One restaurant that's worth blowing out for is...Fallow in London - what they're doing is top tier. My pet hate in restaurants is...people who can't hold a knife and fork properly! I can't look! My one piece of advice for an aspiring chef is...just keep on wanting it, if you truly want it you'll also enjoy it. Keep learning, keep on asking questions and trying new things. The biggest mistake I see in kitchens is...people who've maybe climbed the ladder a bit too quickly and get a senior position when they're not ready. It's not just about cooking, a kitchen needs leadership and this can take a long time to learn to do in a kind and fair way. A tip that non-chefs might not know to make them a better cook is...keep on cooking, reading and talking to people involved in food. Also, there's loads of good content on social media now. \n                  Chef reveals the one thing you should never buy - and his favourite cheap substitutes\n                 \n                  Head chef shares his mince and tatties recipe and tip for preventing waste\n                 \n                  'People treat Michelin like a chain restaurant': Top chef shares frustration in Cheap Eats\n                 My favourite cookbook is...I go through stages. I got the original River Cottage book for my 21st - it touched on foraging and nose to tail cooking, which I was really into when I was younger. More recently, Ottolenghi & Tamimi - I really love both of their books. One thing I wish more people realised about restaurants is... in my experience it's always been very flexible with my life. I think people think it's all late nights and long days but I've found it to be a really flexible and a lovely way to live. I've given free meals...to my wife and children. The worst type of customer is...a rude one. The most overrated single food item is...salt and pepper chicken. My secret ingredient I love and use all the time is...wonton soup seasoning - it gives everything a little lift. My tip for preventing waste is...write your menu at home. Try and plan some of your week this way and you won't buy too much food in your shopping, because you know you're getting a couple of takeaways in the week as well! Also frozen veg is very good and having a couple of different bags in your freezer is handy. I always have soy beans, peas, spinach and green beans in my freezer. My favourite cheap substitute is...virgin rapeseed oil. My go-to cheap eat at home is...very quick spaghetti pomodoro. Ingredients This hasn't even got onion in the sauce - just tomato, garlic and basil! Cook the spaghetti in boiling salted water until just cooked and strain. Reserve some water (about 200ml) and leave to cool. Spread out the spaghetti on a tray and dress in a bit of olive oil so it doesn't stick together (don't run it under cold water to cool down - this isn't needed and it washes the flavour away and makes the pasta wet and soggy). Heat up the remaining olive oil in a sauce pan on a medium heat and slowly caramelise the garlic until golden. Now add the pasta and half the basil. Mix the pasta water with the tomato puree and add this to the pan. Add the salt and sugar and gently cook out until it's started to thicken. When it's finished, add the remaining basil and check seasoning. Add the sauce to your spaghetti."
    },
    {
        "title": "Nvidia signals strong AI chip demand despite DeepSeek threat",
        "description": "Nvidia has signalled no drop in demand for its flagship chips among big artificial intelligence (AI) spenders despite the low-cost challenge posed by Chinese rival DeepSeek.",
        "url": "https://news.sky.com/story/nvidia-signals-strong-ai-chip-demand-despite-deepseek-threat-13317849",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-nvidia-logo_6669295.jpg?20240828164051",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-02-27 05:55:00",
        "Headline": "Investors appear largely satisfied that Nvidia's big AI-spending customers have not been frightened off by DeepSeek's emergence.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Nvidia has signalled no drop in demand for its flagship chips among big artificial intelligence (AI) spenders despite the low-cost challenge posed by Chinese rival DeepSeek. The leading AI chipmaker said it expected Blackwell sales to continue to grow after its latest earnings beat market expectations. Nvidia forecast revenue of around $43bn (£34bn) for its first quarter after achieving a figure of $39.3bn (£31bn) over its last three months - up 12% from the previous quarter and 78% from one year ago. Just a month ago, its shares took a hammering when it emerged DeepSeek's primary chatbot, which uses lower-cost chips, had become the most popular free application on Apple's App Store across the US. Nvidia's shares lost almost $600bn in market value in a day. It also prompted investors to question whether the AI-led stock market rally of recent years was overblown. There was anxiety ahead of Nvidia's earnings report though shares only fell fractionally in after-hours dealing. \n                  Gatwick second runway decision deadline is extended on green concerns\n                 \n                  Money blog: Unlikely UK cities top 'trending' locations for spring holiday - as cheapest and least busy dates to fly abroad revealed\n                 \n                  Paul Flowers: Disgraced former Co-op Bank boss jailed for three years for fraud\n                 Market analysts suggested demand from Microsoft, Amazon and other heavyweight tech companies racing to buildAI infrastructure remained robust, given Nvidia's revenue guidance even though the bulk of it is accounted for through data centres.  Read more: What is DeepSeek? Nvidia founder Jensen Huang said Nvidia has ramped up the massive-scale production of Blackwell and achieved \"billions of dollars in sales in its first quarter\". They were put at $11bn. \"Demand for Blackwell is amazing as reasoning AI adds another scaling law - increasing compute for training makes models smarter and increasing compute for long thinking makes the answer smarter,\" he added. \"AI is advancing at light speed as agentic AI and physical AI set the stage for the next wave of AI to revolutionise the largest industries.\" Derren Nathan, head of equity research at Hargreaves Lansdown, said of the report: \"The longer-term investment case for the driver of the AI train is looking difficult to pick holes in, with Meta's $200bn just one of the latest mega investments in data centres to be unveiled recently. \"By virtue of scale, growth may be slowing a little but upgrades to analysts full-year numbers can be expected off the back of today's results. At a around 30x forward earnings, the valuation still doesn't look overcooked.\""
    },
    {
        "title": "No 10 will think this US trip could not have gone better",
        "description": "With Donald Trump, it's all about relationships.",
        "url": "https://news.sky.com/story/no-10-will-think-this-us-trip-could-not-have-gone-better-13318391",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-keir-starmer-beth-rigby_6840848.png?20250226214749",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-02-27 22:40:00",
        "Headline": "There seemed to be a genuine rapport between Sir Keir Starmer and Donald Trump, who seemed amenable to the UK prime minister even though they are so different.",
        "Content": "\n          Political editor\n              @BethRigby\n  With Donald Trump, it's all about relationships. Going into this bilateral summit, those around Sir Keir Starmer were stressing that these guys genuinely got on well, they liked each other, and that the prime minister could say things to Mr Trump in private and not get his head blown off. What we saw today was a genuine rapport between the two men, and Mr Trump seems amenable to Sir Keir. Number 10 will have thought that this could not have gone better. Politics latest: Trump tells Starmer UK may get 'great' trade deal  One key element for the UK side was convincing Mr Trump to give security guarantees for Ukraine in any kind of peace deal with Russia, but he didn't really bite on that topic. Nonetheless, Sir Keir will have plenty to discuss with European leaders at the big London summit on Sunday.  The big story that emerged out of the press conference was, however, about trade. Mr Trump has been threatening allies around the world with tariffs. Read more:Top moments from Trump and Starmer's press conferenceInside the Oval Office with Trump and Starmer He didn't completely rule out tariffs on the UK, but he did say that what he wanted to do was a trade deal where maybe this could be avoided. That would be a huge win for a prime minister who did not necessarily think he would come out with that, and also for a UK government that really needs to strengthen trade ties with the US because they're looking for economic growth. Whether they can agree on things such as food standards and NHS access is not so clear. But Sir Keir will be pleased with how well this played out today."
    },
    {
        "title": "A 'beautiful' accent and peace deals: Top five moments from Trump and Starmer's press conference",
        "description": "All eyes have been on Sir Keir Starmer as he held the most consequential news conference of his premiership so far.",
        "url": "https://news.sky.com/story/five-key-points-from-starmers-talks-with-trump-including-a-great-trade-deal-13318300",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-keir-starmer-donald-trump_6841833.jpg?20250227221422",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-02-27 19:58:00",
        "Headline": "From praising the prime minister's \"beautiful\" accent to brushing off Canada, the UK-US press conference was an eventful one.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  All eyes have been on Sir Keir Starmer as he held the most consequential news conference of his premiership so far. By Donald Trump's own admission, Sir Keir's first trip to Washington as prime minister got off to an \"outstanding start\". The love-in between the prime minister and the US president continued on stage, as they heaped praise on each other and paid tribute to the special relationship. Here Sky News takes you through the key moments from the conference. Politics latest: Trump praises 'tough negotiator' Starmer after White House talks Ukraine deal still in the balance Sir Keir's defining mission on this trip has been to try and persuade Mr Trump to provide a security guarantee for Ukraine in any peace deal reached with Russia, so that Vladimir Putin does not invade its neighbour again following an initial ceasefire. It appears that no such deal has yet been reached - but the US president did say the White House was \"working towards a very achievable ceasefire in Ukraine\". \"If you want peace, you have to talk both sides,\" he said - which has not been the approach of the international community. \"The next step we are making is toward a very achievable ceasefire.\" However, in language that may sound alarm in Kyiv, Mr Trump said: \"If it doesn't happen quickly, it may not happen at all.\" That statement may spark fear that the US president would be prepared to do a deal at any cost which would favour Vladimir Putin at the expense of Ukraine. By contrast, Sir Keir struck a different tone and said: \"History must be on the side of the peacemaker, not the invader.\" 'Very good chance' of trade deal - and maybe no tariffs? The main news takeaway from the conference was about trade. Sir Keir has been at pains to charm Mr Trump into striking a good trade deal with the UK, following the wilderness years under former president Barack Obama when the UK was famously \"at the back of the queue\". As part of that, the prime minister is hoping the US will not impose punitive tariffs on the UK, as it minded to do with close neighbour Canada - because any such move would make his mission to grow the economy nigh on impossible. Asked if Sir Keir had convinced him not to impose trade tariffs on the UK, Mr Trump said to laughter: \"He tried.\" \"He was working hard, I'll tell you that,\" he joked. \"He earned whatever the hell they pay him over there, but he tried.\" He added: \"I think there's a very good chance that in the case of these two great, friendly countries, I think we could very well end up with a real trade deal where the tariffs wouldn't be necessary. We'll see.\" Talking of Canada... Uh oh, Canada Sir Keir was asked about the president's recent comments about wanting to make Canada the 51st US state. The prime minister gave the question short shrift, saying: \"I think you're trying to find a divide between us that simply doesn't exist. \"We're the closest of nations, and we had very good discussions today, but we didn't discuss Canada.\" 'What a beautiful accent' More praise came when Sir Keir said the UK was \"ready to put boots on the ground and planes in the air\" to support a deal on Ukraine working with allies. \"That is the only way peace will last,\" he added As he wrapped up his speech, Mr Trump remarked: \"What a beautiful accent. \"I would have been president 20 years ago if I had that accent.\" Read more:Inside the Oval Office with Donald Trump and Keir StarmerWhat does the King's letter to Trump say? In it to win it Throughout the conference, Sir Keir spoke in language that at times felt alien to his personality - he spoke in Trump rhetoric and appealed to his competitive spirit. \"We believe it's not taking part that counts,\" he said. \"What counts is winning. If you don't win, you don't deliver. \"We're both in a hurry to get things done. And that's what the UK and US do - when we work together, we win and we get things done.\""
    },
    {
        "title": "Trump questioned about Zelenskyy 'dictator' comment - and says he will visit UK soon",
        "description": "Donald Trump has questioned whether he ever called President Zelenskyy a \"dictator\" &#160;- after he was invited by King Charles for an \"unprecedented\" second state visit to the UK.",
        "url": "https://news.sky.com/story/donald-trump-says-he-will-visit-uk-in-near-future-after-receiving-historic-invitation-from-the-king-13318218",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-starmer-trump_6841820.jpg?20250227215847",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-02-27 17:21:00",
        "Headline": "Sir Keir Starmer and the US president put up a united front ahead of crucial talks on Ukraine's future and trade with the UK.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  Donald Trump has questioned whether he ever called President Zelenskyy a \"dictator\"  - after he was invited by King Charles for an \"unprecedented\" second state visit to the UK. Sir Keir Starmer presented the US president with a copy of the invitation while the pair met in the Oval Office. The prime minister and his US counterpart shared warm words as they spoke ahead of a press conference in which they are expected to reveal details of their discussions on the Ukraine war and trade. Politics latest: Trump asks Starmer if the UK could take on Russia by itself Mr Trump called Sir Keir a \"special man\" and a \"great gentleman\" as he said he would be visiting the UK in the \"near future\". Speaking to reporters from the Oval Office, President Trump said it was a \"great honour to have Prime Minister Starmer at the Oval Office\". \"It's a very special place, and he's a special man - and the United Kingdom is a wonderful country that I know very well, I'm there a lot.\" He said the pair would discuss the Russia-Ukraine war, trade, and \"lots of other items\". \"And I think we can say we are going to be getting along on every one of them,\" the president added. Analysis: 'That was a lot': Inside the Oval Office with Donald Trump and Keir Starmer  'A backstop, you could say' Sir Keir also made opening remarks and praised Mr Trump for \"changing the conversation\" on Ukraine \"to bring about the possibility that now we can have a peace deal\". \"We want to work with you to make sure that this deal, is enduring, that it lasts, that it's a deal that goes down as a historic deal that nobody breaches,\" he said. \"And we'll work with you, to make sure that that absolutely happens.\" The condition of a US security \"backstop\" to deter Vladimir Putin from future aggression has been a key demand of the UK and European allies, with the prime minister saying it was the only path to peace in Ukraine. There had been concern that Mr Trump would stop short of providing the commitment after he said cryptically that he would not \"make security guarantees beyond very much\". Later in the exchange, Mr Trump appeared to suggest that a planned deal on minerals with Ukrainian president Volodymyr Zelenskyy would effectively be a security \"backstop\". \"President Zelenskyy is coming to see me on Friday morning. And we're going be signing really a very important agreement for both sides because it's really going to get us into that country, working there,\" he said. He added it was a \"backstop, you could say\". However, in an awkward moment, the president spoke warmly of his relationship with Putin, saying he had a \"very good relationship\" with him as well as Mr Zelenskyy. And asked why he appeared to trust Putin when Sir Keir did not, Mr Trump replied: \"I know a lot of people that you would say no chance that they would ever deceive you, and they are the worst people in the world. \"I know others that you would guarantee they would deceive you, and you know what, they're 100% honourable, so you never know what you're getting. \"No, I have confidence that if we make a deal, it's going to hold.\" 'We've had free speech for a long time' There was also some disruption to the positive mood music in the form of US Vice President JD Vance, who challenged the prime minister on what he called \"infringements on free speech\" in the UK. Sir Keir issued a swift rebuttal to Mr Vance, saying: \"Well, we've had free speech for a very, very long time in the United Kingdom and it will last for a very, very long time. \"Certainly, we wouldn't want to reach across US citizens, and we don't, and that's absolutely right - but in relation to free speech in the UK I'm very proud of our history there.\"  'Did I say that?' The apparent positive exchange bodes well for the prime minister, who has been seeking to act as a bridge between the US and Europe, who appear to be increasingly at odds over the ongoing war in Ukraine. Mr Trump stunned Ukraine and European leaders earlier this month when he announced he had called Mr Putin - a pariah on the international stage - to discuss ending the war, without consulting them. Talks were then held between top US and Russian officials in Saudia Arabia with the aim of restoring ties and setting up negotiations to end the war in Ukraine. A series of controversial statements made by the president - including that Ukraine started the war and that President Zelenskyy was a \"dictator\" because he had not held elections during the war - also sparked fear that the US would reach a deal with Russia that would have been damaging to Ukraine. Asked by a journalist to repeat his statement about the Ukrainian president, Mr Trump said: \"Did I say that? I can't believe I said that. Next question.\" Chagos deal 'doesn't sound bad' In another positive sign for Sir Keir, the US president appeared to speak approvingly of the contentious Chagos Islands deal, in which the Indian Ocean archipelago would be transferred to Mauritius after a decades-long dispute. The agreement includes the tropical atoll of Diego Garcia, home to a UK-US military base that plays a crucial role in the region's stability and international security. Read more:Two reasons why Starmer's meeting with Trump really mattersBritain remains vulnerable with an unpredictable Trump Under the proposed agreement, the UK would lease back Diego Garcia for 99 years at a reported annual cost of around £90m. Although the Biden administration welcomed the deal as a \"win for diplomacy\", Mr Trump's White House had expressed reservations about the deal owing to its concerns over China's influence in Mauritius. The US president was asked whether he agreed with the deal, to which he replied: \"Well, we're going to have some discussions about that very soon.\" He added: \"I think we'll be inclined to go along with your country. We have to be given the details, but it doesn't sound bad.\" Mr Trump's invitation from the King would be the second state visit to the UK after former prime minister Theresa May made a similar gesture to Sir Keir in 2017."
    },
    {
        "title": "What does the King's letter to Trump say?",
        "description": "Usually, correspondence written by the King is not made public, but Donald Trump held up the letter in the Oval Office.",
        "url": "https://news.sky.com/story/what-does-the-kings-letter-to-trump-say-13318305",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-letter_6841735.jpg?20250227200818",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-27 20:05:00",
        "Headline": "The King says the UK and the US have \"a vital role to play\" - and mentions the president visiting golf courses.",
        "Content": "Usually, correspondence written by the King is not made public, but Donald Trump held up the letter in the Oval Office. The letter, which was inviting him to the UK for a historic second state visit, was handed to him by Prime Minister Sir Keir Starmer. Here is what we have been able to make out from the photos. In the opening paragraph, the King references the \"breadth of challenges across the world\", and says the UK and the US have \"a vital role to play\". Follow live: Trump questioned about Zelenskyy 'dictator' comment He goes on to say that he remembers \"with great fondness\" Mr Trump's visits to the UK during his \"previous presidency\". The King mentions Mr Trump visiting the golf course the US president owns in Turnberry and then appears to suggest a visit to Balmoral or Dumfries House in Scotland at some stage - estates owned or run by the monarch. \n                  Politics latest: Trump tells Starmer UK may get 'great' trade deal following White House talks\n                 \n                  No 10 will think this US trip could not have gone better\n                 \n                  A 'beautiful' accent and peace deals: Top five moments from Trump and Starmer's press conference\n                 He writes: \"There is much on both Estates which I think you might find interesting and enjoy - particularly as my Foundation at Dumfries House provides hospitality skills-training for young people who often end up as staff in your own establishments! \"Quite apart from this presenting an opportunity to discuss a wide range of issues of mutual interest, it would also offer a valuable chance to plan a historic second State Visit to the United Kingdom. \"As you will know, this is unprecedented by a US president. That is why I would find it helpful for us to be able to discuss, together, a range of options for location and programme content. \"In so doing, working together, I know we will further enhance the special relationship between our two countries, of which we are both so proud.\" After reading the letter Mr Trump said: \"That's a great, great honour. And that says at Windsor - that's really something.\" Mr Trump, the first ever convicted felon to become US president, accepted the invitation from the King - making him the only elected political leader in modern times to be invited to two state visits by a British monarch. Sky News contacted Buckingham Palace to ask when the second state visit might take place and they said: \"When diaries allow.\" Questions remain as to what form the state visit will take, who would accompany Mr Trump in his presidential party and whether this could include his close ally, billionaire businessman Elon Musk who is acting as his senior adviser on federal spending. Mr Trump's first UK state visit took place during his initial term as president - when he was hosted by the late Queen in 2019. Precedent for second-term US presidents who have already made a state visit is usually tea or lunch with the monarch at Windsor Castle, as was the case for George W Bush and Barack Obama. President Trump has earlier separately said he would be visiting the UK in the \"near future\". The Royal Family's soft power diplomacy is viewed as a way of engaging with the controversial billionaire-turned-politician, who is well known for his love of the monarchy. Read more:Inside the Oval Office with Trump and StarmerTrump questioned about Zelenksyy 'dictator' commentStarmer contradicts Vance over free speech claims  A stay at Balmoral in the Scottish Highlands could be seen as appealing to Mr Trump's heritage - his mother Mary Anne was born on the Isle of Lewis in the Outer Hebrides and he has two golf resorts in the country. Buckingham Palace's ongoing £369m refurbishment is focusing on its grandest state rooms, meaning it is unlikely to host any state visits for the next two years. Balmoral - the turreted grey stone castle by the River Dee - is the King's private Scottish home which has served as a summer sanctuary for generations of monarchs since it was bought for Queen Victoria by Prince Albert in 1852. The only other US president to stay at Balmoral was Dwight D Eisenhower in the summer of 1959, but it was an informal trip rather than a state visit. Mr Eisenhower had an affectionate relationship with the late Queen, who made a last minute decision to drive down to Balmoral's Lodge Gate to personally greet her guest when he inspected a guard of honour."
    },
    {
        "title": "Starmer refuses to say if further tax rises will be imposed at spring statement",
        "description": "The prime minister has refused to say whether further tax rises will be imposed in the spring statement.",
        "url": "https://news.sky.com/story/starmer-refuses-to-say-if-further-tax-rises-will-be-imposed-at-spring-statement-13317895",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-starmer-washington_6841127.jpg?20250227085436",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-02-27 08:17:00",
        "Headline": "Chancellor Rachel Reeves pledged to only hold one budget a year, but the economy has taken a dive since October and she may have to raise taxes to stick to her fiscal rules.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The prime minister has refused to say whether further tax rises will be imposed in the spring statement. Sir Keir Starmer said the government was in the \"early stages\" of looking at whether tax rises or spending cuts were needed to meet Labour's self-imposed fiscal rules. He would not say if Ms Reeves is looking at further tax cuts to give her more headroom after months of economic downturn, and said the \"big decisions\" on tax were made in the October budget. Politics latest: 'Very important' US agrees to Chagos deal between UK and Mauritius Speaking to reporters on the plane to Washington DC to meet Donald Trump, he said: \"Obviously I am not going to get ahead of myself until we have made decisions. \"But as I have said before, in terms of the big decisions on tax obviously the budget was the place that we took those decisions - but as ever, going into a statement I am not going to say in advance what we might do and what we might not do. \"But let me not set hares running, the big decisions were in the budget of last year and that's the way we are approaching this spring statement.\" \n                  Former Bank of England governor Lord King says income taxes must rise\n                 \n                  More pressure to raise taxes or cut spending - despite greatest budget surplus since records began\n                 \n                  Reeves' hunt for growth sparks summit with top investment bankers\n                 In October, Rachel Reeves set out new fiscal rules - restrictions on fiscal policy the government sets to constrain its own decisions on spending and taxes.\n\nThey are: The stability rule: The current budget should be on course to be in balance or surplus by 2029/30 The investment rule: Net financial debt should fall as a share of the economy in 2029/30 The welfare cap: Some types of welfare spending must remain below a pre-specified level It is less than a month away from the spring statement on 26 March, when the Office for Budget Responsibility (OBR) will publish its forecast on the UK economy. Chancellor Rachel Reeves will set out the fiscal watchdog's toplines, which are widely expected to be a reduction in growth outlook and will warn the chancellor is at risk of breaching her fiscal rules.  Former Bank of England governor Lord Mervyn King told Sophy Ridge's Politics Hub programme on Wednesday that income taxes will have to rise to plug the UK's financial blackhole. He said taxes would need to be increased to accommodate both a rise in defence spending, announced on Tuesday, and public services reform. \"The obvious tax to raise is the basic rate of income tax, we will all contribute to it,\" he said. Lord King added he would not have raised employers' national insurance contributions, as Ms Reeves did in October, but would instead have increased employees' income tax. Read more:Two reasons why Starmer's meeting with Trump really mattersStarmer insists on security guarantee for Ukraine as he arrives in Washington  The OBR is required to produce two economic forecasts a year, but, the chancellor said she would only give one budget a year to provide stability and certainty on upcoming tax changes. However, there is speculation about tax changes due to the poor economic climate since the autumn budget. Inflation has risen to its highest level in 10 months to 3%, there has been a sharp rise in government bond yields and growth has not been as high as expected. This has led to the chancellor's £9.9bn headroom against her fiscal rules being all but wiped out. Ms Reeves could extend a freeze on income tax bands and allowances beyond April 2028, dragging more people into paying more tax as their pay rises. She is reportedly considering lowering the annual limit on how much people can put into cash ISAs from £20,000 to £4,000."
    },
    {
        "title": "Mike Amesbury: MP jailed for punching constituent in street walks free after appealing against prison sentence",
        "description": "Former Labour MP Mike Amesbury will walk free after winning an appeal against his 10-week jail sentence for punching a man in the street.",
        "url": "https://news.sky.com/story/mike-amesbury-mp-jailed-for-punching-constituent-in-street-walks-free-after-appealing-prison-sentence-13317984",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-mike-amesbury-mp-cheshire_6841483.jpg?20250227152511",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-02-27 10:31:00",
        "Headline": "The 55-year-old punched his constituent several times and was heard shouting: \"You won't threaten your MP again will you, you f****** soft lad?\"",
        "Content": "\n          Political reporter\n              @alixculbertson\n Former Labour MP Mike Amesbury will walk free after winning an appeal against his 10-week jail sentence for punching a man in the street. The sentence handed to him on Monday will now be suspended for two years. It means the Runcorn and Helsby MP will not be jailed, unless he commits any more crimes within that time. Politics latest: I can trust Trump, says Starmer Honorary Recorder of Chester Judge Steven Everett also ordered Amesbury to carry out 200 hours of unpaid work, undertake a 120-day alcohol monitoring requirement, go on an anger management course and carry out 20 days of rehabilitation work. Amesbury, 55, pleaded guilty in January to beating by assault after punching Paul Fellows, 45, in Main Street, Frodsham, Cheshire, in the early hours of 26 October after his constituent asked him about a bridge closure. He had been set to serve 40% of his sentence - four weeks - in prison followed by a year on licence. \n                  Politics latest: Trump tells Starmer UK may get 'great' trade deal following White House talks\n                 \n                  No 10 will think this US trip could not have gone better\n                 \n                  A 'beautiful' accent and peace deals: Top five moments from Trump and Starmer's press conference\n                 However, his lawyer launched an appeal shortly after he was sentenced and after the appeal was heard at Chester Crown Court on Thursday, the judge said his jail time should be suspended.  Amesbury arrived at the court in a prison van, having spent three nights in prison, and was led into the building in handcuffs by an officer. The judge initially ordered a 12-month alcohol monitoring requirement, but changed his mind and said it should be 120 days. Amesbury came out of the court three hours after the decision and said he \"sincerely\" apologises to Mr Fellow and his family, however would not answer whether he would resign. He added: \"I'm now going to go and see my family and go home.\"  The Labour Party, which suspended Amesbury shortly after the incident, said he would not be allowed back into the party after his original sentencing. However, he remains an independent MP and will continue to receive his £91,000 salary under parliamentary rules, which state an MP only has their salary removed when they are no longer an MP. Amesbury has been urged to resign by Labour and Reform but has not done so and a recall petition cannot be issued until he has exhausted any appeals. He has not yet indicated if he will appeal his latest sentence. A recall petition kickstarts a by-election if 10% of an MP's constituents sign it. Read more:Yvette Cooper calls for new Runcorn MPStarmer refuses to say if further tax rises will be imposed Footage replayed in court on Thursday, showed Amesbury punching Mr Fellows in the head, knocking him to the ground then punching him five more times. He was heard saying: \"You won't threaten your MP again will you, you f****** soft lad?\" The hearing was told Amesbury gave a prepared statement in a police interview where he initially claimed he had been approached by a man \"shouting and screaming\" about local and national matters, including a local swing bridge and immigration. In the statement, he told police: \"I thought I was about to be physically assaulted by this male. I was terrified and felt vulnerable and cornered by the male and others in the group.\" He said the man's \"arms were swinging\" and he thought there was no option but to \"defend\" himself. Judge Everett said: \"What he said to police doesn't seem to fit in with the CCTV in pretty well any respect.\" Amesbury's barrister told the court he had spent three nights in prison, \"an experience he will never forget, certainly\". He said the \"public shaming\" and \"embarrassment\" had a huge impact on Amesbury, who he said \"will learn a painful lesson\"."
    },
    {
        "title": "Charities urge Sir Keir Starmer to reverse 'alarming' foreign aid cut",
        "description": "A coalition of more than 100 charities has urged the government to reverse its decision to slash the foreign aid budget, warning it amounted to an attempt to \"balance the books on the backs of the world's most marginalised people\".",
        "url": "https://news.sky.com/story/charities-urge-sir-keir-starmer-to-reverse-alarming-foreign-aid-cut-13318137",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-foreign-aid-defence-spending_6841501.jpg?20250227154654",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-02-27 16:13:00",
        "Headline": "A coalition of more than 100 NGOs write to the prime minster and Treasury to warn the decision \"will leave the government's ambition to be a reliable development partner on the global stage in tatters\".",
        "Content": "\n          Political reporter\n              @alexrogerssky\n A coalition of more than 100 charities has urged the government to reverse its decision to slash the foreign aid budget, warning it amounted to an attempt to \"balance the books on the backs of the world's most marginalised people\". The charities - which include Save the Children UK, Oxfam GB, and Christian Aid - have written to the prime minister and Treasury warning the decision to cut the UK aid budget from 0.5% of GDP to 0.3% would \"destroy Labour's legacy on international development\". The leaders of the non-governmental organisations, which also includes Action Aid UK and Islamic Relief, said they were \"appalled\" by the decision on the grounds it risked closing programmes that supported the most marginalised communities facing poverty, conflict and climate change. Politics latest: Trump 'very pleased' with UK's defence spending boost \"As 138 leaders of the UK INGO sector, responding to urgent humanitarian emergencies and supporting global development, we are appalled by the recent announcement that UK aid will be cut to pay for defence spending,\" the letter read. \"It is alarming that the UK is now following in the US's footsteps and has accepted the false choice of cutting the already diminished UK aid to fund defence. \"We implore you to reverse this decision before significant damage is done to both the UK's development and humanitarian work and its global reputation.\" \n                  No 10 does not rule out defence spending increase could go to Chagos deal\n                 \n                  UK defence spending to rise to 2.5% of GDP by 2027 - as Starmer hits out at 'tyrant' Putin\n                 \n                  Public services prepare for up to 11% cuts - as defence secretary says 'we must rearm'\n                 In its manifesto, Labour said it was \"committed to restoring development spending\" to 0.7% of gross national income as \"soon as fiscal circumstances allow\" after it was reduced by the Tories following the COVID pandemic. Sir Keir Starmer said the reduction in foreign aid was \"not a renouncement I'm happy to make\", but added it was necessary to fund an increase in defence spending to 2.5% of GDP by 2027 in light of Russia's ongoing invasion of Ukraine. Speaking at a press conference in Downing Street after he informed the Commons of his decision, the prime minister admitted the move was \"accelerated\" by Donald Trump taking office.  The group of charities said that although they understood \"the safety and security of the people of Britain should always be a priority\", using the UK aid budget to do this was \"both strategically and morally wrong\". \"No government should balance its books on the backs of the world's most marginalised people,\" the NGO leaders added. \"This move will also destroy Labour's legacy on international development and will leave your manifesto commitments and the government's ambition to be a reliable development partner on the global stage in tatters.\" Labour's decision to cut foreign aid follows a similar move in the US, where almost all workers are being pulled out of the US Agency for International Development (USAID) as part of Elon Musk's efficiency drive. The charities said the 90-day suspension had already had an impact across the sector. Read more:What foreign aid is being cutUSAID plans will erode American influence In South Africa, HIV vaccine trials have been halted, while in Uganda, HIV medicine has run out and food and shelter programmes in refugee camps have been terminated, they said. At the press conference, Sir Keir denied Mr Trump was effectively setting UK government policy, saying the defence spending increase was \"very much my decision\" and he had been \"arguing for some time\" that Europe and the UK \"needed to do more\". The cut to foreign aid means around £6bn per year will be taken out of the aid budget, which amounts to a reduction in spending from 0.5% of GDP to 0.3%. The Treasury has been approached for comment."
    },
    {
        "title": "UK faces potential second norovirus wave with even recently infected people at risk",
        "description": "The UK could face a second norovirus wave, according to health officials, who warned that people who have recently had the illness may be at risk again.",
        "url": "https://news.sky.com/story/uk-faces-potential-second-norovirus-wave-with-even-recently-infected-people-at-risk-13318029",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-emergency-accident_6784765.jpg?20241224212420",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-27 11:21:00",
        "Headline": "New NHS figures show the number of beds taken up by patients with the virus is nearly 150% higher than last year.",
        "Content": "The UK could face a second norovirus wave, according to health officials, who warned that people who have recently had the illness may be at risk again. On Thursday, the UK Health Security Agency (UKHSA) warned laboratory reports of the virus, which can cause nausea, vomiting and diarrhoea, are at their highest-ever levels. There are an \"exceptionally high\" number of cases at the moment, said Amy Douglas, lead epidemiologist at UKHSA. New NHS figures also show the number of beds taken up by patients with the virus is nearly 150% higher than last year. Health officials believe a certain norovirus strain could be driving up cases as people who have been previously infected may not have immunity. That also means that people who have recently been ill with norovirus are at risk of catching it again. The less common strain now represents 29% of cases compared to just 10% three months ago. \n                  Breast cancer cases and deaths set to surge, study suggests\n                 \n                  Parkrun should be prescribed on the NHS, charity behind it says\n                 \n                  'Life-saving' simple blood test could transform and personalise cancer care if trial succeeds\n                 Several UK studies have found that norovirus is the most common cause of gastrointestinal illness, where a cause is identified. Read more from Sky News:Actor Gene Hackman and wife found dead at homeStarmer in Washington for Trump talksProbe blasts off to chase asteroid \"We are seeing the biggest impacts in health and social care settings, such as hospitals and care homes,\" said Ms Douglas. \"Symptoms of norovirus can be more severe in older adults, young children and those who are immunocompromised. \"If you have diarrhoea and vomiting, please do not visit hospitals and care homes or return to work, school or nursery until 48 hours after your symptoms have stopped and don't prepare food for others, as you can still pass on the virus during this time.\" Norovirus is highly contagious and isn't killed by alcohol gel or wipes. To avoid spreading the virus, people should wash their hands with soapy water and use bleach to clean surfaces, according to Ms Douglas. \"These statistics show that we are still not out of the winter woods,\" said health secretary Wes Streeting. Professor Sir Stephen Powis, NHS England's national medical director, warned that \"we can be under no illusions about the continued pressure staff are still facing\"."
    },
    {
        "title": "Deaths of Gene Hackman and wife 'suspicious enough' to require 'investigation' - police warrant",
        "description": "Hollywood legend Gene Hackman and his wife have been found dead, with authorities saying the couple had seemingly been deceased for some time when their bodies were discovered. ",
        "url": "https://news.sky.com/story/oscar-winning-actor-gene-hackman-and-wife-found-dead-at-home-13317861",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gene-hackman-wife-betsy-arakawa_6841175.jpg?20250227093419",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-27 06:36:00",
        "Headline": "Santa Fe County Sheriff's Office said deputies responded to a request to do a welfare check on Wednesday around 1.45pm local time and found Hackman, his wife Betsy Arakawa and a dog dead.",
        "Content": " Hollywood legend Gene Hackman and his wife have been found dead, with authorities saying the couple had seemingly been deceased for some time when their bodies were discovered.  Hackman, 95, and his 63-year-old wife Betsy Arakawa were found dead in their New Mexico home on Wednesday, it was announced this morning. One of their pet dogs also died. Santa Fe County Sheriff's Office spokesperson Denise Avila said deputies found the bodies while carrying out a welfare check on Wednesday at around 1.45pm local time. The actor's body was discovered in a mudroom while Arakawa was found in a bathroom next to a heater, detectives from the sheriff's office wrote in a search warrant. There were scattered pills and an open prescription bottle on a countertop near the 63-year-old. There was no indication they had been shot and they had no other wounds, Ms Avila said. The warrant added the door to the property was found ajar and there were no signs of forced entry. A German Shepherd was found dead in a bathroom closet near Arakawa, police added. Two healthy dogs were on the property. The police have since said the deaths of Hackman and his wife are \"suspicious enough in nature to require a thorough search and investigation\". The actor's daughter had earlier suggested they may have been killed by carbon monoxide - but the cause of death remains unclear. Speaking to TMZ, Elizabeth Jean Hackman said the family was not sure but thought the couple may have died from toxic fumes. The local utility company tested gas lines in and around the home after the bodies were found and did not find any sign of problems, the warrant said. In a statement issued to Sky News, the sheriff's office said: \"We do not believe foul play was a factor in their deaths, however exact cause of death has not been determined at this time.\" Hackman's daughters, Elizabeth and Leslie, and granddaughter, Annie, said: \"He was loved and admired by millions around the world for his brilliant acting career, but to us he was always just Dad and Grandpa. \"We will miss him sorely and are devastated by the loss,\" they added in a statement. Hackman won an Oscar for a leading role in The French Connection, a 1971 action movie by William Friedkin, and another for best supporting actor in Clint Eastwood's 1992 western, Unforgiven. He was also known for playing Lex Luthor in the Superman films of the late 1970s and 1980s.  Roles in the Francis Ford Coppola mystery thriller The Conversation and in the historical drama Mississippi Burning, where he starred as an FBI agent alongside Willem Dafoe, helped cement his career as one of Hollywood's greats. Long career The former US Marine appeared in more than 80 films, as well as on television and the stage, during a lengthy career that started in the early 1960s. He earned his first Oscar nomination for his breakout role as the brother of bank robber Clyde Barrow in 1967's Bonnie and Clyde. He is also remembered for playing Captain Frank Ramsey alongside Denzel Washington in the 1995 thriller Crimson Tide. Read more:Follow latest: Actor and wife were dead for some timeIn pictures: Hollywood legend on silver screen In the early 2000s, he starred as an eccentric patriarch in The Royal Tenenbaums by Wes Anderson. Hackman's final film appearance was in 2004's Welcome to Mooseport, after which he retired from acting and began co-writing adventure novels with friend and underwater archaeologist Daniel Lenihan. \"It's very relaxing for me,\" Hackman told Empire Magazine in 2020. \"I don't picture myself as a great writer, but I really enjoy the process.\" 'He could play anyone' Michael Caine revered Hackman as \"one of the greatest actors\" he had known while presenting him with the Cecil B DeMille Award in 2003. Arakawa was a classical pianist. The couple married in 1991 and lived outside Santa Fe, New Mexico. Hackman had three children, Christopher, Elizabeth Jean and Leslie Anne, with his late ex-wife, Faye Maltese, who died in 2017. Star Trek star George Takei said: \"We have lost one of the true giants of the screen,\" in a tribute on X. \"Gene Hackman could play anyone, and you could feel a whole life behind it. \"He could be everyone and no one, a towering presence or an everyday Joe. That's how powerful an actor he was,\" Takei wrote on X. \"He will be missed, but his work will live on forever.\" Read more from arts and entertainment:Oscars A-Z: From Anora to a (disqualified) Hans ZimmerGossip Girl and Buffy The Vampire Slayer actress dies aged 39 Irish comedian Dara O Briain called Hackman \"the finest screen actor ever\". \"Not a single duff performance, in a long, long career,\" he wrote in a post on X. Hackman was versatile on screen, working with a face that he described to the New York Times in 1989 as that of \"your everyday mine worker.\" StudioCanal, the UK arm of the leading European film studio, called Hackman's death \"a colossal loss for cinema\" in a tribute posted on X."
    },
    {
        "title": "Princess Eugenie posts tribute to 'special friend' Michelle Trachtenberg",
        "description": "Princess Eugenie has posted a tribute to Michelle Trachtenberg after the actress's death.",
        "url": "https://news.sky.com/story/princess-eugenie-posts-tribute-to-special-friend-michelle-trachtenberg-13318177",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-michelle-trachtenberg_6841747.jpg?20250227202349",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-27 15:58:00",
        "Headline": "Tributes to the Buffy the Vampire Slayer star have poured in following her death aged 39, with Sarah Michelle Gellar and Blake Lively among the famous faces who have shared messages online. ",
        "Content": "Princess Eugenie has posted a tribute to Michelle Trachtenberg after the actress's death. The Gossip Girl and Buffy the Vampire Slayer star, 39, was found dead at her home in New York City on Wednesday. An investigation into her death has been opened but \"criminality is not suspected\", police said. In a post on Instagram today, Princess Eugenie thanked Trachtenberg for \"so many memories\". \"Goodbye special friend. You are so loved and missed,\" she wrote. \"Thank you for so many memories of laughter and fun. You were so thoughtful and generous and sooo funny. \"My favourite was listening to you order food, always done with precision so you got exactly what we all wanted. \"I'm thinking of you up there friend, of your spirit that was so bright and your joy you brought to so many.\" Eugenie previously lived in New York and in 2013, she was seen attending a basketball game at Madison Square Garden with Trachtenberg. The actress shared numerous social media updates featuring the princess over the years. In 2020, she hailed her as \"one of the most dearest, kindest, most genuine friends I have ever had in my life\" and four years prior, she wrote: \"There are few people in life that you meet that you know are true and real. This lady happens to be one of them.\" Buffy and Gossip Girl co-stars pay tribute Trachtenberg was best known for playing Dawn Summers in Buffy, the younger sister of the title character played by Sarah Michelle Gellar, and starring as Georgina Sparks in Gossip Girl. Paying tribute to her co-star, Gellar shared a series of pictures of herself and Trachtenberg, alongside a caption referencing a scene from the hit show. \"Michelle listen to me. Listen. I love you. I will always love you. The hardest thing in this world, is to live in it. I will be brave. I will live… for you,\" she wrote. James Marsters, who played punk vampire Spike, told fans on Instagram: \"My heart is heavy today. We have lost a beautiful soul. \"Michelle was fiercely intelligent, howlingly funny, and a very talented person. She died much too young, and leaves behind scores of people who knew and loved her.\" A number of Trachtenberg's Gossip Girl co-stars have also shared tributes on social media, with Blake Lively - who starred as Serena van der Woodsen in the teen drama - writing on Instagram: \"Everything she did, she did 200%.\" Lively added: \"She laughed the fullest at someone's joke, she faced authority head on when she felt something was wrong, she cared deeply about her work, she was proud to be a part of this community and industry as painful as it could be sometimes, she was fiercely loyal to her friends and brave for those she loved, she was big and bold and distinctly herself.\" Taylor Momsen, Gossip Girl's Jenny Humphrey, said: \"I will miss you everyday my love.\" \"I'll miss our late night calls that no one should ever hear but us,\" she wrote. \"She was always in my corner and there to support me whether I was right or wrong. \"I think we truly understood each other and I am so grateful to have had a friend like you in my life for so long.\" More from Sky News:Deaths of Gene Hackman and wife 'suspicious enough' to require 'investigation'Nineties boyband to reunite with UK tour \"Michelle was one of a kind,\" wrote fellow Gossip Girl star Chace Crawford. \"I remember her coming on set for the first time and just absolutely owning it. \"She was a force of nature and just so so unapologetically funny and magnetic.. remembering those years with a big smile. Just a terrible loss. Love you.\" \"Rest in peace sweet Michelle,\" Kim Cattrall wrote alongside a picture of herself and Trachtenberg in the 2005 film Ice Princess. Kate Beckinsale posted: \"What a terrible shock and loss, my god. My heart aches for your mama. Fly safe little bird.\" Trachtenberg's most recent film appearance came last year, when she played the role of Michelle Cody White in Spyral. Police said an investigation into her death has been opened but \"criminality is not suspected\"."
    },
    {
        "title": "Katy Perry set to travel to space as part of all-female mission",
        "description": "Katy Perry is set to head to space as part of an all-female mission.",
        "url": "https://news.sky.com/story/katy-perry-set-to-travel-to-space-as-part-of-all-female-mission-13318183",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-katy-perry-us_6841527.jpg?20250227163004",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-27 16:11:00",
        "Headline": "The 40-year-old singer will travel on the next launch of Jeff Bezos' Blue Origin rocket.",
        "Content": "Katy Perry is set to head to space as part of an all-female mission. The 40-year-old singer will travel on the next launch of Jeff Bezos' Blue Origin rocket, the aerospace engineering company said. The Teenage Dream singer will be joined on the New Shepard programme's 11th human flight by former NASA rocket scientist Aisha Bowe, research scientist Amanda Nguyen, film producer Kerianne Flynn and TV hosts Gayle King and Lauren Sanchez - who is also Bezos' fiancee. The mission will \"challenge [the crew's] perspectives of Earth\", \"empower them\" and \"create lasting impact that will inspire generations\", according to organisers. Perry is one of the best-selling music artists of all time, with more than 115 billion streams. She said she hopes her journey will encourage her daughter and others to \"reach for the stars, literally and figuratively\". So far, the New Shepard programme has flown 52 people above the Karman line, which is internationally recognised as the boundary of space. Read more from Sky News:Woman, 19, dies in dog attack - two arrestedActor Gene Hackman found dead with wife and dog This is the first all-female crew since Valentina Tereshkova's solo flight to space in 1963. New Shepard is a reusable sub-orbital launch vehicle developed for space tourism. Named after Alan Shepard, the first American to travel into space, it can take off and land vertically. Other notable people who have joined the flights include Bezos, Star Trek actor William Shatner and former NFL player Michael Strahan. The latest flight, NS-31, will launch in the spring."
    },
    {
        "title": "Christopher Hughes: Eggheads star and former Mastermind and Brain of Britain winner dies",
        "description": "Christopher Hughes, who was one of the stars of the hit TV show Eggheads, has died.",
        "url": "https://news.sky.com/story/christopher-hughes-eggheads-star-and-former-mastermind-and-brain-of-britain-winner-dies-13318182",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-christopher-hughes_6841524.jpg?20250227162237",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-27 15:53:00",
        "Headline": "Hughes was in the original line-up and joined the show after winning Mastermind, International Mastermind. He was also crowned Brain of Britain.",
        "Content": "Christopher Hughes, who was one of the stars of the hit TV show Eggheads, has died. Hughes was a member of the regular panel of quiz experts on the programme, which was first broadcast in 2003. He passed away at his home in Crewe at the age of 77, according to reports. Hughes was in the original line-up and joined the show more than 20 years ago after winning Mastermind and International Mastermind in 1983. He was also crowned Brain of Britain in 2005. The Eggheads programme wrote on social media: \"It is with immense sadness that we announce the passing of Eggheads great Chris Hughes. \"Chris joined the show at the very start in 2003 and over the next 20 years gave us not only brilliant answers but very many laughs and happy memories. \n                  Deaths of Gene Hackman and wife 'suspicious enough' to require 'investigation' - police warrant\n                 \n                  Princess Eugenie posts tribute to 'special friend' Michelle Trachtenberg\n                 \n                  Gene Hackman death latest: Deaths of actor and wife 'suspicious enough' to require 'investigation' - police warrant\n                 \"He loved being an Egghead and will be hugely missed by all his Eggheads family.\" Read more from Sky News:Nineties boyband reunite and will tour the UKPeppa Pig due to get another sibling 'An amazing Egghead' Eggheads producer Robert Dean wrote on X: \"Very sad to say that our brilliant Egghead Chris has sadly passed away. He was an amazing Egghead who considered everyone on the production team part of his family. \"I have such fond memories of him and count myself lucky to have known him. I'll miss him tremendously.\" The general knowledge challenge programme began on the BBC before moving to Channel 5. In the show, a team made up of members of the public tried to beat the \"eggheads\". If they were successful, they would take home a cash prize, and if not £1,000 would roll over to the next show. The series was fronted by news presenter Dermot Murnaghan, before Radio 2 DJ and Channel 5 talk show host Jeremy Vine took over the role."
    },
    {
        "title": "Gene Hackman obituary: From Lex Luthor to Royal Tenenbaum, a reluctant celebrity who could turn his hand to any role",
        "description": "To many, he will always be Superman supervillain Lex Luthor, but with a career spanning six decades, Gene Hackman's acting CV was as varied as it was long.",
        "url": "https://news.sky.com/story/gene-hackman-obituary-from-lex-luthor-to-royal-tenenbaum-a-reluctant-celebrity-who-could-turn-his-hand-to-any-role-13318024",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gene-hackman-christopher-reeve_6841113.jpg?20250227111840",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-02-27 11:14:00",
        "Headline": "Gene Hackman played villains, heroes and antiheroes across action, comedy and drama. Despite worldwide recognition, the reluctant star, who has died aged 95, had no time for fame, insisting his own movies gave him an \"icky feeling\".",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n To many, he will always be Superman supervillain Lex Luthor, but with a career spanning six decades, Gene Hackman's acting CV was as varied as it was long. A former Marine, his work on the screen began with an uncredited TV role in 1961. He would go on to become a Hollywood star - despite his disdain for all things showbiz - playing villains, heroes and antiheroes in more than 80 movies spanning all genres, as well as small screen roles and performances on Broadway. His most memorable performances include New York City detective Jimmy \"Popeye\" Doyle in The French Connection and surveillance expert Harry Caul in Francis Ford Coppola's The Conversation. Decorated with multiple Oscars, BAFTAs and Golden Globes across his career, he would step away from acting in 2004, pivoting to novel writing, a pursuit he said better suited his solitary nature.  Born Eugene Allen Hackman in California in 1930, his parents divorced when he was 13, leaving him to be largely bought up by his British-born grandmother Beatrice Gray in Illinois. Leaving home at 16 to enlist in the Marine Corps, he served as a field radio operator and then as a broadcast journalist from 1947 to 1952, working in post-war China and Japan. During his service, his dislike for authority saw him demoted from corporal three times. Hackman would go on to study journalism and television production at the University of Illinois but later decided to pursue an acting career. Read more: Follow latest: Actor and wife were dead for some timeIn pictures: Hollywood legend on silver screen Breakout role Joining the Pasadena Playhouse in 1956, he would meet fellow jobbing actor Dustin Hoffman, with the pair sharing a flat before both found worldwide fame. He would also study with fellow future Hollywood star Robert Duvall. After TV bit-parts and stage work, Hackman's breakout role came in 1967 in Bonnie And Clyde, which saw him receive his first Oscar nomination. His first Oscar win came in 1972 for his role as detective Jimmy \"Popeye\" Doyle in The French Connection, following it with a second 20 years later for his performance in Clint Eastwood's Western Unforgiven. Already well respected in the acting industry, he would earn household fame after he was cast as supervillain Lex Luthor in 1978, the ultimate nemesis to Christopher Reeve's Superman. It was a role he would reprise in the film's subsequent sequels, 1980's Superman II and 1987's Superman IV: The Quest For Peace. An immense body of work Part of so many movies now regarded as classics, other films he starred in over the decades include The Poseidon Adventure, A Bridge Too Far, Under Fire, Mississippi Burning, Crimson Tide, Get Shorty, The Royal Tenenbaums and Runaway Jury. With his comedy chops as impressive as his dramatic skills, he also gave a memorable cameo as the blind man in Mel Brooks' 1974 horror spoof Young Frankenstein. While never considering himself a true star, Hackman acted opposite Hollywood heavyweights including Al Pacino, Gene Wilder, Oliver Reed, Warren Beatty, Faye Dunaway and Diane Keaton. Hackman had three children with his first wife, Faye Maltese, to whom he was married for 30 years, until their divorce in 1986. He married classical pianist Betsy Arakawa in 1991. Largely retiring from public life since the early 2000s, he had moved from buzzy LA to Santa Fe in New Mexico in 2004 and was rarely seen on the Hollywood social circuit. 'I'll get this icky feeling' Hackman, a reluctant celebrity, made no secret of his disdain for the business side of show business and was self-effacing about his achievements. He once told Time magazine if he ever caught his films on TV: \"I'll watch maybe five minutes of it, and I'll get this icky feeling, and I turn the channel.\" Writing at his hilltop ranch overlooking the Colorado Rockies, Hackman published three historical novels, written alongside his friend and underwater archaeologist Daniel Lenihan. Speaking about his passion for novel writing in his later years, Hackman told Reuters in 2008: \"I like the loneliness of it… It's similar in some ways to acting, but it's more private and I feel like I have more control over what I'm trying to say and do.\" He added: \"There's always a compromise in acting and in film, you work with so many people and everyone has an opinion. … I don't know that I like it better than acting, it's just different. I find it relaxing and comforting.\" 'I've fulfilled a lot of my dreams' Hackman's final film role was in the 2004 political satire Welcome To Mooseport, opposite comedian Ray Romano. He also voiced two Marine documentaries in 2016 and 2017. In 2003, when awarded the prestigious Cecil B Demille award at the Golden Globes, Hackman said of his acting career: \"It's all I ever wanted to do. \"So few people ever get what they really want in life. You give up a lot in terms of family, you are always in North Africa or someplace, but it is a make-believe world and it is what I wanted to do as a child.. I fulfilled a lot of my dreams.\" He leaves behind his three children from his first marriage, Christopher Allen, Elizabeth Jean, and Leslie Anne Hackman."
    },
    {
        "title": "In pictures: Hollywood legend Gene Hackman on the silver screen",
        "description": "Hollywood legend Gene Hackman, his wife and their dog have been found dead at their home in Santa Fe, New Mexico.",
        "url": "https://news.sky.com/story/in-pictures-hollywood-legend-gene-hackman-on-the-silver-screen-13317910",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gene-hackman-the-quick-and-the-dead_6841162.jpg?20250227112312",
        "type": "Entertainment",
        "Author": "Jenness Mitchell, news reporter",
        "Date Published": "2025-02-27 09:03:00",
        "Headline": "Gene Hackman has won a number of gongs throughout his career, including two Academy Awards, two BAFTA Awards, four Golden Globes, and one Screen Actors Guild Award.",
        "Content": "By Jenness Mitchell, news reporter   Hollywood legend Gene Hackman, his wife and their dog have been found dead at their home in Santa Fe, New Mexico. In a career spanning more than six decades, the much-loved actor won a number of gongs - including two Academy Awards, two BAFTA Awards, four Golden Globes, and one Screen Actors Guild Award. Here are some of his best-known roles: The French Connection Hackman, 95, won a best actor Oscar for his performance as Detective Jimmy \"Popeye\" Doyle in The French Connection. The 1971 action thriller, directed by William Friedkin (The Exorcist), follows two dogged New York Police Department detectives as they aim to take down a French heroin smuggler. The Poseidon Adventure Hackman played Reverend Frank Scott in the 1972 disaster film. The movie follows a group of passengers who find themselves fighting for survival after a rogue wave capsizes aging ocean liner SS Poseidon during its final voyage from New York to Athens before being scrapped. The ensemble cast featured five Oscar winners, including Hackman, Ernest Borgnine, Jack Albertson, Shelley Winters and Red Buttons. Superman Hackman stole the show as villainous Lex Luthor opposite Christopher Reeve in the 1978 movie Superman. His performance earned him a best supporting actor BAFTA nomination. Hackman portrayed the Man of Steel's arch nemesis two more times, in 1980 (Superman II) and 1987 (Superman IV: The Quest for Peace). Mississippi Burning Mississippi Burning is set in 1964 and revolves around the disappearance of three civil rights workers - loosely based on a real-life murder investigation. The 1988 crime thriller follows two FBI agents as they are met with hostility by the fictional town's residents, local police and the Ku Klux Klan. Hackman earned a best actor Oscar nomination for his performance as FBI agent Rupert Anderson. Unforgiven Unforgiven was a smash hit at the box office in 1992. Hackman picked up the best supporting actor Oscar for his performance as Sheriff \"Little\" Bill Daggett. Clint Eastwood's western won an additional three Academy Awards, including best picture, best director and best film editing. The movie, also starring Morgan Freeman, follows aging outlaw and killer William \"Bill\" Munny (Eastwood) who takes on one more job to avenge an injustice. Read more:Oscar-winning actor and wife found dead at home with their dog The Firm John Grisham's legal thriller The Firm was given the silver screen treatment in 1993 with Hackman going toe-to-toe against Tom Cruise. The movie follows promising Harvard Law graduate Mitch McDeere (Cruise) who joins a prestigious law firm only to discover that it has a sinister dark side. Unlike in Grisham's novel, Hackman's role of Avery Tolar is more of a reluctant villain than downright baddie. The Quick And The Dead Unlike Unforgiven, western The Quick And The Dead failed to dominate the box office and received mixed reviews from critics. Directed by Sam Raimi (Evil Dead, Spider-Man), the 1995 action film revolves around a female gunfighter who returns to a frontier town to take part in a shooting tournament to avenge her father's death. Hackman, playing ruthless outlaw-turned-mayor John Herod, is joined by Sharon Stone, Russell Crowe and Leonardo DiCaprio. Crimson Tide Directed by Tony Scott, Denzel Washington clashes with Hackman in this 1995 submarine action thriller. The movie - which parallels a real-life incident during the Cuban Missile Crisis - takes place on a US nuclear missile submarine and sees a young officer (Washington) staging a mutiny to prevent his trigger-happy captain (Hackman) from launching the boat's weapons before confirming his orders to do so. The movie earned composer Hans Zimmer a Grammy Award for the main theme. Absolute Power Eastwood once again takes on Hackman in 1997 political thriller Absolute Power. Eastwood, also behind the camera, plays a master jewel thief who witnesses the death of a woman involving the crooked president of the United States (Hackman). The cat-and-mouse thriller, based on David Baldacci's novel, also stars Ed Harris, Laura Linney, Scott Glenn and Judy Davis. Runaway Jury Based on Grisham's 1996 novel of the same name, Runaway Jury pits Hackman against long-time friend Dustin Hoffman. The 2003 movie sees Hackman portray shady jury consultant Rankin Fitch, with Hoffman playing rival attorney Wendell Rohr in the trial against a gun manufacturer. In the legal thriller, Hackman's character meets his match in a couple played by John Cusack and Rachel Weisz, who appear to be able to sway the jury to deliver any verdict they want. The Royal Tenenbaums The Royal Tenenbaums boasts a stacked cast that includes Hackman, Owen and Luke Wilson, Anjelica Huston, Bill Murray, Gwyneth Paltrow, Danny Glover and Ben Stiller. The 2001 Wes Anderson comedy-drama follows the lives of three gifted siblings who experience great success in youth, and even greater disappointment and failure in adulthood. Hackman won a Golden Globe for his performance as eccentric father Royal Tenenbaum."
    },
    {
        "title": "Peppa Pig due to get another sibling as Mummy Pig announces pregnancy",
        "description": "Peppa Pig is due to have another sibling soon as Mummy Pig is pregnant for the third time, it's been announced.",
        "url": "https://news.sky.com/story/peppa-pig-due-to-get-another-sibling-as-mummy-pig-announces-pregnancy-13317981",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-peppa-pig-cartoon-childrens-tv_6841291.jpg?20250227113939",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-27 10:28:00",
        "Headline": "Mummy Pig says she is a \"little overwhelmed\" at the thought of having three children under five \"but mostly just completely delighted\". She also reveals a name for her baby is yet to be decided on.",
        "Content": "Peppa Pig is due to have another sibling soon as Mummy Pig is pregnant for the third time, it's been announced. The animated hit show will soon be having another character on the set as Mummy Pig said she was \"completely delighted\" about having another baby. For more than two decades, the show has been tracing the story of Peppa Pig, who is aged four and lives with Daddy Pig, Mummy Pig and her little two-year-old brother George. The voice of the character of Mummy Pig told ITV's Good Morning Britain: \"I'm excited to share that our family is getting even bigger because we're having another baby. \"I'm due in the summer, and we're all so excited.\" Viewers can expect to see the new baby, whose sex is either still unknown or hasn't been revealed, on screen in the autumn. Read more from Sky News:Platinum-selling boyband reunite ahead of UK tourNorth Korea 'sending more troops' to Russia to fight Ukraine \n                  Deaths of Gene Hackman and wife 'suspicious enough' to require 'investigation' - police warrant\n                 \n                  Princess Eugenie posts tribute to 'special friend' Michelle Trachtenberg\n                 \n                  Gene Hackman death latest: Deaths of actor and wife 'suspicious enough' to require 'investigation' - police warrant\n                 Mummy Pig said she was a \"little overwhelmed at the thought of having three children under five running around, but mostly just completely delighted\". She added a name is yet to be decided on. The arrival of a new character was teased on social media with a video of Mummy Pig, who is played by actress and comedian Morwenna Banks, recalling what it was like to have a baby. Peppa Pig first aired in 2004 on Channel 5 Milkshake and Nick Jr, and is now available in more than 180 territories, along with being broadcast in over 40 languages. Co-created by Neville Astley and Mark Baker, from animation studio Astley Baker Davies, the series has inspired theme parks in the UK and elsewhere as well as being featured on collectable Royal Mail stamps. Mummy Pig's pregnancy announcement on the show will be during the final episode of the current series of Peppa Pig, which will air on 30 March, coinciding with Mother's Day. When asked if she had shared the news with their other children, she said: \"Yes, we weren't able to keep it a secret for long. \"Peppa knew something was going on, and she's such a curious thing, we had to tell her before she popped. \"They've had the occasional wobble and worry, but they're mostly so excited. \"Every day they ask me how big the baby is. When is it coming? Does it like dinosaurs and muddy puddles? It never stops.\""
    },
    {
        "title": "Five: Nineties boyband reunite and will tour the UK",
        "description": "Nineties boyband Five are reuniting and will be touring the UK later this year.",
        "url": "https://news.sky.com/story/five-nineties-boyband-reunite-and-will-tour-the-uk-13317902",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-five-boyband-abs-love_6841120.jpg?20250227084812",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-02-27 08:37:00",
        "Headline": "Abz Love, J Brown, Ritchie Neville, Scott Robinson and Sean Conlon are hitting the road as Five reunite, and will tour the UK this autumn.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Nineties boyband Five are reuniting and will be touring the UK later this year. The group - made up of Abz Love, J Brown, Ritchie Neville, Scott Robinson and Sean Conlon - haven't performed together for a quarter of a century. In their heyday, the platinum-selling band topped charts across the globe and sold more than 20 million records worldwide. Their 12-date UK arena tour, Keep On Movin' 2025, will begin in Brighton at the end of October, before travelling to Bournemouth, Cardiff, Nottingham, Liverpool, Manchester, Leeds, Birmingham, Newcastle, Aberdeen, Glasgow, and London where they will perform at The O2. They will perform some of their biggest hits, including If Ya Gettin' Down, Everybody Get Up and international success When The Lights Go Out. Fans will also be treated to some of their past number ones, with Keep On Movin', We Will Rock You, and Let's Dance also on the playlist. Speaking ahead of the tour, band member Robinson said: \"This has been a long time coming and it really does feel right for all of us now - 25 years on, and we're so ready for it. Reconnecting as a 5 over the last year has been special and I know I speak for all the boys when I say we can't wait to do this all over again. Hope you're ready!!\" \n                  Deaths of Gene Hackman and wife 'suspicious enough' to require 'investigation' - police warrant\n                 \n                  Princess Eugenie posts tribute to 'special friend' Michelle Trachtenberg\n                 \n                  Gene Hackman death latest: Deaths of actor and wife 'suspicious enough' to require 'investigation' - police warrant\n                 Abz Love added: \"We really can't wait to get back on stage together & see the fans, it's gonna go OFF! Buzzing to have Naughty Boy on tour with us too… 5 bad boys and a naughty boy, that sounds like a lot of fun. Let's gooooo!\" Formed in 1997, Five is the only UK act to hit the Top 10 with all of their 11 singles, including three number ones. Their first and second albums both went double platinum. Their tour announcement comes 25 years after the band won their first BRIT Award for best British pop act in 2000. Tickets go on general sale on 7 March, with a pre-sale from 5 March."
    }
]