[
    {
        "title": "Beth Rigby: Why PM's China trip carries real consequence - including for you at home",
        "description": "Sir Keir Starmer's January has been the stuff of nightmares.",
        "url": "https://news.sky.com/story/why-sir-keir-starmers-reset-moment-with-china-carries-consequence-13499749",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer-xi-jinping_7060651.jpg?20260128010326",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2026-01-27 18:25:00",
        "Headline": "Sir Keir Starmer will have to walk a tightrope during his trip to China, as he tries to drive investment from Beijing, while avoiding upsetting US President Donald Trump.",
        "Content": "\n          Political editor\n              @BethRigby\n Sir Keir Starmer's January has been the stuff of nightmares. It kicked off with the crisis over Greenland and rift with Donald Trump - and was followed by a dose of psychodrama over the Labour leadership courtesy of Andy Burnham and that unwanted by-election. This week will be another high-stakes one for the prime minister as he heads to China to look for deeper trade ties against the backdrop of a volatile US and domestic resistance to Beijing at home. \"Like it or not, China matters for the UK,\" he declared ahead of the trip. \"As one of the world's biggest economic players, a strategic and consistent relationship with them is firmly in our national interest. \"That does not mean turning a blind eye to the challenges they pose - but engaging even where we disagree.\" Read more from Sky News:What's on the table in PM-Xi talks? This visit has been a year in planning and will be a big symbolic moment, if rather ill-timed, given the troubles he's facing in his own backyard. Starmer will be the first UK prime minister to visit China since Theresa May in 2018. His goal is to try to drum up trade with the world's second-biggest economy. He hopes this will help spur the economy and help Labour make an impact on the cost of living - now his number one priority for government. His challenge is to navigate that while not triggering Trump. Just days ago, the US president threatened a 100% tariff on Canada if PM Mark Carney did a trade deal with Beijing. He will also have to face down criticism at home as the political consensus hardens against China due to concerns over national security threats and human rights. It's been over a decade since David Cameron hailed a \"golden era\" of close economic relations with China, as the UK hosted President Xi Jinping on a state visit. From golden age to ice age Since that period, relations between the two nations cooled amid concerns over national security and Chinese espionage, China's alliance with Russia, human rights abuses of the Uyghur population, and the crackdown on democracy in Hong Kong. The controversy around the government's approval of a Chinese mega-embassy last week - after years of delay - is a reflection of the deep unease many feel about an expanding Chinese footprint in the UK. It has not been well received by Washington, which believes the embassy will allow for widespread spying, and was opposed by a number of MPs across the House. Read more from Sky News:Everything we know about new Chinese embassy That is why this reset moment, spearheaded by Starmer, carries consequence. He must navigate both those economic opportunities while managing critical matters of national security and an increasingly fractious geopolitical backdrop. In an interview with Bloomberg on the eve of his trip, the prime minister said he wanted to take a \"more consistent\" approach to China rather than \"veering from a Golden Age to an Ice Age\" as he insisted the UK did not have to compromise on national security to pursue business interests (those opposed to the mega-embassy disagree). On the economic opportunities, the prize is clear: the UK wants to do more trade with the world's second-biggest economy, and the PM will be taking a delegation of 60 business and cultural leaders with him to that end. What does Starmer want from China? China is already the UK's third-largest trading partner and supports 370,000 jobs. Starmer wants to do more. In the global context, the reset with China will, of course, carry risk with Trump, but the recent actions and behaviour of the US president, who sparked a national outpouring of anger after denigrating British servicemen who lost their lives fighting alongside US troops in Afghanistan, can only help the UK's case when it comes to China. Be it Trump's ambivalence over NATO, aggression towards Greenland, threats of tariffs or hostility to the UK and European allies, the US has turned from the cornerstone of the post-war order to an unreliable ally. In an increasingly tense space between two global powers, middle powers like the UK can no longer seek sanctuary under the umbrella of the US and need to navigate a more complex path: in recent months, the leaders of the EU, France's Macron and Germany's Merz have all beaten a path to Xi's door. For the PM's part, he insists the UK can maintain its relationship with its closest ally, the US, while pursuing trade opportunities with China, without being forced to choose between the two. \"I'm often invited to simply choose between countries. I don't do that,\" he told Bloomberg. \"We've got very close relations with the US, of course we want to, and we will maintain that business, alongside security and defence.\" For China's part, it wants better access to UK markets, be that in investments or exports. It will also want to depoliticise a relationship that has in recent years been dominated by questions of security threats and the status of Hong Kong. In a sign of the growing warmth between London and Beijing, officials said Starmer would work with China on illegal migration and more financial co-operation. Starmer is sometimes in private rather prickly about the tag \"never here Keir\", and tells colleagues that these international trips are all about, and only about, delivering for the public - be it on trying to deal with illegal migration with the Germans or the French, or trying to put more money in the pockets of working people through seeing off the worst of Trump's tariffs, or trying to drum up business. Dealing with China will, of course, come with controversy and risks, leaving the impression that the prime minister cares more about globe-trotting than the domestic grind. Even as he prepares to fly to Beijing, the government this week is trying to highlight freezing prescription charges, announcing plans to cap ground rents - delivering on a manifesto pledge while also trying to placate MPs - and an £80m support package for pubs after the business rates backlash. Can PM turn things around? It's been hard for Starmer to make much progress on the cost of living message in between the drama of Trump and then Burnham, but government insiders tell me that, at last, polling is beginning to improve for Labour with people that are feeling the benefits of some of their cost of living initiatives, be it breakfast clubs, free childcare or their decision to lift the two-child benefit cap. For a prime minister acutely aware of his domestic fragility, with the public and his party, a five-day trip to China right now will do little to steady the nerves. There are many in the party mutinous over Starmer's decision to block Burnham from standing in the Gorton and Denton by-election. The prime minister is not in a good place to try to lead from the front and charm in the tearooms when he is 5,000 miles away. But as he struggles with the politics, he is pressing on with trying to secure some delivery on the pledges he made when he won the election. His calculation is that more business with the world's second-biggest economy will help him do that - and could ultimately give him some much-needed help back home."
    },
    {
        "title": "Hundreds of jobs lost as Revolution bars owner enters administration",
        "description": "Nearly 600 jobs have been lost after the owner of Revolution bars went into administration.",
        "url": "https://news.sky.com/story/almost-600-jobs-lost-but-many-saved-as-revolution-owner-enters-administration-13499580",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-revolution-pub_7147223.jpg?20260127120433",
        "type": "Home",
        "Author": "James Sillars",
        "Date Published": "2026-01-27 11:32:00",
        "Headline": "The announcement was made just before the chancellor was due to confirm a partial U-turn on costly business rates changes for the pub industry.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Nearly 600 jobs have been lost after the owner of Revolution bars went into administration. The Revel Collective, which revealed on Monday that it had filed notice of an intention to appoint administrators, said it had since formally appointed FTI Consulting. Venues closing with immediate effect include 14 Revolution bars, six Revolucion de Cuba bars and one Peach Pub - with the loss of 591 jobs. However, FTI confirmed a pair of deals which will secure the future of 41 sites and 1,582 jobs. Money latest: BBC to use iPlayer to catch licence fee evaders The locations of the Revolution sites closing are: Manchester (Oxford Road), Huddersfield, Leicester, Glasgow (Renfield Street), Cardiff, Nottingham, Leeds, Sheffield, Ipswich, Manchester (Parsonage Gardens), Plymouth, Durham, Exeter and Preston. The Revolucion de Cuba sites affected are: Cardiff, Derby, Liverpool, Reading, Harrogate and Aberdeen while the Peach premises to be shut was The Almanack at Kenilworth in Warwickshire. \n                  Pubs and music venues to be handed business rates relief after government U-turn\n                 \n                  Freedom Fibre and Truespeed close to finalising altnet merger\n                 \n                  Energy price cap facing upwards pressure from US storm\n                 The announcement was made shortly before the chancellor was expected to reveal a partial U-turn on business rates changes facing pubs. The industry said they were expected to add almost £13,000 in costs over three years to the average pub in advance of the climbdown. It has battled rising costs for many years, with new minimum pay levels and heightened national insurance contributions adding to the burden last spring. Revel undertook a major restructuring in 2024, shutting 15 unprofitable bars in a bid to turn around its performance. But the revamp fell flat and a strategic review resulted in the group being placed up for sale. Revel had partly blamed weak trading, with younger customers having little disposable income. Higher costs also weighed on its bottom line and growing debt pile."
    },
    {
        "title": "PM's future is at stake in pivotal by-election of his own making",
        "description": "Sir Keir Starmer has created, from nowhere, a pivotal by-election by his own hand. ",
        "url": "https://news.sky.com/story/pms-future-is-at-stake-in-pivotal-by-election-of-his-own-making-13499842",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-sir-keir-starmer-andy-burnham_7146288.jpg?20260126132937",
        "type": "Home",
        "Author": "Sam Coates",
        "Date Published": "2026-01-27 22:22:00",
        "Headline": "Labour are under pressure from their left via the Greens and their right via Reform. It conjures up the possibility the party could even come third in a seat they've held since before the Second World War, after Andy Burnham was blocked from standing.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Sir Keir Starmer has created, from nowhere, a pivotal by-election by his own hand.  He owns the outcome, because of his decision to block Andy Burnham - someone voters on the streets of Denton and Gorton thought by far to be the strongest candidate. And nobody can anticipate the result, which Labour MPs think could trigger a coup against the prime minister should Labour come third. Read more:PM defends Burnham blockReform and Greens eye major by-election scalp The east Manchester seat, with a 13,000 majority, has been Labour since before the Second World War, once regarded as an irredeemably poor, post-industrial area that was home to railway workers. While some parts remain poor, others are the beneficiary of the economic improvement of Greater Manchester as a whole, as well as an area that has seen the upside of Emirati millions around the adjacent Manchester City stadium. And as such, it is a melting pot of many differing communities, once united by Labour politics. On 26 February, we will see if this remains the case. Pressure from left and right The constituency, northeast of the city, is shaped like a hammer, according to Rob Ford, the Manchester University political scientist. The handle of the hammer, in the south of the seat, has several wards that are very ethnically diverse, large Muslim populations, but also large populations of students and young graduates. \"That looks like exactly the kind of territory where Labour has been losing support to the Greens in national polling recently,\" said Ford. Towards the head of the hammer, which is Gorton, and the wards in Tameside, it's much whiter, 90% white, and much more working class, with fewer graduates. \"That looks like the kind of terrain where Labour has been losing ground to Reform recently,\" Ford said. Labour MPs up to Andrew Gwynne, who stepped down on Thursday, were sufficiently able to unite both parts of the community to ensure the seat was perpetually Labour. But with politics fracturing, populism rising, could a new approach work? Professor Ford said: \"You've got very different, highly charged local issues in the two halves of the seat. In the Manchester part, the more Muslim and at young professional part, there'll be a lot of campaigning on Gaza, particularly with the Workers Party picking up a high-profile candidate in the Gorton part. \"You may see a lot of quite polarising identity politics from Reform UK, potentially on issues like crime, grooming, gangs, immigration and so forth.\" All of which point to a campaign led by Reform slugging it out with the Greens, and none of that looks like the campaign Starmer's Labour would run. As the leader of Manchester City Council, the choice of many Labour MPs, also ducks this race, it is less clear given the national political backdrop how the party can hang on. Joshi Herman, founder of the Manchester Mill, a journalism website with deep links in the community, said: \"I think if Andy Burnham had been the Labour candidate, they would have been strong favourites to win here.\" While not guaranteed due to the national polling picture, he says Burnham is a \"very popular mayor, and he goes down well in places like this\". A test for Polanski But can the Greens, the face of the populist left, inhabit a space that even Burnham voters might be attracted to? At a rally on Tuesday night, Zack Polanski called this the \"blockbuster\" by-election of this parliament - as he commenced his first electoral test as leader. Translating membership numbers and polling figures into a real result would be a massive coup for the Green leader, who is pitching to be the heir to Jeremy Corbyn's shade of Labour Party. He had three times the number of supporters as the lunchtime unveiling of Reform UK's candidate. But can the Greens show they are a party of the north as well as the southern middle class? Meanwhile, Reform unveiled academic and TV pundit Matt Goodwin as their candidate. They mentioned but did not dwell on more contentious, populist campaign techniques like grooming gangs in their news conference, instead preaching to voters who think Britain is broken and only their brand of radicalism can fix it. But the big question is just how hard Labour will try to win, given the prime minister's own future is at stake. They could throw everything at it - Angela Rayner is a neighbour, along with Lisa Nandy and chief whip Jonathan Reynolds. Starmer himself could go. Do they put in the money, and force the visits, that they did in Batley and Spen, the last time the Labour leader's future was on the line in a by-election? Or do they quietly let this one slip, knowing it's a diversion and a costly lost cause, whatever the consequence? All this is at stake on 26 February. It is clear that what matters will be how this by-election is fought, not just who wins on the night."
    },
    {
        "title": "Warrington hospital's home birth service played 'Russian roulette' with lives, grieving father says",
        "description": "A father whose newborn baby died after an \"avoidable\" delay in her delivery has accused a hospital trust's home birth service of playing \"Russian roulette\" with the lives of mothers and babies.",
        "url": "https://news.sky.com/story/warrington-hospitals-home-birth-service-played-russian-roulette-with-lives-grieving-father-says-13499657",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-victoria-thomas-gillibrand_7147718.jpg?20260127200334",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-27 15:24:00",
        "Headline": "Thomas and Victoria Gillibrand's baby, Pippa, who died from a severe brain injury \"sustained due to an avoidable delay in her delivery\", may have lived if staff had brought the mother into the hospital earlier, a coroner has said.",
        "Content": "A father whose newborn baby died after an \"avoidable\" delay in her delivery has accused a hospital trust's home birth service of playing \"Russian roulette\" with the lives of mothers and babies. Warning - this story includes descriptions of a newborn child's suffering and death Thomas and Victoria Gillibrand's baby, Pippa, suffered a severe brain injury and died at just 12 days old, Cheshire Coroner's court heard. Ms Gillibrand, 33, had planned to give birth at her home in Warrington, but when she went into labour on 25 August 2024, the home birth team from Warrington and Halton Hospitals NHS Foundation Trust was dealing with another labour. Storm Chandra latest - major disruption There were \"missed opportunities\" for the trust to abandon the home birth plan and tell Mrs Gillibrand to come into hospital, coroner Victoria Davies said as she delivered her findings. Speaking outside the court in Warrington on Tuesday, Mr Gillibrand, 34, said: \"The trust seems to have played Russian roulette with the innocent lives of mothers and babies. \"Tragically, we are the family that took the bullet on that. Our feelings are that Pippa's death was clearly preventable and it shouldn't have taken a child's death for changes to be implemented.\" Mrs Gillibrand, who carried a small toy bought for Pippa with her, added: \"Services have been underfunded and stretched for such a long time, that we're now in a position that we've lost our daughter because of the cuts and the services that are currently in situ, and things need to change.\" Mr Gillibrand called Warrington Hospital at about 5.30am on the Sunday of the August bank holiday weekend to tell them his wife was in labour, the inquest heard. Ms Davies said that, given staffing issues over the weekend, including that the home birth team were already at another birth, \"Pippa's mother should have been advised to attend hospital rather than continue as a home birth\". A second opportunity to change course came when Mr Gillibrand rang after his wife's waters broke at about 7am. Eventually, a midwife arrived at the couple's home, about 15-20 minutes' drive from the hospital, at about 8.15am, the inquest heard. After 9am, Pippa's heart rate should have been monitored every five minutes but midwives were coping with \"competing pressures\", including short staffing and laptops which were not working. A decision to take Mrs Gillibrand to hospital should have been made after 9.36am, when difficulties in monitoring Pippa's heart rate became clear, the coroner said. \"Had Pippa been delivered earlier, on the balance of probabilities she would not have died when she did.\" Read more on birth trauma:Your birth stories - the viewers and readers who contacted Sky NewsIgnored, bad behaviour and long-term trauma: What you told us Mrs Gillibrand was transferred to hospital by ambulance after a decision was made at 10am and Pippa was delivered by forceps. She was transferred to the neonatal unit and later moved to Liverpool Women's Hospital but died on 5 September after scans showed she had suffered a \"severe irreversible brain injury\" due to a lack of oxygen. Recording a narrative conclusion, Ms Davies said: \"Pippa Gillibrand died as a result of a brain injury sustained due to an avoidable delay in her delivery.\" She said the Warrington hospital trust had since changed its home birth service. Rebecca Cahill, from JMW solicitors, who represented the family, said the situation \"made the homebirth service manifestly unsafe, and the service should have been suspended when Vicky made initial contact\". Read more on Sky News:Pubs to be bailed outStar 'didn't expect to see Christmas' She said the family \"were failed from the start\". Ali Kennah, chief nurse at Warrington and Halton Teaching Hospitals, said: \"We remain truly sorry for the failures in the care that Mrs Gillibrand and Pippa received, and we fully accept the coroner's findings. \"Since this tragedy occurred, we have strengthened our home birth service and have fully implemented all recommendations from an independent review. We will continue to make sure that all lessons are learned. \"We would again like to extend our deepest condolences to Mr and Mrs Gillibrand for their heartbreaking loss.\" The trust was not immediately available for comment regarding the most recent accusations."
    },
    {
        "title": "'Talk to me, Goose': Starmer teases Macron with Top Gun mock up",
        "description": "British Prime Minister Keir Starmer has poked fun at his French counterpart - by putting on a pair of sunglasses at an event before saying, \"bonjour\".&#160;",
        "url": "https://news.sky.com/story/talk-to-me-goose-starmer-teases-macron-with-top-gun-mock-up-13499830",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-sir-keir-starmer-emmanuel-macron_7147769.jpg?20260127211039",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-27 22:09:00",
        "Headline": "The joke was a reference to President Emmanuel Macron's now viral wearing of Top Gun-style aviator sunglasses in Davos last week.",
        "Content": "British Prime Minister Keir Starmer has poked fun at his French counterpart - by putting on a pair of sunglasses at an event before saying, \"bonjour\".  The joke was a reference to President Emmanuel Macron's now viral wearing of Top Gun-style aviator sunglasses at the World Economic Forum in Davos last week. The prime minister then uploaded a video of the joke to his TikTok account, tagging Mr Macron and captioning the post, \"talk to me, Goose,\" a famous quote from the film Top Gun. The French president replied within minutes, writing \"for sure\". That was a reference to a widely shared clip of his Davos speech where he uttered the phrase, for sure, multiple times. Sir Keir Starmer then took the joke one step further by replying to Mr Macron's comment with a mock-up of the two leaders standing side by side in a Top Gun image. The sunglasses quip was made by Mr Starmer at a recording of Matt Forde's Political Party Live podcast at London's Duchess Theatre - receiving a big laugh from the crowd. \n                  Is a new world 'without rules' emerging? What global leaders have said\n                 \n                  Trump offers ominous message on Greenland ahead of crunch talks with European leaders\n                 \n                  Trump restates desire to take over Greenland, as poll finds most Americans are against it\n                 Mr Macron originally donned the shades at Davos to hide a benign medical issue with his right eye, according to the French president. He wasn't the only president to comment on the fashion choice. \"Those beautiful sunglasses,\" Trump said in his Davos address. \"What the hell happened?\" The French president's office said the shades were made by a French firm, Henry Jullien. At €659 (£573) the Pacific S 01 model sunglasses aren't cheap. But that didn't stop a surge in demand, leaving the manufacturer struggling to keep up. The firm had to create a dedicated page which read: \"Our eShop website is experiencing an exceptional volume of visits and enquiries.\" Shares of its Italian parent company, iVision Tech SpA, soared on Milan's stock exchange - from €1.51 (£1.31) a share when Macron spoke Tuesday, to a high on Friday of €2.63 (£2.29). Read more from Sky News:Why Starmer's reset moment with China 'carries consequence'Coco Gauff condemns tennis's lack of privacy \"Crazy week,\" Stefano Fulchir, iVision's CEO, told AP. \"Very honoured and happy that President Macron has used our eyewear in this important event.\" Cristina Archetti, author of Politicians, Personal Image and The Construction of Political Identity, went as far as saying that \"he [Macron] does look hot\". She added that 48-year-old Macron looked \"relatively young and super cool\"."
    },
    {
        "title": "Rabbi Pinchas Goldschmidt says Europe must do 'much more' to support revolution in Iran",
        "description": "Europe's most prominent rabbi has told Sky News he holds Iran responsible for the rise of antisemitism in recent years and believes European countries must do much more to support Iranian protesters in overthrowing the Tehran regime.",
        "url": "https://news.sky.com/story/rabbi-pinchas-goldschmidt-says-europe-must-do-much-more-to-support-revolution-in-iran-13499645",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-pinchas-goldschmidt_7147450.png?20260127151337",
        "type": "Home",
        "Author": "Adam Parsons",
        "Date Published": "2026-01-27 14:51:00",
        "Headline": "The rabbi says Ayatollah Ali Khamenei is at the centre of a web that seeks to undermine, damage and ultimately destroy both Israel and Jewish people.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n Europe's most prominent rabbi has told Sky News he holds Iran responsible for the rise of antisemitism in recent years and believes European countries must do much more to support Iranian protesters in overthrowing the Tehran regime. Speaking on Holocaust Memorial Day, Pinchas Goldschmidt, president of the Conference of European Rabbis, said anger against Jews had grown to dangerous levels, regardless of their views on politics, religion or the war in Gaza. He said there was the prospect of \"antisemitic acts against Jews who live anywhere in the world, who have nothing to do with the Israeli government and nothing to do with Israel\". But he said Jews and Israel would both \"prevail\", telling me: \"Eighty years after the end of the Holocaust, Jews are back as a sovereign nation in Israel, united with the Jews who live all over the world.\" We spoke in Jerusalem, meeting in the shadow of the Western Wall. It is a place of pilgrimage for Jews of all countries, which he referred to as the \"source of Jewish identity\". But for many of those Jews, this has been a time marked by a surge in antisemitic acts. The attacks of 7 October 2023, and the relentless Israeli military response that followed, led to a sharp increase in antisemitic hate crimes across Europe, including France and the UK. \n                  Trump wants to 'de-escalate' in Minneapolis - but says ICE victim shouldn't have carried gun\n                 \n                  ICE agents to have role at Winter Olympics - as crackdown's 'public face' to leave Minneapolis\n                 \n                  Homes flooded and cars stranded during Storm Chandra in Ireland\n                 Since the start of the war in Gaza, more than 70,000 Palestinians have been killed due to Israeli military action. \"The criticism of war is legitimate and there is criticism of that in Israel, too,\" Rabbi Goldschmidt told Sky News. \"But when the criticism goes beyond the pale - delegitimising the existence of the state of Israel or allegations that have no basis in fact, that's when you traverse from criticism to antisemitism.\" He blamed \"extremists\" from the \"far right and far left in the United States and Europe\" and claimed that they were receiving support and backing from Iran. \"All these people who went and discredited the Jewish people in Israel over the last two years - I don't see them on the streets regarding Iran. I don't see one voice talking about the 30,000 civilians killed in Iran. Why not?\" Rabbi Goldschmidt, who represents hundreds of orthodox rabbis across Europe, believes the Iranian regime, Ayatollah Ali Khamenei, sits at the centre of a web that seeks to undermine, damage and ultimately destroy both Israel and Jewish people. 'Jews better off in London' On Gaza, he was clear that Israel should not control the Strip, but rather \"it should be administered by a consortium of Arab countries supervised by the United States and other Western powers to provide security, and a viable way of economic support for the Palestinian population in Gaza\". I asked whether he would like to see a two-state solution that would create a Palestinian state separate from Israel. \"Yes, but in the same way that the European Union was impossible as long as Nazi Germany existed, so the two-state solution is impossible as long as Iran is creating failed states and terror hubs all over the Middle East,\" he said. \"That is why Iran needs a successful revolution. And they need Western support. I told my colleagues in Europe: 'You can do much more to support the demonstrators.' \"They can offer asylum. They can offer support for those leading politicians and people in the security forces who switched sides. Much more can be done.\" The rabbi did, however, praise the efforts of British institutions to protect Jewish people, laughing off the idea that they might want to claim asylum in America - an idea apparently floated by the Trump administration. \"I think the Jews are much better off in London,\" he said. \"I think the government in England has done a lot to protect the Jewish community. \"The government is friendly, the King is friendly with the Jewish community. The attack in Manchester was the exception to the rule.\" Read more:Ministers in tears as Holocaust survivor speaksRemains of last Israeli hostage found in Gaza Rabbi Goldschmidt is not considered an extreme voice in the Jewish world, but his voice does resonate widely. He was clear that he thought European nations had tried to tackle antisemitism - his praise for the UK was earnest. So, too, were his claims about the dangers posed by Iran. And he reflects an anxiety in this region. Many in Israel were hoping to see the protesters prevail, and the Ayatollah fall from power. Neither of those has happened."
    },
    {
        "title": "Bereaved mother describes 'harrowing' stillbirth aftercare",
        "description": "Kelsey Parker, widow of late The Wanted singer Tom Parker, has told Sky News she experienced \"harrowing\" care after her son was stillborn.",
        "url": "https://news.sky.com/story/bereaved-mother-describes-harrowing-stillbirth-aftercare-13499742",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-kelsey-parker_7147717.png?20260127200131",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-27 18:04:00",
        "Headline": "Speaking on Sky News' The UK Tonight With Sarah-Jane Mee, Kelsey Parker described the devastation she suffered after going into labour and giving birth at 39 weeks.",
        "Content": "Kelsey Parker, widow of late The Wanted singer Tom Parker, has told Sky News she experienced \"harrowing\" care after her son was stillborn. Ms Parker, 35, announced the loss of her baby Phoenix, who she expected with new partner Will, in June last year. The mother-of-two has now spoken to The UK Tonight With Sarah-Jane Mee, where she described the devastation suffered after going into labour and giving birth at home at 39 weeks. She was then taken to a maternity ward with other new mothers and babies. \"I did not feel kindness and I think the people that had to look after me, their jaws were on the floor,\" she said. \"They didn't know what to do, their hands were tied. \"I think for me, reliving it, I needed that time off. I actually took time off work, which is unheard of for me, because I needed time to process what I went through, and I wouldn't wish what I went through on anyone. \"It was absolutely horrendous, harrowing, awful.\" Sky News has reported extensively on the state of maternity care in the UK, including the stories of three women who suffered traumatic experiences. More than 180 people have written to Sky News to share their birth stories - you can share yours by emailing maternitystories@sky.uk. Read more:What you told us about your maternity experiencesWoman says she 'begged for pain relief but was told no' Royal correspondent After years of warnings, reviews, and mounting pressure, 2026 could be a pivotal moment for maternity services. We've long-known maternity care is in crisis. It is a vital service but one which is under sustained strain. And in some cases, failing mothers and babies with tragic consequences. Multiple national investigations over the last decade have highlighted serious failings. Each report written has made several recommendations, and yet the system still struggles. Fundamental change is long overdue, and it could come with the publication of the Amos review. Baroness Amos is looking into system-wide issues, to understand why problems persist, and what needs to change. But there is already scepticism as to what the review will achieve. Sky News has received hundreds of emails from families sharing their birth traumas. All similar stories, each one harrowing. Many families feel deep mistrust, telling us we've been here before, and lessons haven't been learnt. There's a lot of pressure to get this right, and progress will be judged by positive outcomes not promises. Of the 186 countries the UN collects data for, the UK was one of only 14 where maternal mortality rates were higher in 2020 than they were in 1985. The US and Canada were also in that group, while Cyprus and Finland were the only other European countries. Over that time, the UK has fallen from having the ninth-lowest maternal mortality rate in the world to being 42nd."
    },
    {
        "title": "Sir Idris Elba caught speeding on moped a day after announcing Netflix movie about Charles's charity The King's Trust",
        "description": "Actor and scooter enthusiast Sir Idris Elba has been slapped with a fine for going more than 20mph on his moped.",
        "url": "https://news.sky.com/story/sir-idris-elba-caught-speeding-on-moped-a-day-after-announcing-netflix-movie-about-charless-charity-the-kings-trust-13499668",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/idris-elba-chelsea-moped-skynews_7147453.jpg?20260127152236",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-27 15:55:00",
        "Headline": "Sir Idris, renowned for his love of his mopeds so much it made its way into a Taylor Swift song, was hit with a £147 fine.",
        "Content": "Actor and scooter enthusiast Sir Idris Elba has been slapped with a fine for going more than 20mph on his moped. Speed cameras clocked the actor, 53, making his way across Chelsea Embankment in central London at 10.12am on 21 June last year. Sir Idris is renowned for his love of mopeds - so much it even made its way into a Taylor Swift song. The US singer sampled the actor saying \"We can go driving on my scooter - you know, just riding in London\" on her 2019 song 'London Boy'. Meanwhile film fans will be reminded of Guy Ritchie's 2008 film Rock'n'Rolla - where Sir Idris's character has to evade Russian mobsters on a moped. Sir Idris admitted riding the BMW moped but insisted he had not received a fixed penalty fine from the police and was denied a chance to pay it off before appearing in court. Read more from Sky News:Storm Chandra hits UKWhite House changes tone on ICE crackdown \n                  Idris Elba on the power of football - and how it can help tackle knife crime\n                 \n                  Idris Elba joins Prime Minister Sir Keir Starmer for launch of new anti-knife crime coalition\n                 \n                  The King and Idris Elba discuss youth violence at King's Trust event\n                 He was ultimately forced to pay a £147 fine and received three penalty points at Westminster Magistrates' Court last Thursday. He was also ordered to pay £110 in costs and a £59 victim surcharge. Police presented three images to the court, showing Sir Idris riding a scooter at 28mph in a 20mph zone. The incident happened a day after it was announced the actor is collaborating with the King for a Netflix film about 50 years of Charles's charity The King's Trust. But Sir Idris's lawyers, Patterson Law, which specialises in motoring offences, urged the courts to let him ride off with just a £100 fine instead. \"Mr Elba initially responded to the Notice of Intended Prosecution to nominate himself as the driver and was expecting to receive a fixed penalty offer,\" a letter read to the court said. \"However, the offer never arrived and he therefore never had the opportunity to accept it. \"Had he received it, he absolutely would have accepted it.\" The law firm said the actor had a clean driving licence and was pleading guilty to the offence, sparing the expense of a trial. \"We would ask the court to consider replicating the fixed penalty by imposing no more than a £100 fine, with no award for costs,\" the letter continues. \"He never received the fixed penalty - and this was through no fault of his own. It would therefore not be in the interests of justice to impose further financial penalties for something which was not his fault.\" The prosecution was dealt with in the Single Justice Procedure, meaning Elba was not required to attend."
    },
    {
        "title": "'What do you want from me?' Captain in fatal ship collision asks prosecutor ",
        "description": "A captain has been confronted in a trial over the \"serious and obvious\" risk of death posed when his container ship collided with an anchored US oil tanker.",
        "url": "https://news.sky.com/story/what-do-you-want-from-me-captain-in-fatal-ship-collision-asks-prosecutor160-13499703",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-captain-vladimir-motin_7135510.jpg?20260114211139",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-27 16:25:00",
        "Headline": "Russian national Vladimir Motin, 59, had been on sole watch duty last March when the Solong crashed into the Stena Immaculate near the Humber Estuary.",
        "Content": "A captain has been confronted in a trial over the \"serious and obvious\" risk of death posed when his container ship collided with an anchored US oil tanker. Both were laden with flammable goods. Russian national Vladimir Motin, 59, had been on sole watch duty last March when the Solong crashed into the Stena Immaculate near the Humber Estuary. Crew member Mark Angelo Pernia, 38, who was on the bow of the Solong was killed in the incident. When cross-examined by Tom Little KC about whether it had been foreseeable that the Stena Immaculate could have been carrying flammable goods, Mr Motin said, \"Yeah, OK. I understand, but what you want from me?\" He previously stated he had no knowledge of the contents aboard the tanker before the collision. The US tanker, with a crew of 23, was transporting more than 220,000 barrels of JetA1 high grade aviation fuel from Greece to the UK. \n                  Beth Rigby: Why PM's China trip carries real consequence - including for you at home\n                 \n                  Can the UK reset their relationship with China?\n                 \n                  Storm Chandra latest: Rail line to close causes sinkhole\n                 The Solong, with a 14-strong crew, was carrying mainly alcoholic spirits and some hazardous substances. Motin, 59, was challenged at the Old Bailey on Tuesday over a string of alleged failures. \"You collided with Stena Immaculate at 16 knots, metal-on-metal, creating a spark,\" Mr Little said. The defendant replied: \"Spark will always be created.\" \"I suggest the nature of this collision was foreseeable, that there was a serious and obvious risk of death to someone,\" pressed Mr Little. Mr Motin said he couldn't \"make any assumption, yes or no\". Mr Little went on: \"I suggest had you sounded that alarm in time, Mark Pernia would have been able to get out of the bow and he would have survived.\" The prosecutor rejected the defendant's claim that he \"didn't know\" Mr Pernia was on the bow, pointing out that he had been on duty and had been working in that area. Concluding his cross-examination, he said without the collision, nobody would've died - something Motin agreed with. Read more from Sky News:UK authorities help seize 'narco sub'Pubs and music venues to be handed business rates relief The prosecutor suggested Mr Motin did not keep a proper lookout, did not use all the available means to determine the risk of a collision, did not use the radar equipment, and that he did not leave enough time to prevent the crash or slow down. Motin denied these suggestions. Mr Little then suggested Mr Motin could've easily steered away, avoiding a collision. The defendant said he had made a \"mistake\" when attempting to switch to manual control and didn't realise autopilot was still on. Motin has denied manslaughter, and the Old Bailey trial was adjourned until Wednesday."
    },
    {
        "title": "Beth Rigby: Why PM's China trip carries real consequence - including for you at home",
        "description": "Sir Keir Starmer's January has been the stuff of nightmares.",
        "url": "https://news.sky.com/story/why-sir-keir-starmers-reset-moment-with-china-carries-consequence-13499749",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer-xi-jinping_7060651.jpg?20260128010326",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2026-01-27 18:25:00",
        "Headline": "Sir Keir Starmer will have to walk a tightrope during his trip to China, as he tries to drive investment from Beijing, while avoiding upsetting US President Donald Trump.",
        "Content": "\n          Political editor\n              @BethRigby\n Sir Keir Starmer's January has been the stuff of nightmares. It kicked off with the crisis over Greenland and rift with Donald Trump - and was followed by a dose of psychodrama over the Labour leadership courtesy of Andy Burnham and that unwanted by-election. This week will be another high-stakes one for the prime minister as he heads to China to look for deeper trade ties against the backdrop of a volatile US and domestic resistance to Beijing at home. \"Like it or not, China matters for the UK,\" he declared ahead of the trip. \"As one of the world's biggest economic players, a strategic and consistent relationship with them is firmly in our national interest. \"That does not mean turning a blind eye to the challenges they pose - but engaging even where we disagree.\" Read more from Sky News:What's on the table in PM-Xi talks? This visit has been a year in planning and will be a big symbolic moment, if rather ill-timed, given the troubles he's facing in his own backyard. Starmer will be the first UK prime minister to visit China since Theresa May in 2018. His goal is to try to drum up trade with the world's second-biggest economy. He hopes this will help spur the economy and help Labour make an impact on the cost of living - now his number one priority for government. His challenge is to navigate that while not triggering Trump. Just days ago, the US president threatened a 100% tariff on Canada if PM Mark Carney did a trade deal with Beijing. He will also have to face down criticism at home as the political consensus hardens against China due to concerns over national security threats and human rights. It's been over a decade since David Cameron hailed a \"golden era\" of close economic relations with China, as the UK hosted President Xi Jinping on a state visit. From golden age to ice age Since that period, relations between the two nations cooled amid concerns over national security and Chinese espionage, China's alliance with Russia, human rights abuses of the Uyghur population, and the crackdown on democracy in Hong Kong. The controversy around the government's approval of a Chinese mega-embassy last week - after years of delay - is a reflection of the deep unease many feel about an expanding Chinese footprint in the UK. It has not been well received by Washington, which believes the embassy will allow for widespread spying, and was opposed by a number of MPs across the House. Read more from Sky News:Everything we know about new Chinese embassy That is why this reset moment, spearheaded by Starmer, carries consequence. He must navigate both those economic opportunities while managing critical matters of national security and an increasingly fractious geopolitical backdrop. In an interview with Bloomberg on the eve of his trip, the prime minister said he wanted to take a \"more consistent\" approach to China rather than \"veering from a Golden Age to an Ice Age\" as he insisted the UK did not have to compromise on national security to pursue business interests (those opposed to the mega-embassy disagree). On the economic opportunities, the prize is clear: the UK wants to do more trade with the world's second-biggest economy, and the PM will be taking a delegation of 60 business and cultural leaders with him to that end. What does Starmer want from China? China is already the UK's third-largest trading partner and supports 370,000 jobs. Starmer wants to do more. In the global context, the reset with China will, of course, carry risk with Trump, but the recent actions and behaviour of the US president, who sparked a national outpouring of anger after denigrating British servicemen who lost their lives fighting alongside US troops in Afghanistan, can only help the UK's case when it comes to China. Be it Trump's ambivalence over NATO, aggression towards Greenland, threats of tariffs or hostility to the UK and European allies, the US has turned from the cornerstone of the post-war order to an unreliable ally. In an increasingly tense space between two global powers, middle powers like the UK can no longer seek sanctuary under the umbrella of the US and need to navigate a more complex path: in recent months, the leaders of the EU, France's Macron and Germany's Merz have all beaten a path to Xi's door. For the PM's part, he insists the UK can maintain its relationship with its closest ally, the US, while pursuing trade opportunities with China, without being forced to choose between the two. \"I'm often invited to simply choose between countries. I don't do that,\" he told Bloomberg. \"We've got very close relations with the US, of course we want to, and we will maintain that business, alongside security and defence.\" For China's part, it wants better access to UK markets, be that in investments or exports. It will also want to depoliticise a relationship that has in recent years been dominated by questions of security threats and the status of Hong Kong. In a sign of the growing warmth between London and Beijing, officials said Starmer would work with China on illegal migration and more financial co-operation. Starmer is sometimes in private rather prickly about the tag \"never here Keir\", and tells colleagues that these international trips are all about, and only about, delivering for the public - be it on trying to deal with illegal migration with the Germans or the French, or trying to put more money in the pockets of working people through seeing off the worst of Trump's tariffs, or trying to drum up business. Dealing with China will, of course, come with controversy and risks, leaving the impression that the prime minister cares more about globe-trotting than the domestic grind. Even as he prepares to fly to Beijing, the government this week is trying to highlight freezing prescription charges, announcing plans to cap ground rents - delivering on a manifesto pledge while also trying to placate MPs - and an £80m support package for pubs after the business rates backlash. Can PM turn things around? It's been hard for Starmer to make much progress on the cost of living message in between the drama of Trump and then Burnham, but government insiders tell me that, at last, polling is beginning to improve for Labour with people that are feeling the benefits of some of their cost of living initiatives, be it breakfast clubs, free childcare or their decision to lift the two-child benefit cap. For a prime minister acutely aware of his domestic fragility, with the public and his party, a five-day trip to China right now will do little to steady the nerves. There are many in the party mutinous over Starmer's decision to block Burnham from standing in the Gorton and Denton by-election. The prime minister is not in a good place to try to lead from the front and charm in the tearooms when he is 5,000 miles away. But as he struggles with the politics, he is pressing on with trying to secure some delivery on the pledges he made when he won the election. His calculation is that more business with the world's second-biggest economy will help him do that - and could ultimately give him some much-needed help back home."
    },
    {
        "title": "PM's future is at stake in pivotal by-election of his own making",
        "description": "Sir Keir Starmer has created, from nowhere, a pivotal by-election by his own hand. ",
        "url": "https://news.sky.com/story/pms-future-is-at-stake-in-pivotal-by-election-of-his-own-making-13499842",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-sir-keir-starmer-andy-burnham_7146288.jpg?20260126132937",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2026-01-27 22:22:00",
        "Headline": "Labour are under pressure from their left via the Greens and their right via Reform. It conjures up the possibility the party could even come third in a seat they've held since before the Second World War, after Andy Burnham was blocked from standing.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Sir Keir Starmer has created, from nowhere, a pivotal by-election by his own hand.  He owns the outcome, because of his decision to block Andy Burnham - someone voters on the streets of Denton and Gorton thought by far to be the strongest candidate. And nobody can anticipate the result, which Labour MPs think could trigger a coup against the prime minister should Labour come third. Read more:PM defends Burnham blockReform and Greens eye major by-election scalp The east Manchester seat, with a 13,000 majority, has been Labour since before the Second World War, once regarded as an irredeemably poor, post-industrial area that was home to railway workers. While some parts remain poor, others are the beneficiary of the economic improvement of Greater Manchester as a whole, as well as an area that has seen the upside of Emirati millions around the adjacent Manchester City stadium. And as such, it is a melting pot of many differing communities, once united by Labour politics. On 26 February, we will see if this remains the case. Pressure from left and right The constituency, northeast of the city, is shaped like a hammer, according to Rob Ford, the Manchester University political scientist. The handle of the hammer, in the south of the seat, has several wards that are very ethnically diverse, large Muslim populations, but also large populations of students and young graduates. \"That looks like exactly the kind of territory where Labour has been losing support to the Greens in national polling recently,\" said Ford. Towards the head of the hammer, which is Gorton, and the wards in Tameside, it's much whiter, 90% white, and much more working class, with fewer graduates. \"That looks like the kind of terrain where Labour has been losing ground to Reform recently,\" Ford said. Labour MPs up to Andrew Gwynne, who stepped down on Thursday, were sufficiently able to unite both parts of the community to ensure the seat was perpetually Labour. But with politics fracturing, populism rising, could a new approach work? Professor Ford said: \"You've got very different, highly charged local issues in the two halves of the seat. In the Manchester part, the more Muslim and at young professional part, there'll be a lot of campaigning on Gaza, particularly with the Workers Party picking up a high-profile candidate in the Gorton part. \"You may see a lot of quite polarising identity politics from Reform UK, potentially on issues like crime, grooming, gangs, immigration and so forth.\" All of which point to a campaign led by Reform slugging it out with the Greens, and none of that looks like the campaign Starmer's Labour would run. As the leader of Manchester City Council, the choice of many Labour MPs, also ducks this race, it is less clear given the national political backdrop how the party can hang on. Joshi Herman, founder of the Manchester Mill, a journalism website with deep links in the community, said: \"I think if Andy Burnham had been the Labour candidate, they would have been strong favourites to win here.\" While not guaranteed due to the national polling picture, he says Burnham is a \"very popular mayor, and he goes down well in places like this\". A test for Polanski But can the Greens, the face of the populist left, inhabit a space that even Burnham voters might be attracted to? At a rally on Tuesday night, Zack Polanski called this the \"blockbuster\" by-election of this parliament - as he commenced his first electoral test as leader. Translating membership numbers and polling figures into a real result would be a massive coup for the Green leader, who is pitching to be the heir to Jeremy Corbyn's shade of Labour Party. He had three times the number of supporters as the lunchtime unveiling of Reform UK's candidate. But can the Greens show they are a party of the north as well as the southern middle class? Meanwhile, Reform unveiled academic and TV pundit Matt Goodwin as their candidate. They mentioned but did not dwell on more contentious, populist campaign techniques like grooming gangs in their news conference, instead preaching to voters who think Britain is broken and only their brand of radicalism can fix it. But the big question is just how hard Labour will try to win, given the prime minister's own future is at stake. They could throw everything at it - Angela Rayner is a neighbour, along with Lisa Nandy and chief whip Jonathan Reynolds. Starmer himself could go. Do they put in the money, and force the visits, that they did in Batley and Spen, the last time the Labour leader's future was on the line in a by-election? Or do they quietly let this one slip, knowing it's a diversion and a costly lost cause, whatever the consequence? All this is at stake on 26 February. It is clear that what matters will be how this by-election is fought, not just who wins on the night."
    },
    {
        "title": "95-year-old woman tied up during 'vile' attempted robbery by man who offered to clean windows",
        "description": "A 95-year-old woman was tied up during an attempted robbery by a man who offered to clean her windows, according to police.",
        "url": "https://news.sky.com/story/95-year-old-woman-tied-up-during-vile-attempted-robbery-by-man-who-offered-to-clean-windows-13499845",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-greater-manchester_7147940.jpg?20260127231824",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-27 22:28:00",
        "Headline": "Greater Manchester Police have appealed for any CCTV, dashcam or doorbell footage from the area at the time.",
        "Content": "A 95-year-old woman was tied up during an attempted robbery by a man who offered to clean her windows, according to police. Greater Manchester Police (GMP) officers were called to an address in Salford around 11am on Tuesday after it was reported than a man had demanded cash from a woman. It is believed the man entered the woman's property after offering to clean her windows. Police say he then tied her hands together and demand her cash and purse. The man was disturbed when another woman, who knew the victim, arrived at the property in Little Hulton. No injuries were reported, and the victim is being supported by officers. Detective Inspector Paul Davies, from GMP's Salford district, said: \"This was a vile incident in which a woman was tied up and threatened in an address, and we are determined to locate the man responsible.\" Police have appealed for any CCTV, dashcam or doorbell footage from the area at the time - or information from anyone who saw anything suspicious. The suspect is described as being a white male, aged in his late 60s or early 70s. He was wearing a dark raincoat jacket, jeans and dark-coloured shoes. He had short, mousy brown hair which was combed back, no facial hair, glasses, and appeared neat and tidy. \n                  What do local residents think of move to block Andy Burnham from running in Gorton and Denton by-election?\n                 \n                  Teenager among four killed in Bolton car crash was 'my heart, my soul, my everything', mother says\n                 \n                  Pensioner killed in 'ritual sacrifice' was 'failed on every level', family says\n                 Read more from Sky News:'Outstanding' army officer dies during live firing training exerciseBoy, 14, charged over fatal e-scooter crash in Manchester DI Davies added: \"Thankfully, this was not a more serious situation and we commend the brave actions of the lady's friend who confronted the man and called officers. \"As we progress this investigation, we are appealing for anyone with any information to please come forward. \"It could be something big or small - it all assists in our work.\""
    },
    {
        "title": "'Talk to me, Goose': Starmer teases Macron with Top Gun mock up",
        "description": "British Prime Minister Keir Starmer has poked fun at his French counterpart - by putting on a pair of sunglasses at an event before saying, \"bonjour\".&#160;",
        "url": "https://news.sky.com/story/talk-to-me-goose-starmer-teases-macron-with-top-gun-mock-up-13499830",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-sir-keir-starmer-emmanuel-macron_7147769.jpg?20260127211039",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-27 22:09:00",
        "Headline": "The joke was a reference to President Emmanuel Macron's now viral wearing of Top Gun-style aviator sunglasses in Davos last week.",
        "Content": "British Prime Minister Keir Starmer has poked fun at his French counterpart - by putting on a pair of sunglasses at an event before saying, \"bonjour\".  The joke was a reference to President Emmanuel Macron's now viral wearing of Top Gun-style aviator sunglasses at the World Economic Forum in Davos last week. The prime minister then uploaded a video of the joke to his TikTok account, tagging Mr Macron and captioning the post, \"talk to me, Goose,\" a famous quote from the film Top Gun. The French president replied within minutes, writing \"for sure\". That was a reference to a widely shared clip of his Davos speech where he uttered the phrase, for sure, multiple times. Sir Keir Starmer then took the joke one step further by replying to Mr Macron's comment with a mock-up of the two leaders standing side by side in a Top Gun image. The sunglasses quip was made by Mr Starmer at a recording of Matt Forde's Political Party Live podcast at London's Duchess Theatre - receiving a big laugh from the crowd. \n                  Is a new world 'without rules' emerging? What global leaders have said\n                 \n                  Trump offers ominous message on Greenland ahead of crunch talks with European leaders\n                 \n                  Trump restates desire to take over Greenland, as poll finds most Americans are against it\n                 Mr Macron originally donned the shades at Davos to hide a benign medical issue with his right eye, according to the French president. He wasn't the only president to comment on the fashion choice. \"Those beautiful sunglasses,\" Trump said in his Davos address. \"What the hell happened?\" The French president's office said the shades were made by a French firm, Henry Jullien. At €659 (£573) the Pacific S 01 model sunglasses aren't cheap. But that didn't stop a surge in demand, leaving the manufacturer struggling to keep up. The firm had to create a dedicated page which read: \"Our eShop website is experiencing an exceptional volume of visits and enquiries.\" Shares of its Italian parent company, iVision Tech SpA, soared on Milan's stock exchange - from €1.51 (£1.31) a share when Macron spoke Tuesday, to a high on Friday of €2.63 (£2.29). Read more from Sky News:Why Starmer's reset moment with China 'carries consequence'Coco Gauff condemns tennis's lack of privacy \"Crazy week,\" Stefano Fulchir, iVision's CEO, told AP. \"Very honoured and happy that President Macron has used our eyewear in this important event.\" Cristina Archetti, author of Politicians, Personal Image and The Construction of Political Identity, went as far as saying that \"he [Macron] does look hot\". She added that 48-year-old Macron looked \"relatively young and super cool\"."
    },
    {
        "title": "Army investigates death of 'outstanding' officer during live firing training exercise",
        "description": "An army officer has died during a training exercise, the Ministry of Defence (MoD) has confirmed.",
        "url": "https://news.sky.com/story/army-investigates-death-of-outstanding-officer-during-live-firing-training-exercise-13499796",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-otterburn-muldowney_7147789.jpg?20260127214123",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-27 20:53:00",
        "Headline": "Captain Philip Gilbert Muldowney's commanding officer paid tribute to his \"leadership, courage, and sense of duty\".",
        "Content": "An army officer has died during a training exercise, the Ministry of Defence (MoD) has confirmed. Captain Philip Gilbert Muldowney died following a live firing incident at the Otterburn Training Area, Northumberland, on Sunday. The death of Capt Muldowney, who served as a fire support commander within 129 (Dragon) Battery of the 4th Regiment Royal Artillery, is being investigated. An army spokesperson said: \"The circumstances surrounding Capt Muldowney's death are being investigated, and it would be inappropriate to comment any further at this time.\" Capt Muldowney's commanding officer paid tribute to the 25-year-old, highlighting his \"leadership, courage, and sense of duty\". Commanding officer of 4th Regiment Royal Artillery, Lieutenant Colonel Henry Waller said: \"It is with deep sadness that we announce the death of Captain Philip Gilbert Muldowney. \"Known to all simply as Gilbert, he was an immensely enthusiastic officer who embraced life with a vigour that inspired everyone around him. \n                  Beth Rigby: Why PM's China trip carries real consequence - including for you at home\n                 \n                  Can the UK reset their relationship with China?\n                 \n                  Storm Chandra latest: Rail line to close causes sinkhole\n                 \"Professionally, Gilbert was an outstanding officer who consistently put his soldiers first. He led from the front in all that he did, a quality that defined his character. His leadership, courage, and sense of duty earned him the respect and admiration of all who served alongside him. \"He served all those under his command in a highly authentic manner, unapologetically himself. Every day he displayed a level of spirit I continue to be in awe of.\" He added: \"Gilbert was an unforgettable character and a rising star within the army and the regiment. \"His loss is deeply felt by his comrades and friends, and our thoughts and prayers are with his family at this most difficult time.\" Read more from Sky News:Boy, 14, charged over fatal e-scooter crash in ManchesterOxford student denies stirring up racial hatred during protest Captain Helen Brackenbury said: \"Gilbert was a truly kind person, highly competent and endearingly joyful. \"He served all those under his command in a highly authentic manner, unapologetically himself - every day he displayed a level of spirit I continue to be in awe of. It has been the pleasure of my career to have served alongside him.\" Capt Muldowney joined the army six years ago, commissioning into the Royal Artillery after attending Sandhurst."
    },
    {
        "title": "Warrington hospital's home birth service played 'Russian roulette' with lives, grieving father says",
        "description": "A father whose newborn baby died after an \"avoidable\" delay in her delivery has accused a hospital trust's home birth service of playing \"Russian roulette\" with the lives of mothers and babies.",
        "url": "https://news.sky.com/story/warrington-hospitals-home-birth-service-played-russian-roulette-with-lives-grieving-father-says-13499657",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-victoria-thomas-gillibrand_7147718.jpg?20260127200334",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-27 15:24:00",
        "Headline": "Thomas and Victoria Gillibrand's baby, Pippa, who died from a severe brain injury \"sustained due to an avoidable delay in her delivery\", may have lived if staff had brought the mother into the hospital earlier, a coroner has said.",
        "Content": "A father whose newborn baby died after an \"avoidable\" delay in her delivery has accused a hospital trust's home birth service of playing \"Russian roulette\" with the lives of mothers and babies. Warning - this story includes descriptions of a newborn child's suffering and death Thomas and Victoria Gillibrand's baby, Pippa, suffered a severe brain injury and died at just 12 days old, Cheshire Coroner's court heard. Ms Gillibrand, 33, had planned to give birth at her home in Warrington, but when she went into labour on 25 August 2024, the home birth team from Warrington and Halton Hospitals NHS Foundation Trust was dealing with another labour. Storm Chandra latest - major disruption There were \"missed opportunities\" for the trust to abandon the home birth plan and tell Mrs Gillibrand to come into hospital, coroner Victoria Davies said as she delivered her findings. Speaking outside the court in Warrington on Tuesday, Mr Gillibrand, 34, said: \"The trust seems to have played Russian roulette with the innocent lives of mothers and babies. \"Tragically, we are the family that took the bullet on that. Our feelings are that Pippa's death was clearly preventable and it shouldn't have taken a child's death for changes to be implemented.\" Mrs Gillibrand, who carried a small toy bought for Pippa with her, added: \"Services have been underfunded and stretched for such a long time, that we're now in a position that we've lost our daughter because of the cuts and the services that are currently in situ, and things need to change.\" Mr Gillibrand called Warrington Hospital at about 5.30am on the Sunday of the August bank holiday weekend to tell them his wife was in labour, the inquest heard. Ms Davies said that, given staffing issues over the weekend, including that the home birth team were already at another birth, \"Pippa's mother should have been advised to attend hospital rather than continue as a home birth\". A second opportunity to change course came when Mr Gillibrand rang after his wife's waters broke at about 7am. Eventually, a midwife arrived at the couple's home, about 15-20 minutes' drive from the hospital, at about 8.15am, the inquest heard. After 9am, Pippa's heart rate should have been monitored every five minutes but midwives were coping with \"competing pressures\", including short staffing and laptops which were not working. A decision to take Mrs Gillibrand to hospital should have been made after 9.36am, when difficulties in monitoring Pippa's heart rate became clear, the coroner said. \"Had Pippa been delivered earlier, on the balance of probabilities she would not have died when she did.\" Read more on birth trauma:Your birth stories - the viewers and readers who contacted Sky NewsIgnored, bad behaviour and long-term trauma: What you told us Mrs Gillibrand was transferred to hospital by ambulance after a decision was made at 10am and Pippa was delivered by forceps. She was transferred to the neonatal unit and later moved to Liverpool Women's Hospital but died on 5 September after scans showed she had suffered a \"severe irreversible brain injury\" due to a lack of oxygen. Recording a narrative conclusion, Ms Davies said: \"Pippa Gillibrand died as a result of a brain injury sustained due to an avoidable delay in her delivery.\" She said the Warrington hospital trust had since changed its home birth service. Rebecca Cahill, from JMW solicitors, who represented the family, said the situation \"made the homebirth service manifestly unsafe, and the service should have been suspended when Vicky made initial contact\". Read more on Sky News:Pubs to be bailed outStar 'didn't expect to see Christmas' She said the family \"were failed from the start\". Ali Kennah, chief nurse at Warrington and Halton Teaching Hospitals, said: \"We remain truly sorry for the failures in the care that Mrs Gillibrand and Pippa received, and we fully accept the coroner's findings. \"Since this tragedy occurred, we have strengthened our home birth service and have fully implemented all recommendations from an independent review. We will continue to make sure that all lessons are learned. \"We would again like to extend our deepest condolences to Mr and Mrs Gillibrand for their heartbreaking loss.\" The trust was not immediately available for comment regarding the most recent accusations."
    },
    {
        "title": "Bereaved mother describes 'harrowing' stillbirth aftercare",
        "description": "Kelsey Parker, widow of late The Wanted singer Tom Parker, has told Sky News she experienced \"harrowing\" care after her son was stillborn.",
        "url": "https://news.sky.com/story/bereaved-mother-describes-harrowing-stillbirth-aftercare-13499742",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-kelsey-parker_7147717.png?20260127200131",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-27 18:04:00",
        "Headline": "Speaking on Sky News' The UK Tonight With Sarah-Jane Mee, Kelsey Parker described the devastation she suffered after going into labour and giving birth at 39 weeks.",
        "Content": "Kelsey Parker, widow of late The Wanted singer Tom Parker, has told Sky News she experienced \"harrowing\" care after her son was stillborn. Ms Parker, 35, announced the loss of her baby Phoenix, who she expected with new partner Will, in June last year. The mother-of-two has now spoken to The UK Tonight With Sarah-Jane Mee, where she described the devastation suffered after going into labour and giving birth at home at 39 weeks. She was then taken to a maternity ward with other new mothers and babies. \"I did not feel kindness and I think the people that had to look after me, their jaws were on the floor,\" she said. \"They didn't know what to do, their hands were tied. \"I think for me, reliving it, I needed that time off. I actually took time off work, which is unheard of for me, because I needed time to process what I went through, and I wouldn't wish what I went through on anyone. \"It was absolutely horrendous, harrowing, awful.\" Sky News has reported extensively on the state of maternity care in the UK, including the stories of three women who suffered traumatic experiences. More than 180 people have written to Sky News to share their birth stories - you can share yours by emailing maternitystories@sky.uk. Read more:What you told us about your maternity experiencesWoman says she 'begged for pain relief but was told no' Royal correspondent After years of warnings, reviews, and mounting pressure, 2026 could be a pivotal moment for maternity services. We've long-known maternity care is in crisis. It is a vital service but one which is under sustained strain. And in some cases, failing mothers and babies with tragic consequences. Multiple national investigations over the last decade have highlighted serious failings. Each report written has made several recommendations, and yet the system still struggles. Fundamental change is long overdue, and it could come with the publication of the Amos review. Baroness Amos is looking into system-wide issues, to understand why problems persist, and what needs to change. But there is already scepticism as to what the review will achieve. Sky News has received hundreds of emails from families sharing their birth traumas. All similar stories, each one harrowing. Many families feel deep mistrust, telling us we've been here before, and lessons haven't been learnt. There's a lot of pressure to get this right, and progress will be judged by positive outcomes not promises. Of the 186 countries the UN collects data for, the UK was one of only 14 where maternal mortality rates were higher in 2020 than they were in 1985. The US and Canada were also in that group, while Cyprus and Finland were the only other European countries. Over that time, the UK has fallen from having the ninth-lowest maternal mortality rate in the world to being 42nd."
    },
    {
        "title": "Sir Idris Elba caught speeding on moped a day after announcing Netflix movie about Charles's charity The King's Trust",
        "description": "Actor and scooter enthusiast Sir Idris Elba has been slapped with a fine for going more than 20mph on his moped.",
        "url": "https://news.sky.com/story/sir-idris-elba-caught-speeding-on-moped-a-day-after-announcing-netflix-movie-about-charless-charity-the-kings-trust-13499668",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/idris-elba-chelsea-moped-skynews_7147453.jpg?20260127152236",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-27 15:55:00",
        "Headline": "Sir Idris, renowned for his love of his mopeds so much it made its way into a Taylor Swift song, was hit with a £147 fine.",
        "Content": "Actor and scooter enthusiast Sir Idris Elba has been slapped with a fine for going more than 20mph on his moped. Speed cameras clocked the actor, 53, making his way across Chelsea Embankment in central London at 10.12am on 21 June last year. Sir Idris is renowned for his love of mopeds - so much it even made its way into a Taylor Swift song. The US singer sampled the actor saying \"We can go driving on my scooter - you know, just riding in London\" on her 2019 song 'London Boy'. Meanwhile film fans will be reminded of Guy Ritchie's 2008 film Rock'n'Rolla - where Sir Idris's character has to evade Russian mobsters on a moped. Sir Idris admitted riding the BMW moped but insisted he had not received a fixed penalty fine from the police and was denied a chance to pay it off before appearing in court. Read more from Sky News:Storm Chandra hits UKWhite House changes tone on ICE crackdown \n                  Idris Elba on the power of football - and how it can help tackle knife crime\n                 \n                  Idris Elba joins Prime Minister Sir Keir Starmer for launch of new anti-knife crime coalition\n                 \n                  The King and Idris Elba discuss youth violence at King's Trust event\n                 He was ultimately forced to pay a £147 fine and received three penalty points at Westminster Magistrates' Court last Thursday. He was also ordered to pay £110 in costs and a £59 victim surcharge. Police presented three images to the court, showing Sir Idris riding a scooter at 28mph in a 20mph zone. The incident happened a day after it was announced the actor is collaborating with the King for a Netflix film about 50 years of Charles's charity The King's Trust. But Sir Idris's lawyers, Patterson Law, which specialises in motoring offences, urged the courts to let him ride off with just a £100 fine instead. \"Mr Elba initially responded to the Notice of Intended Prosecution to nominate himself as the driver and was expecting to receive a fixed penalty offer,\" a letter read to the court said. \"However, the offer never arrived and he therefore never had the opportunity to accept it. \"Had he received it, he absolutely would have accepted it.\" The law firm said the actor had a clean driving licence and was pleading guilty to the offence, sparing the expense of a trial. \"We would ask the court to consider replicating the fixed penalty by imposing no more than a £100 fine, with no award for costs,\" the letter continues. \"He never received the fixed penalty - and this was through no fault of his own. It would therefore not be in the interests of justice to impose further financial penalties for something which was not his fault.\" The prosecution was dealt with in the Single Justice Procedure, meaning Elba was not required to attend."
    },
    {
        "title": "Hundreds of jobs lost as Revolution bars owner enters administration",
        "description": "Nearly 600 jobs have been lost after the owner of Revolution bars went into administration.",
        "url": "https://news.sky.com/story/almost-600-jobs-lost-but-many-saved-as-revolution-owner-enters-administration-13499580",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-revolution-pub_7147223.jpg?20260127120433",
        "type": "UK",
        "Author": "James Sillars",
        "Date Published": "2026-01-27 11:32:00",
        "Headline": "The announcement was made just before the chancellor was due to confirm a partial U-turn on costly business rates changes for the pub industry.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Nearly 600 jobs have been lost after the owner of Revolution bars went into administration. The Revel Collective, which revealed on Monday that it had filed notice of an intention to appoint administrators, said it had since formally appointed FTI Consulting. Venues closing with immediate effect include 14 Revolution bars, six Revolucion de Cuba bars and one Peach Pub - with the loss of 591 jobs. However, FTI confirmed a pair of deals which will secure the future of 41 sites and 1,582 jobs. Money latest: BBC to use iPlayer to catch licence fee evaders The locations of the Revolution sites closing are: Manchester (Oxford Road), Huddersfield, Leicester, Glasgow (Renfield Street), Cardiff, Nottingham, Leeds, Sheffield, Ipswich, Manchester (Parsonage Gardens), Plymouth, Durham, Exeter and Preston. The Revolucion de Cuba sites affected are: Cardiff, Derby, Liverpool, Reading, Harrogate and Aberdeen while the Peach premises to be shut was The Almanack at Kenilworth in Warwickshire. \n                  Pubs and music venues to be handed business rates relief after government U-turn\n                 \n                  Freedom Fibre and Truespeed close to finalising altnet merger\n                 \n                  Energy price cap facing upwards pressure from US storm\n                 The announcement was made shortly before the chancellor was expected to reveal a partial U-turn on business rates changes facing pubs. The industry said they were expected to add almost £13,000 in costs over three years to the average pub in advance of the climbdown. It has battled rising costs for many years, with new minimum pay levels and heightened national insurance contributions adding to the burden last spring. Revel undertook a major restructuring in 2024, shutting 15 unprofitable bars in a bid to turn around its performance. But the revamp fell flat and a strategic review resulted in the group being placed up for sale. Revel had partly blamed weak trading, with younger customers having little disposable income. Higher costs also weighed on its bottom line and growing debt pile."
    },
    {
        "title": "Crowds gather in Shetland for Up Helly Aa fire festival",
        "description": "Crowds have gathered in Shetland for the world-famous Up Helly Aa fire festival.",
        "url": "https://news.sky.com/story/crowds-gather-in-shetland-for-up-helly-aa-fire-festival-13499698",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-shetland-up-helly-aa_7147515.jpg?20260127163112",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-27 16:22:00",
        "Headline": "The event takes place in Lerwick on the last Tuesday of January each year and attracts visitors from around the globe.",
        "Content": "Crowds have gathered in Shetland for the world-famous Up Helly Aa fire festival. The annual event takes place in Lerwick on the last Tuesday of January and attracts visitors from around the globe. The much-loved festival sees people dressed as Vikings march through the streets of the town to recreate its ancient past, in a tradition dating back to the 19th century. The walk is led by the Guizer Jarl, or chief guizer, and culminates in a torch-lit procession and the burning of a replica longboat. Volunteers are responsible for the building of the galley boat and the production of more than 1,000 torches. In the evening there will be a host of celebrations in halls around the town. Read more from Sky News:One Battle After Another leads BAFTA nominations \n                  US moves captured tanker captain and first officer from UK waters\n                 \n                  Scottish government vows to release 'Salmond files' but refuses to set date as it faces legal action over the delay\n                 \n                  Passenger killed in train crash died on wedding anniversary, accident inquiry hears\n                 Shetland and neighbouring Orkney were ruled by the Norse for about 500 years until they became part of Scotland in 1468. The festival stems from the 1870s when a group of local men wanted to put new ideas into Shetland's Christmas celebrations."
    },
    {
        "title": "Coco Gauff condemns tennis's lack of privacy after she's caught on camera smashing a racket",
        "description": "Coco Gauff has called for more privacy for tennis players after being caught on camera smashing her racket in an off-court players' area following her Australian Open quarter-final loss to Elina Svitolina on Tuesday.",
        "url": "https://news.sky.com/story/coco-gauff-condemns-tenniss-lack-of-privacy-after-shes-caught-on-camera-smashing-a-racket-13499748",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-tennis-gauff_7147676.jpg?20260127191606",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-27 18:21:00",
        "Headline": "\"Certain moments... don't need to [be] broadcast,\" the 21-year-old star said as she spoke out about the incident. ",
        "Content": "Coco Gauff has called for more privacy for tennis players after being caught on camera smashing her racket in an off-court players' area following her Australian Open quarter-final loss to Elina Svitolina on Tuesday. After the loss, the 21-year-old two-time major winner, said she \"tried to go somewhere where I thought there wasn't a camera, because I don't necessarily like breaking rackets\". Unfortunately for the star, there's pretty much no place in Rod Laver Arena except for the changing rooms that is beyond the scope of the cameras. So, while the star thought she had privately broken her racket by smashing it seven times against a concrete ramp, footage of the act was quickly broadcast on TV and social media. \"Certain moments - the same thing happened to Aryna (Sabalenka) after I played her in the final of the US Open - I feel like they don't need to broadcast,\" Gauff said in her post-match news conference. \"I broke one racket (at the) French Open, I think, and I said I would never do it again on court because I don't feel like that's a good representation,\" she said. \"Maybe some conversations can be had.\" \n                  Australian Open: Coco Gauff calls for more privacy after smashing her racket following shock exit\n                 \n                  Australian Open: Carlos Alcaraz continues career Grand Slam bid with dominant win over Alex de Minaur to set up semi-final against Alexander Zverev\n                 \nLatest scores from Australian Open with Swiatek, Anisimova, Djokovic in action\n Gauff said she thought it was better to shatter a racket than take out any frustration on her team, saying \"they don't deserve that, and I know I'm emotional\". The star reiterated that she didn't think it was a \"bad thing\", but said she tried not to \"do it on court in front of kids\". Read more from Sky News:Boy, 14, charged over fatal e-scooter crashPubs and music venues to get business rates relief It was an unusually bad day for the player who made her Grand Slam debut at 15 and won her first major, the 2023 US Open, at 19. Tennis players breaking their rackets on court isn't especially rare, with multiple cases of it over the years. It nearly always results in them receiving a fine from the tennis authorities. However, the filming and broadcasting of a player who is trying to smash their racket in private is - and is likely to spark a conversation around player privacy, especially with so many young players in tennis. Tennis Australia, which manages the Australian Open, has been contacted for comment."
    },
    {
        "title": "'Talk to me, Goose': Starmer teases Macron with Top Gun mock up",
        "description": "British Prime Minister Keir Starmer has poked fun at his French counterpart - by putting on a pair of sunglasses at an event before saying, \"bonjour\".&#160;",
        "url": "https://news.sky.com/story/talk-to-me-goose-starmer-teases-macron-with-top-gun-mock-up-13499830",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-sir-keir-starmer-emmanuel-macron_7147769.jpg?20260127211039",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-27 22:09:00",
        "Headline": "The joke was a reference to President Emmanuel Macron's now viral wearing of Top Gun-style aviator sunglasses in Davos last week.",
        "Content": "British Prime Minister Keir Starmer has poked fun at his French counterpart - by putting on a pair of sunglasses at an event before saying, \"bonjour\".  The joke was a reference to President Emmanuel Macron's now viral wearing of Top Gun-style aviator sunglasses at the World Economic Forum in Davos last week. The prime minister then uploaded a video of the joke to his TikTok account, tagging Mr Macron and captioning the post, \"talk to me, Goose,\" a famous quote from the film Top Gun. The French president replied within minutes, writing \"for sure\". That was a reference to a widely shared clip of his Davos speech where he uttered the phrase, for sure, multiple times. Sir Keir Starmer then took the joke one step further by replying to Mr Macron's comment with a mock-up of the two leaders standing side by side in a Top Gun image. The sunglasses quip was made by Mr Starmer at a recording of Matt Forde's Political Party Live podcast at London's Duchess Theatre - receiving a big laugh from the crowd. \n                  Is a new world 'without rules' emerging? What global leaders have said\n                 \n                  Trump offers ominous message on Greenland ahead of crunch talks with European leaders\n                 \n                  Trump restates desire to take over Greenland, as poll finds most Americans are against it\n                 Mr Macron originally donned the shades at Davos to hide a benign medical issue with his right eye, according to the French president. He wasn't the only president to comment on the fashion choice. \"Those beautiful sunglasses,\" Trump said in his Davos address. \"What the hell happened?\" The French president's office said the shades were made by a French firm, Henry Jullien. At €659 (£573) the Pacific S 01 model sunglasses aren't cheap. But that didn't stop a surge in demand, leaving the manufacturer struggling to keep up. The firm had to create a dedicated page which read: \"Our eShop website is experiencing an exceptional volume of visits and enquiries.\" Shares of its Italian parent company, iVision Tech SpA, soared on Milan's stock exchange - from €1.51 (£1.31) a share when Macron spoke Tuesday, to a high on Friday of €2.63 (£2.29). Read more from Sky News:Why Starmer's reset moment with China 'carries consequence'Coco Gauff condemns tennis's lack of privacy \"Crazy week,\" Stefano Fulchir, iVision's CEO, told AP. \"Very honoured and happy that President Macron has used our eyewear in this important event.\" Cristina Archetti, author of Politicians, Personal Image and The Construction of Political Identity, went as far as saying that \"he [Macron] does look hot\". She added that 48-year-old Macron looked \"relatively young and super cool\"."
    },
    {
        "title": "Rabbi Pinchas Goldschmidt says Europe must do 'much more' to support revolution in Iran",
        "description": "Europe's most prominent rabbi has told Sky News he holds Iran responsible for the rise of antisemitism in recent years and believes European countries must do much more to support Iranian protesters in overthrowing the Tehran regime.",
        "url": "https://news.sky.com/story/rabbi-pinchas-goldschmidt-says-europe-must-do-much-more-to-support-revolution-in-iran-13499645",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-pinchas-goldschmidt_7147450.png?20260127151337",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2026-01-27 14:51:00",
        "Headline": "The rabbi says Ayatollah Ali Khamenei is at the centre of a web that seeks to undermine, damage and ultimately destroy both Israel and Jewish people.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n Europe's most prominent rabbi has told Sky News he holds Iran responsible for the rise of antisemitism in recent years and believes European countries must do much more to support Iranian protesters in overthrowing the Tehran regime. Speaking on Holocaust Memorial Day, Pinchas Goldschmidt, president of the Conference of European Rabbis, said anger against Jews had grown to dangerous levels, regardless of their views on politics, religion or the war in Gaza. He said there was the prospect of \"antisemitic acts against Jews who live anywhere in the world, who have nothing to do with the Israeli government and nothing to do with Israel\". But he said Jews and Israel would both \"prevail\", telling me: \"Eighty years after the end of the Holocaust, Jews are back as a sovereign nation in Israel, united with the Jews who live all over the world.\" We spoke in Jerusalem, meeting in the shadow of the Western Wall. It is a place of pilgrimage for Jews of all countries, which he referred to as the \"source of Jewish identity\". But for many of those Jews, this has been a time marked by a surge in antisemitic acts. The attacks of 7 October 2023, and the relentless Israeli military response that followed, led to a sharp increase in antisemitic hate crimes across Europe, including France and the UK. \n                  Trump wants to 'de-escalate' in Minneapolis - but says ICE victim shouldn't have carried gun\n                 \n                  ICE agents to have role at Winter Olympics - as crackdown's 'public face' to leave Minneapolis\n                 \n                  Homes flooded and cars stranded during Storm Chandra in Ireland\n                 Since the start of the war in Gaza, more than 70,000 Palestinians have been killed due to Israeli military action. \"The criticism of war is legitimate and there is criticism of that in Israel, too,\" Rabbi Goldschmidt told Sky News. \"But when the criticism goes beyond the pale - delegitimising the existence of the state of Israel or allegations that have no basis in fact, that's when you traverse from criticism to antisemitism.\" He blamed \"extremists\" from the \"far right and far left in the United States and Europe\" and claimed that they were receiving support and backing from Iran. \"All these people who went and discredited the Jewish people in Israel over the last two years - I don't see them on the streets regarding Iran. I don't see one voice talking about the 30,000 civilians killed in Iran. Why not?\" Rabbi Goldschmidt, who represents hundreds of orthodox rabbis across Europe, believes the Iranian regime, Ayatollah Ali Khamenei, sits at the centre of a web that seeks to undermine, damage and ultimately destroy both Israel and Jewish people. 'Jews better off in London' On Gaza, he was clear that Israel should not control the Strip, but rather \"it should be administered by a consortium of Arab countries supervised by the United States and other Western powers to provide security, and a viable way of economic support for the Palestinian population in Gaza\". I asked whether he would like to see a two-state solution that would create a Palestinian state separate from Israel. \"Yes, but in the same way that the European Union was impossible as long as Nazi Germany existed, so the two-state solution is impossible as long as Iran is creating failed states and terror hubs all over the Middle East,\" he said. \"That is why Iran needs a successful revolution. And they need Western support. I told my colleagues in Europe: 'You can do much more to support the demonstrators.' \"They can offer asylum. They can offer support for those leading politicians and people in the security forces who switched sides. Much more can be done.\" The rabbi did, however, praise the efforts of British institutions to protect Jewish people, laughing off the idea that they might want to claim asylum in America - an idea apparently floated by the Trump administration. \"I think the Jews are much better off in London,\" he said. \"I think the government in England has done a lot to protect the Jewish community. \"The government is friendly, the King is friendly with the Jewish community. The attack in Manchester was the exception to the rule.\" Read more:Ministers in tears as Holocaust survivor speaksRemains of last Israeli hostage found in Gaza Rabbi Goldschmidt is not considered an extreme voice in the Jewish world, but his voice does resonate widely. He was clear that he thought European nations had tried to tackle antisemitism - his praise for the UK was earnest. So, too, were his claims about the dangers posed by Iran. And he reflects an anxiety in this region. Many in Israel were hoping to see the protesters prevail, and the Ayatollah fall from power. Neither of those has happened."
    },
    {
        "title": "Rwanda suing UK over scrapped deportation scheme",
        "description": "Rwanda is suing the UK for failing to formally terminate the controversial agreement.&#160;",
        "url": "https://news.sky.com/story/rwanda-suing-uk-over-scrapped-deportation-scheme-13499633",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-migrants-small-boats_7008741.jpg?20250901214348",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-27 14:20:00",
        "Headline": "The east African country is seeking £50m in compensation after the UK failed to formally terminate the controversial agreement, The Telegraph reported.",
        "Content": "Rwanda is suing the UK for failing to formally terminate the controversial agreement.  It emerged on Tuesday that the east African country is seeking £50m in compensation, The Telegraph reported. The Rwanda scheme would have involved some asylum seekers being sent to Rwanda to have their asylum claims processed there. Following news of the lawsuit, Downing Street defended its decision to end the scheme, saying it had been a \"complete disaster\". Read more:Labour's immigration reforms at a glanceAsylum hotel migrant evictions set to begin in the spring The prime minister's official spokesman said: \"The Rwanda scheme was a complete disaster. It wasted £700 million of taxpayer cash to return just four volunteers. \"The truth is that 84,000 people crossed the Channel from the day the Rwanda deal was signed to the day it was scrapped. It was never a deterrent. \n                  Beth Rigby: Why PM's China trip carries real consequence - including for you at home\n                 \n                  Can the UK reset their relationship with China?\n                 \n                  Storm Chandra latest: Rail line to close causes sinkhole\n                 \"We will robustly defend our position to protect British taxpayers, and we're getting on with the job of focusing on effective ways to stamp out illegal migration, not costly gimmicks. \"And as I've said, we've removed under this Government almost 50,000 people who were here illegally. \"And more broadly, the Home Secretary set out the most sweeping reforms to tackling illegal migration in modern times to remove the incentives which draw people to the UK illegally, increase removals of those with no right to be on British soil.\" Rwanda has launched arbitral proceedings against the UK through The Hague-based Permanent Court of Arbitration. Rwanda began the inter-state arbitration proceedings under the asylum partnership agreement in November, according to the Netherlands-based court's website, which lists the case status as pending."
    },
    {
        "title": "Prime Minister Sir Keir Starmer in China: What will be on the table?",
        "description": "It doesn't feel all that long ago that David Cameron took the Chinese leader Xi Jinping for a pint in a Buckinghamshire pub.",
        "url": "https://news.sky.com/story/prime-minister-sir-keir-starmer-in-china-what-will-be-on-the-table-13499611",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-keir-starmer-xi-jinping_7147358.jpg?20260127135844",
        "type": "World",
        "Author": "Helen-Ann Smith",
        "Date Published": "2026-01-27 13:15:00",
        "Headline": "A lot has changed since former prime minister David Cameron took Chinese leader Xi Jinping for a pint in a UK pub.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n It doesn't feel all that long ago that David Cameron took the Chinese leader Xi Jinping for a pint in a Buckinghamshire pub. But a lot has changed in the 10 years since that photo op, the so-called \"golden era\" of UK-China relations. It's fair to say things have been on something of a downward spiral. Indeed, China is now far more self-sufficient, far more assertive and far more wary of the West than it once was, while the UK has spent a decade flip-flopping on its China policy with little coherent strategy, and very limited engagement. In fact, the last prime minister to visit Beijing was Theresa May eight years ago. But Sir Keir Starmer has been clear he wants to cautiously revamp relations. Choosing not to engage with the world's second-biggest economy is \"no choice at all\" according to this government. \n                  Beth Rigby: Why PM's China trip carries real consequence - including for you at home\n                 \n                  Xi's purge of top general paints a fascinating picture of power and control within a ruthless and unforgiving system\n                 \n                  HSBC chair Nelson among bosses joining Starmer on China visit\n                 But he could have a hard task balancing the potential gains with public opinion, and not being seen to be \"too soft\" on China. Human rights crackdowns, increasing military assertiveness and the COVID-19 pandemic have all left a British population far more China-sceptical than it once was and his critics will likely find a lot to dislike. So, what will be on the table for the prime minister this week, what are the stumbling blocks and what do the Chinese think about it all? Trade and investment How to benefit more from each other financially will almost certainly be top of the agenda, indeed Mr Starmer is travelling with a sizeable UK business delegation. The Chinese and British economies have quite different advantages, and both have things to offer that the other views as valuable. The UK's most important exports to China are services; legal, financial, accounting and education (tens of thousands of Chinese students attend British universities). While the UK mostly buys manufactured goods from China, such as electronics, tech and clothes. The two almost certainly won't start the process of negotiating a full trade agreement. That would take years and be politically fraught, but look out for deals that increase market access, remove non-tariff barriers and strengthen cooperation in key sectors that both see as important such as renewable energy. The reality too is that both will be looking to hedge where they can against their bigger trading partner, the US, which as of late has been increasingly unpredictable. Read more from Sky News:President Xi's purge is extraordinary - here's why Spying and national security Mr Starmer will have to be careful in any deal that he strikes that he is not exposing the UK to vulnerabilities. Indeed, espionage and state interference will likely be the biggest elephant in the room. How to weigh advantages versus risk is always a challenge for any leader visiting China, but it may be particularly awkward this time as there have been a spate of recent accusations in the UK about alleged Chinese state actors getting close to influential people in public life. The most notable case was, perhaps, a Chinese businessman accused of acting on behalf of China who became a confidant of Andrew Mountbatten-Windsor. The reality is China does have a sophisticated and wide-reaching web of both espionage and influence and has been described by the head of GCHQ as an \"epoch-defining challenge\". While it's reasonably unlikely this will actually come up in the room, Mr Starmer will have to keep a close eye on the reality and the optics. This will matter more than ever as the government has just approved a controversial new Chinese \"mega embassy\" in London, which critics say will act as a base for Chinese spying and could put crucial communication cables at risk. Thorny issues There will also likely be a host of trickier issues raised on which the two fundamentally disagree. Mr Starmer will likely bring up Russia's war in Ukraine. China has always insisted it is neutral in the conflict but has quietly supplied Russia with finance, components and crucial diplomatic cover. The prime minister may ask President Xi to use his leverage with Vladimir Putin to put a stop to the fighting. While President Xi, for his part, might well bring up Taiwan, the self-governing island that China sees as its own and an issue that it wants the West to stay out of. But perhaps the most pressing case will be that of Jimmy Lai, the jailed former media tycoon and one of Hong Kong's most famous pro-democracy voices. Mr Lai is a British citizen and was found guilty by a Hong Kong court of national security offences that the UK sees as politically motivated - can Mr Starmer do anything to secure his release? How does China see things? The reality is that in the grand scheme of China's geopolitical relationships, the UK is not seen as that big a player. It's not even in its top 10 trading partners. It's viewed as too close to the US and it hasn't made the overtures in recent years seen by many of its European counterparts. But despite this, this visit is a moment of huge political opportunity for China. Coming so soon after Donald Trump seriously rocked his relationships with Europe with his threats to seize Greenland, China knows some countries are considering their options. Indeed, the victory for China is as much in the optics of it being seen to rekindle relationships just as Mr Trump is fracturing them, and it all plays nicely into its narrative that it is the more reliable global superpower. To this end, expect some gestures of goodwill such as visa-free travel for Brits, but be in no doubt that China will, as it always does, be playing the long, strategic game. It will not give ground where it doesn't want to and it will be aggressively (if politely) pursuing its own interests, pushing for its advantage amidst the shifting geopolitical picture."
    },
    {
        "title": "'What do you want from me?' Captain in fatal ship collision asks prosecutor ",
        "description": "A captain has been confronted in a trial over the \"serious and obvious\" risk of death posed when his container ship collided with an anchored US oil tanker.",
        "url": "https://news.sky.com/story/what-do-you-want-from-me-captain-in-fatal-ship-collision-asks-prosecutor160-13499703",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-captain-vladimir-motin_7135510.jpg?20260114211139",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-27 16:25:00",
        "Headline": "Russian national Vladimir Motin, 59, had been on sole watch duty last March when the Solong crashed into the Stena Immaculate near the Humber Estuary.",
        "Content": "A captain has been confronted in a trial over the \"serious and obvious\" risk of death posed when his container ship collided with an anchored US oil tanker. Both were laden with flammable goods. Russian national Vladimir Motin, 59, had been on sole watch duty last March when the Solong crashed into the Stena Immaculate near the Humber Estuary. Crew member Mark Angelo Pernia, 38, who was on the bow of the Solong was killed in the incident. When cross-examined by Tom Little KC about whether it had been foreseeable that the Stena Immaculate could have been carrying flammable goods, Mr Motin said, \"Yeah, OK. I understand, but what you want from me?\" He previously stated he had no knowledge of the contents aboard the tanker before the collision. The US tanker, with a crew of 23, was transporting more than 220,000 barrels of JetA1 high grade aviation fuel from Greece to the UK. \n                  Beth Rigby: Why PM's China trip carries real consequence - including for you at home\n                 \n                  Can the UK reset their relationship with China?\n                 \n                  Storm Chandra latest: Rail line to close causes sinkhole\n                 The Solong, with a 14-strong crew, was carrying mainly alcoholic spirits and some hazardous substances. Motin, 59, was challenged at the Old Bailey on Tuesday over a string of alleged failures. \"You collided with Stena Immaculate at 16 knots, metal-on-metal, creating a spark,\" Mr Little said. The defendant replied: \"Spark will always be created.\" \"I suggest the nature of this collision was foreseeable, that there was a serious and obvious risk of death to someone,\" pressed Mr Little. Mr Motin said he couldn't \"make any assumption, yes or no\". Mr Little went on: \"I suggest had you sounded that alarm in time, Mark Pernia would have been able to get out of the bow and he would have survived.\" The prosecutor rejected the defendant's claim that he \"didn't know\" Mr Pernia was on the bow, pointing out that he had been on duty and had been working in that area. Concluding his cross-examination, he said without the collision, nobody would've died - something Motin agreed with. Read more from Sky News:UK authorities help seize 'narco sub'Pubs and music venues to be handed business rates relief The prosecutor suggested Mr Motin did not keep a proper lookout, did not use all the available means to determine the risk of a collision, did not use the radar equipment, and that he did not leave enough time to prevent the crash or slow down. Motin denied these suggestions. Mr Little then suggested Mr Motin could've easily steered away, avoiding a collision. The defendant said he had made a \"mistake\" when attempting to switch to manual control and didn't realise autopilot was still on. Motin has denied manslaughter, and the Old Bailey trial was adjourned until Wednesday."
    },
    {
        "title": "Climbdown or U-turn? Trump changes course",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈&#160; </a>",
        "url": "https://news.sky.com/story/climbdown-or-u-turn-trump-changes-course-13499468",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-trump100-podcast_7146948.jpg?20260127065801",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-27 03:53:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈   The president seems to be changing tack in Minneapolis. He's bringing in Tom Homan, his border tsar. Out goes Border Patrol head Greg Bovino, who some say is now out of a job completely in the administration. Why the climbdown? And is this the start of a lasting change to Trump's ICE policy, or merely a moment of pause before it ramps back up again? And - the president sits down for an interview with New York Magazine about his health. You can watch all episodes on our YouTube channel. Email us on trump100@sky.uk with your comments and questions."
    },
    {
        "title": "US moves captured tanker captain and first officer from UK waters",
        "description": "The captain and first officer of a Venezuela-linked oil tanker captured by American forces have been taken out of UK territory by the US Coast Guard, a court has been told.",
        "url": "https://news.sky.com/story/us-moves-captured-tanker-captain-and-first-officer-from-uk-waters-13499586",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-marina-bella-1-oil-tanker_7135206.jpg?20260127122246",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-27 11:47:00",
        "Headline": "The Marinera, previously known as Bella 1, was seized on 7 January off the coast of Iceland and moved to the Moray Firth in the Scottish Highlands.",
        "Content": "The captain and first officer of a Venezuela-linked oil tanker captured by American forces have been taken out of UK territory by the US Coast Guard, a court has been told. The Russian-flagged Marinera, previously known as Bella 1, was seized on 7 January off the coast of Iceland and moved to the Moray Firth in the Scottish Highlands. On Monday, lawyers acting for Natia Dzadzama, wife of the vessel's captain Avtandil Kalandadze, lodged a petition with the Court of Session in Edinburgh seeking an emergency order to prevent the ship and those on board being removed from the jurisdiction of the Scottish court. In a late-night hearing, Lord Young granted an interim interdict prohibiting the Advocate General for Scotland, the Lord Advocate and Scottish ministers - or anyone acting on their behalf - from removing the captain and the crew of the Marinera from the territorial jurisdiction of the court. However, Lord Young recalled the order on Tuesday, having heard the captain and first officer had already left UK waters. Solicitor General Ruth Charteris KC, representing Lord Advocate Dorothy Bain KC and Scottish ministers, told the court: \"The captain and the first officer are now aboard the US Coast Guard vessel Munro and have departed the United Kingdom's territorial sea. \"This was thought to be the position last night, although I entirely appreciate the information before your lordship was not certain. \n                  How Ukrainians are coping with brutal winter as Russia brings war into people's homes\n                 \n                  Ukraine hits out at Winter Paralympics for lifting ban on Russia\n                 \n                  How close is a peace deal in Ukraine - and have we been here before?\n                 \"However, we received an email from the Department of Justice at 3.04 this morning confirming that that is absolutely the position, so in short they are no longer within the territorial jurisdiction of this court.\" Read more:Tracking oil tanker's attempt to escape seizure by the US The court, sitting virtually, heard how the remaining 26 crew members have left the ship and have been processed at the army reserve centre in Inverness. Ms Charteris said, according to Police Scotland, none of them have claimed asylum. Five wish to travel to the US and 21 want to travel elsewhere, the court heard. Ms Charteris said the group were staying at a hotel in Elgin, Moray, and \"it is hoped that they can proceed with their plans to return to their homes\". The Solicitor General said Scottish ministers and the Lord Advocate have never at any point detained the crew, captain or first officer and have never had them in their control, and no individual has been arrested or detained by any Scottish authority. She said Lord Advocate Ms Bain received a request for mutual legal assistance issued by US authorities on 16 January, which was granted subject to specific assurances and conditions to ensure the safety and wellbeing of the crew. She said it was a key requirement of this that all 28 were to be brought ashore to Scotland. However, the request for mutual legal assistance was withdrawn on Sunday and confirmed in writing the following day, meaning there was nothing the Lord Advocate or Scottish ministers could do about the situation. Solicitor Aamer Anwar, who is acting on behalf of Ms Dzadzama, said the captain and first officer were \"whisked away under the cover of darkness\". He said their removal from Scottish jurisdiction \"could not have occurred without the knowledge and cooperation of United Kingdom authorities\". Mr Anwar added: \"The timing of these removals is particularly troubling. \"They occurred at the same time as a hearing at which the court considered the extent to which a foreign state might claim immunity from interim interdict. \"That immunity is not absolute, a position supported by Supreme Court authority and relied upon in submissions lodged with the court.\""
    },
    {
        "title": "'What do you want from me?' Captain in fatal ship collision asks prosecutor ",
        "description": "A captain has been confronted in a trial over the \"serious and obvious\" risk of death posed when his container ship collided with an anchored US oil tanker.",
        "url": "https://news.sky.com/story/what-do-you-want-from-me-captain-in-fatal-ship-collision-asks-prosecutor160-13499703",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-captain-vladimir-motin_7135510.jpg?20260114211139",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-27 16:25:00",
        "Headline": "Russian national Vladimir Motin, 59, had been on sole watch duty last March when the Solong crashed into the Stena Immaculate near the Humber Estuary.",
        "Content": "A captain has been confronted in a trial over the \"serious and obvious\" risk of death posed when his container ship collided with an anchored US oil tanker. Both were laden with flammable goods. Russian national Vladimir Motin, 59, had been on sole watch duty last March when the Solong crashed into the Stena Immaculate near the Humber Estuary. Crew member Mark Angelo Pernia, 38, who was on the bow of the Solong was killed in the incident. When cross-examined by Tom Little KC about whether it had been foreseeable that the Stena Immaculate could have been carrying flammable goods, Mr Motin said, \"Yeah, OK. I understand, but what you want from me?\" He previously stated he had no knowledge of the contents aboard the tanker before the collision. The US tanker, with a crew of 23, was transporting more than 220,000 barrels of JetA1 high grade aviation fuel from Greece to the UK. \n                  Beth Rigby: Why PM's China trip carries real consequence - including for you at home\n                 \n                  Can the UK reset their relationship with China?\n                 \n                  Storm Chandra latest: Rail line to close causes sinkhole\n                 The Solong, with a 14-strong crew, was carrying mainly alcoholic spirits and some hazardous substances. Motin, 59, was challenged at the Old Bailey on Tuesday over a string of alleged failures. \"You collided with Stena Immaculate at 16 knots, metal-on-metal, creating a spark,\" Mr Little said. The defendant replied: \"Spark will always be created.\" \"I suggest the nature of this collision was foreseeable, that there was a serious and obvious risk of death to someone,\" pressed Mr Little. Mr Motin said he couldn't \"make any assumption, yes or no\". Mr Little went on: \"I suggest had you sounded that alarm in time, Mark Pernia would have been able to get out of the bow and he would have survived.\" The prosecutor rejected the defendant's claim that he \"didn't know\" Mr Pernia was on the bow, pointing out that he had been on duty and had been working in that area. Concluding his cross-examination, he said without the collision, nobody would've died - something Motin agreed with. Read more from Sky News:UK authorities help seize 'narco sub'Pubs and music venues to be handed business rates relief The prosecutor suggested Mr Motin did not keep a proper lookout, did not use all the available means to determine the risk of a collision, did not use the radar equipment, and that he did not leave enough time to prevent the crash or slow down. Motin denied these suggestions. Mr Little then suggested Mr Motin could've easily steered away, avoiding a collision. The defendant said he had made a \"mistake\" when attempting to switch to manual control and didn't realise autopilot was still on. Motin has denied manslaughter, and the Old Bailey trial was adjourned until Wednesday."
    },
    {
        "title": "Pubs and music venues to be handed business rates relief after government U-turn",
        "description": "A U-turn by the Treasury will see pubs and music venues across England and Wales handed temporary relief from the worst of planned rises to business rates.",
        "url": "https://news.sky.com/story/pubs-and-music-venues-to-be-handed-business-rates-relief-after-government-u-turn-13499533",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-rachel-reeve-distillery_7134924.jpg?20260114092414",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-01-27 09:08:00",
        "Headline": "Treasury minister Dan Tomlinson says pubs are a special case, but there's fury more widely over the further squeeze on bottom lines as costs facing businesses continue to grow.",
        "Content": "A U-turn by the Treasury will see pubs and music venues across England and Wales handed temporary relief from the worst of planned rises to business rates. The government has been under pressure to act after changes made in the budget in November, alongside the end of support from the pandemic, meant businesses - and especially pubs - were set to face huge increases in their business rates in April. This, coupled with a hike in the minimum wage and an increase in employer national insurance contributions, led businesses to warn that hundreds of pubs and venues could close without an intervention. Politics latest - follow live Now Treasury minister Dan Tomlinson has announced that there will be a temporary support package for pubs - but nothing for restaurants, soft play centres and cafes. Announcing the changes, he said: \"Pubs are the cornerstone of so many communities, they are essential to the social and cultural life of so many places across the country.\" Mr Tomlinson told the Commons that from April, every pub in England will get 15% off its new business rates bill. Bills will then be frozen in real terms for a further two years. \n                  Money Problem: 'We can't sell our house - and it's our neighbour's fault'\n                 \n                  Government braced for increase in council tax band challenges - here's how to dispute yours\n                 \n                  Fujitsu boss rejects MP's claim firm is 'a parasite on the British state'\n                 Business rates are a tax based on an estimate of a commercial property's rental value. The changes will be worth £1,650 for the average pub over the next year, the minister added - before insisting that around three-quarters of pubs will see their bills fall or stay the same. The support will also apply to music venues, but not recording studios and other hospitality venues. He explained: \"Many live music venues are valued as pubs and many pubs are grassroots live music venues. It would not be right to seek to draw the line so tightly so as to include some and not others.\" Read more:Every Labour government U-turn to date'Very deep poverty' hits 6.8 million in UK Mr Tomlinson also told MPs that the government will launch a review into how pubs are valued, and will allow them to stay open until 1am or 2am for later stage home nation matches during the World Cup this summer, which is being played in North America. The minister added that the government will consult on loosening planning rules for pubs, allowing them to extend their main room or add guest rooms without planning applications. Recognising that \"it's a tough time for other businesses on the high street\", he pointed to an upcoming High Streets Strategy, along with previous financial support for companies. Chancellor Rachel Reeves was not present in the Commons and did not lay out the changes, despite being in the chamber earlier on Tuesday. 'Support must be permanent' Responding to his statement, shadow chancellor Sir Mel Stride asked: \"Is that it?\" Ms Reeves's Conservative opposite number continued: \"After all this time, after weeks of telling our local pubs that help was on the way, this is all they get - a temporary sticking plaster that will only delay the pain for a few, while thousands of businesses despair as their bills skyrocket. \"Support must be permanent. We have to cut business rates for our high streets to give certainty to local businesses, and it must be far wider than what the government has announced today, not just pubs, but the whole of the retail, hospitality and leisure sectors which bring life to our high streets and town centres.\" Meanwhile, the Liberal Democrats labelled it a \"half-hearted U-turn\" and called on ministers to \"apologise to publicans for the months of uncertainty and worry they forced on them\". Daisy Cooper, the party's Treasury spokesperson, added: \"The government must do the right thing and press ahead with the full 20p discount it promised to every retail, hospitality and leisure business, and back our call for an emergency VAT cut for hospitality until April 2027 to save the great British high street.\" 'Restaurants and hotels facing severe challenges' UKHospitality said the minister's announcement was \"welcome\" and showed the government has \"listened to us about the acute cost challenges facing businesses\". But Kate Nicholls, the group's chair, added: \"The rising cost of doing business and business rates increases is a hospitality-wide problem that needs a hospitality-wide solution. \"The reality remains that we still have restaurants and hotels facing severe challenges from successive budgets. They need to see substantive solutions that genuinely reduce their costs. Without that clear action, they will face increasingly tough decisions on business viability, jobs and prices for consumers.\" 'This is pure discrimination' Tom Kiehl, the chief executive of UK Music, told Sky News that the government \"must not forget recording studios\". He explained: \"Why should the studio used to film Hamnet be entitled to business rate relief, yet the studio used to record the soundtrack not be eligible? This is pure discrimination and recording studios must not be treated as poor cousins in the creative economy. The government must think again.\" 'The government must honour its promise of root-and-branch reform' The British Chambers of Commerce responded that the announcement is \"good news for pubs and music venues\" but added that it \"does not go far enough to protect many other businesses which are under huge pressure\". Helen Dickinson, the chief executive of the British Retail Consortium said support should be \" targeted at all those on the high street whose bills will see the biggest rises, whether they are pubs, shops or cafes\"."
    },
    {
        "title": "Freedom Fibre and Truespeed close to finalising altnet merger",
        "description": "Two major broadband altnets are close to finalising a merger that will propel them into the ranks of the sector's largest players amid growing financial pressure to consolidate.",
        "url": "https://news.sky.com/story/freedom-fibre-and-truespeed-close-to-finalising-altnet-merger-13499725",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-broadband-wifi-internet_6977790.jpg?20250730115106",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-27 17:11:00",
        "Headline": "Backed by investors including Aviva and Equitix, the two fibre broadband network providers are in advanced discussions about a tie-up, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Two major broadband altnets are close to finalising a merger that will propel them into the ranks of the sector's largest players amid growing financial pressure to consolidate. Sky News understands that Truespeed and Freedom Fibre are in advanced talks about a tie-up. One industry source cautioned that the negotiations could yet fall apart, but said the two companies could be within days of a deal being struck. If completed, a deal would be the latest in an industry saddled with billions of pounds of debt and at risk of being overrun by a wave of insolvencies. Truespeed has received £175m of funding from Aviva Investors, a division of the FTSE-100 insurer. Its operations are concentrated in the west of England, in areas such as Bath, Somerset and south Gloucestershire, with the company having connected 28,000 customers to its network as of last summer. Last year, Truespeed merged with County Broadband, an altnet focused on East Anglia, to create an operator covering more than 175,000 homes. \n                  Aviva-backed altnet Truespeed in merger talks with rival\n                 \n                  Altnet Zzoomm accelerates hunt for merger partners\n                 \n                  UK's worst areas for broadband outages revealed - and what to do if yours goes down\n                 A further merger with Freedom Fibre would create a group with access to more than 400,000 premises, according to industry analysts. Freedom Fibre, which was launched in 2020, has built a presence in Cheshire and Greater Manchester. In late 2023, it reached agreement to merge with VX UK Holdings, establishing a combined business with more than 285,000 premises passed. Freedom Fibre is backed by blue-chip infrastructure investors such as Equitix and InfraBridge, which is part of New York-listed DigitalBridge Group. A number of altnets have put themselves up for sale in recent months after struggling to raise the new financing required to deliver their standalone delivery plans. Read more from Sky New:Loveholidays targets March launch for £1bn London float600 jobs lost as Revolution bars owner goes into administration The largest player in the sector behind BT Group's Openreach arm, CityFibre, completed a £2.3bn refinancing last year which has left it well-placed to spearhead industry consolidation. The financial strains on the sector have been illustrated by the plight of companies such as G.Network, which had raised hundreds of millions of pounds in debt and equity funding. Focused on central London, it has been sold to Fitzwalter Capital, a distressed debt fund, and it is now expected to be sold again in the near future. Meanwhile, Gigaclear, in which Equitix is also a shareholder, is expected to be taken over by its lenders following a failed sale process, the Financial Times reported last week. Spokespeople for Aviva Investors and Equitix declined to comment."
    },
    {
        "title": "Hundreds of jobs lost as Revolution bars owner enters administration",
        "description": "Nearly 600 jobs have been lost after the owner of Revolution bars went into administration.",
        "url": "https://news.sky.com/story/almost-600-jobs-lost-but-many-saved-as-revolution-owner-enters-administration-13499580",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-revolution-pub_7147223.jpg?20260127120433",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2026-01-27 11:32:00",
        "Headline": "The announcement was made just before the chancellor was due to confirm a partial U-turn on costly business rates changes for the pub industry.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Nearly 600 jobs have been lost after the owner of Revolution bars went into administration. The Revel Collective, which revealed on Monday that it had filed notice of an intention to appoint administrators, said it had since formally appointed FTI Consulting. Venues closing with immediate effect include 14 Revolution bars, six Revolucion de Cuba bars and one Peach Pub - with the loss of 591 jobs. However, FTI confirmed a pair of deals which will secure the future of 41 sites and 1,582 jobs. Money latest: BBC to use iPlayer to catch licence fee evaders The locations of the Revolution sites closing are: Manchester (Oxford Road), Huddersfield, Leicester, Glasgow (Renfield Street), Cardiff, Nottingham, Leeds, Sheffield, Ipswich, Manchester (Parsonage Gardens), Plymouth, Durham, Exeter and Preston. The Revolucion de Cuba sites affected are: Cardiff, Derby, Liverpool, Reading, Harrogate and Aberdeen while the Peach premises to be shut was The Almanack at Kenilworth in Warwickshire. \n                  Pubs and music venues to be handed business rates relief after government U-turn\n                 \n                  Freedom Fibre and Truespeed close to finalising altnet merger\n                 \n                  Energy price cap facing upwards pressure from US storm\n                 The announcement was made shortly before the chancellor was expected to reveal a partial U-turn on business rates changes facing pubs. The industry said they were expected to add almost £13,000 in costs over three years to the average pub in advance of the climbdown. It has battled rising costs for many years, with new minimum pay levels and heightened national insurance contributions adding to the burden last spring. Revel undertook a major restructuring in 2024, shutting 15 unprofitable bars in a bid to turn around its performance. But the revamp fell flat and a strategic review resulted in the group being placed up for sale. Revel had partly blamed weak trading, with younger customers having little disposable income. Higher costs also weighed on its bottom line and growing debt pile."
    },
    {
        "title": "Energy price cap facing upwards pressure from US storm",
        "description": "Energy bills for households and businesses are facing upwards pressure from a surge in wholesale natural gas costs, according to market experts.",
        "url": "https://news.sky.com/story/energy-price-cap-facing-upwards-pressure-from-us-storm-13499160",
        "image_url": "https://e3.365dm.com/22/02/1920x1080/skynews-lng-ship_5674761.jpg?20220215194438",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2026-01-27 06:50:00",
        "Headline": "The impact of the big freeze across large parts of America is having knock-on effects in Europe as US LNG production is hit and supplies are diverted at a time of low storage levels.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Energy bills for households and businesses are facing upwards pressure from a surge in wholesale natural gas costs, according to market experts. Both day-ahead and month-ahead contracts rose further on Monday as high demand and supply disruption in the storm-hit United States take their toll on prices across Europe, crucial not just for gas supply but electricity generation. In the UK, the February delivery figure was up more than 45% over the month to date at one stage on Monday. Some of the price pressures are weather related, while others are structural. Money latest: Criminal barrister talks about 'painfully low' salaries The big freeze in the US has complicated the market as supplies of liquified natural gas (LNG) are delayed and some diverted as 37 states - covering half the country's population - shiver under temperatures below -20C and a deep blanket of snow. The weather-related disruption is predicted to last well into next week. \n                  Pubs and music venues to be handed business rates relief after government U-turn\n                 \n                  Freedom Fibre and Truespeed close to finalising altnet merger\n                 \n                  Hundreds of jobs lost as Revolution bars owner enters administration\n                 Europe has seen a drop in deliveries in recent weeks, the peak winter, which has exacerbated pressure on weak stocks. Gas Infrastructure ⁠Europe data showed that EU gas storage sites were last at 45.6% ‌of capacity, 15 percentage points below the five-year average. It has forced up pipeline costs in the process, with UK day-ahead wholesale costs at an 11-month high. LNG prices had been low and supplies plentiful for much of last year, thanks to weak demand in Asia and a glut of gas despite steep curbs on Russian flows because of its war in Ukraine. Director of Europe Gas & LNG at the industry data specialists Wood Mackenzie, Tom Marsec-Manser, told Sky News: \"Concerns have been rising that by the end of March aggregate storage fullness in Europe will be particularly low. \"To be clear, though, there is no risk of a gas shortage. But higher prices are needed to attract LNG tankers that could otherwise sail to Asian markets.\" He pointed to the bad weather in the US complicating Europe's price pressures, but only in the short term, as extraction was delayed by frozen equipment and supplies diverted to the domestic market for heating and power generation. He said of the outlook: \"In fact, the US will produce more LNG this year than ever before. And we at Wood Mackenzie also forecast that the UK and Europe will in 2026 collectively import more LNG than ever before too. \"Globally, LNG supply is only growing, which is aiding Europe's move away from Russian gas and fuelling the transition in Asia. It will also mean wholesale prices in the UK and Europe will on average be noticeably lower by the end of the decade.\" The prospect of a period of disruption to LNG shipments risks exacerbating the upwards price pressure on pipeline supplies too, particularly as demand across much of northern Europe is predicted to rise due to forecasts of colder temperatures to come. Ofgem, the UK's energy watchdog, will set the next three-month price cap for the start of April in four weeks' time. Any upwards contribution from a raw energy spike should be partly offset by the government's decision to remove £150 of policy costs from bills, though costs associated with improved energy infrastructure have recently been the biggest driver of cap increases. Matt Turner-Tait, senior manager at the consultancy BFY Group, which specialises in energy, said of the gas market pricing: \"The impact further out the curve is much more muted, with Q2 and Q3 prices up closer to 15%, which tells us this is a short-term squeeze rather than a shift in longer-term fundamentals. \"For consumers, the effect on the April 2026 price cap is thankfully limited, as most of the observation window has already passed, adding only around £20 to our forecast so far. \"If prices stay elevated, there is greater risk to later cap periods, but that remains highly uncertain at this stage.\""
    },
    {
        "title": "Millions to benefit as minister announces cap on 'scam' ground rents",
        "description": "Ground rents for leaseholders will be capped at &#163;250 a year before dropping to a peppercorn rent after 40 years, Steve Reed has announced.",
        "url": "https://news.sky.com/story/millions-to-benefit-as-minister-announces-cap-on-scam-ground-rents-13499497",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-roofs-housing-estate_7073456.jpg?20251106082454",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-01-27 08:36:00",
        "Headline": "Implementing the manifesto commitment will be seen as a victory for Angela Rayner - but the chancellor has warned it could deter pension fund investments.",
        "Content": "Ground rents for leaseholders will be capped at £250 a year before dropping to a peppercorn rent after 40 years, Steve Reed has announced. The housing secretary confirmed the move on Tuesday morning, hitting out at ground rents as a \"a bit of a scam\", \"a racket\" and \"paying money for nothing\". Ground rents are a charge that leaseholders pay to live on land they do not own. It does not require a service in return and is regarded by critics as emblematic of the feudal nature of England's centuries-old leasehold system. Politics latest - follow live Under the new changes, ground rents will be capped from 2028, before dropping to a nominal amount, which Mr Reed told Sky News will \"lead to abolition\" of ground rents altogether. The reforms will also see new leasehold flats banned, while existing leaseholders will get the right to switch to commonhold. There are currently around five million leaseholders in England and Wales. Announcing the move, the housing secretary told Mornings with Ridge and Frost: \"People have been campaigning to abolish this for decades. So today is quite a historic moment for leasehold reform because this government is going to do what we said in our manifesto. \"Once that comes into force - and it'll happen in this parliament - nearly a million people are going to see their ground rents reduced and nearly five million people will know that their ground rents will never go above £250.\" Mr Reed also confirmed that his junior colleague, Matthew Pennycook, will formally unveil the changes, as part of the Commonhold and Leasehold Reform Bill, in the Commons later on Tuesday. When challenged that leaseholders continue to face other expensive costs and expenses, Mr Reed replied: \"We launched a consultation last summer about the service charges leaseholders have to pay... 'Fleecehold', a lot of people call it, because they feel they're being literally fleeced of their money without ever being told what the money is being used for. \"We're going to change all of that and announcements will be made following the consultation over coming weeks.\" Other reforms being introduced include the scrapping of forfeiture, where leaseholders can lose their home and the equity they built up by defaulting on debts, while a new enforcement regime will be introduced, which the government hopes will be fairer. The commonhold system will also be revamped, giving homeowners a stake in the ownership of their building and more control over how it is managed and the bills they pay. Success for Angela Rayner but no joy for Rachel Reeves The decision will be seen as a victory for former deputy prime minister Angela Rayner, who championed capping ground rents while in government. Sir Keir Starmer, who formally announced the move first in a video on TikTok, will have also pleased his party's backbenchers by implementing the manifesto commitment - despite cabinet splits. The government has been facing heat from some Labour MPs who feared ministers might not introduce the reforms in full, and were warning this would amount to a \"betrayal\". But Chancellor Rachel Reeves is said to be against the move, as she believes that capping ground rents will deter pension fund investors. The Conservatives scrapped ground rents on new leasehold properties and were planning to cap existing ones but ran out of time before the 2024 general election. They previously argued that less than 1% of pension fund assets were invested in residential property. Andrew Griffith, the shadow business secretary, told Sky News on Tuesday that his party \"did an awful lot to improve the lot of leaseholders [when in government] but I accept there's more that needs to be looked at\". The senior Tory added: \"There's an important balance between protecting people's pensions and a pension fund that sound academic, but it's actually people's pensions themselves as well.\" Meanwhile, the Liberal Democrats have called on the government to go further, demanding \"an end to the absurd, feudal system of leasehold for good\". \"People are being fleeced by a system that restricts their rights in a way that is indefensible in the 21st century,\" they added. Zack Polanski, the Green Party leader, echoed those calls, saying: \"Time for government to stop tinkering around the edges and scrap leasehold altogether.\" Reacting to the move, the Residents Freehold Association has warned that the inclusion of a rent cap is a \"wholly unjustified interference with existing property rights\" and will \"seriously damage investor confidence in the UK housing market\". A spokesperson for the group added: \"The government's draft bill will tear up long-established contracts and property rights, which are pillars of the UK's investment reputation. The resulting forced exit of professional freeholders from the sector, will hinder building safety projects and disrupt the day-to-day lives of residents.\" They have urged the government to focus on regulating managing agents and improving transparency for leaseholders instead."
    },
    {
        "title": "Loveholidays targets March launch for £1bn London float",
        "description": "The owner of Loveholidays, one of Britain&#8217;s biggest online travel agents (OTAs), has added to the syndicate of banks preparing to help it launch a spring stock market listing in London.",
        "url": "https://news.sky.com/story/loveholidays-targets-march-launch-for-1631bn-london-float-13499566",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-istock-pool-holiday_6994452.jpg?20250818131415",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-27 11:01:00",
        "Headline": "The online travel agent, owned by private equity firm Livingbridge, has added Investec to the line-up of banks aiming for a spring stock market listing, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of Loveholidays, one of Britain’s biggest online travel agents (OTAs), has added to the syndicate of banks preparing to help it launch a spring stock market listing in London. Sky News has learnt that Investec is working alongside Barclays and JP Morgan on the initial public offering, which could be unveiled as early as March, according to City sources. A successful stock market debut for a prominent brand such as Loveholidays would deliver a boost to the London stock market, which has struggled to win major listings in recent years. One insider said that while a March launch date was being prepared for, it could yet be delayed depending on market conditions. Money latest: BBC to use iPlayer to catch licence fee evaders Loveholidays has been backed by Livingbridge since 2018, and has seen its financial performance improve markedly since the Covid pandemic threw the travel industry into chaos. The company specialises in trips to the Greek islands, mainland Spain and the Canary Islands, and boasts that its inventory of 35,000 hotels and 99% of all flights result in 500 billion possible holiday packages. \n                  Pubs and music venues to be handed business rates relief after government U-turn\n                 \n                  Freedom Fibre and Truespeed close to finalising altnet merger\n                 \n                  Hundreds of jobs lost as Revolution bars owner enters administration\n                 It reportedly saw pre-tax profits rise by a fifth to £67.6m on sales of £284m in the year to October 2024. Along with OnTheBeach and TUI, Loveholidays ranks among the UK's biggest OTAs and has been a big winner from the post-pandemic resurgence in demand from holidaymakers. Founded in 2012, the company organised the holidays of more than 5 million Britons in 2024. It also operates in Ireland, Austria, Germany and the Netherlands. Livingbridge, the private equity firm which owns Loveholidays, is also working with Rothschild to help coordinate plans for the initial public offering (IPO). Both Loveholidays and Livingbridge declined to comment."
    },
    {
        "title": "Number of people in 'very deep poverty' at highest level in more than 30 years, charity warns",
        "description": "The number of people living in \"very deep poverty\" in the UK is at the highest level in more than 30 years, a charity has warned.",
        "url": "https://news.sky.com/story/number-of-people-in-very-deep-poverty-at-highest-level-in-more-than-30-years-charity-warns-13499465",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-istock-poverty-poor_7146902.jpg?20260127032251",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-01-27 01:34:00",
        "Headline": "Very deep poverty is defined by the Joseph Rowntree Foundation as earning below 40% of the median household income. According to its latest report, 6.8 million people - almost half of all of those in poverty - were considered to be at that level.",
        "Content": "The number of people living in \"very deep poverty\" in the UK is at the highest level in more than 30 years, a charity has warned. In its latest report, the Joseph Rowntree Foundation (JRF) said data up to the end of the 2023/24 financial year shows more than one in five people in the UK, around 14.2 million, are in poverty. That figure is a slight drop from last year, but the charity said: \"Scratch below the surface, there are signs of change: a definitive deepening of poverty.\" It noted that in 2023/24, 6.8 million people - almost half of all of those in poverty - were considered to be in \"very deep poverty\". The JRF said it is both the highest absolute number and the highest proportion of people in \"very deep poverty\" on record since it started tracking government data in 1994/95. While the JRF notes \"there is no single best measure of poverty\", criteria can include relative income poverty, which holds the line as being for those earning roughly 60% of the median household income. Under this, deep poverty is defined as households earning below 50% of the median income, and very deep poverty as below 40%. According to the Office for National Statistics, the median household income in the UK as of April 2024 is £36,700. This would mean that poverty would see household income at around £22,070, while \"very deep\" poverty would be considered as below £14,680. The report, called UK Poverty 2026, uses the latest data from up to the end of the 2023/24 financial year, just before Labour won that year's general election. Warning on child poverty after benefit cap removed In it, the JRF also warned that progress on tackling child poverty from the government removing the two-child benefit cap will likely stall after April if no follow-up measures are announced. While it praised the decision to remove the limit, calling it \"the single most effective policy decision the government could have taken\", the charity has also warned that, according to Office for Budget Responsibility projections, the headline poverty rate \"will remain broadly unchanged\", at 21.3% in 2026 and 21.1% in 2029. It also said the Labour government's child poverty strategy \"is focused on just one part of the picture… this leaves many other groups with persistently high levels of poverty overlooked\". JRF chief analyst Peter Matejic said \"poverty in the UK is still not just widespread, it is deeper and more damaging than at any point in the last 30 years\". \"When nearly half of the people in poverty are living far below the poverty line, that is a warning sign that the welfare system is failing to protect people from harm,\" he added. \"There can be no national renewal if deep poverty remains close to record levels.\" Read more from Sky News:Will renewable licences put off budding police officers?UK loses measles elimination status'I know he took his own life - I don't understand why' A government spokesperson said: \"We understand that too many families are struggling, and we are taking decisive action to address poverty by boosting the national living wage by £900, cutting energy bills by £150 from April, and launching a £1bn crisis and resilience fund to help households stay afloat. \"As this report acknowledges, scrapping the two-child limit alongside our wider strategy will lift 550,000 children out of poverty by 2030 - the biggest reduction in a single parliament since records began.\" Liberal Democrat work and pensions spokesperson Steve Darling also said the report was a \"devastating indictment of the previous Conservative government's neglect for the most vulnerable in our society\". He added: \"We need immediate action on the cost of living from this government to bring down energy bills, build more affordable homes, and end this misery once and for all.\""
    },
    {
        "title": "Beth Rigby: Why PM's China trip carries real consequence - including for you at home",
        "description": "Sir Keir Starmer's January has been the stuff of nightmares.",
        "url": "https://news.sky.com/story/why-sir-keir-starmers-reset-moment-with-china-carries-consequence-13499749",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer-xi-jinping_7060651.jpg?20260128010326",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2026-01-27 18:25:00",
        "Headline": "Sir Keir Starmer will have to walk a tightrope during his trip to China, as he tries to drive investment from Beijing, while avoiding upsetting US President Donald Trump.",
        "Content": "\n          Political editor\n              @BethRigby\n Sir Keir Starmer's January has been the stuff of nightmares. It kicked off with the crisis over Greenland and rift with Donald Trump - and was followed by a dose of psychodrama over the Labour leadership courtesy of Andy Burnham and that unwanted by-election. This week will be another high-stakes one for the prime minister as he heads to China to look for deeper trade ties against the backdrop of a volatile US and domestic resistance to Beijing at home. \"Like it or not, China matters for the UK,\" he declared ahead of the trip. \"As one of the world's biggest economic players, a strategic and consistent relationship with them is firmly in our national interest. \"That does not mean turning a blind eye to the challenges they pose - but engaging even where we disagree.\" Read more from Sky News:What's on the table in PM-Xi talks? This visit has been a year in planning and will be a big symbolic moment, if rather ill-timed, given the troubles he's facing in his own backyard. Starmer will be the first UK prime minister to visit China since Theresa May in 2018. His goal is to try to drum up trade with the world's second-biggest economy. He hopes this will help spur the economy and help Labour make an impact on the cost of living - now his number one priority for government. His challenge is to navigate that while not triggering Trump. Just days ago, the US president threatened a 100% tariff on Canada if PM Mark Carney did a trade deal with Beijing. He will also have to face down criticism at home as the political consensus hardens against China due to concerns over national security threats and human rights. It's been over a decade since David Cameron hailed a \"golden era\" of close economic relations with China, as the UK hosted President Xi Jinping on a state visit. From golden age to ice age Since that period, relations between the two nations cooled amid concerns over national security and Chinese espionage, China's alliance with Russia, human rights abuses of the Uyghur population, and the crackdown on democracy in Hong Kong. The controversy around the government's approval of a Chinese mega-embassy last week - after years of delay - is a reflection of the deep unease many feel about an expanding Chinese footprint in the UK. It has not been well received by Washington, which believes the embassy will allow for widespread spying, and was opposed by a number of MPs across the House. Read more from Sky News:Everything we know about new Chinese embassy That is why this reset moment, spearheaded by Starmer, carries consequence. He must navigate both those economic opportunities while managing critical matters of national security and an increasingly fractious geopolitical backdrop. In an interview with Bloomberg on the eve of his trip, the prime minister said he wanted to take a \"more consistent\" approach to China rather than \"veering from a Golden Age to an Ice Age\" as he insisted the UK did not have to compromise on national security to pursue business interests (those opposed to the mega-embassy disagree). On the economic opportunities, the prize is clear: the UK wants to do more trade with the world's second-biggest economy, and the PM will be taking a delegation of 60 business and cultural leaders with him to that end. What does Starmer want from China? China is already the UK's third-largest trading partner and supports 370,000 jobs. Starmer wants to do more. In the global context, the reset with China will, of course, carry risk with Trump, but the recent actions and behaviour of the US president, who sparked a national outpouring of anger after denigrating British servicemen who lost their lives fighting alongside US troops in Afghanistan, can only help the UK's case when it comes to China. Be it Trump's ambivalence over NATO, aggression towards Greenland, threats of tariffs or hostility to the UK and European allies, the US has turned from the cornerstone of the post-war order to an unreliable ally. In an increasingly tense space between two global powers, middle powers like the UK can no longer seek sanctuary under the umbrella of the US and need to navigate a more complex path: in recent months, the leaders of the EU, France's Macron and Germany's Merz have all beaten a path to Xi's door. For the PM's part, he insists the UK can maintain its relationship with its closest ally, the US, while pursuing trade opportunities with China, without being forced to choose between the two. \"I'm often invited to simply choose between countries. I don't do that,\" he told Bloomberg. \"We've got very close relations with the US, of course we want to, and we will maintain that business, alongside security and defence.\" For China's part, it wants better access to UK markets, be that in investments or exports. It will also want to depoliticise a relationship that has in recent years been dominated by questions of security threats and the status of Hong Kong. In a sign of the growing warmth between London and Beijing, officials said Starmer would work with China on illegal migration and more financial co-operation. Starmer is sometimes in private rather prickly about the tag \"never here Keir\", and tells colleagues that these international trips are all about, and only about, delivering for the public - be it on trying to deal with illegal migration with the Germans or the French, or trying to put more money in the pockets of working people through seeing off the worst of Trump's tariffs, or trying to drum up business. Dealing with China will, of course, come with controversy and risks, leaving the impression that the prime minister cares more about globe-trotting than the domestic grind. Even as he prepares to fly to Beijing, the government this week is trying to highlight freezing prescription charges, announcing plans to cap ground rents - delivering on a manifesto pledge while also trying to placate MPs - and an £80m support package for pubs after the business rates backlash. Can PM turn things around? It's been hard for Starmer to make much progress on the cost of living message in between the drama of Trump and then Burnham, but government insiders tell me that, at last, polling is beginning to improve for Labour with people that are feeling the benefits of some of their cost of living initiatives, be it breakfast clubs, free childcare or their decision to lift the two-child benefit cap. For a prime minister acutely aware of his domestic fragility, with the public and his party, a five-day trip to China right now will do little to steady the nerves. There are many in the party mutinous over Starmer's decision to block Burnham from standing in the Gorton and Denton by-election. The prime minister is not in a good place to try to lead from the front and charm in the tearooms when he is 5,000 miles away. But as he struggles with the politics, he is pressing on with trying to secure some delivery on the pledges he made when he won the election. His calculation is that more business with the world's second-biggest economy will help him do that - and could ultimately give him some much-needed help back home."
    },
    {
        "title": "PM's future is at stake in pivotal by-election of his own making",
        "description": "Sir Keir Starmer has created, from nowhere, a pivotal by-election by his own hand. ",
        "url": "https://news.sky.com/story/pms-future-is-at-stake-in-pivotal-by-election-of-his-own-making-13499842",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-sir-keir-starmer-andy-burnham_7146288.jpg?20260126132937",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2026-01-27 22:22:00",
        "Headline": "Labour are under pressure from their left via the Greens and their right via Reform. It conjures up the possibility the party could even come third in a seat they've held since before the Second World War, after Andy Burnham was blocked from standing.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Sir Keir Starmer has created, from nowhere, a pivotal by-election by his own hand.  He owns the outcome, because of his decision to block Andy Burnham - someone voters on the streets of Denton and Gorton thought by far to be the strongest candidate. And nobody can anticipate the result, which Labour MPs think could trigger a coup against the prime minister should Labour come third. Read more:PM defends Burnham blockReform and Greens eye major by-election scalp The east Manchester seat, with a 13,000 majority, has been Labour since before the Second World War, once regarded as an irredeemably poor, post-industrial area that was home to railway workers. While some parts remain poor, others are the beneficiary of the economic improvement of Greater Manchester as a whole, as well as an area that has seen the upside of Emirati millions around the adjacent Manchester City stadium. And as such, it is a melting pot of many differing communities, once united by Labour politics. On 26 February, we will see if this remains the case. Pressure from left and right The constituency, northeast of the city, is shaped like a hammer, according to Rob Ford, the Manchester University political scientist. The handle of the hammer, in the south of the seat, has several wards that are very ethnically diverse, large Muslim populations, but also large populations of students and young graduates. \"That looks like exactly the kind of territory where Labour has been losing support to the Greens in national polling recently,\" said Ford. Towards the head of the hammer, which is Gorton, and the wards in Tameside, it's much whiter, 90% white, and much more working class, with fewer graduates. \"That looks like the kind of terrain where Labour has been losing ground to Reform recently,\" Ford said. Labour MPs up to Andrew Gwynne, who stepped down on Thursday, were sufficiently able to unite both parts of the community to ensure the seat was perpetually Labour. But with politics fracturing, populism rising, could a new approach work? Professor Ford said: \"You've got very different, highly charged local issues in the two halves of the seat. In the Manchester part, the more Muslim and at young professional part, there'll be a lot of campaigning on Gaza, particularly with the Workers Party picking up a high-profile candidate in the Gorton part. \"You may see a lot of quite polarising identity politics from Reform UK, potentially on issues like crime, grooming, gangs, immigration and so forth.\" All of which point to a campaign led by Reform slugging it out with the Greens, and none of that looks like the campaign Starmer's Labour would run. As the leader of Manchester City Council, the choice of many Labour MPs, also ducks this race, it is less clear given the national political backdrop how the party can hang on. Joshi Herman, founder of the Manchester Mill, a journalism website with deep links in the community, said: \"I think if Andy Burnham had been the Labour candidate, they would have been strong favourites to win here.\" While not guaranteed due to the national polling picture, he says Burnham is a \"very popular mayor, and he goes down well in places like this\". A test for Polanski But can the Greens, the face of the populist left, inhabit a space that even Burnham voters might be attracted to? At a rally on Tuesday night, Zack Polanski called this the \"blockbuster\" by-election of this parliament - as he commenced his first electoral test as leader. Translating membership numbers and polling figures into a real result would be a massive coup for the Green leader, who is pitching to be the heir to Jeremy Corbyn's shade of Labour Party. He had three times the number of supporters as the lunchtime unveiling of Reform UK's candidate. But can the Greens show they are a party of the north as well as the southern middle class? Meanwhile, Reform unveiled academic and TV pundit Matt Goodwin as their candidate. They mentioned but did not dwell on more contentious, populist campaign techniques like grooming gangs in their news conference, instead preaching to voters who think Britain is broken and only their brand of radicalism can fix it. But the big question is just how hard Labour will try to win, given the prime minister's own future is at stake. They could throw everything at it - Angela Rayner is a neighbour, along with Lisa Nandy and chief whip Jonathan Reynolds. Starmer himself could go. Do they put in the money, and force the visits, that they did in Batley and Spen, the last time the Labour leader's future was on the line in a by-election? Or do they quietly let this one slip, knowing it's a diversion and a costly lost cause, whatever the consequence? All this is at stake on 26 February. It is clear that what matters will be how this by-election is fought, not just who wins on the night."
    },
    {
        "title": "Pubs and music venues to be handed business rates relief after government U-turn",
        "description": "A U-turn by the Treasury will see pubs and music venues across England and Wales handed temporary relief from the worst of planned rises to business rates.",
        "url": "https://news.sky.com/story/pubs-and-music-venues-to-be-handed-business-rates-relief-after-government-u-turn-13499533",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-rachel-reeve-distillery_7134924.jpg?20260114092414",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-27 09:08:00",
        "Headline": "Treasury minister Dan Tomlinson says pubs are a special case, but there's fury more widely over the further squeeze on bottom lines as costs facing businesses continue to grow.",
        "Content": "A U-turn by the Treasury will see pubs and music venues across England and Wales handed temporary relief from the worst of planned rises to business rates. The government has been under pressure to act after changes made in the budget in November, alongside the end of support from the pandemic, meant businesses - and especially pubs - were set to face huge increases in their business rates in April. This, coupled with a hike in the minimum wage and an increase in employer national insurance contributions, led businesses to warn that hundreds of pubs and venues could close without an intervention. Politics latest - follow live Now Treasury minister Dan Tomlinson has announced that there will be a temporary support package for pubs - but nothing for restaurants, soft play centres and cafes. Announcing the changes, he said: \"Pubs are the cornerstone of so many communities, they are essential to the social and cultural life of so many places across the country.\" Mr Tomlinson told the Commons that from April, every pub in England will get 15% off its new business rates bill. Bills will then be frozen in real terms for a further two years. \n                  Money Problem: 'We can't sell our house - and it's our neighbour's fault'\n                 \n                  Government braced for increase in council tax band challenges - here's how to dispute yours\n                 \n                  Fujitsu boss rejects MP's claim firm is 'a parasite on the British state'\n                 Business rates are a tax based on an estimate of a commercial property's rental value. The changes will be worth £1,650 for the average pub over the next year, the minister added - before insisting that around three-quarters of pubs will see their bills fall or stay the same. The support will also apply to music venues, but not recording studios and other hospitality venues. He explained: \"Many live music venues are valued as pubs and many pubs are grassroots live music venues. It would not be right to seek to draw the line so tightly so as to include some and not others.\" Read more:Every Labour government U-turn to date'Very deep poverty' hits 6.8 million in UK Mr Tomlinson also told MPs that the government will launch a review into how pubs are valued, and will allow them to stay open until 1am or 2am for later stage home nation matches during the World Cup this summer, which is being played in North America. The minister added that the government will consult on loosening planning rules for pubs, allowing them to extend their main room or add guest rooms without planning applications. Recognising that \"it's a tough time for other businesses on the high street\", he pointed to an upcoming High Streets Strategy, along with previous financial support for companies. Chancellor Rachel Reeves was not present in the Commons and did not lay out the changes, despite being in the chamber earlier on Tuesday. 'Support must be permanent' Responding to his statement, shadow chancellor Sir Mel Stride asked: \"Is that it?\" Ms Reeves's Conservative opposite number continued: \"After all this time, after weeks of telling our local pubs that help was on the way, this is all they get - a temporary sticking plaster that will only delay the pain for a few, while thousands of businesses despair as their bills skyrocket. \"Support must be permanent. We have to cut business rates for our high streets to give certainty to local businesses, and it must be far wider than what the government has announced today, not just pubs, but the whole of the retail, hospitality and leisure sectors which bring life to our high streets and town centres.\" Meanwhile, the Liberal Democrats labelled it a \"half-hearted U-turn\" and called on ministers to \"apologise to publicans for the months of uncertainty and worry they forced on them\". Daisy Cooper, the party's Treasury spokesperson, added: \"The government must do the right thing and press ahead with the full 20p discount it promised to every retail, hospitality and leisure business, and back our call for an emergency VAT cut for hospitality until April 2027 to save the great British high street.\" 'Restaurants and hotels facing severe challenges' UKHospitality said the minister's announcement was \"welcome\" and showed the government has \"listened to us about the acute cost challenges facing businesses\". But Kate Nicholls, the group's chair, added: \"The rising cost of doing business and business rates increases is a hospitality-wide problem that needs a hospitality-wide solution. \"The reality remains that we still have restaurants and hotels facing severe challenges from successive budgets. They need to see substantive solutions that genuinely reduce their costs. Without that clear action, they will face increasingly tough decisions on business viability, jobs and prices for consumers.\" 'This is pure discrimination' Tom Kiehl, the chief executive of UK Music, told Sky News that the government \"must not forget recording studios\". He explained: \"Why should the studio used to film Hamnet be entitled to business rate relief, yet the studio used to record the soundtrack not be eligible? This is pure discrimination and recording studios must not be treated as poor cousins in the creative economy. The government must think again.\" 'The government must honour its promise of root-and-branch reform' The British Chambers of Commerce responded that the announcement is \"good news for pubs and music venues\" but added that it \"does not go far enough to protect many other businesses which are under huge pressure\". Helen Dickinson, the chief executive of the British Retail Consortium said support should be \" targeted at all those on the high street whose bills will see the biggest rises, whether they are pubs, shops or cafes\"."
    },
    {
        "title": "Ministers left in tears as Holocaust survivor Mala Tribich makes speech at Number 10",
        "description": "Ministers were left in tears after a Holocaust survivor delivered a speech to the cabinet at Number 10 for the first time ever.",
        "url": "https://news.sky.com/story/ministers-left-in-tears-as-holocaust-survivor-mala-tribich-makes-speech-at-number-10-13499620",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-mala-tribich-cabinet_7147289.jpg?20260127130806",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-27 14:40:00",
        "Headline": "Mala Tribich, 95, received a standing ovation after demanding action to tackle antisemitism.",
        "Content": "Ministers were left in tears after a Holocaust survivor delivered a speech to the cabinet at Number 10 for the first time ever. Mala Tribich, 95, demanded that the government's top ministers do \"everything to tackle antisemitism\" after being left \"shaken to the core\" by recent terror attacks in Manchester and Sydney. Some were so moved by the speech that they had to lower their heads and dry their eyes. Mrs Tribich had been sent to the Bergen-Belsen death camp with her younger cousin when she was around 14-years-old, spending three months there until it was liberated by British troops. She told the cabinet, on Holocaust Memorial Day: \"I sit before you as one of the last remaining eyewitnesses to one of the darkest chapters in human history. \"I'm here as a representative of the British Holocaust survivor community. For decades, we have spoken to people across the country, sharing our painful memories. \"Soon, there will be no eyewitnesses left. \"That is why I ask you today not just to listen, but to become my witnesses.\" The rousing five-minute speech on Tuesday was met with a standing ovation. Prime Minister Sir Keir Starmer told her: \"You are the first Holocaust survivor ever to address the cabinet in this country, and so it really is an incredible occasion. \"All of us, myself included, are humbled by your courage and inspired by your story. \"It is our duty not just to hear and listen, but also to act and to absolutely deal with anybody who tries to deny or distort what happened in the Holocaust.\" Mrs Tribich had largely been incapacitated by typhus during her stay at the brutal death camp. Her mother and eight-year-old sister were murdered by the Nazis in a local forest. Tens of thousands of people, including diarist Anne Frank, died at the Nazi camp in northern Germany, which was liberated by the British on 15 April 1945. Mrs Tribich, who was made an MBE in 2012 for services to education, shares her testimony in schools and colleges across the UK. She said: \"We survivors never imagined we would witness antisemitism at the level it is today. \"What we have seen in Manchester, and Sydney on Hanukkah has shaken us to the core. \"How, 81 years after the Holocaust, can these people once again be targeted in this way? \"Remembering the past is no longer enough. \"I speak to you, leaders of this country I proudly call home, and I plead that you do what needs to be done.\" Read more from Sky News:Storm Chandra hits UKWhite House changes tone on ICE crackdown Sir Keir thanked Mrs Tribich for her \"powerful words\", and said the government would do \"everything to tackle antisemitism wherever it reared its ugly head\". Karen Pollock CBE, chief executive of the Holocaust Educational Trust, added: \"Mala, and survivors like her, share their stories in the hope that the next generation will always know what happened during the darkest days in our shared memory, acting as a memorial to the six million Jewish men, women and children who were murdered by the Nazis. \"As the Holocaust passes from living memory into history, today's meeting with the prime minister and cabinet is a poignant reminder of the responsibility to confront anti-Jewish hatred and ensure that the legacies of Holocaust survivors endure.\""
    },
    {
        "title": "Rwanda suing UK over scrapped deportation scheme",
        "description": "Rwanda is suing the UK for failing to formally terminate the controversial agreement.&#160;",
        "url": "https://news.sky.com/story/rwanda-suing-uk-over-scrapped-deportation-scheme-13499633",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-migrants-small-boats_7008741.jpg?20250901214348",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-27 14:20:00",
        "Headline": "The east African country is seeking £50m in compensation after the UK failed to formally terminate the controversial agreement, The Telegraph reported.",
        "Content": "Rwanda is suing the UK for failing to formally terminate the controversial agreement.  It emerged on Tuesday that the east African country is seeking £50m in compensation, The Telegraph reported. The Rwanda scheme would have involved some asylum seekers being sent to Rwanda to have their asylum claims processed there. Following news of the lawsuit, Downing Street defended its decision to end the scheme, saying it had been a \"complete disaster\". Read more:Labour's immigration reforms at a glanceAsylum hotel migrant evictions set to begin in the spring The prime minister's official spokesman said: \"The Rwanda scheme was a complete disaster. It wasted £700 million of taxpayer cash to return just four volunteers. \"The truth is that 84,000 people crossed the Channel from the day the Rwanda deal was signed to the day it was scrapped. It was never a deterrent. \n                  Beth Rigby: Why PM's China trip carries real consequence - including for you at home\n                 \n                  Can the UK reset their relationship with China?\n                 \n                  Storm Chandra latest: Rail line to close causes sinkhole\n                 \"We will robustly defend our position to protect British taxpayers, and we're getting on with the job of focusing on effective ways to stamp out illegal migration, not costly gimmicks. \"And as I've said, we've removed under this Government almost 50,000 people who were here illegally. \"And more broadly, the Home Secretary set out the most sweeping reforms to tackling illegal migration in modern times to remove the incentives which draw people to the UK illegally, increase removals of those with no right to be on British soil.\" Rwanda has launched arbitral proceedings against the UK through The Hague-based Permanent Court of Arbitration. Rwanda began the inter-state arbitration proceedings under the asylum partnership agreement in November, according to the Netherlands-based court's website, which lists the case status as pending."
    },
    {
        "title": "Reform and Greens eye major by-election scalp amid Burnham row",
        "description": "Reform UK and the Green Party are eyeing victory in 2026's first parliamentary by-election, as Sir Keir Starmer faces internal revolt over the decision to block Andy Burnham from standing for Labour.",
        "url": "https://news.sky.com/story/reform-and-greens-eye-major-by-election-scalp-amid-burnham-row-13499469",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-andy-burnham-by-election_7146353.jpg?20260126141102",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-27 04:05:00",
        "Headline": "More than 50 Labour MPs have written to the PM expressing their \"anxiety and anger\" at the decision to block popular Greater Manchester mayor Andy Burnham from standing in Gorton and Denton.",
        "Content": "Reform UK and the Green Party are eyeing victory in 2026's first parliamentary by-election, as Sir Keir Starmer faces internal revolt over the decision to block Andy Burnham from standing for Labour. The Gorton and Denton by-election is to take place on 26 February. Politics Hub: Follow the latest It was called after suspended Labour MP Andrew Gwynne decided to stand down, and many saw it as a chance for the ambitious and popular Mr Burnham to return to Westminster. But Labour's ruling National Executive Committee has decided not to allow him to run for the seat, which is located in Greater Manchester, therefore ending - for now at least - any chance of a leadership bid. The prime minister defended the decision, saying it would have diverted party resources away from May's local elections, and potentially force another by-election for Mr Burnham's mayoralty. Sky's chief political correspondent Jon Craig said in a meeting of the Parliamentary Labour Party on Monday night, the attorney general - a key ally of Sir Keir - had to bat off \"plenty of gripes\" from MPs about the decision. Craig said many believe the prime minister \"has bungled this badly\", treating Mr Burnham \"unfairly\" and also \"made himself weaker\". Attorney General Lord Hermer told colleagues he did not underestimate the challenge the party faced, but insisted the government's policies will \"take hold\" and \"change this country for the better and for the long-term\". It is now understood that more than 50 Labour MPs from across the party have written to Sir Keir Starmer about the decision, warning it has left them with a \"huge amount of anxiety and anger\". In the letter, they added losing the Gorton and Denton seat to Reform UK would be \"unimaginable\" and is an issue \"all of us must now take very seriously\". \"This decision is a real gift to Nigel Farage,\" the letter continues. It calls on the PM to reconvene the NEC and reconsider the decision, stating there is \"no legitimate reason\" why Mr Burnham should not have been able to run, and that blocking him risks \"the idea that politics is a remote stitch-up from a small group of people at the very top in London\". A second, separate letter has also been sent to Sir Keir about the same issue, this time by the seven MPs on the executive committee of the Tribune group, a caucus within the party. Only Burnham would do a better job as PM than Starmer The anger over the NEC's decision comes as an exclusive poll for Sky News has revealed that only Mr Burnham would do a better job as prime minister than Sir Keir. Thirty per cent of the general public polled thought Mr Burnham would do a better job, while 12% thought he would do a worse job. Other leading potential leadership contenders all came out worse, in a boost for the PM. Only 12% thought former deputy prime minister Angela Rayner would do a better job, vs 37% a worse job. Health Secretary Wes Streeting would do a worse job, according to 19% of those polled, versus 12% who thought he would be better. While 22% of people polled thought Home Secretary Shabana Mahmood would do a worse job, as opposed to 8% who thought she would do a better job. What happened last time? Labour won the Gorton and Denton seat with a majority of 13,413 in the 2024 general election - over half the vote. Reform came second on 14.1%, and the Greens were third with 13.2%. Both believe they can win when voters go to the polls next month. Labour face 'anti-Starmer vote' Nigel Farage said his party will announce its candidate today, and that \"an anti-Keir Starmer vote\" will prove crucial. \"There would have been a pro-Burnham anti-Starmer vote, that won't be there any more, and I think the anti-Starmer vote will come to us,\" he said. Read more from Sky News:Farage says he's uniting the right. Really? Sky's political correspondent Alexandra Rogers understands the Greens will announce a candidate on Sunday, but leader Zack Polanski will not be standing. While he has a claim to northern roots (he was born in Salford), Polanski lives in Hackney, north London, and it's understood he's more likely to run for a seat in the capital. But he is expected to visit the constituency this week. A party source said: \"We're throwing the kitchen sink at this, and believe we can win.\""
    },
    {
        "title": "Scottish government vows to release 'Salmond files' but refuses to set date as it faces legal action over the delay",
        "description": "The Scottish government has vowed to release the \"Salmond files\" but is refusing to set a date as it faces legal action over the delay.",
        "url": "https://news.sky.com/story/scottish-government-vows-to-release-salmond-files-but-refuses-to-set-date-as-it-faces-legal-action-over-the-delay-13499543",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-alex-salmond-nicola-sturgeon_7147109.jpg?20260127102530",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2026-01-27 09:59:00",
        "Headline": "Scotland's Information Commissioner has initiated court proceedings against the SNP government after it missed a series of deadlines to produce documents relating to an investigation into Nicola Sturgeon.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n The Scottish government has vowed to release the \"Salmond files\" but is refusing to set a date as it faces legal action over the delay. David Hamilton, Scottish Information Commissioner, has initiated court proceedings against the SNP government after it missed a series of deadlines to produce documents relating to an investigation into Nicola Sturgeon. The probe, by James Hamilton KC, saw the former first minister cleared of breaching the ministerial code during an investigation into her predecessor Alex Salmond over harassment allegations. Amid a long-running freedom of information (FOI) battle over the inquiry, the Scottish government was given until 15 January and then 22 January to respond to a request to release the documents. However, ministers missed both deadlines. The commissioner has since taken the unprecedented step of instructing solicitors to begin legal proceedings at the Court of Session which could see the government held in contempt of court. At Holyrood on Tuesday, parliamentary business minister Graeme Dey said First Minister John Swinney had \"made clear\" the government would comply \"as soon as possible\". \n                  Alex Salmond's widow makes rare intervention to defend former first minister's legacy\n                 \n                  The Proclaimers join mourners in paying tribute to 'political genius' Alex Salmond at Edinburgh memorial service\n                 \n                  The Proclaimers to perform at Alex Salmond's memorial service this weekend\n                 However, work is under way to ensure the names of complainers in Mr Salmond's criminal case are protected from jigsaw identification. Mr Dey said: \"Court orders make it clear that those who complain in relation to allegations of sexual assault must have their identities protected. \"We cannot release information which would breach those court orders and amount to a contempt of court. \"Accelerated work, and I stress accelerated work, is under way to consider each document for release. The assessment is complex given the need to avoid jigsaw identification.\" Read more from Sky News:Is this one of the UK's biggest hospital scandals? Scottish Labour MSP Katy Clark said the FOI request was made in October 2024, with the commissioner subsequently ruling the government had \"wrongly\" withheld some information. Scottish Tory MSP Douglas Ross asked for reassurance that the files will be released ahead of the Scottish parliament purdah period before this year's election. Mr Dey would not commit to a date, stating the government would be \"criticised\" if it was missed. He said: \"The intention is to release that information as soon as is practical to do.\" Mr Dey denied the suggestion the government was deliberately delaying the files' release. He added: \"I refute this absolutely, that this is a deliberate act to delay the release of this information. \"I could not have been clearer, that is not what is happening here.\""
    },
    {
        "title": "Prime Minister Sir Keir Starmer in China: What will be on the table?",
        "description": "It doesn't feel all that long ago that David Cameron took the Chinese leader Xi Jinping for a pint in a Buckinghamshire pub.",
        "url": "https://news.sky.com/story/prime-minister-sir-keir-starmer-in-china-what-will-be-on-the-table-13499611",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-keir-starmer-xi-jinping_7147358.jpg?20260127135844",
        "type": "Politics",
        "Author": "Helen-Ann Smith",
        "Date Published": "2026-01-27 13:15:00",
        "Headline": "A lot has changed since former prime minister David Cameron took Chinese leader Xi Jinping for a pint in a UK pub.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n It doesn't feel all that long ago that David Cameron took the Chinese leader Xi Jinping for a pint in a Buckinghamshire pub. But a lot has changed in the 10 years since that photo op, the so-called \"golden era\" of UK-China relations. It's fair to say things have been on something of a downward spiral. Indeed, China is now far more self-sufficient, far more assertive and far more wary of the West than it once was, while the UK has spent a decade flip-flopping on its China policy with little coherent strategy, and very limited engagement. In fact, the last prime minister to visit Beijing was Theresa May eight years ago. But Sir Keir Starmer has been clear he wants to cautiously revamp relations. Choosing not to engage with the world's second-biggest economy is \"no choice at all\" according to this government. \n                  Beth Rigby: Why PM's China trip carries real consequence - including for you at home\n                 \n                  Xi's purge of top general paints a fascinating picture of power and control within a ruthless and unforgiving system\n                 \n                  HSBC chair Nelson among bosses joining Starmer on China visit\n                 But he could have a hard task balancing the potential gains with public opinion, and not being seen to be \"too soft\" on China. Human rights crackdowns, increasing military assertiveness and the COVID-19 pandemic have all left a British population far more China-sceptical than it once was and his critics will likely find a lot to dislike. So, what will be on the table for the prime minister this week, what are the stumbling blocks and what do the Chinese think about it all? Trade and investment How to benefit more from each other financially will almost certainly be top of the agenda, indeed Mr Starmer is travelling with a sizeable UK business delegation. The Chinese and British economies have quite different advantages, and both have things to offer that the other views as valuable. The UK's most important exports to China are services; legal, financial, accounting and education (tens of thousands of Chinese students attend British universities). While the UK mostly buys manufactured goods from China, such as electronics, tech and clothes. The two almost certainly won't start the process of negotiating a full trade agreement. That would take years and be politically fraught, but look out for deals that increase market access, remove non-tariff barriers and strengthen cooperation in key sectors that both see as important such as renewable energy. The reality too is that both will be looking to hedge where they can against their bigger trading partner, the US, which as of late has been increasingly unpredictable. Read more from Sky News:President Xi's purge is extraordinary - here's why Spying and national security Mr Starmer will have to be careful in any deal that he strikes that he is not exposing the UK to vulnerabilities. Indeed, espionage and state interference will likely be the biggest elephant in the room. How to weigh advantages versus risk is always a challenge for any leader visiting China, but it may be particularly awkward this time as there have been a spate of recent accusations in the UK about alleged Chinese state actors getting close to influential people in public life. The most notable case was, perhaps, a Chinese businessman accused of acting on behalf of China who became a confidant of Andrew Mountbatten-Windsor. The reality is China does have a sophisticated and wide-reaching web of both espionage and influence and has been described by the head of GCHQ as an \"epoch-defining challenge\". While it's reasonably unlikely this will actually come up in the room, Mr Starmer will have to keep a close eye on the reality and the optics. This will matter more than ever as the government has just approved a controversial new Chinese \"mega embassy\" in London, which critics say will act as a base for Chinese spying and could put crucial communication cables at risk. Thorny issues There will also likely be a host of trickier issues raised on which the two fundamentally disagree. Mr Starmer will likely bring up Russia's war in Ukraine. China has always insisted it is neutral in the conflict but has quietly supplied Russia with finance, components and crucial diplomatic cover. The prime minister may ask President Xi to use his leverage with Vladimir Putin to put a stop to the fighting. While President Xi, for his part, might well bring up Taiwan, the self-governing island that China sees as its own and an issue that it wants the West to stay out of. But perhaps the most pressing case will be that of Jimmy Lai, the jailed former media tycoon and one of Hong Kong's most famous pro-democracy voices. Mr Lai is a British citizen and was found guilty by a Hong Kong court of national security offences that the UK sees as politically motivated - can Mr Starmer do anything to secure his release? How does China see things? The reality is that in the grand scheme of China's geopolitical relationships, the UK is not seen as that big a player. It's not even in its top 10 trading partners. It's viewed as too close to the US and it hasn't made the overtures in recent years seen by many of its European counterparts. But despite this, this visit is a moment of huge political opportunity for China. Coming so soon after Donald Trump seriously rocked his relationships with Europe with his threats to seize Greenland, China knows some countries are considering their options. Indeed, the victory for China is as much in the optics of it being seen to rekindle relationships just as Mr Trump is fracturing them, and it all plays nicely into its narrative that it is the more reliable global superpower. To this end, expect some gestures of goodwill such as visa-free travel for Brits, but be in no doubt that China will, as it always does, be playing the long, strategic game. It will not give ground where it doesn't want to and it will be aggressively (if politely) pursuing its own interests, pushing for its advantage amidst the shifting geopolitical picture."
    },
    {
        "title": "Number of people in 'very deep poverty' at highest level in more than 30 years, charity warns",
        "description": "The number of people living in \"very deep poverty\" in the UK is at the highest level in more than 30 years, a charity has warned.",
        "url": "https://news.sky.com/story/number-of-people-in-very-deep-poverty-at-highest-level-in-more-than-30-years-charity-warns-13499465",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-istock-poverty-poor_7146902.jpg?20260127032251",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-27 01:34:00",
        "Headline": "Very deep poverty is defined by the Joseph Rowntree Foundation as earning below 40% of the median household income. According to its latest report, 6.8 million people - almost half of all of those in poverty - were considered to be at that level.",
        "Content": "The number of people living in \"very deep poverty\" in the UK is at the highest level in more than 30 years, a charity has warned. In its latest report, the Joseph Rowntree Foundation (JRF) said data up to the end of the 2023/24 financial year shows more than one in five people in the UK, around 14.2 million, are in poverty. That figure is a slight drop from last year, but the charity said: \"Scratch below the surface, there are signs of change: a definitive deepening of poverty.\" It noted that in 2023/24, 6.8 million people - almost half of all of those in poverty - were considered to be in \"very deep poverty\". The JRF said it is both the highest absolute number and the highest proportion of people in \"very deep poverty\" on record since it started tracking government data in 1994/95. While the JRF notes \"there is no single best measure of poverty\", criteria can include relative income poverty, which holds the line as being for those earning roughly 60% of the median household income. Under this, deep poverty is defined as households earning below 50% of the median income, and very deep poverty as below 40%. According to the Office for National Statistics, the median household income in the UK as of April 2024 is £36,700. This would mean that poverty would see household income at around £22,070, while \"very deep\" poverty would be considered as below £14,680. The report, called UK Poverty 2026, uses the latest data from up to the end of the 2023/24 financial year, just before Labour won that year's general election. Warning on child poverty after benefit cap removed In it, the JRF also warned that progress on tackling child poverty from the government removing the two-child benefit cap will likely stall after April if no follow-up measures are announced. While it praised the decision to remove the limit, calling it \"the single most effective policy decision the government could have taken\", the charity has also warned that, according to Office for Budget Responsibility projections, the headline poverty rate \"will remain broadly unchanged\", at 21.3% in 2026 and 21.1% in 2029. It also said the Labour government's child poverty strategy \"is focused on just one part of the picture… this leaves many other groups with persistently high levels of poverty overlooked\". JRF chief analyst Peter Matejic said \"poverty in the UK is still not just widespread, it is deeper and more damaging than at any point in the last 30 years\". \"When nearly half of the people in poverty are living far below the poverty line, that is a warning sign that the welfare system is failing to protect people from harm,\" he added. \"There can be no national renewal if deep poverty remains close to record levels.\" Read more from Sky News:Will renewable licences put off budding police officers?UK loses measles elimination status'I know he took his own life - I don't understand why' A government spokesperson said: \"We understand that too many families are struggling, and we are taking decisive action to address poverty by boosting the national living wage by £900, cutting energy bills by £150 from April, and launching a £1bn crisis and resilience fund to help households stay afloat. \"As this report acknowledges, scrapping the two-child limit alongside our wider strategy will lift 550,000 children out of poverty by 2030 - the biggest reduction in a single parliament since records began.\" Liberal Democrat work and pensions spokesperson Steve Darling also said the report was a \"devastating indictment of the previous Conservative government's neglect for the most vulnerable in our society\". He added: \"We need immediate action on the cost of living from this government to bring down energy bills, build more affordable homes, and end this misery once and for all.\""
    },
    {
        "title": "Menopause 'triggers loss of brain matter which could explain women's higher dementia risk'",
        "description": "Women face a significant loss of grey matter in the brain after menopause, which may explain why they are more likely to suffer dementia than men, a new study suggests.",
        "url": "https://news.sky.com/story/menopause-triggers-loss-of-brain-matter-which-could-explain-womens-higher-dementia-risk-13499510",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-brain-brain-scan_7147014.jpg?20260127082338",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-27 09:40:00",
        "Headline": "\"It may help explain why we see almost twice as many cases of dementia in women than in men,\" said co-author, Barbara Sahakian of the University of Cambridge.",
        "Content": "Women face a significant loss of grey matter in the brain after menopause, which may explain why they are more likely to suffer dementia than men, a new study suggests. Researchers looked at 124,780 women to examine the effects of menopause on the brain and whether hormone replacement therapy (HRT) can prevent cognitive decline. Among post-menopausal women, they found significant reductions in grey brain matter, which is vital for mental functions, memory, emotions, and movement. Correspondingly, the worst-affected parts of the brain were the ones governing these functions - the hippocampus, the entorhinal cortex, and the anterior cingulate cortex. Study co-author, Barbara Sahakian of the University of Cambridge, said: \"The brain regions where we saw these differences are ones that tend to be affected by Alzheimer's disease. \"Menopause could make these women vulnerable further down the line. While not the whole story, it may help explain why we see almost twice as many cases of dementia in women than in men.\" Women account for around two-thirds of people living with Alzheimer's disease in the UK, according to Michelle Dyson, chief executive of the Alzheimer's Society. \"And while we still don't fully understand why they are more susceptible than men, it is thought that hormones may play a role,\" she said. \"This large study adds to evidence showing how menopause impacts the brain, including physical changes such as loss of brain volume. \"But without long-term participant tracking, to check if they later develop dementia, we cannot be sure that these brain changes associated with menopause also increase dementia risk.\" The impact of the menopause on cognition - including thinking, attention, language, learning, and memory skills - is already documented. To examine the role played by hormones, researchers examined both pre and post-menopausal women, with the latter group subdivided into women who had used HRT and those who had never used it. Participants answered questions about topics like sleep and whether they suffered depression and anxiety, and some took part in cognitive tests to check their memory and reaction times Roughly 11,000 women also underwent magnetic resonance imaging (MRI) scans, allowing experts to look at their brain structure. Read more:Woman says she 'begged for pain relief but was told no'Alzheimer's among elderly more widespread than thought Researchers found post-menopausal women who were not on HRT had slower reaction times than those who were, or those who had not yet reached the menopause. The study also revealed that post-menopausal women were more likely to suffer from insomnia, getting less sleep overall and feeling tired. Those on HRT reported feeling the most tired of all three groups, despite getting the same amount of sleep as those who were not. But all post-menopausal women, whether on HRT or not, said they were more tired than women who had not gone through it. There was no significant difference between the three groups when it came to performance on memory tasks, however. Co-author Katharina Zuhlsdorff, also of the University of Cambridge, said HRT appeared to have a slightly beneficial effect. She said: \"As we age, our reaction times tend to get slower - it's just a part of the natural ageing process and it happens to both women and men. \"You can imagine being asked a question at a quiz - while you might still arrive at the correct answer as your younger self, younger people would no doubt get there much faster. \"Menopause seems to accelerate this process, but HRT appears to put the brakes on, slowing the ageing process slightly.\" Her colleague and co-author Christelle Langley said: \"Most women will go through menopause, and it can be a life-changing event, whether they take HRT or not. \"A healthy lifestyle - exercising, keeping active and eating a healthy diet, for example - is particularly important during this period to help mitigate some of its effects.\" Ms Dyson echoed her advice. She said: \"There are steps that women - and men - can take today to reduce their risk of dementia, and these include regular exercise, not smoking and reducing alcohol consumption. \"If you're worried about yourself or a loved one, Alzheimer's Society's dementia symptoms checklist is a helpful first step in starting a conversation with your GP.\""
    },
    {
        "title": "One Battle After Another leads BAFTA 2026 nominations - as Hamnet breaks a record",
        "description": "One Battle After Another, the politically charged dark comedy thriller starring Leonardo DiCaprio as a washed-up revolutionary, leads this year's BAFTA nominations with 14 nods.",
        "url": "https://news.sky.com/story/one-battle-after-another-leads-bafta-2026-nominations-as-hamnet-breaks-a-record-13499541",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-one-battle-after-another_7147338.jpg?20260127133927",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2026-01-27 15:37:00",
        "Headline": "This year's BAFTA nominations have been revealed - with stars including Jessie Buckley, Timothee Chalamet, Leonardo DiCaprio, Teyana Taylor and Emma Stone in the running.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n One Battle After Another, the politically charged dark comedy thriller starring Leonardo DiCaprio as a washed-up revolutionary, leads this year's BAFTA nominations with 14 nods. It is closely followed by period vampire horror Sinners, which has 13, and frenetic ping-pong flick Marty Supreme and Shakespeare drama Hamnet, which each have 11. All four are nominated for best film, with the category completed by Norwegian film Sentimental Value, which tells the story of an estranged father reuniting with his daughters. The nods for Hamnet bring a BAFTA record for director Chloe Zhao, with the British-made film making history as the most nominated ever by a female director. BAFTAs 2026: The full list of nominations Hamnet's Irish star Jessie Buckley, widely considered a favourite after Golden Globe and Critics Choice wins for her portrayal of the bard's wife, Agnes, is shortlisted for leading actress, while Marty Supreme star Timothee Chalamet also repeats his awards season success so far with a nod in the leading actor category. DiCaprio is also nominated for best actor, with One Battle After Another also shortlisted for best film and best director for Paul Thomas Anderson, among its 14 nods. The film is loosely based on Thomas Pynchon's novel Vineland, and DiCaprio plays Bob Ferguson - a paranoid former radical living off-grid in California - who embarks on a frantic quest to find his missing daughter Willa, played by Chase Infiniti - a first-time BAFTA nominee who is up for best actress. Its supporting stars are also heavily represented, with Teyana Taylor, Sean Penn and Benicio Del Toro also nominated. Sinners' nods include Michael B Jordan in the best actor category and best director for Ryan Coogler, while Buckley's Hamnet co-star Paul Mescal is also recognised in the supporting actor category.  * Films with five nominations or more  Emma Stone is on the shortlist for leading actress for her performance in conspiracy theory drama Bugonia. The BAFTAs also include categories to recognise British films and talent, with I Swear and The Ballad Of Wallis Island among those shortlisted, as well as Hamnet. Robert Aramayo, who stars as the real-life Tourette's campaigner John Davidson in I Swear, is the sole UK hopeful in the best actor category, while his co-star Peter Mullan is also the only UK nominee for best supporting actor. Aramayo is also up for the rising star award, which recognises actors at the start of their careers. The UK's strongest category is best supporting actress, where three of the six nominees are British: Wunmi Mosaku (Sinners), Carey Mulligan (The Ballad Of Wallis Island) and Emily Watson (Hamnet). Wicked: For Good star Cynthia Erivo is among the biggest surprises to have been left off the list, but the film has not done as well generally this awards season as the first part did in 2025. Unlike the Oscars, it has not been completely left out, with nods for costume, and make-up and hair. Read more:The Tourette's film fighting back at 'cheap laughs'The BAFTA nominations - everything you need to know BAFTA chief executive Jane Millichip said the nominations reflect \"an incredible breadth of storytelling\". She said: \"There are some big subjects tackled, whether it's the ambiguity of activism, black identity, corruption, some really big subjects being tackled in very different ways... then films that are exquisite personal films, like Hamnet and I Swear.\" Emily Stillman, chairwoman of the BAFTA film committee, said: \"It feels so much of this year's films are around human connectivity and human stories and particularly at a time like this, it promotes kindness and thought about the human relationship, and that is particularly important with what is going on in the world right now.\" The BAFTAs ceremony takes place on Sunday 22 February at the Royal Festival Hall, and will be hosted by actor and US Traitors host Alan Cumming."
    },
    {
        "title": "Sir Idris Elba caught speeding on moped a day after announcing Netflix movie about Charles's charity The King's Trust",
        "description": "Actor and scooter enthusiast Sir Idris Elba has been slapped with a fine for going more than 20mph on his moped.",
        "url": "https://news.sky.com/story/sir-idris-elba-caught-speeding-on-moped-a-day-after-announcing-netflix-movie-about-charless-charity-the-kings-trust-13499668",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/idris-elba-chelsea-moped-skynews_7147453.jpg?20260127152236",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-27 15:55:00",
        "Headline": "Sir Idris, renowned for his love of his mopeds so much it made its way into a Taylor Swift song, was hit with a £147 fine.",
        "Content": "Actor and scooter enthusiast Sir Idris Elba has been slapped with a fine for going more than 20mph on his moped. Speed cameras clocked the actor, 53, making his way across Chelsea Embankment in central London at 10.12am on 21 June last year. Sir Idris is renowned for his love of mopeds - so much it even made its way into a Taylor Swift song. The US singer sampled the actor saying \"We can go driving on my scooter - you know, just riding in London\" on her 2019 song 'London Boy'. Meanwhile film fans will be reminded of Guy Ritchie's 2008 film Rock'n'Rolla - where Sir Idris's character has to evade Russian mobsters on a moped. Sir Idris admitted riding the BMW moped but insisted he had not received a fixed penalty fine from the police and was denied a chance to pay it off before appearing in court. Read more from Sky News:Storm Chandra hits UKWhite House changes tone on ICE crackdown \n                  Idris Elba on the power of football - and how it can help tackle knife crime\n                 \n                  Idris Elba joins Prime Minister Sir Keir Starmer for launch of new anti-knife crime coalition\n                 \n                  The King and Idris Elba discuss youth violence at King's Trust event\n                 He was ultimately forced to pay a £147 fine and received three penalty points at Westminster Magistrates' Court last Thursday. He was also ordered to pay £110 in costs and a £59 victim surcharge. Police presented three images to the court, showing Sir Idris riding a scooter at 28mph in a 20mph zone. The incident happened a day after it was announced the actor is collaborating with the King for a Netflix film about 50 years of Charles's charity The King's Trust. But Sir Idris's lawyers, Patterson Law, which specialises in motoring offences, urged the courts to let him ride off with just a £100 fine instead. \"Mr Elba initially responded to the Notice of Intended Prosecution to nominate himself as the driver and was expecting to receive a fixed penalty offer,\" a letter read to the court said. \"However, the offer never arrived and he therefore never had the opportunity to accept it. \"Had he received it, he absolutely would have accepted it.\" The law firm said the actor had a clean driving licence and was pleading guilty to the offence, sparing the expense of a trial. \"We would ask the court to consider replicating the fixed penalty by imposing no more than a £100 fine, with no award for costs,\" the letter continues. \"He never received the fixed penalty - and this was through no fault of his own. It would therefore not be in the interests of justice to impose further financial penalties for something which was not his fault.\" The prosecution was dealt with in the Single Justice Procedure, meaning Elba was not required to attend."
    },
    {
        "title": "BAFTA nominations 2026: The full list of stars and films shortlisted for awards",
        "description": "This year's BAFTA nominations have now been revealed, with stars including Timothee Chalamet, Jessie Buckley, Leonardo DiCaprio, Michael B Jordan and Teyana Taylor in the running for acting awards.",
        "url": "https://news.sky.com/story/bafta-nominations-2026-the-full-list-of-stars-and-films-shortlisted-for-awards-13499635",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-jessie-buckley-joe-alwyn_7127222.jpg?20260105144434",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-27 14:26:00",
        "Headline": "One Battle After Another leads this year's BAFTA nominations with 14, while Sinners has 13, and Marty Supreme and Hamnet each have 11.",
        "Content": "This year's BAFTA nominations have now been revealed, with stars including Timothee Chalamet, Jessie Buckley, Leonardo DiCaprio, Michael B Jordan and Teyana Taylor in the running for acting awards. One Battle After Another leads the nominations with 14, while Sinners has 13, and Marty Supreme and Hamnet each have 11. There are 26 categories in total, including the public-voted rising star award. Here is the list of nominations in full. Best filmHamnetMarty SupremeOne Battle After AnotherSentimental ValueSinners Best actor Robert Aramayo - I SwearTimothee Chalamet - Marty SupremeLeonardo DiCaprio - One Battle After AnotherEthan Hawke - Blue MoonMichael B Jordan - SinnersJesse Plemons - Bugonia Best actressJessie Buckley - HamnetRose Byrne - If I Had Legs I'd Kick YouKate Hudson - Song Sung BlueChase Infiniti - One Battle After AnotherRenate Reinsve - Sentimental ValueEmma Stone - Bugonia Outstanding British film 28 Years LaterThe Ballad Of Wallis IslandBridget Jones: Mad About The BoyDie My LoveH Is For HawkHamnetI SwearMr BurtonPillionSteve Outstanding debut by a British writer, director or producerThe Ceremony - Jack King (director, writer), Hollie Bryan (producer), Lucy Meer (producer)My Father's Shadow - Akinola Davies Jr (director), Wale Davies (writer)Pillion - Harry Lighton (director, writer)A Want In Her - Myrid Carten (director)Wasteman - Cal McMau (director), Hunter Andrews (writer), Eoin Doran (writer) Best adapted screenplayThe Ballad Of Wallis Island - Tom Basden, Tim KeyBugonia - Will TracyHamnet - Chloé Zhao, Maggie O'FarrellOne Battle After Another - Paul Thomas AndersonPillion - Harry Lighton Best original screenplayI Swear - Kirk JonesMarty Supreme - Ronald Bronstein, Josh SafdieThe Secret Agent - Kleber Mendonca FilhoSentimental Value - Eskil Vogt, Joachim TrierSinners - Ryan Coogler Non-English language filmIt Was Just An AccidentThe Secret AgentSentimental ValueSiratThe Voice Of Hind Rajab Best directorBugonia - Yorgos LanthimosHamnet - Chloe ZhaoMarty Supreme - Josh SafdieOne Battle After Another - Paul Thomas AndersonSentimental Value - Joachim TrierSinners - Ryan Coogler Best supporting actressOdessa A'Zion - Marty SupremeInga Ibsdotter Lilleaas - Sentimental ValueWunmi Mosaku - SinnersCarey Mulligan - The Ballad of Wallis IslandTeyana Taylor - One Battle After AnotherEmily Watson - Hamnet Best supporting actorBenicio Del Toro - One Battle After AnotherJacob Elordi - FrankensteinPaul Mescal - HamnetPeter Mullan - I SwearSean Penn - One Battle After AnotherStellan Skarsgard - Sentimental Value Best children's and family filmArcoBoongLilo & StitchZootropolis 2 Best costumeFrankensteinHamnetMarty SupremeSinnersWicked: For Good Special visual effectsAvatar: Fire And AshF1FrankensteinHow To Train Your DragonThe Lost Bus Production designFrankensteinHamnetMarty SupremeOne Battle After AnotherSinners SoundF1FrankensteinOne Battle After AnotherSinnersWarfare Make-up and hairFrankensteinHamnetMarty SupremeSinnersWicked: For Good Best original scoreBugoniaFrankensteinHamnetOne Battle After AnotherSinners Best animated filmElioLittle AmelieZootropolis 2 British short animationCardboardSolsticeTwo Black Boys In Paradise Best British short filmMagid/ ZafarNostalgieTerenceThis Is EndometriosisWelcome Home Freckles CastingI SwearMarty SupremeOne Battle After AnotherSentimental ValueSinners CinematographyFrankensteinMarty SupremeOne Battle After AnotherSinnersTrain Dreams EditingF1A House Of DynamiteMarty SupremeOne Battle After AnotherSinners Best documentary2000 Meters to AndriivkaApocalypse In The TropicsCover-UpMr Nobody Against PutinThe Perfect Neighbor Rising star - voted for by the publicArchie Madekwe - LurkerChase Infiniti - One Battle After AnotherMiles Caton - SinnersRobert Aramayo - I SwearPosy Sterling - Lollipop The 2026 BAFTA film awards ceremony takes place on Sunday 22 February at London's Royal Festival Hall."
    },
    {
        "title": "Nathan Tokosi jailed after man shot in head, mouth and body in drive-by attack",
        "description": "A rapper has been jailed for at least 24 years for a drive-by attack in which a man was shot six times but managed to drag himself back to his flat.",
        "url": "https://news.sky.com/story/nathan-tokosi-jailed-after-man-shot-in-head-mouth-and-body-in-drive-by-attack-13499623",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nathan-tokosi-notting-hill_7147259.jpg?20260127141724",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-27 13:31:00",
        "Headline": "The court heard Tokosi had eight previous convictions, including serving time for attempted murder over a stabbing when he was 13.",
        "Content": "A rapper has been jailed for at least 24 years for a drive-by attack in which a man was shot six times but managed to drag himself back to his flat. Daniel Offei-Ntow needed life-saving surgery after being hit in the head, mouth and body as he sat in his car in Notting Hill, west London, on 20 November 2023 Nathan Tokosi, also known as DigDat, received a life sentence at the Old Bailey today after being found guilty of attempted murder and firearms charges last year. The 26-year-old achieved success in 2018 when one of his singles, Air Force, reached number 20 in the UK charts. Prosecutor Kate Bex KC said Tokosi had been one of several people in a stolen Audi when at least six shots were fired from a passenger window. Mr Offei-Ntow, 27, managed to escape and firearms officers followed a trail of blood to find him \"severely injured\" at his flat, said Ms Bex. Tokosi's DNA was found in the Audi and police discovered he had also borrowed a BMW for trips from his father's home in Deptford, southeast London, to Notting Hill the same weekend. \n                  Police appeal for 'heroic' witness who stepped in to help three women in Camden\n                 \n                  Paranoid schizophrenic who stabbed grandmother to death at bus stop detained indefinitely\n                 \n                  Toby Carvery restaurant facing chop over felling of 500-year-old oak tree\n                 Ms Bex said there was no \"innocent explanation\" for the BMW and the Audi being in the same location. Helen Shaw, from the Crown Prosecution Service, said Tokosi had \"clearly intended to kill his victim by shooting him in the head at a close range\" and that CCTV showed him driving round the area in the Audi before the attack. The court heard Tokosi had eight previous convictions, including punching a girl in the face and attacking a boy in separate incidents when he was 11. Two years later, he was convicted of attempted murder and sentenced to seven years' detention for stabbing someone in the ribcage. Before his arrest for the drive-by, Tokosi was involved in another incident when he threw a bag containing a loaded weapon from a car and fled on foot after refusing to stop for police. A separate \"loaded viable firearm\" was found when police raided his home a few weeks later on 16 February 2024. Tokosi was convicted over these two incidents, along with the attempted murder, in trials in March and November 2025. Defence barrister Shannon Revel told the judge Tokosi had ADHD and was a \"laidback\" young man who got caught up the \"fast-paced and chaotic\" lifestyle of his music career. \"Rising to success so quickly\" gave him no real time for reflection, she said. There was weeping from the public gallery as he was led away to begin his sentence - with Tokosi making a phone gesture to family."
    }
]