[
    {
        "title": "Babies born with DNA from three people in the UK - to prevent 'devastating' illness with no cure",
        "description": "Eight babies have been born in the UK with DNA from three people following a procedure to eliminate an incurable inherited disease.",
        "url": "https://news.sky.com/story/babies-born-in-uk-with-dna-from-three-people-to-treat-inherited-disease-takes-medicine-into-uncharted-territory-13397706",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-embryo-mitochondrial_6966560.jpg?20250716210608",
        "type": "Home",
        "Author": "Tom Clarke",
        "Date Published": "2025-07-16 19:56:00",
        "Headline": "It is a major advance for the technique, called mitochondrial donation therapy, designed to prevent a life-limiting, often fatal, illness.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  Eight babies have been born in the UK with DNA from three people following a procedure to eliminate an incurable inherited disease. It is a major advance for the technique, called mitochondrial donation therapy, designed to prevent a life-limiting, often fatal illness caused by genetic mutations in the structures that generate energy in all our cells. It is also a test of the UK's permissive but highly regulated stance on human embryo research that allowed a technique once criticised for creating \"three-parent babies\" to proceed. The babies, four girls and four boys - two of them identical twins - were all born in the last five years and are healthy, according to research published in the New England Journal of Medicine. \"It's a great success for these families,\" said Sir Doug Turnbull, emeritus professor at the University of Newcastle who helped pioneer the treatment. \"This is a devastating disease with no cure and without this technique, they would not feel that their families were free of mitochondrial disease. This gives them that opportunity.\" Mitochondrial disease affects around one in 5,000 babies born in the UK. Depending on the number and type of mutations in their mitochondria, the severity and type of disease can vary, but includes neurological, metabolic and developmental disorders. Only women at high risk of passing on severe disease qualify for the procedure, provided though a specialist facility at Newcastle upon Tyne Hospitals NHS Foundation Trust. The identities of the seven families and their babies are being withheld, but a mother of one of the baby boys speaking anonymously said: \"The emotional burden of mitochondrial disease has been lifted, and in its place is hope, joy, and deep gratitude.\" How does the technique work? The procedure involves removing the genetic information from an affected mother's fertilised embryo before inserting it into one from a healthy female donor, from which the genetic information has been removed. Crucially, the hundreds of thousands of diseased mitochondria are left behind, leaving the new embryo with healthy ones present in the donor embryo. Mitochondria contain a tiny amount of their own unique genetic code, so the resulting babies carry DNA from three different people. But because it represents just 0.02% of our total DNA and has no bearing on genetic traits we inherit from our parents, researchers behind the technique, have never liked the \"three-parent\" moniker. However, the technique - whatever you choose to call it - isn't perfect. A total of 22 women underwent the procedure but only seven became pregnant, resulting in eight births - a 36% success rate. Five of the eight babies were born with no trace of disease. But tests on the other three revealed a small percentage of mutated mitochondria had been carried over during the procedure. Read more from Sky News:'My voice box was removed after NHS missed my throat cancer'World's biggest human imaging project reaches milestone While they are at levels too low to cause mitochondrial disease, the babies will require careful follow-ups to ensure they continue to develop normally. \"We have designed a study specifically for that purpose,\" said Professor Bobby McFarland, who leads the service in Newcastle. \"That's what is unique about us offering this in Newcastle because there isn't anywhere else in the world that's doing this in a regulated way.\" While there's good reason to expect the children will develop normally, the procedure does take medicine into new territory. Because mitochondria contain their own genetic code, girls born via the technique - carrying those from the healthy donor - will pass that on to any children they may have in future. Changing the \"germ-line\" in such a way has raised ethical concerns. But for seven new families, and more to follow, the procedure promises to cure a disease that has affected their families for generations."
    },
    {
        "title": "PM criticised over 'appalling' decision to suspend four Labour MPs",
        "description": "Sir Keir Starmer has suspended four MPs for repeated breaches of party discipline.",
        "url": "https://news.sky.com/story/three-labour-mps-suspended-for-breaches-of-party-discipline-13397508",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-brian-leishman-chris-hinchliff_6966299.jpg?20250716161856",
        "type": "Home",
        "Author": "Faye Brown, political reporter",
        "Date Published": "2025-07-16 13:47:00",
        "Headline": "The suspensions will be seen as an attempt to restore discipline following a number of rebellions that has forced the government into U-turns. ",
        "Content": "By Faye Brown, political reporter    Sir Keir Starmer has suspended four MPs for repeated breaches of party discipline. Brian Leishman, Chris Hinchliff, Neil Duncan-Jordan and Rachael Maskell have lost the whip, meaning they are no longer part of Labour's parliamentary party and will sit as independent MPs. The suspension is indefinite pending a review. Three other MPs have had their trade envoy roles removed: Rosena Allin Khan, Bell Ribeiro-Addy and Mohammed Yasin. Politics latest: Suspended MPs defend their voting record  All seven had voted against the government's welfare reforms earlier this month. However, it is understood this is not the only reason behind the decision, with sources citing \"repeated breaches of party discipline\". More than 100 MPs had initially rebelled against the plan to cut personal independent payments (PIP). Ultimately, 47 voted against the bill's third reading, after it was watered down significantly in the face of defeat. Ms Maskell was one of the lead rebels in the welfare revolt, and has more recently called for a wealth tax to fund the U-turn.  The York Central MP has spoken out against the government on a number of other occasions since the election, including on winter fuel and cuts to overseas aid. Confirming the suspension, Ms Maskell told Sky News that she \"doesn't see herself as a rebel\" but \"somebody that is prepared to fulfil (her) role here of holding the executive to account and speaking truth to power\". She stopped short of criticising the decision, saying: \"I hold my hand out to the prime minister and hope he takes that and wants to reach back because I think it's really important that we work together.\" Ms Maskell was first elected in 2015, while the other suspended MPs were newly elected last year. Mr Hinchliff, the MP for North East Hertfordshire, has proposed a series of amendments to the flagship planning and infrastructure bill criticising the government's approach. Mr Duncan-Jordan, the MP for Poole, led a rebellion against the cut to the winter fuel payments while Alloa and Grangemouth MP Mr Leishman has been critical of the government's position on Gaza. Political correspondent After a tricky few weeks for the government, in which backbenchers overturned plans to cut back welfare spending, now a heavy hand to get the party into line.\n All four suspended MPs appear to be surprised - and upset.\n\n Three more have lost plum roles as trade envoys - all on the left of the party.\n\n All were active in the rebellion against the government's welfare reforms, and voted against the changes even after a series of U-turns - but were among 47 Labour MPs who did so.\n\n When MPs were told after the welfare vote that Number 10 was \"fully committed to engaging with parliamentarians\", this was not what they were expecting.\n\n We're told the reasons for these particular suspensions go wider - over \"persistent breaches of party discipline\" - although most are not high profile. In the scheme of things, Jeremy Corbyn and John McDonnell rebelled against the Labour whip hundreds of times under New Labour, without being suspended. But these MPs' pointed criticism of the Starmer strategy has clearly hit a nerve. Read Tamara's analysis in full here 'Couldn't support making people poorer' Mr Duncan-Jordan told Sky News that he understood speaking out against benefit cuts would \"come at a cost\" but said he \"couldn't support making disabled people poorer\". Mr Leishman echoed that sentiment, saying: \"I firmly believe that it is not my duty as an MP to make people poorer, especially those that have suffered because of austerity and its dire consequences.\" Both said they remain committed to the Labour Party and its values, suggesting they have no plans to join the new party being set up by former Labour leader Jeremy Corbyn and ousted MP Zarah Sultana. Similarly Mr Hinchliff said in a brief statement: \"I remain proud to have been elected as a Labour MP and I hope in time to return to the Labour benches.\" The suspensions will be seen as an attempt to restore discipline ahead of the summer recess following a number of rebellions that has forced the government into U-turns. As well as watering down the welfare bill, some cuts to the winter fuel payment have been reversed, leaving Chancellor Rachel Reeves with a fiscal blackhole to fill. However, the move risks creating further divisions with a number of Labour MPs criticising the decision. Read more:Who are the suspended Labour MPs? Starmer 'rolling out the carpet to Reform' Ian Byrne, Labour MP for Liverpool West Derby, said he was \"appalled\" by the suspensions as he and 44 others voted against welfare cuts. He said this isn't the first time the Starmer leadership has \"punished MPs for standing up for what's right\", as he and six others were suspended last year for voting against the two-child benefit cap. \"These decisions don't show strength. They are damaging Labour's support and risk rolling out the red carpet for Reform,\" he added. Richard Burgon, who was also temporarily suspended in the two-child benefit cap revolt, said he had hoped the leadership would take a different approach to backbenchers. \"Sadly, it isn't yet doing so. To help stop a Reform government, it really must do so,\" he said. Jon Trickett, Labour MP for Normanton and Hemsworth, said \"it's not a sin to stand up for the poor and disabled\", adding: \"Solidarity with the suspended four.\""
    },
    {
        "title": "Acid attacks rise in UK - with 25% of them in an area that's home to just 2% of the population",
        "description": "The number of acid attacks has risen 10% in a year, according to a Freedom of Information request to UK police forces.",
        "url": "https://news.sky.com/story/acid-attacks-rise-in-uk-with-25-of-them-in-an-area-thats-home-to-just-2-of-the-population-13397752",
        "image_url": "https://e3.365dm.com/16/01/1920x1080/cegrab-20140906-031033-687-1-2048x1536_3399491.jpg?20250717024213",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-16 23:42:00",
        "Headline": "Of the attacks where gender data was recorded, a third were female - reflecting the rising use of acid as a weapon of violence against women.",
        "Content": "The number of acid attacks has risen 10% in a year, according to a Freedom of Information request to UK police forces. Acid Survivors Trust International (ASTI) said its analysis shows 498 physical attacks involving corrosive substances were recorded in 2024 - compared with 454 in the previous year. According to the charity, the real figure is likely to be even higher because of under-reporting by victims. In 2023, both Northumbria Police and the Metropolitan Police recorded the highest number of physical attacks - 18% and 16% respectively. But figures in 2024 showed a significant fall in attacks in London, dropping by 78%, while cases in Northumbria rose substantially. ASTI executive director Jaf Shah told Sky News that attacks in Northumbria account for almost 25% of the nationwide total - despite making up just 2% of the population. He explained: \"Historically, London has always seen the highest number attacks, which is unsurprising because of the population. But what we've seen in the 2024 data is a massive drop in the number of attacks in London to just 16. \n                  Nazi-obsessed terrorist Callum Parslow jailed after trying to murder asylum seeker at Worcestershire hotel\n                 \n                  Allison Pearson: No further action to be taken against Daily Telegraph columnist over social media post\n                 \n                  Non-crime hate incidents guidance needs urgent change, shadow home secretary Chris Philp says\n                 \"Whereas in Northumbria we've seen a 49% increase to 121 attacks, so there's a massive disparity in terms of numbers, especially relative to population figures for each of those corresponding areas. So this is obviously a very worrying trend.\"  Mr Shah added there was supporting evidence about the type of attacks taking place in the Northumbria force area. \"Professor Francisco Figueiredo, who is head of ophthalmology at Newcastle University ... certainly picked up on an increase of young men receiving treatment with corrosive injuries in the eye. \"A lot of the injuries he's treated are related to the use of ammonia ... that's quite different to some of the attacks we've seen in other parts of the UK where sulphuric acid is commonly used.\" West Midlands Police also recorded a significant increase in attacks - rising 82% between 2023 and 2024 - and making up 12% of the UK total. ASTI states the FOI data reveals acid attacks in the UK are historically associated with male-on-male violence and often linked to gang activity. Of the 224 physical attacks where gender data was recorded, a third of victims were female, reflecting the increasing use of acid as a weapon of violence against women and girls.  ASTI also commissioned research, conducted by Frontier Economics, which concluded that the financial impact of all acid attacks in 2024 was more than £31m. The study estimated that a single attack costs £63,000, consisting of the medical and psychological support victims require and paying for the criminal justice system to deal with perpetrators. ASTI also told Sky News it was recommending reforms to tackle the \"lack of robust checks on sales of corrosives\", especially via online retailers. Read more from Sky News:Katie Piper reveals artificial eye decisionVictim's eye saved after acid attackGirl injured in 'devastating acid attack' Acid attack 'devastates lives' Commander Stephen Clayman, National Police Chiefs' Council lead for corrosive substances, said an attack \"devastates lives and causes physical and psychological damage to victims that can last a lifetime\" and officers were committed \"to tackle this appalling crime\". In a statement, he added: \"Many corrosive substances are available over the counter at supermarkets and DIY stores. \"It is important that law enforcement and government work closely with retailers themselves, to enhance our intelligence picture, and determine the best ways to keep these products from falling into the hands of people who intend to use them to cause harm. \"Serious crimes such as this should not go unreported and we want victims to feel able to come forward and report these matters to us.\""
    },
    {
        "title": "'Betrayed' Afghan interpreter says family 'waiting for death' under Taliban after UK military data breach",
        "description": "An Afghan interpreter who worked with the British military has told Sky News he feels \"betrayed by the British government\" after a massive data breach saw his personal details revealed.",
        "url": "https://news.sky.com/story/betrayed-afghan-interpreter-says-family-waiting-for-death-under-taliban-after-uk-military-data-breach-13397647",
        "image_url": "https://e3.365dm.com/21/12/1920x1080/skynews-mod-afghanistan-afghanistan_5607564.jpg?20211207173808",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-16 17:52:00",
        "Headline": "He tells Sky News he suspected his data had been leaked after his father \"died because the Taliban took him into custody and beat him\".",
        "Content": " An Afghan interpreter who worked with the British military has told Sky News he feels \"betrayed by the British government\" after a massive data breach saw his personal details revealed. Ali, whose name has been changed to protect his identity, had long suspected his details had been shared with the Taliban - but found out just yesterday that he was a victim of the breach three years ago. He is now even more fearful for the lives of family members still in Afghanistan, who are already in hiding from the Taliban. Ali worked alongside British soldiers in Helmand Province to help them speak with Afghan people. His job also involved listening in on Taliban radio communications and translating them for the British forces. \"The Taliban called us the British eyes,\" he told Sky News. \"Because they think if we are not on the ground with them, the British force cannot do anything. \"They know that you're listening to their chatting and the British forces are acting according to our translation. We were always the first target and our job was always full of risk.\"  After the Taliban seized power in Afghanistan in 2021, Ali - who had already suffered injuries after the Taliban targeted him with a car bomb - was brought to the UK through the British government's Afghan Resettlement Programme (ARP) for his own protection. Once in the UK, he began to suspect his data had been leaked after his father \"died because the Taliban took him into custody and beat him\". Ali contacted the Ministry of Defence to raise concerns over his personal information last year, and stated in an email that he was \"terrified\", adding: \"I beg of you, do not pass this information to anyone.\" \"They just ignored what I told them and they never replied,\" he said.  'The Taliban want me' Following confirmation that the data breach did take place, Ali is even more scared for the lives of his family members who have already been in hiding from the Taliban for around five months. \"I'm feeling terrible and frustrated,\" he said. \"My family's details have been shared with the Taliban intelligence forces and now they are looking for them. \"Every day, every single minute, my family's waiting for their death, because if anyone comes to knock the door, they think that that is the Taliban.\" 👉 Listen to Sky News Daily on your podcast app 👈 Ali has twice applied for his family to be relocated to the UK but both applications have been rejected. He is now renewing his call for the British government to move his loved ones. \"I have carried the body of the British soldier,\" he said. \"I feel betrayed by the British government. They should relocate my family to a safe place.\" Read more:Afghan man pleads for King's help after data leakHow Afghan data breach unfolded'Serious questions to answer' over data breach, says PM Ali has decided he will return to his homeland to help his family if they are not granted legal passage to the UK. \"If we don't win [the case], I have decided I want to go back to Afghanistan and finish this,\" he said. \"The Taliban want me. If the British government can't save my family, then I have this one responsibility to go and save them. \"I don't want my family being killed for something they didn't do.\" Sky News has contacted the Ministry of Defence for comment."
    },
    {
        "title": "Tomorrowland: 'Devastating' blaze destroys main stage at major festival - two days before it was due to begin",
        "description": "A huge fire has destroyed the main stage of a major festival in Belgium - two days before it was due to begin.",
        "url": "https://news.sky.com/story/tomorrowland-devastating-blaze-destroys-main-stage-at-major-festival-two-days-before-it-was-due-to-begin-13397743",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-tomorrowland-belgium_6966626.jpg?20250716234247",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-16 21:56:00",
        "Headline": "The event is famous for its immersive and elaborate designs, and attracts big names including David Guetta, Swedish House Mafia, Eric Prydz and Alok.",
        "Content": " A huge fire has destroyed the main stage of a major festival in Belgium - two days before it was due to begin. Tomorrowland is a dance music event as big as Glastonbury - and David Guetta was due to perform. Footage showed flames and thick plumes of black smoke engulfing the stage and spreading to nearby woodland on Wednesday. The annual festival in the town of Boom, north of Brussels, is one of the biggest in Europe and attracts about 400,000 people over two consecutive weekends. It is famous for its immersive and elaborate designs and attracts big names within dance music - including Guetta, best known for tracks When Love Takes Over and Titanium. Dutch DJs Martin Garrix and Charlotte de Witte were also due to perform, along with the likes of Swedish House Mafia, Eric Prydz and Alok. The festival's website described the creative elements which went into the elaborate main stage. \n                  Three Belgian soldiers injured in 'shooting incident' during training exercise in Scotland\n                 \n                  Tate Britain to return painting 'looted by Nazis'\n                 \n                  Manhunt after shooting at Brussels underground station\n                 The theme, described as Orbyz, was \"set in a magical universe made entirely out of ice\" and \"full of mythical creatures\". Read more from Sky News:Ticketless Oasis fans blocked from gigAmerican Idol executive shot dead Organisers said no one was injured in the blaze but confirmed \"our beloved main stage has been severely damaged\", adding they were \"devastated\". Spokesperson Debby Wilmsen added: \"We received some truly terrible news today. A fire broke out on the Tomorrowland site ... and our main stage was essentially destroyed there, which is truly awful. \"That's a stage that took years to build, with so much love and passion. So I think a lot of people are devastated.\" Despite the fire, Tomorrowland organisers said they were still expecting 38,000 festivalgoers at DreamVille, the event's campsite."
    },
    {
        "title": "Photograph of Queen Camilla released to celebrate 78th birthday",
        "description": "A photograph of the Queen has been released to celebrate her 78th birthday.",
        "url": "https://news.sky.com/story/photograph-of-queen-camilla-released-to-celebrate-78th-birthday-13397710",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-camilla-queen_6966575.jpg?20250716214842",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-16 20:18:00",
        "Headline": "The picture shows Her Majesty smiling in the sunshine, looking relaxed at her private home in Wiltshire.",
        "Content": "A photograph of the Queen has been released to celebrate her 78th birthday. The picture of Camilla was taken earlier this month in front of a meadow at her Wiltshire home, Raymill. It shows Her Majesty smiling in the sunshine, looking relaxed and leaning on a metal gate. She is seen wearing a turquoise dress in a Liberty fabric printed with a rainforest of toucans, lemurs and monkeys. In the image taken by photographer Chris Jackson to mark her birthday on Thursday, Camilla can be seen wearing gold drop earrings and a delicate gold bracelet. Last year, Camilla was on duty on her birthday, attending the state opening of parliament at the King's side. This year, she is said to be spending the day privately.  Read more from Sky News:Harry follows in Diana's footstepsKing and Idris Elba discuss knife crime At the start of April, she celebrated her 20th wedding anniversary, and she and the King have had a busy run of engagements. They included hosting a state visit by French President Emmanuel Macron last week ahead of the royal couple's upcoming annual summer break in Scotland. On Wednesday, the Queen was gifted a roll of clingfilm for her birthday in a special holder when she visited a nuclear-powered submarine in Plymouth. The wrapping was used to fix a defect in the main engines of HMS Astute. \"There's nothing more useful, brilliant, how wonderful,\" the Queen said about the present, which had a small plaque with the words \"Clingflim keeping nuclear submarines at sea\". In May, new portraits of the King and Queen, commissioned to commemorate their coronation in 2023, were unveiled."
    },
    {
        "title": "UK weather: Temperatures set to hit 30C in parts of UK this week",
        "description": "Temperatures are set to hit 30C in some parts of the UK this week.",
        "url": "https://news.sky.com/story/weather-temperatures-set-to-hit-30c-in-parts-of-uk-this-week-13397526",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-brighton-beachgoers_6953907.jpg?20250630164158",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-16 14:24:00",
        "Headline": "The expected hot spell comes after temperatures soared past 30C in parts of the UK last week - as the country had its third heatwave of the year.",
        "Content": "Temperatures are set to hit 30C in some parts of the UK this week. Highs of 28C (82F) can be expected today before temperatures are forecast to peak at 30C (86F) in London tomorrow, Met Office meteorologist Jonathan Vautrey said. Other areas in southeast England will push towards the high 20s on Friday, where the average temperature in July is about 23C (73F). Find out the weather forecast for where you are  \"We're starting to see southwesterly winds come in, that's bringing in hotter and more humid conditions, particularly in southern areas, we are going to see temperatures climbing again,\" Mr Vautrey said. \"Friday is looking to be the peak of the current hot spell. This heat is not going to be as widespread as what we've just come out of, areas to the north aren't going to be seeing the same highs.\" But the weather is set to turn later in the week, with a chance of heavy rain and thunderstorms across the UK over the weekend. Temperatures will start to slowly drop, but are still expected to reach up to 29C (84F) on Saturday and 25C (77F) on Sunday. It comes after temperatures soared past 30C (86F) in parts of the UK last week - as the country had its third heatwave of the year.  A yellow thunderstorm warning has been issued for much of Northern Ireland from 11am until 8pm today, and this unsettled weather is forecast to spread across more of the UK. Heavy showers and a few thunderstorms may cause some disruption - particularly to travel - with between 30mm and 40mm of rainfall over a few hours in Northern Ireland, the Met Office said. Meanwhile, Southern Water has become the latest company to bring in a hosepipe ban as England battles exceptionally dry weather. Restrictions like watering gardens, filling paddling pools or washing cars would come in for households in Hampshire and the Isle of Wight from Monday, the company said. Read more:Extreme UK weather 'becoming the norm'East and West Midlands officially in drought - which areas could be next?Hosepipe bans hit more households - what you need to know It has been the driest start to the year since 1976 for England, causing many water companies to bring in hosepipe bans. Rainfall across England was 20% less than the long-term average for June, the Environment Agency said. Last month was the hottest on record for the country."
    },
    {
        "title": "Israel attacks Syrian military HQ - and disrupts live TV broadcast",
        "description": "Israeli airstrikes have targeted the Syrian military headquarters in Damascus amid renewed clashes in the country.",
        "url": "https://news.sky.com/story/israel-attacks-syrian-military-hq-in-damascus-and-issues-warning-to-leave-religious-minority-group-alone-13397411",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-syria-damascus-defence_6966154.jpg?20250716135721",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-16 11:31:00",
        "Headline": "The Israeli military says it is monitoring \"actions being taken against Druze civilians\" - but Syria says its forces have been responding to the \"source of fire\" inside the southern city of Sweida.",
        "Content": " Israeli airstrikes have targeted the Syrian military headquarters in Damascus amid renewed clashes in the country. The gate of the Ministry of Defence in the Syrian capital was targeted by two warning missiles from an Israeli reconnaissance aircraft. State-owned Elekhbariya TV said the Israeli strike had wounded two civilians, the Reuters news agency reported. It came as Israeli airstrikes targeted security and army vehicles in the southern city of Sweida, where the Druze faith is one of the major religious groups - marking the third consecutive day Israel has struck Syrian forces. The Israeli military confirmed it had \"struck the entrance gate\" in Damascus - and that it would be monitoring \"actions being taken against Druze civilians in southern Syria\". International affairs editor Israel has shown little respect for international borders since becoming the unrivalled military hegemon of the Middle East.  Today that meant an Israeli airstrike on a government building in Damascus. Israel says its attack on a Syrian defence ministry facility was intended as a warning to the new government: stay out of the part of southern Syria we have occupied or else. Israel has moved into parts of the south of the country, built military bases and declared a line of control. On Monday, Syrian tanks heading south to try and restore order following an outbreak of factional fighting were attacked by Israeli warplanes. \"The presence of such vehicles in southern Syria could pose a threat to Israel,\" stated the Israel Defence Forces. In reality, Syria's ageing tanks pose minimal threat to Israel's state-of-the art military. Read the full analysis Local media said Sweida and nearby villages were coming under heavy artillery and mortar fire on Wednesday, according to Reuters. The clashes marked the collapse of a ceasefire between Syrian government forces and Druze armed groups, with Israel also warning it would increase its involvement. Israel said it was acting to protect the Druze groups through its attacks on convoys of Syrian forces. Syria blamed militias in Sweida for violating a ceasefire agreement which had only been reached on Tuesday. Read more from Sky News:'My family is finished': Afghan man feels betrayedHarry follows in Diana's charity footsteps  A statement from its defence ministry said: \"Military forces continue to respond to the source of fire inside the city of Sweida, while adhering to rules of engagement to protect residents, prevent harm, and ensure the safe return of those who left the city back to their homes.\" Israel's defence minister Israel Katz said the military will continue to strike Syrian forces until they withdraw and should \"leave Druze alone\", according to local reports."
    },
    {
        "title": "Babies born with DNA from three people in the UK - to prevent 'devastating' illness with no cure",
        "description": "Eight babies have been born in the UK with DNA from three people following a procedure to eliminate an incurable inherited disease.",
        "url": "https://news.sky.com/story/babies-born-in-uk-with-dna-from-three-people-to-treat-inherited-disease-takes-medicine-into-uncharted-territory-13397706",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-embryo-mitochondrial_6966560.jpg?20250716210608",
        "type": "UK",
        "Author": "Tom Clarke",
        "Date Published": "2025-07-16 19:56:00",
        "Headline": "It is a major advance for the technique, called mitochondrial donation therapy, designed to prevent a life-limiting, often fatal, illness.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  Eight babies have been born in the UK with DNA from three people following a procedure to eliminate an incurable inherited disease. It is a major advance for the technique, called mitochondrial donation therapy, designed to prevent a life-limiting, often fatal illness caused by genetic mutations in the structures that generate energy in all our cells. It is also a test of the UK's permissive but highly regulated stance on human embryo research that allowed a technique once criticised for creating \"three-parent babies\" to proceed. The babies, four girls and four boys - two of them identical twins - were all born in the last five years and are healthy, according to research published in the New England Journal of Medicine. \"It's a great success for these families,\" said Sir Doug Turnbull, emeritus professor at the University of Newcastle who helped pioneer the treatment. \"This is a devastating disease with no cure and without this technique, they would not feel that their families were free of mitochondrial disease. This gives them that opportunity.\" Mitochondrial disease affects around one in 5,000 babies born in the UK. Depending on the number and type of mutations in their mitochondria, the severity and type of disease can vary, but includes neurological, metabolic and developmental disorders. Only women at high risk of passing on severe disease qualify for the procedure, provided though a specialist facility at Newcastle upon Tyne Hospitals NHS Foundation Trust. The identities of the seven families and their babies are being withheld, but a mother of one of the baby boys speaking anonymously said: \"The emotional burden of mitochondrial disease has been lifted, and in its place is hope, joy, and deep gratitude.\" How does the technique work? The procedure involves removing the genetic information from an affected mother's fertilised embryo before inserting it into one from a healthy female donor, from which the genetic information has been removed. Crucially, the hundreds of thousands of diseased mitochondria are left behind, leaving the new embryo with healthy ones present in the donor embryo. Mitochondria contain a tiny amount of their own unique genetic code, so the resulting babies carry DNA from three different people. But because it represents just 0.02% of our total DNA and has no bearing on genetic traits we inherit from our parents, researchers behind the technique, have never liked the \"three-parent\" moniker. However, the technique - whatever you choose to call it - isn't perfect. A total of 22 women underwent the procedure but only seven became pregnant, resulting in eight births - a 36% success rate. Five of the eight babies were born with no trace of disease. But tests on the other three revealed a small percentage of mutated mitochondria had been carried over during the procedure. Read more from Sky News:'My voice box was removed after NHS missed my throat cancer'World's biggest human imaging project reaches milestone While they are at levels too low to cause mitochondrial disease, the babies will require careful follow-ups to ensure they continue to develop normally. \"We have designed a study specifically for that purpose,\" said Professor Bobby McFarland, who leads the service in Newcastle. \"That's what is unique about us offering this in Newcastle because there isn't anywhere else in the world that's doing this in a regulated way.\" While there's good reason to expect the children will develop normally, the procedure does take medicine into new territory. Because mitochondria contain their own genetic code, girls born via the technique - carrying those from the healthy donor - will pass that on to any children they may have in future. Changing the \"germ-line\" in such a way has raised ethical concerns. But for seven new families, and more to follow, the procedure promises to cure a disease that has affected their families for generations."
    },
    {
        "title": "Acid attacks rise in UK - with 25% of them in an area that's home to just 2% of the population",
        "description": "The number of acid attacks has risen 10% in a year, according to a Freedom of Information request to UK police forces.",
        "url": "https://news.sky.com/story/acid-attacks-rise-in-uk-with-25-of-them-in-an-area-thats-home-to-just-2-of-the-population-13397752",
        "image_url": "https://e3.365dm.com/16/01/1920x1080/cegrab-20140906-031033-687-1-2048x1536_3399491.jpg?20250717024213",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-16 23:42:00",
        "Headline": "Of the attacks where gender data was recorded, a third were female - reflecting the rising use of acid as a weapon of violence against women.",
        "Content": "The number of acid attacks has risen 10% in a year, according to a Freedom of Information request to UK police forces. Acid Survivors Trust International (ASTI) said its analysis shows 498 physical attacks involving corrosive substances were recorded in 2024 - compared with 454 in the previous year. According to the charity, the real figure is likely to be even higher because of under-reporting by victims. In 2023, both Northumbria Police and the Metropolitan Police recorded the highest number of physical attacks - 18% and 16% respectively. But figures in 2024 showed a significant fall in attacks in London, dropping by 78%, while cases in Northumbria rose substantially. ASTI executive director Jaf Shah told Sky News that attacks in Northumbria account for almost 25% of the nationwide total - despite making up just 2% of the population. He explained: \"Historically, London has always seen the highest number attacks, which is unsurprising because of the population. But what we've seen in the 2024 data is a massive drop in the number of attacks in London to just 16. \n                  Nazi-obsessed terrorist Callum Parslow jailed after trying to murder asylum seeker at Worcestershire hotel\n                 \n                  Allison Pearson: No further action to be taken against Daily Telegraph columnist over social media post\n                 \n                  Non-crime hate incidents guidance needs urgent change, shadow home secretary Chris Philp says\n                 \"Whereas in Northumbria we've seen a 49% increase to 121 attacks, so there's a massive disparity in terms of numbers, especially relative to population figures for each of those corresponding areas. So this is obviously a very worrying trend.\"  Mr Shah added there was supporting evidence about the type of attacks taking place in the Northumbria force area. \"Professor Francisco Figueiredo, who is head of ophthalmology at Newcastle University ... certainly picked up on an increase of young men receiving treatment with corrosive injuries in the eye. \"A lot of the injuries he's treated are related to the use of ammonia ... that's quite different to some of the attacks we've seen in other parts of the UK where sulphuric acid is commonly used.\" West Midlands Police also recorded a significant increase in attacks - rising 82% between 2023 and 2024 - and making up 12% of the UK total. ASTI states the FOI data reveals acid attacks in the UK are historically associated with male-on-male violence and often linked to gang activity. Of the 224 physical attacks where gender data was recorded, a third of victims were female, reflecting the increasing use of acid as a weapon of violence against women and girls.  ASTI also commissioned research, conducted by Frontier Economics, which concluded that the financial impact of all acid attacks in 2024 was more than £31m. The study estimated that a single attack costs £63,000, consisting of the medical and psychological support victims require and paying for the criminal justice system to deal with perpetrators. ASTI also told Sky News it was recommending reforms to tackle the \"lack of robust checks on sales of corrosives\", especially via online retailers. Read more from Sky News:Katie Piper reveals artificial eye decisionVictim's eye saved after acid attackGirl injured in 'devastating acid attack' Acid attack 'devastates lives' Commander Stephen Clayman, National Police Chiefs' Council lead for corrosive substances, said an attack \"devastates lives and causes physical and psychological damage to victims that can last a lifetime\" and officers were committed \"to tackle this appalling crime\". In a statement, he added: \"Many corrosive substances are available over the counter at supermarkets and DIY stores. \"It is important that law enforcement and government work closely with retailers themselves, to enhance our intelligence picture, and determine the best ways to keep these products from falling into the hands of people who intend to use them to cause harm. \"Serious crimes such as this should not go unreported and we want victims to feel able to come forward and report these matters to us.\""
    },
    {
        "title": "PM criticised over 'appalling' decision to suspend four Labour MPs",
        "description": "Sir Keir Starmer has suspended four MPs for repeated breaches of party discipline.",
        "url": "https://news.sky.com/story/three-labour-mps-suspended-for-breaches-of-party-discipline-13397508",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-brian-leishman-chris-hinchliff_6966299.jpg?20250716161856",
        "type": "UK",
        "Author": "Faye Brown, political reporter",
        "Date Published": "2025-07-16 13:47:00",
        "Headline": "The suspensions will be seen as an attempt to restore discipline following a number of rebellions that has forced the government into U-turns. ",
        "Content": "By Faye Brown, political reporter    Sir Keir Starmer has suspended four MPs for repeated breaches of party discipline. Brian Leishman, Chris Hinchliff, Neil Duncan-Jordan and Rachael Maskell have lost the whip, meaning they are no longer part of Labour's parliamentary party and will sit as independent MPs. The suspension is indefinite pending a review. Three other MPs have had their trade envoy roles removed: Rosena Allin Khan, Bell Ribeiro-Addy and Mohammed Yasin. Politics latest: Suspended MPs defend their voting record  All seven had voted against the government's welfare reforms earlier this month. However, it is understood this is not the only reason behind the decision, with sources citing \"repeated breaches of party discipline\". More than 100 MPs had initially rebelled against the plan to cut personal independent payments (PIP). Ultimately, 47 voted against the bill's third reading, after it was watered down significantly in the face of defeat. Ms Maskell was one of the lead rebels in the welfare revolt, and has more recently called for a wealth tax to fund the U-turn.  The York Central MP has spoken out against the government on a number of other occasions since the election, including on winter fuel and cuts to overseas aid. Confirming the suspension, Ms Maskell told Sky News that she \"doesn't see herself as a rebel\" but \"somebody that is prepared to fulfil (her) role here of holding the executive to account and speaking truth to power\". She stopped short of criticising the decision, saying: \"I hold my hand out to the prime minister and hope he takes that and wants to reach back because I think it's really important that we work together.\" Ms Maskell was first elected in 2015, while the other suspended MPs were newly elected last year. Mr Hinchliff, the MP for North East Hertfordshire, has proposed a series of amendments to the flagship planning and infrastructure bill criticising the government's approach. Mr Duncan-Jordan, the MP for Poole, led a rebellion against the cut to the winter fuel payments while Alloa and Grangemouth MP Mr Leishman has been critical of the government's position on Gaza. Political correspondent After a tricky few weeks for the government, in which backbenchers overturned plans to cut back welfare spending, now a heavy hand to get the party into line.\n All four suspended MPs appear to be surprised - and upset.\n\n Three more have lost plum roles as trade envoys - all on the left of the party.\n\n All were active in the rebellion against the government's welfare reforms, and voted against the changes even after a series of U-turns - but were among 47 Labour MPs who did so.\n\n When MPs were told after the welfare vote that Number 10 was \"fully committed to engaging with parliamentarians\", this was not what they were expecting.\n\n We're told the reasons for these particular suspensions go wider - over \"persistent breaches of party discipline\" - although most are not high profile. In the scheme of things, Jeremy Corbyn and John McDonnell rebelled against the Labour whip hundreds of times under New Labour, without being suspended. But these MPs' pointed criticism of the Starmer strategy has clearly hit a nerve. Read Tamara's analysis in full here 'Couldn't support making people poorer' Mr Duncan-Jordan told Sky News that he understood speaking out against benefit cuts would \"come at a cost\" but said he \"couldn't support making disabled people poorer\". Mr Leishman echoed that sentiment, saying: \"I firmly believe that it is not my duty as an MP to make people poorer, especially those that have suffered because of austerity and its dire consequences.\" Both said they remain committed to the Labour Party and its values, suggesting they have no plans to join the new party being set up by former Labour leader Jeremy Corbyn and ousted MP Zarah Sultana. Similarly Mr Hinchliff said in a brief statement: \"I remain proud to have been elected as a Labour MP and I hope in time to return to the Labour benches.\" The suspensions will be seen as an attempt to restore discipline ahead of the summer recess following a number of rebellions that has forced the government into U-turns. As well as watering down the welfare bill, some cuts to the winter fuel payment have been reversed, leaving Chancellor Rachel Reeves with a fiscal blackhole to fill. However, the move risks creating further divisions with a number of Labour MPs criticising the decision. Read more:Who are the suspended Labour MPs? Starmer 'rolling out the carpet to Reform' Ian Byrne, Labour MP for Liverpool West Derby, said he was \"appalled\" by the suspensions as he and 44 others voted against welfare cuts. He said this isn't the first time the Starmer leadership has \"punished MPs for standing up for what's right\", as he and six others were suspended last year for voting against the two-child benefit cap. \"These decisions don't show strength. They are damaging Labour's support and risk rolling out the red carpet for Reform,\" he added. Richard Burgon, who was also temporarily suspended in the two-child benefit cap revolt, said he had hoped the leadership would take a different approach to backbenchers. \"Sadly, it isn't yet doing so. To help stop a Reform government, it really must do so,\" he said. Jon Trickett, Labour MP for Normanton and Hemsworth, said \"it's not a sin to stand up for the poor and disabled\", adding: \"Solidarity with the suspended four.\""
    },
    {
        "title": "Why suspended Labour MPs clearly hit a nerve with Starmer",
        "description": "After a tricky few weeks for the government, in which backbenchers overturned plans to cut back welfare&#160;spending, now a heavy hand to get the party into line.",
        "url": "https://news.sky.com/story/why-suspended-labour-mps-clearly-hit-a-nerve-with-starmer-13397618",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-starmer-keir-starmer_6966491.jpg?20250716193954",
        "type": "UK",
        "Author": "Tamara Cohen",
        "Date Published": "2025-07-16 17:13:00",
        "Headline": "Number 10 wants to show rebelling comes at a price - but many Labour MPs with concerns about their political direction will want to know the prime minister is planning to listen to concerns before it gets to that point. ",
        "Content": "\n          Political correspondent\n              @tamcohen\n  After a tricky few weeks for the government, in which backbenchers overturned plans to cut back welfare spending, now a heavy hand to get the party into line. Three newly-elected MPs, Neil Duncan-Jordan, MP for Poole, Brian Leishman, MP for the new Alloa and Grangemouth constituency, and Chris Hinchcliff, for North East Herefordshire, have all had the whip suspended. Rachael Maskell, MP for York Central, who was first elected a decade ago, is the fourth. Politics latest: Labour MP 'appalled' after Starmer suspends rebels They will all sit as independent MPs and will not be allowed to stand for Labour at the next election, unless readmitted. All appear to be surprised - and upset. Three more have lost plum roles as trade envoys - Dr Rosena Allin-Khan, Bell Ribeiro-Addy and Mohammed Yasin, all on the left of the party. All were active in the rebellion against the government's welfare reforms, and voted against the changes even after a series of U-turns - but were among 47 Labour MPs who did so. When MPs were told after the welfare vote that Number 10 was \"fully committed to engaging with parliamentarians\", this was not what they were expecting. We're told the reasons for these particular suspensions go wider - over \"persistent breaches of party discipline\" - although most are not high profile. In the scheme of things, Jeremy Corbyn and John McDonnell rebelled against the Labour whip hundreds of times under New Labour, without being suspended. But these MPs' pointed criticism of the Starmer strategy has clearly hit a nerve.  Maskell - who was referred to, jokingly, in the House of Commons earlier this month by Tory MP Danny Kruger as \"the real prime minister\" - led the rebellion against cuts to winter fuel allowance which triggered a U-turn which she said would still leave pensioners in fuel poverty. There was an attack on the government's values. Duncan-Jordan, a trade unionist who won the Poole seat by just 18 votes, led the welfare rebellion, telling Sky News the proposed cutbacks were \"not a very Labour thing to do\". Hinchliff, who has also opposed the government's housebuilding strategy and plans to expand Luton airport,had told his local paper he was willing to lose the whip over welfare cuts if necessary. He also has a marginal seat, won by fewer than 2,000 votes. Read more:Who are the suspended Labour MPs? Leishman, a former pro golfer, has also been vocal about government plans to close the refinery in his Grangemouth constituency after promising to try and make it viable. They are MPs who the leadership fear are going for broke - and that's concerning as more tough decisions on spending are likely to come. But after a poorly-handled welfare vote, in which MPs seemed to be in the driving seat forcing changes, will this instil a sense of discipline over the summer break? While some MPs will see this as a deterrent to rebellion, for those whose chances of re-election are small, it may continue to be seen as a price worth paying. To other Labour MPs, the move is confusing and may be counter-productive. One Labour MP on the left told me: \"So, we're suspending people for winning an argument with the government?\" Another, in the centre, feared it looked divisive, saying: \"We need to go into the summer focused on the opposition - not involved in our melodramas.\" Number 10 wants to show rebelling comes at a price - but many Labour MPs with concerns about their political direction will want to know the prime minister is planning to listen to concerns before it gets to that point."
    },
    {
        "title": "'Betrayed' Afghan interpreter says family 'waiting for death' under Taliban after UK military data breach",
        "description": "An Afghan interpreter who worked with the British military has told Sky News he feels \"betrayed by the British government\" after a massive data breach saw his personal details revealed.",
        "url": "https://news.sky.com/story/betrayed-afghan-interpreter-says-family-waiting-for-death-under-taliban-after-uk-military-data-breach-13397647",
        "image_url": "https://e3.365dm.com/21/12/1920x1080/skynews-mod-afghanistan-afghanistan_5607564.jpg?20211207173808",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-16 17:52:00",
        "Headline": "He tells Sky News he suspected his data had been leaked after his father \"died because the Taliban took him into custody and beat him\".",
        "Content": " An Afghan interpreter who worked with the British military has told Sky News he feels \"betrayed by the British government\" after a massive data breach saw his personal details revealed. Ali, whose name has been changed to protect his identity, had long suspected his details had been shared with the Taliban - but found out just yesterday that he was a victim of the breach three years ago. He is now even more fearful for the lives of family members still in Afghanistan, who are already in hiding from the Taliban. Ali worked alongside British soldiers in Helmand Province to help them speak with Afghan people. His job also involved listening in on Taliban radio communications and translating them for the British forces. \"The Taliban called us the British eyes,\" he told Sky News. \"Because they think if we are not on the ground with them, the British force cannot do anything. \"They know that you're listening to their chatting and the British forces are acting according to our translation. We were always the first target and our job was always full of risk.\"  After the Taliban seized power in Afghanistan in 2021, Ali - who had already suffered injuries after the Taliban targeted him with a car bomb - was brought to the UK through the British government's Afghan Resettlement Programme (ARP) for his own protection. Once in the UK, he began to suspect his data had been leaked after his father \"died because the Taliban took him into custody and beat him\". Ali contacted the Ministry of Defence to raise concerns over his personal information last year, and stated in an email that he was \"terrified\", adding: \"I beg of you, do not pass this information to anyone.\" \"They just ignored what I told them and they never replied,\" he said.  'The Taliban want me' Following confirmation that the data breach did take place, Ali is even more scared for the lives of his family members who have already been in hiding from the Taliban for around five months. \"I'm feeling terrible and frustrated,\" he said. \"My family's details have been shared with the Taliban intelligence forces and now they are looking for them. \"Every day, every single minute, my family's waiting for their death, because if anyone comes to knock the door, they think that that is the Taliban.\" 👉 Listen to Sky News Daily on your podcast app 👈 Ali has twice applied for his family to be relocated to the UK but both applications have been rejected. He is now renewing his call for the British government to move his loved ones. \"I have carried the body of the British soldier,\" he said. \"I feel betrayed by the British government. They should relocate my family to a safe place.\" Read more:Afghan man pleads for King's help after data leakHow Afghan data breach unfolded'Serious questions to answer' over data breach, says PM Ali has decided he will return to his homeland to help his family if they are not granted legal passage to the UK. \"If we don't win [the case], I have decided I want to go back to Afghanistan and finish this,\" he said. \"The Taliban want me. If the British government can't save my family, then I have this one responsibility to go and save them. \"I don't want my family being killed for something they didn't do.\" Sky News has contacted the Ministry of Defence for comment."
    },
    {
        "title": "Photograph of Queen Camilla released to celebrate 78th birthday",
        "description": "A photograph of the Queen has been released to celebrate her 78th birthday.",
        "url": "https://news.sky.com/story/photograph-of-queen-camilla-released-to-celebrate-78th-birthday-13397710",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-camilla-queen_6966575.jpg?20250716214842",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-16 20:18:00",
        "Headline": "The picture shows Her Majesty smiling in the sunshine, looking relaxed at her private home in Wiltshire.",
        "Content": "A photograph of the Queen has been released to celebrate her 78th birthday. The picture of Camilla was taken earlier this month in front of a meadow at her Wiltshire home, Raymill. It shows Her Majesty smiling in the sunshine, looking relaxed and leaning on a metal gate. She is seen wearing a turquoise dress in a Liberty fabric printed with a rainforest of toucans, lemurs and monkeys. In the image taken by photographer Chris Jackson to mark her birthday on Thursday, Camilla can be seen wearing gold drop earrings and a delicate gold bracelet. Last year, Camilla was on duty on her birthday, attending the state opening of parliament at the King's side. This year, she is said to be spending the day privately.  Read more from Sky News:Harry follows in Diana's footstepsKing and Idris Elba discuss knife crime At the start of April, she celebrated her 20th wedding anniversary, and she and the King have had a busy run of engagements. They included hosting a state visit by French President Emmanuel Macron last week ahead of the royal couple's upcoming annual summer break in Scotland. On Wednesday, the Queen was gifted a roll of clingfilm for her birthday in a special holder when she visited a nuclear-powered submarine in Plymouth. The wrapping was used to fix a defect in the main engines of HMS Astute. \"There's nothing more useful, brilliant, how wonderful,\" the Queen said about the present, which had a small plaque with the words \"Clingflim keeping nuclear submarines at sea\". In May, new portraits of the King and Queen, commissioned to commemorate their coronation in 2023, were unveiled."
    },
    {
        "title": "Lionesses stumbled at start of Euros but feel like 'Proper England' again",
        "description": "Beyond the home comforts at the Lionesses' temporary base in Zurich, a permanent slice of English life can be found here at the Nelson.",
        "url": "https://news.sky.com/story/lionesses-stumbled-at-start-of-euros-but-feel-like-proper-england-again-13397690",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-england-lionesses_6966611.jpg?20250716225613",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-07-16 19:24:00",
        "Headline": "As Sarina Wiegman's side prepares to face Sweden on Thursday in the quarter-finals, \"Proper England\" is a concept serving as a rallying cry as much as a footballing philosophy.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  Beyond the home comforts at the Lionesses' temporary base in Zurich, a permanent slice of English life can be found here at the Nelson. And while you'll never find the players dropping into the pub, the sign - \"the real English place\" - chimes with the team's mantra. Spending recent weeks around the team, there is constant talk about a \"Proper England\" approach to games. It was used to inspire the recovery through the group stage at Euro 2025, galvanising the Lionesses after opening their trophy defence with a defeat to France. And as Sarina Wiegman's side prepares to face Sweden on Thursday in the quarter-finals, it is a concept serving as a rallying cry as much as a footballing philosophy.  For some players, it's about showing fight and togetherness. For others, about being resilient and hard to beat. The best insight came from asking the player who has seen so much. Lucy Bronze is at her seventh major tournament with England under her fourth permanent manager. It was with Wiegman that she finally won a trophy with her country at Euro 2022 - adding to her collection of major club titles. \"We've never negated tactics or anything else that comes with the game with the term 'Proper England',\" Bronze said. \"I think it was more the fact that we've said again, we're a new England and new team. \"And what was meant by that was we had a lot of younger players and new players who have very different experiences of playing for England compared to the likes of myself where we know that England used to have to dig deep all the time, dig out performances and maybe as the underdog. You're not the favourites. \"Whereas this England team has developed. Football has changed. Obviously we're a very talented team. A lot of technical ability, tactics. All that comes in the game. \"But we don't want to ever forget that we are England. We are 'Proper England'. And if push comes to shove, we can win a game by any means possible.\" For Wiegman, the concept is still rooted in tactics, but more than that. \"Also our behaviours,\" she said. \"How we want to support each other together, work really hard and of course play to our strengths.\" Maybe there is nothing more English than a pint and fish and chips - even the Swiss version at the Nelson. There is even a darts board there. But that's one area Wiegman concedes she does not excel at. Both Wiegman and Bronze agreed, the team's darts star is Lauren Hemp. We don't know about Sweden's darts credentials but we know they are a country influenced by English football going back to the 19th century. And many of this Euros squad have experience with English clubs, including Kosovare Asllani - a league and cup winner with Manchester City, who just took the London City Lionesses into the Women's Super League. \"We always had the physical part,\" the Sweden captain said. \"I feel the Swedish team has become a more technical side and we play more intense football \"So I think the combination... is why we have been developing so much as a national team. But I think the English team definitely has the physical part as well.\" Read more:How far has women's football come since 1972?Why this Women's Euros is so appealing But it is Sweden who won all three group games - peaking with a 4-1 humiliation of Germany. England stumbled at the start but feel like \"Proper England\" again."
    },
    {
        "title": "Tomorrowland: 'Devastating' blaze destroys main stage at major festival - two days before it was due to begin",
        "description": "A huge fire has destroyed the main stage of a major festival in Belgium - two days before it was due to begin.",
        "url": "https://news.sky.com/story/tomorrowland-devastating-blaze-destroys-main-stage-at-major-festival-two-days-before-it-was-due-to-begin-13397743",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-tomorrowland-belgium_6966626.jpg?20250716234247",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-16 21:56:00",
        "Headline": "The event is famous for its immersive and elaborate designs, and attracts big names including David Guetta, Swedish House Mafia, Eric Prydz and Alok.",
        "Content": " A huge fire has destroyed the main stage of a major festival in Belgium - two days before it was due to begin. Tomorrowland is a dance music event as big as Glastonbury - and David Guetta was due to perform. Footage showed flames and thick plumes of black smoke engulfing the stage and spreading to nearby woodland on Wednesday. The annual festival in the town of Boom, north of Brussels, is one of the biggest in Europe and attracts about 400,000 people over two consecutive weekends. It is famous for its immersive and elaborate designs and attracts big names within dance music - including Guetta, best known for tracks When Love Takes Over and Titanium. Dutch DJs Martin Garrix and Charlotte de Witte were also due to perform, along with the likes of Swedish House Mafia, Eric Prydz and Alok. The festival's website described the creative elements which went into the elaborate main stage. \n                  Three Belgian soldiers injured in 'shooting incident' during training exercise in Scotland\n                 \n                  Tate Britain to return painting 'looted by Nazis'\n                 \n                  Manhunt after shooting at Brussels underground station\n                 The theme, described as Orbyz, was \"set in a magical universe made entirely out of ice\" and \"full of mythical creatures\". Read more from Sky News:Ticketless Oasis fans blocked from gigAmerican Idol executive shot dead Organisers said no one was injured in the blaze but confirmed \"our beloved main stage has been severely damaged\", adding they were \"devastated\". Spokesperson Debby Wilmsen added: \"We received some truly terrible news today. A fire broke out on the Tomorrowland site ... and our main stage was essentially destroyed there, which is truly awful. \"That's a stage that took years to build, with so much love and passion. So I think a lot of people are devastated.\" Despite the fire, Tomorrowland organisers said they were still expecting 38,000 festivalgoers at DreamVille, the event's campsite."
    },
    {
        "title": "Israel attacks Syrian military HQ - and disrupts live TV broadcast",
        "description": "Israeli airstrikes have targeted the Syrian military headquarters in Damascus amid renewed clashes in the country.",
        "url": "https://news.sky.com/story/israel-attacks-syrian-military-hq-in-damascus-and-issues-warning-to-leave-religious-minority-group-alone-13397411",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-syria-damascus-defence_6966154.jpg?20250716135721",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-16 11:31:00",
        "Headline": "The Israeli military says it is monitoring \"actions being taken against Druze civilians\" - but Syria says its forces have been responding to the \"source of fire\" inside the southern city of Sweida.",
        "Content": " Israeli airstrikes have targeted the Syrian military headquarters in Damascus amid renewed clashes in the country. The gate of the Ministry of Defence in the Syrian capital was targeted by two warning missiles from an Israeli reconnaissance aircraft. State-owned Elekhbariya TV said the Israeli strike had wounded two civilians, the Reuters news agency reported. It came as Israeli airstrikes targeted security and army vehicles in the southern city of Sweida, where the Druze faith is one of the major religious groups - marking the third consecutive day Israel has struck Syrian forces. The Israeli military confirmed it had \"struck the entrance gate\" in Damascus - and that it would be monitoring \"actions being taken against Druze civilians in southern Syria\". International affairs editor Israel has shown little respect for international borders since becoming the unrivalled military hegemon of the Middle East.  Today that meant an Israeli airstrike on a government building in Damascus. Israel says its attack on a Syrian defence ministry facility was intended as a warning to the new government: stay out of the part of southern Syria we have occupied or else. Israel has moved into parts of the south of the country, built military bases and declared a line of control. On Monday, Syrian tanks heading south to try and restore order following an outbreak of factional fighting were attacked by Israeli warplanes. \"The presence of such vehicles in southern Syria could pose a threat to Israel,\" stated the Israel Defence Forces. In reality, Syria's ageing tanks pose minimal threat to Israel's state-of-the art military. Read the full analysis Local media said Sweida and nearby villages were coming under heavy artillery and mortar fire on Wednesday, according to Reuters. The clashes marked the collapse of a ceasefire between Syrian government forces and Druze armed groups, with Israel also warning it would increase its involvement. Israel said it was acting to protect the Druze groups through its attacks on convoys of Syrian forces. Syria blamed militias in Sweida for violating a ceasefire agreement which had only been reached on Tuesday. Read more from Sky News:'My family is finished': Afghan man feels betrayedHarry follows in Diana's charity footsteps  A statement from its defence ministry said: \"Military forces continue to respond to the source of fire inside the city of Sweida, while adhering to rules of engagement to protect residents, prevent harm, and ensure the safe return of those who left the city back to their homes.\" Israel's defence minister Israel Katz said the military will continue to strike Syrian forces until they withdraw and should \"leave Druze alone\", according to local reports."
    },
    {
        "title": "Why Israel is getting involved in Syria's internal fighting",
        "description": "Israel has shown little respect for international borders since becoming the unrivalled military hegemon of the Middle East.&#160; Today that meant an Israeli airstrike on a government building in Damascus.",
        "url": "https://news.sky.com/story/why-israel-is-getting-involved-in-syrias-internal-fighting-13397487",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-golan-heights-syria_6966188.jpg?20250716143334",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-07-16 13:21:00",
        "Headline": "Israel is becoming further involved in Syria's internecine war and says it will remain there indefinitely \"to protect our communities\".",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n Israel has shown little respect for international borders since becoming the unrivalled military hegemon of the Middle East.  Today that meant an Israeli airstrike on a government building in Damascus. Israel says its attack on a Syrian defence ministry facility was intended as a warning to the new government: stay out of the part of southern Syria we have occupied or else. Israel has moved into parts of the south of the country, built military bases and declared a line of control. On Monday, Syrian tanks heading south to try and restore order following an outbreak of factional fighting were attacked by Israeli warplanes. \"The presence of such vehicles in southern Syria could pose a threat to Israel,\" stated the Israel Defence Forces. In reality, Syria's ageing tanks pose minimal threat to Israel's state-of-the art military.  The Syrian armour was attacked as it entered the area around Sweida in the Druze heartland of southern Syria following factional fighting there. \n                  Israel attacks Syrian military HQ - and disrupts live TV broadcast\n                 \n                  'At least 59 killed' in Gaza after Israeli military opens fire near aid centre and carries out strikes\n                 \n                  Dozens of MPs call for UK government to recognise Palestine as state\n                 The flare-up reportedly began with clashes between Bedouin and Druze groups that ended in scores killed. The background to the escalation is complicated. At least three Druze militia groups are divided in their loyalties to different religious leaders and differ over how they should respond to calls to assimilate into the new post-revolutionary Syria. Read more:30 dead as armed groups clash in SyriaUK restores diplomatic ties with Syria Israel is becoming more and more involved in Syria's internecine war and says it will remain there indefinitely \"to protect our communities and thwart any threat\". Its critics say Israel is operating a policy of divide and rule in Syria, weakening the fledgling government and creating a buffer zone to protect the border with the Golan Heights - originally Syrian territory that it has occupied and annexed for almost half a century. Since the fall of the Assad regime, Israel has used airstrikes to destroy of much of Syria's military capability weakening its ability to impose control on outlying regions. This makes it more not less likely Israel will have a volatile unstable state on its northern border. America and European powers have chosen to normalise relations with the new government in Damascus and lift sanctions. In contrast Israel has occupied its territory, bombed its military and today hit one of its government buildings in the capital with an airstrike. Since its crushing military campaigns against Hamas, Hezbollah and Iran, Israel has emerged as the unchallenged military power of the region. There is however a limit to what blunt force can achieve alone. It requires diplomacy to achieve lasting gains and Israel's repeated assaults on multiple neighbours combined with its relentless campaign in Gaza are winning it few friends in the region."
    },
    {
        "title": "'Betrayed' Afghan interpreter says family 'waiting for death' under Taliban after UK military data breach",
        "description": "An Afghan interpreter who worked with the British military has told Sky News he feels \"betrayed by the British government\" after a massive data breach saw his personal details revealed.",
        "url": "https://news.sky.com/story/betrayed-afghan-interpreter-says-family-waiting-for-death-under-taliban-after-uk-military-data-breach-13397647",
        "image_url": "https://e3.365dm.com/21/12/1920x1080/skynews-mod-afghanistan-afghanistan_5607564.jpg?20211207173808",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-16 17:52:00",
        "Headline": "He tells Sky News he suspected his data had been leaked after his father \"died because the Taliban took him into custody and beat him\".",
        "Content": " An Afghan interpreter who worked with the British military has told Sky News he feels \"betrayed by the British government\" after a massive data breach saw his personal details revealed. Ali, whose name has been changed to protect his identity, had long suspected his details had been shared with the Taliban - but found out just yesterday that he was a victim of the breach three years ago. He is now even more fearful for the lives of family members still in Afghanistan, who are already in hiding from the Taliban. Ali worked alongside British soldiers in Helmand Province to help them speak with Afghan people. His job also involved listening in on Taliban radio communications and translating them for the British forces. \"The Taliban called us the British eyes,\" he told Sky News. \"Because they think if we are not on the ground with them, the British force cannot do anything. \"They know that you're listening to their chatting and the British forces are acting according to our translation. We were always the first target and our job was always full of risk.\"  After the Taliban seized power in Afghanistan in 2021, Ali - who had already suffered injuries after the Taliban targeted him with a car bomb - was brought to the UK through the British government's Afghan Resettlement Programme (ARP) for his own protection. Once in the UK, he began to suspect his data had been leaked after his father \"died because the Taliban took him into custody and beat him\". Ali contacted the Ministry of Defence to raise concerns over his personal information last year, and stated in an email that he was \"terrified\", adding: \"I beg of you, do not pass this information to anyone.\" \"They just ignored what I told them and they never replied,\" he said.  'The Taliban want me' Following confirmation that the data breach did take place, Ali is even more scared for the lives of his family members who have already been in hiding from the Taliban for around five months. \"I'm feeling terrible and frustrated,\" he said. \"My family's details have been shared with the Taliban intelligence forces and now they are looking for them. \"Every day, every single minute, my family's waiting for their death, because if anyone comes to knock the door, they think that that is the Taliban.\" 👉 Listen to Sky News Daily on your podcast app 👈 Ali has twice applied for his family to be relocated to the UK but both applications have been rejected. He is now renewing his call for the British government to move his loved ones. \"I have carried the body of the British soldier,\" he said. \"I feel betrayed by the British government. They should relocate my family to a safe place.\" Read more:Afghan man pleads for King's help after data leakHow Afghan data breach unfolded'Serious questions to answer' over data breach, says PM Ali has decided he will return to his homeland to help his family if they are not granted legal passage to the UK. \"If we don't win [the case], I have decided I want to go back to Afghanistan and finish this,\" he said. \"The Taliban want me. If the British government can't save my family, then I have this one responsibility to go and save them. \"I don't want my family being killed for something they didn't do.\" Sky News has contacted the Ministry of Defence for comment."
    },
    {
        "title": "Gaza: At least 20 killed near distribution site, says Israel-backed aid group",
        "description": "At least 20 people have been killed in an incident in Khan Younis, according to the Gaza Humanitarian Foundation (GHF), an Israel and US-backed organisation.",
        "url": "https://news.sky.com/story/at-least-19-killed-in-crowd-crush-near-distribution-site-says-israel-backed-aid-group-13397268",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-khan-younis-gaza_6965890.jpg?20250716090429",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-16 07:48:00",
        "Headline": "In a statement, the controversial Gaza Humanitarian Foundation said 19 people were trampled and one was stabbed in a surge \"driven by agitators in the crowd\".",
        "Content": "At least 20 people have been killed in an incident in Khan Younis, according to the Gaza Humanitarian Foundation (GHF), an Israel and US-backed organisation. In a statement, it said 19 people were trampled and one was stabbed in a surge \"driven by agitators in the crowd\". \"We have credible reason to believe that elements within the crowd - armed and affiliated with Hamas - deliberately fomented the unrest,\" it said. \"For the first time since operations began, GHF personnel identified multiple firearms in the crowd, one of which was confiscated. An American worker was also threatened with a firearm by a member of the crowd during the incident.\" It provided no evidence to support the claim. The Hamas-run Gaza health ministry claimed 21 Palestinians were killed, \"including 15 who died of suffocation as a result of tear gas fired at the starving people and the subsequent stampede\" at the GHF site. Read analysis: Deaths go up when aid sites open  The statement is unusual for the GHF, as the controversial group, which has been rejected by the United Nations and other aid groups, rarely acknowledges trouble at its distribution sites. The GHF began distributing food packages in Gaza at the end of May, after Israel eased its 11-week blockade of aid into the territory. It has four distribution centres, three of which are in the southern Gaza Strip. The sites, kept off-limits to independent media, are guarded by private security contractors and located in zones where the Israeli military operates. by Lisa Holland, Sky News correspondent in Jerusalem The United Nations has already condemned the aid centres run by the Gaza Humanitarian Foundation as \"death traps\" - and that was before the latest loss of life, seemingly mostly from suffocation. It's the first and only time we know of people dying in this way, waiting to get food.  Although the Gaza health ministry and the GHF dispute exactly what happened. But how much longer can this Israeli and American-backed way to supply aid continue when people are dying on a near-daily basis? However it happened, Gaza's overcrowded hospitals are once again overwhelmed. And there are serious questions to answer about the organisation of a system which is supposed to be providing humanitarian aid to desperately hungry people, but instead is a place where there is so much loss of life. It leaves people with an unbearable choice between risking their lives to get supplies or going hungry. Palestinian witnesses say Israeli forces have repeatedly opened fire towards crowds of people going to receive aid. The Israeli military says it has fired warning shots at people who have behaved in what it says is a suspicious manner. It says its forces operate near the aid sites to stop supplies from falling into the hands of militants. After the deaths of hundreds of Palestinians trying to reach the aid hubs, the UN has called the GHF's aid model \"inherently unsafe\" and a violation of humanitarian impartiality standards. In response, a GHF spokesperson said: \"The fact is the most deadly attacks on aid sites have been linked to UN convoys.\" The GHF says it has delivered more than 70 million meals to Gazans in five weeks and claims other humanitarian groups - which refuse to work with the GHF - had \"nearly all of their aid looted\" by Hamas or criminal gangs. Read more:Medical charity warns acute malnutrition at all-time highUN data on Gaza deaths 'disinformation', claims GHF chief Since the GHF sites began operating, more than 875 people have been killed while receiving aid, both at GHF distribution points or elsewhere, according to the UN human rights office and the Hamas-run Gaza health ministry. At least 674 of those have been killed in the vicinity of aid distribution sites run by the GHF."
    },
    {
        "title": "Why Trump has turned his back on Putin - somewhat",
        "description": "When Donald Trump arrived at the White House for the first time nine years ago, he vowed to tear up the rule book, upend the world order and fundamentally change America's approach to its foreign relations.",
        "url": "https://news.sky.com/story/why-trump-has-turned-his-back-on-putin-somewhat-13397610",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-yalda-hakim-trump_6966597.png?20250716223111",
        "type": "World",
        "Author": "Yalda Hakim",
        "Date Published": "2025-07-16 16:51:00",
        "Headline": "Donald Trump's decision to sell Ukraine weapons through NATO and threaten tariffs on Russia if they do not come agree to a ceasefire in 50 days is evidence of his frustration with Vladimir Putin.",
        "Content": "\n          Lead world news presenter\n              @SkyYaldaHakim\n  When Donald Trump arrived at the White House for the first time nine years ago, he vowed to tear up the rule book, upend the world order and fundamentally change America's approach to its foreign relations. Nearly a decade on, aged by realpolitik and a war on the European continent and conflicts in the Middle East, President Trump is now treading a path that all the second-term presidents before him took when it comes to Russia. He spent his first term trying to appease Vladimir Putin, courting him as he did Kim Jong Un and Xi Jinping, perhaps a mix of respect for other strong male leaders and business-like charm. Don't forget, Trump's worldview is shaped entirely by his time as a New York real estate mogul. He has his patch of the world, and Putin has his. There should be no reason for frosty relations. But Trump is not dealing with another property tycoon. Putin is a maximalist former KGB officer who cut his teeth in the murky underworld of the decaying Soviet Union where deception and double-dealing was the currency. Putin plays chess, whereas Trump plays Monopoly. Now in his second term, Trump has turned his back on the Russian leader somewhat. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 His latest decision to sell Ukraine weapons through NATO and threaten tariffs on Russia if they do not come to an agreement within 50 days is evidence of his frustration - and the first lady's advice. But 50 days is child's play for a man who deals in decades, if not centuries. No doubt the Russians are shrugging this threat off. Read more:Israel attacks Syrian military HQTrump is clearly fed up with Putin - analysis Putin is playing the long game - he has seen out American presidents, and he will probably see the back of Donald Trump. For now, it seems that Ukraine has come out on top. But the only thing as constant as Vladimir Putin is Trump's unpredictability."
    },
    {
        "title": "Deadly crush at Gaza aid site after new system implemented",
        "description": "Twenty one people have been killed following a crush at an aid distribution site in Gaza, according to local health officials.",
        "url": "https://news.sky.com/story/deadly-crush-at-gaza-aid-site-after-new-system-implemented-13397540",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-gaza-aid-site-khan-younis_6966235.png?20250716154338",
        "type": "World",
        "Author": "Ben van der Merwe, Michelle Inez Simon and Sam Doak, Data &amp; Forensics Unit",
        "Date Published": "2025-07-16 14:42:00",
        "Headline": "Eyewitness testimony and analysis of social media posts suggests that the crush was the result of systemic failures of communication and crowd control at the Gaza Humanitarian Foundation aid site.",
        "Content": "By Ben van der Merwe, Michelle Inez Simon and Sam Doak, Data & Forensics Unit  Twenty one people have been killed following a crush at an aid distribution site in Gaza, according to local health officials. Footage shows young men being rushed to the nearby Nasser hospital in the immediate aftermath of the incident on Wednesday morning. At least 17 of the victims died from suffocation, according to one of the hospital's doctors, Dr Muhammad Saqr. The crush is the latest in a string of incidents that have plagued the Gaza Humanitarian Foundation (GHF), an Israel- and US-backed organisation tasked with delivering aid in Gaza. It comes one day after GHF implemented a new system at the site whereby red and green flags are used to tell Palestinians whether the aid centre is open, rather than posts on social media. Analysis by Sky News shows that GHF stopped announcing the timings of aid site openings more than a week before the new system was put in place. Of the 13 aid distributions since 6 July, only one was announced by GHF. The flag system was implemented following widespread criticism of GHF's protocols after numerous reports of fatal mass shootings near its aid sites. The footage below was taken on Tuesday at the site where the crush occurred, known as Secure Distribution Site 3 (SDS3). It shows a red flag above the site following an aid distribution. \"The new system doesn't tell you when to go,\" says Ahmed Dhair, who was present at the crush this morning. \"To see the flag, you have to go very, very close to the centre.\" Another person says that everyone goes early to the aid centre. \"If they follow the flags, they will not have time to reach the centre.\" Sky News spoke to five Palestinians who were present at the stampede. Their accounts suggest that the crush was the result of systemic failures of communication and crowd control by GHF. Decision to approach  Father-of-four Ahmed, 36, told Sky News that \"thousands\" of people had been waiting nearby for the site, SDS3, to open. Three eyewitnesses, including Ahmed, said that the crowd began to approach the aid site at around 6am after seeing the withdrawal of IDF vehicles. Ahmed says this has become standard practice since GHF stopped announcing opening times in advance. \"This is what usually happens: we head to the site, get shot at for a while, then sleep on the ground so we don't get hit,\" he says. \"When the [military] vehicles withdraw, we run very quickly until we get aid.\" Alaa, aged 39, says that people ran towards the aid centre only to find that it was still closed. Outside the centre, he says, was a 10-metre wide passageway enclosed by barbed wire on either side. Footage from the site, taken on Tuesday, shows this area and the barbed wire fencing around it. \"It was a small corridor for the number of people,\" Alaa says. All five eyewitnesses who spoke to Sky News said that GHF employees then attempted to disperse the crowd using gunfire and either gas or pepper spray - resulting in a stampede. \"People began to push until [the Americans] opened the gates,\" says Alaa. \"Children and some young people fell - and here was the disaster, as people trampled on them due to the pressure of the crowd.\" A GHF spokesperson denied that tear gas was deployed or that shots were fired into the crowd. \"Limited use of pepper spray was deployed, only to safeguard additional loss of life,\" they said. Why did people go to the aid centre?  GHF had not announced any site openings for Wednesday, raising questions over why so many people attempted to access SDS3 this morning. GHF blamed false reports of site openings, which it said were \"fuelling confusion, driving crowds to closed sites, and inciting disorder\". But witnesses said they attended because GHF has repeatedly failed to announce site openings in advance. All six openings at SDS3 since 6 July have had no prior announcement. In one case, the site opened after GHF had announced that it would remain closed. \"If the opening time of the aid point was posted on the official page, what happened today would not have happened,\" said one person on the GHF's official WhatsApp channel. Ahmed says that the GHF's social media announcements have \"no credibility\". \"Most of the time they say it is closed and then it is opened,\" he says. \"They say they will open the centre at 10am, and then we are surprised that they opened it at 9am.\" Another person who was present at the crush said he had turned up because the site had opened the previous day without any prior announcement. \"Please can you contact any of the security personnel and inform me of the opening time of the aid site before it opens, so that I can bring flour to my family?\" one Palestinian asked Sky News. \"We are going through famine and have been without food for three days now.\" Lisa Holland, Sky Correspondent in Jerusalem The United Nations has already condemned the aid centres run by the Gaza Humanitarian Foundation as ‘death traps’ – and that was before the latest loss of life in which 21 people died seemingly mostly from suffocation. It’s the first and only time we know of people dying in this way waiting to get food.  Although the Gaza Health Ministry and the GHF dispute exactly what happened. But how much longer can this Israeli and American backed way to supply aid continue when people are dying on a near daily basis? However it happened Gaza’s over-crowded hospitals are once again overwhelmed. And there are serious questions to answer about the organisation of a system which is supposed to be providing humanitarian aid to desperately hungry people  - but instead is a place where there is so much loss of life. It leaves people with an unbearable choice between risking their lives to get supplies or going hungry. Chaos of the system  A Palestinian former employee of GHF told Sky News that he had quit the organisation last month because of its failure to improve its systems. \"The reason I left the organisation is because they did not take into account the suggestion of doing pre-registration like other organisations so that there is a fair and honest system for the crowds,\" he says. \"It should be done by ID card,\" says Ahmed. \"It is not fair for a person to be coming every day, selling the food and keep stealing again. I went almost 20 times and not once did I get a box because I can't run.\" A GHF spokesperson said: \"Today's incident is part of a larger pattern of Hamas trying to undermine and ultimately end GHF.\" In a written statement, the Hamas-run Government Media Office denied the allegations, saying that GHF \"vainly seeks to evade responsibility for one of the most heinous organised massacres committed against the starving in Gaza since the start of the genocide\". Rising number of GHF casualties  A total of 674 people have been killed while trying to collect food from GHF sites, according to the UN. These numbers do not include the latest casualties from Wednesday's incident. Sky News analysis has found that deaths across the Gaza Strip as a whole increase significantly on days when more GHF sites are open. \"We have no more beds to put patients on - we're putting patients on the ground,\" says Dr Muhammad Saqr at Nasser hospital. \"We can no longer deal with any more casualties coming from GHF or other centres.\"  Additional reporting by Adam Parker, OSINT editor. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Fauja Singh: Man arrested over hit-and-run death of world's 'oldest' marathon runner",
        "description": "Police in India have arrested a man in connection with the death of a 114-year-old British runner in a hit-and-run accident.",
        "url": "https://news.sky.com/story/man-arrested-over-hit-and-run-death-of-worlds-oldest-marathon-runner-13397321",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-singh-fauja_6965050.jpg?20250715043015",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-16 08:09:00",
        "Headline": "British marathon runner Fauja Singh was hit by a car while crossing a road on a trip to India.",
        "Content": "Police in India have arrested a man in connection with the death of a 114-year-old British runner in a hit-and-run accident. Fauja Singh - believed to be the oldest in the world to complete a marathon - was hit by a car on Monday while crossing a road during a trip to his birth village of Beas Pind in Punjab, India. He suffered severe head injuries and was taken to hospital where he later died. Police investigating the incident have arrested a 26-year-old man for allegedly hitting him with a car, local media NDTV reported. The accused, named by the outlet as Amritpal Singh Dhillon, said that he learnt about the death of Mr Singh through the news. During a news conference, senior police officer Harvinder Singh Virk suggested the accused was speeding at the time of the collision. His Toyota Fortuner was identified using CCTV footage and parts of the vehicle were allegedly found at the scene. Singh had lived in Ilford in east London since 1992, and become an inspiration for countless athletes by running marathons beyond his 100th birthday. His athletic achievements were made even more remarkable considering he suffered from thin and weak legs as a child - and couldn't walk until he was five years old. Singh's maiden marathon in London was in 2000, with a time of six hours and 54 minutes - 58 minutes faster than other runners of a comparable age. After serving as a torchbearer at the London 2012 Olympics aged 101, he retired."
    },
    {
        "title": "Ghislaine Maxwell could use 'government misconduct' to challenge imprisonment",
        "description": "Disgraced British socialite Ghislaine Maxwell could use \"government misconduct\" to challenge her imprisonment, her family has claimed.",
        "url": "https://news.sky.com/story/ghislaine-maxwell-could-use-government-misconduct-to-challenge-imprisonment-13397369",
        "image_url": "https://e3.365dm.com/23/03/1920x1080/skynews-jeffrey-epstein-ghislaine-maxwell_6095539.jpg?20240104062050",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-16 10:09:00",
        "Headline": "The disgraced British socialite was jailed for luring young girls to paedophile Jeffrey Epstein's properties for him to sexually abuse.",
        "Content": "Disgraced British socialite Ghislaine Maxwell could use \"government misconduct\" to challenge her imprisonment, her family has claimed. The 63-year-old, who was jailed in 2022 for luring young girls to massage rooms for Jeffrey Epstein to abuse, is currently serving a 20-year prison sentence. Maxwell's family have frequently claimed she \"did not receive a fair trial\", but legal appeals against her sex trafficking convictions have been rejected by the courts. The latest challenge from the Maxwell family comes as President Donald Trump faces questions over whether or not he will order the release of the so-called Epstein \"client list\", following a backlash from Republican loyalists who have called for any list to be made public. Judges previously dismissed arguments from Maxwell's lawyers that she \"should never have been prosecuted\" because of a \"weird\" agreement drafted more than 15 years ago. The family argue that Maxwell should have been protected under an agreement Epstein had entered with the US Department of Justice in 2007, which agreed not to prosecute any of his co-conspirators. During her trial in 2021, Maxwell was described as \"dangerous\" by prosecutors, who told jurors about how she would entice vulnerable girls to go to Epstein's properties for him to sexually abuse. In a statement, her family said: \"Our sister Ghislaine did not receive a fair trial. \"Her legal team continues to fight her case in the courts and will file its reply in short order to the government's opposition in the US Supreme Court.\" Read more:UK ambassador 'regrets' association with Epstein  David Oscar Markus, one of her lawyers, said in the statement released by her family: \"I'd be surprised if President Trump knew his lawyers were asking the Supreme Court to let the government break a deal. \"He's the ultimate dealmaker and I'm sure he'd agree that when the United States gives its word, it should keep it. \"With all the talk about who's being prosecuted and who isn't, it's especially unfair that Ghislaine Maxwell remains in prison based on a promise the US government made and broke.' \"These are sentiments with which we profoundly concur.\" Epstein, 66, was found dead in his cell at a Manhattan federal jail in August 2019 as he awaited trial on sex trafficking charges. His death was ruled a suicide."
    },
    {
        "title": "James Craig: Dentist in Colorado poisoned wife's protein shakes with cyanide, murder trial hears ",
        "description": "The trial of a dentist accused of murdering his wife by poisoning her protein shakes has begun in the US state of Colorado.",
        "url": "https://news.sky.com/story/james-craig-dentist-in-colorado-poisoned-wifes-protein-shakes-with-cyanide-murder-trial-hears-13397241",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-james-craig-colorado_6965790.jpg?20250716040553",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-16 03:02:00",
        "Headline": "The prosecution claims James Craig, who denies murder, tried to cover his tracks by asking an inmate to kill the lead investigator in the case.",
        "Content": "The trial of a dentist accused of murdering his wife by poisoning her protein shakes has begun in the US state of Colorado. James Craig denies using cyanide and tetrahydrozoline, an ingredient in over-the-counter eye drops, to kill Angela Craig in a suburb of Denver. During the trial's opening statements on Tuesday, prosecutors claimed the 47-year-old was having an affair with another dentist, had financial difficulties and may have been motivated by the payout from his wife's life insurance. Assistant District Attorney Ryan Brackley told the jury at Arapahoe District Court that the 43-year-old victim - who had six children with her husband - had been suffering worsening symptoms including dizziness, vomiting and fainting. She died in March 2023 during her third trip to the hospital that month. Mr Brackley accused Craig of poisoning her protein shakes - then giving his wife a final dose of poison while she was in hospital, and said: \"He went in that [hospital] room to murder her, to deliberately and intentionally end her life with a fatal dose of cyanide ... She spends the next three days dying.\" Craig, who shook his head at times during the prosecution's opening statement, has pleaded not guilty to several charges, including first-degree murder, solicitation to commit murder and solicitation to commit perjury. \n                  Mohamed Soliman: Colorado attack suspect's wife and children detained by immigration officials\n                 \n                  Colorado petrol bomb suspect charged with 16 counts of attempted murder \n                 \n                  Colorado latest: Suspected petrol bomb attacker 'had no regrets', say officials\n                 Prosecutors said Craig had tried to make it appear his wife of 23 years had killed herself. His internet history showed he had searched for \"how to make a murder look like a heart attack\" and \"is arsenic detectable in an autopsy\". In an argument, captured on home surveillance video, his wife also accused him of suggesting to hospital staff that she was suicidal. Read more from Sky News:Trump to 'refine trade deal' with UKListen: Is Trump in trouble over Epstein?American Idol TV executive shot dead After Craig's arrest in 2023, prosecutors alleged that he had offered a fellow prison inmate $20,000 (£14,993) to kill the case's lead investigator and offered someone else $20,000 to find people to falsely testify that Angela Craig planned to die by suicide. Craig's attorney, Ashley Whitham, told the jury to consider the credibility of those witnesses, calling some \"jailhouse snitches\". Ms Whitham argued that the evidence didn't show that he poisoned her, instead seeming to suggest she may have taken her own life. She described Angela Craig as \"broken\", partly by Craig's infidelity and her desire to stay married, since they were part of The Church of Jesus Christ and Latter-day Saints. Hospital staff had said Craig had been caring and \"doting\" while Angela Craig was in the hospital, said Whitham. The defence argued prosecutors had overdramatised Craig's financial problems and dismissed the prosecution's suggestion that Craig was motivated to kill because of an affair he was having with a fellow dentist from Texas. \"That's simply not the case,\" Whitham said, adding that Craig had many affairs over the years that his wife knew about. \"He was candid with Angela that he had been cheating.\" The trial continues."
    },
    {
        "title": "Robin Kaye: American Idol TV executive and her husband shot dead inside their Los Angeles home",
        "description": "An American Idol TV executive and her husband have been found dead in their LA home.",
        "url": "https://news.sky.com/story/robin-kaye-american-idol-tv-executive-and-her-husband-shot-dead-inside-their-los-angeles-home-13397236",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-robin-kaye-american-idol_6965785.jpg?20250716025925",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-16 02:03:00",
        "Headline": "\"Robin has been a cornerstone of the Idol family since 2009 and was truly loved and respected by all who came in contact with her,\" a spokesperson for the show says.",
        "Content": "An American Idol TV executive and her husband have been found dead in their LA home. Robin Kaye was a music supervisor on the long-running reality TV series. The bodies of the 70-year-old and her husband Thomas were discovered after officers conducted a welfare check at their home. Both had died from gunshot wounds. Detectives say Raymond Boodarian has been arrested in connection with their deaths. It is alleged the 22-year-old had burgled their property while they were away on 10 July - killing the couple upon their return. According to Los Angeles Police, there were \"no signs of forced entry or trouble\" at the property. \n                  Revealed: The huge financial impact of Elon Musk's row with Donald Trump\n                 \n                  Ghislaine Maxwell could use 'government misconduct' to challenge imprisonment\n                 \n                  James Craig: Dentist in Colorado poisoned wife's protein shakes with cyanide, murder trial hears \n                 Ms Kaye was an industry veteran - and had previously worked on shows including Lip Sync Battle and The Singing Bee, as well as several Miss USA and Miss Universe pageants. Read more US news:Trump to 'refine trade deal' with UKUnreleased Beyonce music stolen In a statement, an American Idol spokesperson said: \"Robin has been a cornerstone of the Idol family since 2009 and was truly loved and respected by all who came in contact with her. \"Robin will remain in our hearts forever and we share our deepest sympathy with her family and friends during this difficult time.\""
    },
    {
        "title": "Inflation jumps to 3.6% on fuel and food price pressures",
        "description": "The rate of inflation has risen by more than expected on the back of fuel and food price pressures, according to official figures which have prompted accusations of an own goal for the chancellor.",
        "url": "https://news.sky.com/story/inflation-jumps-to-36-on-fuel-and-food-price-pressures-13397252",
        "image_url": "https://e3.365dm.com/22/08/1920x1080/skynews-cost-of-living-interest-rates_5854167.jpg?20220804095744",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-07-16 04:38:00",
        "Headline": "No change had been expected in the headline measure - a timely reminder that taxpayers' budgets remain squeezed at a time when the chancellor needs more cash.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The rate of inflation has risen by more than expected on the back of fuel and food price pressures, according to official figures which have prompted accusations of an own goal for the chancellor. The Office for National Statistics (ONS) reported a 3.6% level for the 12 months to June - a pace not seen since January last year. That was up from the 3.4% rate seen the previous month. Economists had expected no change. Money latest: What do inflation figures mean for rate cut prospects? ONS acting chief economist Richard Heys said: \"Inflation ticked up in June driven mainly by motor fuel prices which fell only slightly, compared with a much larger decrease at this time last year. \"Food price inflation has increased for the third consecutive month to its highest annual rate since February of last year. However, it remains well below the peak seen in early 2023.\" A key driver of food inflation has been meat prices. \n                  Revealed: The huge financial impact of Elon Musk's row with Donald Trump\n                 \n                  Money latest: Hackers stole data from all 6.5 million Co-op members in cyberattack\n                 \n                  Guinness owner Diageo parts ways with boss after tough two years\n                 Beef, in particular, has shot up in cost - by more than 30% over the past year - according to Association of Independent Meat Suppliers data reported by FarmingUK. High global demand alongside raised production costs have been blamed. But Kris Hamer, director of insight at the British Retail Consortium, said: \"While inflation has risen steadily over the last year, food inflation has seen a much more pronounced increase. \"Despite fierce competition between retailers, the ongoing impact of the last budget and poor harvests caused by the extreme weather have resulted in prices for consumers rising.\" It marked a clear claim that tax rises imposed on employers by Rachel Reeves from April have helped stoke inflation. Balwinder Dhoot, director of sustainability and growth at the Food and Drink Federation, said: \"The pressure on food and drink manufacturers continues to build. With many key ingredients like chocolate, butter, coffee, beef, and lamb, climbing in price - alongside high energy and labour expenses - these rising costs are gradually making their way into the prices shoppers pay at the tills.\" Chancellor Rachel Reeves said of the data: \"I know working people are still struggling with the cost of living. That is why we have already taken action by increasing the national minimum wage for three million workers, rolling out free breakfast clubs in every primary school and extending the £3 bus fare cap. \"But there is more to do and I'm determined we deliver on our Plan for Change to put more money into people's pockets.\" The wider ONS data is a timely reminder of the squeeze on living standards still being felt by many households - largely since the end of the COVID pandemic and subsequent energy-driven cost of living crisis. Record rental costs alongside elevated borrowing costs - the latter a result of the Bank of England's action to help keep a lid on inflation - have added to the burden on family budgets.  Most are still reeling from the effects of high energy bills. The cost of gas and electricity is among the reasons why the pace of price growth for many goods and services remains above a level the Bank would ideally like to see. Added to that is the toll placed on finances by wider hikes to bills. April saw those for water, council tax and many other essentials rise at an inflation-busting rate. The inflation figures, along with employment data due tomorrow, are the last before the Bank of England is due to make its next interest rate decision on 7 August. The vast majority of financial market participants, and many economists, expect a quarter point cut to 4%. That forecast is largely based on the fact that wider economic data is suggesting a slowdown in both economic growth and the labour market - twin headaches for a chancellor gunning for growth and juggling hugely squeezed public finances. Read more from Sky News:Chancellor considering 'changes' to ISAsMost important part of Reeves's speech was what wasn't saidHMRC doesn't know how many billionaires pay tax in the UK Professor Joe Nellis, economic adviser at the advisory firm MHA, said of the ONS data: \"This is a reminder that while price rises have slowed from the highs of 2021-23, the battle against inflation is far from over and there is no return to normality yet - especially for many households who are still feeling the squeeze on essentials such as food, energy, and services. \"However, while the Bank of England is expected to take a cautious approach to interest rate policy, we still expect a cut in interest rates when the Monetary Policy Committee next votes on 7th August. \"Despite inflation at 3.6% remaining above the official 2% target, a softening labour market - slowing wage growth and decreasing job vacancies - means that the MPC will predict inflation to begin falling as we head into the new year, justifying the lowering of interest rates.\""
    },
    {
        "title": "Guinness owner Diageo parts ways with boss after tough two years",
        "description": "The chief executive of Diageo has left by \"mutual agreement\" after a tough two years at the helm of the FTSE 100 drinks firm.",
        "url": "https://news.sky.com/story/guinness-owner-diageo-parts-ways-with-boss-after-tough-two-years-13397439",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-debra-crew_6642869.jpg?20240730124038",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-16 12:06:00",
        "Headline": "Debra Crew had come under intense pressure over strategy amid tough post-pandemic headwinds for the industry, a sector still under threat of US trade war disruption.",
        "Content": "The chief executive of Diageo has left by \"mutual agreement\" after a tough two years at the helm of the FTSE 100 drinks firm. Debra Crew, who took over in the summer of 2023 following the sudden death of long-time boss Sir Ivan Menezes, had come under pressure from investors over performance. Shares in the maker of Johnnie Walker whisky and Guinness stout, during her time in charge, had plunged by more than 40%. They gained more than 3%, and were leading the FTSE 100, when the Financial Times first reported that her departure was imminent. It was later confirmed by the company, which gave no reasons for the move. Diageo only said that it was sticking to its forecasts for this year and next and that Ms Crew would be replaced, on an interim basis, by chief financial officer Nik Jhangiani. The share price, which has outperformed rivals despite its struggles, reflects the post-pandemic decline in people drinking at home. \n                  Revealed: The huge financial impact of Elon Musk's row with Donald Trump\n                 \n                  Inflation jumps to 3.6% on fuel and food price pressures\n                 \n                  Money latest: Hackers stole data from all 6.5 million Co-op members in cyberattack\n                 Some analysts have suggested that she did not convince shareholders over Diageo's strategy in the wake of this shift, with a turnaround plan revealed in May, which aimed to slash costs, seen as failing to go far in enough. Some investors had sought a greater focus on disposal of non-core brands. Read more from Sky News:Chancellor considering 'changes' to ISAsMost important part of Reeves's speech was what wasn't saidHMRC doesn't know how many billionaires pay tax in the UK However, the stock has also struggled on the back of threats posed by the US trade war. Diageo's chair, John Manzoni, said: \"On behalf of Diageo and the board, I would like to thank Debra for her contributions to Diageo, including steering the company through the challenging aftermath of the global pandemic and the ensuing geopolitical and macroeconomic volatility. \"On behalf of all Diageo colleagues, I wish her every success in the future. The Board's focus is on securing the best candidate to lead Diageo and take the company forward. We strongly believe Diageo is well placed to deliver long-term, sustainable value creation.\""
    },
    {
        "title": "London-listed NCC weighs sale of cybersecurity arm",
        "description": "NCC Group, the London-listed technology group, has kicked off a strategic review that could entail a sale of both of its remaining divisions.",
        "url": "https://news.sky.com/story/london-listed-ncc-weighs-sale-of-cybersecurity-arm-13397371",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-stock-cyber-hack_6950483.jpg?20250625150140",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-16 10:11:00",
        "Headline": "Disposals of its two key divisions would amount to a full break-up of the London-listed technology group, which has a market value of about £440m, Sky News can reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n NCC Group, the London-listed technology group, has kicked off a strategic review that could entail a sale of both of its remaining divisions. Sky News has learnt that NCC has engaged bankers at Rothschild to examine options for its cybersecurity arm, with a sale among the possible options being considered. Money latest: Inflation jumps by more than expected Sources close to the situation said that bulking up the unit through acquisitions or streamlining costs were also under examination, with the process still at an early stage. A sale of the cybersecurity arm, which provides services to major corporate customers, would effectively precipitate a full break-up of NCC Group as it continues to hold talks with prospective buyers of its other main subsidiary. In April, Sky News revealed that NCC was being circled by private equity firms interested in acquiring Escode, which specialises in software escrow and verification services, in a deal worth up to £400m. NCC subsequently confirmed the talks and said last month that discussions - thought to include Montagu Private Equity and Bridgepoint - were ongoing. \n                  Revealed: The huge financial impact of Elon Musk's row with Donald Trump\n                 \n                  Inflation jumps to 3.6% on fuel and food price pressures\n                 \n                  Money latest: Hackers stole data from all 6.5 million Co-op members in cyberattack\n                 Read more from Sky News:Chancellor considering 'changes' to ISAsMost important part of Reeves's speech was what wasn't saidHMRC doesn't know how many billionaires pay tax in the UK It was unclear on Wednesday whether it had been approached by prospective buyers of the cybersecurity division. NCC employs about 2,200 people across Europe, North America and Asia-Pacific. Shares in NCC Group closed on Wednesday modestly higher at 141.6p, giving the company a market valuation of about £444m. NCC declined to comment."
    },
    {
        "title": "Reproductive health benefits start-up Fertifa swoops on rival Juniper",
        "description": "A reproductive health start-up run by one of Britain's most prominent venture capitalists has swooped on one of its peers amid growing demand from large companies for the provision of fertility and other sexual health-related benefits to their workforces.",
        "url": "https://news.sky.com/story/reproductive-health-benefits-start-up-fertifa-swoops-on-rival-juniper-13397356",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-money-blog-pregnant_6943246.jpg?20250616071204",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-16 09:24:00",
        "Headline": "Run by prominent venture capitalist Eileen Burbidge, Fertifa will announce on Thursday that it has acquired two year-old insurance start-up Juniper, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A reproductive health start-up run by one of Britain's most prominent venture capitalists has swooped on one of its peers amid growing demand from large companies for the provision of fertility and other sexual health-related benefits to their workforces. Sky News understands that Fertifa, which is run by Eileen Burbidge, one of Britain's most prominent venture capitalists, has agreed a deal to buy Juniper, a two-year-old London-based company which provides reproductive health insurance. Sources said the deal - worth an undisclosed sum - would be announced publicly on Thursday. Money latest: Inflation jumps by more than expected It will provide fresh evidence of the accelerating consolidation of an area of healthcare which has gained increasing prominence as part of companies' employee benefits packages in recent years. Fertifa counts Meta - the owner of Facebook, Instagram and WhatsApp - among its clients, along with other blue-chip businesses such as the private equity firm Hg Capital, H&M, Lululemon, MoFo, Space NK and Virgin Group. The start-up raised £5m in funding from investors including Notion Capital, Triple Point Ventures and Speedinvest two years ago, following an initial pre-seed round led by Passion Capital. Fertifa is the exclusive provider of the insurer Aviva UK's family planning and fertility benefit for many of its healthcare schemes. The start-up's offering is based on a per-employee, per-month pricing model, and offers reimbursement administration by charging a 5% fee on transaction volumes. It has also broadened its services in recent years by adding men's health, neurodiversity support and a payment plan allowing employees to avoid up-front costs. Juniper, which was founded by Ambra Zhang and Max Bacon, was set up to address a gap in the private medical insurance (PMI) market by focusing on reproductive health coverage. It also raised funding from external investors, including Insurtech Gateway and 2100. The rapid growth of private fertility service providers has given rise to greater scrutiny of their practices, with the collapse of Apricity, one prominent company in the sector, at the end of last year leaving some IVF patients thousands of pounds out of pocket and asking questions about the unregulated nature of the industry. At the time, a statement from the Human Fertilisation and Embryology Authority (HFEA) said it could \"only regulate UK licensed fertility clinics, which are the premises where treatments take place\". \"The decision to cease trading was taken by Apricity's board,\" it added. \"The HFEA is unable to help patients obtain a refund nor compensation. \"Patients can also contact the licenced clinic where any procedures, such as egg collection, were due to take place. \"We would expect Apricity to ensure that any eggs, sperm or embryos stored in the UK are looked after.\" Read more from Sky News:Chancellor considering 'changes' to ISAsMost important part of Reeves's speech was what wasn't saidHMRC doesn't know how many billionaires pay tax in the UK One market source said that Fertifa's acquisition of Juniper would strengthen its position as an emerging leader in the sector. Other corporate deals in the industry have included Nasdaq-listed Progyny's purchase of Apryl, a Berlin-based fertility benefits platform, in June 2024. Ms Burbidge and Juniper declined to comment on the deal on Wednesday ahead of a formal announcement."
    },
    {
        "title": "Loveholidays owner hires bankers to plot stock market getaway",
        "description": "The owner of Loveholidays, the online travel agent (OTA), has drafted in bankers to advise on a potential stock market debut.",
        "url": "https://news.sky.com/story/loveholidays-owner-hires-bankers-to-plot-stock-market-getaway-13397343",
        "image_url": "https://e3.365dm.com/23/08/1920x1080/skynews-loveholidays-screenshot_6259888.jpg?20230823110646",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-16 08:54:00",
        "Headline": "The online travel agent's owner, private equity firm Livingbridge, has begun working with Rothschild on a float likely to value it at well over £1bn, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of Loveholidays, the online travel agent (OTA), has drafted in bankers to advise on a potential stock market debut. Sky News understands that Livingbridge, the private equity firm, has appointed Rothschild to help coordinate plans for an initial public offering (IPO) of Loveholidays. Sources said that Rothschild would oversee the appointment of other investment banks to work on a flotation in the coming weeks. Money latest: Inflation jumps by more than expected The London market has been hit by a steep decline in IPO activity, with data showing that the first half of 2025 was among the worst for decades in terms of proceeds raised. The timing of a Loveholidays IPO - which would be likely to value the company at well over £1bn - is still to be determined. Loveholidays has been backed by Livingbridge since 2018, and has seen its financial performance improve markedly since the COVID pandemic threw the travel industry into chaos. \n                  Revealed: The huge financial impact of Elon Musk's row with Donald Trump\n                 \n                  Inflation jumps to 3.6% on fuel and food price pressures\n                 \n                  Money latest: Hackers stole data from all 6.5 million Co-op members in cyberattack\n                 The company specialises in trips to the Mediterranean and Canary Islands, and boasts that its inventory of 35,000 hotels and 99% of all flights result in 500 billion possible holiday packages. It reportedly saw pre-tax profits rise by a fifth to £67.6m on sales of £284m in the year to October 2024. Along with OnTheBeach and TUI, Loveholidays ranks among the UK's biggest OTAs and has been a big winner from the post-pandemic resurgence in demand from holidaymakers. Last year, Sky News reported that bidders including CVC Capital Partners, the private equity giant, were examining offers for a controlling stake in Loveholidays. When that process was curtailed, it is also said to have explored the sale of a minority stake. Read more from Sky News:Chancellor considering 'changes' to ISAsMost important part of Reeves's speech was what wasn't saidHMRC doesn't know how many billionaires pay tax in the UK Loveholidays was founded in 2012 by Alex Francis and Jonny Marsh, and now employs hundreds of people. Livingbridge declined to comment on Wednesday."
    },
    {
        "title": "HMRC 'doesn't know' how many billionaires pay tax in the UK ",
        "description": "HM Revenue and Customs does not know how many billionaires pay tax in the UK, according to a new report by MPs.",
        "url": "https://news.sky.com/story/hmrc-doesnt-know-how-many-billionaires-pay-tax-in-the-uk-13397238",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-notes-banknotes_6938843.jpg?20250611021632",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-16 02:36:00",
        "Headline": "\"There is much public interest in the amount of tax the wealthy pay. People need to know everyone pays their fair share,\" a group of MPs warn.",
        "Content": "HM Revenue and Customs does not know how many billionaires pay tax in the UK, according to a new report by MPs. The Public Accounts Committee says this is despite the fact only a small number of people have this status - and the significant sums of money involved. HMRC has been told it \"can and must\" do more to understand how much the very wealthiest in society contribute to the public purse, as \"there is a lot of money being left on the table\".  Artificial intelligence and The Sunday Times Rich List were identified as two ways of getting a clearer picture. The taxman is facing calls to reveal how it plans to increase contributions from billionaires both domestically and offshore, amid a squeeze in the public finances. MPs added: \"There is much public interest in the amount of tax the wealthy pay. People need to know everyone pays their fair share.\" The report pointed to the US, where the Internal Revenue Service links its data to the Forbes 400 list of rich Americans. \n                  Revealed: The huge financial impact of Elon Musk's row with Donald Trump\n                 \n                  Inflation jumps to 3.6% on fuel and food price pressures\n                 \n                  Money latest: Hackers stole data from all 6.5 million Co-op members in cyberattack\n                 PAC member Lloyd Hatton added: \"This report is not concerned with political debate around the redistribution of wealth. \"Our committee's role is to help HMRC do its job properly, ensuring wealthy people pay the correct tax. \"While HMRC does deserve some great credit for securing billions more in the tax take from the wealthiest in recent years, there is still a very long way to go before we can reach a true accounting of what is owed.\" Read more money news:Chancellor considering 'changes' to ISAsTrump to 'refine trade deal' with UK  Mr Hatton added that the committee was \"disappointed\" that HMRC could not offer any insights into the tax arrangements of billionaires from its own data - as \"any single one of these individuals' contributions could make a significant difference to the overall picture\". At present, about 1,000 people within HMRC are focused on the tax affairs of the UK's wealthiest, but funding has been secured to increase this headcount by 400 - with a view to \"increasing prosecutions of those who evade tax\". A spokesperson added: \"The government is determined to make sure everyone pays the tax they owe. \"Extra resources were announced in the recent spending review which allows us to significantly step up our work on closing the tax gap among the wealthiest.\""
    },
    {
        "title": "PM criticised over 'appalling' decision to suspend four Labour MPs",
        "description": "Sir Keir Starmer has suspended four MPs for repeated breaches of party discipline.",
        "url": "https://news.sky.com/story/three-labour-mps-suspended-for-breaches-of-party-discipline-13397508",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-brian-leishman-chris-hinchliff_6966299.jpg?20250716161856",
        "type": "Politics",
        "Author": "Faye Brown, political reporter",
        "Date Published": "2025-07-16 13:47:00",
        "Headline": "The suspensions will be seen as an attempt to restore discipline following a number of rebellions that has forced the government into U-turns. ",
        "Content": "By Faye Brown, political reporter    Sir Keir Starmer has suspended four MPs for repeated breaches of party discipline. Brian Leishman, Chris Hinchliff, Neil Duncan-Jordan and Rachael Maskell have lost the whip, meaning they are no longer part of Labour's parliamentary party and will sit as independent MPs. The suspension is indefinite pending a review. Three other MPs have had their trade envoy roles removed: Rosena Allin Khan, Bell Ribeiro-Addy and Mohammed Yasin. Politics latest: Suspended MPs defend their voting record  All seven had voted against the government's welfare reforms earlier this month. However, it is understood this is not the only reason behind the decision, with sources citing \"repeated breaches of party discipline\". More than 100 MPs had initially rebelled against the plan to cut personal independent payments (PIP). Ultimately, 47 voted against the bill's third reading, after it was watered down significantly in the face of defeat. Ms Maskell was one of the lead rebels in the welfare revolt, and has more recently called for a wealth tax to fund the U-turn.  The York Central MP has spoken out against the government on a number of other occasions since the election, including on winter fuel and cuts to overseas aid. Confirming the suspension, Ms Maskell told Sky News that she \"doesn't see herself as a rebel\" but \"somebody that is prepared to fulfil (her) role here of holding the executive to account and speaking truth to power\". She stopped short of criticising the decision, saying: \"I hold my hand out to the prime minister and hope he takes that and wants to reach back because I think it's really important that we work together.\" Ms Maskell was first elected in 2015, while the other suspended MPs were newly elected last year. Mr Hinchliff, the MP for North East Hertfordshire, has proposed a series of amendments to the flagship planning and infrastructure bill criticising the government's approach. Mr Duncan-Jordan, the MP for Poole, led a rebellion against the cut to the winter fuel payments while Alloa and Grangemouth MP Mr Leishman has been critical of the government's position on Gaza. Political correspondent After a tricky few weeks for the government, in which backbenchers overturned plans to cut back welfare spending, now a heavy hand to get the party into line.\n All four suspended MPs appear to be surprised - and upset.\n\n Three more have lost plum roles as trade envoys - all on the left of the party.\n\n All were active in the rebellion against the government's welfare reforms, and voted against the changes even after a series of U-turns - but were among 47 Labour MPs who did so.\n\n When MPs were told after the welfare vote that Number 10 was \"fully committed to engaging with parliamentarians\", this was not what they were expecting.\n\n We're told the reasons for these particular suspensions go wider - over \"persistent breaches of party discipline\" - although most are not high profile. In the scheme of things, Jeremy Corbyn and John McDonnell rebelled against the Labour whip hundreds of times under New Labour, without being suspended. But these MPs' pointed criticism of the Starmer strategy has clearly hit a nerve. Read Tamara's analysis in full here 'Couldn't support making people poorer' Mr Duncan-Jordan told Sky News that he understood speaking out against benefit cuts would \"come at a cost\" but said he \"couldn't support making disabled people poorer\". Mr Leishman echoed that sentiment, saying: \"I firmly believe that it is not my duty as an MP to make people poorer, especially those that have suffered because of austerity and its dire consequences.\" Both said they remain committed to the Labour Party and its values, suggesting they have no plans to join the new party being set up by former Labour leader Jeremy Corbyn and ousted MP Zarah Sultana. Similarly Mr Hinchliff said in a brief statement: \"I remain proud to have been elected as a Labour MP and I hope in time to return to the Labour benches.\" The suspensions will be seen as an attempt to restore discipline ahead of the summer recess following a number of rebellions that has forced the government into U-turns. As well as watering down the welfare bill, some cuts to the winter fuel payment have been reversed, leaving Chancellor Rachel Reeves with a fiscal blackhole to fill. However, the move risks creating further divisions with a number of Labour MPs criticising the decision. Read more:Who are the suspended Labour MPs? Starmer 'rolling out the carpet to Reform' Ian Byrne, Labour MP for Liverpool West Derby, said he was \"appalled\" by the suspensions as he and 44 others voted against welfare cuts. He said this isn't the first time the Starmer leadership has \"punished MPs for standing up for what's right\", as he and six others were suspended last year for voting against the two-child benefit cap. \"These decisions don't show strength. They are damaging Labour's support and risk rolling out the red carpet for Reform,\" he added. Richard Burgon, who was also temporarily suspended in the two-child benefit cap revolt, said he had hoped the leadership would take a different approach to backbenchers. \"Sadly, it isn't yet doing so. To help stop a Reform government, it really must do so,\" he said. Jon Trickett, Labour MP for Normanton and Hemsworth, said \"it's not a sin to stand up for the poor and disabled\", adding: \"Solidarity with the suspended four.\""
    },
    {
        "title": "Why suspended Labour MPs clearly hit a nerve with Starmer",
        "description": "After a tricky few weeks for the government, in which backbenchers overturned plans to cut back welfare&#160;spending, now a heavy hand to get the party into line.",
        "url": "https://news.sky.com/story/why-suspended-labour-mps-clearly-hit-a-nerve-with-starmer-13397618",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-starmer-keir-starmer_6966491.jpg?20250716193954",
        "type": "Politics",
        "Author": "Tamara Cohen",
        "Date Published": "2025-07-16 17:13:00",
        "Headline": "Number 10 wants to show rebelling comes at a price - but many Labour MPs with concerns about their political direction will want to know the prime minister is planning to listen to concerns before it gets to that point. ",
        "Content": "\n          Political correspondent\n              @tamcohen\n  After a tricky few weeks for the government, in which backbenchers overturned plans to cut back welfare spending, now a heavy hand to get the party into line. Three newly-elected MPs, Neil Duncan-Jordan, MP for Poole, Brian Leishman, MP for the new Alloa and Grangemouth constituency, and Chris Hinchcliff, for North East Herefordshire, have all had the whip suspended. Rachael Maskell, MP for York Central, who was first elected a decade ago, is the fourth. Politics latest: Labour MP 'appalled' after Starmer suspends rebels They will all sit as independent MPs and will not be allowed to stand for Labour at the next election, unless readmitted. All appear to be surprised - and upset. Three more have lost plum roles as trade envoys - Dr Rosena Allin-Khan, Bell Ribeiro-Addy and Mohammed Yasin, all on the left of the party. All were active in the rebellion against the government's welfare reforms, and voted against the changes even after a series of U-turns - but were among 47 Labour MPs who did so. When MPs were told after the welfare vote that Number 10 was \"fully committed to engaging with parliamentarians\", this was not what they were expecting. We're told the reasons for these particular suspensions go wider - over \"persistent breaches of party discipline\" - although most are not high profile. In the scheme of things, Jeremy Corbyn and John McDonnell rebelled against the Labour whip hundreds of times under New Labour, without being suspended. But these MPs' pointed criticism of the Starmer strategy has clearly hit a nerve.  Maskell - who was referred to, jokingly, in the House of Commons earlier this month by Tory MP Danny Kruger as \"the real prime minister\" - led the rebellion against cuts to winter fuel allowance which triggered a U-turn which she said would still leave pensioners in fuel poverty. There was an attack on the government's values. Duncan-Jordan, a trade unionist who won the Poole seat by just 18 votes, led the welfare rebellion, telling Sky News the proposed cutbacks were \"not a very Labour thing to do\". Hinchliff, who has also opposed the government's housebuilding strategy and plans to expand Luton airport,had told his local paper he was willing to lose the whip over welfare cuts if necessary. He also has a marginal seat, won by fewer than 2,000 votes. Read more:Who are the suspended Labour MPs? Leishman, a former pro golfer, has also been vocal about government plans to close the refinery in his Grangemouth constituency after promising to try and make it viable. They are MPs who the leadership fear are going for broke - and that's concerning as more tough decisions on spending are likely to come. But after a poorly-handled welfare vote, in which MPs seemed to be in the driving seat forcing changes, will this instil a sense of discipline over the summer break? While some MPs will see this as a deterrent to rebellion, for those whose chances of re-election are small, it may continue to be seen as a price worth paying. To other Labour MPs, the move is confusing and may be counter-productive. One Labour MP on the left told me: \"So, we're suspending people for winning an argument with the government?\" Another, in the centre, feared it looked divisive, saying: \"We need to go into the summer focused on the opposition - not involved in our melodramas.\" Number 10 wants to show rebelling comes at a price - but many Labour MPs with concerns about their political direction will want to know the prime minister is planning to listen to concerns before it gets to that point."
    },
    {
        "title": "Who are the suspended Labour MPs - and why did they lose the whip?",
        "description": "Sir Keir Starmer has suspended four Labour MPs today for \"repeated breaches of party discipline\".",
        "url": "https://news.sky.com/story/who-are-the-suspended-labour-mps-and-why-did-they-lose-the-whip-13397560",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-keir-starmer-downing-street_6966237.jpg?20250716154528",
        "type": "Politics",
        "Author": "Dylan Donnelly, news reporter",
        "Date Published": "2025-07-16 15:16:00",
        "Headline": "Brian Leishman, Chris Hinchliff, Neil Duncan-Jordan and Rachael Maskell will now sit as independent MPs after losing the whip. All four voted against the government's welfare reforms earlier this month.",
        "Content": "By Dylan Donnelly, news reporter   Sir Keir Starmer has suspended four Labour MPs today for \"repeated breaches of party discipline\". Brian Leishman, Chris Hinchliff, Neil Duncan-Jordan and Rachael Maskell were suspended from the parliamentary Labour Party and will sit as independent MPs. All four voted against the government's welfare reforms earlier this month, among 47 party MPs to rebel. Follow the latest at Politics Hub However, Sky News understands that this isn't the only reason behind the decision, and that more suspensions could come. But who are the four MPs suspended? And how critical were they of the government? The MP for Alloa and Grangemouth was first elected in last year's general election. While the constituency was contested for the first time that year, it would have been an SNP seat notionally. Mr Leishman is also a member of the Socialist Campaign Group inside Labour and was previously elected to Perth and Kinross Council in 2022. A frequent voter against the government, he has criticised his party for not doing enough to save Grangemouth oil refinery, and rebelled against votes on the Winter Fuel Allowance and welfare.  In a statement, he said: \"I am a proud Labour member, and I remain committed to the party.\" He added that he wishes \"to remain a Labour MP and deliver the positive change many voters are craving,\" but added he voted against the government on some issues to represent his constituents. \"I firmly believe that it is not my duty as an MP to make people poorer, especially those that have suffered because of austerity and its dire consequences,\" he said. \"It is the honour of my life to be the MP for Alloa and Grangemouth, and my priority remains representing and fighting for constituents, whether they voted for me or not.\" Another 2024 newcomer to Parliament, the MP for North East Hertfordshire is one of the younger politicians at 31 years old. He won the constituency for the first time since it was established in 1997. As MP, Mr Hinchliff has supported rebellions on cuts to welfare and the Winter Fuel Allowance, and also proposed amendments to the government's Planning and Infrastructure Bill - criticising the government's consultation with private finance groups - in April. So far, the MP hasn't made a public statement, but he had previously said he didn't mind losing the whip over his opposition to the welfare cuts. Read more:Starmer would be foolish not to recognise threat posed by a Corbyn partyDozens of MPs call for UK to recognise Palestine as statePM: former Tory ministers have 'serious questions to answer' over Afghan data breach The MP for Poole was also elected in the 2024 election, winning his seat from the Conservatives by just 18 votes. It was the first time Labour had won in the constituency. Before standing for election, Mr Duncan-Jordan was a regional officer for UNISON, one of the largest trade unions in the UK. He's been an outspoken critic of proposed cuts to welfare and disability payments, calling the welfare bill a \"dog's dinner\" and last year leading an early day motion to postpone an end to the Winter Fuel Allowance. In response to losing the whip, said in a statement: \"I understood this could come at a cost, but I couldn't support making disabled people poorer\". \"Although I've been suspended from the Parliamentary Labour Party today,\" he added, \"I've been part of the Labour and trade union movement for 40 years and remain as committed as ever to its values. \"To my constituents: it's business as usual. I remain your hardworking local MP, I will continue to take up your concerns and speak up for Poole.\" Shortly before 4pm, the MP for York Central became the fourth MP to be suspended by the government for rebelling. In Parliament since 2015, Ms Maskell led the welfare rebellion against the government's reforms - and voted against them even after they were significantly watered down.  Earlier this month, she told Sky News presenter Gareth Barlow: \"No one feels comfortable when the family is arguing, and that's why listening is so important. \"I want to see instituted back in the heart of the party a recognition of the role of backbenchers.\" And speaking to Sky's chief political correspondent Jon Craig after her suspension, she said: \"The reason I have been suspended is because I voted in the way I did. I believe I am fighting for people that really matter, the poorest people in society. \"That is why the Labour Party was created - I will never give up that fight.\""
    },
    {
        "title": "Starmer says former Tory ministers have 'serious questions to answer' over Afghan data breach",
        "description": "Sir Keir Starmer has said former Tory ministers have \"serious questions to answer\" about how the names of Afghans who worked with UK forces were exposed.",
        "url": "https://news.sky.com/story/starmer-says-former-tory-ministers-have-serious-questions-to-answer-over-afghan-data-breach-13397428",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-keir-starmer-pmqs_6966010.jpg?20250716121150",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-16 12:04:00",
        "Headline": "Thousands of Afghans are being secretly brought to the UK after their names were emailed out by mistake, amid fears the Taliban would see the list.",
        "Content": " Sir Keir Starmer has said former Tory ministers have \"serious questions to answer\" about how the names of Afghans who worked with UK forces were exposed. Nearly 7,000 Afghan nationals are being relocated to the UK after their names were accidentally sent in an email in February 2022, when Boris Johnson was prime minister, but the leak was only discovered by the British military in August 2023, when Rishi Sunak was PM. A super-injunction, preventing the reporting of the mistake, was imposed that year in an attempt to prevent the Taliban from finding out about the leak. The Conservative government at the time then started transporting thousands of Afghans to the UK in secret as they were in danger. On Tuesday, the injunction was lifted. Politics latest: Starmer hammered over unexpected inflation rise  Kicking off Prime Minister's Questions, Sir Keir said: \"Ministers who served under the party opposite have serious questions to answer about how this was ever allowed to happen. \"The chair of the defence committee has indicated that he intends to hold further inquiries. \"I welcome that and hope that those who are in office at the time will welcome that scrutiny.\" The data breach saw a defence official accidentally release details of almost 19,000 people seeking to flee Afghanistan after the return of the Taliban. Conservative leader Kemi Badenoch avoided mentioning the data breach, but Lib Dem leader Sir Ed Davey said it was \"shocking\" how it had been kept secret for three years. Sir Ed said the prime minister will have the Lib Dems' support if he decides to pursue a public inquiry. Mr Healey's Tory predecessor, Sir Ben Wallace, said he makes \"no apology\" for applying for the initial four-month injunction and insisted it was \"not a cover-up\". The scheme, which had been kept under wraps until yesterday, has so far cost hundreds of millions of pounds. However, the total cost to the taxpayer of existing schemes to assist Afghans who are deemed eligible for British support, as well as the additional cost from the breach, will come to at least £6bn.  Earlier, Defence Secretary John Healey told Sky News he is \"deeply uncomfortable\" with the government using a super-injunction to keep the massive data breach hidden. He said: \"I'm really deeply uncomfortable with the idea that a government applies for a super-injunction. \"If there are any [other] super-injunctions in place, I just have to tell you - I don't know about them. I haven't been read into them. \"The important thing here now is that we've closed the scheme.\" Mr Healey was informed of the breach while in opposition, and earlier this year he commissioned a review that led to the injunction being lifted. He said \"accountability starts now\" and added Labour had to deal with the risks, court papers, intelligence assessments and different schemes when they came to power last summer before they could lift the injunction."
    },
    {
        "title": "Afghan data breach timeline: The fallout behind the scenes",
        "description": "The details of a massive data breach by the British military over Afghan nationals have come out this week. But behind the scenes, the fallout has been ongoing for years.",
        "url": "https://news.sky.com/story/afghan-data-breach-timeline-the-fallout-behind-the-scenes-13397534",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-britain-afghanistan_6534045.jpg?20240426131729",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-16 14:11:00",
        "Headline": "It's been three years since a British official accidentally shared emails that potentially put up to 100,000 Afghan nationals in danger. Here's what's been happening behind the scenes.",
        "Content": " The details of a massive data breach by the British military over Afghan nationals have come out this week. But behind the scenes, the fallout has been ongoing for years. It's been three years since an unnamed official accidentally shared emails with the names and other details of 18,714 Afghan nationals who were applying for a British government relocation scheme in 2022. The scheme was to provide asylum for people who had worked with the UK armed forces in the war against the Taliban between 2001 and 2021. The blunder was only made public on Tuesday after a super-injunction blocking the media from reporting on the breach was removed. It's only now that the timeline of the data breach, a subsequent secret government scheme and the super-injunction can all be revealed. Here's what the public couldn't know until now: April 2021 The Initial scheme to relocate Afghans who helped British military during the war is launched. It was called the Afghan Relocations and Assistance Policy (ARAP). February 2022 The unnamed British official accidentally emails details of 18,714 Afghan nationals who applied to be relocated to the UK outside of a secure government system. He sends the email in an attempt to verify information, believing the dataset to only contain around 150 rows of information, but it actually contains around 33,000.  14 August 2023 The Ministry of Defence (MoD) discovers the leak after seeing details of the emails had been posted by a Facebook user. UK officials send around 1,800 ARAP applicants in Pakistan a warning via WhatsApp to say their data may have been breached. 15 August 2023 James Heappey, then armed forces minister, is warned by a civilian volunteer who assists ARAP applicants that the breach may have put those on the list and their families in grave danger. The volunteer says: \"The Taliban may well now have a 33,000-long kill list - essentially provided to them by the UK government. \"If any of these families are murdered, the government will be liable.\" Read more:'Serious questions to answer' over data breach, says PMGuide to the Afghan data breach 25 August 2023 Then defence secretary Ben Wallace applies for a court order after the MoD gets two inquiries about the breach from journalists. 1 September 2023 High Court grants a super-injunction until a hearing scheduled for 1 December, preventing the reporting of the breach, as the MoD said the government needed four months to \"do everything it reasonably can to help those who might have been put at further risk\". 23 November 2023 High Court judge Mr Justice Chamberlain gives private judgment saying the super-injunction is \"is likely to give rise to understandable suspicion that the court's processes are being used for the purposes of censorship\". But he continues it for four more weeks, as the MoD has reiterated that the threat to those in the dataset is \"grave\". 18 December 2023 MoD lawyers say the risk to life due to the breach is \"immensely serious\". Mr Justice Chamberlain extends the super-injunction until February 2024. 19 December 2024 The Domestic and Economic Affairs committee meets and says that a new route of settlement in the UK should be offered to some individuals who were ineligible for ARAP. At this time, it is agreed to be a targeted cohort of around 200 people and their dependents at the highest risk following the breach, and it is called the Afghanistan Response Route (ARR). The ARR is also covered by the super-injunction. 15 February 2024 Mr Justice Chamberlain continues the super-injunction, finding a \"real possibility that it is serving to protect\" some of those identified on the dataset. But he adds: \"What is clear is that the government has decided to offer help to only a very small proportion of those whose lives have been endangered by the data incident and that the decisions in this regard are being taken without any opportunity for scrutiny through the media or in Parliament.\" 21 May 2024 Mr Justice Chamberlain rules the super-injunction should be lifted in 21 days, saying there is a \"significant possibility\" the Taliban already know about the dataset and that it is \"fundamentally objectionable\" to keep it a secret. 25-26 June 2024 The MoD challenges the decision in the Court of Appeal, which rules that the super-injunction should continue for the safety of those affected by the breach. In a written ruling, judges Sir Geoffrey Vos, Lord Justice Singh and Lord Justice Warby say: \"As the number of family members involved is several times the number of affected people, the total numbers of people who would be exposed to a risk of death or serious harm if the Taliban obtained the data is between 80,000 and 100,000.\" 4 July 2024 Labour wins the general election, and Sir Keir Starmer's government inherits the scheme. It keeps the super-injunction in place. 2 February 2025 A review into the data incident response reveals that the ARR's plans would mean relocating more Afghan nationals than the original scheme, and would end up costing up to £7bn. It recommends that the defence secretary order an independent review into the breach and subsequent scheme. 19 May 2025 The High Court is told by a Manchester-based law firm that it has more than 600 potential clients who may sue the government under data protection laws. 4 July 2025 After an independent review by retired civil servant Paul Rimmer, the government tells the High Court that the super-injunction \"should no longer continue\". It comes after the review found the breach was \"unlikely to profoundly change the existing risk profile\" of those named and that the government possibly \"inadvertently added more value to the dataset\" by seeking the unprecedented super-injunction. 15 July 2025 Mr Justice Chamberlain lifts the super-injunction, making the breach and scheme reportable for the first time. It is revealed that nearly 7,000 Afghan nationals either have been or are being relocated to the UK as part of the breach reaction scheme, with the MoD saying it will cost around £850m. It said the internal government document from February which said the cost could rise to £7bn was outdated because the government had cut the number of Afghans it would be relocating.  What happens now? Some 5,400 Afghans who have already received invitation letters will be flown to the UK in the coming weeks. This will bring the total number of Afghans affected by the breach being relocated to the UK to 23,900. The rest of the affected Afghans will be left behind, The Times reported. Around 1,000 Afghans on the leaked list are preparing to sue the MoD, demanding at least £50,000 each, in a joint action led by Barings Law. Adnan Malik, head of data protection at Barings Law, said: \"This is an incredibly serious data breach, which the Ministry of Defence has repeatedly tried to hide from the British public.\" Despite the government's internal review playing down the risks caused by the data breach, Mr Malik said the claimants \"continue to live with the fear of reprisal against them and their families\". The Telegraph has reported that a Whitehall briefing note circulated on 4 July warned that the MoD would need to work with the government to prepare to \"mitigate any risk of public disorder following the discharge of the injunction\"."
    },
    {
        "title": "Labour MP Stella Creasy thanks Tube passengers for intervening as she was 'hassled' on Victoria line",
        "description": "Labour MP Stella Creasy has revealed she was \"hassled\" by a man on the London Underground and has thanked passengers who rushed to her aid.",
        "url": "https://news.sky.com/story/labour-mp-stella-creasy-thanks-tube-passengers-for-intervening-as-she-was-hassled-on-victoria-line-13397329",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-stella-creasy-abortion_6943988.jpg?20250617033532",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-16 08:16:00",
        "Headline": "The Walthamstow MP said she thanked those who helped her \"from the bottom of my heart\".",
        "Content": "Labour MP Stella Creasy has revealed she was \"hassled\" by a man on the London Underground and has thanked passengers who rushed to her aid. Ms Creasy, who has been an MP since 2010, also said in a post on her X and Facebook accounts that whoever helped her on Tuesday should reach out to her office if they were prepared to be a witness, following the incident. She said: \"If you were one of the passengers on the Victoria Line just now who intervened to stop a man hassling me thank you from the bottom of my heart. \"Please get in touch with my office if you are prepared to be a witness as maybe the police might listen to you about him now!\" It's not the first time Ms Creasy has been targeted. Ms Creasy received numerous rape threats and misogynistic messages on her Twitter timeline in 2013 after supporting feminist campaigner Caroline Criado Perez, who lobbied the Bank of England to put a woman on the £10 note. In 2023, Ms Creasy also revealed she had been investigated by her local council after a man using an alias complained that her \"extreme views\" would damage her children and they should be removed from her. \n                  Stella Creasy sends message to culprits who attacked her Walthamstow office and circulated 'malicious' leaflets\n                 \n                  Stella Creasy: MP who faced 'malicious' report to social services claiming she was 'not a fit mother' calls for law change\n                 \n                  Stella Creasy: Labour MP says police giving 'green light' to trolls after man tried to get her kids taken away\n                 Read more from Sky News:An original Lioness speaks to Sky NewsMinister won't name person behind Afghan data breach   The complaint was dismissed and the man, who had no personal connection to Ms Creasy or her two children, apologised. But the Labour MP was left with a social services record after the \"malicious\" report by the man, who was later convicted of harassing her. In June last year, a separate incident saw Ms Creasy's office being attacked and \"malicious\" leaflets circulated. The Metropolitan Police confirmed at the time that an investigation had been launched into criminal damage at Ms Creasy's office."
    },
    {
        "title": "HMRC 'doesn't know' how many billionaires pay tax in the UK ",
        "description": "HM Revenue and Customs does not know how many billionaires pay tax in the UK, according to a new report by MPs.",
        "url": "https://news.sky.com/story/hmrc-doesnt-know-how-many-billionaires-pay-tax-in-the-uk-13397238",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-notes-banknotes_6938843.jpg?20250611021632",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-16 02:36:00",
        "Headline": "\"There is much public interest in the amount of tax the wealthy pay. People need to know everyone pays their fair share,\" a group of MPs warn.",
        "Content": "HM Revenue and Customs does not know how many billionaires pay tax in the UK, according to a new report by MPs. The Public Accounts Committee says this is despite the fact only a small number of people have this status - and the significant sums of money involved. HMRC has been told it \"can and must\" do more to understand how much the very wealthiest in society contribute to the public purse, as \"there is a lot of money being left on the table\".  Artificial intelligence and The Sunday Times Rich List were identified as two ways of getting a clearer picture. The taxman is facing calls to reveal how it plans to increase contributions from billionaires both domestically and offshore, amid a squeeze in the public finances. MPs added: \"There is much public interest in the amount of tax the wealthy pay. People need to know everyone pays their fair share.\" The report pointed to the US, where the Internal Revenue Service links its data to the Forbes 400 list of rich Americans. \n                  Revealed: The huge financial impact of Elon Musk's row with Donald Trump\n                 \n                  Inflation jumps to 3.6% on fuel and food price pressures\n                 \n                  Money latest: Hackers stole data from all 6.5 million Co-op members in cyberattack\n                 PAC member Lloyd Hatton added: \"This report is not concerned with political debate around the redistribution of wealth. \"Our committee's role is to help HMRC do its job properly, ensuring wealthy people pay the correct tax. \"While HMRC does deserve some great credit for securing billions more in the tax take from the wealthiest in recent years, there is still a very long way to go before we can reach a true accounting of what is owed.\" Read more money news:Chancellor considering 'changes' to ISAsTrump to 'refine trade deal' with UK  Mr Hatton added that the committee was \"disappointed\" that HMRC could not offer any insights into the tax arrangements of billionaires from its own data - as \"any single one of these individuals' contributions could make a significant difference to the overall picture\". At present, about 1,000 people within HMRC are focused on the tax affairs of the UK's wealthiest, but funding has been secured to increase this headcount by 400 - with a view to \"increasing prosecutions of those who evade tax\". A spokesperson added: \"The government is determined to make sure everyone pays the tax they owe. \"Extra resources were announced in the recent spending review which allows us to significantly step up our work on closing the tax gap among the wealthiest.\""
    },
    {
        "title": "Babies born with DNA from three people in the UK - to prevent 'devastating' illness with no cure",
        "description": "Eight babies have been born in the UK with DNA from three people following a procedure to eliminate an incurable inherited disease.",
        "url": "https://news.sky.com/story/babies-born-in-uk-with-dna-from-three-people-to-treat-inherited-disease-takes-medicine-into-uncharted-territory-13397706",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-embryo-mitochondrial_6966560.jpg?20250716210608",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-07-16 19:56:00",
        "Headline": "It is a major advance for the technique, called mitochondrial donation therapy, designed to prevent a life-limiting, often fatal, illness.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  Eight babies have been born in the UK with DNA from three people following a procedure to eliminate an incurable inherited disease. It is a major advance for the technique, called mitochondrial donation therapy, designed to prevent a life-limiting, often fatal illness caused by genetic mutations in the structures that generate energy in all our cells. It is also a test of the UK's permissive but highly regulated stance on human embryo research that allowed a technique once criticised for creating \"three-parent babies\" to proceed. The babies, four girls and four boys - two of them identical twins - were all born in the last five years and are healthy, according to research published in the New England Journal of Medicine. \"It's a great success for these families,\" said Sir Doug Turnbull, emeritus professor at the University of Newcastle who helped pioneer the treatment. \"This is a devastating disease with no cure and without this technique, they would not feel that their families were free of mitochondrial disease. This gives them that opportunity.\" Mitochondrial disease affects around one in 5,000 babies born in the UK. Depending on the number and type of mutations in their mitochondria, the severity and type of disease can vary, but includes neurological, metabolic and developmental disorders. Only women at high risk of passing on severe disease qualify for the procedure, provided though a specialist facility at Newcastle upon Tyne Hospitals NHS Foundation Trust. The identities of the seven families and their babies are being withheld, but a mother of one of the baby boys speaking anonymously said: \"The emotional burden of mitochondrial disease has been lifted, and in its place is hope, joy, and deep gratitude.\" How does the technique work? The procedure involves removing the genetic information from an affected mother's fertilised embryo before inserting it into one from a healthy female donor, from which the genetic information has been removed. Crucially, the hundreds of thousands of diseased mitochondria are left behind, leaving the new embryo with healthy ones present in the donor embryo. Mitochondria contain a tiny amount of their own unique genetic code, so the resulting babies carry DNA from three different people. But because it represents just 0.02% of our total DNA and has no bearing on genetic traits we inherit from our parents, researchers behind the technique, have never liked the \"three-parent\" moniker. However, the technique - whatever you choose to call it - isn't perfect. A total of 22 women underwent the procedure but only seven became pregnant, resulting in eight births - a 36% success rate. Five of the eight babies were born with no trace of disease. But tests on the other three revealed a small percentage of mutated mitochondria had been carried over during the procedure. Read more from Sky News:'My voice box was removed after NHS missed my throat cancer'World's biggest human imaging project reaches milestone While they are at levels too low to cause mitochondrial disease, the babies will require careful follow-ups to ensure they continue to develop normally. \"We have designed a study specifically for that purpose,\" said Professor Bobby McFarland, who leads the service in Newcastle. \"That's what is unique about us offering this in Newcastle because there isn't anywhere else in the world that's doing this in a regulated way.\" While there's good reason to expect the children will develop normally, the procedure does take medicine into new territory. Because mitochondria contain their own genetic code, girls born via the technique - carrying those from the healthy donor - will pass that on to any children they may have in future. Changing the \"germ-line\" in such a way has raised ethical concerns. But for seven new families, and more to follow, the procedure promises to cure a disease that has affected their families for generations."
    },
    {
        "title": "Tomorrowland: 'Devastating' blaze destroys main stage at major festival - two days before it was due to begin",
        "description": "A huge fire has destroyed the main stage of a major festival in Belgium - two days before it was due to begin.",
        "url": "https://news.sky.com/story/tomorrowland-devastating-blaze-destroys-main-stage-at-major-festival-two-days-before-it-was-due-to-begin-13397743",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-tomorrowland-belgium_6966626.jpg?20250716234247",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-16 21:56:00",
        "Headline": "The event is famous for its immersive and elaborate designs, and attracts big names including David Guetta, Swedish House Mafia, Eric Prydz and Alok.",
        "Content": " A huge fire has destroyed the main stage of a major festival in Belgium - two days before it was due to begin. Tomorrowland is a dance music event as big as Glastonbury - and David Guetta was due to perform. Footage showed flames and thick plumes of black smoke engulfing the stage and spreading to nearby woodland on Wednesday. The annual festival in the town of Boom, north of Brussels, is one of the biggest in Europe and attracts about 400,000 people over two consecutive weekends. It is famous for its immersive and elaborate designs and attracts big names within dance music - including Guetta, best known for tracks When Love Takes Over and Titanium. Dutch DJs Martin Garrix and Charlotte de Witte were also due to perform, along with the likes of Swedish House Mafia, Eric Prydz and Alok. The festival's website described the creative elements which went into the elaborate main stage. \n                  Three Belgian soldiers injured in 'shooting incident' during training exercise in Scotland\n                 \n                  Tate Britain to return painting 'looted by Nazis'\n                 \n                  Manhunt after shooting at Brussels underground station\n                 The theme, described as Orbyz, was \"set in a magical universe made entirely out of ice\" and \"full of mythical creatures\". Read more from Sky News:Ticketless Oasis fans blocked from gigAmerican Idol executive shot dead Organisers said no one was injured in the blaze but confirmed \"our beloved main stage has been severely damaged\", adding they were \"devastated\". Spokesperson Debby Wilmsen added: \"We received some truly terrible news today. A fire broke out on the Tomorrowland site ... and our main stage was essentially destroyed there, which is truly awful. \"That's a stage that took years to build, with so much love and passion. So I think a lot of people are devastated.\" Despite the fire, Tomorrowland organisers said they were still expecting 38,000 festivalgoers at DreamVille, the event's campsite."
    },
    {
        "title": "Action taken to stop ticketless Oasis fans from watching this week's shows in Manchester",
        "description": "Huge steel fences have been erected to prevent ticketless fans from watching the Oasis reunion tour in Manchester.",
        "url": "https://news.sky.com/story/huge-steel-fences-erected-to-stop-ticketless-fans-from-watching-oasis-concert-13397228",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-oasis-cardiff_6957505.jpg?20250704233136",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-16 00:46:00",
        "Headline": "While tens of thousands bought tickets for Oasis's first two shows at Heaton Park last weekend, crowds gathered to glimpse the large screens above the stage in the distance - in an area dubbed \"Gallagher Hill\" by some on social media.",
        "Content": "Huge steel fences have been erected to prevent ticketless fans from watching the Oasis reunion tour in Manchester. Liam and Noel Gallagher will resume their sold-out run of shows - their first since 2009 - with a performance at Heaton Park tonight, and two more on Saturday and Sunday. While tens of thousands bought tickets for Oasis's first two shows last weekend, crowds gathered to glimpse the large screens above the stage in the distance - in an area dubbed \"Gallagher Hill\" by some on social media. Manchester City Council has now said more steel fences have been erected around parts of the park to prevent ticketless fans from watching the gigs, and to protect nature in the park. \"After taking stock of how the first two nights went, additional measures have now been deemed necessary and will be in place for the next three concerts,\" it said. \"The erection of the fencing has a dual purpose - both to protect the environment from further damage and to dissuade people from gathering there. \"The necessary measure means the concert will no longer be visible from this area.\" \n                  Police officer left with broken nose after Manchester Airport brawl tells court she was 'absolutely terrified'\n                 \n                  Officer denies he 'lost control' attempting to arrest brothers at Manchester Airport, court hears\n                 \n                  Jury shown CCTV and bodycam footage of brothers allegedly assaulting police at Manchester Airport\n                  The fences will cover a large area of the hill within the park's cattle field, which is being developed as a new woodland area with around 300 young trees planted. The council added that there would be no facilities for people without a ticket, and said the event area is \"double-walled with solid high security fencing all the way round\". More than 2,000 event security staff and police officers will also be on duty around the site \"to ensure both the safety and wellbeing of ticket-holders and that only those who have tickets access the concert\", it said. Read more:What was Oasis's first show in 16 years like?Fans queue all day for Manchester homecoming gig John Hacking, the council's executive member for employment, skills and leisure, also said in a statement that \"unfortunately our hand has been forced in having to put these additional measures in place\". He added: \"Our advice to music fans who don't have tickets for the concerts is to head into the city centre instead. \"The whole city is going all out to celebrate and help everyone have a good time. \"We've got some fantastic things going on with a real party atmosphere for everyone to enjoy, whether they've got tickets for the Oasis gigs or not.\""
    },
    {
        "title": "Robin Kaye: American Idol TV executive and her husband shot dead inside their Los Angeles home",
        "description": "An American Idol TV executive and her husband have been found dead in their LA home.",
        "url": "https://news.sky.com/story/robin-kaye-american-idol-tv-executive-and-her-husband-shot-dead-inside-their-los-angeles-home-13397236",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-robin-kaye-american-idol_6965785.jpg?20250716025925",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-16 02:03:00",
        "Headline": "\"Robin has been a cornerstone of the Idol family since 2009 and was truly loved and respected by all who came in contact with her,\" a spokesperson for the show says.",
        "Content": "An American Idol TV executive and her husband have been found dead in their LA home. Robin Kaye was a music supervisor on the long-running reality TV series. The bodies of the 70-year-old and her husband Thomas were discovered after officers conducted a welfare check at their home. Both had died from gunshot wounds. Detectives say Raymond Boodarian has been arrested in connection with their deaths. It is alleged the 22-year-old had burgled their property while they were away on 10 July - killing the couple upon their return. According to Los Angeles Police, there were \"no signs of forced entry or trouble\" at the property. \n                  Revealed: The huge financial impact of Elon Musk's row with Donald Trump\n                 \n                  Ghislaine Maxwell could use 'government misconduct' to challenge imprisonment\n                 \n                  James Craig: Dentist in Colorado poisoned wife's protein shakes with cyanide, murder trial hears \n                 Ms Kaye was an industry veteran - and had previously worked on shows including Lip Sync Battle and The Singing Bee, as well as several Miss USA and Miss Universe pageants. Read more US news:Trump to 'refine trade deal' with UKUnreleased Beyonce music stolen In a statement, an American Idol spokesperson said: \"Robin has been a cornerstone of the Idol family since 2009 and was truly loved and respected by all who came in contact with her. \"Robin will remain in our hearts forever and we share our deepest sympathy with her family and friends during this difficult time.\""
    }
]