[
    {
        "title": "Mission: Impossible? Chancellor heads to the IMF with a very big challenge - and she's not alone",
        "description": "There will be much to chew over at the International Monetary Fund's (IMF) spring meetings this week.",
        "url": "https://news.sky.com/story/mission-impossible-chancellor-heads-to-the-imf-with-a-very-big-challenge-and-shes-not-alone-13352342",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rachel-reeves-politics_6892532.jpg?20250421005639",
        "type": "Home",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-04-20 11:18:00",
        "Headline": "The International Monetary Fund (IMF) may this week appear more akin to the Impossible Mission Force, as finance ministers including Britain's Rachel Reeves jostle for meetings with their US counterparts in an attempt to negotiate their way out of Donald Trump's damaging tariffs.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n There will be much to chew over at the International Monetary Fund's (IMF) spring meetings this week. Central bankers and finance ministers will descend on Washington for its latest bi-annual gathering, a place where politicians and academics converge, all of them trying to make sense of what's going on in the global economy. Everything and nothing has changed since they last met in October - one man continues to dominate the agenda. Six months ago, delegates were wondering if Donald Trump could win the election and what that might mean for tax and tariffs: How far would he push it? Would his policy match his rhetoric? This time round, expect iterations of the same questions: Will the US president risk plunging the world's largest economy into recession? Yes, he put on a bombastic display on his so-called \"Liberation Day\", but will he now row back? Have the markets effectively checked him? Behind the scenes, finance ministers from around the world will be practising their powers of persuasion, each jostling for meetings with their US counterparts to negotiate a reduction in Trump's tariffs. That includes Chancellor Rachel Reeves, who is still holding out hope for a trade deal with the US - although she is not alone in that. Read more:PM and Trump step up trade talksEd Conway on the impact of US tariffs  Are we heading for a recession? The IMF's economists have already made up their minds about Trump's potential for damage. Last week, they warned about the growing risks to financial stability after a period of turbulence in the financial markets, induced by Trump's decision to ratchet up US protectionism to its highest level in a century. By the middle of this week the organisation will publish its World Economic Outlook, in which it will downgrade global growth but stop short of predicting a full-blown recession. Others are less optimistic. Kristalina Georgieva, the IMF's managing director, said last week: \"Our new growth projections will include notable markdowns, but not recession. We will also see markups to the inflation forecasts for some countries.\" She acknowledged the world was undergoing a \"reboot of the global trading system,\" comparing trade tensions to \"a pot that was bubbling for a long time and is now boiling over\". She went on: \"To a large extent, what we see is the result of an erosion of trust - trust in the international system, and trust between countries.\" Don't poke the bear It was a carefully calibrated response. Georgieva did not lay the blame at the US's door and stopped short of calling on the Trump administration to stop or water down its aggressive tariffs policy. That might have been a choice. To the frustration of politicians past and present, the IMF does not usually shy away from making its opinions known. Last year it warned Jeremy Hunt against cutting taxes, and back in 2022 it openly criticised the Liz Truss government's plans, warning tax cuts would fuel inflation and inequality. Taking such a candid approach with Trump invites risks. His administration is already weighing up whether to withdraw from global institutions, including the IMF and the World Bank. The US is the largest shareholder in both, and its departure could be devastating for two organisations that have been pillars of the world economic order since the end of the Second World War. 👉 Follow Trump 100 on your podcast app 👈 Here in the UK, Andrew Bailey has already raised concerns about the prospect of global fragmentation. It is \"very important that we don't have a fragmentation of the world economy,\" the Bank of England's governor said. \"A big part of that is that we have support and engagement in the multilateral institutions, institutions like the IMF, the World Bank, that support the operation of the world economy. That's really important.\" The Trump administration might take a different view when its review of intergovernmental organisations is complete. That is the main tension running through this year's spring meetings. How much the IMF will say and how much we will have to read between the lines, remains to be seen."
    },
    {
        "title": "Chelsea fans condemn 'unethical' ticket resale site - which club chairman invests in",
        "description": "Premier League match tickets at Chelsea have been selling for more than twice the price of a season ticket on an American exchange website with a familiar director and investor to supporters &#8211; club chairman Todd Boehly.",
        "url": "https://news.sky.com/story/chelsea-fans-criticise-unethical-ticket-resale-platform-which-club-chairman-invests-in-13352484",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-chelsea-todd-boehly_6891812.jpg?20250420152058",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-04-20 13:50:00",
        "Headline": "Chelsea chairman Todd Boehly has been accused of having a \"conflict of interest\" by investing in an American ticket resale company that is \"unauthorised\" by the club. Many of the club's fans, especially those who live abroad, face huge prices on platforms just like it.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  Premier League match tickets at Chelsea have been selling for more than twice the price of a season ticket on an American exchange website with a familiar director and investor to supporters – club chairman Todd Boehly. Amid growing fan fury, Sky News was able to access the Vivid Seats platform on different devices last week from London - and saw tickets for the visit of Liverpool on 4 May, priced by Chelsea at a maximum of £80, being sold for between £537 and £2,666. Some tickets were listed as being sold by traders. Chelsea's official website appeared to show no availability for this premium fixture, with the Blues battling for Champions League qualification and Liverpool potentially celebrating being crowned Premier League winners. The most expensive Stamford Bridge season ticket for this campaign was £1,015. Vivid is listed by the Premier League among \"unauthorised ticket websites\" with a message: \"We would urge fans to exercise extreme caution when dealing with these websites.\" The Chelsea Supporters' Trust has written to the Premier League to ask that Vivid - given its ties with a club's shareholder - \"ceases facilitating the sale of tickets for significantly above face value\". Mr Boehly - part of the consortium that replaced Roman Abramovich as owner in 2022 - has not addressed accusations of a \"conflict of interest\" or claims he is undermining efforts to combat ticket touting. There are anti-touting warnings on signs in the streets approaching the stadium. An official Chelsea Ticket Exchange allows season ticket holders to sell their tickets \"at the pro-rata price of season tickets\" to a club member \"in a safe, secure environment\". While Chelsea's website says to only buy tickets in the UK from official sellers, it adds: \"Many of the websites that advertise and sell tickets online are not within the jurisdiction of UK law. \"This means, while we report these sites when we see Chelsea tickets on them, there is little we can do to shut down the sites.\" On Vivid, we did see warnings telling visiting users not to buy seats in the home sections and a pop-up eventually appeared after browsing the availability, saying: \"Tickets for the EPL matches are not currently available for purchase in your location.\" No attempt was made by us to buy tickets. But should we have been able to see the listings at all? Sky News first asked for comment from Vivid last Monday and continued to see ticket listings with variable prices in pounds during the week. It took until Friday night for any form of response. \"Vivid Seats respectfully adheres to the laws that are in place in the United Kingdom and is not in violation of any regulations around EPL tickets,\" the email read in part. \"As such, Vivid Seats' policy restricts the sale and marketing of EPL tickets in the United Kingdom.\" When Sky News checked the website again on Saturday the listings for Premier League matches were no longer visible as they are from outside of Britain. Asked if they were no longer visible after our inquiries, Vivid's official replied: \"The conclusions that you are drawing are factually incorrect. \"We understand that people will try to find ways to circumvent technology and as such, we have validation protocols in place in order to restrict the sale and marketing of EPL tickets in the United Kingdom.\" Again, Vivid insisted it adheres to laws and regulations in Britain. But the same official did not respond to an email detailing how we were able to view the tickets listings from London on separate days, without using VPN software that can make your browser seem as if it's accessing the internet from another country. 'It's the only way I was going to get here' Ticket exchange websites can be the only way for some fans overseas to come to matches. When Ipswich played at Stamford Bridge on 13 April, Baz Gillespie was able to watch after 20 years living in Cyprus by paying a vastly-inflated £300 for two tickets on a website other than Vivid. \"The only way I was going to get here was that way,\" he said, remembering the days he could just queue up and pay a fiver for a ticket. The same match was Martin van Dijk's first-ever game at the Bridge, having come from the Netherlands after paying €150 (£128) on another exchange website after initially trying through Vivid. \"If there's no other option, and you want to visit, it's the only way, but I'd rather get it through like the normal way,\" he said. 'An absolute disgrace' It is the \"normal way\" that so many supporters want to protect and are aghast at Mr Boehly's links to Vivid, predating his purchase of a stake in Chelsea. \"It's an absolute disgrace,\" supporter Ben Grey said. \"He shouldn't be involved in Chelsea and a reselling website. It's unethical from a basic perspective. \"The club are coming out with communication saying that they're against ticket reselling and our semi-majority shareholder [has a website] reselling tickets to our games.\" Asked what the Premier League should do, he replied: \"I'm a massive Chelsea fan, I don't want Chelsea to be hit hard by anything. \"But the fact of the matter is they need to sort that out and if they're allowing there to be an owner of a club who's reselling tickets, it's a disgrace.\" 'Not a very good look' Another fan, Rich Still, called it \"21st century greed\". The issue is resonating with young children. Rhys Edwards, watching with his father, said: \"It doesn't look too good on Chelsea and their owners to be fair. \"Saying that [the website] is not authorised by the league they're playing in isn't a very good look.\" Officials with Chelsea, the Premier League and Mr Boehly declined to comment. The Vivid statement to Sky News stressed: \"It is important to note that Vivid Seats does not set the base price for tickets sold on its marketplace or receive any revenue from that base price; only the seller sets and receives the base ticket price.\" 'It's like the Wild West' Vivid highlighted to Sky News its \"long-standing partnership\", including being a backer of a 2023 summer tour of the United States. Chelsea's website featured a quote saying: \"We are pleased to join with a company committed to becoming the ultimate partner for connecting fans to the live events, teams and artists they love.\" The government has launched a consultation to prevent people from being ripped off in Britain by the resale of tickets. Read more:Chelsea star's £160,000 car seizedUK set to host 2035 Women's World Cup The limit could range from the cost of the original ticket to a 30% uplift to stop the public being \"fleeced\" by professional touts. Labour MP for Ealing Central and Acton, Rupa Huq, has separately proposed a change to the law to improve pricing transparency on secondary ticketing sites. \"It's an unregulated market,\" she told Sky News. \"It's like the Wild West. It needs getting back into control.\""
    },
    {
        "title": "Trump hopes Russia and Ukraine 'will make deal this week' - as Putin's 'Easter truce' expires",
        "description": "US President Donald Trump has said he hopes Russia and Ukraine \"will make a deal this week\" as Vladimir Putin's \"Easter truce\" expired, with the two countries blaming each other for breaking it.",
        "url": "https://news.sky.com/story/trump-hopes-russia-and-ukraine-make-deal-this-week-as-putins-easter-truce-expires-13352928",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-russia-ukraine_6892514.jpg?20250420232053",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-20 20:26:00",
        "Headline": "Ukrainian President Volodymyr Zelenskyy says the Russian army had \"violated Putin's ceasefire more than 2,000 times\" and accused him of being only interested in favourable PR coverage.",
        "Content": "US President Donald Trump has said he hopes Russia and Ukraine \"will make a deal this week\" as Vladimir Putin's \"Easter truce\" expired, with the two countries blaming each other for breaking it. The Russian leader said he had ordered his forces to stop all military activity along the frontline for 30 hours from 6pm on Saturday (4pm UK time) until midnight on Sunday (10pm UK time). But on Sunday evening, Ukrainian President Volodymyr Zelenskyy said the Russian army had \"violated Putin's ceasefire more than 2,000 times\" during the day. Mr Trump wrote on his Truth Social platform that \"hopefully Russia and Ukraine will make a deal this week\" and both will then \"start to do big business\" with the US. Latest updates on Russia's war in Ukraine  Mr Zelenskyy accused Russia of \"failing\" to \"uphold its own promise of ceasefire\" and wrote on X: \"Either Putin does not have full control over his army, or the situation proves that in Russia, they have no intention of making a genuine move toward ending the war, and are only interested in favourable PR coverage.\" Mr Zelenskyy proposed that Russia \"cease any strikes using long-range drones and missiles on civilian infrastructure for a period of at least 30 days, with the possibility of extension\". \n                  Why Putin has suddenly offered an 'Easter truce' in Ukraine - and the interesting way it's being presented\n                 \n                  Russian attacks on Ukraine continue despite 'Easter truce', Zelenskyy says\n                 \n                  Trump threatens to 'take a pass' on Ukraine peace talks\n                 And he added that if Russia does not agree to such a step \"it will be proof that it intends to continue doing only those things which destroy human lives and prolong the war\". He insisted that the Ukrainian army was \"acting - and will continue to act - in a fully symmetrical manner\" and this Easter has \"clearly demonstrated that the only source of this war, and the reason it drags on, is Russia\". \"We are ready to move toward peace and a full, unconditional, and honest ceasefire that could last for at least 30 days - but there has been no response from Russia on that so far.\"  What has Moscow said? Russia's defence ministry said Ukraine had broken the ceasefire more than 1,000 times, damaging infrastructure and causing civilian deaths. According to the ministry, Ukrainian forces had shot at Russian positions 444 times while there had been more than 900 Ukrainian drone attacks, including on Crimea and the Russian border areas of the Bryansk, Kursk and Belgorod regions. \"As a result, there are deaths and injuries among the civilian population, as well as damage to civilian facilities,\" the ministry said. The Kremlin said there was no order for the ceasefire to be extended. Read more:Why Putin suddenly offered an 'Easter truce'Trump 'starting to look genuinely manipulated by Putin'  Mr Trump and his secretary of state Marco Rubio warned on Friday that the US will walk away from efforts to broker a peace deal unless there are clear signs of progress soon. The US president said negotiations between Ukraine and Russia were \"coming to a head\" and he insisted that neither side is \"playing\" him in his push to end the grinding three-year war. Last month, Ukraine accepted Mr Trump's proposal for a 30-day truce. But Mr Putin refused to back a full 30-day ceasefire, saying crucial issues of verification had not been sorted out. He said he would agree not to target Ukraine's energy infrastructure. However, both sides have accused each other of breaking the moratorium on attacks on energy targets and at sea."
    },
    {
        "title": "Israeli military fires deputy commander as it releases findings of investigation into deadly attack on aid workers",
        "description": "The Israeli military has said its investigation into the killing of aid workers in Gaza has found there were \"several professional failures, breaches of orders, and a failure to fully report the incident\".",
        "url": "https://news.sky.com/story/israeli-military-fires-deputy-commander-as-it-releases-findings-of-investigation-into-deadly-attack-on-aid-workers-13352476",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-gaza-paramedics_6876598.jpg?20250406043742",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-20 13:33:00",
        "Headline": "Fifteen aid workers were shot dead by Israeli troops who opened fire on a convoy of vehicles, including ambulances, in March.",
        "Content": " The Israeli military has said its investigation into the killing of aid workers in Gaza has found there were \"several professional failures, breaches of orders, and a failure to fully report the incident\". A deputy commander will be dismissed for providing an \"inaccurate report\" and a commanding officer will be reprimanded following the military probe, the Israel Defence Forces (IDF) said, adding there was \"no attempt to conceal the event\". Fifteen aid workers were shot dead by Israeli troops who opened fire on a convoy of vehicles, including ambulances, on 23 March. They were then buried in a shallow grave where their bodies were found a week later by officials from the United Nations and the Palestinian Red Crescent.  The probe's findings come after a Sky News investigation earlier this week revealed how the deadly attack unfolded, contradicting Israel's official account of the killings. At first, Israel claimed the medics' vehicles did not have emergency signals on when troops fired their shots, but later backtracked. Mobile phone video which was recovered from one of the medics contradicted Israel's initial account. Footage showed the moment the aid workers were killed, with ambulances and fire insignia clearly visible and red lights flashing as they pulled up to help another ambulance that came under fire earlier.  In a statement on Sunday, an IDF spokesperson said: \"The Commanding Officer of the 14th Brigade will receive a reprimand, which will be recorded in his personal file, for his overall responsibility for the incident, including the procedure of combat and management of the scene afterward. \"The deputy commander of the Golani Reconnaissance Battalion will be dismissed from his position due to his responsibilities as the field commander in this incident and for providing an incomplete and inaccurate report during the debrief.\" The deputy commander is a \"highly respected officer\" who had returned from abroad to serve in reserve duty following Hamas's 7 October attack, the IDF statement said. The statement did not say if anyone would face criminal charges. Nebal Farsakh, a spokesperson for the Red Crescent, told the AFP news agency that the report was \"invalid\" as it \"shifts responsibility to a personal error in the field command when the truth is quite different\".  'Poor night visibility' The Israeli military investigation found that the incident happened in a \"hostile and dangerous combat zone\" and the deputy commander did not initially recognise the vehicles as ambulances \"due to poor night visibility\", according to the IDF spokesperson. \"Only later, after approaching the vehicles and scanning them, was it discovered that these were indeed rescue teams,\" the spokesperson added. The investigation said the Palestinians were killed because of an \"operational misunderstanding\" by Israeli forces, and that a separate incident 15 minutes later, when Israeli soldiers shot at a Palestinian UN vehicle, was a breach of orders. News correspondent What was striking about the briefing by the Israeli military into their investigation of the killing of the Gaza medics, was the Israeli Defence Forces' detailed explanation about the \"state of the mind\" of the Golani Reconnaissance Battalion. It said the troops were in an \"active combat zone\" and had a \"feeling\" Hamas was operating around them. The IDF blamed the attack on a series of operational mistakes. First, in the early hours of the morning, the Israeli military attacked a vehicle they believed belonged to Hamas. Two Palestinians were killed. The Israeli military says a third man, Assad al Nsasrah, was questioned in basic Arabic, but the soldiers misunderstood him and thought he was admitting to being a member of the group. The vehicle was, in fact, an ambulance and the men killed were medics. The military later realised this mistake. Al Nsasrah has been detained by Israel. Officials at the briefing offered no update on his situation. The next incident was the convoy. The IDF said the deputy commander of the battalion opened fire because he failed to see that they were emergency vehicles. The military said that from the position he was in and wearing his night vision goggles, the deputy commander could see the lights of the truck but not its siren and failed to identify it as a fire truck. He opened fire and the rest of the troops followed. The IDF claimed it \"made sense\" that the battalion thought it was attacking Hamas. It also said they started shooting because the men in the vehicles \"stopped and got out\". The IDF said six of the men were members of Hamas. But it provided no evidence of this. It said Hamas members sometimes had \"day jobs\", implying they could be both medical workers and operatives. Again, no evidence was provided. Probe looked at 'three shooting incidents' The IDF said that about an hour before the attack on the convoy, Israeli troops fired at what they \"identified as a Hamas vehicle\" and the forces \"remained on high alert for further potential threats\". In the convoy incident, the IDF said the soldiers \"opened fire on suspects emerging from a fire truck and ambulances very close to the area in which the troops were operating, after perceiving an immediate and tangible threat\". \"Supporting surveillance\" had reported five vehicles approaching rapidly and stopping near the troops, with passengers quickly disembarking, according to the IDF. It said the deputy battalion commander \"assessed the vehicles as employed by Hamas forces, who arrived to assist the first vehicle's passengers\", adding that: \"Under this impression and sense of threat, he ordered to open fire.\"  According to the IDF, six of the 15 killed were \"identified in a retrospective examination as Hamas terrorists\". But the Sky News investigation found no evidence to support this claim, and the Israeli military has not produced any new evidence. The IDF also said there was a third incident about 15 minutes later where \"the troops fired at a Palestinian UN vehicle due to operational errors in breach of regulations\". \"The troops' commander initially reported the event, and additional details emerged later in the examination,\" it added. Bodies were buried in mass grave Eight Red Crescent personnel, six civil defence workers and a UN staff member were killed in the shooting on the convoy by troops carrying out operations in Tel al Sultan, a district of the southern Gaza city of Rafah. Troops then bulldozed over the bodies along with their mangled vehicles, burying them in a mass grave. 'Decision to crush vehicles was wrong' The IDF statement said that at dawn it was decided to \"gather and cover the bodies to prevent further harm and clear the vehicles from the route in preparation for civilian evacuation\". The body removal and vehicle crushing were carried out by field commanders, according to the military. Removing the bodies was reasonable under the circumstances, but the decision to crush the vehicles was wrong, the investigation concluded, and \"in general there was no attempt to conceal the event\". \"The examination found no evidence to support claims of execution or that any of the deceased were bound before or after the shooting,\" the investigation added. The probe also found that \"the [gun]fire in the first two incidents resulted from an operational misunderstanding by the troops, who believed they faced a tangible threat from enemy forces\". It added that the third incident \"involved a breach of orders during a combat setting\". The statement also said Israel's military \"regrets the harm caused to uninvolved civilians\"."
    },
    {
        "title": "Ranked: Britain's 10 worst airports for flight delays",
        "description": "Gatwick is the UK's worst airport for flight delays for the second year running, according to new data from the Civil Aviation Authority (CAA).",
        "url": "https://news.sky.com/story/ranked-britains-10-worst-airports-for-flight-delays-13352728",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-south-terminal-gatwick-airport_6754432.jpg?20241122111018",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-20 17:11:00",
        "Headline": "The average delay for flights from major UK airports was 18 minutes and 24 seconds in 2024, down from 20 minutes and 42 seconds in 2023.",
        "Content": "Gatwick is the UK's worst airport for flight delays for the second year running, according to new data from the Civil Aviation Authority (CAA). After suffering from continued air traffic control (ATC) disruptions, departures from the West Sussex airport were delayed by more than 23 minutes on average in 2024. In 2023, its flights were delayed by nearly 27 minutes - so the airport, which is the UK's second busiest, has seen an improvement. A spokesperson said the airport had a \"robust plan\" to improve things further in 2025, including a new method to separate arriving aircraft, and trialling the co-ordination of connecting jet bridges to planes remotely. They said Gatwick remains \"the world's most efficient single-runway airport, with flights departing or arriving every 55 seconds\". Gatwick was badly impacted by ATC staff shortages both in Europe and in its own control tower last year, which a 2024 report by the Royal Aeronautical Society suggested may be in part due to the pandemic. It said staffing was reduced because of a downturn in traffic during lockdowns, and recruiting and training new ATC workers can take up to three years. Julia Lo Bue-Said, chief executive of Advantage Travel Partnership, a network of independent travel agents, said passengers should expect better than \"stuck in terminals\" for hours \"with little information or support\". 10 - Cardiff Airport Cardiff had average delays of 17 minutes and 36 seconds.  9 - Luton Airport Luton recorded average delays of 17 minutes and 42 seconds in 2024. That was an improvement on the year before, with the airport recording delays of nearly 23 minutes in 2023. 8 - Bournemouth Airport Bournemouth also saw an improvement.  Despite recording average delays of 17 minutes and 48 seconds, it saw around a two-and-a-half minute improvement on the year before. 7 - Edinburgh Airport Scotland's busiest airport had average delays of 18 minutes and six seconds in 2024. That was an improvement of nearly three-and-a-half minutes from the 12 months previous. 6 - Exeter Airport Exeter, on the other hand, saw growing delays in 2024. Last year's data showed average delays of 15 minutes and 42 seconds at the airport. In 2024, that figure jumped to 19 minutes. 5 - Teesside International Airport Teesside also recorded longer delays of around two minutes on average.  In 2024, its departing flights were delayed by an average of 19 minutes and six seconds. 4 - Stansted Airport Stansted recorded average delays of 19 minutes and 36 seconds in 2024, a 30-second increase on the previous year. 3 - Manchester Airport The UK's third-busiest airport came third on the list with average delays of 20 minutes last year. In 2023, its delays were longer by nearly two minutes. 2 - Birmingham Airport Birmingham saw delays of 21 minutes and 18 seconds.  Despite moving up the list, it improved its delay time by 12 seconds on the year before. 1 - Gatwick Airport Gatwick Airport recorded delays of 23 minutes and 18 seconds, an improvement of over three minutes and 36 seconds. At the other end of the table... Belfast City airport recorded the best punctuality in the UK for the second year in a row. Its typical delay per flight was less than 12 minutes. The average delay for flights from major UK airports was 18 minutes and 24 seconds in 2024, down from 20 minutes and 42 seconds in 2023. Read more from Sky News:Husband describes 'horror' as wife killed on golf coursePolice appeal over 'senseless' damage to seven statues \"Aviation continues to recover from the pandemic, and operates in an extremely busy, global environment with resilience challenges,\" said a spokesperson for trade body AirportsUK. \"It is therefore positive that the data shows delays continue to come down as everyone in aviation works together to provide the best possible service to passengers.\""
    },
    {
        "title": "Woman stabbed to death in Enfield, north London",
        "description": "A murder investigation is under way after a woman was stabbed to death in north London.",
        "url": "https://news.sky.com/story/woman-stabbed-to-death-in-enfield-north-london-13352826",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-enfield-ayley-croft_6892418.jpg?20250420212451",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-20 18:57:00",
        "Headline": "No one has been arrested over the death of the 45-year-old woman as police launch a murder investigation.",
        "Content": "A murder investigation is under way after a woman was stabbed to death in north London. Police were called to an address in Ayley Croft, Enfield, around 7pm on Saturday following reports of a stabbing. Emergency workers treated a 45-year-old woman but she died at the scene, the Metropolitan Police said. The victim's next of kin has been informed and is being supported by specialist officers. No one has been arrested in connection with her death. Police have been seen focusing on Gainsborough House, a high-rise block on the estate. An officer was spotted at the window on the fifth floor. Patrols have also been seen outside. Detective Chief Inspector Neil John said: \"Our thoughts are with the victim's family at this difficult time. \"As our investigation continues, there will be an increased police presence in the area, and a crime scene remains in place. \"We understand this will be very distressing to the local community and anyone who has concerns can speak to local officers.\" Read more from Sky News:Husband describes 'horror' as wife fatally hit by vanPrince Andrew joins King and Queen at Easter service Police are appealing for dashcam footage from anyone who was driving through Ayley Croft between 6.30pm and 7.30pm on Saturday."
    },
    {
        "title": "DHL suspends some shipments to US amid Trump tariff regime",
        "description": "DHL Express is suspending some shipments to the US as Donald Trump's new tariff regime takes effect.",
        "url": "https://news.sky.com/story/dhl-suspends-some-shipments-to-us-amid-trump-tariff-regime-13352908",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-dhl-delivery_6892521.jpg?20250420233400",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-20 20:09:00",
        "Headline": "New rules came into effect at the beginning of April, meaning shipments worth more than $800 into the US were subject to increased customs checks.",
        "Content": "DHL Express is suspending some shipments to the US as Donald Trump's new tariff regime takes effect. From 21 April, shipments worth more than $800 (£603) to US consumers from \"any origin\" will be temporarily suspended. New rules that came into effect at the start of April made such shipments subject to increased customs checks. \"This change has caused a surge in formal customs clearances, which we are handling around the clock,\" said the parcel delivery service. Shipments going from business to business worth more than $800 aren't affected by the suspension, but DHL warned they may also face delays. Shipments under $800 to either businesses or consumers are not impacted, but one British cycle manufacturer suggested its US customers may need to split orders over $800 into \"smaller shipments\" to avoid the red tape. Read more:The art of doing a deal with TrumpIs there method to Trump's madness? \n                  Mission: Impossible? Chancellor heads to the IMF with a very big challenge - and she's not alone\n                 \n                  Canadians facing 'biggest crisis' of their lifetimes because of Donald Trump tariffs, Mark Carney warns\n                 \n                  Trump tariffs to knock growth but won't cause global recession, says IMF\n                  Trump targeting 'deceptive' practices From May, shipments from China and Hong Kong that are worth less than $800 \"will be subject to all applicable duties\", according to the White House. \"President Trump is targeting deceptive shipping practices by Chinese-based shippers, many of whom hide illicit substances, including synthetic opioids, in low-value packages,\" it said in a statement. Until now, deliveries worth less than $800 didn't incur any duties, which allowed low-cost companies Chinese like Shein and Temu to make inroads in the US. Both have warned their prices will now rise because of the rule changes, starting on 25 April."
    },
    {
        "title": "Hospital patient had to wait more than 10 days for a bed - as 'unacceptable' crisis laid bare",
        "description": "Around 49,000 A&E patients had to wait 24 hours or more for a hospital bed in England last year, according to NHS figures.",
        "url": "https://news.sky.com/story/hospital-patient-had-to-wait-more-than-10-days-for-a-bed-as-unacceptable-crisis-laid-bare-13352961",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-nhs-corridor-crisis_6800246.jpg?20250115150901",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-20 23:12:00",
        "Headline": "The figures have been described as pointing to a \"crisis in corridor care\", but while the government admits the waits are unacceptable, it says fixing the problem \"will take time\".",
        "Content": "Around 49,000 A&E patients had to wait 24 hours or more for a hospital bed in England last year, according to NHS figures. Data compiled by the Liberal Democrats from freedom of information requests shows the longest wait was 10 days and 13 hours. The party said there were 48,830 \"trolley waits\" of 24 hours or longer in 2024. That is 19.8% higher than 2023 (40,735) and 57.9% higher than 2022 (30,921). A \"trolley wait\" is the time taken for a patient to be transferred to a ward after a decision has been taken to admit them to hospital. The Lib Dems said the real numbers were likely to be far higher because only 54 out of 141 NHS trusts had provided full data. Over the last three years, the percentage of those waiting aged 65 or over remained consistent at around 70%. The Royal College of Nursing said the figures \"only begin to scratch the surface\" of a \"crisis in corridor care\" - and that declining recruitment in nursing was adding to the problem. \n                  Lercanidipine: Patients urged to check blood pressure medication after labelling error\n                 \n                  Disposable vape ban 'may not curb e-cigarette use'\n                 \n                  Low-level drinkers have increased cancer and cardiovascular risk, study finds\n                 General secretary Professor Nicola Ranger said corridor care is \"undignified and unsafe\" and \"must be eradicated\".  Crisis 'will take time' to fix The government has made cutting NHS waiting lists one of its key missions. It insisted progress had been made by deploying RSV, COVID and flu vaccines, ending strikes by healthcare workers and reforming the health service, including scrapping NHS England. A spokesperson for the Department of Health and Social Care said: \"No patient should have to spend 24 hours in A&E waiting to be admitted to a ward. \"We are determined to end the annual winter crisis in urgent care and to cut waiting lists for emergency care, but it will take time.\" They said \"providing more care in the community\" would help ensure fewer patients end up in A&E to begin with. The Lib Dems are campaigning for a new team of \"super-heads\", consisting of experienced NHS bosses, to be deployed within struggling NHS Trusts and bring them up to standard. Read more from Sky News:A&E waits linked to deathsLabour marks NHS 'milestone' Official statistics show the total number of patients waiting over 12 hours for an emergency admission in England decreased from 61,529 in January to 46,766 in March. Some of the fall can be attributed to a post-seasonal peak from winter illnesses. Previous analysis by the Royal College of Emergency Medicine found there were almost 14,000 deaths associated with long A&E stays before admission in 2023."
    },
    {
        "title": "Husband describes 'horror' as wife fatally hit by van at golf course after police chase",
        "description": "A husband has described how he watched in \"helpless horror\" as his wife was fatally hit by a van at a golf course after the vehicle was involved in a police chase.",
        "url": "https://news.sky.com/story/husband-describes-horror-as-wife-fatally-hit-by-van-at-golf-course-after-police-chase-13352523",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-suzanne-cherry_6891844.jpg?20250420170512",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-20 14:28:00",
        "Headline": "Suzanne Cherry, 62, died in hospital four days after she was struck by the vehicle at Aston Wood Golf Club.",
        "Content": "A husband has described how he watched in \"helpless horror\" as his wife was fatally hit by a van at a golf course after the vehicle was involved in a police chase. Suzanne Cherry, 62, died in hospital four days after she was struck on the morning of 11 April, Staffordshire Police said. Two patrol cars had been following the grey Nissan van in Kingstanding, Birmingham, after receiving reports of suspicious activity, according to the Independent Office for Police Conduct (IOPC). They stopped chasing the van when it came off the road and went up an embankment at Aston Wood Golf Club, where it hit Ms Cherry, of Aldridge, Walsall. In a statement released by police, Ms Cherry's husband - who was not named - paid tribute to his \"beautiful wife\" and said her death leaves an \"unfillable void\" in the lives of her family. \"While enjoying what should have been the safest of one of Suzanne's many activities, I watched in helpless horror as the life of my beautiful wife and our future together was snatched away in an instant,\" he said. Ms Cherry's husband said she had \"an amazing and infectious zest for life\", adding: \"Suzanne leaves a legacy and an unfillable void in the lives of her mother Maureen, her three adult children, two step-children and countless others from her work, her sporting activities and social circle. \"Sue was loved, and will be painfully missed by her entire family and friends, we ask that our privacy at this difficult time be respected.\" Read more from Sky News:London-born teenager set to become a saint - here's howThe Who drummer rejoins band days after departure Officers from three different forces have arrested six men in connection with the incident. The IOPC is continuing to investigate the circumstances before the collision. Police are continuing to appeal for witnesses to come forward."
    },
    {
        "title": "Chelsea fans condemn 'unethical' ticket resale site - which club chairman invests in",
        "description": "Premier League match tickets at Chelsea have been selling for more than twice the price of a season ticket on an American exchange website with a familiar director and investor to supporters &#8211; club chairman Todd Boehly.",
        "url": "https://news.sky.com/story/chelsea-fans-criticise-unethical-ticket-resale-platform-which-club-chairman-invests-in-13352484",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-chelsea-todd-boehly_6891812.jpg?20250420152058",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-04-20 13:50:00",
        "Headline": "Chelsea chairman Todd Boehly has been accused of having a \"conflict of interest\" by investing in an American ticket resale company that is \"unauthorised\" by the club. Many of the club's fans, especially those who live abroad, face huge prices on platforms just like it.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  Premier League match tickets at Chelsea have been selling for more than twice the price of a season ticket on an American exchange website with a familiar director and investor to supporters – club chairman Todd Boehly. Amid growing fan fury, Sky News was able to access the Vivid Seats platform on different devices last week from London - and saw tickets for the visit of Liverpool on 4 May, priced by Chelsea at a maximum of £80, being sold for between £537 and £2,666. Some tickets were listed as being sold by traders. Chelsea's official website appeared to show no availability for this premium fixture, with the Blues battling for Champions League qualification and Liverpool potentially celebrating being crowned Premier League winners. The most expensive Stamford Bridge season ticket for this campaign was £1,015. Vivid is listed by the Premier League among \"unauthorised ticket websites\" with a message: \"We would urge fans to exercise extreme caution when dealing with these websites.\" The Chelsea Supporters' Trust has written to the Premier League to ask that Vivid - given its ties with a club's shareholder - \"ceases facilitating the sale of tickets for significantly above face value\". Mr Boehly - part of the consortium that replaced Roman Abramovich as owner in 2022 - has not addressed accusations of a \"conflict of interest\" or claims he is undermining efforts to combat ticket touting. There are anti-touting warnings on signs in the streets approaching the stadium. An official Chelsea Ticket Exchange allows season ticket holders to sell their tickets \"at the pro-rata price of season tickets\" to a club member \"in a safe, secure environment\". While Chelsea's website says to only buy tickets in the UK from official sellers, it adds: \"Many of the websites that advertise and sell tickets online are not within the jurisdiction of UK law. \"This means, while we report these sites when we see Chelsea tickets on them, there is little we can do to shut down the sites.\" On Vivid, we did see warnings telling visiting users not to buy seats in the home sections and a pop-up eventually appeared after browsing the availability, saying: \"Tickets for the EPL matches are not currently available for purchase in your location.\" No attempt was made by us to buy tickets. But should we have been able to see the listings at all? Sky News first asked for comment from Vivid last Monday and continued to see ticket listings with variable prices in pounds during the week. It took until Friday night for any form of response. \"Vivid Seats respectfully adheres to the laws that are in place in the United Kingdom and is not in violation of any regulations around EPL tickets,\" the email read in part. \"As such, Vivid Seats' policy restricts the sale and marketing of EPL tickets in the United Kingdom.\" When Sky News checked the website again on Saturday the listings for Premier League matches were no longer visible as they are from outside of Britain. Asked if they were no longer visible after our inquiries, Vivid's official replied: \"The conclusions that you are drawing are factually incorrect. \"We understand that people will try to find ways to circumvent technology and as such, we have validation protocols in place in order to restrict the sale and marketing of EPL tickets in the United Kingdom.\" Again, Vivid insisted it adheres to laws and regulations in Britain. But the same official did not respond to an email detailing how we were able to view the tickets listings from London on separate days, without using VPN software that can make your browser seem as if it's accessing the internet from another country. 'It's the only way I was going to get here' Ticket exchange websites can be the only way for some fans overseas to come to matches. When Ipswich played at Stamford Bridge on 13 April, Baz Gillespie was able to watch after 20 years living in Cyprus by paying a vastly-inflated £300 for two tickets on a website other than Vivid. \"The only way I was going to get here was that way,\" he said, remembering the days he could just queue up and pay a fiver for a ticket. The same match was Martin van Dijk's first-ever game at the Bridge, having come from the Netherlands after paying €150 (£128) on another exchange website after initially trying through Vivid. \"If there's no other option, and you want to visit, it's the only way, but I'd rather get it through like the normal way,\" he said. 'An absolute disgrace' It is the \"normal way\" that so many supporters want to protect and are aghast at Mr Boehly's links to Vivid, predating his purchase of a stake in Chelsea. \"It's an absolute disgrace,\" supporter Ben Grey said. \"He shouldn't be involved in Chelsea and a reselling website. It's unethical from a basic perspective. \"The club are coming out with communication saying that they're against ticket reselling and our semi-majority shareholder [has a website] reselling tickets to our games.\" Asked what the Premier League should do, he replied: \"I'm a massive Chelsea fan, I don't want Chelsea to be hit hard by anything. \"But the fact of the matter is they need to sort that out and if they're allowing there to be an owner of a club who's reselling tickets, it's a disgrace.\" 'Not a very good look' Another fan, Rich Still, called it \"21st century greed\". The issue is resonating with young children. Rhys Edwards, watching with his father, said: \"It doesn't look too good on Chelsea and their owners to be fair. \"Saying that [the website] is not authorised by the league they're playing in isn't a very good look.\" Officials with Chelsea, the Premier League and Mr Boehly declined to comment. The Vivid statement to Sky News stressed: \"It is important to note that Vivid Seats does not set the base price for tickets sold on its marketplace or receive any revenue from that base price; only the seller sets and receives the base ticket price.\" 'It's like the Wild West' Vivid highlighted to Sky News its \"long-standing partnership\", including being a backer of a 2023 summer tour of the United States. Chelsea's website featured a quote saying: \"We are pleased to join with a company committed to becoming the ultimate partner for connecting fans to the live events, teams and artists they love.\" The government has launched a consultation to prevent people from being ripped off in Britain by the resale of tickets. Read more:Chelsea star's £160,000 car seizedUK set to host 2035 Women's World Cup The limit could range from the cost of the original ticket to a 30% uplift to stop the public being \"fleeced\" by professional touts. Labour MP for Ealing Central and Acton, Rupa Huq, has separately proposed a change to the law to improve pricing transparency on secondary ticketing sites. \"It's an unregulated market,\" she told Sky News. \"It's like the Wild West. It needs getting back into control.\""
    },
    {
        "title": "Woman stabbed to death in Enfield, north London",
        "description": "A murder investigation is under way after a woman was stabbed to death in north London.",
        "url": "https://news.sky.com/story/woman-stabbed-to-death-in-enfield-north-london-13352826",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-enfield-ayley-croft_6892418.jpg?20250420212451",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-20 18:57:00",
        "Headline": "No one has been arrested over the death of the 45-year-old woman as police launch a murder investigation.",
        "Content": "A murder investigation is under way after a woman was stabbed to death in north London. Police were called to an address in Ayley Croft, Enfield, around 7pm on Saturday following reports of a stabbing. Emergency workers treated a 45-year-old woman but she died at the scene, the Metropolitan Police said. The victim's next of kin has been informed and is being supported by specialist officers. No one has been arrested in connection with her death. Police have been seen focusing on Gainsborough House, a high-rise block on the estate. An officer was spotted at the window on the fifth floor. Patrols have also been seen outside. Detective Chief Inspector Neil John said: \"Our thoughts are with the victim's family at this difficult time. \"As our investigation continues, there will be an increased police presence in the area, and a crime scene remains in place. \"We understand this will be very distressing to the local community and anyone who has concerns can speak to local officers.\" Read more from Sky News:Husband describes 'horror' as wife fatally hit by vanPrince Andrew joins King and Queen at Easter service Police are appealing for dashcam footage from anyone who was driving through Ayley Croft between 6.30pm and 7.30pm on Saturday."
    },
    {
        "title": "Ranked: Britain's 10 worst airports for flight delays",
        "description": "Gatwick is the UK's worst airport for flight delays for the second year running, according to new data from the Civil Aviation Authority (CAA).",
        "url": "https://news.sky.com/story/ranked-britains-10-worst-airports-for-flight-delays-13352728",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-south-terminal-gatwick-airport_6754432.jpg?20241122111018",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-20 17:11:00",
        "Headline": "The average delay for flights from major UK airports was 18 minutes and 24 seconds in 2024, down from 20 minutes and 42 seconds in 2023.",
        "Content": "Gatwick is the UK's worst airport for flight delays for the second year running, according to new data from the Civil Aviation Authority (CAA). After suffering from continued air traffic control (ATC) disruptions, departures from the West Sussex airport were delayed by more than 23 minutes on average in 2024. In 2023, its flights were delayed by nearly 27 minutes - so the airport, which is the UK's second busiest, has seen an improvement. A spokesperson said the airport had a \"robust plan\" to improve things further in 2025, including a new method to separate arriving aircraft, and trialling the co-ordination of connecting jet bridges to planes remotely. They said Gatwick remains \"the world's most efficient single-runway airport, with flights departing or arriving every 55 seconds\". Gatwick was badly impacted by ATC staff shortages both in Europe and in its own control tower last year, which a 2024 report by the Royal Aeronautical Society suggested may be in part due to the pandemic. It said staffing was reduced because of a downturn in traffic during lockdowns, and recruiting and training new ATC workers can take up to three years. Julia Lo Bue-Said, chief executive of Advantage Travel Partnership, a network of independent travel agents, said passengers should expect better than \"stuck in terminals\" for hours \"with little information or support\". 10 - Cardiff Airport Cardiff had average delays of 17 minutes and 36 seconds.  9 - Luton Airport Luton recorded average delays of 17 minutes and 42 seconds in 2024. That was an improvement on the year before, with the airport recording delays of nearly 23 minutes in 2023. 8 - Bournemouth Airport Bournemouth also saw an improvement.  Despite recording average delays of 17 minutes and 48 seconds, it saw around a two-and-a-half minute improvement on the year before. 7 - Edinburgh Airport Scotland's busiest airport had average delays of 18 minutes and six seconds in 2024. That was an improvement of nearly three-and-a-half minutes from the 12 months previous. 6 - Exeter Airport Exeter, on the other hand, saw growing delays in 2024. Last year's data showed average delays of 15 minutes and 42 seconds at the airport. In 2024, that figure jumped to 19 minutes. 5 - Teesside International Airport Teesside also recorded longer delays of around two minutes on average.  In 2024, its departing flights were delayed by an average of 19 minutes and six seconds. 4 - Stansted Airport Stansted recorded average delays of 19 minutes and 36 seconds in 2024, a 30-second increase on the previous year. 3 - Manchester Airport The UK's third-busiest airport came third on the list with average delays of 20 minutes last year. In 2023, its delays were longer by nearly two minutes. 2 - Birmingham Airport Birmingham saw delays of 21 minutes and 18 seconds.  Despite moving up the list, it improved its delay time by 12 seconds on the year before. 1 - Gatwick Airport Gatwick Airport recorded delays of 23 minutes and 18 seconds, an improvement of over three minutes and 36 seconds. At the other end of the table... Belfast City airport recorded the best punctuality in the UK for the second year in a row. Its typical delay per flight was less than 12 minutes. The average delay for flights from major UK airports was 18 minutes and 24 seconds in 2024, down from 20 minutes and 42 seconds in 2023. Read more from Sky News:Husband describes 'horror' as wife killed on golf coursePolice appeal over 'senseless' damage to seven statues \"Aviation continues to recover from the pandemic, and operates in an extremely busy, global environment with resilience challenges,\" said a spokesperson for trade body AirportsUK. \"It is therefore positive that the data shows delays continue to come down as everyone in aviation works together to provide the best possible service to passengers.\""
    },
    {
        "title": "Hospital patient had to wait more than 10 days for a bed - as 'unacceptable' crisis laid bare",
        "description": "Around 49,000 A&E patients had to wait 24 hours or more for a hospital bed in England last year, according to NHS figures.",
        "url": "https://news.sky.com/story/hospital-patient-had-to-wait-more-than-10-days-for-a-bed-as-unacceptable-crisis-laid-bare-13352961",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-nhs-corridor-crisis_6800246.jpg?20250115150901",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-20 23:12:00",
        "Headline": "The figures have been described as pointing to a \"crisis in corridor care\", but while the government admits the waits are unacceptable, it says fixing the problem \"will take time\".",
        "Content": "Around 49,000 A&E patients had to wait 24 hours or more for a hospital bed in England last year, according to NHS figures. Data compiled by the Liberal Democrats from freedom of information requests shows the longest wait was 10 days and 13 hours. The party said there were 48,830 \"trolley waits\" of 24 hours or longer in 2024. That is 19.8% higher than 2023 (40,735) and 57.9% higher than 2022 (30,921). A \"trolley wait\" is the time taken for a patient to be transferred to a ward after a decision has been taken to admit them to hospital. The Lib Dems said the real numbers were likely to be far higher because only 54 out of 141 NHS trusts had provided full data. Over the last three years, the percentage of those waiting aged 65 or over remained consistent at around 70%. The Royal College of Nursing said the figures \"only begin to scratch the surface\" of a \"crisis in corridor care\" - and that declining recruitment in nursing was adding to the problem. \n                  Lercanidipine: Patients urged to check blood pressure medication after labelling error\n                 \n                  Disposable vape ban 'may not curb e-cigarette use'\n                 \n                  Low-level drinkers have increased cancer and cardiovascular risk, study finds\n                 General secretary Professor Nicola Ranger said corridor care is \"undignified and unsafe\" and \"must be eradicated\".  Crisis 'will take time' to fix The government has made cutting NHS waiting lists one of its key missions. It insisted progress had been made by deploying RSV, COVID and flu vaccines, ending strikes by healthcare workers and reforming the health service, including scrapping NHS England. A spokesperson for the Department of Health and Social Care said: \"No patient should have to spend 24 hours in A&E waiting to be admitted to a ward. \"We are determined to end the annual winter crisis in urgent care and to cut waiting lists for emergency care, but it will take time.\" They said \"providing more care in the community\" would help ensure fewer patients end up in A&E to begin with. The Lib Dems are campaigning for a new team of \"super-heads\", consisting of experienced NHS bosses, to be deployed within struggling NHS Trusts and bring them up to standard. Read more from Sky News:A&E waits linked to deathsLabour marks NHS 'milestone' Official statistics show the total number of patients waiting over 12 hours for an emergency admission in England decreased from 61,529 in January to 46,766 in March. Some of the fall can be attributed to a post-seasonal peak from winter illnesses. Previous analysis by the Royal College of Emergency Medicine found there were almost 14,000 deaths associated with long A&E stays before admission in 2023."
    },
    {
        "title": "Mission: Impossible? Chancellor heads to the IMF with a very big challenge - and she's not alone",
        "description": "There will be much to chew over at the International Monetary Fund's (IMF) spring meetings this week.",
        "url": "https://news.sky.com/story/mission-impossible-chancellor-heads-to-the-imf-with-a-very-big-challenge-and-shes-not-alone-13352342",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rachel-reeves-politics_6892532.jpg?20250421005639",
        "type": "UK",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-04-20 11:18:00",
        "Headline": "The International Monetary Fund (IMF) may this week appear more akin to the Impossible Mission Force, as finance ministers including Britain's Rachel Reeves jostle for meetings with their US counterparts in an attempt to negotiate their way out of Donald Trump's damaging tariffs.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n There will be much to chew over at the International Monetary Fund's (IMF) spring meetings this week. Central bankers and finance ministers will descend on Washington for its latest bi-annual gathering, a place where politicians and academics converge, all of them trying to make sense of what's going on in the global economy. Everything and nothing has changed since they last met in October - one man continues to dominate the agenda. Six months ago, delegates were wondering if Donald Trump could win the election and what that might mean for tax and tariffs: How far would he push it? Would his policy match his rhetoric? This time round, expect iterations of the same questions: Will the US president risk plunging the world's largest economy into recession? Yes, he put on a bombastic display on his so-called \"Liberation Day\", but will he now row back? Have the markets effectively checked him? Behind the scenes, finance ministers from around the world will be practising their powers of persuasion, each jostling for meetings with their US counterparts to negotiate a reduction in Trump's tariffs. That includes Chancellor Rachel Reeves, who is still holding out hope for a trade deal with the US - although she is not alone in that. Read more:PM and Trump step up trade talksEd Conway on the impact of US tariffs  Are we heading for a recession? The IMF's economists have already made up their minds about Trump's potential for damage. Last week, they warned about the growing risks to financial stability after a period of turbulence in the financial markets, induced by Trump's decision to ratchet up US protectionism to its highest level in a century. By the middle of this week the organisation will publish its World Economic Outlook, in which it will downgrade global growth but stop short of predicting a full-blown recession. Others are less optimistic. Kristalina Georgieva, the IMF's managing director, said last week: \"Our new growth projections will include notable markdowns, but not recession. We will also see markups to the inflation forecasts for some countries.\" She acknowledged the world was undergoing a \"reboot of the global trading system,\" comparing trade tensions to \"a pot that was bubbling for a long time and is now boiling over\". She went on: \"To a large extent, what we see is the result of an erosion of trust - trust in the international system, and trust between countries.\" Don't poke the bear It was a carefully calibrated response. Georgieva did not lay the blame at the US's door and stopped short of calling on the Trump administration to stop or water down its aggressive tariffs policy. That might have been a choice. To the frustration of politicians past and present, the IMF does not usually shy away from making its opinions known. Last year it warned Jeremy Hunt against cutting taxes, and back in 2022 it openly criticised the Liz Truss government's plans, warning tax cuts would fuel inflation and inequality. Taking such a candid approach with Trump invites risks. His administration is already weighing up whether to withdraw from global institutions, including the IMF and the World Bank. The US is the largest shareholder in both, and its departure could be devastating for two organisations that have been pillars of the world economic order since the end of the Second World War. 👉 Follow Trump 100 on your podcast app 👈 Here in the UK, Andrew Bailey has already raised concerns about the prospect of global fragmentation. It is \"very important that we don't have a fragmentation of the world economy,\" the Bank of England's governor said. \"A big part of that is that we have support and engagement in the multilateral institutions, institutions like the IMF, the World Bank, that support the operation of the world economy. That's really important.\" The Trump administration might take a different view when its review of intergovernmental organisations is complete. That is the main tension running through this year's spring meetings. How much the IMF will say and how much we will have to read between the lines, remains to be seen."
    },
    {
        "title": "Prince Andrew joins King and Queen at Easter Sunday church service ",
        "description": "Prince Andrew was among members of the royal family who attended the traditional Easter Sunday service in Windsor.",
        "url": "https://news.sky.com/story/prince-andrew-joins-king-and-queen-at-easter-sunday-church-service-13352284",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-prince-andrew-easter-sunday_6891672.jpg?20250420131212",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-20 08:06:00",
        "Headline": "Other members of the royal family who attended the Easter Sunday service at St George's Chapel included Princess Anne and the Duke and Duchess of Edinburgh.",
        "Content": " Prince Andrew was among members of the royal family who attended the traditional Easter Sunday service in Windsor. It is the second year in a row that the Duke of York has joined the King and Queen at St George's Chapel, appearing to enter the chapel quickly after his eldest brother's arrival. Other members of the royal family, including Princess Anne, the Duke and Duchess of Edinburgh, Princess Eugenie and Princess Beatrice and Andrew's ex-wife Sarah Ferguson, also gathered outside the church. William and Kate did not attend the annual service, deciding instead to spend time with their children, George, Charlotte and Louis, in Norfolk before they go back to school. Crowds wished the King and Queen a Happy Easter as they left the chapel, with two children presenting Camilla with a bunch of flowers, before they were driven away. Andrew was seen glancing at a member of the crowd, who wished him a \"Happy Easter\" before the duke walked off with his ex-wife. The duke has not been pictured at a formal royal family event since last Easter. He missed the royal family's traditional Christmas gathering at Sandringham amid the controversy surrounding his links to an alleged Chinese spy. He disappeared from public life after stepping down from official duties in March 2020, following his explosive TV interview with BBC's Newsnight. The Easter sermon is traditionally led by the Archbishop of Canterbury, but was today led by the Archbishop of York, Stephen Cottrell, from York Minster. Mr Cottrell has temporarily taken over the role after Justin Welby announced he was stepping down in November last year, after an independent review found he \"could and should\" have reported decades-long abuse of men and young boys by his former friend, the barrister John Smyth QC. Mr Cottrell has also apologised for his handling of the case. King's message of 'faith, hope and love' Last year's Easter Sunday service was the King's first major public appearance after he announced his cancer diagnosis. The 76-year-old monarch is still receiving treatment for cancer, and last month, spent a short period of time in hospital after experiencing temporary side effects.  In his Easter message - a tradition he started when he was the Prince of Wales - Charles reflected on the examples of \"great cruelty and great kindness\" that \"daily come before our eyes\" - saying they should remind the world of the importance of the \"virtues of faith, hope and love\". Read more from Sky News:Pope blesses Easter crowdsLondon-born teenager to become a saint He shared the message last week ahead of attending the annual Maundy service at Durham Cathedral, where he presented the Maundy recipients - 76 men and 76 women - with two purses: one red and one white, containing Maundy Money. The ancient tradition traces back to the 13th century and is given to recipients in recognition of outstanding Christian service and work in their local communities."
    },
    {
        "title": "Husband describes 'horror' as wife fatally hit by van at golf course after police chase",
        "description": "A husband has described how he watched in \"helpless horror\" as his wife was fatally hit by a van at a golf course after the vehicle was involved in a police chase.",
        "url": "https://news.sky.com/story/husband-describes-horror-as-wife-fatally-hit-by-van-at-golf-course-after-police-chase-13352523",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-suzanne-cherry_6891844.jpg?20250420170512",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-20 14:28:00",
        "Headline": "Suzanne Cherry, 62, died in hospital four days after she was struck by the vehicle at Aston Wood Golf Club.",
        "Content": "A husband has described how he watched in \"helpless horror\" as his wife was fatally hit by a van at a golf course after the vehicle was involved in a police chase. Suzanne Cherry, 62, died in hospital four days after she was struck on the morning of 11 April, Staffordshire Police said. Two patrol cars had been following the grey Nissan van in Kingstanding, Birmingham, after receiving reports of suspicious activity, according to the Independent Office for Police Conduct (IOPC). They stopped chasing the van when it came off the road and went up an embankment at Aston Wood Golf Club, where it hit Ms Cherry, of Aldridge, Walsall. In a statement released by police, Ms Cherry's husband - who was not named - paid tribute to his \"beautiful wife\" and said her death leaves an \"unfillable void\" in the lives of her family. \"While enjoying what should have been the safest of one of Suzanne's many activities, I watched in helpless horror as the life of my beautiful wife and our future together was snatched away in an instant,\" he said. Ms Cherry's husband said she had \"an amazing and infectious zest for life\", adding: \"Suzanne leaves a legacy and an unfillable void in the lives of her mother Maureen, her three adult children, two step-children and countless others from her work, her sporting activities and social circle. \"Sue was loved, and will be painfully missed by her entire family and friends, we ask that our privacy at this difficult time be respected.\" Read more from Sky News:London-born teenager set to become a saint - here's howThe Who drummer rejoins band days after departure Officers from three different forces have arrested six men in connection with the incident. The IOPC is continuing to investigate the circumstances before the collision. Police are continuing to appeal for witnesses to come forward."
    },
    {
        "title": "100 firefighters tackle blaze at flats in Aldgate, east London",
        "description": "Around 100 firefighters have tackled a blaze at a block of flats in east London.",
        "url": "https://news.sky.com/story/100-firefighters-tackle-blaze-at-flats-in-aldgate-east-london-13352829",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-fire-aldgate_6892297.jpg?20250420200725",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-20 18:59:00",
        "Headline": "London Fire Brigade says 15 fire engines dealt with the blaze as two flats on the sixth and seventh floors of the building were alight.",
        "Content": " Around 100 firefighters have tackled a blaze at a block of flats in east London. Footage showed flames engulfing two different flats in Aldgate, with smoke seen billowing into the air. The properties on the sixth and seventh floors of the building in Leman Street were alight, with firefighters leading 11 people to safety. There are currently no reports of any injuries. London Fire Brigade (LFB) said 15 fire engines dealt with the blaze after being called at 5.43pm. Borough commander Lucy Macleod, who was at the scene, said: \"Crews acted swiftly to bring the fire under control, but will remain on site this evening to damp down remaining hotspots. \"Road closures are currently in place, and there is significant congestion in the surrounding area. We urge the public to avoid the vicinity where possible while we continue to work to make the scene safe.\" The cause of the fire is under investigation, LFB said. A witness told Sky News the fire appeared to now be under control. Read more from Sky News:Husband describes 'horror' as wife killed on golf coursePolice appeal over 'senseless' damage to seven statues The fire brigade used a 64-metre turntable ladder as an observation tower in the area, which is close to London Liverpool Street station and the popular nightlife area Shoreditch. Fire crews were sent to the scene from Whitechapel, Shadwell, Shoreditch, Dowgate, Bethnal Green and surrounding fire stations."
    },
    {
        "title": "Police appeal over 'senseless' damage to seven statues during trans rights rally in London",
        "description": "Police are appealing for information after seven statues - including one of suffragette Millicent Fawcett - were daubed with graffiti during a trans rights rally in London.",
        "url": "https://news.sky.com/story/police-appeal-over-senseless-damage-to-seven-statues-during-trans-rights-rally-in-london-13352521",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-graffiti-trans-rights-protest_6891930.jpg?20250420160334",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-20 14:28:00",
        "Headline": "Graffiti was written on statues of suffragette Millicent Fawcett and South African statesman Jan Christian Smuts during the protest which followed the Supreme Court ruling on the definition of a woman.",
        "Content": " Police are appealing for information after seven statues - including one of suffragette Millicent Fawcett - were daubed with graffiti during a trans rights rally in London. The Metropolitan Police said the criminal damage took place during the protest in Parliament Square, Westminster, on Saturday. Thousands of people had gathered for an \"emergency demonstration\" following the Supreme Court ruling earlier this week on the definition of a woman. The words \"Trans rights are human rights\" were written on a statue of South African statesman Jan Christian Smuts. The Met Police said officers were trawling CCTV footage and no arrests have been made as yet. Chief Superintendent Stuart Bell said: \"Criminal damage and vandalism like this has no place on the streets of London and spoils the area for locals and those visiting. \"While the police support the public's right to protest, criminality like this is senseless and unacceptable. We are pursuing this and will take action against those responsible.\" Mr Bell said there were plans to remove the graffiti \"but this requires specialist equipment and we are confident this will be done shortly\". \"We are keen to speak to those who saw anything on the day and urge anyone with information, pictures or footage to come forward,\" he added. The force has not shared details of which seven statues were defaced. Parliament Square is home to 12 statues of political figures including Winston Churchill, Abraham Lincoln and Mahatma Gandhi. The Met said it was also dealing with a number of complaints from the public about signs and images shared on social media that were reportedly displayed at the protest. The force said while officers were investigating the displayed signs and images, they had so far proved to be from historic events, did not take place in London, or did not constitute a criminal offence. The protest followed a long-awaited judgment delivered on Wednesday, when the UK's highest court ruled the terms \"woman\" and \"sex\" in the Equality Act 2010 \"refer to a biological woman and biological sex\".  It essentially means trans women who hold gender recognition certificates are not women in the eyes of the law. This means transgender women with one of the certificates can be excluded from single-sex spaces if \"proportionate\". The UK government said the unanimous decision by five judges brought \"clarity and confidence\" for women and service providers."
    },
    {
        "title": "Israeli military fires deputy commander as it releases findings of investigation into deadly attack on aid workers",
        "description": "The Israeli military has said its investigation into the killing of aid workers in Gaza has found there were \"several professional failures, breaches of orders, and a failure to fully report the incident\".",
        "url": "https://news.sky.com/story/israeli-military-fires-deputy-commander-as-it-releases-findings-of-investigation-into-deadly-attack-on-aid-workers-13352476",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-gaza-paramedics_6876598.jpg?20250406043742",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-20 13:33:00",
        "Headline": "Fifteen aid workers were shot dead by Israeli troops who opened fire on a convoy of vehicles, including ambulances, in March.",
        "Content": " The Israeli military has said its investigation into the killing of aid workers in Gaza has found there were \"several professional failures, breaches of orders, and a failure to fully report the incident\". A deputy commander will be dismissed for providing an \"inaccurate report\" and a commanding officer will be reprimanded following the military probe, the Israel Defence Forces (IDF) said, adding there was \"no attempt to conceal the event\". Fifteen aid workers were shot dead by Israeli troops who opened fire on a convoy of vehicles, including ambulances, on 23 March. They were then buried in a shallow grave where their bodies were found a week later by officials from the United Nations and the Palestinian Red Crescent.  The probe's findings come after a Sky News investigation earlier this week revealed how the deadly attack unfolded, contradicting Israel's official account of the killings. At first, Israel claimed the medics' vehicles did not have emergency signals on when troops fired their shots, but later backtracked. Mobile phone video which was recovered from one of the medics contradicted Israel's initial account. Footage showed the moment the aid workers were killed, with ambulances and fire insignia clearly visible and red lights flashing as they pulled up to help another ambulance that came under fire earlier.  In a statement on Sunday, an IDF spokesperson said: \"The Commanding Officer of the 14th Brigade will receive a reprimand, which will be recorded in his personal file, for his overall responsibility for the incident, including the procedure of combat and management of the scene afterward. \"The deputy commander of the Golani Reconnaissance Battalion will be dismissed from his position due to his responsibilities as the field commander in this incident and for providing an incomplete and inaccurate report during the debrief.\" The deputy commander is a \"highly respected officer\" who had returned from abroad to serve in reserve duty following Hamas's 7 October attack, the IDF statement said. The statement did not say if anyone would face criminal charges. Nebal Farsakh, a spokesperson for the Red Crescent, told the AFP news agency that the report was \"invalid\" as it \"shifts responsibility to a personal error in the field command when the truth is quite different\".  'Poor night visibility' The Israeli military investigation found that the incident happened in a \"hostile and dangerous combat zone\" and the deputy commander did not initially recognise the vehicles as ambulances \"due to poor night visibility\", according to the IDF spokesperson. \"Only later, after approaching the vehicles and scanning them, was it discovered that these were indeed rescue teams,\" the spokesperson added. The investigation said the Palestinians were killed because of an \"operational misunderstanding\" by Israeli forces, and that a separate incident 15 minutes later, when Israeli soldiers shot at a Palestinian UN vehicle, was a breach of orders. News correspondent What was striking about the briefing by the Israeli military into their investigation of the killing of the Gaza medics, was the Israeli Defence Forces' detailed explanation about the \"state of the mind\" of the Golani Reconnaissance Battalion. It said the troops were in an \"active combat zone\" and had a \"feeling\" Hamas was operating around them. The IDF blamed the attack on a series of operational mistakes. First, in the early hours of the morning, the Israeli military attacked a vehicle they believed belonged to Hamas. Two Palestinians were killed. The Israeli military says a third man, Assad al Nsasrah, was questioned in basic Arabic, but the soldiers misunderstood him and thought he was admitting to being a member of the group. The vehicle was, in fact, an ambulance and the men killed were medics. The military later realised this mistake. Al Nsasrah has been detained by Israel. Officials at the briefing offered no update on his situation. The next incident was the convoy. The IDF said the deputy commander of the battalion opened fire because he failed to see that they were emergency vehicles. The military said that from the position he was in and wearing his night vision goggles, the deputy commander could see the lights of the truck but not its siren and failed to identify it as a fire truck. He opened fire and the rest of the troops followed. The IDF claimed it \"made sense\" that the battalion thought it was attacking Hamas. It also said they started shooting because the men in the vehicles \"stopped and got out\". The IDF said six of the men were members of Hamas. But it provided no evidence of this. It said Hamas members sometimes had \"day jobs\", implying they could be both medical workers and operatives. Again, no evidence was provided. Probe looked at 'three shooting incidents' The IDF said that about an hour before the attack on the convoy, Israeli troops fired at what they \"identified as a Hamas vehicle\" and the forces \"remained on high alert for further potential threats\". In the convoy incident, the IDF said the soldiers \"opened fire on suspects emerging from a fire truck and ambulances very close to the area in which the troops were operating, after perceiving an immediate and tangible threat\". \"Supporting surveillance\" had reported five vehicles approaching rapidly and stopping near the troops, with passengers quickly disembarking, according to the IDF. It said the deputy battalion commander \"assessed the vehicles as employed by Hamas forces, who arrived to assist the first vehicle's passengers\", adding that: \"Under this impression and sense of threat, he ordered to open fire.\"  According to the IDF, six of the 15 killed were \"identified in a retrospective examination as Hamas terrorists\". But the Sky News investigation found no evidence to support this claim, and the Israeli military has not produced any new evidence. The IDF also said there was a third incident about 15 minutes later where \"the troops fired at a Palestinian UN vehicle due to operational errors in breach of regulations\". \"The troops' commander initially reported the event, and additional details emerged later in the examination,\" it added. Bodies were buried in mass grave Eight Red Crescent personnel, six civil defence workers and a UN staff member were killed in the shooting on the convoy by troops carrying out operations in Tel al Sultan, a district of the southern Gaza city of Rafah. Troops then bulldozed over the bodies along with their mangled vehicles, burying them in a mass grave. 'Decision to crush vehicles was wrong' The IDF statement said that at dawn it was decided to \"gather and cover the bodies to prevent further harm and clear the vehicles from the route in preparation for civilian evacuation\". The body removal and vehicle crushing were carried out by field commanders, according to the military. Removing the bodies was reasonable under the circumstances, but the decision to crush the vehicles was wrong, the investigation concluded, and \"in general there was no attempt to conceal the event\". \"The examination found no evidence to support claims of execution or that any of the deceased were bound before or after the shooting,\" the investigation added. The probe also found that \"the [gun]fire in the first two incidents resulted from an operational misunderstanding by the troops, who believed they faced a tangible threat from enemy forces\". It added that the third incident \"involved a breach of orders during a combat setting\". The statement also said Israel's military \"regrets the harm caused to uninvolved civilians\"."
    },
    {
        "title": "DHL suspends some shipments to US amid Trump tariff regime",
        "description": "DHL Express is suspending some shipments to the US as Donald Trump's new tariff regime takes effect.",
        "url": "https://news.sky.com/story/dhl-suspends-some-shipments-to-us-amid-trump-tariff-regime-13352908",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-dhl-delivery_6892521.jpg?20250420233400",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-20 20:09:00",
        "Headline": "New rules came into effect at the beginning of April, meaning shipments worth more than $800 into the US were subject to increased customs checks.",
        "Content": "DHL Express is suspending some shipments to the US as Donald Trump's new tariff regime takes effect. From 21 April, shipments worth more than $800 (£603) to US consumers from \"any origin\" will be temporarily suspended. New rules that came into effect at the start of April made such shipments subject to increased customs checks. \"This change has caused a surge in formal customs clearances, which we are handling around the clock,\" said the parcel delivery service. Shipments going from business to business worth more than $800 aren't affected by the suspension, but DHL warned they may also face delays. Shipments under $800 to either businesses or consumers are not impacted, but one British cycle manufacturer suggested its US customers may need to split orders over $800 into \"smaller shipments\" to avoid the red tape. Read more:The art of doing a deal with TrumpIs there method to Trump's madness? \n                  Mission: Impossible? Chancellor heads to the IMF with a very big challenge - and she's not alone\n                 \n                  Canadians facing 'biggest crisis' of their lifetimes because of Donald Trump tariffs, Mark Carney warns\n                 \n                  Trump tariffs to knock growth but won't cause global recession, says IMF\n                  Trump targeting 'deceptive' practices From May, shipments from China and Hong Kong that are worth less than $800 \"will be subject to all applicable duties\", according to the White House. \"President Trump is targeting deceptive shipping practices by Chinese-based shippers, many of whom hide illicit substances, including synthetic opioids, in low-value packages,\" it said in a statement. Until now, deliveries worth less than $800 didn't incur any duties, which allowed low-cost companies Chinese like Shein and Temu to make inroads in the US. Both have warned their prices will now rise because of the rule changes, starting on 25 April."
    },
    {
        "title": "Mission: Impossible? Chancellor heads to the IMF with a very big challenge - and she's not alone",
        "description": "There will be much to chew over at the International Monetary Fund's (IMF) spring meetings this week.",
        "url": "https://news.sky.com/story/mission-impossible-chancellor-heads-to-the-imf-with-a-very-big-challenge-and-shes-not-alone-13352342",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rachel-reeves-politics_6892532.jpg?20250421005639",
        "type": "World",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-04-20 11:18:00",
        "Headline": "The International Monetary Fund (IMF) may this week appear more akin to the Impossible Mission Force, as finance ministers including Britain's Rachel Reeves jostle for meetings with their US counterparts in an attempt to negotiate their way out of Donald Trump's damaging tariffs.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n There will be much to chew over at the International Monetary Fund's (IMF) spring meetings this week. Central bankers and finance ministers will descend on Washington for its latest bi-annual gathering, a place where politicians and academics converge, all of them trying to make sense of what's going on in the global economy. Everything and nothing has changed since they last met in October - one man continues to dominate the agenda. Six months ago, delegates were wondering if Donald Trump could win the election and what that might mean for tax and tariffs: How far would he push it? Would his policy match his rhetoric? This time round, expect iterations of the same questions: Will the US president risk plunging the world's largest economy into recession? Yes, he put on a bombastic display on his so-called \"Liberation Day\", but will he now row back? Have the markets effectively checked him? Behind the scenes, finance ministers from around the world will be practising their powers of persuasion, each jostling for meetings with their US counterparts to negotiate a reduction in Trump's tariffs. That includes Chancellor Rachel Reeves, who is still holding out hope for a trade deal with the US - although she is not alone in that. Read more:PM and Trump step up trade talksEd Conway on the impact of US tariffs  Are we heading for a recession? The IMF's economists have already made up their minds about Trump's potential for damage. Last week, they warned about the growing risks to financial stability after a period of turbulence in the financial markets, induced by Trump's decision to ratchet up US protectionism to its highest level in a century. By the middle of this week the organisation will publish its World Economic Outlook, in which it will downgrade global growth but stop short of predicting a full-blown recession. Others are less optimistic. Kristalina Georgieva, the IMF's managing director, said last week: \"Our new growth projections will include notable markdowns, but not recession. We will also see markups to the inflation forecasts for some countries.\" She acknowledged the world was undergoing a \"reboot of the global trading system,\" comparing trade tensions to \"a pot that was bubbling for a long time and is now boiling over\". She went on: \"To a large extent, what we see is the result of an erosion of trust - trust in the international system, and trust between countries.\" Don't poke the bear It was a carefully calibrated response. Georgieva did not lay the blame at the US's door and stopped short of calling on the Trump administration to stop or water down its aggressive tariffs policy. That might have been a choice. To the frustration of politicians past and present, the IMF does not usually shy away from making its opinions known. Last year it warned Jeremy Hunt against cutting taxes, and back in 2022 it openly criticised the Liz Truss government's plans, warning tax cuts would fuel inflation and inequality. Taking such a candid approach with Trump invites risks. His administration is already weighing up whether to withdraw from global institutions, including the IMF and the World Bank. The US is the largest shareholder in both, and its departure could be devastating for two organisations that have been pillars of the world economic order since the end of the Second World War. 👉 Follow Trump 100 on your podcast app 👈 Here in the UK, Andrew Bailey has already raised concerns about the prospect of global fragmentation. It is \"very important that we don't have a fragmentation of the world economy,\" the Bank of England's governor said. \"A big part of that is that we have support and engagement in the multilateral institutions, institutions like the IMF, the World Bank, that support the operation of the world economy. That's really important.\" The Trump administration might take a different view when its review of intergovernmental organisations is complete. That is the main tension running through this year's spring meetings. How much the IMF will say and how much we will have to read between the lines, remains to be seen."
    },
    {
        "title": "Trump hopes Russia and Ukraine 'will make deal this week' - as Putin's 'Easter truce' expires",
        "description": "US President Donald Trump has said he hopes Russia and Ukraine \"will make a deal this week\" as Vladimir Putin's \"Easter truce\" expired, with the two countries blaming each other for breaking it.",
        "url": "https://news.sky.com/story/trump-hopes-russia-and-ukraine-make-deal-this-week-as-putins-easter-truce-expires-13352928",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-russia-ukraine_6892514.jpg?20250420232053",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-20 20:26:00",
        "Headline": "Ukrainian President Volodymyr Zelenskyy says the Russian army had \"violated Putin's ceasefire more than 2,000 times\" and accused him of being only interested in favourable PR coverage.",
        "Content": "US President Donald Trump has said he hopes Russia and Ukraine \"will make a deal this week\" as Vladimir Putin's \"Easter truce\" expired, with the two countries blaming each other for breaking it. The Russian leader said he had ordered his forces to stop all military activity along the frontline for 30 hours from 6pm on Saturday (4pm UK time) until midnight on Sunday (10pm UK time). But on Sunday evening, Ukrainian President Volodymyr Zelenskyy said the Russian army had \"violated Putin's ceasefire more than 2,000 times\" during the day. Mr Trump wrote on his Truth Social platform that \"hopefully Russia and Ukraine will make a deal this week\" and both will then \"start to do big business\" with the US. Latest updates on Russia's war in Ukraine  Mr Zelenskyy accused Russia of \"failing\" to \"uphold its own promise of ceasefire\" and wrote on X: \"Either Putin does not have full control over his army, or the situation proves that in Russia, they have no intention of making a genuine move toward ending the war, and are only interested in favourable PR coverage.\" Mr Zelenskyy proposed that Russia \"cease any strikes using long-range drones and missiles on civilian infrastructure for a period of at least 30 days, with the possibility of extension\". \n                  Why Putin has suddenly offered an 'Easter truce' in Ukraine - and the interesting way it's being presented\n                 \n                  Russian attacks on Ukraine continue despite 'Easter truce', Zelenskyy says\n                 \n                  Trump threatens to 'take a pass' on Ukraine peace talks\n                 And he added that if Russia does not agree to such a step \"it will be proof that it intends to continue doing only those things which destroy human lives and prolong the war\". He insisted that the Ukrainian army was \"acting - and will continue to act - in a fully symmetrical manner\" and this Easter has \"clearly demonstrated that the only source of this war, and the reason it drags on, is Russia\". \"We are ready to move toward peace and a full, unconditional, and honest ceasefire that could last for at least 30 days - but there has been no response from Russia on that so far.\"  What has Moscow said? Russia's defence ministry said Ukraine had broken the ceasefire more than 1,000 times, damaging infrastructure and causing civilian deaths. According to the ministry, Ukrainian forces had shot at Russian positions 444 times while there had been more than 900 Ukrainian drone attacks, including on Crimea and the Russian border areas of the Bryansk, Kursk and Belgorod regions. \"As a result, there are deaths and injuries among the civilian population, as well as damage to civilian facilities,\" the ministry said. The Kremlin said there was no order for the ceasefire to be extended. Read more:Why Putin suddenly offered an 'Easter truce'Trump 'starting to look genuinely manipulated by Putin'  Mr Trump and his secretary of state Marco Rubio warned on Friday that the US will walk away from efforts to broker a peace deal unless there are clear signs of progress soon. The US president said negotiations between Ukraine and Russia were \"coming to a head\" and he insisted that neither side is \"playing\" him in his push to end the grinding three-year war. Last month, Ukraine accepted Mr Trump's proposal for a 30-day truce. But Mr Putin refused to back a full 30-day ceasefire, saying crucial issues of verification had not been sorted out. He said he would agree not to target Ukraine's energy infrastructure. However, both sides have accused each other of breaking the moratorium on attacks on energy targets and at sea."
    },
    {
        "title": "Pope blesses Easter crowds from popemobile in first significant appearance since illness",
        "description": "Pope Francis has made his first significant public appearance since he left hospital, greeting cheering crowds from the popemobile.",
        "url": "https://news.sky.com/story/pope-delivers-easter-blessing-in-first-significant-public-appearance-since-illness-13352290",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pope-franics-easter-sunday_6891623.jpg?20250420114937",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-20 08:19:00",
        "Headline": "It is the 88-year-old pontiff's first significant public appearance since he left hospital, where he was treated for double pneumonia.",
        "Content": " Pope Francis has made his first significant public appearance since he left hospital, greeting cheering crowds from the popemobile. He blessed the thousands of faithful gathered to celebrate Easter Sunday at the Vatican. The 88-year-old pontiff appeared frail as he was wheeled out onto the balcony over the entrance of St Peter's Basilica, before being driven in the popemobile through the crowds of faithful gathered in St Peter's Square. He was met with cheers, applause and chants of \"Viva il Papa\" - meaning long live the Pope. It is his longest stint out in public since he spent five weeks in hospital being treated for double pneumonia. \"Brothers and sisters, Happy Easter!\" Pope Francis managed to say, before an aide read the rest of his annual Urbi et Orbi blessing and speech, which called for an end to the conflicts in Ukraine and Gaza. \"May the risen Christ grant Ukraine, devastated by war, his Easter gift of peace, and encourage all parties involved to pursue efforts aimed at achieving a just and lasting peace,\" the message said. \"In this Jubilee year, may Easter also be a fitting occasion for the liberation of prisoners of war and political prisoners!\" Crowds then stretched out their hands and filmed as the Pope was driven past in the special vehicle. The popemobile stopped a number of times in order for the pontiff to bless babies and small children, appearing to also give them gifts. Before the public appearance, the Pope \"exchanged good wishes\" with US vice president JD Vance during a private audience at the Vatican. Mr Vance, who is in Rome with his family, also had a \"quick and private\" meeting with the Pope on Saturday, sources told Sky News. It came after he met the Vatican secretary of state, Cardinal Pietro Parolin, and foreign minister, Archbishop Paul Gallagher. On Sunday morning, in another unscheduled move, the Pope decided to formally receive the US vice president ahead of his Urbi et Orbi blessing. The Vatican said the encounter lasted just a few minutes. The meeting came amid tensions between the Vatican and the Trump administration over the US president's crackdown on migrants and cuts to international aid. The Pope has only appeared in public a handful of times since returning to the Vatican on 23 March. Leading up to Easter, he skipped the solemn services of Good Friday and Holy Saturday. Before Sunday, his biggest outing had been a visit to Rome's central prison to spend Holy Thursday with inmates. He also missed the Easter Sunday open-air mass, which was led instead by Cardinal Angelo Comastri, the retired archpriest of St Peter's Basilica. Read more from Sky News:What is the Catholic jubilee?London-born teenager about to become a saintFour mistakes to avoid when running London Marathon Despite cutting down his workload, the Pope was able to meet King Charles and Queen Camilla during the British monarch's four-day state visit to Italy at the beginning of April. Charles and Camilla's 20-minute meeting with the Pope included an exchange of gifts and the pontiff wishing them a happy 20th wedding anniversary."
    },
    {
        "title": "Gaza father grieves for children killed in Israeli airstrike on church building",
        "description": "As people take a break for the Easter holiday, in the Gaza Strip there is no respite from the 18-month-long war with Israel.",
        "url": "https://news.sky.com/story/father-grieves-for-children-killed-in-israeli-airstrike-on-church-building-in-gaza-13352247",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ramez-al-souri-gaza_6891502.jpg?20250420060536",
        "type": "World",
        "Author": "Nicole Johnston",
        "Date Published": "2025-04-20 04:37:00",
        "Headline": "More than a year after his children were killed in an Israeli strike on a church building, a father is calling on the world to \"stand by\" the people of Gaza as they face bombardment. \"This Easter is no different than the last,\" he says.\"We are tending to our wounds.",
        "Content": "\n          News correspondent\n              @nicole_reporter\n  As people take a break for the Easter holiday, in the Gaza Strip there is no respite from the 18-month-long war with Israel. Gaza has a tiny Christian community of Greek Orthodox Christians, Catholics, Evangelicals, and Anglicans. For Ramez al-Souri, the pain is unimaginable. His three children were killed by an Israeli airstrike, on an annex of Gaza's Saint Porphyrius Greek Orthodox Church. Palestinian health officials say the attack on 19 October 2023 killed 18 people inside the building. \"My home has changed completely because there are no smiles, no laughter, no joy,\" Mr Al-Souri says. \"I lost my flower - my daughter Julie - and my boys Suhail and Majd. They were salt of the Earth.\" Shrouded in darkness Julia was 12 years old, Suhial 14 and Majd 11. It is a loss that never leaves Mr Al-Souri, and one shared by almost every family in Gaza. Walking through the cemetery, he gently places a small bouquet of flowers on his children's grave. Gunfire crackles in the distance. The neighbourhood is full of rubble and destruction. \"This Easter is no different than the last,\" Mr Al-Souri says. \"We are tending to our wounds. \"We continue to hope for an end to this war and suffering, for the darkness over Gaza to finally lift.\" Read more:How two hours of terror unfolded  No end in sight But there is no sign of light for more than two million people trapped inside Gaza. Israel's Prime Minister Benjamin Netanyahu gave a special address to the nation on Saturday night and vowed to continue the war until Hamas is destroyed. Mr Netanyahu said Israel has \"no choice\" but to keep fighting \"for our very own existence until victory.\" Israel is calling for Hamas to disarm and to release 10 Israeli hostages in exchange for a 45-day ceasefire. There are 59 hostages still inside Gaza. It is believed 24 of them are still alive. Hamas has rejected the proposal. It argues Israel reneged on the first ceasefire deal by refusing to move to phase two of the agreement and withdraw Israeli troops from the Gaza Strip.  A disaster on the ground Since the ceasefire collapsed on 2 March, Israel's bombing campaign has intensified. Palestinian health officials say more than 1,700 people have been killed in the last month, and more than 90 people in the last 24 hours. The humanitarian situation is a disaster. At the few remaining soup kitchens in Gaza, children scramble for food. They carry pots for their family and push forward trying to secure a bowl of lentils or rice. Israel has blocked aid trucks from entering for the last seven weeks. It says it is to put pressure on Hamas. But the pressure is being felt by civilians, creating what aid groups say is the most severe crisis Gaza has ever faced. Israel has cut off vital supplies of food and medicine, but insists it is not using starvation as a weapon of war. It rejects any suggestion Gaza does not have enough food and accuses Hamas of stealing it.  'We're craving food' Seven members of the Al-Asheh family are displaced and live in a tent in Deir al-Balah. Twelve-year-old Ahmed says before the war he didn't like lentils, now it is all he eats. \"Before the war, we used to have fruits, chicken, vegetables, everything was available. We were never hungry,\" Ahmed explains. \"Now, we're craving food, chicken - anything. The only thing we can eat now is what the soup kitchen provides.\" It is clear that ceasefire talks are going nowhere, and Israel has tightened its blockade and deepened its war. More than 400,000 Palestinians have recently been displaced yet again as Israel has expanded a buffer zone inside Gaza, levelling houses to create a \"security zone\". For Palestinians, this constitutes a \"land grab\".  'A symbol of the world's conscience' Israel has also established another military corridor in southern Gaza, calling it Morag corridor. The corridor is north of Rafah and has cut Gaza's second-largest city off from the rest of the territory. Israel says it has now taken control of 30% of the Gaza Strip and insists it will not withdraw. For Palestinians, the future has never looked more bleak. They are blockaded, displaced, struggling for food, water, basic sanitation and in constant search of safety. \"Gaza is calling on the world to stand by it,\" Mr Al-Souri says. \"Gaza stands as a symbol of the world's moral conscience.\""
    },
    {
        "title": "Vaibhav Suryavanshi, 14, makes history as youngest ever player in cricket's Indian Premier League- hits first ball six",
        "description": "Fourteen-year-old Vaibhav Suryavanshi has made history by becoming the youngest player to play in the Indian Premier League (IPL)  - and promptly hit the first ball he faced for a six.",
        "url": "https://news.sky.com/story/vaibhav-suryavanshi-14-makes-history-as-youngest-ever-player-in-crickets-indian-premier-league-hits-first-ball-six-13352258",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-suryavanshi-indian_6891517.jpg?20250420074302",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-20 06:25:00",
        "Headline": "Vaibhav Suryavanshi, 14, has made history as the youngest player to play in the Indian Premier League after being called in to replace Rajasthan's injured skipper Sanju Samson.",
        "Content": "Fourteen-year-old Vaibhav Suryavanshi has made history by becoming the youngest player to play in the Indian Premier League (IPL)  - and promptly hit the first ball he faced for a six. Opening the batting Suryavanshi, who only turned 14 last month, came on as an impact substitute for Rajasthan Royals and scored 34 runs off 20 balls, announcing himself on the big stage by hitting the first ball over extra cover for a maximum. Suryavanshi hit three sixes and two fours during his 20-ball cameo before he was stumped by Lucknow Super Giants' captain Rishabh Pant. The teenager was replacing Rajasthan's injured skipper Sanju Samson, who suffered an injury to his side against Delhi Capitals in their previous game. Read more from Sky News:Carlo Acutis: How do you become a saintMacron to beat Trump to UK state visit - report Suryavanshi became the youngest player bought in an IPL auction when he was signed by Rajasthan Royals for £105,000. His selection came just weeks after he smashed a 58-ball hundred for India U19s against Australia U19s in an unofficial test in Chennai. \n                  Stokes-backed travel platform Unravel takes off with £5m funding\n                 \n                  Former Australian Test cricketer Stuart MacGill found guilty of taking part in the supply of cocaine\n                 \n                  Leaving Afghanistan, teen cricketer had to burn medals - now she wants right to play for country\n                 Suryavanshi, who was born in 2011, holds another record as the first IPL cricketer born after the tournament began in 2008. The previous youngest IPL debutant was Prayas Rai Burman, who featured in 2019 aged 16 and 154 days for Royal Challengers Bengaluru. Meanwhile, Afghanistan's Mujeeb ur Rahman is the youngest international cricketer in the IPL, debuting at 17 in 2018 for Punjab Kings."
    },
    {
        "title": "Oldest serving US astronaut returns from space on 70th birthday",
        "description": "America's oldest serving astronaut has touched down on Earth on his 70th birthday.&#160;",
        "url": "https://news.sky.com/story/touch-down-iss-crew-returns-after-seven-months-in-space-13352239",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-astronaut-kazakhstan_6891545.jpg?20250420090223",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-20 02:37:00",
        "Headline": "A Soyuz MS-26 spacecraft carrying American Donald Pettit and Russians Alexey Ovchinin and Ivan Wagner landed in Kazakhstan on Sunday.",
        "Content": " America's oldest serving astronaut has touched down on Earth on his 70th birthday.  NASA astronaut Donald Pettit and two Russian cosmonauts had been on a seven-month mission to the International Space Station (ISS). The Soyuz MS-26 spacecraft carrying Mr Pettit and Russians Alexey Ovchinin and Ivan Vagner landed in Kazakhstan on Sunday. \"Its deorbiting and descent to Earth were normal,\" Russia's Roscosmos space agency said. The crew's seven-month science mission started on 11 September 2024. They orbited the Earth 3,520 times over 220 days in space. Read more from Sky News:Robots race half-marathon against humans for first timeHow Japan could shape the future of the NHSWarning over exploitation of 'influencer' children Mr Pettit had been conducting research to enhance in-orbit metal 3D printing capabilities, advance water sanitisation technologies, explore plant growth under varying water conditions and investigate fire behaviour in microgravity, according to NASA. It was the fourth time in space for Mr Pettit and Mr Ovchinin, while it was Mr Vagner's second spaceflight."
    },
    {
        "title": "DHL suspends some shipments to US amid Trump tariff regime",
        "description": "DHL Express is suspending some shipments to the US as Donald Trump's new tariff regime takes effect.",
        "url": "https://news.sky.com/story/dhl-suspends-some-shipments-to-us-amid-trump-tariff-regime-13352908",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-dhl-delivery_6892521.jpg?20250420233400",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-20 20:09:00",
        "Headline": "New rules came into effect at the beginning of April, meaning shipments worth more than $800 into the US were subject to increased customs checks.",
        "Content": "DHL Express is suspending some shipments to the US as Donald Trump's new tariff regime takes effect. From 21 April, shipments worth more than $800 (£603) to US consumers from \"any origin\" will be temporarily suspended. New rules that came into effect at the start of April made such shipments subject to increased customs checks. \"This change has caused a surge in formal customs clearances, which we are handling around the clock,\" said the parcel delivery service. Shipments going from business to business worth more than $800 aren't affected by the suspension, but DHL warned they may also face delays. Shipments under $800 to either businesses or consumers are not impacted, but one British cycle manufacturer suggested its US customers may need to split orders over $800 into \"smaller shipments\" to avoid the red tape. Read more:The art of doing a deal with TrumpIs there method to Trump's madness? \n                  Mission: Impossible? Chancellor heads to the IMF with a very big challenge - and she's not alone\n                 \n                  Canadians facing 'biggest crisis' of their lifetimes because of Donald Trump tariffs, Mark Carney warns\n                 \n                  Trump tariffs to knock growth but won't cause global recession, says IMF\n                  Trump targeting 'deceptive' practices From May, shipments from China and Hong Kong that are worth less than $800 \"will be subject to all applicable duties\", according to the White House. \"President Trump is targeting deceptive shipping practices by Chinese-based shippers, many of whom hide illicit substances, including synthetic opioids, in low-value packages,\" it said in a statement. Until now, deliveries worth less than $800 didn't incur any duties, which allowed low-cost companies Chinese like Shein and Temu to make inroads in the US. Both have warned their prices will now rise because of the rule changes, starting on 25 April."
    },
    {
        "title": "Anti-Trump protests sweep America for the second time in weeks",
        "description": "Anti-Trump protests took place across America on Saturday, with demonstrators decrying the administration's immigration crackdown and mass firings at government agencies.&#160;",
        "url": "https://news.sky.com/story/anti-trump-protests-sweep-america-for-the-second-time-in-weeks-13352268",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-donald-trump_6891529.jpg?20250420084453",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-20 07:29:00",
        "Headline": "At marches across America, people carried banners proclaiming \"Trump fascist regime must go now!\" and \"No fear, no hate, no ICE in our state\", alongside upside-down flags to signal distress.",
        "Content": "Anti-Trump protests took place across America on Saturday, with demonstrators decrying the administration's immigration crackdown and mass firings at government agencies.  Events ranged from small local marches to a rally in front of the White House and a demonstration at a Massachusetts commemoration of the start of the Revolutionary War 250 years ago. Thomas Bassford, 80, was at the battle reenactment with his two grandsons, as well as his partner and daughter. He said: \"This is a very perilous time in America for liberty. I wanted the boys to learn about the origins of this country and that sometimes we have to fight for freedom.\" At events across the country, people carried banners with slogans including \"Trump fascist regime must go now!\", \"No fear, no hate, no ICE in our state,\" and \"Fight fiercely, Harvard, fight,\" referencing the university's recent refusal to hand over much of its control to the government. Some signs name-checked Kilmar Abrego Garcia, a Salvadorian citizen living in Maryland, who the Justice Department admits was mistakenly deported to his home country. Read more: Donald Trump's deportations explained People waved US flags, some of them held upside down to signal distress. In San Francisco, hundreds of people spelt out \"Impeach & Remove\" on a beach, also with an inverted US flag. People walked through downtown Anchorage in Alaska with handmade signs listing reasons why they were demonstrating, including one that read: \"No sign is BIG enough to list ALL of the reasons I'm here!\" Protests also took place outside Tesla car dealerships against the role Elon Musk has played in downsizing the federal government as de facto head of the Department of Government Efficiency (DOGE). The protests come just two weeks after similar nationwide demonstrations. 👉 Follow Trump 100 on your podcast app 👈 Organisers are opposing what they call Mr Trump's civil rights violations and constitutional violations, including efforts to deport scores of immigrants and to scale back the federal government by firing thousands of government workers and effectively shuttering entire agencies. The Trump administration, among other things, has moved to shutter Social Security Administration field offices, cut funding for government health programs and scale back protections for transgender people."
    },
    {
        "title": "Mission: Impossible? Chancellor heads to the IMF with a very big challenge - and she's not alone",
        "description": "There will be much to chew over at the International Monetary Fund's (IMF) spring meetings this week.",
        "url": "https://news.sky.com/story/mission-impossible-chancellor-heads-to-the-imf-with-a-very-big-challenge-and-shes-not-alone-13352342",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rachel-reeves-politics_6892532.jpg?20250421005639",
        "type": "US",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-04-20 11:18:00",
        "Headline": "The International Monetary Fund (IMF) may this week appear more akin to the Impossible Mission Force, as finance ministers including Britain's Rachel Reeves jostle for meetings with their US counterparts in an attempt to negotiate their way out of Donald Trump's damaging tariffs.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n There will be much to chew over at the International Monetary Fund's (IMF) spring meetings this week. Central bankers and finance ministers will descend on Washington for its latest bi-annual gathering, a place where politicians and academics converge, all of them trying to make sense of what's going on in the global economy. Everything and nothing has changed since they last met in October - one man continues to dominate the agenda. Six months ago, delegates were wondering if Donald Trump could win the election and what that might mean for tax and tariffs: How far would he push it? Would his policy match his rhetoric? This time round, expect iterations of the same questions: Will the US president risk plunging the world's largest economy into recession? Yes, he put on a bombastic display on his so-called \"Liberation Day\", but will he now row back? Have the markets effectively checked him? Behind the scenes, finance ministers from around the world will be practising their powers of persuasion, each jostling for meetings with their US counterparts to negotiate a reduction in Trump's tariffs. That includes Chancellor Rachel Reeves, who is still holding out hope for a trade deal with the US - although she is not alone in that. Read more:PM and Trump step up trade talksEd Conway on the impact of US tariffs  Are we heading for a recession? The IMF's economists have already made up their minds about Trump's potential for damage. Last week, they warned about the growing risks to financial stability after a period of turbulence in the financial markets, induced by Trump's decision to ratchet up US protectionism to its highest level in a century. By the middle of this week the organisation will publish its World Economic Outlook, in which it will downgrade global growth but stop short of predicting a full-blown recession. Others are less optimistic. Kristalina Georgieva, the IMF's managing director, said last week: \"Our new growth projections will include notable markdowns, but not recession. We will also see markups to the inflation forecasts for some countries.\" She acknowledged the world was undergoing a \"reboot of the global trading system,\" comparing trade tensions to \"a pot that was bubbling for a long time and is now boiling over\". She went on: \"To a large extent, what we see is the result of an erosion of trust - trust in the international system, and trust between countries.\" Don't poke the bear It was a carefully calibrated response. Georgieva did not lay the blame at the US's door and stopped short of calling on the Trump administration to stop or water down its aggressive tariffs policy. That might have been a choice. To the frustration of politicians past and present, the IMF does not usually shy away from making its opinions known. Last year it warned Jeremy Hunt against cutting taxes, and back in 2022 it openly criticised the Liz Truss government's plans, warning tax cuts would fuel inflation and inequality. Taking such a candid approach with Trump invites risks. His administration is already weighing up whether to withdraw from global institutions, including the IMF and the World Bank. The US is the largest shareholder in both, and its departure could be devastating for two organisations that have been pillars of the world economic order since the end of the Second World War. 👉 Follow Trump 100 on your podcast app 👈 Here in the UK, Andrew Bailey has already raised concerns about the prospect of global fragmentation. It is \"very important that we don't have a fragmentation of the world economy,\" the Bank of England's governor said. \"A big part of that is that we have support and engagement in the multilateral institutions, institutions like the IMF, the World Bank, that support the operation of the world economy. That's really important.\" The Trump administration might take a different view when its review of intergovernmental organisations is complete. That is the main tension running through this year's spring meetings. How much the IMF will say and how much we will have to read between the lines, remains to be seen."
    },
    {
        "title": "Mission: Impossible? Chancellor heads to the IMF with a very big challenge - and she's not alone",
        "description": "There will be much to chew over at the International Monetary Fund's (IMF) spring meetings this week.",
        "url": "https://news.sky.com/story/mission-impossible-chancellor-heads-to-the-imf-with-a-very-big-challenge-and-shes-not-alone-13352342",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rachel-reeves-politics_6892532.jpg?20250421005639",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-04-20 11:18:00",
        "Headline": "The International Monetary Fund (IMF) may this week appear more akin to the Impossible Mission Force, as finance ministers including Britain's Rachel Reeves jostle for meetings with their US counterparts in an attempt to negotiate their way out of Donald Trump's damaging tariffs.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n There will be much to chew over at the International Monetary Fund's (IMF) spring meetings this week. Central bankers and finance ministers will descend on Washington for its latest bi-annual gathering, a place where politicians and academics converge, all of them trying to make sense of what's going on in the global economy. Everything and nothing has changed since they last met in October - one man continues to dominate the agenda. Six months ago, delegates were wondering if Donald Trump could win the election and what that might mean for tax and tariffs: How far would he push it? Would his policy match his rhetoric? This time round, expect iterations of the same questions: Will the US president risk plunging the world's largest economy into recession? Yes, he put on a bombastic display on his so-called \"Liberation Day\", but will he now row back? Have the markets effectively checked him? Behind the scenes, finance ministers from around the world will be practising their powers of persuasion, each jostling for meetings with their US counterparts to negotiate a reduction in Trump's tariffs. That includes Chancellor Rachel Reeves, who is still holding out hope for a trade deal with the US - although she is not alone in that. Read more:PM and Trump step up trade talksEd Conway on the impact of US tariffs  Are we heading for a recession? The IMF's economists have already made up their minds about Trump's potential for damage. Last week, they warned about the growing risks to financial stability after a period of turbulence in the financial markets, induced by Trump's decision to ratchet up US protectionism to its highest level in a century. By the middle of this week the organisation will publish its World Economic Outlook, in which it will downgrade global growth but stop short of predicting a full-blown recession. Others are less optimistic. Kristalina Georgieva, the IMF's managing director, said last week: \"Our new growth projections will include notable markdowns, but not recession. We will also see markups to the inflation forecasts for some countries.\" She acknowledged the world was undergoing a \"reboot of the global trading system,\" comparing trade tensions to \"a pot that was bubbling for a long time and is now boiling over\". She went on: \"To a large extent, what we see is the result of an erosion of trust - trust in the international system, and trust between countries.\" Don't poke the bear It was a carefully calibrated response. Georgieva did not lay the blame at the US's door and stopped short of calling on the Trump administration to stop or water down its aggressive tariffs policy. That might have been a choice. To the frustration of politicians past and present, the IMF does not usually shy away from making its opinions known. Last year it warned Jeremy Hunt against cutting taxes, and back in 2022 it openly criticised the Liz Truss government's plans, warning tax cuts would fuel inflation and inequality. Taking such a candid approach with Trump invites risks. His administration is already weighing up whether to withdraw from global institutions, including the IMF and the World Bank. The US is the largest shareholder in both, and its departure could be devastating for two organisations that have been pillars of the world economic order since the end of the Second World War. 👉 Follow Trump 100 on your podcast app 👈 Here in the UK, Andrew Bailey has already raised concerns about the prospect of global fragmentation. It is \"very important that we don't have a fragmentation of the world economy,\" the Bank of England's governor said. \"A big part of that is that we have support and engagement in the multilateral institutions, institutions like the IMF, the World Bank, that support the operation of the world economy. That's really important.\" The Trump administration might take a different view when its review of intergovernmental organisations is complete. That is the main tension running through this year's spring meetings. How much the IMF will say and how much we will have to read between the lines, remains to be seen."
    },
    {
        "title": "DHL suspends some shipments to US amid Trump tariff regime",
        "description": "DHL Express is suspending some shipments to the US as Donald Trump's new tariff regime takes effect.",
        "url": "https://news.sky.com/story/dhl-suspends-some-shipments-to-us-amid-trump-tariff-regime-13352908",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-dhl-delivery_6892521.jpg?20250420233400",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-20 20:09:00",
        "Headline": "New rules came into effect at the beginning of April, meaning shipments worth more than $800 into the US were subject to increased customs checks.",
        "Content": "DHL Express is suspending some shipments to the US as Donald Trump's new tariff regime takes effect. From 21 April, shipments worth more than $800 (£603) to US consumers from \"any origin\" will be temporarily suspended. New rules that came into effect at the start of April made such shipments subject to increased customs checks. \"This change has caused a surge in formal customs clearances, which we are handling around the clock,\" said the parcel delivery service. Shipments going from business to business worth more than $800 aren't affected by the suspension, but DHL warned they may also face delays. Shipments under $800 to either businesses or consumers are not impacted, but one British cycle manufacturer suggested its US customers may need to split orders over $800 into \"smaller shipments\" to avoid the red tape. Read more:The art of doing a deal with TrumpIs there method to Trump's madness? \n                  Mission: Impossible? Chancellor heads to the IMF with a very big challenge - and she's not alone\n                 \n                  Canadians facing 'biggest crisis' of their lifetimes because of Donald Trump tariffs, Mark Carney warns\n                 \n                  Trump tariffs to knock growth but won't cause global recession, says IMF\n                  Trump targeting 'deceptive' practices From May, shipments from China and Hong Kong that are worth less than $800 \"will be subject to all applicable duties\", according to the White House. \"President Trump is targeting deceptive shipping practices by Chinese-based shippers, many of whom hide illicit substances, including synthetic opioids, in low-value packages,\" it said in a statement. Until now, deliveries worth less than $800 didn't incur any duties, which allowed low-cost companies Chinese like Shein and Temu to make inroads in the US. Both have warned their prices will now rise because of the rule changes, starting on 25 April."
    },
    {
        "title": "Landlords of major discount retailer brace for swingeing rent cuts",
        "description": "The new owner of The Original Factory Shop (TOFS), one of Britain's leading independent discount retailers, is preparing to unveil a package of savage rent cuts for its store landlords.",
        "url": "https://news.sky.com/story/landlords-of-major-discount-retailer-brace-for-swingeing-rent-cuts-13352820",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-the-original-factory-shop_6860276.jpg?20250318101950",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-20 18:50:00",
        "Headline": "The Original Factory Shop's new owner, Modella Capital, is preparing to launch a company voluntary arrangement aimed at imposing steep haircuts on store-owners within days, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The new owner of The Original Factory Shop (TOFS), one of Britain's leading independent discount retailers, is preparing to unveil a package of savage rent cuts for its store landlords. Sky News understands that Modella Capital - which recently agreed to buy WH Smith's high street arm - is finalising plans for a company voluntary arrangement (CVA) at TOFS. City sources said the CVA - which requires court approval - could be unveiled within days. Property sources cited industry rumours that significant store closures and job losses could form part of TOFS' plans, while demands for two-year rent-free periods at some shops are said to also feature. A spokesman for Modella declined to comment. Modella, which also owns Hobbycraft, bought TOFS from its previous owner, Duke Street Capital, just two months ago. Almost immediately, it engaged restructuring experts at Interpath to work on the plans. \n                  Mission: Impossible? Chancellor heads to the IMF with a very big challenge - and she's not alone\n                 \n                  DHL suspends some shipments to US amid Trump tariff regime\n                 \n                  The British economy has lost out - and sucking up to Trump will only get Starmer so far\n                 Sources have speculated that dozens of TOFS stores could close under a CVA, while a major distribution centre is also thought to feature in the proposals. Any so-called 'landlord-led' CVA which triggered store closures would inevitably lead to job losses among TOFS' workforce, which was said to number about 1,800 people at the time of the takeover. TOFS, which sells beauty brands such as L'Oreal, the sportswear label Adidas and DIY tools made by Black & Decker, trades from about 180 stores. The chain, which was founded in 1969, was bought by the private equity firm Duke Street in 2007. Duke Street had tried to sell the business before, having supported it through the COVID-19 pandemic with a cash injection of more than £10m."
    },
    {
        "title": "Mission: Impossible? Chancellor heads to the IMF with a very big challenge - and she's not alone",
        "description": "There will be much to chew over at the International Monetary Fund's (IMF) spring meetings this week.",
        "url": "https://news.sky.com/story/mission-impossible-chancellor-heads-to-the-imf-with-a-very-big-challenge-and-shes-not-alone-13352342",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rachel-reeves-politics_6892532.jpg?20250421005639",
        "type": "Politics",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-04-20 11:18:00",
        "Headline": "The International Monetary Fund (IMF) may this week appear more akin to the Impossible Mission Force, as finance ministers including Britain's Rachel Reeves jostle for meetings with their US counterparts in an attempt to negotiate their way out of Donald Trump's damaging tariffs.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n There will be much to chew over at the International Monetary Fund's (IMF) spring meetings this week. Central bankers and finance ministers will descend on Washington for its latest bi-annual gathering, a place where politicians and academics converge, all of them trying to make sense of what's going on in the global economy. Everything and nothing has changed since they last met in October - one man continues to dominate the agenda. Six months ago, delegates were wondering if Donald Trump could win the election and what that might mean for tax and tariffs: How far would he push it? Would his policy match his rhetoric? This time round, expect iterations of the same questions: Will the US president risk plunging the world's largest economy into recession? Yes, he put on a bombastic display on his so-called \"Liberation Day\", but will he now row back? Have the markets effectively checked him? Behind the scenes, finance ministers from around the world will be practising their powers of persuasion, each jostling for meetings with their US counterparts to negotiate a reduction in Trump's tariffs. That includes Chancellor Rachel Reeves, who is still holding out hope for a trade deal with the US - although she is not alone in that. Read more:PM and Trump step up trade talksEd Conway on the impact of US tariffs  Are we heading for a recession? The IMF's economists have already made up their minds about Trump's potential for damage. Last week, they warned about the growing risks to financial stability after a period of turbulence in the financial markets, induced by Trump's decision to ratchet up US protectionism to its highest level in a century. By the middle of this week the organisation will publish its World Economic Outlook, in which it will downgrade global growth but stop short of predicting a full-blown recession. Others are less optimistic. Kristalina Georgieva, the IMF's managing director, said last week: \"Our new growth projections will include notable markdowns, but not recession. We will also see markups to the inflation forecasts for some countries.\" She acknowledged the world was undergoing a \"reboot of the global trading system,\" comparing trade tensions to \"a pot that was bubbling for a long time and is now boiling over\". She went on: \"To a large extent, what we see is the result of an erosion of trust - trust in the international system, and trust between countries.\" Don't poke the bear It was a carefully calibrated response. Georgieva did not lay the blame at the US's door and stopped short of calling on the Trump administration to stop or water down its aggressive tariffs policy. That might have been a choice. To the frustration of politicians past and present, the IMF does not usually shy away from making its opinions known. Last year it warned Jeremy Hunt against cutting taxes, and back in 2022 it openly criticised the Liz Truss government's plans, warning tax cuts would fuel inflation and inequality. Taking such a candid approach with Trump invites risks. His administration is already weighing up whether to withdraw from global institutions, including the IMF and the World Bank. The US is the largest shareholder in both, and its departure could be devastating for two organisations that have been pillars of the world economic order since the end of the Second World War. 👉 Follow Trump 100 on your podcast app 👈 Here in the UK, Andrew Bailey has already raised concerns about the prospect of global fragmentation. It is \"very important that we don't have a fragmentation of the world economy,\" the Bank of England's governor said. \"A big part of that is that we have support and engagement in the multilateral institutions, institutions like the IMF, the World Bank, that support the operation of the world economy. That's really important.\" The Trump administration might take a different view when its review of intergovernmental organisations is complete. That is the main tension running through this year's spring meetings. How much the IMF will say and how much we will have to read between the lines, remains to be seen."
    },
    {
        "title": "Hospital patient had to wait more than 10 days for a bed - as 'unacceptable' crisis laid bare",
        "description": "Around 49,000 A&E patients had to wait 24 hours or more for a hospital bed in England last year, according to NHS figures.",
        "url": "https://news.sky.com/story/hospital-patient-had-to-wait-more-than-10-days-for-a-bed-as-unacceptable-crisis-laid-bare-13352961",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-nhs-corridor-crisis_6800246.jpg?20250115150901",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-20 23:12:00",
        "Headline": "The figures have been described as pointing to a \"crisis in corridor care\", but while the government admits the waits are unacceptable, it says fixing the problem \"will take time\".",
        "Content": "Around 49,000 A&E patients had to wait 24 hours or more for a hospital bed in England last year, according to NHS figures. Data compiled by the Liberal Democrats from freedom of information requests shows the longest wait was 10 days and 13 hours. The party said there were 48,830 \"trolley waits\" of 24 hours or longer in 2024. That is 19.8% higher than 2023 (40,735) and 57.9% higher than 2022 (30,921). A \"trolley wait\" is the time taken for a patient to be transferred to a ward after a decision has been taken to admit them to hospital. The Lib Dems said the real numbers were likely to be far higher because only 54 out of 141 NHS trusts had provided full data. Over the last three years, the percentage of those waiting aged 65 or over remained consistent at around 70%. The Royal College of Nursing said the figures \"only begin to scratch the surface\" of a \"crisis in corridor care\" - and that declining recruitment in nursing was adding to the problem. \n                  Lercanidipine: Patients urged to check blood pressure medication after labelling error\n                 \n                  Disposable vape ban 'may not curb e-cigarette use'\n                 \n                  Low-level drinkers have increased cancer and cardiovascular risk, study finds\n                 General secretary Professor Nicola Ranger said corridor care is \"undignified and unsafe\" and \"must be eradicated\".  Crisis 'will take time' to fix The government has made cutting NHS waiting lists one of its key missions. It insisted progress had been made by deploying RSV, COVID and flu vaccines, ending strikes by healthcare workers and reforming the health service, including scrapping NHS England. A spokesperson for the Department of Health and Social Care said: \"No patient should have to spend 24 hours in A&E waiting to be admitted to a ward. \"We are determined to end the annual winter crisis in urgent care and to cut waiting lists for emergency care, but it will take time.\" They said \"providing more care in the community\" would help ensure fewer patients end up in A&E to begin with. The Lib Dems are campaigning for a new team of \"super-heads\", consisting of experienced NHS bosses, to be deployed within struggling NHS Trusts and bring them up to standard. Read more from Sky News:A&E waits linked to deathsLabour marks NHS 'milestone' Official statistics show the total number of patients waiting over 12 hours for an emergency admission in England decreased from 61,529 in January to 46,766 in March. Some of the fall can be attributed to a post-seasonal peak from winter illnesses. Previous analysis by the Royal College of Emergency Medicine found there were almost 14,000 deaths associated with long A&E stays before admission in 2023."
    },
    {
        "title": "Labour WhatsApp messages on Supreme Court ruling point to future tensions on trans issues",
        "description": "It's no great surprise that members of a Labour MPs' LGBT+ WhatsApp group would be raising concerns about the impact of this week's Supreme Court ruling on the trans community.",
        "url": "https://news.sky.com/story/labour-whatsapp-messages-on-supreme-court-ruling-point-to-future-tensions-on-trans-issues-13352367",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-westminster-london_6890779.jpg?20250419152844",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2025-04-20 12:09:00",
        "Headline": "Government sources argue messages between Labour MPs are hardly evidence of a mass revolt against the Supreme Court's ruling. But they still raise uncomfortable questions for a party that has been on a tortuous journey over the issue.",
        "Content": "\n          Political correspondent\n              @amandaakass\n It's no great surprise that members of a Labour MPs' LGBT+ WhatsApp group would be raising concerns about the impact of this week's Supreme Court ruling on the trans community. But the critical contributions reportedly made by some of the group's higher-profile ministerial members highlight the underlying divisions with the Labour Party over the issue - and point to future tensions once the practical implications of the judgement become clear. Messages leaked to the Mail on Sunday allegedly include the Home Office minister Dame Angela Eagle writing \"the ruling is not as catastrophic as it seems but the EHRC [Equality and Human Rights Commission] guidance might be & there are already signs that some public bodies are overreacting\". Culture minister Sir Chris Bryant reportedly replied he \"agreed\" with another MP's opinion that the EHRC chair Baroness Falkner was \"pretty appalling\" when she said the ruling would mean trans women could not use single-sex female facilities or compete in women's sports.  Government sources argue these messages are hardly evidence of any kind of plot or mass revolt against the Supreme Court's ruling. But they still raise uncomfortable questions for a party that has been on a tortuous journey over the issue. Under Jeremy Corbyn, Labour was committed to introducing self-identification - enabling people to change their legal sex without a medical diagnosis - a position dropped in 2023. Back in 2021, Sir Keir Stamer said the then Labour MP Rosie Duffield was \"not right\" to say \"only women have a cervix\". But three years later he acknowledged that \"biologically, she of course is right\". Duffield, who now sits as an independent, is asking for an apology - but that doesn't seem to be forthcoming from a government keen to minimise its own role in changing social attitudes to the issue. The Conservative position on this has also chopped and changed - with Theresa May's support for gender self-ID ditched under Boris Johnson.  Read more from Sky News:School leaders issue warning as free breakfast clubs set to openFour things to avoid if you're doing the London Marathon As the Conservatives' equalities minister, Kemi Badenoch led the UK government's fight against Scotland's efforts to make it easier to change gender - and she's determined to punch Labour's bruise on the issue. This weekend, she's written to the cabinet secretary calling for an investigation into a possible breach of the ministerial or civil service code over a statement made by the Education Secretary Bridget Phillipson in response to the ruling, which said \"we have always supported the protection of single-sex spaces based on biological sex\". The Tories claim this is false, because last summer Ms Phillipson herself gave an interview in which she suggested that trans women with penises could use female toilets. Ms Phillipson has been approached for a response. Her comments, however, are entirely in keeping with the government's official statement on the judgement, which claims they have \"always supported the protection of single-sex spaces based on biological sex\" and welcomed the ruling as giving \"clarity and confidence for women and service providers\". The government statement added: \"Single-sex spaces are protected in law and will always be protected by this government.\""
    },
    {
        "title": "Macron to beat Trump to UK state visit - report",
        "description": "Emmanuel Macron will reportedly be given a state visit to the UK before Donald Trump's expected visit in September.",
        "url": "https://news.sky.com/story/macron-to-beat-trump-to-uk-state-visit-report-13352238",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-emmanuel-macron-france_6891498.jpg?20250420021928",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-20 00:08:00",
        "Headline": "Not many government and royal officials know the details of the engagement, according to a report, which would be the French president's first state visit to Britain and come eight years after he took office.",
        "Content": "Emmanuel Macron will reportedly be given a state visit to the UK before Donald Trump's expected visit in September. The French president received an invitation from the King to travel to the UK at the end of May, according to The Sunday Times. The paper said few government and royal officials know the details of the engagement, which would be Mr Macron's first state visit to Britain and come eight years after he took office. 'Trump-fest' It comes after Mr Trump suggested Buckingham Palace was \"setting a date for September\" for him to meet the King. He said: \"They're going to do a second, as you know, a second fest … that's what it is: a fest, and it's beautiful, and it's the first time it's ever happened to one person.\" Previously, US presidents who have already made a state visit, such as George W Bush and Barack Obama, usually have tea or lunch with the monarch at Windsor Castle. But Sir Keir Starmer handed Mr Trump what he described as a \"truly historic\" personal invitation from the King for a second state visit when he visited the White House in February. Reports suggest the venue is expected to be Windsor Castle, rather than Balmoral or Dumfries House, as previously thought. Mr Macron's visit is also expected to take place at Windsor due to refurbishment at Buckingham Palace. Read more from Sky News:Sucking up to Trump will only get Starmer so farFarage accused of peddling 'nonsense and lies'  Sir Keir has repeatedly insisted he does not need to choose between pursuing a closer relationship with Europe and strengthening US-UK trade. Chancellor Rachel Reeves is expected to speak with her American counterparts next week about the prospect of a wider economic agreement to alleviate the impact of Mr Trump's 10% tariffs on all goods entering America. But ministers have said Britain must look at co-ordinating better across Europe in order to protect the country's economy. Sir Keir and Mr Macron have been cooperating closely on defence, with both leaders pushing for an Anglo-French-led \"coalition of the willing\" to defend any potential peace deal in Ukraine. Downing Street declined to comment."
    },
    {
        "title": "Oldest serving US astronaut returns from space on 70th birthday",
        "description": "America's oldest serving astronaut has touched down on Earth on his 70th birthday.&#160;",
        "url": "https://news.sky.com/story/touch-down-iss-crew-returns-after-seven-months-in-space-13352239",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-astronaut-kazakhstan_6891545.jpg?20250420090223",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-20 02:37:00",
        "Headline": "A Soyuz MS-26 spacecraft carrying American Donald Pettit and Russians Alexey Ovchinin and Ivan Wagner landed in Kazakhstan on Sunday.",
        "Content": " America's oldest serving astronaut has touched down on Earth on his 70th birthday.  NASA astronaut Donald Pettit and two Russian cosmonauts had been on a seven-month mission to the International Space Station (ISS). The Soyuz MS-26 spacecraft carrying Mr Pettit and Russians Alexey Ovchinin and Ivan Vagner landed in Kazakhstan on Sunday. \"Its deorbiting and descent to Earth were normal,\" Russia's Roscosmos space agency said. The crew's seven-month science mission started on 11 September 2024. They orbited the Earth 3,520 times over 220 days in space. Read more from Sky News:Robots race half-marathon against humans for first timeHow Japan could shape the future of the NHSWarning over exploitation of 'influencer' children Mr Pettit had been conducting research to enhance in-orbit metal 3D printing capabilities, advance water sanitisation technologies, explore plant growth under varying water conditions and investigate fire behaviour in microgravity, according to NASA. It was the fourth time in space for Mr Pettit and Mr Ovchinin, while it was Mr Vagner's second spaceflight."
    },
    {
        "title": "The Who drummer Zak Starkey rejoins band days after departure",
        "description": "The Who's Zak Starkey is back in the band after reports earlier this week he'd been sacked.",
        "url": "https://news.sky.com/story/the-who-drummer-zak-starkey-rejoins-band-days-after-departure-13352285",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-zak-starkey-the-who_6889019.jpg?20250417134449",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-04-20 08:08:00",
        "Headline": "A rock and roll row last month led to a \"collective decision\" to sack The Who's Zak Starkey. Now he's back in the band, with the \"confusion\" explained by Pete Townshend. ",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n The Who's Zak Starkey is back in the band after reports earlier this week he'd been sacked. A statement on the band's official social media pages written by guitarist Pete Townshend said \"communication issues\" had been \"aired happily\" and Starkey was \"not being asked to step down\". Townshend also acknowledged the situation \"blew up very quickly and got too much oxygen\", concluding \"it's over\" and acknowledged his part in \"the confusion\". Titled, \"News Flash! Who Backs Zak,\" the long statement said Starkey was \"not being asked to step down from The Who\". It said: \"There have been some communication issues, personal and private on all sides, that needed to be dealt with, and these have been aired happily. \"Roger and I would like Zak to tighten up his latest evolved drumming style to accommodate our non-orchestral line-up and he has readily agreed.\" The rock and roll row followed the band's Teenage Cancer Trust shows in March. Townsend's statement went on: \"I take responsibility for some of the confusion. Our TCT shows at the Royal Albert Hall were a little tricky for me. \"I thought that four and a half weeks would be enough time to recover completely from having a complete knee replacement. (Why did I ever think I could land on my knees?) Wrong! \"Maybe we didn't put enough time into sound checks, giving us problems on stage. The sound in the centre of the stage is always the most difficult to work with.\" So what went wrong? Going on to highlight the specifics of what went wrong, Townshend added: \"Roger did nothing wrong but fiddle with his in-ear monitors. Zak made a few mistakes and he has apologised. Albeit with a rubber duck drummer. \"We are a family, this blew up very quickly and got too much oxygen. It's over. We move forward now with optimism and fire in our bellies.\" A review of one gig, published in the Metro, suggested frontman Roger Daltrey - who launched the annual gig series for the charity in 2000 - had been \"frustrated\" with the drumming during some tracks. Townsend also said he owed drummer Scott Devours \"an apology\" for not \"crushing the rumour\" that he would be replacing Starkey in the Who line-up. Devours is supporting Roger Daltrey on his solo tour, which kicked off this weekend. Read more from Sky News:The Last Of Us: The science behind the real 'zombie' fungusEurovision star and face of Bisto gravy dies Starkey - who is the son of The Beatles drummer Ringo Starr - reposted Townshend's statement, with the message: \"V grateful to be a part of the Who family Thanks Roger and Pete xx\". The 59-year-old drummer previously said he was \"surprised and saddened\" by news of his sacking. He's been with The Who for nearly three decades, after joining in 1996 for their Quadrophenia tour. Starkey also drums for supergroup Mantra Of The Cosmos - along with fellow musicians Shaun Ryder and Bez from Happy Mondays, and Andy Bell of Ride and Oasis - and has previously played with Oasis, Lightning Seeds and Johnny Marr."
    }
]