[
    {
        "title": "Donald Trump threatens to impose additional 100% tariff on 'extraordinarily aggressive' China",
        "description": "Donald Trump has announced the US will impose an additional 100% tariff on China imports, accusing it of taking an \"extraordinarily aggressive position\" on trade.",
        "url": "https://news.sky.com/story/donald-trump-threatens-to-impose-additional-100-tariff-on-extraordinarily-aggressive-china-13448404",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-us-president_7047359.jpg?20251010044418",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-10 20:57:00",
        "Headline": "President Trump warned the additional tariffs would begin on 1 November.",
        "Content": "Donald Trump has announced the US will impose an additional 100% tariff on China imports, accusing it of taking an \"extraordinarily aggressive position\" on trade. In a post to his Truth Social platform on Friday, the US president said Beijing had sent an \"extremely hostile letter to the world\" and imposed \"large-scale export controls on virtually every product they make\". Mr Trump, who warned the additional tariffs would start on 1 November, said the US would also impose export controls on all critical software to China. The president added that he was imposing the tariffs because of export controls placed on rare earths by China. He wrote: \"Based on the fact that China has taken this unprecedented position, and speaking only for the USA, and not other nations who were similarly threatened, starting November 1st, 2025 (or sooner, depending on any further actions or changes taken by China), the United States of America will impose a tariff of 100% on China, over and above any tariff that they are currently paying. \"It is impossible to believe that China would have taken such an action, but they have, and the rest is history. Thank you for your attention to this matter!\" Mr Trump said earlier on Friday that there \"seems to be no reason\" to meet with Chinese leader Xi Jinping in a scheduled meeting as part of an upcoming trip to South Korea at the end of this month. \n                  Starmer denies ministers involved in China spy trial collapse\n                 \n                  China tightens control of global rare-earth supply chain ahead of Trump talks\n                 \n                  The blame game over China spy trial collapse - who is right and who is wrong?\n                 He had posted: \"I was to meet President Xi in two weeks, at APEC, in South Korea, but now there seems no reason to do so.\" Read more:China tightens control of global rare earth supplyThree things you may have missed from China this week The trip was scheduled to include a stop in Malaysia, which is hosting the Association of Southeast Asian Nations summit, a stop in Japan and then the stop to South Korea, where Mr Trump would meet Mr Xi ahead of the Asia-Pacific Economic Cooperation summit. Mr Trump added: \"There are many other countermeasures that are, likewise, under serious consideration.\" The move signalled the biggest rupture in relations in six months between Beijing and Washington - the world's biggestfactory and its biggest consumer. It also threatens to escalate tensions between the two countries, prompting fears over the stability of the global economy.  Friday was Wall Street's worst day since April, with the S&P 500 falling 2.7%, owing to fears about US-China relations. China had restricted the access to rare earths ahead of the meeting between Presidents Trump and Xi. Under the restrictions, Beijing would require foreign companies to get special approval for shipping the metallic elements abroad."
    },
    {
        "title": "Hamas official thanks Donald Trump for ceasefire deal - but tells Sky News Tony Blair not welcome",
        "description": "A senior Hamas official has thanked President Donald Trump for his role in securing a ceasefire deal between Israel and Hamas.",
        "url": "https://news.sky.com/story/hamas-official-thanks-donald-trump-for-peace-deal-but-warns-tony-blair-not-welcome-13448166",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-gaza-palestinians-israel_7047582.jpg?20251010172522",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-10 14:26:00",
        "Headline": "Dr Basem Naim said Hamas would be willing to step aside for a Palestinian body to govern a post-war Gaza, but that they would remain \"on the ground\" and would not be disarmed.",
        "Content": " A senior Hamas official has thanked President Donald Trump for his role in securing a ceasefire deal between Israel and Hamas. In an exclusive interview with Sky News' lead world news presenter Yalda Hakim, senior Hamas official Dr Basem Naim also warned that former UK Prime Minister Sir Tony Blair would not be welcome in any post-war role for Gaza. Latest updates: Palestinians head back north - as Israel pulls troops back Israel and Hamas have agreed to a first phase of a peace deal brokered by the US president, with a ceasefire taking effect on Friday. Dr Naim said the ceasefire would not have been possible without President Trump, but insisted he needed to continue to apply pressure to Israel to stick to the agreement. He added that Hamas would be willing to step aside for a Palestinian body to govern a post-war Gaza, but that they would remain \"on the ground\" and would not be disarmed. Dr Naim said in the interview: \"Without the personal interference of President Trump in this case, I don't think that it would have happened to have reached the end of the war. \n                  Could the Gaza deal lead to something even bigger?\n                 \n                  How withdrawal of Israeli troops in Gaza could work - and who could make up peacekeeping force\n                 \n                  Palestine Action ban must be explained, Labour peer tells Starmer\n                 \"Therefore, yes, we thank President Trump and his personal efforts to interfere and to pressure Israel to bring an end to this massacre and slaughtering.\" 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 He added: \"We believe and we hope that President Trump will continue to interfere personally and to exercise the maximum pressure on [Israeli Prime Minister Benjamin] Netanyahu to fulfil its obligation. \"First, as according to the deal, and second, according to the international law as an occupying power, because I think without this pressure, without this personal interference from President Trump, this will not happen. \"We have already seen Netanyahu speaking to the media, threatening to go to war again if this doesn't happen, if that doesn't happen.\" Questions remain over the next phases of the peace plan, including who will govern Gaza as Israeli troops gradually pull back and whether Hamas will disarm - as called for in Mr Trump's ceasefire plan. Mr Netanyahu has hinted that Israel might renew its offensive if Hamas does not give up its weapons. However, Dr Naim said Hamas would not completely disarm and that weapons would only be handed over to the Palestinian state, with fighters integrated into the Palestinian National Army. \"No one has the right to deny us the right to resist the occupation of armies,\" he said.  On future governance, Dr Naim criticised plans for Sir Tony to play any role in overseeing the future of Gaza, saying that Hamas and Palestinians were angered by his role in previous wars in Afghanistan and Iraq. Dr Naim added: \"When it comes to Tony Blair, unfortunately, we Palestinians, Arabs and Muslims and maybe others around the world have bad memories of him. \"We can still remember his role in killing, causing thousands or millions of deaths to innocent civilians in Afghanistan and Iraq. \"We can still remember him very well after destroying Iraq and Afghanistan.\" Under Mr Trump's plans, Sir Tony would form part of an international supervisory body. The international body, the Council of Peace or Board of Peace, would govern under plans approved by Mr Netanyahu. Read more:How withdrawal of Israeli troops in Gaza could workCould the Gaza deal lead to something even bigger? The body would hold most power while overseeing the administration of Palestinian technocrats running day-to-day affairs. It would also hold the commanding role of directing reconstruction in Gaza. Dr Naim added that Hamas was satisfied Mr Trump's plan would achieve peace in Gaza. But he said it could never be fully satisfied after accusing Israel of genocide. Israel has continually denied this, claiming it has been fighting Hamas terrorists to defend itself following the October 7 massacre in 2023."
    },
    {
        "title": "How withdrawal of Israeli troops in Gaza could work - and who could make up peacekeeping force",
        "description": "Israeli forces are unlikely to move further out of Gaza for some time, according to Sky News' military analyst, as he said there's still \"huge ambiguity\" surrounding the ceasefire deal.",
        "url": "https://news.sky.com/story/how-withdrawal-of-israeli-troops-in-gaza-could-work-and-who-could-make-up-peacekeeping-force-13448075",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-idf-withdrawal_7047750.jpg?20251010131435",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-10 14:06:00",
        "Headline": "Sky News' military analyst Professor Michael Clarke said: \"We don't want to damn it [ceasefire deal] with expectations to start with, let's hope for the best, but most ceasefires are hardest to maintain in the first two or three weeks.\"",
        "Content": " Israeli forces are unlikely to move further out of Gaza for some time, according to Sky News' military analyst, as he said there's still \"huge ambiguity\" surrounding the ceasefire deal. Speaking as a ceasefire to end the war in Gaza took effect on Friday, Professor Michael Clarke said skirmishes between the warring parties are likely, as Israel has made it \"very clear\" that any seemingly threatening actions would be met with a response. Latest updates: Palestinians head back north - as Israel pulls troops back Israel and Hamas on Thursday agreed to a first phase of a peace deal brokered by US President Donald Trump, and which aims to bring the two-year conflict to an end. Under the agreement, Hamas have 72 hours to release all hostages, alive or dead, now the initial withdrawal of Israeli troops to the yellow line has been confirmed. But Israeli Prime Minister Benjamin Netanyahu on Friday also confirmed that Israel's troops will remain in Gaza to keep up the pressure on Hamas until the group disarms - something the militant group is \"fairly determined\" not to do, Professor Clarke said. The analyst said \"the initial withdrawal line, which still leaves them [IDF] in control of 50% of the Gaza Strip\" was the \"easy one to agree to\". \"In theory, they would then move back to another line which would give them only a smaller amount of territory,\" he said, before Israeli troops move to a buffer zone at a later stage. But Professor Clarke said: \"I don't think they are going to get much beyond that first line, that yellow line, for some time.\" 'Huge ambiguity' Referencing issues with the 20-point peace plan, Professor Clarke said: \"The nearer we get down to points 18-19-20, the further away they begin to look. \"Netanyahu is making it pretty clear he doesn't intend to enter into negotiations with the Palestinian Authority about a two-state solution, he spent 20 years of his life ruling out a two-state solution but that's what the 20 points imply, so he is not going to go that far. \"So there's a huge ambiguity about that.\"  Speaking of Hamas appearing resolved not to disarm or leave Gaza, Professor Clarke said: \"They calculate, I think, that President Trump will be so anxious to keep this thing alive that he will tolerate that, just as he will tolerate the fact that Israelis don't really want to enter into any long-term, formal negotiation.\" Who could make up a peacekeeping force?  \"We still have no idea who is going to provide, say, a brigade of troops, I mean 5,000 troops, to move into Gaza and sit in the middle of a very volatile ceasefire,\" Professor Clarke said, adding: \"No one wants to do that.\" He said the \"best possibilities\" would be Turkish or Egyptian troops but they would need \"quite a lot of inducements\". Speaking of the risks facing any forces which get deployed to Gaza, Professor Clarke said: \"The danger is that if things start to go wrong, they will look as if they are helping the IDF to suppress guerrilla groups of Hamas, or they will just become a sort of shooting gallery for Hamas people and then the IDF might overreact. \"It's a miserable situation for anybody and only the most disciplined troops can do it and nobody wants to do it so the US will have to lean on and induce quite heavily whoever is going to be part of this stabilisation force.\" Data journalist The Israeli military has completed its initial withdrawal, less than 24 hours after the Israeli cabinet ratified the ceasefire deal. This initial withdrawal saw the IDF pull back from Gaza’s major population centres, to an agreed perimeter ranging from 1.5km to 6.5km from the Israeli border. Sky News analysis of satellite imagery over the past two weeks shows that this withdrawal line closely matches the position of the IDF’s active ground bases in the Gaza Strip. \n\n Out of 40 observed bases active since late September, only four sit beyond the line of withdrawal and will therefore need to be vacated.  The remaining 90% will be allowed to remain in place. As the initial withdrawal is now completed, Hamas has 72 hours to complete the handover of all remaining hostages. Further negotiations are then expected to lead to a further withdrawal, though the timeline for this is less clear. He added: \"We don't want to damn it [ceasefire deal] with expectations to start with, let's hope for the best, but most ceasefires are hardest to maintain in the first two or three weeks\"."
    },
    {
        "title": "Tennessee: 19 people missing after explosion at military munitions plant",
        "description": "Nineteen people are missing feared dead following a devastating explosion at a Tennessee military munitions plant.",
        "url": "https://news.sky.com/story/tennessee-multiple-people-killed-and-others-missing-after-explosion-at-military-munitions-plant-13448218",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-tennessee-hickman-county_7047970.jpg?20251010180025",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-10 16:35:00",
        "Headline": "The blast, which people reported hearing and feeling miles away, occurred at Accurate Energetic Systems, in rural Tennessee. ",
        "Content": " Nineteen people are missing feared dead following a devastating explosion at a Tennessee military munitions plant. Humphreys County Sheriff Chris Davis told a press conference that there were fatalities following the blast but could not provide a specific number, saying it was still possible some employees had survived. \"We do have 19 souls we are looking for,\" said Davis. When asked to describe the building where the blast occurred at Accurate Energetic Systems, a company that makes and tests explosives about 60 miles southwest of Nashville, Davis replied, \"There's nothing to describe. It's gone.\" The cause of the blast, which occurred at 7.45am on Friday (1.45pm in the UK), was not immediately known. Video from the scene showed flames and smoke billowing from a field of debris. Emergency crews were initially unable to enter the Tennessee plant because of continuing explosions, Hickman County Advanced MT David Stewart said. \n                  Trump sends National Guard into Memphis, and hints Chicago is next\n                 \n                  Child killer becomes first to be executed with defibrillator fitted\n                 \n                  Tennessee: Man tries to detonate 14 explosive devices while being arrested\n                 Residents in Lobelville, a 20-minute drive from the scene, told the Associated Press that they felt their homes shake and some people captured the loud boom of the explosion on their home cameras. Gentry Stover, who was woken from his sleep by the blast, said: \"I thought the house had collapsed with me inside of it. \"I live very close to Accurate and I realised about 30 seconds after I woke up that it had to have been that.\" Read more from Sky News:Hamas official tells Sky News Tony Blair not welcomeLiam Gallagher and Wayne Rooney among stars at Ricky Hatton funeralThomas Tuchel criticises England fans after Wales win According to its website, Accurate Energetic Systems manufactures products for the defence, aerospace, demolition, and oil and gas industries."
    },
    {
        "title": "Emmanuel Macron reappoints Sebastien Lecornu as prime minister - four days after he quit",
        "description": "French President Emmanuel Macron has reappointed Sebastien Lecornu as prime minister.",
        "url": "https://news.sky.com/story/macron-reappoints-lecornu-as-prime-minister-four-days-after-he-quit-13448343",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sebastien-lecornu-france_7043764.jpg?20251006100611",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-10 20:04:00",
        "Headline": "Far-right and hard-left party leaders have said they will not support the surprise reappointment ",
        "Content": "French President Emmanuel Macron has reappointed Sebastien Lecornu as prime minister. Mr Lecornu resigned from the post four days ago just hours after he appointed a cabinet - and after political rivals threatened to topple his government. Macron's office said in a statement on Friday that he has now been tasked with forming a new cabinet.  After the announcement on Friday evening, Mr Lecornu said it was \"my duty to accept the mission entrusted to me by the president\" and \"to respond to the everyday problems of our compatriots\". He added: \"We need to put an end to this political crisis, which is exasperating the French people, and to this instability, which is bad for France's image and its interests.\" Mr Lecornu also said that whoever joined his government would have to renounce their personal ambitions to succeed Macron in 2027, and pledged his cabinet would \"embody renewal and diversity\". He will first work on attempting to deliver a budget by the end of Monday, as economists in Europe have previously warned that the EU's second-largest economy faces a Greek-style debt crisis. \n                  Emmanuel Macron under pressure to call parliamentary elections after French prime minister resigns\n                 \n                  Who are the seven prime ministers who have served under France's Emmanuel Macron?\n                 \n                  Police fire tear gas at protesters during day of strikes in France\n                 The reappointment was scoffed at by political rivals. Jordan Bardella, president of France's far-right National Rally party, said he would vote down the new government, claiming \"the Elysee Palace, is a bad joke, a democratic disgrace and a humiliation for the French people\". Party leader Marine Le Pen said: \"All the political parties that helped Emmanuel Macron gain the time he needed to implement this shameful manipulation will be held to account at the next elections.\" Read more from Sky News:Nineteen missing after explosion at Tennessee munitions plantHow withdrawal of Israeli troops in Gaza could workNobel Peace Prize winner named - and it's not Trump Europe correspondent On Monday morning, Sebastian Lecornu resigned as Prime Minister of France. On Friday, he was reappointed. \n\n Another turbulent week of French politics has ended where it began. Lecornu's dramatic and unexpected departure at the start of the week left his ally Emmanuel Macron looking weakened, perhaps terminally.   Calls for the President to step down weren't just louder, they were more credible after he lost his fifth prime minister in a little over two years. Macron was desperate. Former allies started turning on him, suggesting publicly that it was now time for him to step aside.  The president went for a walk along the Seine by himself and decided to ask his prodigy to try again. Lecornu had 48 hours to resolve differences and calm the markets – he succeeded.  Compromises must have been made; we don’t know what, but presumably, he has agreed to a watered-down budget that he will now have to present by Monday. It won't be popular, but it might just be popular enough to get through.  France's economy needs some brutal belt-tightening, but first it needs a stable government, and Lecornu has prioritised that. And so he will now begin his second term as France’s prime minister, only four days after he ended his first term and so became the shortest serving prime minister in the history of the Fifth Republic.  He will need to last longer this time otherwise it might not just be his political career over - Macron will struggle to survive another debacle.  Mathilde Panot, head of the hard-left France Unbowed party, also said that \"never before has a President wanted so much to govern by disgust and anger\". \"Lecornu, who resigned on Monday, was reappointed by Macron on Friday,\" she added. \"Macron miserably postpones the inevitable: his departure.\" Stephane Troussel of the Socialist Party called the latest announcement \"a farce in which Emmanuel Macron is theprotagonist. A bad joke for millions of citizens who expect change and hope for the future\". He added: \"They can rest assured that this President's reign will soon be coming to an end.\" Earlier on Friday, Mr Macron convened a meeting of mainstream party leaders to gather support around his reappointment of Mr Lecornu. The president's entourage said Lecornu had \"carte blanche\", a sign Mr Macron was leaving his prime minister wiggle room to negotiate a cabinet and budget. His return to the role marks the eighth prime minister of Mr Macron's tenure as president, and the fifth appointment in barely a year. His predecessor, Francois Bayrou, was appointed in December last year and was ousted after losing a confidence vote by an overwhelming 364-194 in September."
    },
    {
        "title": "Liam Gallagher and Wayne Rooney among stars at Ricky Hatton funeral",
        "description": "Liam Gallagher, Tyson Fury and Wayne Rooney were among those who attended the funeral of boxing champion Ricky Hatton.",
        "url": "https://news.sky.com/story/ricky-hatton-liam-gallagher-and-wayne-rooney-among-stars-at-funeral-for-boxing-champion-13448082",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ricky-hatton-funeral_7047769.jpg?20251010133109",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-10 11:45:00",
        "Headline": "Thousands of people lined the streets of Manchester to pay respects to 'The Hitman', who died last month, aged 46.",
        "Content": " Liam Gallagher, Tyson Fury and Wayne Rooney were among those who attended the funeral of boxing champion Ricky Hatton. While famous faces and family gathered at Manchester cathedral for the private memorial service, thousands of people lined the streets on Friday morning to pay their respects as the procession passed. The procession was led by a Reliant Regal - the yellow three-wheeler made famous on the show Only Fools And Horses - which Hatton famously owned and used to drive. Ricky Hatton funeral as it happened As the funeral cortege passed the site of the pub Hatton's parents, Ray and Carol Hatton, used to own and where he used to train in the basement - known back then as The New Inn - doves were released.  Outside the church a brass band played Winter Wonderland, synonymous with the chant \"There's Only One Ricky Hatton\", which rang round the many stadiums Hatton fought in. The service was played to the crowds outside the cathedral, during which Hatton's three children Campbell, Fearne and Millie, each paid tribute to their dad. Campbell, who has followed his father to become a boxer, said: \"I can't explain how much I'm going to miss you, Dad, and that we won't be making any new memories - but the ones we did I will cherish forever.\" A statement from Hatton's mother was read on her behalf, in which she described her son as \"our little champion from the day he was born\". Also pictured attending the service included Happy Mondays's Shaun Ryder and Mark 'Bez' Berry, reality TV personality Calum Best, comedian Paddy McGuinness, former cricket star Andrew 'Freddie' Flintoff and actor Dean Gaffney. Boxer Frazer Clarke and former boxers Frank Bruno, Amir Khan, Scott Welch and Anthony Crolla were also at the funeral, as was pundit and former footballer Chris Kamara. North of England correspondent As Ricky Hatton's hearse moved through the streets of Manchester, some of the greatest names in British boxing began to climb the steps of the cathedral.  From Tyson Fury to Frank Bruno, Amir Khan to Tony Bellew, a collection of champions arrived to pay their respects.  In a testament to how Hatton's legacy went beyond boxing, Liam Gallagher of Oasis was also there, as well as Andy Burnham, the mayor of Greater Manchester.  But this wasn’t just a service in tribute to \"Ricky the hitman\", who fought under the brightest lights.  This was a tribute to Richard Hatton, the people's champion, who meant so much to this city, and died at 46. As the service was played over a sound system, many of the people gathered wiped their eyes and bowed their heads as they heard tributes from Hatton's loved ones. \n Many of the people outside were wearing the sky blue of Manchester City, mourning one of their own.  Some had met him. Like the man whose son was a boxer and benefited from Hatton's advice, or the two women who would grab a pint and a picture with him at City games.  For one of them, the night he won the world title in Manchester Arena remains a moment, she will never forget.  When the coffin was loaded back into the hearse for a final journey through Manchester to the Etihad, the crowd parted and applauded, before one last rendition of walking in a Hatton wonderland played by a band.  This was a send-off for not just a great fighter, but a great Mancunian, who brought so many people here on his journey to becoming a legend.  Following the service, the funeral procession made its way to the Etihad Stadium, the home of Hatton's beloved Manchester City football club. It was met by crowds applauding and singing. 'I was in awe of him' Tributes poured in across the world of sport and beyond after Hatton's death aged 46 at his home in Hyde, Greater Manchester, on 14 September.  The former world champion - nicknamed \"The Hitman\" - had only announced in July that he planned to come out of retirement in December for his first professional fight in 13 years. Speaking to Sky News outside the church, former boxer Tony Bellew said he \"was in awe\" of Hatton when he first watched him training. \"I've watched thousands of fighters train over the years, hundreds of thousands. And after watching him... I was in awe of him. He was the standard - everything he did,\" he said. \"There are thousands that have turned out today, not hundreds. That speaks volumes.\""
    },
    {
        "title": "Migrant with AK-47 face tattoo found guilty of threatening to kill Nigel Farage",
        "description": "An Afghan migrant has been found guilty of threatening to kill Nigel Farage in a TikTok post.",
        "url": "https://news.sky.com/story/migrant-with-ak-47-face-tattoo-found-guilty-of-threatening-to-kill-nigel-farage-13447937",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-nigel-farage-fayaz-khan_7047445.jpg?20251010181704",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-10 06:40:00",
        "Headline": "Fayaz Khan said he was coming to England and was going to \"pop, pop, pop\" Nigel Farage after the Reform leader posted a video of the Afghan national coming to the UK in a small boat.",
        "Content": " An Afghan migrant has been found guilty of threatening to kill Nigel Farage in a TikTok post. Fayaz Khan, 26, chose not to give evidence in his trial, in which he was accused of threatening the Reform UK leader between 12 and 15 October last year in a video on the social media platform. Mr Farage said the video was \"pretty chilling\". Jurors deliberated for 11 hours and 55 minutes before finding him guilty at Southwark Crown Court. They had been told Khan had a \"very large presence online\", with his TikTok videos amassing hundreds of thousands of views as he showed himself attempting to come to the UK by small boat last autumn. The Afghan national, who has an AK-47 tattoo on his right cheek and arm, live-streamed his journey across the English Channel from France in a small boat and was arrested on 31 October after arriving in the UK. He had been living in Stockholm, Sweden, since 2019. \n                  'Beaten for 16 days': Deported Afghans describe brutal treatment by Iran - yet are desperate to return\n                 \n                  Crying babies blighted by hunger fill this Afghanistan hospital - where parents fear each day might be the last\n                 \n                  Taliban says it will never hand over Bagram Air Base in Afghanistan to US\n                 Jurors were told that on 12 October last year, Mr Farage uploaded a YouTube video titled \"The journey of an illegal migrant\", which highlighted Khan and referenced \"young males of fighting age coming into our country about whom we know very little\". Khan responded with a video two days later in which he appeared to say: \"Englishman Nigel, don't talk s**t about me. \"You not know me. I come to England because I want to marry with your sister. You not know me. \"Don't talk about me more. Delete the video. \"I'm coming to England. I'm going to pop, pop, pop.\" He made gun gestures with his hand and headbutted the camera during the video, while pointing to the AK-47 tattoo on his face to \"emphasise he wasn't joking\", Mr Ratliff said. Mr Farage, who was at court for the trial, said the video was \"pretty chilling\". \"Given his proximity to guns and love of guns, I was genuinely worried,\" he said. \"He says he's coming to England and he's going to shoot me.\" A subsequent TikTok post by Khan read: \"I mean what I say\" on an image of a GB News report about the threat against Mr Farage. Other videos Khan posted on social media were shown to the jury in which he appeared to make \"pop, pop, pop\" noises and similar gun hand gestures. After his arrest, Khan told police in November last year: \"It was just a video, it was never an intention to threaten him. \"It was never my intention to kill him or anything - this is my character, this is how I act in my videos. \"In every video I make those sounds, I say 'pop, pop pop'.\" Prosecutor Peter Ratliff said the threat to kill was \"not some off-the-cuff comment\" and the video was \"sinister and menacing\". He said Khan, who denied the charge, was a \"dangerous man with an interest in firearms\" and who had an AK-47 tattooed on his arm and face. Defence lawyer Charles Royle said Khan was \"remonstrating in his own idiosyncratic, moronic, comedic, eye-catching, attention-seeking way\" rather than making a threat to kill in the TikTok video. He told jurors the trial was \"not about your views on illegal immigration, nor about your views on face tattoos, Brexit or Reform\". Discussing Khan's decision not to give evidence, Mr Royle said: \"You shouldn't hold any silence against him.\""
    },
    {
        "title": "Brit becomes fourth UK EuroMillions ticket-holder this year to scoop jackpot",
        "description": "A single ticket-holder has become the winner of a &#163;25m EuroMillions jackpot, The National Lottery has announced.",
        "url": "https://news.sky.com/story/brit-becomes-fourth-uk-euromillions-ticket-holder-this-year-to-scoop-jackpot-13448424",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-lottery-ticket-euromillions_6640536.jpg?20241128141219",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-10 23:24:00",
        "Headline": "It is the fourth time this year that a UK ticket-holder has won the top prize - as Friday's draw numbers have made one lucky winner £25m richer.",
        "Content": "A single ticket-holder has become the winner of a £25m EuroMillions jackpot, The National Lottery has announced. It marks the fourth time this year that a UK ticket-holder has won the top prize - and the second Friday in a row. One lucky ticket-holder clinched the £26m jackpot last Friday, another player won £65m on Valentine's Day, and a third scooped £83m in January. Read more from Sky News:Trump threatens to impose additional 100% tariff on ChinaLiam Gallagher and Wayne Rooney among stars at Ricky Hatton funeral Andy Carter, senior winners' adviser at Allwyn, operator of The National Lottery, said: \"Wow, it's been an exciting night for EuroMillions players, as a single UK ticket-holder has landed the amazing £25m jackpot! \"That's two UK EuroMillions jackpot wins in the space of a week, after another lucky player scooped the incredible £26m jackpot in last Friday's draw (3 October).\" Players in the UK are being urged to check their tickets. The winning numbers for Friday night's draw were 06, 07, 17, 20 and 21 with the Lucky Star numbers 01 and 10."
    },
    {
        "title": "'Terror cannot beat us': Nova Music Festival founders on surviving October 7 - and their hopes for peace",
        "description": "In the exhibition room of Berlin's old Tempelhof Airport, three burned-out cars lie on their sides.",
        "url": "https://news.sky.com/story/terror-cannot-beat-us-nova-music-festival-founders-on-surviving-october-7-and-their-hopes-for-peace-13448416",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-7-october-tempelhof_7048142.jpg?20251010224247",
        "type": "Home",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-10-10 23:01:00",
        "Headline": "Two years on from the October 7 Hamas attacks, Ofir Amir and Omri Sasi recall how they very nearly died and what their hopes are for the future.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n In the exhibition room of Berlin's old Tempelhof Airport, three burned-out cars lie on their sides. The windows, interiors and paintwork are gone; all that remains are lumps of twisted and rusted metal. Next to them is a rough circle of tents and scattered mats. A picnic chair has toppled over on one, others are strewn with abandoned bags, camping equipment and discarded fairy lights. \"Everything you see here is original from the festival on October 7th,\" Ofir Amir explains. He's referring to the Nova Music Festival, where around 400 people were murdered on 7 October 2023. In the week where peace finally feels like a possibility, Ofir is remembering those killed in a massacre that sparked the latest conflict. All around us are tables of abandoned items left behind in the panic. One displays clothes; another is filled with shoes. \n                  Berlin school evacuated as children suffer breathing difficulties amid 'irritant gas', police say\n                 \n                  Man arrested over stabbing at Berlin Holocaust memorial is 19-year-old Syrian refugee\n                 \n                  Suspect arrested after man seriously injured in 'stabbing' at Berlin Holocaust memorial\n                 All of them are reminders of a day, Ofir, who was a co-founder of the festival, nearly didn't survive. \"When the terrorists came to the festival area, we saw them just shooting into the crowd that was running away from them,\" he tells me. Ofir and his friends managed to jump into a car and started to drive away, but they were cornered by Hamas militants who opened fire. One of their friends died, and Ofir was shot in both legs. He remembers he was on the phone to his wife, who was nine months pregnant at the time. 'How will my wife raise a child alone' \"This was all I could ever think about,\" he says, \"that I might not come home, and how will my wife raise a child alone.\" Ofir's friends used what they could to stop the bleeding and managed to keep him alive until help came. The memorial exhibition was created in memory of those who died. It's already opened in cities including New York and Toronto, but on the second anniversary of the October 7 attacks, the exhibition began its first European show in Berlin. \"With so much hate going on, so much antisemitism everywhere on the streets, all over the world, it's important to show the world and give them a reminder when you go so blindly and follow hate, what the outcome can be,\" Ofir says. Omri Sasi, also a co-founder and DJ at the Nova Music Festival, was in the car with Ofir when they were hit. He picks out faces from a long line of photos which cover one wall. 'They were murdered together' \"This is my uncle, Avi Sasi. This is Alex Luke, my friend from Montreal... they were murdered together,\" he says. Beside them are the photos of Omri's pregnant cousin and her husband, who were also killed. Despite their losses, Omri and Ofir say they don't want the exhibition to focus on religion or politics but to help spread peace. However, the memorial event has faced some opposition; for example, several hundred demonstrators protested against Israel at the exhibit in New York. In Los Angeles, Omri says a pro-Palestinian group also gathered outside the show. He invited them in, and they talked about the ongoing conflict in the Middle East. 'We cried together' \"We cried together, we hugged each other and we understood that the best way to deal with this war is to talk,\" he says. \"Not to fight and not hit people.\" More than 60,000 Gazans have died in the Israel-Hamas war, according to the Hamas-run Gaza health ministry. Omri tells me he has friends in Gaza, that he wants the ceasefire to hold, and Gazans \"to have a good life\" - but he's also deeply concerned by the rise in antisemitism he's seen in the last two years. \"People are scared,\" he says. \"Even when I go out here in Berlin, I look around myself and I try to not speak in Hebrew, and this is sad. \"It doesn't need to be like this.\" Authorities across Europe have warned about growing hate and violence against Jewish people since the October 7 attack. The fatal synagogue attack in Manchester has added to the fear. This week, Germany's domestic intelligence chief said antisemitism had increased with sometimes open calls for attacks on Jewish institutions, while the country's chancellor denounced the trend as \"shameful\". At the Berlin exhibition, Liora Furema says she's worried about her safety as a Jewish student when she goes to university or to the synagogue. \"At any Jewish event, I think about my security,\" she explained. It's hoped the ceasefire will be the beginning of the end of the war in Gaza, but the fear of antisemitism remains. Rather than deepening the divisions, the organisers say the show is a reminder of the dangers of allowing hate to flourish. They now are focusing on healing. \"Our message is, we will dance again,\" says Omri. \"Whatever happened to us, we are standing and dancing again. Terror cannot beat us.\""
    },
    {
        "title": "Venezuela opposition leader Maria Corina Machado named Nobel Peace Prize winner",
        "description": "Venezuelan opposition leader and pro-democracy campaigner Maria Corina Machado has won the Nobel Peace Prize.",
        "url": "https://news.sky.com/story/nobel-peace-prize-winner-named-as-donald-trump-misses-out-on-award-13447657",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-maria-corina-machado_7047548.jpg?20251010123810",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-10 09:00:00",
        "Headline": "Organisers of the prestigious prize say the 58-year-old's show of courage by staying in her country despite threats has inspired millions.",
        "Content": " Venezuelan opposition leader and pro-democracy campaigner Maria Corina Machado has won the Nobel Peace Prize. The committee praised her for her \"tireless work promoting democratic rights... and for her struggle to achieve a just and peaceful transition from dictatorship to democracy\". It said she had resisted death threats and been forced into hiding in her fight against President Nicolas Maduro - widely considered a dictator. \"When authoritarians seize power, it is crucial to recognise courageous defenders of freedom who rise and resist,\" Nobel added. The committee said Ms Machado had stayed in Venezuela despite personal risk, calling it a \"choice that has inspired millions of people\". \"Democracy depends on people who refuse to stay silent, who dare to step forward despite grave risk,\" it said. Read more: Who is Maria Corina Machado? There was speculation Donald Trump had an outside chance despite nominations closing less then two weeks after he started his second term. The president claims he has stopped seven wars since then - an assertion widely disputed - and last month said \"everyone says that I should get the Nobel Peace Prize\". Israeli Prime Minister Benjamin Netanyahu also put the president's name forward for the award in July. The White House criticised the Nobel committee's decision on Friday. \"President Trump will continue making peace deals, ending wars, and saving lives. He has the heart of a humanitarian, and there will never be anyone like him who can move mountains with the sheer force of his will,\" spokesman Steven Cheung said in a post on X. \"The Nobel Committee proved they place politics over peace.\"  Nina Graeger, director of the Peace Research Institute Oslo, told Sky News if Mr Trump's Gaza peace deal leads to \"a lasting and sustainable peace... the committee would almost certainly have to take that into serious consideration in next year's deliberations\". 'Extraordinary example of courage' Ms Machado, 58, was lauded by the Nobel committee as \"one of the most extraordinary examples of civilian courage in Latin America in recent times\". Writing on X after her win was announced, she said: \"This immense recognition of the struggle of all Venezuelans is an impetus to conclude our task: to conquer Freedom. \"We are on the threshold of victory and today more than ever we count on President Trump, the people of the United States, the peoples of Latin America, and the democratic nations of the world as our main allies to achieve Freedom and democracy. Venezuela will be free!\" Her candidacy for last year's election was blocked by the Maduro regime but she backed Edmundo Gonzalez, the leader of another party. Opposition groups organised hundreds of thousands of volunteers to observe voting, despite risks to their safety, and ensured tallies were recorded \"before the regime could destroy ballots and lie about the outcome\", added the Nobel committee. President Maduro, who has been in power since 2013, claimed a third term despite exit polls pointing to a decisive opposition win. He said his re-election was a triumph of peace and stability and claimed the electoral system was transparent. Ms Machado disputed the result and said Edmundo Gonzalez had recorded an \"overwhelming\" victory. The country's highest court upheld the result - but the United Nations said it wasn't impartial or independent. Antony Blinken, the US secretary of state at the time, said America had \"serious concerns\", while the UK said it was \"concerned by allegations of serious irregularities in the counting\". Nobel said Ms Machado first stood up for free and fair elections more than 20 years ago, when she called for \"ballots over bullets\", and had campaigned on issues such as judicial independence and human rights. A Nobel video on social media recorded her reaction on the other end of the line when she got the call telling her she had won. \"Oh my God... I have no words,\" she said. \"I thank you so much, but I hope you understand this is a movement, this is an achievement of a whole society. I am just one person. I certainly do not deserve it,\" she added. It's currently unclear whether she will be able to travel to Norway for the official ceremony on 10 December. Europe correspondent As the announcement about who would win this year's Nobel Peace Prize grew closer, one voice rose above the rest. Donald Trump has made no bones about the fact he would like to win the prize. More than that, he's said repeatedly that he deserves to win the accolade for the seven conflicts he claims to have ended.  Ahead of today's announcement, the White House said he had received seven nominations.  But as is so often the case, the spin ignores the facts. The deadline for nominations for this year's award was at the end of January. That meant Donald Trump had just 11 days in office to prove he was deserving. Love him or hate him, that's a challenge for anyone. In terms of the nominations he did receive, many of them were announced after the deadline.  Unfortunately, under Nobel Peace Prize rules we will have to wait 50 years to officially find out if he was among the 338 nominees. In his will, founder Alfred Nobel stated the winner should be \"the person who shall have done the most or the best work for fraternity between nations and the abolition or reduction of standing armies and the formation and spreading of peace congresses\". Trump's critics point to the strikes on Iran's nuclear sites, the blowing up of \"narco\" boats in the Caribbean and even tariffs as doing more to sow division than unity. His immigration raids and his deployment of National Guard troops onto some of the country's streets have also been divisive domestically.  While Venezuela's Maria Corina Machado scooped the 2025 award, all is not lost for the US president; if his 20-point peace plan helps lead to a lasting ceasefire he could well be in the running next year.   Read more from Sky News:Tsunami warnings after earthquake in the PhilippinesMore than 450 drones attack Ukraine energy sites - Zelenskyy The committee painted a bleak picture of Ms Machado's home country, saying many in Venezuela - which has the world's largest oil reserves - live in serious poverty after it went from a \"relatively democratic and prosperous country to a brutal, authoritarian state\". \"The violent machinery of the state is directed against the country's own citizens,\" it said, noting about eight million people had left the country - many of them heading north to try to enter America."
    },
    {
        "title": "Liam Gallagher and Wayne Rooney among stars at Ricky Hatton funeral",
        "description": "Liam Gallagher, Tyson Fury and Wayne Rooney were among those who attended the funeral of boxing champion Ricky Hatton.",
        "url": "https://news.sky.com/story/ricky-hatton-liam-gallagher-and-wayne-rooney-among-stars-at-funeral-for-boxing-champion-13448082",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ricky-hatton-funeral_7047769.jpg?20251010133109",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-10 11:45:00",
        "Headline": "Thousands of people lined the streets of Manchester to pay respects to 'The Hitman', who died last month, aged 46.",
        "Content": " Liam Gallagher, Tyson Fury and Wayne Rooney were among those who attended the funeral of boxing champion Ricky Hatton. While famous faces and family gathered at Manchester cathedral for the private memorial service, thousands of people lined the streets on Friday morning to pay their respects as the procession passed. The procession was led by a Reliant Regal - the yellow three-wheeler made famous on the show Only Fools And Horses - which Hatton famously owned and used to drive. Ricky Hatton funeral as it happened As the funeral cortege passed the site of the pub Hatton's parents, Ray and Carol Hatton, used to own and where he used to train in the basement - known back then as The New Inn - doves were released.  Outside the church a brass band played Winter Wonderland, synonymous with the chant \"There's Only One Ricky Hatton\", which rang round the many stadiums Hatton fought in. The service was played to the crowds outside the cathedral, during which Hatton's three children Campbell, Fearne and Millie, each paid tribute to their dad. Campbell, who has followed his father to become a boxer, said: \"I can't explain how much I'm going to miss you, Dad, and that we won't be making any new memories - but the ones we did I will cherish forever.\" A statement from Hatton's mother was read on her behalf, in which she described her son as \"our little champion from the day he was born\". Also pictured attending the service included Happy Mondays's Shaun Ryder and Mark 'Bez' Berry, reality TV personality Calum Best, comedian Paddy McGuinness, former cricket star Andrew 'Freddie' Flintoff and actor Dean Gaffney. Boxer Frazer Clarke and former boxers Frank Bruno, Amir Khan, Scott Welch and Anthony Crolla were also at the funeral, as was pundit and former footballer Chris Kamara. North of England correspondent As Ricky Hatton's hearse moved through the streets of Manchester, some of the greatest names in British boxing began to climb the steps of the cathedral.  From Tyson Fury to Frank Bruno, Amir Khan to Tony Bellew, a collection of champions arrived to pay their respects.  In a testament to how Hatton's legacy went beyond boxing, Liam Gallagher of Oasis was also there, as well as Andy Burnham, the mayor of Greater Manchester.  But this wasn’t just a service in tribute to \"Ricky the hitman\", who fought under the brightest lights.  This was a tribute to Richard Hatton, the people's champion, who meant so much to this city, and died at 46. As the service was played over a sound system, many of the people gathered wiped their eyes and bowed their heads as they heard tributes from Hatton's loved ones. \n Many of the people outside were wearing the sky blue of Manchester City, mourning one of their own.  Some had met him. Like the man whose son was a boxer and benefited from Hatton's advice, or the two women who would grab a pint and a picture with him at City games.  For one of them, the night he won the world title in Manchester Arena remains a moment, she will never forget.  When the coffin was loaded back into the hearse for a final journey through Manchester to the Etihad, the crowd parted and applauded, before one last rendition of walking in a Hatton wonderland played by a band.  This was a send-off for not just a great fighter, but a great Mancunian, who brought so many people here on his journey to becoming a legend.  Following the service, the funeral procession made its way to the Etihad Stadium, the home of Hatton's beloved Manchester City football club. It was met by crowds applauding and singing. 'I was in awe of him' Tributes poured in across the world of sport and beyond after Hatton's death aged 46 at his home in Hyde, Greater Manchester, on 14 September.  The former world champion - nicknamed \"The Hitman\" - had only announced in July that he planned to come out of retirement in December for his first professional fight in 13 years. Speaking to Sky News outside the church, former boxer Tony Bellew said he \"was in awe\" of Hatton when he first watched him training. \"I've watched thousands of fighters train over the years, hundreds of thousands. And after watching him... I was in awe of him. He was the standard - everything he did,\" he said. \"There are thousands that have turned out today, not hundreds. That speaks volumes.\""
    },
    {
        "title": "Man who murdered 16-year-old Syrian refugee after teen brushed past his girlfriend jailed",
        "description": "A man who stabbed a 16-year-old Syrian refugee in the neck after he brushed past his girlfriend has been jailed for life with a minimum of 23 years. ",
        "url": "https://news.sky.com/story/man-who-murdered-16-year-old-syrian-refugee-after-teen-brushed-past-his-girlfriend-jailed-13447957",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-alfie-franco-ahmad-mamdouh-al-ibrahim_7046951.jpg?20251009171000",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-10 07:50:00",
        "Headline": "Alfie Franco, 20, was convicted on Thursday of murdering Ahmad Al Ibrahim on a busy shopping street in Huddersfield earlier this year.",
        "Content": " A man who stabbed a 16-year-old Syrian refugee in the neck after he brushed past his girlfriend has been jailed for life with a minimum of 23 years.  Alfie Franco, 20, was convicted on Thursday of murdering Ahmad Al Ibrahim on a busy shopping street in Huddersfield earlier this year. Ahmad, who fled war-torn Homs as an unaccompanied child refugee after being injured in a bombing, had only been living in the West Yorkshire town for a couple of weeks. Jurors at Leeds Crown Court heard that on 3 April, Ahmad, whose parents said he had dreamed of being a doctor, was walking around the town with a friend - while Franco was going to buy eyelash glue with his girlfriend after a Jobcentre appointment. When they crossed paths, prosecutors said Franco took \"some petty exception\" to Ahmad \"innocuously\" walking past his girlfriend.  CCTV footage showed Franco saying something to Ahmad, before calling him over after a short verbal altercation. As Ahmad walked over, Franco opened the blade on a flick knife he was carrying and drove it into the teenager's neck. The court heard Franco had used cannabis before the encounter. Later tests also revealed he had recently used cocaine, diazepam, ketamine and codeine. During the trial, Franco denied murder, telling the court he thought he had seen Ahmad reaching for a weapon in his waistband during the altercation. He said he had only been aiming for the boy's cheek, and wanted to \"cut him and get away\". 'You were under no threat whatsoever' During sentencing, Judge Howard Crowson said Franco's claims of being in fear of Ahmad were \"incredible\" - as CCTV footage showed him calmly eating ice cream while preparing to stab the teenager. He told Franco: \"During this trial you tried to portray Ahmad as aggressive and threatening. The CCTV reveals you were under no threat whatsoever. \"Ahmad was unarmed as he walked peacefully about Huddersfield town centre that day.\" He then said Franco's claim to have seen a weapon on Ahmad's waistband was \"a lie,\" and added: \"Before Ahmad made any movement towards you, you prepared your knife for use. \"You calmly and surreptitiously removed the knife from your waistband, opened it and concealed it in your pocket.\" The judge said he was satisfied that Franco intended to kill Ahmad and that he had \"lured\" the boy to within striking distance before lunging at him with the knife, deliberately aiming for his neck. Read more from Sky News:Nobel Peace Prize winner named - and it's not TrumpSunak hired as a senior adviser by Microsoft Uncle: Ahmad 'loved helping people' Prosecutor Richard Wright KC said during the trial that \"to plunge that knife into someone's neck who has done no more than walk towards you after you've engaged them in some verbal argy-bargy in the street... that's not reasonable self-defence\". He added: \"This is a case of a young man with a cocky swagger, wandering around town with his girlfriend, on drugs, who doesn't like the fact that Ahmad has spoken back to him.\" In a victim impact statement read in court, Ahmad's uncle, Ghazwan Al Ibrahim, said the boy was \"an intelligent and outstanding student\" whose dream was to become a doctor. He said his nephew had a \"sociable and ambitious personality, loved helping people and was passionate about life\". Mr Al Ibrahim added that Ahmad spent three months travelling to the UK and initially lived in a Home Office hotel in Swansea with other people his own age before being moved to Huddersfield to be near his uncle."
    },
    {
        "title": "Migrant with AK-47 face tattoo found guilty of threatening to kill Nigel Farage",
        "description": "An Afghan migrant has been found guilty of threatening to kill Nigel Farage in a TikTok post.",
        "url": "https://news.sky.com/story/migrant-with-ak-47-face-tattoo-found-guilty-of-threatening-to-kill-nigel-farage-13447937",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-nigel-farage-fayaz-khan_7047445.jpg?20251010181704",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-10 06:40:00",
        "Headline": "Fayaz Khan said he was coming to England and was going to \"pop, pop, pop\" Nigel Farage after the Reform leader posted a video of the Afghan national coming to the UK in a small boat.",
        "Content": " An Afghan migrant has been found guilty of threatening to kill Nigel Farage in a TikTok post. Fayaz Khan, 26, chose not to give evidence in his trial, in which he was accused of threatening the Reform UK leader between 12 and 15 October last year in a video on the social media platform. Mr Farage said the video was \"pretty chilling\". Jurors deliberated for 11 hours and 55 minutes before finding him guilty at Southwark Crown Court. They had been told Khan had a \"very large presence online\", with his TikTok videos amassing hundreds of thousands of views as he showed himself attempting to come to the UK by small boat last autumn. The Afghan national, who has an AK-47 tattoo on his right cheek and arm, live-streamed his journey across the English Channel from France in a small boat and was arrested on 31 October after arriving in the UK. He had been living in Stockholm, Sweden, since 2019. \n                  'Beaten for 16 days': Deported Afghans describe brutal treatment by Iran - yet are desperate to return\n                 \n                  Crying babies blighted by hunger fill this Afghanistan hospital - where parents fear each day might be the last\n                 \n                  Taliban says it will never hand over Bagram Air Base in Afghanistan to US\n                 Jurors were told that on 12 October last year, Mr Farage uploaded a YouTube video titled \"The journey of an illegal migrant\", which highlighted Khan and referenced \"young males of fighting age coming into our country about whom we know very little\". Khan responded with a video two days later in which he appeared to say: \"Englishman Nigel, don't talk s**t about me. \"You not know me. I come to England because I want to marry with your sister. You not know me. \"Don't talk about me more. Delete the video. \"I'm coming to England. I'm going to pop, pop, pop.\" He made gun gestures with his hand and headbutted the camera during the video, while pointing to the AK-47 tattoo on his face to \"emphasise he wasn't joking\", Mr Ratliff said. Mr Farage, who was at court for the trial, said the video was \"pretty chilling\". \"Given his proximity to guns and love of guns, I was genuinely worried,\" he said. \"He says he's coming to England and he's going to shoot me.\" A subsequent TikTok post by Khan read: \"I mean what I say\" on an image of a GB News report about the threat against Mr Farage. Other videos Khan posted on social media were shown to the jury in which he appeared to make \"pop, pop, pop\" noises and similar gun hand gestures. After his arrest, Khan told police in November last year: \"It was just a video, it was never an intention to threaten him. \"It was never my intention to kill him or anything - this is my character, this is how I act in my videos. \"In every video I make those sounds, I say 'pop, pop pop'.\" Prosecutor Peter Ratliff said the threat to kill was \"not some off-the-cuff comment\" and the video was \"sinister and menacing\". He said Khan, who denied the charge, was a \"dangerous man with an interest in firearms\" and who had an AK-47 tattooed on his arm and face. Defence lawyer Charles Royle said Khan was \"remonstrating in his own idiosyncratic, moronic, comedic, eye-catching, attention-seeking way\" rather than making a threat to kill in the TikTok video. He told jurors the trial was \"not about your views on illegal immigration, nor about your views on face tattoos, Brexit or Reform\". Discussing Khan's decision not to give evidence, Mr Royle said: \"You shouldn't hold any silence against him.\""
    },
    {
        "title": "Scottish First Minister John Swinney joins call for pause on new asylum arrivals in Glasgow",
        "description": "Scotland's First Minister John Swinney has told Sky News he agrees a pause has \"got to be put in place\" on new asylum seekers coming to Glasgow as the system becomes overwhelmed.",
        "url": "https://news.sky.com/story/scottish-first-minister-john-swinney-joins-call-for-pause-on-new-asylum-arrivals-13448188",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-john-swinney-connor-gillies_7047956.png?20251010174930",
        "type": "UK",
        "Author": "Connor Gillies",
        "Date Published": "2025-10-10 15:24:00",
        "Headline": "UK-wide figures show Glasgow was the local authority with the highest proportion of housed asylum seekers.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n  Scotland's First Minister John Swinney has told Sky News he agrees a pause has \"got to be put in place\" on new asylum seekers coming to Glasgow as the system becomes overwhelmed. The city is the frontline of the UK's immigration system, with more arrivals than anywhere else. Latest UK-wide figures show Glasgow was the local authority with the highest proportion of housed asylum seekers at 59 per 10,000 inhabitants (a total of 3,716). The UK Home Office is mass-processing asylum claims in order to try and clear a backlog built up over years. Once an asylum seeker is given the right to stay in the UK, they become a refugee and switch from being the responsibility of the Home Office to the local authority. The SNP leader was pressed repeatedly by Sky News on whether he supports calls from local leaders in Glasgow for a temporary halt on new arrivals coming to the city for them to catch up with demand. Speaking to Sky News ahead of the SNP conference in Aberdeen, Mr Swinney said Glasgow City Council's demand is a \"fair and reasonable approach\". \n                  Murderer jailed for attacking Glasgow man with 'napalm cocktail' before stabbing him in heart\n                 \n                  Less than half of Scots trust Scottish government to do right by country, report finds\n                 \n                  Douglas Ross urges MSPs to put party politics aside and back addiction recovery bill\n                 Read more from Sky News:Liam Gallagher and Wayne Rooney among stars at Ricky Hatton funeralMigrant with AK-47 face tattoo found guilty of threatening to kill Nigel Farage Problems coming together  While immigration is controlled by Westminster, housing and healthcare are among the issues dealt with by the Scottish government. Scotland's homelessness legislation means councils must house anyone without a home. It is a more generous policy than in England, where usually only those with \"priority need\" are given a roof over their head. With community tensions spiking and Glasgow council facing a £66m black hole, the city's leaders are demanding the Home Office pause relocations. Mr Swinney told Sky News: \"What the Home Office has got to with Glasgow is respond to their call for there to be more time given to enable the judgements around homelessness to be put in place.\" Pushed on whether he backs a pause in asylum arrives, Mr Swinney replied: \"That's not what the Home Office are proposing, and I think that has got to be put in place.\" He concluded he \"understands\" the demands facing Glasgow. Swinney denies his Govt is partly to blame The Daily Record reported this week the crisis was being made worse in Scotland by rising homeless applications from elsewhere in the UK, including London, Belfast and Birmingham. Asked by Sky News whether the SNP's more liberal laws of providing a home to anyone who declares themselves homeless, he replied: \"I think our homelessness approach is the right approach. \"Scotland has a long-established approach to the tackling of homelessness which we believe to be correct.\" He attributed blame for Glasgow's crisis to the Home Office. The Home Office has been approached for comment. Farage 'repulsive' In a wide-ranging interview, Mr Swinney was also asked about polling suggesting Nigel Farage's Reform UK party could be on course to form the official opposition at the Scottish Parliament elections next year. The SNP chief said he believes the Farage politics are \"repulsive\" and said \"some\" of his Scottish supporters are far right. Responding to Mr Swinney, Reform UK councillor Thomas Kerr said: \"John Swinney calls Reform UK 'repulsive' - but what's repulsive is a first minister who's more interested in sneering at voters than serving them. \"After years of SNP chaos, collapsing services, and broken promises, Scots are desperate for change.\" Russell Finlay, leader of the Scottish Conservatives, said it was a \"remarkable U-turn from John Swinney\". He said: \"Only this week his grandstanding SNP colleagues were brandishing my party racist and divisive for bringing the concerns of Scots about immigration to Holyrood.\""
    },
    {
        "title": "Brit becomes fourth UK EuroMillions ticket-holder this year to scoop jackpot",
        "description": "A single ticket-holder has become the winner of a &#163;25m EuroMillions jackpot, The National Lottery has announced.",
        "url": "https://news.sky.com/story/brit-becomes-fourth-uk-euromillions-ticket-holder-this-year-to-scoop-jackpot-13448424",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-lottery-ticket-euromillions_6640536.jpg?20241128141219",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-10 23:24:00",
        "Headline": "It is the fourth time this year that a UK ticket-holder has won the top prize - as Friday's draw numbers have made one lucky winner £25m richer.",
        "Content": "A single ticket-holder has become the winner of a £25m EuroMillions jackpot, The National Lottery has announced. It marks the fourth time this year that a UK ticket-holder has won the top prize - and the second Friday in a row. One lucky ticket-holder clinched the £26m jackpot last Friday, another player won £65m on Valentine's Day, and a third scooped £83m in January. Read more from Sky News:Trump threatens to impose additional 100% tariff on ChinaLiam Gallagher and Wayne Rooney among stars at Ricky Hatton funeral Andy Carter, senior winners' adviser at Allwyn, operator of The National Lottery, said: \"Wow, it's been an exciting night for EuroMillions players, as a single UK ticket-holder has landed the amazing £25m jackpot! \"That's two UK EuroMillions jackpot wins in the space of a week, after another lucky player scooped the incredible £26m jackpot in last Friday's draw (3 October).\" Players in the UK are being urged to check their tickets. The winning numbers for Friday night's draw were 06, 07, 17, 20 and 21 with the Lucky Star numbers 01 and 10."
    },
    {
        "title": "'The time is now': Plaid Cymru leader hits out at Labour and Reform in bid to lead Wales",
        "description": "Plaid Cymru leader Rhun ap Iorwerth insisted his party has the chance to change Wales at next May's election as he tries to break a century of Labour rule.",
        "url": "https://news.sky.com/story/the-time-is-now-plaid-cymru-leader-hits-out-at-labour-and-reform-in-bid-to-lead-wales-13448132",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rhun-ap-iorweth-wales_7047848.jpg?20251010151236",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-10 13:10:00",
        "Headline": "The leader of the Welsh nationalist party has attacked Reform and Labour, as he says he is ready to step up and lead Wales.",
        "Content": "Plaid Cymru leader Rhun ap Iorwerth insisted his party has the chance to change Wales at next May's election as he tries to break a century of Labour rule. Giving his keynote speech at the party's conference in Swansea, he said: \"Plaid Cymru is ready to lead. \"To the people of Wales, I say 'come with us'.\" Politics latest: Farage 'stunned' at guilty plea of former Welsh Reform leader for Russia bribes The former BBC journalist admitted it \"won't be an easy task\", but said voting for his Welsh nationalist party to replace Labour in the Senedd (Welsh parliament) next year would unleash Wales \"from its shackles\". Labour has been the largest party in Wales for more than 100 years, giving it the longest-winning streak of any democratically elected political party in the world. But as its popularity flounders, partly due to the Westminster government, Mr ap Iorwerth said Plaid Cymru, which means \"party of Wales\", is the only real option. \n                  'Bring it on': Left-wing activists gather for fight back against the right - and Labour\n                 \n                  Scottish First Minister John Swinney joins call for pause on new asylum arrivals in Glasgow\n                 \n                  Migrant with AK-47 face tattoo found guilty of threatening to kill Nigel Farage\n                 \"Labour's time is up,\" he said as he accused Wales' Labour first minister, Eluned Morgan, of failing to put the country first. Mr ap Iorwerth promised a vote for Plaid would mean \"no diktats from London or orders to obey\", in a dig at the Welsh Labour government. His party is currently polling at 30%, Reform at 29%, and Labour at 14% in Wales. Despite Plaid Cymru being built on wanting independence for Wales, Mr ap Iorwerth did not mention independence once. He earlier told Sky News this election is not the time, but that will come. The Plaid leader accused Labour of neglecting Wales and failing the Welsh people on issues such as steel, the NHS and child poverty. He portrayed Reform as a threat to Welsh devolution and public services, and accused Nigel Farage's party of promoting divisive, far-right politics and advocating for abolishing the Senedd. Reform are the new Conservatives, he added. \"Farage will feverishly pedal the feedback loop of fear and paranoia, but we can put a stop to that,\" he said. \"And together, we can usher in an age of new leadership that will set Wales on a different path.\" Trying to appeal to all Welsh voters, he said: \"If you've never voted for Plaid Cymru before, the time is now. \"The time is now to stop Reform and elect a government more radical, more ambitious, more impatient to bring about positive change than any which has gone before it. A government of progress and of progressive values.\" Read more:Plaid Cymru calls on Labour voters to unite behind Welsh nationalists He promised to take \"decisive action\" to change the NHS, and said his party will \"unleash our promised revolution in preventative health to create long-term wellbeing\" and \"reform our neglected social care sector\". And he said Plaid would \"bring not only the impetus of new leadership but a promise to make a difference to your life, wherever you live\". The Plaid Cymru leader made a key pledge to extend funded childcare hours to all parents with nursery-aged children. Currently in Wales, only parents who work (and neither earn more than £100,000) get 30 funded hours for children aged three and four over 48 weeks of the year. Some two-year-olds in disadvantaged areas also receive it. But Mr ap Iorwerth wants to give 20 hours of funded childcare to all parents, working or not, of children aged nine months to four years old. Plaid would keep the current 30-hour offering for working parents of three and four-year-olds. He said economic research found this would mean a 13% return on investment in early years education and claimed it would be the \"most generous government-funded childcare programme in the UK\". He told the conference: \"A helping hand with the things that matter the most. \"That's what a Plaid Cymru government will mean for you and your family.\" Since last month, working parents of nine-month-olds to four-year-olds in England have been eligible for 30 hours of funded childcare over 48 weeks of the year. Labour implemented it but it was the Conservative government that introduced the extension."
    },
    {
        "title": "Corbyn and Sultana friends again 'like the Gallagher brothers' as next steps for Your Party set out",
        "description": "Zarah Sultana and Jeremy Corbyn have reconciled \"like the Gallagher brothers\" and the show is \"back on the road\", a packed Your Party event has heard.",
        "url": "https://news.sky.com/story/corbyn-and-sultana-friends-again-like-the-gallagher-brothers-as-next-steps-for-your-party-set-out-13448213",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-corbyn-zarah-sultana_7047989.jpg?20251010182657",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-10-10 16:20:00",
        "Headline": "There's no looking back in anger for the co-leaders of Your Party, who have spent the past 48 hours putting on a show of unity after their falling out last month. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Zarah Sultana and Jeremy Corbyn have reconciled \"like the Gallagher brothers\" and the show is \"back on the road\", a packed Your Party event has heard. Speaking at The World Transformed (TWT) Conference in Manchester - the birthplace of Oasis - Ms Sultana said if the band's quarrelling brothers can get back together they can too. It comes after a nasty public row over Your Party's paid membership system threatened to upend the new venture before it began. Ms Sultana, speaking at a rally in Liverpool last night, said she was \"truly sorry\" for her part in the fiasco and told supporters gathered in its neighbouring city on Friday: \"You have all seen what's happened in the last few weeks, I am here to tell you the show is back on the road. \"I know that I'm in Manchester so I have to reference Liam and Noel Gallagher. If they can do it, of course me and Jeremy can.\" Ms Sultana, an LFC fan, went onto quip that the only difference between her and Mr Corbyn is that he \"thinks Arsenal are still going to win the Premier League, and we know that they will always come second place with a second-place trophy\". On Thursday night her apology struck a more serious tone as she said: \"Many of you have felt frustrated about the launch process... it was regrettable and for my part I am truly sorry\". \n                  Your Party announce conference - but the battle for its soul continues\n                 \n                  Zarah Sultana drops legal threat to reconcile with Jeremy Corbyn after row\n                 \n                  What is happening at Your Party? What we know about row between Corbyn and Sultana\n                 The row erupted last month after Ms Sultana unilaterally launched a membership portal which Mr Corbyn claimed was unauthorised. She then said she had been \"sidelined by a sexist boys club\" - referring to the alliance of independent MPs who support Your Party, and that she was consulting defamation lawyers. She later dropped that threat in order to pursue reconciliation - but the past 48 hours is the first time that has been put on public display. The charm offensive started with the rally in Liverpool's St George's Hall, with about 800 people in attendance, followed by a panel event at the left-wing TWT festival - which used to be affiliated with Labour but has broken ties over the direction of the party under Sir Keir Starmer. Read More:Left wing activists gather for fightback against the right - and Labour Asked if she still thinks there is sexism at the top of Your Party Ms Sultana told Sky News: \"As women we know there are misogynistic aspects of all society. It's important we address that, we are addressing that, and we are moving forward.\" Corbyn did not address the row over the two events but previously said the new party had faced some \"fraught days\" and \"we haven't covered ourselves in glory\". One supporter told Sky News they were feeling more confident in Your Party following the show of unity. Mira said: \"I've been really let down and depressed with what went down over the last few weeks and I am feeling hopeful again that they are putting aside all the nonsense and showing this is about something much bigger than them, a big working class party. \"There were no snide comments or individual posturing, it was real shared lines, it doesn't matter if they don't personally like each other, I just wanted to see them coming out and saying we are working together, we respect each other.\" What next for Your Party? With the hatchet buried - at least for now - the party must next hash out a set of policies and processes for fielding candidates so it can be ready to fight the local elections in May. Local branches are in the process of being set up across the country by volunteers, with next steps expected to be formally agreed at the founding conference at the end of November. Mr Corbyn said he would like to see the branches hold at least one public event a month to discuss local campaigns and stay \"1,000% relevant all the time\". While members will have a say on policy, the co-leaders also gave some indications of their red lines. Withdrawal from NATO Ms Sultana said Your Party would be \"anti-imperialist\" and withdraw from NATO - which goes further than Mr Corbyn's 2019 Labour manifesto. Mr Corbyn has always been personally critical of NATO, but as Labour leader the party's position was to stay in the alliance. The duo both expressed strong support for trans rights, saying \"trans rights are human rights\". One MP in the independent alliance which supports Your Party, Adnan Hussain, faced a backlash on social media last month when he said women's rights and safe spaces \"should not be encroached upon\" and \"safe third spaces should be an alternative option\". He added that trans women are \"not biologically women, hence trans women\". Mr Hussain insisted it was an issue prospective members had been asking the party about, but it put him at odds with what the co-leaders have previously said, raising questions as to what the party's official position would be. Ms Sultana and Mr Corbyn were adamant that this is a socialist progressive party, saying they would stand for \"peace, justice, economic equality and opposing racism\". 'Labour split the left not us'  Another question the party faces is whether it could fragment the left vote and allow Reform UK to win, given the rise of the Greens under Zack Polanski and independent MPs. Ms Sultana today said it today that if that happened, it was the fault of Labour for moving \"so far to the right while dancing to Nigel Farage's tune\". She drew dividing lines with Your Party and the Greens on the question of whether they should form an alliance, saying the Greens are \"not explicitly socialist, they say NATO has a role to play\". Mr Corbyn said there were some things he didn't agree on with Mr Polanski but under the First Past the Post system, alliances were necessary. \"There may be points where sometimes we don't agree with the Greens,\" he said. \"So we have our identity, we have our principles, and we have our position, but we're anxious to make progress in our society, and that will mean working with a lot of different people - nothing wrong in that.\" But Mr Polanski, for his part, suggested he would rather see the Your Party co-leaders join him than work together, telling Sky News during his party conference last week: \"My door is always open to Jeremy Corbyn and Zarah Sultana. I'd love them to be Green Party members...my relentless focus is on growing the Green Party.\""
    },
    {
        "title": "PPE Medpro partners open to settlement over £122m COVID gowns contract breach",
        "description": "Partners of a company linked to Baroness Michelle Mone have said they are open to a possible settlement with the government after the company was found to have breached a &#163;122m PPE contract.",
        "url": "https://news.sky.com/story/ppe-medpro-partners-open-to-settlement-over-163122m-covid-gowns-contract-breach-13448341",
        "image_url": "https://e3.365dm.com/22/12/1920x1080/skynews-michelle-mone-house-of-lords_5988249.jpg?20231218074541",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-10 20:11:00",
        "Headline": "PPE Medpro, linked to Tory peer Baroness Michelle Mone, filed to enter administration earlier this month.",
        "Content": "Partners of a company linked to Baroness Michelle Mone have said they are open to a possible settlement with the government after the company was found to have breached a £122m PPE contract. The Department of Health and Social Care (DHSC) had accused PPE Medpro of providing 25 million \"faulty\", non-sterile gowns during the COVID pandemic. The High Court ruled earlier this month that it must pay back a £121.9m sum, the price of the gowns. PPE Medpro, a consortium led by Lady Mone's husband Doug Barrowman, filed to enter administration earlier this month. In a statement on Friday, Mr Barrowman said: \"The consortium partners of PPE Medpro are prepared to enter into a dialogue with the administrators of the company to discuss a possible settlement with the government.\" PPE Medpro has spent £4.3m defending its position. It said offers to settle on a no-fault basis had been made, including the remake of 25 million gowns, or a £23m cash equivalent, which were rejected. \n                  Baroness Mone: I have no wish to rejoin Lords as Conservative peer\n                 \n                  Michelle Mone says she won't step down as Tory peer - and accuses chancellor of 'endangering' her \n                 \n                  Baroness Mone should resign from Lords, senior Tory says, after order to pay back £122m over COVID PPE\n                  The consortium was awarded government contracts by the former Conservative administration to supply personal protective equipment (PPE) during the pandemic after Lady Mone recommended it to ministers. It insists that it provided all 25 million gowns and disputes that the gowns were not sterile. It is understood the partners want to resolve the issue, and administrators have been urged to approach the government to reach an agreement.  Read more:Can PPE Medpro afford to pay back govt?Baroness Mone: I have no wish to rejoin LordsBaroness Mone 'should resign' from Lords In the High Court ruling, Mrs Justice Cockerill said the gowns \"were not, contractually speaking, sterile, or properly validated as being sterile\". This meant they could not be used in the NHS. Barristers for PPE Medro claimed it had been \"singled out for unfair treatment\" and accused the government of \"buyer's remorse\". It claimed the gowns had become defective because of the conditions they were kept in after being delivered. It also said the court made its ruling on a technicality. Lady Mone branded the judgement a win for the \"establishment\", while Mr Barrowman said it was a \"travesty of justice\". Baroness Mone, who created the lingerie brand Ultimo, was made a Conservative peer in 2015. She now says she has \"no wish to return\" to the House of Lords."
    },
    {
        "title": "Prince Harry and Meghan named Humanitarians of the Year",
        "description": "The Duke and Duchess of Sussex have been named Humanitarians of the Year for their charity work.&#160;",
        "url": "https://news.sky.com/story/prince-harry-and-meghan-named-humanitarians-of-the-year-13447972",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-harry-meghan_7047632.jpg?20251010111304",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-10 08:25:00",
        "Headline": "The couple were presented with the award at the Project Healthy Minds gala in New York, where they highlighted the potential dangers of social media for young people.",
        "Content": "The Duke and Duchess of Sussex have been named Humanitarians of the Year for their charity work.  Prince Harry and Meghan were presented with the award at the Project Healthy Minds gala, which aims to bring together champions of mental health, in New York on Thursday. Accepting the award on stage, the couple used the moment to speak about the potential dangers social media can pose for young people, which Harry described as \"one of the most pressing issues of our time\". The couple have spoken regularly about the potential harms of social media, and the fears they have for their two children. It comes after the pair's Archewell Foundation - a non-profit they launched in 2020 - announced that its Parents' Network support group initiative is joining forces with ParentsTogether, a non-profit organisation dedicated to family advocacy and online safety. 'A pivotal moment... to protect children' Speaking on Thursday, Harry said 4,000 families are currently taking legal action through the Social Media Victims Law Centre, having lost their children to social media. He said: \"Parents who have learned legal action is possible, who have the capacity to pursue it while grieving, and parents who've found their way to help in the fightback against some of the wealthiest, most powerful corporations in the world. \"And even after this, there may be no road to closure for grieving parents because these companies refuse to disclose their child's information and activity on their platforms. \"This is a pivotal moment in our collective mission to protect children and support families in the digital age.\" He went on to hit out at the \"explosion\" of unregulated artificial intelligence (AI), saying both he and Meghan have seen the \"full scope\" of what the technology can do. Meghan added that the couple often discuss how they would protect their own children, six-year-old Archie and four-year-old Lili, as they grow older. \"Like so many parents, we think constantly about how to embrace technology's benefits while safeguarding against its dangers,\" she said. \"That hopeful intention of separation is rapidly becoming impossible.\"  In April, Harry and Meghan also called for tougher action to protect children from the potential harms of social media. While helping to unveil a temporary memorial to young people who have died after being exposed to online content, in New York, the duke said in a statement: \"These children were not sick. Their deaths were not inevitable - they were exposed to, and in many cases were pushed harmful content online, the kind any child could encounter. \"No child should be exploited, groomed, or preyed upon in digital spaces. To the platforms, they may be seen as statistics. To their families, they were cherished and irreplaceable.\" Since stepping down as working royals in 2020, Harry and Meghan have been awarded various accolades, including a civil rights award from the NAACP and the Robert F Kennedy Human Rights Ripple of Hope Award, both in 2022. Both are involved with various charities, but in recent months, some of those that work with Prince Harry have made headlines. Read more:Harry and the King have private tea in first meeting for 19 monthsHarry talks of sibling 'challenge' On Wednesday, the non-profit organisation African Parks, which is partially run by Prince Harry, had its mandate for managing wildlife reserves in Chad removed by the country's government, after being accused of a lack of investment in wildlife reserves, and not doing enough to stop poaching. In August, the duke dramatically stepped down as patron from Sentebale - a charity established in 2006 to help children and young people in southern Africa, particularly those with HIV and AIDS - following a dispute with the charity's chairperson Dr Sophie Chandauk."
    },
    {
        "title": "Donald Trump threatens to impose additional 100% tariff on 'extraordinarily aggressive' China",
        "description": "Donald Trump has announced the US will impose an additional 100% tariff on China imports, accusing it of taking an \"extraordinarily aggressive position\" on trade.",
        "url": "https://news.sky.com/story/donald-trump-threatens-to-impose-additional-100-tariff-on-extraordinarily-aggressive-china-13448404",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-us-president_7047359.jpg?20251010044418",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-10 20:57:00",
        "Headline": "President Trump warned the additional tariffs would begin on 1 November.",
        "Content": "Donald Trump has announced the US will impose an additional 100% tariff on China imports, accusing it of taking an \"extraordinarily aggressive position\" on trade. In a post to his Truth Social platform on Friday, the US president said Beijing had sent an \"extremely hostile letter to the world\" and imposed \"large-scale export controls on virtually every product they make\". Mr Trump, who warned the additional tariffs would start on 1 November, said the US would also impose export controls on all critical software to China. The president added that he was imposing the tariffs because of export controls placed on rare earths by China. He wrote: \"Based on the fact that China has taken this unprecedented position, and speaking only for the USA, and not other nations who were similarly threatened, starting November 1st, 2025 (or sooner, depending on any further actions or changes taken by China), the United States of America will impose a tariff of 100% on China, over and above any tariff that they are currently paying. \"It is impossible to believe that China would have taken such an action, but they have, and the rest is history. Thank you for your attention to this matter!\" Mr Trump said earlier on Friday that there \"seems to be no reason\" to meet with Chinese leader Xi Jinping in a scheduled meeting as part of an upcoming trip to South Korea at the end of this month. \n                  Starmer denies ministers involved in China spy trial collapse\n                 \n                  China tightens control of global rare-earth supply chain ahead of Trump talks\n                 \n                  The blame game over China spy trial collapse - who is right and who is wrong?\n                 He had posted: \"I was to meet President Xi in two weeks, at APEC, in South Korea, but now there seems no reason to do so.\" Read more:China tightens control of global rare earth supplyThree things you may have missed from China this week The trip was scheduled to include a stop in Malaysia, which is hosting the Association of Southeast Asian Nations summit, a stop in Japan and then the stop to South Korea, where Mr Trump would meet Mr Xi ahead of the Asia-Pacific Economic Cooperation summit. Mr Trump added: \"There are many other countermeasures that are, likewise, under serious consideration.\" The move signalled the biggest rupture in relations in six months between Beijing and Washington - the world's biggestfactory and its biggest consumer. It also threatens to escalate tensions between the two countries, prompting fears over the stability of the global economy.  Friday was Wall Street's worst day since April, with the S&P 500 falling 2.7%, owing to fears about US-China relations. China had restricted the access to rare earths ahead of the meeting between Presidents Trump and Xi. Under the restrictions, Beijing would require foreign companies to get special approval for shipping the metallic elements abroad."
    },
    {
        "title": "Hamas official thanks Donald Trump for ceasefire deal - but tells Sky News Tony Blair not welcome",
        "description": "A senior Hamas official has thanked President Donald Trump for his role in securing a ceasefire deal between Israel and Hamas.",
        "url": "https://news.sky.com/story/hamas-official-thanks-donald-trump-for-peace-deal-but-warns-tony-blair-not-welcome-13448166",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-gaza-palestinians-israel_7047582.jpg?20251010172522",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-10 14:26:00",
        "Headline": "Dr Basem Naim said Hamas would be willing to step aside for a Palestinian body to govern a post-war Gaza, but that they would remain \"on the ground\" and would not be disarmed.",
        "Content": " A senior Hamas official has thanked President Donald Trump for his role in securing a ceasefire deal between Israel and Hamas. In an exclusive interview with Sky News' lead world news presenter Yalda Hakim, senior Hamas official Dr Basem Naim also warned that former UK Prime Minister Sir Tony Blair would not be welcome in any post-war role for Gaza. Latest updates: Palestinians head back north - as Israel pulls troops back Israel and Hamas have agreed to a first phase of a peace deal brokered by the US president, with a ceasefire taking effect on Friday. Dr Naim said the ceasefire would not have been possible without President Trump, but insisted he needed to continue to apply pressure to Israel to stick to the agreement. He added that Hamas would be willing to step aside for a Palestinian body to govern a post-war Gaza, but that they would remain \"on the ground\" and would not be disarmed. Dr Naim said in the interview: \"Without the personal interference of President Trump in this case, I don't think that it would have happened to have reached the end of the war. \n                  Could the Gaza deal lead to something even bigger?\n                 \n                  How withdrawal of Israeli troops in Gaza could work - and who could make up peacekeeping force\n                 \n                  Palestine Action ban must be explained, Labour peer tells Starmer\n                 \"Therefore, yes, we thank President Trump and his personal efforts to interfere and to pressure Israel to bring an end to this massacre and slaughtering.\" 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 He added: \"We believe and we hope that President Trump will continue to interfere personally and to exercise the maximum pressure on [Israeli Prime Minister Benjamin] Netanyahu to fulfil its obligation. \"First, as according to the deal, and second, according to the international law as an occupying power, because I think without this pressure, without this personal interference from President Trump, this will not happen. \"We have already seen Netanyahu speaking to the media, threatening to go to war again if this doesn't happen, if that doesn't happen.\" Questions remain over the next phases of the peace plan, including who will govern Gaza as Israeli troops gradually pull back and whether Hamas will disarm - as called for in Mr Trump's ceasefire plan. Mr Netanyahu has hinted that Israel might renew its offensive if Hamas does not give up its weapons. However, Dr Naim said Hamas would not completely disarm and that weapons would only be handed over to the Palestinian state, with fighters integrated into the Palestinian National Army. \"No one has the right to deny us the right to resist the occupation of armies,\" he said.  On future governance, Dr Naim criticised plans for Sir Tony to play any role in overseeing the future of Gaza, saying that Hamas and Palestinians were angered by his role in previous wars in Afghanistan and Iraq. Dr Naim added: \"When it comes to Tony Blair, unfortunately, we Palestinians, Arabs and Muslims and maybe others around the world have bad memories of him. \"We can still remember his role in killing, causing thousands or millions of deaths to innocent civilians in Afghanistan and Iraq. \"We can still remember him very well after destroying Iraq and Afghanistan.\" Under Mr Trump's plans, Sir Tony would form part of an international supervisory body. The international body, the Council of Peace or Board of Peace, would govern under plans approved by Mr Netanyahu. Read more:How withdrawal of Israeli troops in Gaza could workCould the Gaza deal lead to something even bigger? The body would hold most power while overseeing the administration of Palestinian technocrats running day-to-day affairs. It would also hold the commanding role of directing reconstruction in Gaza. Dr Naim added that Hamas was satisfied Mr Trump's plan would achieve peace in Gaza. But he said it could never be fully satisfied after accusing Israel of genocide. Israel has continually denied this, claiming it has been fighting Hamas terrorists to defend itself following the October 7 massacre in 2023."
    },
    {
        "title": "'Terror cannot beat us': Nova Music Festival founders on surviving October 7 - and their hopes for peace",
        "description": "In the exhibition room of Berlin's old Tempelhof Airport, three burned-out cars lie on their sides.",
        "url": "https://news.sky.com/story/terror-cannot-beat-us-nova-music-festival-founders-on-surviving-october-7-and-their-hopes-for-peace-13448416",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-7-october-tempelhof_7048142.jpg?20251010224247",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-10-10 23:01:00",
        "Headline": "Two years on from the October 7 Hamas attacks, Ofir Amir and Omri Sasi recall how they very nearly died and what their hopes are for the future.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n In the exhibition room of Berlin's old Tempelhof Airport, three burned-out cars lie on their sides. The windows, interiors and paintwork are gone; all that remains are lumps of twisted and rusted metal. Next to them is a rough circle of tents and scattered mats. A picnic chair has toppled over on one, others are strewn with abandoned bags, camping equipment and discarded fairy lights. \"Everything you see here is original from the festival on October 7th,\" Ofir Amir explains. He's referring to the Nova Music Festival, where around 400 people were murdered on 7 October 2023. In the week where peace finally feels like a possibility, Ofir is remembering those killed in a massacre that sparked the latest conflict. All around us are tables of abandoned items left behind in the panic. One displays clothes; another is filled with shoes. \n                  Berlin school evacuated as children suffer breathing difficulties amid 'irritant gas', police say\n                 \n                  Man arrested over stabbing at Berlin Holocaust memorial is 19-year-old Syrian refugee\n                 \n                  Suspect arrested after man seriously injured in 'stabbing' at Berlin Holocaust memorial\n                 All of them are reminders of a day, Ofir, who was a co-founder of the festival, nearly didn't survive. \"When the terrorists came to the festival area, we saw them just shooting into the crowd that was running away from them,\" he tells me. Ofir and his friends managed to jump into a car and started to drive away, but they were cornered by Hamas militants who opened fire. One of their friends died, and Ofir was shot in both legs. He remembers he was on the phone to his wife, who was nine months pregnant at the time. 'How will my wife raise a child alone' \"This was all I could ever think about,\" he says, \"that I might not come home, and how will my wife raise a child alone.\" Ofir's friends used what they could to stop the bleeding and managed to keep him alive until help came. The memorial exhibition was created in memory of those who died. It's already opened in cities including New York and Toronto, but on the second anniversary of the October 7 attacks, the exhibition began its first European show in Berlin. \"With so much hate going on, so much antisemitism everywhere on the streets, all over the world, it's important to show the world and give them a reminder when you go so blindly and follow hate, what the outcome can be,\" Ofir says. Omri Sasi, also a co-founder and DJ at the Nova Music Festival, was in the car with Ofir when they were hit. He picks out faces from a long line of photos which cover one wall. 'They were murdered together' \"This is my uncle, Avi Sasi. This is Alex Luke, my friend from Montreal... they were murdered together,\" he says. Beside them are the photos of Omri's pregnant cousin and her husband, who were also killed. Despite their losses, Omri and Ofir say they don't want the exhibition to focus on religion or politics but to help spread peace. However, the memorial event has faced some opposition; for example, several hundred demonstrators protested against Israel at the exhibit in New York. In Los Angeles, Omri says a pro-Palestinian group also gathered outside the show. He invited them in, and they talked about the ongoing conflict in the Middle East. 'We cried together' \"We cried together, we hugged each other and we understood that the best way to deal with this war is to talk,\" he says. \"Not to fight and not hit people.\" More than 60,000 Gazans have died in the Israel-Hamas war, according to the Hamas-run Gaza health ministry. Omri tells me he has friends in Gaza, that he wants the ceasefire to hold, and Gazans \"to have a good life\" - but he's also deeply concerned by the rise in antisemitism he's seen in the last two years. \"People are scared,\" he says. \"Even when I go out here in Berlin, I look around myself and I try to not speak in Hebrew, and this is sad. \"It doesn't need to be like this.\" Authorities across Europe have warned about growing hate and violence against Jewish people since the October 7 attack. The fatal synagogue attack in Manchester has added to the fear. This week, Germany's domestic intelligence chief said antisemitism had increased with sometimes open calls for attacks on Jewish institutions, while the country's chancellor denounced the trend as \"shameful\". At the Berlin exhibition, Liora Furema says she's worried about her safety as a Jewish student when she goes to university or to the synagogue. \"At any Jewish event, I think about my security,\" she explained. It's hoped the ceasefire will be the beginning of the end of the war in Gaza, but the fear of antisemitism remains. Rather than deepening the divisions, the organisers say the show is a reminder of the dangers of allowing hate to flourish. They now are focusing on healing. \"Our message is, we will dance again,\" says Omri. \"Whatever happened to us, we are standing and dancing again. Terror cannot beat us.\""
    },
    {
        "title": "Could the Gaza deal lead to something even bigger?",
        "description": "This is a historic moment for the Middle East. The coming days will be crucial.&#160;",
        "url": "https://news.sky.com/story/could-the-gaza-deal-lead-to-something-even-bigger-13448174",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-palestinians-gaza-israel_7047708.jpg?20251010161153",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-10-10 14:46:00",
        "Headline": "It will require an enormous amount of political will and leadership but there is a chance, however slim, of remaking the region in a way which gives its people a better future.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n This is a historic moment for the Middle East. The coming days will be crucial.  Critical for the immediate success of Donald Trump's ceasefire plan. But also for hopes it could lead to something even more important, progress towards a broader peace. There is plenty that could still go wrong. But so far so good. Follow the latest updates on the Gaza ceasefire deal  Hamas seems ready to give up its hostages believing American assurances Israel will not start the war again when they have. And Israel is withdrawing its forces on the lines outlined in the deal. If the deal does hold then what next? \n                  Hamas official thanks Donald Trump for ceasefire deal - but tells Sky News Tony Blair not welcome\n                 \n                  How withdrawal of Israeli troops in Gaza could work - and who could make up peacekeeping force\n                 \n                  Palestine Action ban must be explained, Labour peer tells Starmer\n                 Here are the most pressing questions. What becomes of Hamas? It is meant to disarm and not be part of any future government in Gaza. What if it goes back on that? What if it retreats to the shadows, regroups and rearms and goes back to its old ways? Then, who is going to keep the peace? The plan is for an international peacekeeping force overseen by the Americans but not involving US troops on the ground, using soldiers from Arab countries and Turkey instead. Will that force materialise and will it be effective? The history of peacekeeping operations in the region is not an encouraging one. Then how is Gaza going to be run? There's been talk of a government of technocrats, people who know how to get things done, and of an oversight board run by President Trump, and of Tony Blair coming in as governor. It will be a massive task. Rebuilding Gaza will cost billions of dollars and at the moment plans seem vague at best. It could all come unstuck. But then again, there are reasons for some optimism. Could this breakthrough lead to more sustained progress in efforts to build a lasting peace? October 7th and the events that followed it including the Gaza war have changed so much in the Middle East. Events have laid bare the utter futility of the past. Read more: How withdrawal of Israeli troops in Gaza could workHow two years of war have shattered the Gaza Strip  Israel's policy of dividing and ruling the Palestinians and weakening them so they could never form their own state has ended in tragedy and colossal failure. Hamas has brought its people nothing but misery and carnage. There is on both sides a yearning for a new start. There is also an American president who is prepared to put massive pressure on Israel unlike his predecessors and who is hungry for peace. The region is lining up to push the chances of peace. President Trump has galvanised the likes of Turkey, Egypt and nations in the gulf. In Israel there may be a fresh start. Its hardline right-wing government might have to give way to new leaders with new ideas. And the country most likely to wreck the chances of progress, Iran, is massively weakened, pummelled by Israeli air power, and its allies and proxies humbled. We should not over-egg the chances of further progress. In this rough neighbourhood there is always a multitude of reasons why this multi-stage deal might still fall apart, let alone lead to a much bigger peace. But there is a chance now. The past two years have broken up the Middle East and so many of its old rules of operating. Putting it back together offers an opportunity. It will require a huge amount of political will and leadership but there is the chance however slim of remaking the region in a way that gives its people a better future."
    },
    {
        "title": "Emmanuel Macron reappoints Sebastien Lecornu as prime minister - four days after he quit",
        "description": "French President Emmanuel Macron has reappointed Sebastien Lecornu as prime minister.",
        "url": "https://news.sky.com/story/macron-reappoints-lecornu-as-prime-minister-four-days-after-he-quit-13448343",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sebastien-lecornu-france_7043764.jpg?20251006100611",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-10 20:04:00",
        "Headline": "Far-right and hard-left party leaders have said they will not support the surprise reappointment ",
        "Content": "French President Emmanuel Macron has reappointed Sebastien Lecornu as prime minister. Mr Lecornu resigned from the post four days ago just hours after he appointed a cabinet - and after political rivals threatened to topple his government. Macron's office said in a statement on Friday that he has now been tasked with forming a new cabinet.  After the announcement on Friday evening, Mr Lecornu said it was \"my duty to accept the mission entrusted to me by the president\" and \"to respond to the everyday problems of our compatriots\". He added: \"We need to put an end to this political crisis, which is exasperating the French people, and to this instability, which is bad for France's image and its interests.\" Mr Lecornu also said that whoever joined his government would have to renounce their personal ambitions to succeed Macron in 2027, and pledged his cabinet would \"embody renewal and diversity\". He will first work on attempting to deliver a budget by the end of Monday, as economists in Europe have previously warned that the EU's second-largest economy faces a Greek-style debt crisis. \n                  Emmanuel Macron under pressure to call parliamentary elections after French prime minister resigns\n                 \n                  Who are the seven prime ministers who have served under France's Emmanuel Macron?\n                 \n                  Police fire tear gas at protesters during day of strikes in France\n                 The reappointment was scoffed at by political rivals. Jordan Bardella, president of France's far-right National Rally party, said he would vote down the new government, claiming \"the Elysee Palace, is a bad joke, a democratic disgrace and a humiliation for the French people\". Party leader Marine Le Pen said: \"All the political parties that helped Emmanuel Macron gain the time he needed to implement this shameful manipulation will be held to account at the next elections.\" Read more from Sky News:Nineteen missing after explosion at Tennessee munitions plantHow withdrawal of Israeli troops in Gaza could workNobel Peace Prize winner named - and it's not Trump Europe correspondent On Monday morning, Sebastian Lecornu resigned as Prime Minister of France. On Friday, he was reappointed. \n\n Another turbulent week of French politics has ended where it began. Lecornu's dramatic and unexpected departure at the start of the week left his ally Emmanuel Macron looking weakened, perhaps terminally.   Calls for the President to step down weren't just louder, they were more credible after he lost his fifth prime minister in a little over two years. Macron was desperate. Former allies started turning on him, suggesting publicly that it was now time for him to step aside.  The president went for a walk along the Seine by himself and decided to ask his prodigy to try again. Lecornu had 48 hours to resolve differences and calm the markets – he succeeded.  Compromises must have been made; we don’t know what, but presumably, he has agreed to a watered-down budget that he will now have to present by Monday. It won't be popular, but it might just be popular enough to get through.  France's economy needs some brutal belt-tightening, but first it needs a stable government, and Lecornu has prioritised that. And so he will now begin his second term as France’s prime minister, only four days after he ended his first term and so became the shortest serving prime minister in the history of the Fifth Republic.  He will need to last longer this time otherwise it might not just be his political career over - Macron will struggle to survive another debacle.  Mathilde Panot, head of the hard-left France Unbowed party, also said that \"never before has a President wanted so much to govern by disgust and anger\". \"Lecornu, who resigned on Monday, was reappointed by Macron on Friday,\" she added. \"Macron miserably postpones the inevitable: his departure.\" Stephane Troussel of the Socialist Party called the latest announcement \"a farce in which Emmanuel Macron is theprotagonist. A bad joke for millions of citizens who expect change and hope for the future\". He added: \"They can rest assured that this President's reign will soon be coming to an end.\" Earlier on Friday, Mr Macron convened a meeting of mainstream party leaders to gather support around his reappointment of Mr Lecornu. The president's entourage said Lecornu had \"carte blanche\", a sign Mr Macron was leaving his prime minister wiggle room to negotiate a cabinet and budget. His return to the role marks the eighth prime minister of Mr Macron's tenure as president, and the fifth appointment in barely a year. His predecessor, Francois Bayrou, was appointed in December last year and was ousted after losing a confidence vote by an overwhelming 364-194 in September."
    },
    {
        "title": "Tennessee: 19 people missing after explosion at military munitions plant",
        "description": "Nineteen people are missing feared dead following a devastating explosion at a Tennessee military munitions plant.",
        "url": "https://news.sky.com/story/tennessee-multiple-people-killed-and-others-missing-after-explosion-at-military-munitions-plant-13448218",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-tennessee-hickman-county_7047970.jpg?20251010180025",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-10 16:35:00",
        "Headline": "The blast, which people reported hearing and feeling miles away, occurred at Accurate Energetic Systems, in rural Tennessee. ",
        "Content": " Nineteen people are missing feared dead following a devastating explosion at a Tennessee military munitions plant. Humphreys County Sheriff Chris Davis told a press conference that there were fatalities following the blast but could not provide a specific number, saying it was still possible some employees had survived. \"We do have 19 souls we are looking for,\" said Davis. When asked to describe the building where the blast occurred at Accurate Energetic Systems, a company that makes and tests explosives about 60 miles southwest of Nashville, Davis replied, \"There's nothing to describe. It's gone.\" The cause of the blast, which occurred at 7.45am on Friday (1.45pm in the UK), was not immediately known. Video from the scene showed flames and smoke billowing from a field of debris. Emergency crews were initially unable to enter the Tennessee plant because of continuing explosions, Hickman County Advanced MT David Stewart said. \n                  Trump sends National Guard into Memphis, and hints Chicago is next\n                 \n                  Child killer becomes first to be executed with defibrillator fitted\n                 \n                  Tennessee: Man tries to detonate 14 explosive devices while being arrested\n                 Residents in Lobelville, a 20-minute drive from the scene, told the Associated Press that they felt their homes shake and some people captured the loud boom of the explosion on their home cameras. Gentry Stover, who was woken from his sleep by the blast, said: \"I thought the house had collapsed with me inside of it. \"I live very close to Accurate and I realised about 30 seconds after I woke up that it had to have been that.\" Read more from Sky News:Hamas official tells Sky News Tony Blair not welcomeLiam Gallagher and Wayne Rooney among stars at Ricky Hatton funeralThomas Tuchel criticises England fans after Wales win According to its website, Accurate Energetic Systems manufactures products for the defence, aerospace, demolition, and oil and gas industries."
    },
    {
        "title": "Venezuela opposition leader Maria Corina Machado named Nobel Peace Prize winner",
        "description": "Venezuelan opposition leader and pro-democracy campaigner Maria Corina Machado has won the Nobel Peace Prize.",
        "url": "https://news.sky.com/story/nobel-peace-prize-winner-named-as-donald-trump-misses-out-on-award-13447657",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-maria-corina-machado_7047548.jpg?20251010123810",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-10 09:00:00",
        "Headline": "Organisers of the prestigious prize say the 58-year-old's show of courage by staying in her country despite threats has inspired millions.",
        "Content": " Venezuelan opposition leader and pro-democracy campaigner Maria Corina Machado has won the Nobel Peace Prize. The committee praised her for her \"tireless work promoting democratic rights... and for her struggle to achieve a just and peaceful transition from dictatorship to democracy\". It said she had resisted death threats and been forced into hiding in her fight against President Nicolas Maduro - widely considered a dictator. \"When authoritarians seize power, it is crucial to recognise courageous defenders of freedom who rise and resist,\" Nobel added. The committee said Ms Machado had stayed in Venezuela despite personal risk, calling it a \"choice that has inspired millions of people\". \"Democracy depends on people who refuse to stay silent, who dare to step forward despite grave risk,\" it said. Read more: Who is Maria Corina Machado? There was speculation Donald Trump had an outside chance despite nominations closing less then two weeks after he started his second term. The president claims he has stopped seven wars since then - an assertion widely disputed - and last month said \"everyone says that I should get the Nobel Peace Prize\". Israeli Prime Minister Benjamin Netanyahu also put the president's name forward for the award in July. The White House criticised the Nobel committee's decision on Friday. \"President Trump will continue making peace deals, ending wars, and saving lives. He has the heart of a humanitarian, and there will never be anyone like him who can move mountains with the sheer force of his will,\" spokesman Steven Cheung said in a post on X. \"The Nobel Committee proved they place politics over peace.\"  Nina Graeger, director of the Peace Research Institute Oslo, told Sky News if Mr Trump's Gaza peace deal leads to \"a lasting and sustainable peace... the committee would almost certainly have to take that into serious consideration in next year's deliberations\". 'Extraordinary example of courage' Ms Machado, 58, was lauded by the Nobel committee as \"one of the most extraordinary examples of civilian courage in Latin America in recent times\". Writing on X after her win was announced, she said: \"This immense recognition of the struggle of all Venezuelans is an impetus to conclude our task: to conquer Freedom. \"We are on the threshold of victory and today more than ever we count on President Trump, the people of the United States, the peoples of Latin America, and the democratic nations of the world as our main allies to achieve Freedom and democracy. Venezuela will be free!\" Her candidacy for last year's election was blocked by the Maduro regime but she backed Edmundo Gonzalez, the leader of another party. Opposition groups organised hundreds of thousands of volunteers to observe voting, despite risks to their safety, and ensured tallies were recorded \"before the regime could destroy ballots and lie about the outcome\", added the Nobel committee. President Maduro, who has been in power since 2013, claimed a third term despite exit polls pointing to a decisive opposition win. He said his re-election was a triumph of peace and stability and claimed the electoral system was transparent. Ms Machado disputed the result and said Edmundo Gonzalez had recorded an \"overwhelming\" victory. The country's highest court upheld the result - but the United Nations said it wasn't impartial or independent. Antony Blinken, the US secretary of state at the time, said America had \"serious concerns\", while the UK said it was \"concerned by allegations of serious irregularities in the counting\". Nobel said Ms Machado first stood up for free and fair elections more than 20 years ago, when she called for \"ballots over bullets\", and had campaigned on issues such as judicial independence and human rights. A Nobel video on social media recorded her reaction on the other end of the line when she got the call telling her she had won. \"Oh my God... I have no words,\" she said. \"I thank you so much, but I hope you understand this is a movement, this is an achievement of a whole society. I am just one person. I certainly do not deserve it,\" she added. It's currently unclear whether she will be able to travel to Norway for the official ceremony on 10 December. Europe correspondent As the announcement about who would win this year's Nobel Peace Prize grew closer, one voice rose above the rest. Donald Trump has made no bones about the fact he would like to win the prize. More than that, he's said repeatedly that he deserves to win the accolade for the seven conflicts he claims to have ended.  Ahead of today's announcement, the White House said he had received seven nominations.  But as is so often the case, the spin ignores the facts. The deadline for nominations for this year's award was at the end of January. That meant Donald Trump had just 11 days in office to prove he was deserving. Love him or hate him, that's a challenge for anyone. In terms of the nominations he did receive, many of them were announced after the deadline.  Unfortunately, under Nobel Peace Prize rules we will have to wait 50 years to officially find out if he was among the 338 nominees. In his will, founder Alfred Nobel stated the winner should be \"the person who shall have done the most or the best work for fraternity between nations and the abolition or reduction of standing armies and the formation and spreading of peace congresses\". Trump's critics point to the strikes on Iran's nuclear sites, the blowing up of \"narco\" boats in the Caribbean and even tariffs as doing more to sow division than unity. His immigration raids and his deployment of National Guard troops onto some of the country's streets have also been divisive domestically.  While Venezuela's Maria Corina Machado scooped the 2025 award, all is not lost for the US president; if his 20-point peace plan helps lead to a lasting ceasefire he could well be in the running next year.   Read more from Sky News:Tsunami warnings after earthquake in the PhilippinesMore than 450 drones attack Ukraine energy sites - Zelenskyy The committee painted a bleak picture of Ms Machado's home country, saying many in Venezuela - which has the world's largest oil reserves - live in serious poverty after it went from a \"relatively democratic and prosperous country to a brutal, authoritarian state\". \"The violent machinery of the state is directed against the country's own citizens,\" it said, noting about eight million people had left the country - many of them heading north to try to enter America."
    },
    {
        "title": "Will the ceasefire between Israel and Hamas last?",
        "description": "<a href=' https://podfollow.com/the-world-with-richard-and-yalda'>👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈</a> ",
        "url": "https://news.sky.com/story/will-the-ceasefire-between-israel-and-hamas-last-13448099",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-sky-news-nbc-news-podcast_6696060.jpg?20241002120922",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-10 12:24:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈  Will Hamas agree to disarm? Will the bodies of all the hostages in Gaza be recovered? Will Israel keep up its side of the ceasefire deal?  In this bonus episode of The World podcast, Richard and Yalda are recording from Jerusalem, reviewing the last few days. Live on air, Yalda got a text from a source inside the negotiating room who gave her the heads up an agreement was coming sooner than expected. The two of them discuss the deal, and crucially, what will happen next. They also answer some of your questions. You can also watch the podcast on our YouTube channel here. To get in touch or to share your questions, email theworld@sky.uk Share your thoughts on the podcast by filling out our short survey here."
    },
    {
        "title": "How withdrawal of Israeli troops in Gaza could work - and who could make up peacekeeping force",
        "description": "Israeli forces are unlikely to move further out of Gaza for some time, according to Sky News' military analyst, as he said there's still \"huge ambiguity\" surrounding the ceasefire deal.",
        "url": "https://news.sky.com/story/how-withdrawal-of-israeli-troops-in-gaza-could-work-and-who-could-make-up-peacekeeping-force-13448075",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-idf-withdrawal_7047750.jpg?20251010131435",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-10 14:06:00",
        "Headline": "Sky News' military analyst Professor Michael Clarke said: \"We don't want to damn it [ceasefire deal] with expectations to start with, let's hope for the best, but most ceasefires are hardest to maintain in the first two or three weeks.\"",
        "Content": " Israeli forces are unlikely to move further out of Gaza for some time, according to Sky News' military analyst, as he said there's still \"huge ambiguity\" surrounding the ceasefire deal. Speaking as a ceasefire to end the war in Gaza took effect on Friday, Professor Michael Clarke said skirmishes between the warring parties are likely, as Israel has made it \"very clear\" that any seemingly threatening actions would be met with a response. Latest updates: Palestinians head back north - as Israel pulls troops back Israel and Hamas on Thursday agreed to a first phase of a peace deal brokered by US President Donald Trump, and which aims to bring the two-year conflict to an end. Under the agreement, Hamas have 72 hours to release all hostages, alive or dead, now the initial withdrawal of Israeli troops to the yellow line has been confirmed. But Israeli Prime Minister Benjamin Netanyahu on Friday also confirmed that Israel's troops will remain in Gaza to keep up the pressure on Hamas until the group disarms - something the militant group is \"fairly determined\" not to do, Professor Clarke said. The analyst said \"the initial withdrawal line, which still leaves them [IDF] in control of 50% of the Gaza Strip\" was the \"easy one to agree to\". \"In theory, they would then move back to another line which would give them only a smaller amount of territory,\" he said, before Israeli troops move to a buffer zone at a later stage. But Professor Clarke said: \"I don't think they are going to get much beyond that first line, that yellow line, for some time.\" 'Huge ambiguity' Referencing issues with the 20-point peace plan, Professor Clarke said: \"The nearer we get down to points 18-19-20, the further away they begin to look. \"Netanyahu is making it pretty clear he doesn't intend to enter into negotiations with the Palestinian Authority about a two-state solution, he spent 20 years of his life ruling out a two-state solution but that's what the 20 points imply, so he is not going to go that far. \"So there's a huge ambiguity about that.\"  Speaking of Hamas appearing resolved not to disarm or leave Gaza, Professor Clarke said: \"They calculate, I think, that President Trump will be so anxious to keep this thing alive that he will tolerate that, just as he will tolerate the fact that Israelis don't really want to enter into any long-term, formal negotiation.\" Who could make up a peacekeeping force?  \"We still have no idea who is going to provide, say, a brigade of troops, I mean 5,000 troops, to move into Gaza and sit in the middle of a very volatile ceasefire,\" Professor Clarke said, adding: \"No one wants to do that.\" He said the \"best possibilities\" would be Turkish or Egyptian troops but they would need \"quite a lot of inducements\". Speaking of the risks facing any forces which get deployed to Gaza, Professor Clarke said: \"The danger is that if things start to go wrong, they will look as if they are helping the IDF to suppress guerrilla groups of Hamas, or they will just become a sort of shooting gallery for Hamas people and then the IDF might overreact. \"It's a miserable situation for anybody and only the most disciplined troops can do it and nobody wants to do it so the US will have to lean on and induce quite heavily whoever is going to be part of this stabilisation force.\" Data journalist The Israeli military has completed its initial withdrawal, less than 24 hours after the Israeli cabinet ratified the ceasefire deal. This initial withdrawal saw the IDF pull back from Gaza’s major population centres, to an agreed perimeter ranging from 1.5km to 6.5km from the Israeli border. Sky News analysis of satellite imagery over the past two weeks shows that this withdrawal line closely matches the position of the IDF’s active ground bases in the Gaza Strip. \n\n Out of 40 observed bases active since late September, only four sit beyond the line of withdrawal and will therefore need to be vacated.  The remaining 90% will be allowed to remain in place. As the initial withdrawal is now completed, Hamas has 72 hours to complete the handover of all remaining hostages. Further negotiations are then expected to lead to a further withdrawal, though the timeline for this is less clear. He added: \"We don't want to damn it [ceasefire deal] with expectations to start with, let's hope for the best, but most ceasefires are hardest to maintain in the first two or three weeks\"."
    },
    {
        "title": "Melania Trump: Eight children 'displaced' by war in Ukraine have been reunited with families",
        "description": "Melania Trump has said eight children displaced by the Russia-Ukraine war have been reunited with their families following ongoing talks with Vladimir Putin.",
        "url": "https://news.sky.com/story/melania-trump-eight-ukrainian-children-taken-into-russia-have-been-reunited-with-families-13448191",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-melania-trump-first-lady_7047914.jpg?20251010164516",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-10 15:28:00",
        "Headline": "The US First Lady said Vladimir Putin had responded to her letter and they have established a \"channel of communication\".",
        "Content": "Melania Trump has said eight children displaced by the Russia-Ukraine war have been reunited with their families following ongoing talks with Vladimir Putin. In August, the First Lady wrote a letter to the Russian president, and her husband hand-delivered it during his meeting with Putin in Alaska in August. The invasion of Ukraine has seen thousands of children being taken out of their country by Russia. In June, the Humanitarian Research Lab at Yale University estimated that more than 35,000 had been taken to over 100 locations in Russia and occupied territories. Speaking to reporters at the White House on Friday, Mrs Trump said that Putin responded to her letter and that they have established an \"open channel of communication\" regarding the welfare of those children. She said: \"We have agreed to co-operate with each other for the benefit of all people involved in this war.\"  In 2023, the International Criminal Court issued an arrest warrant for Putin for war crimes, accusing him of personal responsibility for the abductions of children from Ukraine. At the time, the Kremlin said that Russia found the questions raised by the ICC \"outrageous and unacceptable\". \n                  Donald Trump threatens to impose additional 100% tariff on 'extraordinarily aggressive' China\n                 \n                  Hamas official thanks Donald Trump for ceasefire deal - but tells Sky News Tony Blair not welcome\n                 \n                  Gaza latest: Tens of thousands of Palestinians head back north - as Israel pulls troops back\n                 They added the warrants are \"null and void\" as Russia does not recognise the ICC and has not signed up to the Rome Statutes - the treaty underpinning the world's permanent war crimes tribunal. It comes as US President Donald Trump's efforts to end Russia's war on Ukraine have stalled, despite meeting with Mr Putin in Alaska earlier this year. Read more on the war in Ukraine:Blackouts and water outages as hundreds of drones target Ukraine's energyZelenskyy's UN speech was a warning - he knows Trump can turn on a dimeWhy does Trump think he deserved the Nobel Peace Prize? Since the summit in August, Mr Trump has said the US was prepared to impose energy sanctions against Russia - but only if all NATO countries stop buying Russian oil and implement similar measures. Also on Friday, Mr Putin warned that if the US president agrees to provide Tomahawk cruise missiles to Ukraine, Russia will respond by boosting its air defences."
    },
    {
        "title": "Donald Trump threatens to impose additional 100% tariff on 'extraordinarily aggressive' China",
        "description": "Donald Trump has announced the US will impose an additional 100% tariff on China imports, accusing it of taking an \"extraordinarily aggressive position\" on trade.",
        "url": "https://news.sky.com/story/donald-trump-threatens-to-impose-additional-100-tariff-on-extraordinarily-aggressive-china-13448404",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-us-president_7047359.jpg?20251010044418",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-10 20:57:00",
        "Headline": "President Trump warned the additional tariffs would begin on 1 November.",
        "Content": "Donald Trump has announced the US will impose an additional 100% tariff on China imports, accusing it of taking an \"extraordinarily aggressive position\" on trade. In a post to his Truth Social platform on Friday, the US president said Beijing had sent an \"extremely hostile letter to the world\" and imposed \"large-scale export controls on virtually every product they make\". Mr Trump, who warned the additional tariffs would start on 1 November, said the US would also impose export controls on all critical software to China. The president added that he was imposing the tariffs because of export controls placed on rare earths by China. He wrote: \"Based on the fact that China has taken this unprecedented position, and speaking only for the USA, and not other nations who were similarly threatened, starting November 1st, 2025 (or sooner, depending on any further actions or changes taken by China), the United States of America will impose a tariff of 100% on China, over and above any tariff that they are currently paying. \"It is impossible to believe that China would have taken such an action, but they have, and the rest is history. Thank you for your attention to this matter!\" Mr Trump said earlier on Friday that there \"seems to be no reason\" to meet with Chinese leader Xi Jinping in a scheduled meeting as part of an upcoming trip to South Korea at the end of this month. \n                  Starmer denies ministers involved in China spy trial collapse\n                 \n                  China tightens control of global rare-earth supply chain ahead of Trump talks\n                 \n                  The blame game over China spy trial collapse - who is right and who is wrong?\n                 He had posted: \"I was to meet President Xi in two weeks, at APEC, in South Korea, but now there seems no reason to do so.\" Read more:China tightens control of global rare earth supplyThree things you may have missed from China this week The trip was scheduled to include a stop in Malaysia, which is hosting the Association of Southeast Asian Nations summit, a stop in Japan and then the stop to South Korea, where Mr Trump would meet Mr Xi ahead of the Asia-Pacific Economic Cooperation summit. Mr Trump added: \"There are many other countermeasures that are, likewise, under serious consideration.\" The move signalled the biggest rupture in relations in six months between Beijing and Washington - the world's biggestfactory and its biggest consumer. It also threatens to escalate tensions between the two countries, prompting fears over the stability of the global economy.  Friday was Wall Street's worst day since April, with the S&P 500 falling 2.7%, owing to fears about US-China relations. China had restricted the access to rare earths ahead of the meeting between Presidents Trump and Xi. Under the restrictions, Beijing would require foreign companies to get special approval for shipping the metallic elements abroad."
    },
    {
        "title": "Tennessee: 19 people missing after explosion at military munitions plant",
        "description": "Nineteen people are missing feared dead following a devastating explosion at a Tennessee military munitions plant.",
        "url": "https://news.sky.com/story/tennessee-multiple-people-killed-and-others-missing-after-explosion-at-military-munitions-plant-13448218",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-tennessee-hickman-county_7047970.jpg?20251010180025",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-10 16:35:00",
        "Headline": "The blast, which people reported hearing and feeling miles away, occurred at Accurate Energetic Systems, in rural Tennessee. ",
        "Content": " Nineteen people are missing feared dead following a devastating explosion at a Tennessee military munitions plant. Humphreys County Sheriff Chris Davis told a press conference that there were fatalities following the blast but could not provide a specific number, saying it was still possible some employees had survived. \"We do have 19 souls we are looking for,\" said Davis. When asked to describe the building where the blast occurred at Accurate Energetic Systems, a company that makes and tests explosives about 60 miles southwest of Nashville, Davis replied, \"There's nothing to describe. It's gone.\" The cause of the blast, which occurred at 7.45am on Friday (1.45pm in the UK), was not immediately known. Video from the scene showed flames and smoke billowing from a field of debris. Emergency crews were initially unable to enter the Tennessee plant because of continuing explosions, Hickman County Advanced MT David Stewart said. \n                  Trump sends National Guard into Memphis, and hints Chicago is next\n                 \n                  Child killer becomes first to be executed with defibrillator fitted\n                 \n                  Tennessee: Man tries to detonate 14 explosive devices while being arrested\n                 Residents in Lobelville, a 20-minute drive from the scene, told the Associated Press that they felt their homes shake and some people captured the loud boom of the explosion on their home cameras. Gentry Stover, who was woken from his sleep by the blast, said: \"I thought the house had collapsed with me inside of it. \"I live very close to Accurate and I realised about 30 seconds after I woke up that it had to have been that.\" Read more from Sky News:Hamas official tells Sky News Tony Blair not welcomeLiam Gallagher and Wayne Rooney among stars at Ricky Hatton funeralThomas Tuchel criticises England fans after Wales win According to its website, Accurate Energetic Systems manufactures products for the defence, aerospace, demolition, and oil and gas industries."
    },
    {
        "title": "Letitia James indicted for fraud after Donald Trump demanded case against New York attorney general",
        "description": "Letitia James - New York attorney general and long-time critic of Donald Trump - has been indicted for fraud.",
        "url": "https://news.sky.com/story/letitia-james-indicted-for-fraud-after-donald-trump-demanded-case-against-new-york-attorney-general-13447924",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-letitia-james-new-york-attorney_7047456.jpg?20251010082742",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-10 06:21:00",
        "Headline": "The Democrat, who has clashed with the US president and sued him and his administration dozens of times, is accused of lying on a mortgage application.",
        "Content": "Letitia James - New York attorney general and long-time critic of Donald Trump - has been indicted for fraud. Ms James, a Democrat, was charged on Thursday with one count of bank fraud and one count of making false statements to a financial institution, in connection with a home she purchased in Norfolk, Virginia, in 2020. The 66-year-old could face up to 30 years in prison and up to a $1m (£752m) fine on each count if convicted, according to Sky's US partner network NBC News. Mr Trump has been advocating charging Ms James for months, posting on social media without citing any evidence that she's \"guilty as hell\" and telling reporters at the White House: \"It looks to me like she's really guilty of something, but I really don't know.\" In a lengthy statement, Ms James vehemently denied any wrongdoing and described the indictment as \"nothing more than a continuation of the president's desperate weaponisation of our justice system\". She said: \"These charges are baseless, and the president's own public statements make clear that his only goal is political retribution at any cost.\" The indictment was presented to a grand jury by Lindsey Halligan, the newly appointed attorney for the Eastern District of Virginia. Ms Halligan, who has previously worked as a lawyer for Mr Trump, replaced veteran prosecutor Erik Siebert, who had resisted filing charges against Ms James and former FBI director James Comey, who was charged with lying to Congress two weeks ago. The indictment pertains to Ms James's purchase of a house in Norfolk, where she has family. During the sale, she allegedly signed a document called a \"second home rider\" in which she agreed to keep the property primarily for her \"personal use and enjoyment for at least one year\". However, the indictment claims she instead rented it out to a family of three. According to the indictment, the misrepresentation allowed Ms James to obtain favourable loan terms that are not available for investment properties. History of Trump and James Ms James's indictment is the latest indication that the Trump administration is determined to use the powers of the justice department to target the president's political and public figure foes. In a statement on Truth Social last month, Mr Trump called on US Attorney General Pam Bondi, who leads the department, to prosecute his political opponents. \"We can't delay any longer, it's killing our reputation and credibility. They impeached me twice, and indicted me (5 times!), OVER NOTHING. JUSTICE MUST BE SERVED, NOW!!!\" Trump wrote. Ms James is a particularly personal target of Mr Trump. During the president's first term in office, she sued him and his administration dozens of times. Last year, she won a staggering judgment against the Trump Organization after she brought a civil lawsuit alleging he and his companies defrauded banks by overstating the value of his real estate holdings on financial statements. An appeals court later overturned a hefty fine Mr Trump was ordered to pay, but upheld a lower court's finding that he had committed fraud. What happens now? Ms James is scheduled to make an initial appearance in the federal court in Norfolk on 24 October. The case has been assigned to US District Judge Jamar K Walker, who was appointed by Joe Biden. The standard for securing an indictment before a federal grand jury is much lower than securing a unanimous conviction by a jury at trial, NBC reported. The Justice Manual, which guides federal prosecutors, says attorneys for the government should move forward on a case only if they believe the admissible evidence - evidence that is allowed to be presented in a court of law - would be enough to obtain and sustain a conviction."
    },
    {
        "title": "Drake's defamation lawsuit over Kendrick Lamar's Not Like Us dismissed by judge",
        "description": "Drake's defamation lawsuit over Kendrick Lamar's diss track Not Like Us has been dismissed by a federal judge.",
        "url": "https://news.sky.com/story/drakes-defamation-lawsuit-over-kendrick-lamars-not-like-us-dismissed-by-judge-13448020",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-drake-kendrick-lamar_6801109.jpg?20250116124340",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-10 09:29:00",
        "Headline": "In the rap battle between the pair, which saw them hurl personal insults at each other, the judge called Not Like Us \"the metaphorical killing blow\".",
        "Content": "Drake's defamation lawsuit over Kendrick Lamar's diss track Not Like Us has been dismissed by a federal judge. Judge Jeannette A Vargas said Lamar's lyrics accusing Drake of being a paedophile were not defamatory because they were \"nonactionable opinion\". The Canadian rapper had sued Universal Music Group (UMG) - which releases both artists' music - and Lamar was not named in the lawsuit. In a written opinion published on Thursday, the judge described \"the vitriolic war of words\" that erupted in spring 2024 as \"perhaps the most infamous rap battle in the genre's history\". The feud led to nine tracks back and forth between the two hip-hop stars, with the insults escalating as the tracks progressed, becoming \"vicious, personal\". Other insults included shoe size, fashion sense and cuckolding. The battle concluded with Lamar's Not Like Us, which the judge described as \"the metaphorical killing blow\". One of 2024's biggest songs, it won record of the year and song of the year at the Grammys, achieved most Apple Music streams worldwide, and helped make the 2025 Super Bowl half-time show the most-watched ever. However, the judge said a reasonable listener could not have concluded that the track was conveying objective facts about Drake. She wrote: \"Although the accusation that Plaintiff is a paedophile is certainly a serious one, the broader context of a heated rap battle, with incendiary language and offensive accusations hurled by both participants, would not incline the reasonable listener to believe that 'Not Like Us' imparts verifiable facts about Plaintiff.\" The judge said she considered the forum in which the insults occurred and concluded that the average listener does not think a diss track \"is the product of a thoughtful or disinterested investigation, conveying to the public fact-checked verifiable content\". She wrote Not Like Us was \"replete with profanity, trash-talking, threats of violence, and figurative and hyperbolic language, all of which are indicia of opinion\". A reasonable listener, she added, \"would conclude that Lamar is rapping hyperbolic vituperations\". The lawsuit, which was filed in January, alleged that UMG intentionally published and promoted the track despite knowing that it contained false and defamatory paedophilia allegations against Drake and suggested listeners should resort to vigilante justice. The song's cover art included an aerial image of Drake's Toronto mansion, which he said led to attempted break-ins and the shooting of a security guard. The lawsuit also alleged the track tarnished Drake's reputation and decreased the value of his brand. UMG had denied the allegations, calling the lawsuit \"an affront to all artists and their creative expression\" and one which it said \"never should have seen the light of day\". It said it was \"pleased with the court's dismissal\" and looked forward to continuing its work with Drake in the future. Drake is yet to comment."
    },
    {
        "title": "Melania Trump: Eight children 'displaced' by war in Ukraine have been reunited with families",
        "description": "Melania Trump has said eight children displaced by the Russia-Ukraine war have been reunited with their families following ongoing talks with Vladimir Putin.",
        "url": "https://news.sky.com/story/melania-trump-eight-ukrainian-children-taken-into-russia-have-been-reunited-with-families-13448191",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-melania-trump-first-lady_7047914.jpg?20251010164516",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-10 15:28:00",
        "Headline": "The US First Lady said Vladimir Putin had responded to her letter and they have established a \"channel of communication\".",
        "Content": "Melania Trump has said eight children displaced by the Russia-Ukraine war have been reunited with their families following ongoing talks with Vladimir Putin. In August, the First Lady wrote a letter to the Russian president, and her husband hand-delivered it during his meeting with Putin in Alaska in August. The invasion of Ukraine has seen thousands of children being taken out of their country by Russia. In June, the Humanitarian Research Lab at Yale University estimated that more than 35,000 had been taken to over 100 locations in Russia and occupied territories. Speaking to reporters at the White House on Friday, Mrs Trump said that Putin responded to her letter and that they have established an \"open channel of communication\" regarding the welfare of those children. She said: \"We have agreed to co-operate with each other for the benefit of all people involved in this war.\"  In 2023, the International Criminal Court issued an arrest warrant for Putin for war crimes, accusing him of personal responsibility for the abductions of children from Ukraine. At the time, the Kremlin said that Russia found the questions raised by the ICC \"outrageous and unacceptable\". \n                  Donald Trump threatens to impose additional 100% tariff on 'extraordinarily aggressive' China\n                 \n                  Hamas official thanks Donald Trump for ceasefire deal - but tells Sky News Tony Blair not welcome\n                 \n                  Gaza latest: Tens of thousands of Palestinians head back north - as Israel pulls troops back\n                 They added the warrants are \"null and void\" as Russia does not recognise the ICC and has not signed up to the Rome Statutes - the treaty underpinning the world's permanent war crimes tribunal. It comes as US President Donald Trump's efforts to end Russia's war on Ukraine have stalled, despite meeting with Mr Putin in Alaska earlier this year. Read more on the war in Ukraine:Blackouts and water outages as hundreds of drones target Ukraine's energyZelenskyy's UN speech was a warning - he knows Trump can turn on a dimeWhy does Trump think he deserved the Nobel Peace Prize? Since the summit in August, Mr Trump has said the US was prepared to impose energy sanctions against Russia - but only if all NATO countries stop buying Russian oil and implement similar measures. Also on Friday, Mr Putin warned that if the US president agrees to provide Tomahawk cruise missiles to Ukraine, Russia will respond by boosting its air defences."
    },
    {
        "title": "Google warns against 'onerous regulations' after UK competition ruling",
        "description": "Google has warned the UK against imposing \"onerous\" and costly regulations after the competition watchdog ruled it had \"strategic market status\" for its search services.",
        "url": "https://news.sky.com/story/google-warns-against-onerous-regulations-after-uk-competition-ruling-13448009",
        "image_url": "https://e3.365dm.com/23/02/1920x1080/skynews-google-tech-search_6051496.jpg?20230209103812",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-10 09:16:00",
        "Headline": "The CMA is to begin consultations on possible remedies before the year is out but it can expect Google to argue furiously that regulation risks an act of self harm.",
        "Content": "Google has warned the UK against imposing \"onerous\" and costly regulations after the competition watchdog ruled it had \"strategic market status\" for its search services. The Competition and Markets Authority (CMA) said legal tests had been met to designate Google with the status in general search and search advertising services due to \"substantial and entrenched market power\", with more than 90% of searches in the UK taking place on its platform. The designation gives the CMA greater control on how Google operates its UK services. The regulator said the Alphabet-owned firm's Gemini AI assistant was not in the scope of the designation but other AI functionality, including AI Overviews, were. Money latest: National insurance rumour prompting landlords to act It launched the inquiry in January after new powers came into force and had previously flagged the finding in a provisional decision. The CMA said the legislation allowed proportionate action to \"improve competition in digital markets, helping to drive innovation, investment and growth across the UK economy\". \n                  Money blog: The petrol myth - why a common tip just isn't true\n                 \n                  Discord hack shows risks of online age checks as internet policing hopes put to the test\n                 \n                  The best places to buy used tech - but go armed with these do's and don'ts\n                 It added that it would begin consultations on possible remedies soon. What could happen? These could include demanding changes to its search engine in the UK, including through so-called \"choice screens\", and giving publishers more power. Any action could risk a row with the government, as ministers seek a \"growth first\" agenda within the country's regulatory bodies. Will Hayter, executive director for digital markets at the CMA, said: \"By promoting competition in digital markets like search and search advertising we can unlock opportunities for businesses big and small to support innovation and growth, driving investment across the UK economy. \"We have found that Google maintains a strategic position in the search and search advertising sector - with more than 90% of searches in the UK taking place on its platform.\" Google responded by arguing that the designation risked unintended consequences such as price rises and hits to innovation and growth. Read more from Sky News:Hack of popular messaging app shows risks of online age checksCustomers of five water firms facing higher than expected bill hikes  Its senior director for competition, Oliver Bethell, said: \"The UK enjoys access to the latest products and services before other countries because it has so far avoided costly restrictions on popular services, such as search. \"Retaining this position means avoiding unduly onerous regulations and learning from the negative results seen in other jurisdictions, which have cost businesses an estimated 114 billion euros (£99.2 billion). \"Many of the ideas for interventions that have been raised in this process would inhibit UK innovation and growth, potentially slowing product launches at a time of profound AI-based innovation. \"Others pose direct harm to businesses, with some warning that they may be forced to raise prices for customers.\""
    },
    {
        "title": "The best places to buy used tech - but go armed with these do's and don'ts",
        "description": "A major survey has shed some light on the best places to buy second-hand tech.",
        "url": "https://news.sky.com/story/the-best-places-to-buy-used-tech-but-go-armed-with-these-dos-and-donts-13448086",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-phone-tech-money_7047736.jpg?20251010131517",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-10 11:41:00",
        "Headline": "If you want to protect both the planet and your wallet, this handy guide is for you.",
        "Content": "A major survey has shed some light on the best places to buy second-hand tech. Which? - who we've teamed up with to tell you some do's and don'ts later in this post - asked 2,495 people to share their experiences of buying preloved smartphones, laptops, tablets and smartwatches from 18 shops. Here are the scores based on customer service, product range and availability, product quality, accuracy of descriptions, communicating, delivery, amount of original packaging, ease of website and value for money... \"We were pleasantly surprised by the results - 10 retailers received a customer score of 80% or more,\" said Which. For an idea of how much you could save, Which? offered these examples... Which? tech expert Andrew Laughlin told the Money blog: \"Not only is buying second-hand tech better for the planet, it can also be substantially better for your wallet with hundreds of pounds to be saved compared to buying new. \"It's important to go into it with eyes wide open. Buying from a reputable source, checking how long software updates will last and choosing a refurbished device with at least 80% battery health will ensure you're not left disappointed.\" \n                  How to set your baby up to be a millionaire\n                 \n                  Savings guide: The accounts that will help you beat inflation\n                 \n                  Savings guide: Beat inflation with these savings accounts of all shades and make your money go further\n                 We've teamed up with Which? to bring you these essential do's and don'ts... Do - Check software update support periods One of the most important things to consider when buying a second-hand or refurbished phone is how long the device will be supported with security updates. Apple iPhones tend to receive security updates from the manufacturer for at least five or six years from the phone's launch. For Android phones, this can vary from two to eight years. Once a phone stops receiving crucial security updates, it'll be more vulnerable to attacks from data-grabbing hackers. Do - Wait until after new product launches There's usually an influx of last-generation products to second-hand retailers shortly after a new launch, as people sell old devices to raise money for the new model. Do - Buy from Reputable Sellers Stick to trusted sources and avoid random sellers or unverified marketplaces. Do - Check the returns policy You have 14 days to notify the store that you want to return an item, and a further 14 days to actually return it. But for peace of mind, it's worth checking if there is an extended returns period, and what the shop's faulty goods policy is. Don't - Buy a device with less than 80% battery health Batteries degrade over time; ideally, refurbished devices should have a new or certified battery with at least 80-90% health. Don't - Ignore the grading system Every second-hand device has had a different first life, which means you're not guaranteed a specific level of performance. Refurbished items are often labelled Grade A, B or C (or similar): Don't - Confuse \"refurbished\" with second-hand Refurbished phones, usually sold by manufacturers or retailers, often come with warranties and have been professionally repaired or inspected, while second-hand phones are typically sold by previous owners and may not include warranties. Refurbished phones should look 'as new' or be graded by quality, so you know what condition the phone will be in before you buy. The price of a refurbished phone is often higher than a second-hand one, because the phone will (in theory) have been checked over by professionals to ensure it's in top working order and in good physical condition. You should also get a guarantee or warranty of some sort, as refurbished phones are usually sold by a professional retailer. Don't - Assume accessories are included Refurbished products may not include original accessories or packaging. Verify whether a charger, cable, or stylus is included. Don't - Forget to perform thorough checks Carry out these checks in the shop, or as soon as you get your hands on your second-hand device, to make sure it's working as it should and matches what you expected based on the grading and description. Second-hand devices usually come with a warranty of 12-24 months, which should cover technical faults. If anything on your tech isn't working as it should, contact the retailer for a replacement, repair or refund. Don't - Assume you'll be insured If you've taken out dedicated insurance cover for gadgets, check the T&Cs carefully, some gadget policies won't cover refurbished phones."
    },
    {
        "title": "Rishi Sunak hired as a senior adviser by Microsoft - but given stern warning",
        "description": "Former PM Rishi Sunak has been hired by tech giant  Microsoft.",
        "url": "https://news.sky.com/story/rishi-sunak-hired-as-a-senior-adviser-by-microsoft-but-given-stern-warning-13447999",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sunak-rishi_7047616.jpg?20251010105548",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-10 09:09:00",
        "Headline": "Acoba, the watchdog that assesses external jobs for MPs, has said Sunak will not be advising on UK policy matters.",
        "Content": "Former PM Rishi Sunak has been hired by tech giant  Microsoft. The ex-Tory leader, who remains an MP in parliament, has joined the Seattle-based tech firm as a paid part-time senior adviser and will give the company \"high-level strategic perspectives on macro-economic and geopolitical trends\" as well as how these \"intersect with innovation, regulation and digital transformation\". He will be donating his salary to his and his wife, Akshata Murty's, numeracy skills charity, The Richmond Project. Acoba, the watchdog that assesses external jobs for MPs, has said Sunak will not be advising on UK policy matters.  The Advisory Committee on Business Appointments has in the past been accused of being toothless and unable to prevent MPs from taking employment that could cause a conflict of interest, or allow former parliamentarians to use contacts made in government for personal use. Sunak was prime minister between October 2022 and July 2024. It was thought he could be eyeing a job in Silicon Valley, California, after his general election defeat. \n                  New 'AI you can trust' for when safety matters\n                 \n                  Bank of England warns of 'sharp correction' for markets if AI bubble bursts - and IMF agrees\n                 \n                  Robin Williams's daughter begs people to stop sending her AI videos of her father\n                 But in his final prime minister's questions appearance as Conservative leader, Sunak vowed to spend more time \"in the greatest place on Earth\", referring to his Richmond and Northallerton constituency.  He added: \"If anyone needs me, I will be in Yorkshire.\" Acoba has warned Sunak that he shouldn't provide advice to or on behalf of Microsoft on government work or its contracts until later next year. Read more on Sky News:AI 'distorting women online'Pros and cons of digital IDsImpact of new online safety rules The former chancellor has also been asked not to lobby the government or make use of his Whitehall contacts during that time, and to limit his work to \"providing advice on strategy, macro-economic and geopolitical matters that do not conflict\" with his activities in Number 10. The Cabinet Office told the watchdog that Sunak's year on the Tory backbenches \"will have helped to diminish the salience and currency of the information\" he had access to. Sunak has also taken on a role at San Francisco-based Anthropic, which developed the Claude artificial intelligence (AI) models. He has also become a senior adviser to Goldman Sachs since leaving office, where he previously worked between 2001 and 2004."
    },
    {
        "title": "Exponent on alert to buy UK arm of alarm company ADT",
        "description": "The private equity firm Exponent is among a pack of suitors weighing a takeover of the UK arm of ADT, one of Britain&#8217;s biggest suppliers of residential security systems.",
        "url": "https://news.sky.com/story/exponent-on-alert-to-buy-uk-arm-of-alarm-company-adt-13448003",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-adt-security_7047585.png?20251010103357",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-10 09:14:00",
        "Headline": "The buyout firm which owns The Racing Post is among the potential bidders for the British division of burglar alarms installer ADT, which could fetch in the region of £150m, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The private equity firm Exponent is among a pack of suitors weighing a takeover of the UK arm of ADT, one of Britain’s biggest suppliers of residential security systems. Sky News has learnt that Exponent, which has owned companies including Ambassador Theatre Group, Big Bus Tours and the publisher of the Racing Post newspaper, is considering buying the business from US owner Johnson Controls International (JCI). The auction of the UK arm, which is being handled by bankers at Citi, has drawn interest from a number of private equity bidders, according to City sources. Money latest: National insurance rumour prompting landlords to act  One insider said the UK division, which is one of the biggest players in the British market, could fetch in the region of £150m. Other parts of ADT's international operations are also being sold off by JCI. In June, the company announced the disposal of its unit in Mexico to Verisure, the security systems group which this month went public in Stockholm. \n                  Google warns against 'onerous regulations' after UK competition ruling\n                 \n                  Money blog: The petrol myth - why a common tip just isn't true\n                 \n                  Discord hack shows risks of online age checks as internet policing hopes put to the test\n                 Verisure raised roughly £3bn from a share sale as part of the deal. ADT's international operations are owned separately to its US business, which is part of New York-listed ADT. Founded as American District Telegraph in 1874, ADT is one of the oldest private security brands in the world. Exponent declined to comment."
    },
    {
        "title": "'Bring it on': Left-wing activists gather for fight back against the right - and Labour",
        "description": "The World Transformed, a left-wing political festival, has historically ran alongside the Labour Party Conference as an unofficial fringe event.",
        "url": "https://news.sky.com/story/bring-it-on-left-wing-activists-gather-for-fight-back-against-the-right-and-labour-13447228",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-corbyn-sultana-polanski_7047135.png?20251009191248",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-10-10 07:00:00",
        "Headline": "Zack Polanski, Jeremy Corbyn and Zarah Sultana will headline a left-wing festival in Manchester this weekend - as progressive voters look for an alternative to Labour.  ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n The World Transformed, a left-wing political festival, has historically ran alongside the Labour Party Conference as an unofficial fringe event. But a lot has changed since it began in 2016, organised then by the Corbyn-backed group Momentum. And like the former Labour leader himself, TWT has gone independent. From Thursday to Sunday, a programme of politics, arts and cultural events will be held in Manchester, a week after Labour's annual party gathering ended. \"It no longer made any sense to be a fringe festival of the Labour conference,\" Hope Worsdale, an organiser since 2018, tells Sky News. \"We need a space for the independent left to come together.\" This decision was made before the formation of Your Party in July and the surge of support behind the Greens and its new leader Zack Polanski, but both these factors have given TWT some extra momentum. Organisers say it is not just a festival, but a \"statement of intent from the British left\" - and a left that looks different from how it used to. Previous headline speakers were Labour MPs in the left-wing Socialist Campaign Group, and in 2021, the showstopper was American democrat  Bernie Sanders calling in live for an event alongside John McDonnell. This year, Mr Polanski, Jeremy Corbyn and Zarah Sultana are the only British politicians due to speak at events - though Brian Leishman, who lost the Labour whip in the summer, is also scheduled on a panel. \n                  Scottish First Minister John Swinney joins call for pause on new asylum arrivals in Glasgow\n                 \n                  Migrant with AK-47 face tattoo found guilty of threatening to kill Nigel Farage\n                 \n                  'The time is now': Plaid Cymru leader hits out at Labour and Reform in bid to lead Wales\n                 TWT was put on pause last year for organisers to reflect upon its role going forward, after Sir Keir Starmer's election victory. In 2021, 2022 and 2023, while he was leader of the opposition, the festival was able to \"co-exist\" with Labour as a space for activists on the left to discuss ideas. But the prime minister's \"shift to the right\" has alienated so many of those grassroots members that it was felt TWT's core audience would no longer be at Labour Party conferences, says Hope, who joined Labour in the Corbyn years and has since left. \"Our official position isn't that Labour is dead and no one should engage with it,\" she says. \"But they have shifted the values of Labour so radically since the last election, broken promise after promise, attacked civil liberties… there's been such a suite of terrible decisions that mean people who are generally progressive and generally left wing feel like they have to take their organising elsewhere.\" So what's on the cards?  There will be 120 events held in Hulme, Manchester, from Thursday to Sunday evening. At the heart of the programme is daily assemblies, which organisers say are \"designed to hold genuinely constructive debates about what we should do and how we should do it\". But there's just as much partying as there is politics - Dele Sosimi and his Afrobeat Orchestra are headlining the Saturday night slot while a \"mystery guest\" will host what TWT calls its \"infamous\" pub quiz on Friday night. Back in 2018 that was Ed Miliband's job, when 10,000 activists were expected to attend TWT. This year, organisers anticipate around 3,000 people will gather, but those involved insist this is a real chance for the left to strategise and co-ordinate, given the involvement of over 75 grassroots groups, trade unions, and activist networks. Collaboration 'vital' A key question the left will need to address is how it can avoid splitting the vote given the rise of the Greens, socialist independents and the formation of Your Party, One activist from the We Deserve Better organisation, which is campaigning for a left-wing electoral alliance and will be at TWT this weekend, acknowledged collaboration is \"vital\" if the left is to make gains under Britain's first-past-the-post system. But it remains to be seen whether Your Party co-leaders Mr Corbyn and Ms Sultana can even work together following their public spat last month, let alone with other parties. The pair put on a united front at a rally in Liverpool on the eve of TWT, when Sultana said she was \"truly sorry\" and promised \"no more of that\". But will the truce last? \"It's not ideal\", says the activist. \"Hopefully they are back on track...a lot of collaboration is happening at the grassroots and we need to make sure it's formalised so we can beat Labour and the right, we need to put on united front.\" They point to seats like Ilford North, where Health Secretary Wes Streeting clung on by a margin of just 528 votes in the general election, after a challenge from British-Palestinian candidate Leanne Mohamad, who ran in protest against Labour's stance on Gaza. Meanwhile, in Hackney, the Greens are hoping to gain their first directly elected mayor next May, with the Hackney Independent Socialist Group of councillors throwing their weight behind the party's candidate, Zoe Garbett. The We Deserve Better activist says Labour's \"hostile war on the left\" has made these areas ripe for the taking, and what is more important than party affiliation is galvanising momentum behind one candidate who shares socialist values on issues like public ownership and immigration - be they the Greens, independents, or Your Party. \"The World Transformed reflects a general reorientation of the left outside of Labour. If they are taking these places for granted, we are going to win. If we unite as the left then we can win even bigger. Bring it on.\" Is Labour in danger? There is some cause for Labour to be worried. It is haemorrhaging votes to both the right and the left after a tumultuous first year in office (13% to Reform UK, 10% to the Greens and 10% to the Lib Dems, according to an Ipsos poll in September). Many Labour MPs feel the prime minister has spent too much energy trying to \"out Reform Reform\" with a focus on immigration, and he needs to do more to win back moderate and progressive voters that will be gathering at TWT this weekend.  One fed-up MP told Sky News it was a shame TWT had decided to branch away from Labour, but not a surprise. \"This was something that was on the cards for a while, a parting of the ways, it's another thing to show what's happening with the direction of the party.\" He said in previous years the festival \"was full of people for the first time in their life who were excited about politics and had a leadership looking at how it could challenge the biggest issues in our country\". \"Debates could be heated but it was always a place for intellectual discussion and that inside the Labour Party is now dead.\" But he said the party ultimately had bigger things to worry about than TWT, with a budget round the corner and potentially catastrophic local elections in May. \"I don't think it will keep Keir Starmer or Morgan McSweeney up at night.\""
    },
    {
        "title": "Scottish First Minister John Swinney joins call for pause on new asylum arrivals in Glasgow",
        "description": "Scotland's First Minister John Swinney has told Sky News he agrees a pause has \"got to be put in place\" on new asylum seekers coming to Glasgow as the system becomes overwhelmed.",
        "url": "https://news.sky.com/story/scottish-first-minister-john-swinney-joins-call-for-pause-on-new-asylum-arrivals-13448188",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-john-swinney-connor-gillies_7047956.png?20251010174930",
        "type": "Politics",
        "Author": "Connor Gillies",
        "Date Published": "2025-10-10 15:24:00",
        "Headline": "UK-wide figures show Glasgow was the local authority with the highest proportion of housed asylum seekers.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n  Scotland's First Minister John Swinney has told Sky News he agrees a pause has \"got to be put in place\" on new asylum seekers coming to Glasgow as the system becomes overwhelmed. The city is the frontline of the UK's immigration system, with more arrivals than anywhere else. Latest UK-wide figures show Glasgow was the local authority with the highest proportion of housed asylum seekers at 59 per 10,000 inhabitants (a total of 3,716). The UK Home Office is mass-processing asylum claims in order to try and clear a backlog built up over years. Once an asylum seeker is given the right to stay in the UK, they become a refugee and switch from being the responsibility of the Home Office to the local authority. The SNP leader was pressed repeatedly by Sky News on whether he supports calls from local leaders in Glasgow for a temporary halt on new arrivals coming to the city for them to catch up with demand. Speaking to Sky News ahead of the SNP conference in Aberdeen, Mr Swinney said Glasgow City Council's demand is a \"fair and reasonable approach\". \n                  Murderer jailed for attacking Glasgow man with 'napalm cocktail' before stabbing him in heart\n                 \n                  Less than half of Scots trust Scottish government to do right by country, report finds\n                 \n                  Douglas Ross urges MSPs to put party politics aside and back addiction recovery bill\n                 Read more from Sky News:Liam Gallagher and Wayne Rooney among stars at Ricky Hatton funeralMigrant with AK-47 face tattoo found guilty of threatening to kill Nigel Farage Problems coming together  While immigration is controlled by Westminster, housing and healthcare are among the issues dealt with by the Scottish government. Scotland's homelessness legislation means councils must house anyone without a home. It is a more generous policy than in England, where usually only those with \"priority need\" are given a roof over their head. With community tensions spiking and Glasgow council facing a £66m black hole, the city's leaders are demanding the Home Office pause relocations. Mr Swinney told Sky News: \"What the Home Office has got to with Glasgow is respond to their call for there to be more time given to enable the judgements around homelessness to be put in place.\" Pushed on whether he backs a pause in asylum arrives, Mr Swinney replied: \"That's not what the Home Office are proposing, and I think that has got to be put in place.\" He concluded he \"understands\" the demands facing Glasgow. Swinney denies his Govt is partly to blame The Daily Record reported this week the crisis was being made worse in Scotland by rising homeless applications from elsewhere in the UK, including London, Belfast and Birmingham. Asked by Sky News whether the SNP's more liberal laws of providing a home to anyone who declares themselves homeless, he replied: \"I think our homelessness approach is the right approach. \"Scotland has a long-established approach to the tackling of homelessness which we believe to be correct.\" He attributed blame for Glasgow's crisis to the Home Office. The Home Office has been approached for comment. Farage 'repulsive' In a wide-ranging interview, Mr Swinney was also asked about polling suggesting Nigel Farage's Reform UK party could be on course to form the official opposition at the Scottish Parliament elections next year. The SNP chief said he believes the Farage politics are \"repulsive\" and said \"some\" of his Scottish supporters are far right. Responding to Mr Swinney, Reform UK councillor Thomas Kerr said: \"John Swinney calls Reform UK 'repulsive' - but what's repulsive is a first minister who's more interested in sneering at voters than serving them. \"After years of SNP chaos, collapsing services, and broken promises, Scots are desperate for change.\" Russell Finlay, leader of the Scottish Conservatives, said it was a \"remarkable U-turn from John Swinney\". He said: \"Only this week his grandstanding SNP colleagues were brandishing my party racist and divisive for bringing the concerns of Scots about immigration to Holyrood.\""
    },
    {
        "title": "Migrant with AK-47 face tattoo found guilty of threatening to kill Nigel Farage",
        "description": "An Afghan migrant has been found guilty of threatening to kill Nigel Farage in a TikTok post.",
        "url": "https://news.sky.com/story/migrant-with-ak-47-face-tattoo-found-guilty-of-threatening-to-kill-nigel-farage-13447937",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-nigel-farage-fayaz-khan_7047445.jpg?20251010181704",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-10 06:40:00",
        "Headline": "Fayaz Khan said he was coming to England and was going to \"pop, pop, pop\" Nigel Farage after the Reform leader posted a video of the Afghan national coming to the UK in a small boat.",
        "Content": " An Afghan migrant has been found guilty of threatening to kill Nigel Farage in a TikTok post. Fayaz Khan, 26, chose not to give evidence in his trial, in which he was accused of threatening the Reform UK leader between 12 and 15 October last year in a video on the social media platform. Mr Farage said the video was \"pretty chilling\". Jurors deliberated for 11 hours and 55 minutes before finding him guilty at Southwark Crown Court. They had been told Khan had a \"very large presence online\", with his TikTok videos amassing hundreds of thousands of views as he showed himself attempting to come to the UK by small boat last autumn. The Afghan national, who has an AK-47 tattoo on his right cheek and arm, live-streamed his journey across the English Channel from France in a small boat and was arrested on 31 October after arriving in the UK. He had been living in Stockholm, Sweden, since 2019. \n                  'Beaten for 16 days': Deported Afghans describe brutal treatment by Iran - yet are desperate to return\n                 \n                  Crying babies blighted by hunger fill this Afghanistan hospital - where parents fear each day might be the last\n                 \n                  Taliban says it will never hand over Bagram Air Base in Afghanistan to US\n                 Jurors were told that on 12 October last year, Mr Farage uploaded a YouTube video titled \"The journey of an illegal migrant\", which highlighted Khan and referenced \"young males of fighting age coming into our country about whom we know very little\". Khan responded with a video two days later in which he appeared to say: \"Englishman Nigel, don't talk s**t about me. \"You not know me. I come to England because I want to marry with your sister. You not know me. \"Don't talk about me more. Delete the video. \"I'm coming to England. I'm going to pop, pop, pop.\" He made gun gestures with his hand and headbutted the camera during the video, while pointing to the AK-47 tattoo on his face to \"emphasise he wasn't joking\", Mr Ratliff said. Mr Farage, who was at court for the trial, said the video was \"pretty chilling\". \"Given his proximity to guns and love of guns, I was genuinely worried,\" he said. \"He says he's coming to England and he's going to shoot me.\" A subsequent TikTok post by Khan read: \"I mean what I say\" on an image of a GB News report about the threat against Mr Farage. Other videos Khan posted on social media were shown to the jury in which he appeared to make \"pop, pop, pop\" noises and similar gun hand gestures. After his arrest, Khan told police in November last year: \"It was just a video, it was never an intention to threaten him. \"It was never my intention to kill him or anything - this is my character, this is how I act in my videos. \"In every video I make those sounds, I say 'pop, pop pop'.\" Prosecutor Peter Ratliff said the threat to kill was \"not some off-the-cuff comment\" and the video was \"sinister and menacing\". He said Khan, who denied the charge, was a \"dangerous man with an interest in firearms\" and who had an AK-47 tattooed on his arm and face. Defence lawyer Charles Royle said Khan was \"remonstrating in his own idiosyncratic, moronic, comedic, eye-catching, attention-seeking way\" rather than making a threat to kill in the TikTok video. He told jurors the trial was \"not about your views on illegal immigration, nor about your views on face tattoos, Brexit or Reform\". Discussing Khan's decision not to give evidence, Mr Royle said: \"You shouldn't hold any silence against him.\""
    },
    {
        "title": "'The time is now': Plaid Cymru leader hits out at Labour and Reform in bid to lead Wales",
        "description": "Plaid Cymru leader Rhun ap Iorwerth insisted his party has the chance to change Wales at next May's election as he tries to break a century of Labour rule.",
        "url": "https://news.sky.com/story/the-time-is-now-plaid-cymru-leader-hits-out-at-labour-and-reform-in-bid-to-lead-wales-13448132",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rhun-ap-iorweth-wales_7047848.jpg?20251010151236",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-10 13:10:00",
        "Headline": "The leader of the Welsh nationalist party has attacked Reform and Labour, as he says he is ready to step up and lead Wales.",
        "Content": "Plaid Cymru leader Rhun ap Iorwerth insisted his party has the chance to change Wales at next May's election as he tries to break a century of Labour rule. Giving his keynote speech at the party's conference in Swansea, he said: \"Plaid Cymru is ready to lead. \"To the people of Wales, I say 'come with us'.\" Politics latest: Farage 'stunned' at guilty plea of former Welsh Reform leader for Russia bribes The former BBC journalist admitted it \"won't be an easy task\", but said voting for his Welsh nationalist party to replace Labour in the Senedd (Welsh parliament) next year would unleash Wales \"from its shackles\". Labour has been the largest party in Wales for more than 100 years, giving it the longest-winning streak of any democratically elected political party in the world. But as its popularity flounders, partly due to the Westminster government, Mr ap Iorwerth said Plaid Cymru, which means \"party of Wales\", is the only real option. \n                  'Bring it on': Left-wing activists gather for fight back against the right - and Labour\n                 \n                  Scottish First Minister John Swinney joins call for pause on new asylum arrivals in Glasgow\n                 \n                  Migrant with AK-47 face tattoo found guilty of threatening to kill Nigel Farage\n                 \"Labour's time is up,\" he said as he accused Wales' Labour first minister, Eluned Morgan, of failing to put the country first. Mr ap Iorwerth promised a vote for Plaid would mean \"no diktats from London or orders to obey\", in a dig at the Welsh Labour government. His party is currently polling at 30%, Reform at 29%, and Labour at 14% in Wales. Despite Plaid Cymru being built on wanting independence for Wales, Mr ap Iorwerth did not mention independence once. He earlier told Sky News this election is not the time, but that will come. The Plaid leader accused Labour of neglecting Wales and failing the Welsh people on issues such as steel, the NHS and child poverty. He portrayed Reform as a threat to Welsh devolution and public services, and accused Nigel Farage's party of promoting divisive, far-right politics and advocating for abolishing the Senedd. Reform are the new Conservatives, he added. \"Farage will feverishly pedal the feedback loop of fear and paranoia, but we can put a stop to that,\" he said. \"And together, we can usher in an age of new leadership that will set Wales on a different path.\" Trying to appeal to all Welsh voters, he said: \"If you've never voted for Plaid Cymru before, the time is now. \"The time is now to stop Reform and elect a government more radical, more ambitious, more impatient to bring about positive change than any which has gone before it. A government of progress and of progressive values.\" Read more:Plaid Cymru calls on Labour voters to unite behind Welsh nationalists He promised to take \"decisive action\" to change the NHS, and said his party will \"unleash our promised revolution in preventative health to create long-term wellbeing\" and \"reform our neglected social care sector\". And he said Plaid would \"bring not only the impetus of new leadership but a promise to make a difference to your life, wherever you live\". The Plaid Cymru leader made a key pledge to extend funded childcare hours to all parents with nursery-aged children. Currently in Wales, only parents who work (and neither earn more than £100,000) get 30 funded hours for children aged three and four over 48 weeks of the year. Some two-year-olds in disadvantaged areas also receive it. But Mr ap Iorwerth wants to give 20 hours of funded childcare to all parents, working or not, of children aged nine months to four years old. Plaid would keep the current 30-hour offering for working parents of three and four-year-olds. He said economic research found this would mean a 13% return on investment in early years education and claimed it would be the \"most generous government-funded childcare programme in the UK\". He told the conference: \"A helping hand with the things that matter the most. \"That's what a Plaid Cymru government will mean for you and your family.\" Since last month, working parents of nine-month-olds to four-year-olds in England have been eligible for 30 hours of funded childcare over 48 weeks of the year. Labour implemented it but it was the Conservative government that introduced the extension."
    },
    {
        "title": "Corbyn and Sultana friends again 'like the Gallagher brothers' as next steps for Your Party set out",
        "description": "Zarah Sultana and Jeremy Corbyn have reconciled \"like the Gallagher brothers\" and the show is \"back on the road\", a packed Your Party event has heard.",
        "url": "https://news.sky.com/story/corbyn-and-sultana-friends-again-like-the-gallagher-brothers-as-next-steps-for-your-party-set-out-13448213",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-corbyn-zarah-sultana_7047989.jpg?20251010182657",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-10-10 16:20:00",
        "Headline": "There's no looking back in anger for the co-leaders of Your Party, who have spent the past 48 hours putting on a show of unity after their falling out last month. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Zarah Sultana and Jeremy Corbyn have reconciled \"like the Gallagher brothers\" and the show is \"back on the road\", a packed Your Party event has heard. Speaking at The World Transformed (TWT) Conference in Manchester - the birthplace of Oasis - Ms Sultana said if the band's quarrelling brothers can get back together they can too. It comes after a nasty public row over Your Party's paid membership system threatened to upend the new venture before it began. Ms Sultana, speaking at a rally in Liverpool last night, said she was \"truly sorry\" for her part in the fiasco and told supporters gathered in its neighbouring city on Friday: \"You have all seen what's happened in the last few weeks, I am here to tell you the show is back on the road. \"I know that I'm in Manchester so I have to reference Liam and Noel Gallagher. If they can do it, of course me and Jeremy can.\" Ms Sultana, an LFC fan, went onto quip that the only difference between her and Mr Corbyn is that he \"thinks Arsenal are still going to win the Premier League, and we know that they will always come second place with a second-place trophy\". On Thursday night her apology struck a more serious tone as she said: \"Many of you have felt frustrated about the launch process... it was regrettable and for my part I am truly sorry\". \n                  Your Party announce conference - but the battle for its soul continues\n                 \n                  Zarah Sultana drops legal threat to reconcile with Jeremy Corbyn after row\n                 \n                  What is happening at Your Party? What we know about row between Corbyn and Sultana\n                 The row erupted last month after Ms Sultana unilaterally launched a membership portal which Mr Corbyn claimed was unauthorised. She then said she had been \"sidelined by a sexist boys club\" - referring to the alliance of independent MPs who support Your Party, and that she was consulting defamation lawyers. She later dropped that threat in order to pursue reconciliation - but the past 48 hours is the first time that has been put on public display. The charm offensive started with the rally in Liverpool's St George's Hall, with about 800 people in attendance, followed by a panel event at the left-wing TWT festival - which used to be affiliated with Labour but has broken ties over the direction of the party under Sir Keir Starmer. Read More:Left wing activists gather for fightback against the right - and Labour Asked if she still thinks there is sexism at the top of Your Party Ms Sultana told Sky News: \"As women we know there are misogynistic aspects of all society. It's important we address that, we are addressing that, and we are moving forward.\" Corbyn did not address the row over the two events but previously said the new party had faced some \"fraught days\" and \"we haven't covered ourselves in glory\". One supporter told Sky News they were feeling more confident in Your Party following the show of unity. Mira said: \"I've been really let down and depressed with what went down over the last few weeks and I am feeling hopeful again that they are putting aside all the nonsense and showing this is about something much bigger than them, a big working class party. \"There were no snide comments or individual posturing, it was real shared lines, it doesn't matter if they don't personally like each other, I just wanted to see them coming out and saying we are working together, we respect each other.\" What next for Your Party? With the hatchet buried - at least for now - the party must next hash out a set of policies and processes for fielding candidates so it can be ready to fight the local elections in May. Local branches are in the process of being set up across the country by volunteers, with next steps expected to be formally agreed at the founding conference at the end of November. Mr Corbyn said he would like to see the branches hold at least one public event a month to discuss local campaigns and stay \"1,000% relevant all the time\". While members will have a say on policy, the co-leaders also gave some indications of their red lines. Withdrawal from NATO Ms Sultana said Your Party would be \"anti-imperialist\" and withdraw from NATO - which goes further than Mr Corbyn's 2019 Labour manifesto. Mr Corbyn has always been personally critical of NATO, but as Labour leader the party's position was to stay in the alliance. The duo both expressed strong support for trans rights, saying \"trans rights are human rights\". One MP in the independent alliance which supports Your Party, Adnan Hussain, faced a backlash on social media last month when he said women's rights and safe spaces \"should not be encroached upon\" and \"safe third spaces should be an alternative option\". He added that trans women are \"not biologically women, hence trans women\". Mr Hussain insisted it was an issue prospective members had been asking the party about, but it put him at odds with what the co-leaders have previously said, raising questions as to what the party's official position would be. Ms Sultana and Mr Corbyn were adamant that this is a socialist progressive party, saying they would stand for \"peace, justice, economic equality and opposing racism\". 'Labour split the left not us'  Another question the party faces is whether it could fragment the left vote and allow Reform UK to win, given the rise of the Greens under Zack Polanski and independent MPs. Ms Sultana today said it today that if that happened, it was the fault of Labour for moving \"so far to the right while dancing to Nigel Farage's tune\". She drew dividing lines with Your Party and the Greens on the question of whether they should form an alliance, saying the Greens are \"not explicitly socialist, they say NATO has a role to play\". Mr Corbyn said there were some things he didn't agree on with Mr Polanski but under the First Past the Post system, alliances were necessary. \"There may be points where sometimes we don't agree with the Greens,\" he said. \"So we have our identity, we have our principles, and we have our position, but we're anxious to make progress in our society, and that will mean working with a lot of different people - nothing wrong in that.\" But Mr Polanski, for his part, suggested he would rather see the Your Party co-leaders join him than work together, telling Sky News during his party conference last week: \"My door is always open to Jeremy Corbyn and Zarah Sultana. I'd love them to be Green Party members...my relentless focus is on growing the Green Party.\""
    },
    {
        "title": "More border checks for Britons travelling to Europe under new rules",
        "description": "British travellers going to Europe will be asked to do additional entry checks under new rules to be phased in from this Sunday.",
        "url": "https://news.sky.com/story/more-border-checks-for-britons-travelling-to-europe-under-new-rules-13448154",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ees-entry-exit-system_7047878.jpg?20251010162737",
        "type": "Politics",
        "Author": "Tamara Cohen",
        "Date Published": "2025-10-10 14:17:00",
        "Headline": "There are concerns that the process, which is expected to take 1-2 minutes per passenger, will cause long queues and chaotic scenes at UK ports and some European airports during peak periods such as the school holidays. ",
        "Content": "\n          Political correspondent\n              @tamcohen\n British travellers going to Europe will be asked to do additional entry checks under new rules to be phased in from this Sunday. The Entry Exit System (EES) will require non-EU citizens to scan their passport, have their fingerprints and photographs taken, and face questions from a border guard on arrival in 29 European countries. These include the most popular holiday destinations for British travellers such as France, Spain, Italy and Greece. Once completed at a European destination, registration is valid for three years. Holidaymakers do not need to do anything before they leave if travelling by air; but will need to do the process in the UK if travelling from the Port of Dover, Folkestone or by Eurostar from London St Pancras. There are concerns that the process, which is expected to take 1-2 minutes per passenger, will cause long queues and chaotic scenes at UK ports and some European airports during peak periods such as the school holidays. In order to minimise disruption, EES is being phased in over a six-month period, to be fully operational by 10 April 2026, at which point wet passport stamps for travellers to European countries will be phased out. The entry check will apply across the EU and Schengen area, which includes Norway, Switzerland and Iceland, and members states will decide how to phase it in. \n                  Farage accused of wanting to 'take UK backwards' - as Brexit blamed for small boats crisis\n                 \n                  Post-Brexit border control post in Wales to sit empty\n                 \n                  UK agrees post-Brexit deal on Gibraltar in boost to reset talks with EU\n                 There is no list of which countries or airports will be applying the registration from this Sunday. Spain is reported to be testing its system, with just one flight arriving at Madrid doing checks from Sunday. Countries such as Estonia, Luxembourg and the Czech Republic will be operating the rules for all travellers from day one. The government has spent £10.5million on new facilities at UK ports for EES, which has been in development for several years. Coach and lorry drivers getting the ferry from Dover will be the first to use the system this weekend. Minister for Border Security and Asylum, Alex Norris, said: \"We recognise that EES checks will be a significant change for British travellers, which is why we have worked closely with our European partners to ensure the rollout goes as smoothly as possible. \"The UK and EU have a shared objective of securing our borders and these modernisation measures will help us protect our citizens and prevent illegal migration.\" Management at the Port of Dover say they are prepared for the start of the scheme and expect 10% of passengers to undertake EES at the start, then rolling out to other passengers from 1 November. Read more:New EU Entry/Exit system: All you need to know Doug Bannister, chief executive of the Port of Dover, said: \"Along with our counterparts who are also implementing EES, there are still some outstanding technology challenges that we are navigating with the French provider and border authorities as we collectively work towards go-live. \"We anticipate activation for cars in November, once the technology is installed and is working as expected. We ask all passengers to familiarise themselves with the new process via their ferry operator, allow extra time, and work with us as this major European system is introduced. \"The long-term benefits of EES will be improved border security and a more modern, efficient travel experience for millions of passengers each year.\" Why is this happening now?  The EES has been planned for years, was first due to be introduced in 2022, but has been delayed multiple times. It is intended to build up a digital record of all non-EU travellers to the Schengen area, to more effectively police its borders, detect the use of fake documents, and prevent people overstaying. The European Commission, which developed the scheme, say it will make border checks more modern and efficient, and gradually replace passport stamps. What will registration involve? Registration will involve face and fingerprint data. Member states will make their own arrangements, but it is expected most airports will use automated machines to do this. But countries can ask border guards to check this data and ask three or four additional questions including whether the traveller has a return ticket, where they are staying and whether they have sufficient funds. Individuals who refuse to register can be denied entry. Who is exempt? British travellers to Ireland and Cyprus will not have to register. There will be exemptions to EES for diplomats, people who have EU residency under the terms of the Withdrawal Agreement, and ministers on official business. Children under 12 will need to have their photograph taken, but will not need to be finger-printed. Will there be chaos and queues? The European Commission insist that, with EES, travellers will eventually spend less time at the border thanks to faster checks and self-service options. But implementation is being done gradually, and at a time when high travel volumes are not expected, in order to cope with problems. Two facilities in Kent are expected to be put on standby for queues of freight and cars. There were long queues last summer ahead of expected implementation. European countries can choose to use apps for travellers to do the checks, or to integrate them with e-gates."
    },
    {
        "title": "New EU Entry/Exit system: All you need to know about digital border changes",
        "description": "British nationals may face longer waits at border control when visiting a number of EU countries thanks to a new digital system that is being introduced this weekend.",
        "url": "https://news.sky.com/story/new-eu-entryexit-system-all-you-need-to-know-about-digital-border-changes-13410174",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-istock-biometric-fingerprint_6988142.jpg?20250811144607",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-10 17:24:00",
        "Headline": "The new system will see the manual stamping of passports scrapped in favour of visitors registering their biometric details.",
        "Content": "British nationals may face longer waits at border control when visiting a number of EU countries thanks to a new digital system that is being introduced this weekend. The Entry/Exit System (EES) will be gradually rolled out across Europe over six months from Sunday 12 October. It will see the manual stamping of passports scrapped in favour of non-EU citizens registering their biometric details, such as fingerprints and a photo, automating the process of registering travellers' entries and exits. But which countries will it apply to, how will it work and why is it being introduced? Which countries will have the Entry/Exit System? It will apply to 25 EU countries in the Schengen area and four other countries in the same region, but which are not part of the EU. Here's the full list: • Austria• Belgium• Bulgaria• Croatia• Czech Republic• Denmark• Estonia• Finland• France• Germany• Greece• Hungary• Iceland• Italy• Latvia• Liechtenstein• Lithuania• Luxembourg• Malta• Netherlands• Norway• Poland• Portugal• Romania• Slovakia• Slovenia• Spain• Sweden• Switzerland Manual passport stamping will continue to be used in Ireland and Cyprus. Who does it apply to? The system applies if you are a non-EU national, including from the UK, who is travelling to an EU country for a short stay, which means up to 90 days within a 180-day period. Children under the age of 12 will be exempt from giving fingerprints, but they will still need to have their faces scanned for the system. There are exemptions which are listed here. How will it work? The EES will register the person's name, type of travel document, biometric data - fingerprints and captured facial images - and the date and place of entry and exit. When you first visit one of the listed countries after the EES is adopted, you will need to register your details at an automated kiosk. In normal circumstances, you will complete the EES checks when you arrive at your destination airport or port in a purpose-built booth. However, if you enter one of the countries through the Port of Dover, Eurotunnel at Folkestone or St Pancras International, EES checks will be completed at the border before you leave the UK. EES kiosks have been installed specifically for this purpose. This will mean passengers will have to get out of their cars to register at the Eurotunnel terminal and the Port of Dover. The latter will have an EES processing site at the Western docks. You do not need to take any action before arriving at the border, and there is no cost for EES registration. Your digital EES record will be valid for three years before it has to be renewed. If you enter the Schengen area again during this time, you will only need to provide a fingerprint or photo at the border, when you enter and exit. During the initial rollout, manual stamping of passports is set to continue, but the system is expected to completely replace it from 10 April 2026. Could there be longer queues? The government has warned that there may be longer waiting times than usual at the border once the system starts, as it will take each passenger an extra minute or two to join the EES. Naomi Leach, deputy editor of Which? Travel, told Sky News that travellers should allow more time for their journeys on the other side if they are flying. \"It is worth booking later transfers, car hire or other onward travel,\" she suggested. Though countries are obliged to get going with the new system from Sunday, they have six months to complete the rollout. It is hoped that this, mixed with the fact the rollout is not starting during peak travelling seasons, will help limit the impact on passengers. The Independent's travel editor Simon Calder told Sky News that passengers should still expect longer queues when they reach their destinations, but that it will likely vary depending on where they are going.  He said: \"I've contacted all 29 of the nations involved and some of them, specifically the Czech Republic, Estonia, Luxembourg, say they'll be ready from day one, everybody travelling in and out is going to be checked. \"But in Spain, for instance, they say they're going to check exactly one flight coming into Madrid airport and after that they're going to roll things out gradually at the international airports, then the roads crossings, then the seaports.\" Mr Calder has been told that Dusseldorf will be the starting point in Germany. He also said countries can largely pause the implementation at various points if waiting times grow too long. Concerns over delays at ports The Port of Dover, Eurotunnel at Folkestone or St Pancras International will be gradually rolling out the EES. Only drivers and passengers on coaches and freight are expected to join the EES initially at Dover and Folkestone, while the Eurostar says there will be \"minimal changes\" at St Pancras to start with. But some concerns were raised when the Port of Dover said it would take up to six minutes per vehicle for EES registration - up from the 30 to 60 seconds it takes for a car to get through the border without the EES. But Port of Dover CEO Doug Bannister said he was confident a £40m investment in new infrastructure would pay off. \"We have purposely designed these facilities to handle our peak volume days [in the summer]... whilst ensuring that there is no queuing or congestion on the external road network,\" he said. He said the EU has also allowed for so-called \"precautionary measures\" during the first six months post full operation of EES, adding: \"What that will allow us to do is dial back on the process if we have to, if the traffic volumes are going to be larger than we anticipated.\" A spokesperson for the government said: \"While we have done everything we can to ensure the required infrastructure is in place, anyone who is planning a trip to the European mainland once these checks are introduced will still need to allow more time for their journey as the new EU systems bed in.\" What happens to your data? The European Commission says the data being collected when you use the EES is: • The information listed in your travel document(s) (e.g. full name, date of birth, etc.)• Date and place of each entry and exit• Facial image and fingerprints• Whether you were refused entry This data will be stored in the system and cannot be transferred to third parties - except in specific cases, which you can read about here. Your data will be used by countries for several reasons, including identifying travellers who aren't allowed to enter, finding those using fake identities, and helping to prevent and investigate serious crimes. If you refuse to provide your biometric data, you will be denied entry. Why is it being implemented? The EU says the new system is aimed at making several improvements to the manual stamping system, which the European Commission views as time-consuming and unreliable in providing data on border crossings. It says the EES will make border checks more modern, efficient, easier and faster. It says that once they are registered, travellers will spend less time at the border thanks to faster checks. It is also aimed at preventing illegal migration. It says the EES will help track who comes in and out of the Schengen countries better than the old system, using fingerprint and face data to stop people from overstaying, using fake identities or misusing visa-free travel. It also says the EES will increase security in the countries, giving the authorities access to important traveller information and helping them to spot security risks and support the fight against serious crimes and terrorism."
    },
    {
        "title": "Nigel Farage says Tony Blair 'not my choice' to help govern Gaza but understands Donald Trump's logic",
        "description": "Nigel Farage has said Sir Tony Blair would not be his choice to lead an interim government in Gaza, but understands Donald Trump's logic in choosing the former Labour prime minister.",
        "url": "https://news.sky.com/story/nigel-farage-says-tony-blair-not-my-choice-to-help-govern-gaza-but-understands-donald-trumps-logic-13448077",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-gaza-palestinians-israel_7047498.jpg?20251010091545",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-10 13:04:00",
        "Headline": "Donald Trump has said former Labour prime minister Sir Tony Blair would head up a \"Board of Peace\" in Gaza.",
        "Content": "Nigel Farage has said Sir Tony Blair would not be his choice to lead an interim government in Gaza, but understands Donald Trump's logic in choosing the former Labour prime minister. The Reform leader said \"as long as it's not Keir Starmer\" heading up a transitional Gaza authority, he is happy. He said the Gaza ceasefire agreement, brokered by the US, is \"an absolutely heroic effort by the American administration\" and is \"something very big to celebrate\". Politics latest: Farage stunned by guilty plea of former Welsh Reform leader over Russia bribes The White House has backed a plan that would see Sir Tony, who led the UK into the Iraq War, heading up a temporary administration of the Gaza Strip for as long as five years. But Mr Farage was not so enthusiastic about that prospect; however accepts it is going to happen. \"As for Blair, look, he wouldn't be my choice,\" he said. \n                  'Bring it on': Left-wing activists gather for fight back against the right - and Labour\n                 \n                  Scottish First Minister John Swinney joins call for pause on new asylum arrivals in Glasgow\n                 \n                  Migrant with AK-47 face tattoo found guilty of threatening to kill Nigel Farage\n                 \"However, and this is what Trump's logic is: Blair does command considerable support from the UAE, from Qatar, from, I think, the Saudis as well. \"And the really important part of this deal is not just that we have a ceasefire right now and hostages about to be returned very shortly. \"The even bigger and more significant part of this deal is that 22 Arab countries are signed up to it. This is a coming together of the Middle East. \"And so Trump's logic is that Blair helps with that. As I say, he wouldn't necessarily be my first choice, but it's happening.\" Read more:Gaza latest: Netanyahu warns troops will stay under certain conditions metHow two years of war have shattered the Gaza Strip  Mr Farage also accused the British and French governments of hampering a peace deal. \"I think if anybody did their best to stop a peace deal happening, it was the British government, the French government, recognising the state of Palestine without anything whatsoever in return,\" he added. On Friday, a senior Hamas official rejected Mr Trump's proposal for a transitional \"Board of Peace\" in Gaza. Mr Trump announced the peace deal on Thursday and Israel's government ratified it hours later. Tens of thousands of Palestinians started walking towards northern Gaza after the Israeli military said the ceasefire had begun at midday local time on Friday. The US president said the remaining hostages, both dead and alive, held by Hamas will be released on either Monday or Tuesday, followed by the release of about 2,000 Palestinian prisoners held by Israel. Mr Trump will fly to the Middle East, expected to be Egypt, this weekend to sign the agreement."
    },
    {
        "title": "Prince Harry and Meghan named Humanitarians of the Year",
        "description": "The Duke and Duchess of Sussex have been named Humanitarians of the Year for their charity work.&#160;",
        "url": "https://news.sky.com/story/prince-harry-and-meghan-named-humanitarians-of-the-year-13447972",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-harry-meghan_7047632.jpg?20251010111304",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-10-10 08:25:00",
        "Headline": "The couple were presented with the award at the Project Healthy Minds gala in New York, where they highlighted the potential dangers of social media for young people.",
        "Content": "The Duke and Duchess of Sussex have been named Humanitarians of the Year for their charity work.  Prince Harry and Meghan were presented with the award at the Project Healthy Minds gala, which aims to bring together champions of mental health, in New York on Thursday. Accepting the award on stage, the couple used the moment to speak about the potential dangers social media can pose for young people, which Harry described as \"one of the most pressing issues of our time\". The couple have spoken regularly about the potential harms of social media, and the fears they have for their two children. It comes after the pair's Archewell Foundation - a non-profit they launched in 2020 - announced that its Parents' Network support group initiative is joining forces with ParentsTogether, a non-profit organisation dedicated to family advocacy and online safety. 'A pivotal moment... to protect children' Speaking on Thursday, Harry said 4,000 families are currently taking legal action through the Social Media Victims Law Centre, having lost their children to social media. He said: \"Parents who have learned legal action is possible, who have the capacity to pursue it while grieving, and parents who've found their way to help in the fightback against some of the wealthiest, most powerful corporations in the world. \"And even after this, there may be no road to closure for grieving parents because these companies refuse to disclose their child's information and activity on their platforms. \"This is a pivotal moment in our collective mission to protect children and support families in the digital age.\" He went on to hit out at the \"explosion\" of unregulated artificial intelligence (AI), saying both he and Meghan have seen the \"full scope\" of what the technology can do. Meghan added that the couple often discuss how they would protect their own children, six-year-old Archie and four-year-old Lili, as they grow older. \"Like so many parents, we think constantly about how to embrace technology's benefits while safeguarding against its dangers,\" she said. \"That hopeful intention of separation is rapidly becoming impossible.\"  In April, Harry and Meghan also called for tougher action to protect children from the potential harms of social media. While helping to unveil a temporary memorial to young people who have died after being exposed to online content, in New York, the duke said in a statement: \"These children were not sick. Their deaths were not inevitable - they were exposed to, and in many cases were pushed harmful content online, the kind any child could encounter. \"No child should be exploited, groomed, or preyed upon in digital spaces. To the platforms, they may be seen as statistics. To their families, they were cherished and irreplaceable.\" Since stepping down as working royals in 2020, Harry and Meghan have been awarded various accolades, including a civil rights award from the NAACP and the Robert F Kennedy Human Rights Ripple of Hope Award, both in 2022. Both are involved with various charities, but in recent months, some of those that work with Prince Harry have made headlines. Read more:Harry and the King have private tea in first meeting for 19 monthsHarry talks of sibling 'challenge' On Wednesday, the non-profit organisation African Parks, which is partially run by Prince Harry, had its mandate for managing wildlife reserves in Chad removed by the country's government, after being accused of a lack of investment in wildlife reserves, and not doing enough to stop poaching. In August, the duke dramatically stepped down as patron from Sentebale - a charity established in 2006 to help children and young people in southern Africa, particularly those with HIV and AIDS - following a dispute with the charity's chairperson Dr Sophie Chandauk."
    },
    {
        "title": "Google warns against 'onerous regulations' after UK competition ruling",
        "description": "Google has warned the UK against imposing \"onerous\" and costly regulations after the competition watchdog ruled it had \"strategic market status\" for its search services.",
        "url": "https://news.sky.com/story/google-warns-against-onerous-regulations-after-uk-competition-ruling-13448009",
        "image_url": "https://e3.365dm.com/23/02/1920x1080/skynews-google-tech-search_6051496.jpg?20230209103812",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-10-10 09:16:00",
        "Headline": "The CMA is to begin consultations on possible remedies before the year is out but it can expect Google to argue furiously that regulation risks an act of self harm.",
        "Content": "Google has warned the UK against imposing \"onerous\" and costly regulations after the competition watchdog ruled it had \"strategic market status\" for its search services. The Competition and Markets Authority (CMA) said legal tests had been met to designate Google with the status in general search and search advertising services due to \"substantial and entrenched market power\", with more than 90% of searches in the UK taking place on its platform. The designation gives the CMA greater control on how Google operates its UK services. The regulator said the Alphabet-owned firm's Gemini AI assistant was not in the scope of the designation but other AI functionality, including AI Overviews, were. Money latest: National insurance rumour prompting landlords to act It launched the inquiry in January after new powers came into force and had previously flagged the finding in a provisional decision. The CMA said the legislation allowed proportionate action to \"improve competition in digital markets, helping to drive innovation, investment and growth across the UK economy\". \n                  Money blog: The petrol myth - why a common tip just isn't true\n                 \n                  Discord hack shows risks of online age checks as internet policing hopes put to the test\n                 \n                  The best places to buy used tech - but go armed with these do's and don'ts\n                 It added that it would begin consultations on possible remedies soon. What could happen? These could include demanding changes to its search engine in the UK, including through so-called \"choice screens\", and giving publishers more power. Any action could risk a row with the government, as ministers seek a \"growth first\" agenda within the country's regulatory bodies. Will Hayter, executive director for digital markets at the CMA, said: \"By promoting competition in digital markets like search and search advertising we can unlock opportunities for businesses big and small to support innovation and growth, driving investment across the UK economy. \"We have found that Google maintains a strategic position in the search and search advertising sector - with more than 90% of searches in the UK taking place on its platform.\" Google responded by arguing that the designation risked unintended consequences such as price rises and hits to innovation and growth. Read more from Sky News:Hack of popular messaging app shows risks of online age checksCustomers of five water firms facing higher than expected bill hikes  Its senior director for competition, Oliver Bethell, said: \"The UK enjoys access to the latest products and services before other countries because it has so far avoided costly restrictions on popular services, such as search. \"Retaining this position means avoiding unduly onerous regulations and learning from the negative results seen in other jurisdictions, which have cost businesses an estimated 114 billion euros (£99.2 billion). \"Many of the ideas for interventions that have been raised in this process would inhibit UK innovation and growth, potentially slowing product launches at a time of profound AI-based innovation. \"Others pose direct harm to businesses, with some warning that they may be forced to raise prices for customers.\""
    },
    {
        "title": "Rishi Sunak hired as a senior adviser by Microsoft - but given stern warning",
        "description": "Former PM Rishi Sunak has been hired by tech giant  Microsoft.",
        "url": "https://news.sky.com/story/rishi-sunak-hired-as-a-senior-adviser-by-microsoft-but-given-stern-warning-13447999",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sunak-rishi_7047616.jpg?20251010105548",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-10-10 09:09:00",
        "Headline": "Acoba, the watchdog that assesses external jobs for MPs, has said Sunak will not be advising on UK policy matters.",
        "Content": "Former PM Rishi Sunak has been hired by tech giant  Microsoft. The ex-Tory leader, who remains an MP in parliament, has joined the Seattle-based tech firm as a paid part-time senior adviser and will give the company \"high-level strategic perspectives on macro-economic and geopolitical trends\" as well as how these \"intersect with innovation, regulation and digital transformation\". He will be donating his salary to his and his wife, Akshata Murty's, numeracy skills charity, The Richmond Project. Acoba, the watchdog that assesses external jobs for MPs, has said Sunak will not be advising on UK policy matters.  The Advisory Committee on Business Appointments has in the past been accused of being toothless and unable to prevent MPs from taking employment that could cause a conflict of interest, or allow former parliamentarians to use contacts made in government for personal use. Sunak was prime minister between October 2022 and July 2024. It was thought he could be eyeing a job in Silicon Valley, California, after his general election defeat. \n                  New 'AI you can trust' for when safety matters\n                 \n                  Bank of England warns of 'sharp correction' for markets if AI bubble bursts - and IMF agrees\n                 \n                  Robin Williams's daughter begs people to stop sending her AI videos of her father\n                 But in his final prime minister's questions appearance as Conservative leader, Sunak vowed to spend more time \"in the greatest place on Earth\", referring to his Richmond and Northallerton constituency.  He added: \"If anyone needs me, I will be in Yorkshire.\" Acoba has warned Sunak that he shouldn't provide advice to or on behalf of Microsoft on government work or its contracts until later next year. Read more on Sky News:AI 'distorting women online'Pros and cons of digital IDsImpact of new online safety rules The former chancellor has also been asked not to lobby the government or make use of his Whitehall contacts during that time, and to limit his work to \"providing advice on strategy, macro-economic and geopolitical matters that do not conflict\" with his activities in Number 10. The Cabinet Office told the watchdog that Sunak's year on the Tory backbenches \"will have helped to diminish the salience and currency of the information\" he had access to. Sunak has also taken on a role at San Francisco-based Anthropic, which developed the Claude artificial intelligence (AI) models. He has also become a senior adviser to Goldman Sachs since leaving office, where he previously worked between 2001 and 2004."
    },
    {
        "title": "Gregg Wallace suing the BBC for 'distress and harassment' following sacking",
        "description": "Gregg Wallace is suing the BBC and one of its subsidiaries for causing him \"distress and harassment\", after being sacked from the corporation in July.",
        "url": "https://news.sky.com/story/gregg-wallace-suing-the-bbc-for-distress-and-harassment-following-sacking-13448104",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-gregg-wallace-masterchef-host_6763965.jpg?20241204093832",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-10 12:33:00",
        "Headline": "Gregg Wallace, who fronted MasterChef for 20 years, was sacked from the show this summer.",
        "Content": "Gregg Wallace is suing the BBC and one of its subsidiaries for causing him \"distress and harassment\", after being sacked from the corporation in July. The former MasterChef presenter is claiming up to £10,000 in damages from the BBC and BBC Studios Distribution Limited, who he says failed to disclose his personal data, according to court documents. Wallace, 60, apologised after a report, commissioned by the cooking show's production company Banijay UK, upheld multiple historical accusations against him, largely for the use of inappropriate language and humour, but including one of \"unwanted physical contact\". Wallace suggested his recently diagnosed autism had played a part in his conduct. After the release of the report, the BBC said Wallace's behaviour had failed to live up to the corporation's values, adding, \"we accept more could and should have been done sooner.\" MasterChef co-host John Torode also had an allegation that he used an \"extremely offensive racist term\" upheld, as part of the same investigation. Torode was also dropped from the show in July, and said he had \"absolutely no recollection\" of the alleged incident. The BBC and BBC Studios have not yet filed a defence to Wallace's claim and told Sky News they will not be commenting on ongoing legal proceedings. \n                  Penny Lancaster says she felt 'belittled' by ex-MasterChef host Gregg Wallace\n                 \n                  'We may see more things coming out': BBC chief quizzed by MPs about talent 'scandal'\n                 \n                  Gregg Wallace speaks out after MasterChef sacking\n                 In court documents, seen by the PA news agency, barrister Lawrence Power said that Wallace had requested \"personal data\" from the BBC and BBC Studios related to \"his work, contractual relations and conduct\". Mr Power continued that Wallace made subject access requests (SARs) to both the BBC and BBC Studios on 6 March. Requests for access to personal data should be processed within a month, but this deadline can be extended if the information is complex, Mr Power said. The barrister continued that on 7 August, the BBC emailed Wallace to apologise for the delay and stated they were \"taking all reasonable steps\" to process the request in \"a timely manner as possible going forward\" but said he has still not received a response. BBC Studios is claimed to have told Wallace that it was withholding parts of his personal data due to \"freedom of expression\".  Mr Power said that the body had \"wrongly redacted\" information and had \"unlawfully failed to supply all of the claimant's personal data\". He said: \"By reason of the defendants failing to fully comply with the SARs made by the claimant for his own personal data, the defendants acted in breach of their statutory duty and in doing so caused distress and harassment to the claimant.\" Mr Power said that Wallace was seeking damages for \"distress, harassment and loss of amenity not exceeding £10,000\", damages under the UK General Data Protection Regulation, and interest. Wallace is also seeking a court order that the BBC and BBC Studios comply with the subject access requests. The BBC made the decision to air the latest series of MasterChef this summer, with Wallace and Torode still at the helm, despite both men having been fired since it was filmed."
    },
    {
        "title": "Drake's defamation lawsuit over Kendrick Lamar's Not Like Us dismissed by judge",
        "description": "Drake's defamation lawsuit over Kendrick Lamar's diss track Not Like Us has been dismissed by a federal judge.",
        "url": "https://news.sky.com/story/drakes-defamation-lawsuit-over-kendrick-lamars-not-like-us-dismissed-by-judge-13448020",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-drake-kendrick-lamar_6801109.jpg?20250116124340",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-10 09:29:00",
        "Headline": "In the rap battle between the pair, which saw them hurl personal insults at each other, the judge called Not Like Us \"the metaphorical killing blow\".",
        "Content": "Drake's defamation lawsuit over Kendrick Lamar's diss track Not Like Us has been dismissed by a federal judge. Judge Jeannette A Vargas said Lamar's lyrics accusing Drake of being a paedophile were not defamatory because they were \"nonactionable opinion\". The Canadian rapper had sued Universal Music Group (UMG) - which releases both artists' music - and Lamar was not named in the lawsuit. In a written opinion published on Thursday, the judge described \"the vitriolic war of words\" that erupted in spring 2024 as \"perhaps the most infamous rap battle in the genre's history\". The feud led to nine tracks back and forth between the two hip-hop stars, with the insults escalating as the tracks progressed, becoming \"vicious, personal\". Other insults included shoe size, fashion sense and cuckolding. The battle concluded with Lamar's Not Like Us, which the judge described as \"the metaphorical killing blow\". One of 2024's biggest songs, it won record of the year and song of the year at the Grammys, achieved most Apple Music streams worldwide, and helped make the 2025 Super Bowl half-time show the most-watched ever. However, the judge said a reasonable listener could not have concluded that the track was conveying objective facts about Drake. She wrote: \"Although the accusation that Plaintiff is a paedophile is certainly a serious one, the broader context of a heated rap battle, with incendiary language and offensive accusations hurled by both participants, would not incline the reasonable listener to believe that 'Not Like Us' imparts verifiable facts about Plaintiff.\" The judge said she considered the forum in which the insults occurred and concluded that the average listener does not think a diss track \"is the product of a thoughtful or disinterested investigation, conveying to the public fact-checked verifiable content\". She wrote Not Like Us was \"replete with profanity, trash-talking, threats of violence, and figurative and hyperbolic language, all of which are indicia of opinion\". A reasonable listener, she added, \"would conclude that Lamar is rapping hyperbolic vituperations\". The lawsuit, which was filed in January, alleged that UMG intentionally published and promoted the track despite knowing that it contained false and defamatory paedophilia allegations against Drake and suggested listeners should resort to vigilante justice. The song's cover art included an aerial image of Drake's Toronto mansion, which he said led to attempted break-ins and the shooting of a security guard. The lawsuit also alleged the track tarnished Drake's reputation and decreased the value of his brand. UMG had denied the allegations, calling the lawsuit \"an affront to all artists and their creative expression\" and one which it said \"never should have seen the light of day\". It said it was \"pleased with the court's dismissal\" and looked forward to continuing its work with Drake in the future. Drake is yet to comment."
    }
]