[
    {
        "title": "Mandelson told Epstein he was 'trying hard' to change bonus policy after payment to husband, files show",
        "description": "Peter Mandelson told Jeffrey Epstein he was \"trying hard\" to change government policy on bankers' bonuses at his request, months after the convicted sex trafficker had paid thousands of pounds to the then UK business secretary's husband.",
        "url": "https://news.sky.com/story/mandelson-told-epstein-he-was-trying-hard-to-change-bonus-policy-after-payment-to-husband-files-show-13501478",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-lord-peter-mandelson_7151106.png?20260131131904",
        "type": "Home",
        "Author": "Paul Kelso, business correspondent, and Sarah Hajibagheri, field news editor",
        "Date Published": "2026-01-31 16:53:00",
        "Headline": "Emails released by the US Department of Justice shed new light on the closeness of the relationship between Jeffrey Epstein and former UK business secretary Peter Mandelson, who was sacked as British ambassador to Washington last year.",
        "Content": "By Paul Kelso, business correspondent, and Sarah Hajibagheri, field news editor  Peter Mandelson told Jeffrey Epstein he was \"trying hard\" to change government policy on bankers' bonuses at his request, months after the convicted sex trafficker had paid thousands of pounds to the then UK business secretary's husband. Emails released by the US Department of Justice (DoJ) on Friday shed new light on the closeness of the relationship between the disgraced financier and Lord Mandelson, who was sacked as British ambassador to Washington last year. The documents include correspondence in September 2009 between Epstein and Lord Mandelson's husband, Reinaldo Avila da Silva, who asked the financier to pay him £10,000 to fund an osteopathy course and other expenses. Epstein responds \"I will wire your loan amount immediate'y\" [sic]. Epstein files - latest updates A few days later, Mr da Silva, who married Lord Mandelson in 2023, replied \"thank you for the money which arrived in my account this morning\". Epstein was released from prison in July 2009, having pleaded guilty to trafficking a minor. In separate emails, exchanged in December 2009, Lord Mandelson, then business secretary in Gordon Brown's government, appears to agree to try to change government policy on taxing bankers' bonuses. Coming just 18 months after the great financial crash and subsequent state rescue of banks, the subject was highly contentious. On 9 December 2009, the then chancellor Alistair Darling announced a 50% \"super tax\" on bonuses, intended to prevent pay being inflated by taxpayer-funded bailouts. In an email exchange on 15 December, in which email addresses are redacted, Epstein asked Mandelson if the policy could be changed. \"any [sic] real chance of making the tax only on the cash portion of the bankers bonus,\" he wrote. Lord Mandelson replied: \"Trying hard to amend as I explained to Jes last night. Treasury digging in but I am on case.\" Epstein responds: \"let me know before jes please,,\". \"Ok. They are not being helpful...\" is the reply. \"they jpm. or they treasury,\" asks Epstein. \"Treasury\" Mandelson replied. \"Jes\" may be a reference to Jes Staley, the former chief executive of Barclays, who in 2009 was head of JP Morgan's investment bank and a close associate of Epstein's. Mr Staley resigned from Barclays in 2020 after the Financial Conduct Authority launched an investigation into his conduct and the transparency of his disclosures about his relationship with Epstein. Emails discuss career prospects and media coverage Epstein and Lord Mandelson go on to discuss the then prime minister Gordon Brown's prospects at the election due the following May. \"gb [sic] needs help in may , not another enemy,\" writes Epstein. \"Or a car crash any earlier,\" writes Mandelson. The email chain about Mr Brown is one of dozens between Epstein and Mandelson that reveal the closeness and length of the relationship. Other exchanges released by the DoJ show the pair sharing regular messages about their whereabouts, making arrangements to meet in person, discussing Lord Mandelson's career options following Labour's 2010 election defeat, and joking about media coverage. Read more:Epstein files: The key findings so farAnalysis: Saying everything and nothing at the same time In one, Lord Mandelson asks Epstein's view of his joining the Facebook board. In another, Epstein sent a link to a Guardian article that proposed Lord Mandelson as a candidate to lead the International Monetary Fund, despite his having no central banking experience. Epstein writes that he hopes the reporter \"you encouraged to write this\" is \"cute\". \"As it happens, I didn't. The Treasury did.\" replies Lord Mandelson. Lord Mandelson, Jes Staley and the Treasury have been approached for comment on the emails. Pictures released of Lord Mandelson in his underwear In separate files, images of Lord Mandelson show the former cabinet minister in his underwear, talking to a woman wearing a bathrobe. Sky News does not know when, where or by whom the photos were taken. A spokesperson for Mandelson told Sky News: \"No one can say who or where the photo was taken. Lord Mandelson has absolutely no idea or indeed whether it has any connection to Epstein at all.\" Appearing in a photo in the Epstein files does not indicate wrongdoing."
    },
    {
        "title": "Israeli strikes kill at least 30 Palestinians in Gaza, hospital officials say",
        "description": "At least 30 Palestinians have been killed in Israeli strikes on Saturday, according to hospitals in Gaza.",
        "url": "https://news.sky.com/story/israeli-strikes-kill-at-least-12-palestinians-in-gaza-hospital-officials-say-13501292",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-gaza-khan-younis_7151221.jpg?20260131150755",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-31 08:00:00",
        "Headline": "The casualties included two women and six children from two different families, according to officials at the Gaza hospitals that received the bodies.",
        "Content": "At least 30 Palestinians have been killed in Israeli strikes on Saturday, according to hospitals in Gaza. The casualties included two women and six children from two different families, officials at the hospitals which received the bodies say. It marks one of the deadliest days in Gaza since a ceasefire was agreed in October. Shifa Hospital said a strike in Gaza City killed a mother, three children and one of their relatives, while Nasser Hospital said a strike in a tent camp in Khan Younis caused a fire to break out, killing seven, including a father, his three children and three grandchildren. Those strikes were reported early in the morning, before Shifa Hospital director Mohamed Abu Selmiya said another airstrike hit a police station in Gaza City, killing at least 14 more people and wounding others. In a statement on Saturday, the Israel Defence Forces (IDF) said it had \"struck four commanders and additional terrorists from the Hamas and Islamic Jihad terrorist organisations across the Gaza Strip\". It also said it struck a weapons storage facility, a weapons manufacturing site, and two launch sites belonging to Hamas in the central Gaza Strip. \n                  Gazans face question of returning to devastated homeland as Rafah crossing reopens\n                 \n                  Pep Guardiola gives passionate speech in support of Palestinian children\n                 \n                  Regime crackdown: Life inside Iran \n                 The IDF claimed the attacks came after Israel found that Hamas had violated the ceasefire agreement on Friday when eight terrorists exited the \"underground terror infrastructure\" in eastern Rafah. It repeated its claims that Hamas uses civilians as human shields, adding it would \"continue to act against any attempt by terrorist organisations in the Gaza Strip to carry out terror attacks against IDF troops and civilians of the State of Israel\". Both Israel and Hamas have blamed each other for breaching the ceasefire since it was agreed after two years of war. Gaza's health ministry, which is run by the Hamas-led government, has recorded more than 500 Palestinian deaths by Israeli attacks since the start of the ceasefire on 10 October last year. Strikes come just before Rafah crossing reopening The latest strikes came a day before the Rafah crossing bordering Egypt, the main route in or out of Gaza for nearly all of the two million people who live there, was set to reopen. All of Gaza's borders have been shut since the war began, though Rafah was briefly opened early in 2025 for the evacuation of sick and wounded Palestinians for treatment, as part of the previous ceasefire deal. Palestinians see the Rafah crossing as a lifeline for the Gazans in need of treatment, because most medical infrastructure within the territory has been destroyed. The World Health Organization estimates nearly 20,000 people could need treatment. Israel has kept the Rafah crossing closed in both directions since the ceasefire in October, demanding Hamas must abide by the agreement to return all hostages still in Gaza, living and deceased. Read more: How Rafah crossings will work The remains of the last Israeli hostage in Gaza, 24-year-old Ran Gvili, were retrieved around a week ago. He was killed at the Alumim kibbutz during the October 7 attacks in 2023, before his body was taken to Gaza. Israeli officials have said the \"limited reopening\" on Sunday comes in line with US president Donald Trump's 20-point peace plan. Sky News understands Israel will not put a limit on the number of people allowed to leave Gaza via the crossing, but will cap the number of people allowed to cross back into Gaza from Egypt at 150 per day. Palestinian officials suggest that around 100,000 people have fled Gaza since the war began."
    },
    {
        "title": "Yellow weather warning for parts of England already hit by severe rain",
        "description": "Parts of England already saturated by days of heavy rain are facing more downpours next week.",
        "url": "https://news.sky.com/story/weather-warning-for-parts-of-england-already-hit-by-severe-rain-13501643",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-somerset-flooding-storm-chandra_7151624.jpg?20260131193109",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-31 19:10:00",
        "Headline": "Earlier this week, a major incident was declared in Somerset as about 50 properties were hit by flooding caused by Storm Chandra - which followed stormy weather at the beginning of the month which left thousands without power in Cornwall.",
        "Content": "Parts of England already saturated by days of heavy rain are facing more downpours next week. The Met Office has issued a yellow weather warning covering the South West from midday on Monday to 9am on Tuesday. It comes after weeks of heavy rain and stormy conditions, with tens of thousands of people temporarily left without power in Cornwall at the start of January. Earlier this week, a major incident was declared in Somerset as about 50 properties were hit by flooding caused by Storm Chandra, according to the county council. As of 7pm on Saturday, there were already 57 government flood warnings (flooding is expected) across the South and 117 alerts (flooding is possible) in place, despite the Met Office warning for more severe rainfall not coming into force until Monday. By that point, accumulations of 10-20mm of rainfall will be \"possible fairly widely\" in the South West, the Met Office said, \"with perhaps as much as 30-50mm over Dartmoor\", in Devon. There is a small chance of homes and businesses flooding, and fast-flowing or deep floodwater could cause danger to life, the yellow warning added. \"Outbreaks of rain may become persistent on Monday, especially later in the day and overnight, before gradually easing and clearing into Tuesday,\" it said. \"Given saturated ground following recent rain, there is a chance this may leading to some flooding and disruption in places.\" Sudden stratospheric warming event possible in February Official statistics for rainfall in January are set to be released on Monday, but it has been a very wet month for large parts of the UK. Sky News meteorologist Kirsty McCabe said parts of the South West, as well as Northern Ireland and eastern Scotland, had seen close to twice their typical January rainfall. Read more from Sky News:What are weather warnings and how do they work?King surprises parkrun joggersWhen can you spot this year's Snow Moon? Further ahead, there is a possibility of a sudden stratospheric warming (SSW) event in early February which could trigger a cold spell, she added. This is when rapid warming occurs high up in the stratosphere, potentially causing knock-on effects in our weather at the surface. While SSWs don't always result a cold snap, it greatly increases the risk of wintry weather, and they have been responsible for events like the Beast from the East in 2018. Before this, government flood advice for the next few days has said ongoing groundwater flooding is \"probable in parts of the South of England\", while river flooding in the Somerset Levels wetland is also possible over the next five days. \"Land, roads and properties could flood and there could be travel disruption. Coastal flooding is also possible from Monday to Wednesday, especially on the coasts of the South West of England on Wednesday.\" Meanwhile, in Ireland, clean-up operations have been under way after homes and roads were impacted by flooding. Parts of Co Wexford were among the worst-hit areas - with people being advised to avoid Our Lady's Island following a landslide."
    },
    {
        "title": "Andy Burnham shares message for Labour Gorton and Denton by-election candidate - after being blocked from standing",
        "description": "Andy Burnham has backed Labour's newly announced candidate for the Gorton and Denton by-election, after being blocked from standing himself by the party's governing body.",
        "url": "https://news.sky.com/story/andy-burnham-shares-message-for-labour-gorton-and-denton-by-election-candidate-after-being-blocked-from-standing-13501711",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-andy-burnham-mayor_7151788.jpg?20260131214156",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-31 21:24:00",
        "Headline": "The Mayor of Greater Manchester requested permission to stand for the contest - but Labour's National Executive Committee voted to block his request.",
        "Content": "Andy Burnham has backed Labour's newly announced candidate for the Gorton and Denton by-election, after being blocked from standing himself by the party's governing body. In a post on X, the Greater Manchester mayor congratulated Angeliki Stogia, a city councillor for Whalley Range, and said she would do \"a great job\". He added: \"I will be there for you whenever you need me.\" Mr Burnham, whose potential return to Westminster was seen by many as a possible challenge to Sir Keir Starmer's leadership, formally requested permission to stand for the contest last weekend. As mayor he needed approval to contest a different political election - but Labour's National Executive Committee (NEC) voted to block his request the following day. The by-election was prompted by the resignation of former MP Andrew Gwynne, who stood down citing health reasons, and Ms Stogia was announced as the party's candidate on Saturday afternoon. Describing herself as a \"proud Mancunian woman\" at a launch event, Ms Stogia said: \"This is about Manchester. Manchester is a city united, we are rejecting division. I am so looking forward to going out on the doorstep and winning this for Labour.\" The east Manchester seat has been Labour since before the Second World War - but both Reform UK and the Green Party are now eyeing victory as Sir Keir faces internal revolt over the decision to block Mr Burnham. PM criticises Reform UK's 'politics of division' GB News presenter and former academic Matt Goodwin is in the running for Reform UK, while councillor and plumber Hannah Spencer is representing the Greens and local campaigner Jackie Pearcey the Liberal Democrats. The prime minister has insisted his party's decision to not allow Mr Burnham to run is the right one, because doing so would \"divert our resources\". Asked during the final leg of his recent trip to east Asia if the by-election should be viewed as a referendum on his premiership, Sir Keir responded with criticism of Reform UK's \"politics of poisonous division\" - highlighting apparent endorsement of Mr Goodwin by far-right activist Tommy Robinson, whose real name Stephen Yaxley-Lennon. \"It is very much and very clearly now a by-election between Labour and Reform on key principles,\" the prime minister said. \"I see that Tommy Robinson, I think, has just come out in support of Matt Goodwin... That tells you everything about the politics they intend to inject into this by-election, the politics of poisonous division, so we can see exactly where that's going.\" Read more:Farage and Polanski could both inflict huge damage on LabourWhat do local residents think of move to block Burnham? Labour is the \"only contender\", Sir Keir insisted, adding: \"So, it's Labour versus Reform and we will fight for renewal, for inclusive communities and bringing people together, and for true patriotism against the plastic patriotism of Reform.\" The prime minister did not say whether he would join the campaign efforts on the ground in the constituency. Labour previously won the seat with more than half the vote - 18,555 - in 2024, with Nigel Farage's Reform UK coming second with 5,142 votes, narrowly beating the Greens at 4,810. A Reform UK spokesman said the party has been \"consistently clear\" on its view of Robinson and that \"he isn't welcome in the party\"."
    },
    {
        "title": "Blackouts in Ukraine and Moldova as power lines fail in sub-zero temperatures after Russian airstrikes",
        "description": "Parts of Ukraine and Moldova suffered power cuts on Saturday after high-voltage power lines failed while both countries were affected by sub-zero temperatures.",
        "url": "https://news.sky.com/story/blackouts-in-ukraine-and-moldova-as-power-lines-fail-amid-sub-zero-temperatures-13501424",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-kyiv-ukraine-russia_7151318.jpg?20260131163042",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-31 15:25:00",
        "Headline": "The outages come as people in both countries face severe winter weather, with temperatures in Kyiv forecast to fall to -11C (12F) on Saturday, before plunging as low as -17C (1F) before Wednesday, according to the UK Met Office.",
        "Content": "Parts of Ukraine and Moldova suffered power cuts on Saturday after high-voltage power lines failed while both countries were affected by sub-zero temperatures. Kyiv and Chisinau, the capital cities, were among the areas affected by the power outage after lines malfunctioned at 10.42​am local time. Ukraine's power grid has been severely compromised by Russian airstrikes during its nearly four-year war with Moscow, leading to ​severe restrictions on electricity supplies in recent weeks. Officials in Kyiv did not directly link the accident to war damage, and Ukraine's digital ministry said it was not caused by a cyber attack. Moscow has agreed to halt strikes on energy infrastructure until 1 February at the request of US ‌President Donald Trump. Kyiv said it would reciprocate, and the countries have not reported any major attacks. Mr Trump's special envoy Steve Witkoff said on Saturday he and other US officials had held \"productive and constructive meetings\" with his Russian counterpart, Kirill Dmitriev, as Washington strives to find \"a peaceful resolution of the Ukrainian conflict\". In a post on X, Mr Witkoff said the talks in Florida show \"Russia is working toward securing peace\". The outages come as people in both countries face severe winter weather, with temperatures in Kyiv forecast to fall to -11C (12F) on Saturday, before plunging as low as -17C (1F) before Wednesday, according to the UK Met Office. Temperatures in some areas will drop as low as -30C (-22F) early next week, Ukraine's State Emergency Service said. Moldova is also having a weekend cold snap, as -7C (19F) on Saturday drops as low as -10C (14F) on Monday. As well as the two countries' capitals, at least five Ukrainian regions, including Zhytomyr in the centre of the country and Kharkiv in the northeast, as well as parts of Moldova, were affected by the blackouts. The metro in Kyiv suspended operations, and water supplies in the city were cut. Traffic lights and some public transport in Chisinau were not working, according to ‍the city mayor, and most districts did not have electricity. Power was partially restored in both countries early on Saturday afternoon as workers hurried to stabilise ‌interconnected grids. Read more on Sky News:At least 200 killed in landslideThe week's most striking images Supplies will be back to where they were by evening, said Oleksandr Kharchenko, the director of Kyiv's independent Energy Research ‌Centre. A technical malfunction led to two high-voltage power lines causing \"a cascading outage in Ukraine's power grid\", Ukraine's energy minister Denys Shmyhal said. One of the lines linked the grids of Romania and Moldova, while the other connected western and central Ukraine, he said. Moldova's energy ministry said the disruption there was triggered by serious problems in Ukraine's grid that led to a voltage drop on the line connecting Romania and Moldova. Romanian energy officials have not commented."
    },
    {
        "title": "Two explosions reported in Iran - as Israel denies involvement",
        "description": "Two explosions have been reported in Iran as the regime denied a &#8204;military leader was targeted, amid heightened tension in the region.",
        "url": "https://news.sky.com/story/explosion-reported-in-iran-as-it-denies-military-leader-targeted-13501162",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iran-explosion_7151063.jpg?20260131123145",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-31 00:01:00",
        "Headline": "At least five people are understood to have been killed in two separate blasts across the country. ",
        "Content": "Two explosions have been reported in Iran as the regime denied a ‌military leader was targeted, amid heightened tension in the region. ‌One blast happened at Iran's southern port of Bandar Abbas on Saturday, local media reported. One person, a four-year-old girl, was killed and a further 14 were injured. A second blast, more than 1,000 kilometres away in Ahvaz, saw four people killed, local officials said. Local media reports said both incidents were gas explosions and Israel has denied involvement. Social media reports alleging a ‌Revolutionary ⁠Guard navy ‌commander was targeted ‍in the Bandar Abbas explosion were \"completely false\", the semi-official Tasnim ​news agency said. The blast hit an eight-storey building, causing serious damage to the first to third floors, Fars news agency reported. Persian Gulf Radio claimed that several cars and a shop had also been damaged. Rescue and firefighting teams are currently understood to be at the scene. Footage taken by Fars shows the aftermath of the explosion - with glass and rubble strewn across the ground. The port of Bandar Abbas lies on the Strait of Hormuz, which is a vital shipping route between Iran and Oman. It handles about a fifth of the world's seaborne oil. It comes amid rising tension in the region as the US builds up its military presence nearby. It also follows nationwide protests - prompted by economic issues but which quickly turned into an effort to overthrow the Iranian regime. The protests were quickly stamped out by the Iranian Revolutionary Guard and the number of people killed is thought to be in the thousands. Earlier this week, US President Donald Trump said a \"large armada\" was heading toward Iran, warning if the two countries don't make a deal \"we'll see what happens\"."
    },
    {
        "title": "Northern Ireland should hold unity referendum by 2030, first minister says",
        "description": "Northern Ireland should hold a referendum on whether it should become part of a united Ireland by 2030, the country's first minister has said.",
        "url": "https://news.sky.com/story/northern-ireland-should-hold-unity-referendum-by-2030-first-minister-says-13501305",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-michelle-o-neill-first-minister_7150990.jpg?20260131103555",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-31 09:26:00",
        "Headline": "Michelle O'Neill said \"now is the time for the plan and the preparation\" and claimed Brexit was \"done against the wishes of the people\".",
        "Content": "Northern Ireland should hold a referendum on whether it should become part of a united Ireland by 2030, the country's first minister has said. Speaking to the Sunday Morning With Trevor Phillips show ahead of its being shown tomorrow, Michelle O'Neill said it was an opportunity for the people of Northern Ireland to \"take control of our own fortunes\". Ms O'Neill was asked if she could imagine a so-called border poll during her time as first minister, and replied: \"Yes, I absolutely can.\" She said: \"I think my party's view is that we should have this by 2030. I think that's only a short way away. \"So now is the time for the plan and the preparation.\" The first minister added: \"I don't want done to the people here what was done in relation to Brexit. \"Brexit was an economic self-harm, a massive act of economic self-harm. \"It was done against the wishes of the people.\" She said: \"We have an ability to take control of our own fortunes. I encourage all political leaders to reach for that together.\" Her remarks appear to contradict what Ireland's premier Micheal Martin has said about the referendum. In September, the Irish prime minister (taoiseach) said \"there won't be a border poll before 2030\". Northern Ireland's deputy first minister also appeared on Sunday Morning With Trevor Phillips and said the nationalist and republican movements in Northern Ireland have not increased their vote share since Westminster devolved power to Northern Ireland in 1998. Emma Little Pengelly said: \"I'm a unionist, we have a Sinn Fein first minister. But I think it's important to say that in Northern Ireland nationalism and republicanism haven't increased their vote from 1998. \"Despite democratic change, they're sitting on and around the same percentage that they had in 1998. I think those who want to see the breakup of the union do try to constantly get this momentum. \"I have no doubt that you will hear that again because of course to serve their purpose is to try to get that sense of momentum towards that. That doesn't exist in Northern Ireland.\" The full interviews with Michelle O'Neill and Emma Little Pengelly will be broadcast on Sunday Morning With Trevor Phillips from 8.30am."
    },
    {
        "title": "Mandelson told Epstein he was 'trying hard' to change bonus policy after payment to husband, files show",
        "description": "Peter Mandelson told Jeffrey Epstein he was \"trying hard\" to change government policy on bankers' bonuses at his request, months after the convicted sex trafficker had paid thousands of pounds to the then UK business secretary's husband.",
        "url": "https://news.sky.com/story/mandelson-told-epstein-he-was-trying-hard-to-change-bonus-policy-after-payment-to-husband-files-show-13501478",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-lord-peter-mandelson_7151106.png?20260131131904",
        "type": "UK",
        "Author": "Paul Kelso, business correspondent, and Sarah Hajibagheri, field news editor",
        "Date Published": "2026-01-31 16:53:00",
        "Headline": "Emails released by the US Department of Justice shed new light on the closeness of the relationship between Jeffrey Epstein and former UK business secretary Peter Mandelson, who was sacked as British ambassador to Washington last year.",
        "Content": "By Paul Kelso, business correspondent, and Sarah Hajibagheri, field news editor  Peter Mandelson told Jeffrey Epstein he was \"trying hard\" to change government policy on bankers' bonuses at his request, months after the convicted sex trafficker had paid thousands of pounds to the then UK business secretary's husband. Emails released by the US Department of Justice (DoJ) on Friday shed new light on the closeness of the relationship between the disgraced financier and Lord Mandelson, who was sacked as British ambassador to Washington last year. The documents include correspondence in September 2009 between Epstein and Lord Mandelson's husband, Reinaldo Avila da Silva, who asked the financier to pay him £10,000 to fund an osteopathy course and other expenses. Epstein responds \"I will wire your loan amount immediate'y\" [sic]. Epstein files - latest updates A few days later, Mr da Silva, who married Lord Mandelson in 2023, replied \"thank you for the money which arrived in my account this morning\". Epstein was released from prison in July 2009, having pleaded guilty to trafficking a minor. In separate emails, exchanged in December 2009, Lord Mandelson, then business secretary in Gordon Brown's government, appears to agree to try to change government policy on taxing bankers' bonuses. Coming just 18 months after the great financial crash and subsequent state rescue of banks, the subject was highly contentious. On 9 December 2009, the then chancellor Alistair Darling announced a 50% \"super tax\" on bonuses, intended to prevent pay being inflated by taxpayer-funded bailouts. In an email exchange on 15 December, in which email addresses are redacted, Epstein asked Mandelson if the policy could be changed. \"any [sic] real chance of making the tax only on the cash portion of the bankers bonus,\" he wrote. Lord Mandelson replied: \"Trying hard to amend as I explained to Jes last night. Treasury digging in but I am on case.\" Epstein responds: \"let me know before jes please,,\". \"Ok. They are not being helpful...\" is the reply. \"they jpm. or they treasury,\" asks Epstein. \"Treasury\" Mandelson replied. \"Jes\" may be a reference to Jes Staley, the former chief executive of Barclays, who in 2009 was head of JP Morgan's investment bank and a close associate of Epstein's. Mr Staley resigned from Barclays in 2020 after the Financial Conduct Authority launched an investigation into his conduct and the transparency of his disclosures about his relationship with Epstein. Emails discuss career prospects and media coverage Epstein and Lord Mandelson go on to discuss the then prime minister Gordon Brown's prospects at the election due the following May. \"gb [sic] needs help in may , not another enemy,\" writes Epstein. \"Or a car crash any earlier,\" writes Mandelson. The email chain about Mr Brown is one of dozens between Epstein and Mandelson that reveal the closeness and length of the relationship. Other exchanges released by the DoJ show the pair sharing regular messages about their whereabouts, making arrangements to meet in person, discussing Lord Mandelson's career options following Labour's 2010 election defeat, and joking about media coverage. Read more:Epstein files: The key findings so farAnalysis: Saying everything and nothing at the same time In one, Lord Mandelson asks Epstein's view of his joining the Facebook board. In another, Epstein sent a link to a Guardian article that proposed Lord Mandelson as a candidate to lead the International Monetary Fund, despite his having no central banking experience. Epstein writes that he hopes the reporter \"you encouraged to write this\" is \"cute\". \"As it happens, I didn't. The Treasury did.\" replies Lord Mandelson. Lord Mandelson, Jes Staley and the Treasury have been approached for comment on the emails. Pictures released of Lord Mandelson in his underwear In separate files, images of Lord Mandelson show the former cabinet minister in his underwear, talking to a woman wearing a bathrobe. Sky News does not know when, where or by whom the photos were taken. A spokesperson for Mandelson told Sky News: \"No one can say who or where the photo was taken. Lord Mandelson has absolutely no idea or indeed whether it has any connection to Epstein at all.\" Appearing in a photo in the Epstein files does not indicate wrongdoing."
    },
    {
        "title": "Sir Richard Branson told Epstein 'bring your harem' and advised him on PR, new emails show",
        "description": "Sir Richard Branson told Jeffrey Epstein he would love to see him again \"as long as you bring your harem\" in emails newly-released from the Epstein files.",
        "url": "https://news.sky.com/story/branson-told-epstein-bring-your-harem-and-advised-him-on-pr-new-emails-show-13501345",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-richard-branson-jeffrey-epstein_7151176.jpg?20260131144028",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-31 12:20:00",
        "Headline": "Sir Richard's team say he would never have used this term if the full facts had been known.",
        "Content": "Sir Richard Branson told Jeffrey Epstein he would love to see him again \"as long as you bring your harem\" in emails newly-released from the Epstein files. In the exchange, from September 2013, the disgraced financier also asked for Sir Richard's \"thoughts\" on a \"public relations\" matter, apparently after visiting him the previous day. The Virgin boss responded saying it was \"really nice seeing you\" and that Epstein would be welcome to visit again, adding: \"as long as you bring your harem!\" Sir Richard's team say he would never have used this term if the full facts had been known and was repeating a phrase used by Epstein. Sir Richard then turned to the public relations matter. He advised: \"I think if Bill Gates was willing to say that you've been a brilliant advisor to him, that you slipped up many years ago by sleeping with a 17 1/2 year old woman and were punished for it, that you've more than learnt your lesson and have done nothing that's against the law since and, yes, as a single man you seem to have a penchant for women. But there's nothing wrong with that. Anyway something along those lines.\" In earlier email correspondence, from April 2013, plans were discussed for Epstein to visit Sir Richard's private island, Necker. \n                  Epstein files latest: Starmer calls for Andrew to testify before US Congress as 'victims have to be first priority'\n                 \n                  Epstein files: Key findings so far after more than three million pages released\n                 \n                  Epstein files release - saying everything and nothing at the same time\n                 Writing to Sir Richard, Epstein's assistant asks about bringing along an associate of Bill Gates, Boris Nikolic. A subsequent email adds more names to Epstein's entourage, along with \"2 Russian girls\". Sir Richard's team is understood to acknowledge Epstein's presence at two brief business meetings on Necker Island in April and September 2013. It is claimed both meetings were organised by an unnamed American entrepreneur. At the second, Epstein is said by Sir Richard's team, to have arrived on the entrepreneur's helicopter, with three adult women who did not attend their meeting but socialised with a sports team on the island. Epstein is later said to have referred to the women as his \"harem\". Epstein is also said, by Sir Richard's team, to have mentioned that he'd served time in prison for a consensual relationship with someone who was nearly 18, and asked for Sir Richard's public relations advice on the matter. Read more:Epstein files: Key findings so farClintons refuse to testify in Epstein investigation Simply being mentioned in the Epstein Files isn't a sign of wrongdoing. A Virgin Group spokesperson said: \"Any contact Richard and Joan Branson had with Epstein took place on only a few occasions more than twelve years ago, and was limited to group or business settings, such as a charity tennis event. \"When Epstein offered a charity donation, the Bransons asked their team to carry out due diligence before accepting the donation, which uncovered serious allegations. \"As a result of what the due diligence uncovered, Virgin Unite did not take the donation and Richard and Joan decided not to meet or speak with Epstein again. \"Had they had the full picture and information, there would have been no contact whatsoever - Richard believes that Epstein's actions were abhorrent and supports the right to justice for his many victims.\""
    },
    {
        "title": "Yellow weather warning for parts of England already hit by severe rain",
        "description": "Parts of England already saturated by days of heavy rain are facing more downpours next week.",
        "url": "https://news.sky.com/story/weather-warning-for-parts-of-england-already-hit-by-severe-rain-13501643",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-somerset-flooding-storm-chandra_7151624.jpg?20260131193109",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-31 19:10:00",
        "Headline": "Earlier this week, a major incident was declared in Somerset as about 50 properties were hit by flooding caused by Storm Chandra - which followed stormy weather at the beginning of the month which left thousands without power in Cornwall.",
        "Content": "Parts of England already saturated by days of heavy rain are facing more downpours next week. The Met Office has issued a yellow weather warning covering the South West from midday on Monday to 9am on Tuesday. It comes after weeks of heavy rain and stormy conditions, with tens of thousands of people temporarily left without power in Cornwall at the start of January. Earlier this week, a major incident was declared in Somerset as about 50 properties were hit by flooding caused by Storm Chandra, according to the county council. As of 7pm on Saturday, there were already 57 government flood warnings (flooding is expected) across the South and 117 alerts (flooding is possible) in place, despite the Met Office warning for more severe rainfall not coming into force until Monday. By that point, accumulations of 10-20mm of rainfall will be \"possible fairly widely\" in the South West, the Met Office said, \"with perhaps as much as 30-50mm over Dartmoor\", in Devon. There is a small chance of homes and businesses flooding, and fast-flowing or deep floodwater could cause danger to life, the yellow warning added. \"Outbreaks of rain may become persistent on Monday, especially later in the day and overnight, before gradually easing and clearing into Tuesday,\" it said. \"Given saturated ground following recent rain, there is a chance this may leading to some flooding and disruption in places.\" Sudden stratospheric warming event possible in February Official statistics for rainfall in January are set to be released on Monday, but it has been a very wet month for large parts of the UK. Sky News meteorologist Kirsty McCabe said parts of the South West, as well as Northern Ireland and eastern Scotland, had seen close to twice their typical January rainfall. Read more from Sky News:What are weather warnings and how do they work?King surprises parkrun joggersWhen can you spot this year's Snow Moon? Further ahead, there is a possibility of a sudden stratospheric warming (SSW) event in early February which could trigger a cold spell, she added. This is when rapid warming occurs high up in the stratosphere, potentially causing knock-on effects in our weather at the surface. While SSWs don't always result a cold snap, it greatly increases the risk of wintry weather, and they have been responsible for events like the Beast from the East in 2018. Before this, government flood advice for the next few days has said ongoing groundwater flooding is \"probable in parts of the South of England\", while river flooding in the Somerset Levels wetland is also possible over the next five days. \"Land, roads and properties could flood and there could be travel disruption. Coastal flooding is also possible from Monday to Wednesday, especially on the coasts of the South West of England on Wednesday.\" Meanwhile, in Ireland, clean-up operations have been under way after homes and roads were impacted by flooding. Parts of Co Wexford were among the worst-hit areas - with people being advised to avoid Our Lady's Island following a landslide."
    },
    {
        "title": "Andy Burnham shares message for Labour Gorton and Denton by-election candidate - after being blocked from standing",
        "description": "Andy Burnham has backed Labour's newly announced candidate for the Gorton and Denton by-election, after being blocked from standing himself by the party's governing body.",
        "url": "https://news.sky.com/story/andy-burnham-shares-message-for-labour-gorton-and-denton-by-election-candidate-after-being-blocked-from-standing-13501711",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-andy-burnham-mayor_7151788.jpg?20260131214156",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-31 21:24:00",
        "Headline": "The Mayor of Greater Manchester requested permission to stand for the contest - but Labour's National Executive Committee voted to block his request.",
        "Content": "Andy Burnham has backed Labour's newly announced candidate for the Gorton and Denton by-election, after being blocked from standing himself by the party's governing body. In a post on X, the Greater Manchester mayor congratulated Angeliki Stogia, a city councillor for Whalley Range, and said she would do \"a great job\". He added: \"I will be there for you whenever you need me.\" Mr Burnham, whose potential return to Westminster was seen by many as a possible challenge to Sir Keir Starmer's leadership, formally requested permission to stand for the contest last weekend. As mayor he needed approval to contest a different political election - but Labour's National Executive Committee (NEC) voted to block his request the following day. The by-election was prompted by the resignation of former MP Andrew Gwynne, who stood down citing health reasons, and Ms Stogia was announced as the party's candidate on Saturday afternoon. Describing herself as a \"proud Mancunian woman\" at a launch event, Ms Stogia said: \"This is about Manchester. Manchester is a city united, we are rejecting division. I am so looking forward to going out on the doorstep and winning this for Labour.\" The east Manchester seat has been Labour since before the Second World War - but both Reform UK and the Green Party are now eyeing victory as Sir Keir faces internal revolt over the decision to block Mr Burnham. PM criticises Reform UK's 'politics of division' GB News presenter and former academic Matt Goodwin is in the running for Reform UK, while councillor and plumber Hannah Spencer is representing the Greens and local campaigner Jackie Pearcey the Liberal Democrats. The prime minister has insisted his party's decision to not allow Mr Burnham to run is the right one, because doing so would \"divert our resources\". Asked during the final leg of his recent trip to east Asia if the by-election should be viewed as a referendum on his premiership, Sir Keir responded with criticism of Reform UK's \"politics of poisonous division\" - highlighting apparent endorsement of Mr Goodwin by far-right activist Tommy Robinson, whose real name Stephen Yaxley-Lennon. \"It is very much and very clearly now a by-election between Labour and Reform on key principles,\" the prime minister said. \"I see that Tommy Robinson, I think, has just come out in support of Matt Goodwin... That tells you everything about the politics they intend to inject into this by-election, the politics of poisonous division, so we can see exactly where that's going.\" Read more:Farage and Polanski could both inflict huge damage on LabourWhat do local residents think of move to block Burnham? Labour is the \"only contender\", Sir Keir insisted, adding: \"So, it's Labour versus Reform and we will fight for renewal, for inclusive communities and bringing people together, and for true patriotism against the plastic patriotism of Reform.\" The prime minister did not say whether he would join the campaign efforts on the ground in the constituency. Labour previously won the seat with more than half the vote - 18,555 - in 2024, with Nigel Farage's Reform UK coming second with 5,142 votes, narrowly beating the Greens at 4,810. A Reform UK spokesman said the party has been \"consistently clear\" on its view of Robinson and that \"he isn't welcome in the party\"."
    },
    {
        "title": "Lord Triesman, ex-Labour minister and FA chairman, dies",
        "description": "Former Labour minister Lord Triesman, who was \"vital\" to New Labour, according to Sir Tony Blair, has died at the age of 82, the party has said.",
        "url": "https://news.sky.com/story/lord-triesman-ex-labour-minister-and-fa-chairman-dies-13501629",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-david-triesman-football-association_7151565.jpg?20260131184418",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-31 18:32:00",
        "Headline": "David Triesman, who was the party's general secretary and served as a Foreign Office minister and as under-secretary of state for innovation, universities and skills, died \"peacefully and at home,\" on Friday, Labour said in a statement.",
        "Content": "Former Labour minister Lord Triesman, who was \"vital\" to New Labour, according to Sir Tony Blair, has died at the age of 82, the party has said. David Triesman, who also served as chairman of the Football Association, died \"peacefully and at home\" on Friday, the party said in a statement. He was the general secretary of the AUT (Association of University Teachers), and the general secretary of the Labour Party, before he joined Sir Tony Blair's government in the House of Lords in 2004, Labour said. He served as a Foreign Office minister and then later as under-secretary of state for innovation, universities and skills before a stint as shadow minister for foreign affairs. The statement said he was \"a politician, a trade union leader, an academic and a merchant banker\" who \"pursued a very active role in the House of Lords from 2004 [as Baron Triesman, of Tottenham] until his death\". He was also a Lord in Waiting to Queen Elizabeth II from 2004-2022, Labour's statement said. The party added: \"A passionate Spurs fan, Lord Triesman became the first patron of the Tottenham Hotspur Foundation and the first independent chair of the FA (Football Association) from which platform he advocated intensely against racism in football and for the increased centrality of the women's football. \n                  Postponed local elections - what is happening?\n                 \n                  Scotland's health secretary Neil Gray repeatedly asked if Queen Elizabeth University Hospital is 'safe'\n                 \n                  Gorton and Denton by-election: Farage and Polanski could both inflict huge damage on Labour\n                 \"He later played an important role in the exposing of corruption within FIFA.\" The statement concluded: \"Beyond his many public roles, David will be ever missed by his family and friends for his warmth, love, humour, insight and the ceaseless encouragement he gave to the younger generations of their family and their friends' families.\" Prime Minister Sir Keir Starmer said he was \"saddened\" by the news, adding that Lord Triesman \"will be remembered for his brilliant contribution to our party and country, including as Labour general secretary and a government minister. \"My thoughts are with his family and friends,\" the prime minister said. Health Secretary Wes Streeting said Lord Triesman was \"a great man\", who offered him \"wisdom and advice when he was an NUS (National Union of Students) officer\". Former prime minister Sir Tony Blair said the peer was a \"vital part of the New Labour movement and became in time a great friend\". The peer was \"passionate about the cause, whether the Labour Party or football\" and was \"deeply committed to making change to improve people's lives\". The FA said on X it was \"saddened\" to hear of his death. Baroness Angela Smith, leader of the House of Lords, said he was \"respected and loved by his colleagues for his courtesy, kindness, wisdom, loyalty and generosity of spirit\". Read more on Sky News:Starmer ducks Trump's China jibeUnited Ireland ballot 'by 2030' - O'NeillEpstein 'sent cash to Mandelson's partner' \"He was great company with a wide circle of friends who shared lively conversations on his many interests and enthusiasms, particularly but not exclusively, politics and football,\" she added. \"David bore his illness with amazing courage and even in the last weeks of his life he was engaging company.\" Hollie Ridley, Labour's general secretary, also said her predecessor's \"commitment to public service was admirable and he will be much missed by those who he worked so closely with\". He is survived by his wife Lucy, Lady Triesman, and their daughter Ilona, the party said, adding that they asked for \"their privacy to be respected at this sad time\"."
    },
    {
        "title": "'Robots listening to robots': How AI music fraudsters are spamming sites and taking cash from real musicians",
        "description": "The moment you make your first AI music track can feel quite magical, especially if you are as profoundly unmusical as me.",
        "url": "https://news.sky.com/story/robots-listening-to-robots-how-ai-music-fraudsters-are-spamming-sites-and-taking-cash-from-real-musicians-13500953",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-ai-music_7151028.jpg?20260131112736",
        "type": "UK",
        "Author": "Rowland Manthorpe",
        "Date Published": "2026-01-31 00:01:00",
        "Headline": "The tracks are not fraudulent, but the behaviour around them is. Someone will upload an AI track then use a bot to repeatedly listen to it to rack up royalties. Streaming services face a increasing battle to stem the flow.",
        "Content": "\n          Technology correspondent\n              @rowlsmanthorpe\n The moment you make your first AI music track can feel quite magical, especially if you are as profoundly unmusical as me. I cannot hold a note or even reliably maintain a beat, yet in 30 seconds I can now make an entire pop song, lyrics and all. Or a soul song. Or a metal track. Whatever comes to mind - you just tell the AI engine what you want and it does the rest. The output might be a little generic, but as far as listeners are concerned it's indistinguishable from the real thing. Even people far more musically aware than me cannot tell the difference between human and artificial songs. The musical Turing Test has been well and truly passed. AI music is a perfect example of the power of artificial intelligence to take complicated tasks and automate them to a standard that was unimaginable only a few years ago. Yet, as ever with technology, removing friction comes with a cost. I have spent the last few months investigating AI music. What has emerged is a picture of a vast attempted fraud, as technologically-equipped criminals use AI tools to try and take billions of pounds away from real-life musicians. \n                  AI-assisted mammograms result in fewer aggressive and advanced breast cancers, study suggests\n                 \n                  UK rolls out free AI training, but will it save your job?\n                 \n                  Actors' union offered better deal over AI protections\n                 The fraud takes place in two stages which sound like something from a science-fiction novel, but are now part of everyday life in the hidden world of the internet economy. First, the fraudsters make huge amounts of AI music. Then, they build bots to stream that music over and over again and thereby make some royalties. Yes, this is a case of robots listening to robot music. The defence? More robots. Let me explain. Thanks to the ease with which AI music can be made, production of it is already reaching an industrial scale. The best figures we have on the number of AI tracks being released come from Deezer, a streaming site which is the French equivalent of Spotify or Apple Music. It estimates that 60,000 fully AI tracks are being uploaded to its site every day, over a third of all production. To put that into context: in 2015 the entire US music industry made around 57,000 songs. A decade later, Deezer is set to receive 21 million AI tracks a year - and this is a conservative estimate, because the scale of AI music production is growing by the month. \"It's a way to totally flood the music streaming services,\" says Romain Hennequin, head of research at Deezer, who has developed an algorithm to detect AI music being uploaded to the platform, picking up tiny features of the music which are inaudible to the human ear. The tracks themselves are not actually fraudulent, but the behaviour around them is. Someone will upload an AI track then use an automated system - a bot - to listen to a song again and again in order to make royalties from it. This isn't a minor aspect of AI music perpetrated by a few bad apples. According to Thibault Roucou, Deezer's head of royalties: \"The vast majority of the listeners of this content is in fact what we call stream manipulation or fraud.\" His algorithms, which pick up unnatural activity on the platform in the same way that a bank looks for unusual activity around payments, suggest that as much as 85% of all listens on fully AI music are fraudulent. This is not just an issue for Deezer, but also for artists, because of the way that payments work on streaming services. There is no set price for a single stream; instead, artists get paid from a common royalty pool depending on the proportion of streams they get. This means that if someone generates a huge number of streams, they will take money away from everyone else, by reducing the amount in the common pool. The sums involved are extremely large. \"We detect 8 to 9% of the stream as being fraudulent,\" says Alexis Lanternier, CEO of Deezer. \"If you implement this 8% to the world of music, it's roughly a few billion dollars, two to three.\" 'An ongoing battle' Deezer says it is identifying the bots using their own automated systems in order to prevent the tracks they stream from generating royalties, but the fraudsters are always looking for new ways to get past the defences. \"It's an ongoing battle,\" says head of royalties Roucou. \"I think we will not lose, but we will not win anyway because they will continue to improve, and we will also. And we hope we will be able… to prevent them from taking too much money from other artists.\" When I spoke to human artists about the situation, they were shocked. \"As artists, we get such a small fraction of the money that we actually deserve to get because of the streaming system. And for that to just be getting cut shorter and shorter and shorter through robots… it makes my blood boil,\" says folk musician Lila Tristram. \"The music industry needs to get their hands around this a little bit, otherwise it could rapidly get quite out of control,\" says Aidan Grant, founder of music production agency Different Sauce. But what can be done? The genie of AI music is out of the bottle now, so currently the debate is on the best way to alert consumers and musicians. Deezer has decided to label fully AI tracks as AI, but right now it is the only streaming site to take this approach. Spotify, the world's biggest streaming service, has opted against it, for fear it might stigmatise musicians who used AI, a potential problem for a future in which every track is made using some kind of artificial assistance. Read more from Sky News:Driverless cars are coming to London 'this year' Man given Musk's AI brain chip says it feels 'magical' Neither YouTube nor Apple Music label AI tracks. YouTube said it asks creators to mark AI as AI if it looked realistic. Apple didn't respond to a request for comment. Where Spotify has joined Deezer is in trying to block the flood of AI music and fraudulent streams. Last year, it removed 75 million spam tracks, many of which will have been AI. For context, Spotify's whole catalogue stands at 100 million. The one silver lining for musicians? Although some AI tracks have gathered a lot of hype and generated millions of streams, so far there is no great appetite for it outside the occasional one-off viral hit - and of course the fraudsters. It seems that music still needs to be played and promoted by someone with genuine personal appeal for it to find a meaningful audience. The human connection matters… for the moment anyway."
    },
    {
        "title": "It is clear Epstein was welcomed into Andrew's family fold",
        "description": "These latest pictures released from the Epstein files are both puzzling and embarrassing.",
        "url": "https://news.sky.com/story/it-is-clear-epstein-was-welcomed-into-andrews-family-fold-13501438",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-prince-andrew-duchess-of-york_6470778.jpg?20240227112303",
        "type": "UK",
        "Author": "Laura Bundock",
        "Date Published": "2026-01-31 15:58:00",
        "Headline": "The latest release of files shows once again show how close Andrew was to Jeffrey Epstein, and how he continued contact after the financier was convicted as a sex offender.",
        "Content": "\n          Royal correspondent\n              @laurabundock\n These latest pictures released from the Epstein files are both puzzling and embarrassing. They appear to show the then Prince Andrew on all fours, over a woman who's lying on the floor. We have no idea who she is, or where and when the photos were taken - and Andrew has strongly denied any wrongdoing. Epstein files - latest updates But once again we're learning how close he was to Jeffrey Epstein. Exposing emails reveal more about their relationship, and how Andrew continued contact after Epstein was convicted as a sex offender. Not only that, but there are also several more emails showing the two men stayed in touch after Andrew claimed he'd cut off all ties. Far from their friendship ending, Andrew and his ex-wife Sarah Ferguson were being helped financially by Epstein. There are emails from 2011 detailing discussions about a payment to a former member of Fergie's staff, with Epstein describing her finances as an \"incredible mess\". It is clear though, he was welcomed into the family fold, given rare access to very personal parts of their gilded royal life. All of this was going on while Andrew was the Duke of York, and an international trade envoy for the UK - his work funded by the public purse. Of course, that's all changed. He is now disgraced and no longer a working royal. He was seen in Windsor earlier on Saturday but hasn't commented on the latest files, and neither has his ex-wife. There's nothing either from the King, who was out showing support for early morning runners in Sandringham. But Andrew's spiralling downfall remains a never-ending embarrassment for the Royal Family. For them, his impending move from the grandeur of Royal Lodge in Windsor to the obscurity of rural Norfolk can't come soon enough."
    },
    {
        "title": "Northern Ireland should hold unity referendum by 2030, first minister says",
        "description": "Northern Ireland should hold a referendum on whether it should become part of a united Ireland by 2030, the country's first minister has said.",
        "url": "https://news.sky.com/story/northern-ireland-should-hold-unity-referendum-by-2030-first-minister-says-13501305",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-michelle-o-neill-first-minister_7150990.jpg?20260131103555",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-31 09:26:00",
        "Headline": "Michelle O'Neill said \"now is the time for the plan and the preparation\" and claimed Brexit was \"done against the wishes of the people\".",
        "Content": "Northern Ireland should hold a referendum on whether it should become part of a united Ireland by 2030, the country's first minister has said. Speaking to the Sunday Morning With Trevor Phillips show ahead of its being shown tomorrow, Michelle O'Neill said it was an opportunity for the people of Northern Ireland to \"take control of our own fortunes\". Ms O'Neill was asked if she could imagine a so-called border poll during her time as first minister, and replied: \"Yes, I absolutely can.\" She said: \"I think my party's view is that we should have this by 2030. I think that's only a short way away. \"So now is the time for the plan and the preparation.\" The first minister added: \"I don't want done to the people here what was done in relation to Brexit. \"Brexit was an economic self-harm, a massive act of economic self-harm. \"It was done against the wishes of the people.\" She said: \"We have an ability to take control of our own fortunes. I encourage all political leaders to reach for that together.\" Her remarks appear to contradict what Ireland's premier Micheal Martin has said about the referendum. In September, the Irish prime minister (taoiseach) said \"there won't be a border poll before 2030\". Northern Ireland's deputy first minister also appeared on Sunday Morning With Trevor Phillips and said the nationalist and republican movements in Northern Ireland have not increased their vote share since Westminster devolved power to Northern Ireland in 1998. Emma Little Pengelly said: \"I'm a unionist, we have a Sinn Fein first minister. But I think it's important to say that in Northern Ireland nationalism and republicanism haven't increased their vote from 1998. \"Despite democratic change, they're sitting on and around the same percentage that they had in 1998. I think those who want to see the breakup of the union do try to constantly get this momentum. \"I have no doubt that you will hear that again because of course to serve their purpose is to try to get that sense of momentum towards that. That doesn't exist in Northern Ireland.\" The full interviews with Michelle O'Neill and Emma Little Pengelly will be broadcast on Sunday Morning With Trevor Phillips from 8.30am."
    },
    {
        "title": "Two explosions reported in Iran - as Israel denies involvement",
        "description": "Two explosions have been reported in Iran as the regime denied a &#8204;military leader was targeted, amid heightened tension in the region.",
        "url": "https://news.sky.com/story/explosion-reported-in-iran-as-it-denies-military-leader-targeted-13501162",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iran-explosion_7151063.jpg?20260131123145",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-31 00:01:00",
        "Headline": "At least five people are understood to have been killed in two separate blasts across the country. ",
        "Content": "Two explosions have been reported in Iran as the regime denied a ‌military leader was targeted, amid heightened tension in the region. ‌One blast happened at Iran's southern port of Bandar Abbas on Saturday, local media reported. One person, a four-year-old girl, was killed and a further 14 were injured. A second blast, more than 1,000 kilometres away in Ahvaz, saw four people killed, local officials said. Local media reports said both incidents were gas explosions and Israel has denied involvement. Social media reports alleging a ‌Revolutionary ⁠Guard navy ‌commander was targeted ‍in the Bandar Abbas explosion were \"completely false\", the semi-official Tasnim ​news agency said. The blast hit an eight-storey building, causing serious damage to the first to third floors, Fars news agency reported. Persian Gulf Radio claimed that several cars and a shop had also been damaged. Rescue and firefighting teams are currently understood to be at the scene. Footage taken by Fars shows the aftermath of the explosion - with glass and rubble strewn across the ground. The port of Bandar Abbas lies on the Strait of Hormuz, which is a vital shipping route between Iran and Oman. It handles about a fifth of the world's seaborne oil. It comes amid rising tension in the region as the US builds up its military presence nearby. It also follows nationwide protests - prompted by economic issues but which quickly turned into an effort to overthrow the Iranian regime. The protests were quickly stamped out by the Iranian Revolutionary Guard and the number of people killed is thought to be in the thousands. Earlier this week, US President Donald Trump said a \"large armada\" was heading toward Iran, warning if the two countries don't make a deal \"we'll see what happens\"."
    },
    {
        "title": "Hundreds protest against ICE role in Winter Olympics in Milan",
        "description": "Hundreds of protesters have gathered in Milan, Italy, to protest against the deployment of US Immigration and Customs Enforcement (ICE) staff at the upcoming Winter Olympics.",
        "url": "https://news.sky.com/story/hundreds-protest-against-ice-role-in-winter-olympics-in-milan-13501426",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-milan-ice-protest_7151369.jpg?20260131165627",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-31 15:38:00",
        "Headline": "Demonstrators gathered in Piazza XXV Aprile, a square named after the date of Italy's liberation from the Nazis in 1945. In an echo of anti-ICE protests in the US, they blew whistles and sang Bruce Springsteen songs.",
        "Content": "Hundreds of protesters have gathered in Milan, Italy, to protest against the deployment of US Immigration and Customs Enforcement (ICE) staff at the upcoming Winter Olympics. Demonstrators gathered in Piazza XXV Aprile, a square named after the date of Italy's liberation from the Nazis in 1945. In an echo of anti-ICE protests in the US, they blew whistles and sang Bruce Springsteen songs. \"Never again means never again for anyone,\" one banner said, while another read \"Ice only in Spritz\", in reference to a popular aperitif. \"No thank you, from Minnesota to the world, at the side of anyone who fights for human rights,'' another said. Also present at the protest were members of ANPI organisations, which celebrate the memory of Italy's partisan resistance during the Second World War. Earlier this week the US state department said several federal agencies, including ICE, would be deployed to help protect visiting Americans at the Milano Cortina Winter Olympics, as they have in previous Olympics. Milan and the Alpine resort of Cortina d'Ampezzo will co-host the Games from 6-22 February. US vice president JD Vance and secretary of state Marco Rubio will attend the opening ceremony on 6 February. Read more from Sky News:Branson told Epstein 'bring your harem', emails showIsraeli strikes kill 30 in Gaza - hospital officials The news has caused outrage in Italy, which has traditionally been a strong ally of the US, coming after two US citizens were shot and killed by federal agents during protests against ICE operations in Minnesota in January. The ICE agents which will be deployed in Milan are not the same unit as the agents cracking down on immigration in Minnesota and other US cities. Homeland Security Investigations, an ICE unit focusing on cross-border crimes, frequently sends its officers overseas to events like the Olympics to assist with security. The ICE unit focused on the US immigration crackdown is known as Enforcement and Removal Operations and there is no indication its officers are being sent to Italy."
    },
    {
        "title": "Northern Ireland should hold unity referendum by 2030, first minister says",
        "description": "Northern Ireland should hold a referendum on whether it should become part of a united Ireland by 2030, the country's first minister has said.",
        "url": "https://news.sky.com/story/northern-ireland-should-hold-unity-referendum-by-2030-first-minister-says-13501305",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-michelle-o-neill-first-minister_7150990.jpg?20260131103555",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-31 09:26:00",
        "Headline": "Michelle O'Neill said \"now is the time for the plan and the preparation\" and claimed Brexit was \"done against the wishes of the people\".",
        "Content": "Northern Ireland should hold a referendum on whether it should become part of a united Ireland by 2030, the country's first minister has said. Speaking to the Sunday Morning With Trevor Phillips show ahead of its being shown tomorrow, Michelle O'Neill said it was an opportunity for the people of Northern Ireland to \"take control of our own fortunes\". Ms O'Neill was asked if she could imagine a so-called border poll during her time as first minister, and replied: \"Yes, I absolutely can.\" She said: \"I think my party's view is that we should have this by 2030. I think that's only a short way away. \"So now is the time for the plan and the preparation.\" The first minister added: \"I don't want done to the people here what was done in relation to Brexit. \"Brexit was an economic self-harm, a massive act of economic self-harm. \"It was done against the wishes of the people.\" She said: \"We have an ability to take control of our own fortunes. I encourage all political leaders to reach for that together.\" Her remarks appear to contradict what Ireland's premier Micheal Martin has said about the referendum. In September, the Irish prime minister (taoiseach) said \"there won't be a border poll before 2030\". Northern Ireland's deputy first minister also appeared on Sunday Morning With Trevor Phillips and said the nationalist and republican movements in Northern Ireland have not increased their vote share since Westminster devolved power to Northern Ireland in 1998. Emma Little Pengelly said: \"I'm a unionist, we have a Sinn Fein first minister. But I think it's important to say that in Northern Ireland nationalism and republicanism haven't increased their vote from 1998. \"Despite democratic change, they're sitting on and around the same percentage that they had in 1998. I think those who want to see the breakup of the union do try to constantly get this momentum. \"I have no doubt that you will hear that again because of course to serve their purpose is to try to get that sense of momentum towards that. That doesn't exist in Northern Ireland.\" The full interviews with Michelle O'Neill and Emma Little Pengelly will be broadcast on Sunday Morning With Trevor Phillips from 8.30am."
    },
    {
        "title": "Search operation for seven-year-old girl missing in Morocco hindered by storm, MP says",
        "description": "The search operation for a seven-year-old girl who was swept out to sea in Morocco has been \"hindered\" by a storm, an MP has said.",
        "url": "https://news.sky.com/story/search-operation-for-seven-year-old-girl-missing-in-morocco-hindered-by-storm-mp-says-13501440",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-inaayah-makda_7149913.jpg?20260129222322",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-31 15:51:00",
        "Headline": "Inaayah Makda, who is from Blackburn, was sitting on some rocks on a beach in Casablanca when she was swept up by a wave.",
        "Content": "The search operation for a seven-year-old girl who was swept out to sea in Morocco has been \"hindered\" by a storm, an MP has said. Inaayah Makda, who is from Blackburn in Lancashire, was sitting on some rocks on the beach in Casablanca when she was hit by a large wave on Wednesday, her family has told the BBC. In a post on social media on Friday evening, the independent MP for Blackburn, Adnan Hussain, revealed search efforts are continuing but \"have been hindered due to a storm\". Mr Hussain said: \"Following a productive conversation earlier today I have received strong assurances from the ambassador of the Kingdom of Morocco that he will do all in his power to ensure every action is taken by local authorities to assist in the search for Inaayah. \"On behalf of the family, I asked the ambassador to help push for the assignment of a dedicated police liaison officer to provide direct and immediate support for the family on the ground.\" Casablanca's governor said the Moroccan Civil Protection Team is at the scene and will provide updates to the Foreign Office, Mr Hussain added. \"Further to this, the Foreign Office has confirmed to me that they have reiterated my request for a dedicated police liaison officer with the Moroccan Ministry of Foreign Affairs, and that steps are being taken to ensure constant and unimpeded communication takes place between the families and the authorities,\" he said. \"The governor of Casablanca has also confirmed that the Civil Protection Team is continuing search operations. \"I understand the defence attaché has also agreed to raise the case with the defence ministry.\" Read more from Sky News:Epstein sent thousands to Mandelson's husbandHigh hopes for Team GB at Winter Olympics Mr Hussain, who has been supporting Inaayah's family since the incident earlier this week, thanked the Moroccan ambassador, Moroccan authorities and the Foreign Office. He added: \"I remain in constant contact with the family, and will continue to provide whatever further assistance I can. \"I would like to take the opportunity to thank and commend the people of Blackburn for coming together and offering support and solidarity to Inaayah's family during this devastating time.\" A spokesperson for the Foreign Office said they are \"supporting the family of a British national reported missing in Morocco and are in contact with the local authorities\"."
    },
    {
        "title": "Israeli strikes kill at least 30 Palestinians in Gaza, hospital officials say",
        "description": "At least 30 Palestinians have been killed in Israeli strikes on Saturday, according to hospitals in Gaza.",
        "url": "https://news.sky.com/story/israeli-strikes-kill-at-least-12-palestinians-in-gaza-hospital-officials-say-13501292",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-gaza-khan-younis_7151221.jpg?20260131150755",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-31 08:00:00",
        "Headline": "The casualties included two women and six children from two different families, according to officials at the Gaza hospitals that received the bodies.",
        "Content": "At least 30 Palestinians have been killed in Israeli strikes on Saturday, according to hospitals in Gaza. The casualties included two women and six children from two different families, officials at the hospitals which received the bodies say. It marks one of the deadliest days in Gaza since a ceasefire was agreed in October. Shifa Hospital said a strike in Gaza City killed a mother, three children and one of their relatives, while Nasser Hospital said a strike in a tent camp in Khan Younis caused a fire to break out, killing seven, including a father, his three children and three grandchildren. Those strikes were reported early in the morning, before Shifa Hospital director Mohamed Abu Selmiya said another airstrike hit a police station in Gaza City, killing at least 14 more people and wounding others. In a statement on Saturday, the Israel Defence Forces (IDF) said it had \"struck four commanders and additional terrorists from the Hamas and Islamic Jihad terrorist organisations across the Gaza Strip\". It also said it struck a weapons storage facility, a weapons manufacturing site, and two launch sites belonging to Hamas in the central Gaza Strip. \n                  Gazans face question of returning to devastated homeland as Rafah crossing reopens\n                 \n                  Pep Guardiola gives passionate speech in support of Palestinian children\n                 \n                  Regime crackdown: Life inside Iran \n                 The IDF claimed the attacks came after Israel found that Hamas had violated the ceasefire agreement on Friday when eight terrorists exited the \"underground terror infrastructure\" in eastern Rafah. It repeated its claims that Hamas uses civilians as human shields, adding it would \"continue to act against any attempt by terrorist organisations in the Gaza Strip to carry out terror attacks against IDF troops and civilians of the State of Israel\". Both Israel and Hamas have blamed each other for breaching the ceasefire since it was agreed after two years of war. Gaza's health ministry, which is run by the Hamas-led government, has recorded more than 500 Palestinian deaths by Israeli attacks since the start of the ceasefire on 10 October last year. Strikes come just before Rafah crossing reopening The latest strikes came a day before the Rafah crossing bordering Egypt, the main route in or out of Gaza for nearly all of the two million people who live there, was set to reopen. All of Gaza's borders have been shut since the war began, though Rafah was briefly opened early in 2025 for the evacuation of sick and wounded Palestinians for treatment, as part of the previous ceasefire deal. Palestinians see the Rafah crossing as a lifeline for the Gazans in need of treatment, because most medical infrastructure within the territory has been destroyed. The World Health Organization estimates nearly 20,000 people could need treatment. Israel has kept the Rafah crossing closed in both directions since the ceasefire in October, demanding Hamas must abide by the agreement to return all hostages still in Gaza, living and deceased. Read more: How Rafah crossings will work The remains of the last Israeli hostage in Gaza, 24-year-old Ran Gvili, were retrieved around a week ago. He was killed at the Alumim kibbutz during the October 7 attacks in 2023, before his body was taken to Gaza. Israeli officials have said the \"limited reopening\" on Sunday comes in line with US president Donald Trump's 20-point peace plan. Sky News understands Israel will not put a limit on the number of people allowed to leave Gaza via the crossing, but will cap the number of people allowed to cross back into Gaza from Egypt at 150 per day. Palestinian officials suggest that around 100,000 people have fled Gaza since the war began."
    },
    {
        "title": "More than 200 killed after landslide hits miners extracting key smartphone mineral",
        "description": "More than 200 people have been reported dead after a landslide hit coltan mines in the Democratic Republic of Congo.",
        "url": "https://news.sky.com/story/more-than-200-killed-after-landslide-hits-miners-extracting-key-smartphone-mineral-13501303",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-coltan-congo_7150966.jpg?20260131093102",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-31 09:16:00",
        "Headline": "Heavy rain in the Democratic Republic of Congo leads to the collapse of mines used to extract coltan - used in phones, computers and aircraft engines.",
        "Content": "More than 200 people have been reported dead after a landslide hit coltan mines in the Democratic Republic of Congo. Many bodies are still buried under the mud following the tragedy near Rubaya, in the east of the country, earlier this week. More than 15% of the world's supply of tantalum, a rare metal extracted from coltan, comes from the region and is a key component in smartphones, as well as computers and aircraft engines. The mines are under the control of rebel group M23. Lumumba Kambere Muyisa, a spokesperson of the rebel-appointed governor of North-Kivu province, said the landslide was caused by heavy rain. \"More than 200 people were victims of this landslide, including miners, ​children and market women,\" he said. \"Some people were rescued just in time and have serious injuries,\" he said. Survivors were taken to nearby health facilities or the nearest city of Goma - around 30 miles away. A former miner at the site spoke of the dangers of repeated landslides because tunnels had been dug by hand, poorly constructed, and left without maintenance. \n                  Epstein files latest: Starmer calls for Andrew to testify before US Congress as 'victims have to be first priority'\n                 \n                  Sarah Ferguson thanks Jeffrey Epstein for being 'brother I have always wished for'\n                 \n                  Two explosions reported in Iran - as Israel denies involvement\n                 \"People dig everywhere, without control or safety measures,\" Clovis Mafare said. \"In a single pit, there can be as many as 500 miners, and because the tunnels run parallel, one collapse can affect many pits at once.\" Read more from Sky News:Epstein sent thousands to Mandelson's husbandHigh hopes for Team GB at Winter Olympics Sky News found children as young as four working in the unregulated mines in the DRC. The country has been hit by violence between government forces and different armed groups, including the Rwanda-backed M23, for decades. In May 2024, M23 seized Rubaya and took control of its mines."
    },
    {
        "title": "Blackouts in Ukraine and Moldova as power lines fail in sub-zero temperatures after Russian airstrikes",
        "description": "Parts of Ukraine and Moldova suffered power cuts on Saturday after high-voltage power lines failed while both countries were affected by sub-zero temperatures.",
        "url": "https://news.sky.com/story/blackouts-in-ukraine-and-moldova-as-power-lines-fail-amid-sub-zero-temperatures-13501424",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-kyiv-ukraine-russia_7151318.jpg?20260131163042",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-31 15:25:00",
        "Headline": "The outages come as people in both countries face severe winter weather, with temperatures in Kyiv forecast to fall to -11C (12F) on Saturday, before plunging as low as -17C (1F) before Wednesday, according to the UK Met Office.",
        "Content": "Parts of Ukraine and Moldova suffered power cuts on Saturday after high-voltage power lines failed while both countries were affected by sub-zero temperatures. Kyiv and Chisinau, the capital cities, were among the areas affected by the power outage after lines malfunctioned at 10.42​am local time. Ukraine's power grid has been severely compromised by Russian airstrikes during its nearly four-year war with Moscow, leading to ​severe restrictions on electricity supplies in recent weeks. Officials in Kyiv did not directly link the accident to war damage, and Ukraine's digital ministry said it was not caused by a cyber attack. Moscow has agreed to halt strikes on energy infrastructure until 1 February at the request of US ‌President Donald Trump. Kyiv said it would reciprocate, and the countries have not reported any major attacks. Mr Trump's special envoy Steve Witkoff said on Saturday he and other US officials had held \"productive and constructive meetings\" with his Russian counterpart, Kirill Dmitriev, as Washington strives to find \"a peaceful resolution of the Ukrainian conflict\". In a post on X, Mr Witkoff said the talks in Florida show \"Russia is working toward securing peace\". The outages come as people in both countries face severe winter weather, with temperatures in Kyiv forecast to fall to -11C (12F) on Saturday, before plunging as low as -17C (1F) before Wednesday, according to the UK Met Office. Temperatures in some areas will drop as low as -30C (-22F) early next week, Ukraine's State Emergency Service said. Moldova is also having a weekend cold snap, as -7C (19F) on Saturday drops as low as -10C (14F) on Monday. As well as the two countries' capitals, at least five Ukrainian regions, including Zhytomyr in the centre of the country and Kharkiv in the northeast, as well as parts of Moldova, were affected by the blackouts. The metro in Kyiv suspended operations, and water supplies in the city were cut. Traffic lights and some public transport in Chisinau were not working, according to ‍the city mayor, and most districts did not have electricity. Power was partially restored in both countries early on Saturday afternoon as workers hurried to stabilise ‌interconnected grids. Read more on Sky News:At least 200 killed in landslideThe week's most striking images Supplies will be back to where they were by evening, said Oleksandr Kharchenko, the director of Kyiv's independent Energy Research ‌Centre. A technical malfunction led to two high-voltage power lines causing \"a cascading outage in Ukraine's power grid\", Ukraine's energy minister Denys Shmyhal said. One of the lines linked the grids of Romania and Moldova, while the other connected western and central Ukraine, he said. Moldova's energy ministry said the disruption there was triggered by serious problems in Ukraine's grid that led to a voltage drop on the line connecting Romania and Moldova. Romanian energy officials have not commented."
    },
    {
        "title": "Pokémon apologises after Chinese anger over plan for game at Japanese shrine",
        "description": "Pok&#233;mon has apologised after plans for a card game event at a controversial shrine for Japanese war dead saw it accused of hurting \"the feelings of the Chinese people\".",
        "url": "https://news.sky.com/story/pok233mon-apologises-after-chinese-anger-over-plan-for-game-at-japanese-shrine-13501325",
        "image_url": "https://e3.365dm.com/19/09/1920x1080/skynews-pokemon-ash-pikachu_4776349.jpg?20190916112322",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-31 10:49:00",
        "Headline": "The backlash led to the playing card company distancing itself from the now cancelled event at the controversial Yasukuni war memorial.",
        "Content": "Pokémon has apologised after plans for a card game event at a controversial shrine for Japanese war dead saw it accused of hurting \"the feelings of the Chinese people\". The event was due to be held on Saturday at the Yasukuni Shrine in Tokyo - which honours Japan's 2.5 million war dead, including convicted war criminals. Neighbouring countries that were victims of Japan's aggression, especially China and North and South Korea, see visits to the shrine as demonstrating a lack of remorse about the past. Chinese media was quick to condemn the choice of location. The People's Daily, the Communist Party's official mouthpiece, said: \"Brands that disregard history and hurt the feelings of the Chinese people will ultimately be abandoned by the market. \"The relevant enterprises must accordingly take social responsibility and not make light of the heavy weight of history in the name of entertainment.\" Read more from Sky News:Epstein sent thousands to Mandelson's husbandHigh hopes for Team GB at Winter Olympics \n                  Starmer hails China reset a success - but not everyone is convinced\n                 \n                  China lifts sanctions on MPs and peers, Starmer says \n                 \n                  What does Starmer really want from China?\n                 The Pokémon Company, an affiliate of Japanese game maker Nintendo, issued an apology in both Japanese and Chinese, trying to distance itself from the event. It said it had been privately planned by a certified Pokémon card player for children - but its information was shared on the company's official website. \"It was an event that should not have been held to begin with,\" the company said, adding that the notice was shared on its website \"by mistake because of the lack of our understanding\". The event has been cancelled and its information removed from the website, it said. The company, citing its motto of \"connecting the world with Pokémon,\" pledged to be considerate to everyone. It comes amid rising tensions between Japan and China. In November Japanese Prime Minister Sanae Takaichi suggested the country could become involved if China takes military action against Taiwan, a self-governing island Beijing claims as its own."
    },
    {
        "title": "Hundreds protest against ICE role in Winter Olympics in Milan",
        "description": "Hundreds of protesters have gathered in Milan, Italy, to protest against the deployment of US Immigration and Customs Enforcement (ICE) staff at the upcoming Winter Olympics.",
        "url": "https://news.sky.com/story/hundreds-protest-against-ice-role-in-winter-olympics-in-milan-13501426",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-milan-ice-protest_7151369.jpg?20260131165627",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-31 15:38:00",
        "Headline": "Demonstrators gathered in Piazza XXV Aprile, a square named after the date of Italy's liberation from the Nazis in 1945. In an echo of anti-ICE protests in the US, they blew whistles and sang Bruce Springsteen songs.",
        "Content": "Hundreds of protesters have gathered in Milan, Italy, to protest against the deployment of US Immigration and Customs Enforcement (ICE) staff at the upcoming Winter Olympics. Demonstrators gathered in Piazza XXV Aprile, a square named after the date of Italy's liberation from the Nazis in 1945. In an echo of anti-ICE protests in the US, they blew whistles and sang Bruce Springsteen songs. \"Never again means never again for anyone,\" one banner said, while another read \"Ice only in Spritz\", in reference to a popular aperitif. \"No thank you, from Minnesota to the world, at the side of anyone who fights for human rights,'' another said. Also present at the protest were members of ANPI organisations, which celebrate the memory of Italy's partisan resistance during the Second World War. Earlier this week the US state department said several federal agencies, including ICE, would be deployed to help protect visiting Americans at the Milano Cortina Winter Olympics, as they have in previous Olympics. Milan and the Alpine resort of Cortina d'Ampezzo will co-host the Games from 6-22 February. US vice president JD Vance and secretary of state Marco Rubio will attend the opening ceremony on 6 February. Read more from Sky News:Branson told Epstein 'bring your harem', emails showIsraeli strikes kill 30 in Gaza - hospital officials The news has caused outrage in Italy, which has traditionally been a strong ally of the US, coming after two US citizens were shot and killed by federal agents during protests against ICE operations in Minnesota in January. The ICE agents which will be deployed in Milan are not the same unit as the agents cracking down on immigration in Minnesota and other US cities. Homeland Security Investigations, an ICE unit focusing on cross-border crimes, frequently sends its officers overseas to events like the Olympics to assist with security. The ICE unit focused on the US immigration crackdown is known as Enforcement and Removal Operations and there is no indication its officers are being sent to Italy."
    },
    {
        "title": "It is clear Epstein was welcomed into Andrew's family fold",
        "description": "These latest pictures released from the Epstein files are both puzzling and embarrassing.",
        "url": "https://news.sky.com/story/it-is-clear-epstein-was-welcomed-into-andrews-family-fold-13501438",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-prince-andrew-duchess-of-york_6470778.jpg?20240227112303",
        "type": "US",
        "Author": "Laura Bundock",
        "Date Published": "2026-01-31 15:58:00",
        "Headline": "The latest release of files shows once again show how close Andrew was to Jeffrey Epstein, and how he continued contact after the financier was convicted as a sex offender.",
        "Content": "\n          Royal correspondent\n              @laurabundock\n These latest pictures released from the Epstein files are both puzzling and embarrassing. They appear to show the then Prince Andrew on all fours, over a woman who's lying on the floor. We have no idea who she is, or where and when the photos were taken - and Andrew has strongly denied any wrongdoing. Epstein files - latest updates But once again we're learning how close he was to Jeffrey Epstein. Exposing emails reveal more about their relationship, and how Andrew continued contact after Epstein was convicted as a sex offender. Not only that, but there are also several more emails showing the two men stayed in touch after Andrew claimed he'd cut off all ties. Far from their friendship ending, Andrew and his ex-wife Sarah Ferguson were being helped financially by Epstein. There are emails from 2011 detailing discussions about a payment to a former member of Fergie's staff, with Epstein describing her finances as an \"incredible mess\". It is clear though, he was welcomed into the family fold, given rare access to very personal parts of their gilded royal life. All of this was going on while Andrew was the Duke of York, and an international trade envoy for the UK - his work funded by the public purse. Of course, that's all changed. He is now disgraced and no longer a working royal. He was seen in Windsor earlier on Saturday but hasn't commented on the latest files, and neither has his ex-wife. There's nothing either from the King, who was out showing support for early morning runners in Sandringham. But Andrew's spiralling downfall remains a never-ending embarrassment for the Royal Family. For them, his impending move from the grandeur of Royal Lodge in Windsor to the obscurity of rural Norfolk can't come soon enough."
    },
    {
        "title": "Sir Richard Branson told Epstein 'bring your harem' and advised him on PR, new emails show",
        "description": "Sir Richard Branson told Jeffrey Epstein he would love to see him again \"as long as you bring your harem\" in emails newly-released from the Epstein files.",
        "url": "https://news.sky.com/story/branson-told-epstein-bring-your-harem-and-advised-him-on-pr-new-emails-show-13501345",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-richard-branson-jeffrey-epstein_7151176.jpg?20260131144028",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-31 12:20:00",
        "Headline": "Sir Richard's team say he would never have used this term if the full facts had been known.",
        "Content": "Sir Richard Branson told Jeffrey Epstein he would love to see him again \"as long as you bring your harem\" in emails newly-released from the Epstein files. In the exchange, from September 2013, the disgraced financier also asked for Sir Richard's \"thoughts\" on a \"public relations\" matter, apparently after visiting him the previous day. The Virgin boss responded saying it was \"really nice seeing you\" and that Epstein would be welcome to visit again, adding: \"as long as you bring your harem!\" Sir Richard's team say he would never have used this term if the full facts had been known and was repeating a phrase used by Epstein. Sir Richard then turned to the public relations matter. He advised: \"I think if Bill Gates was willing to say that you've been a brilliant advisor to him, that you slipped up many years ago by sleeping with a 17 1/2 year old woman and were punished for it, that you've more than learnt your lesson and have done nothing that's against the law since and, yes, as a single man you seem to have a penchant for women. But there's nothing wrong with that. Anyway something along those lines.\" In earlier email correspondence, from April 2013, plans were discussed for Epstein to visit Sir Richard's private island, Necker. \n                  Epstein files latest: Starmer calls for Andrew to testify before US Congress as 'victims have to be first priority'\n                 \n                  Epstein files: Key findings so far after more than three million pages released\n                 \n                  Epstein files release - saying everything and nothing at the same time\n                 Writing to Sir Richard, Epstein's assistant asks about bringing along an associate of Bill Gates, Boris Nikolic. A subsequent email adds more names to Epstein's entourage, along with \"2 Russian girls\". Sir Richard's team is understood to acknowledge Epstein's presence at two brief business meetings on Necker Island in April and September 2013. It is claimed both meetings were organised by an unnamed American entrepreneur. At the second, Epstein is said by Sir Richard's team, to have arrived on the entrepreneur's helicopter, with three adult women who did not attend their meeting but socialised with a sports team on the island. Epstein is later said to have referred to the women as his \"harem\". Epstein is also said, by Sir Richard's team, to have mentioned that he'd served time in prison for a consensual relationship with someone who was nearly 18, and asked for Sir Richard's public relations advice on the matter. Read more:Epstein files: Key findings so farClintons refuse to testify in Epstein investigation Simply being mentioned in the Epstein Files isn't a sign of wrongdoing. A Virgin Group spokesperson said: \"Any contact Richard and Joan Branson had with Epstein took place on only a few occasions more than twelve years ago, and was limited to group or business settings, such as a charity tennis event. \"When Epstein offered a charity donation, the Bransons asked their team to carry out due diligence before accepting the donation, which uncovered serious allegations. \"As a result of what the due diligence uncovered, Virgin Unite did not take the donation and Richard and Joan decided not to meet or speak with Epstein again. \"Had they had the full picture and information, there would have been no contact whatsoever - Richard believes that Epstein's actions were abhorrent and supports the right to justice for his many victims.\""
    },
    {
        "title": "Thames Water closes in on £16bn rescue deal with lenders",
        "description": "Thames Water is edging closer to a multibillion pound rescue deal with its lenders that would keep the ailing utility out of temporary public ownership.",
        "url": "https://news.sky.com/story/thames-water-closes-in-on-16316bn-rescue-deal-with-lenders-13501323",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-thames-water-thameswater_6929423.jpg?20250528094500",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-31 10:47:00",
        "Headline": "A group of creditors is nearing an in-principle agreement with Ofwat that would keep Britain's biggest water utility out of temporary government ownership, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Thames Water is edging closer to a multibillion pound rescue deal with its lenders that would keep the ailing utility out of temporary public ownership. Sky News has learnt that a group of creditors holding £13bn of Thames Water's total debt mountain of £20bn is aiming to sign an in-principle agreement with Ofwat and the company by the middle of next month. Under the agreement being discussed, lenders would take a haircut on the Class A debt they are owed of up to 30%, an increase from the 25% disclosed in an announcement in October, according to one industry source. In total, more than £13bn of existing value - up from £12.5bn - is expected to be written off when a final deal is put to the participating investors, which include Assured Guaranty, Invesco, Elliott Management, Silver Point Capital and Farallon Capital Management. In exchange, they would receive a minimum of 10% of the recapitalised company's equity. A planned new equity injection of £3.15bn is also likely to be increased if an agreement is reached, the industry insider said. Last year, Thames Water's creditors said they would commit £3bn of emergency funding to keep Thames Water afloat. \n                  Mandelson told Epstein he was 'trying hard' to change bonus policy after payment to husband, files show\n                 \n                  Mumsnet founder Roberts plots delivery of new owner\n                 \n                  There's a growing number of Britons moving into abandoned properties - but they're not squatters... | Money blog\n                 Half of that sum has already been drawn by the company, with the in-principle agreement needing to be confirmed in order for Thames Water to access the second £1.5bn tranche, which would fund the company to the end of the restructuring process. Thames Water's would-be owners have also committed not to sell the company before 2030 - with a stock market listing expected to be arranged at some point after that - while they have pledged not to take any dividends during the period of its Turnaround Oversight Regime or until it goes public. The consortium has also said that customer bills will not rise beyond increases already agreed with Ofwat. An announcement about an outline deal, which one source said could come as soon as the week after next, would represent the clearest sign yet that Britain's biggest water utility can be solvently recapitalised and remain out of a government-orchestrated special administration regime (SAR). That would be a relief to the Treasury, which is determined to keep Thames Water's mountain of debt off the government's books. This weekend, however, regulatory sources cautioned that \"gaps\" remained between the creditors and watchdogs over both the financial and other terms of the prospective agreement, meaning that an agreement could yet be delayed beyond the middle of February. \"There's still no guarantee that this gets done,\" said one. Under its business plan, the London & Valley Water consortium wants to spend £20.5bn on infrastructure and service improvements over the next five years to tackle the company's appalling record on waste and sewage pollution. Ofwat had rejected a previous blueprint proposed by the company which would have allowed it to spend £24.5bn during the next five-year regulatory period. If successfully completed, the deal would be one of the most complex corporate restructurings ever seen in Britain. It requires the approval of Ofwat, the Environment Agency and the Drinking Water Inspectorate. If an agreement is approved by regulators and Emma Reynolds, the environment secretary, it would be subject to a public consultation because of modifications Ofwat would be making to the company's operating licence. The deal will also require sanctioning by the courts. An insider said the terms of the deal, which are still to be finalised, were also expected to be submitted to Downing Street for review in the coming weeks. One area of potential scrutiny is likely to relate to an agreement on Thames Water's future regulatory penalties, although London & Valley Water has pledged that the company's outstanding fines would be paid in full. Negotiations over Thames Water's future come at a critical time for the UK water industry. A white paper was published this month by ministers confirming plans to abolish Ofwat and establish a new regulator, with an 'MOT-style' approach to supervising water infrastructure. The document also set out plans to introduce a new regime to enable struggling water companies to be turned around. The privatised sector's travails have been further highlighted this month by the scandal at Thames Water's neighbour, South East Water, which is facing calls to sack its chief executive over outages which have left thousands of Kent households without a reliable water supply. Thames Water's most recent consortium of shareholders, which included the Universities Superannuation Scheme and an Abu Dhabi sovereign wealth fund, have written off the value of their investments in the company. Last August, Sky News revealed that Steve Reed, Ms Reynolds' successor as environment secretary, had signed off the appointment of FTI Consulting to undertake contingency planning for a SAR - a regime which has only been tested once before, with the collapse of energy supplier Bulb. Since then, FTI Consulting is understood to have had little engagement on the project amid the ongoing talks between creditors and Ofwat. KKR, the private equity behemoth, pulled out of talks to buy Thames Water last summer, while Hong Kong-based CK Infrastructure has attempted to gatecrash the process with little success. Mike McTighe, the veteran corporate troubleshooter who chairs BT Group's Openreach division, has been parachuted in to work with the creditor group as the company's potential chairman. In October, he said: \"There is a huge amount of work to be done to turn around Thames Water and deliver the improved service and environmental outcomes that customers and local communities deserve. \"From day one, we will inject billions in new investment, strengthen Thames Water's balance sheet, transform the company for thousands of hard-working frontline staff and begin the delivery of an operational turnaround that puts 16 million customers and the environment first.\" This weekend, an Ofwat spokesperson said: \"We continue to engage with London & Valley Water and are reviewing their plans carefully to assess whether they deliver a turnaround in the company's operational performance and strengthen its financial resilience to the benefit of customers and the environment.\" DEFRA has been contacted for comment, while Thames Water and London & Valley Water both declined to comment.  "
    },
    {
        "title": "Mandelson told Epstein he was 'trying hard' to change bonus policy after payment to husband, files show",
        "description": "Peter Mandelson told Jeffrey Epstein he was \"trying hard\" to change government policy on bankers' bonuses at his request, months after the convicted sex trafficker had paid thousands of pounds to the then UK business secretary's husband.",
        "url": "https://news.sky.com/story/mandelson-told-epstein-he-was-trying-hard-to-change-bonus-policy-after-payment-to-husband-files-show-13501478",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-lord-peter-mandelson_7151106.png?20260131131904",
        "type": "Business",
        "Author": "Paul Kelso, business correspondent, and Sarah Hajibagheri, field news editor",
        "Date Published": "2026-01-31 16:53:00",
        "Headline": "Emails released by the US Department of Justice shed new light on the closeness of the relationship between Jeffrey Epstein and former UK business secretary Peter Mandelson, who was sacked as British ambassador to Washington last year.",
        "Content": "By Paul Kelso, business correspondent, and Sarah Hajibagheri, field news editor  Peter Mandelson told Jeffrey Epstein he was \"trying hard\" to change government policy on bankers' bonuses at his request, months after the convicted sex trafficker had paid thousands of pounds to the then UK business secretary's husband. Emails released by the US Department of Justice (DoJ) on Friday shed new light on the closeness of the relationship between the disgraced financier and Lord Mandelson, who was sacked as British ambassador to Washington last year. The documents include correspondence in September 2009 between Epstein and Lord Mandelson's husband, Reinaldo Avila da Silva, who asked the financier to pay him £10,000 to fund an osteopathy course and other expenses. Epstein responds \"I will wire your loan amount immediate'y\" [sic]. Epstein files - latest updates A few days later, Mr da Silva, who married Lord Mandelson in 2023, replied \"thank you for the money which arrived in my account this morning\". Epstein was released from prison in July 2009, having pleaded guilty to trafficking a minor. In separate emails, exchanged in December 2009, Lord Mandelson, then business secretary in Gordon Brown's government, appears to agree to try to change government policy on taxing bankers' bonuses. Coming just 18 months after the great financial crash and subsequent state rescue of banks, the subject was highly contentious. On 9 December 2009, the then chancellor Alistair Darling announced a 50% \"super tax\" on bonuses, intended to prevent pay being inflated by taxpayer-funded bailouts. In an email exchange on 15 December, in which email addresses are redacted, Epstein asked Mandelson if the policy could be changed. \"any [sic] real chance of making the tax only on the cash portion of the bankers bonus,\" he wrote. Lord Mandelson replied: \"Trying hard to amend as I explained to Jes last night. Treasury digging in but I am on case.\" Epstein responds: \"let me know before jes please,,\". \"Ok. They are not being helpful...\" is the reply. \"they jpm. or they treasury,\" asks Epstein. \"Treasury\" Mandelson replied. \"Jes\" may be a reference to Jes Staley, the former chief executive of Barclays, who in 2009 was head of JP Morgan's investment bank and a close associate of Epstein's. Mr Staley resigned from Barclays in 2020 after the Financial Conduct Authority launched an investigation into his conduct and the transparency of his disclosures about his relationship with Epstein. Emails discuss career prospects and media coverage Epstein and Lord Mandelson go on to discuss the then prime minister Gordon Brown's prospects at the election due the following May. \"gb [sic] needs help in may , not another enemy,\" writes Epstein. \"Or a car crash any earlier,\" writes Mandelson. The email chain about Mr Brown is one of dozens between Epstein and Mandelson that reveal the closeness and length of the relationship. Other exchanges released by the DoJ show the pair sharing regular messages about their whereabouts, making arrangements to meet in person, discussing Lord Mandelson's career options following Labour's 2010 election defeat, and joking about media coverage. Read more:Epstein files: The key findings so farAnalysis: Saying everything and nothing at the same time In one, Lord Mandelson asks Epstein's view of his joining the Facebook board. In another, Epstein sent a link to a Guardian article that proposed Lord Mandelson as a candidate to lead the International Monetary Fund, despite his having no central banking experience. Epstein writes that he hopes the reporter \"you encouraged to write this\" is \"cute\". \"As it happens, I didn't. The Treasury did.\" replies Lord Mandelson. Lord Mandelson, Jes Staley and the Treasury have been approached for comment on the emails. Pictures released of Lord Mandelson in his underwear In separate files, images of Lord Mandelson show the former cabinet minister in his underwear, talking to a woman wearing a bathrobe. Sky News does not know when, where or by whom the photos were taken. A spokesperson for Mandelson told Sky News: \"No one can say who or where the photo was taken. Lord Mandelson has absolutely no idea or indeed whether it has any connection to Epstein at all.\" Appearing in a photo in the Epstein files does not indicate wrongdoing."
    },
    {
        "title": "Mumsnet founder Roberts plots delivery of new owner",
        "description": "The founder of Mumsnet is in talks with private equity investors about selling a stake in the online community for parents she set up more than a quarter of a century ago.",
        "url": "https://news.sky.com/story/mumsnet-founder-roberts-plots-delivery-of-new-owner-13501362",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-justine-roberts-mumsnet_7150939.jpg?20260131073812",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-31 13:20:00",
        "Headline": "Justine Roberts is in talks with investors about the sale of a stake in the online parenting community platform she set up in 2000 and which now boasts 8 million monthly users, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The founder of Mumsnet is in talks with private equity investors about selling a stake in the online community for parents she set up more than a quarter of a century ago. Sky News has learnt that Justine Roberts, who launched Mumsnet in 2000, is working with advisers on a process which could ultimately see her relinquishing control of the business. City sources said this weekend that discussions with prospective investors had been underway for some weeks, although they remained at a relatively early stage. The identity of the firms in talks with Mumsnet was unclear. Founded in 2000, Mumsnet has grown into an online community with approximately eight million monthly users. Ms Roberts owns about 60% of the company, with staff and a number of angel investors also on its share register. \"Over the years we've had plenty of approaches, but we've stayed independent because trust and community integrity are central to Mumsnet,\" Ms Roberts told Sky News. \n                  Thames Water closes in on £16bn rescue deal with lenders\n                 \n                  Mandelson told Epstein he was 'trying hard' to change bonus policy after payment to husband, files show\n                 \n                  There's a growing number of Britons moving into abandoned properties - but they're not squatters... | Money blog\n                 \"If we bring in a partner to help us grow internationally, we'll be very focused on finding the right fit rather than rushing into a deal.\" Mumsnet's users are predominantly women aged between 25 and 45. The company employs about 75 people, with Ms Roberts having transitioned from the chief executive's role to executive chair last August. Sue Macmillan, formerly its chief operating officer, has replaced Ms Roberts as CEO. Mumsnet provides a forum for mothers to share experiences, perspectives and practical advice. It has also evolved into a campaigning organisation, seeking to influence issues including childcare, parental leave, women's health, safety and children's use of technology. The company also owns Gransnet, which aims to provide a similar service to grandparents. According to accounts filed at Companies House for the year ended December 31, 2024, Mumsnet recorded turnover of £9.4m, a year-on-year rise of almost 20%. Post-tax profit was up 14% to £2.65m, while users spent a total of 45.7 million hours on the site - a rise of 6.5%. Among the new products it referred to was the launch of MumsGPT, an AI-driven consumer insights tool. One source said the sale of a stake in the business was expected to provide capital to facilitate an international expansion strategy for Mumsnet. While the valuation of the business was unclear this weekend, sources speculated that it would be worth tens of millions of pounds. If she does sell a controlling interest, Ms Roberts is likely to remain involved as an ambassador or advisor to the company. Mumsnet is understood to be being advised by FirstCapital, an independent boutique, on the talks with investors."
    },
    {
        "title": "Andy Burnham shares message for Labour Gorton and Denton by-election candidate - after being blocked from standing",
        "description": "Andy Burnham has backed Labour's newly announced candidate for the Gorton and Denton by-election, after being blocked from standing himself by the party's governing body.",
        "url": "https://news.sky.com/story/andy-burnham-shares-message-for-labour-gorton-and-denton-by-election-candidate-after-being-blocked-from-standing-13501711",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-andy-burnham-mayor_7151788.jpg?20260131214156",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-31 21:24:00",
        "Headline": "The Mayor of Greater Manchester requested permission to stand for the contest - but Labour's National Executive Committee voted to block his request.",
        "Content": "Andy Burnham has backed Labour's newly announced candidate for the Gorton and Denton by-election, after being blocked from standing himself by the party's governing body. In a post on X, the Greater Manchester mayor congratulated Angeliki Stogia, a city councillor for Whalley Range, and said she would do \"a great job\". He added: \"I will be there for you whenever you need me.\" Mr Burnham, whose potential return to Westminster was seen by many as a possible challenge to Sir Keir Starmer's leadership, formally requested permission to stand for the contest last weekend. As mayor he needed approval to contest a different political election - but Labour's National Executive Committee (NEC) voted to block his request the following day. The by-election was prompted by the resignation of former MP Andrew Gwynne, who stood down citing health reasons, and Ms Stogia was announced as the party's candidate on Saturday afternoon. Describing herself as a \"proud Mancunian woman\" at a launch event, Ms Stogia said: \"This is about Manchester. Manchester is a city united, we are rejecting division. I am so looking forward to going out on the doorstep and winning this for Labour.\" The east Manchester seat has been Labour since before the Second World War - but both Reform UK and the Green Party are now eyeing victory as Sir Keir faces internal revolt over the decision to block Mr Burnham. PM criticises Reform UK's 'politics of division' GB News presenter and former academic Matt Goodwin is in the running for Reform UK, while councillor and plumber Hannah Spencer is representing the Greens and local campaigner Jackie Pearcey the Liberal Democrats. The prime minister has insisted his party's decision to not allow Mr Burnham to run is the right one, because doing so would \"divert our resources\". Asked during the final leg of his recent trip to east Asia if the by-election should be viewed as a referendum on his premiership, Sir Keir responded with criticism of Reform UK's \"politics of poisonous division\" - highlighting apparent endorsement of Mr Goodwin by far-right activist Tommy Robinson, whose real name Stephen Yaxley-Lennon. \"It is very much and very clearly now a by-election between Labour and Reform on key principles,\" the prime minister said. \"I see that Tommy Robinson, I think, has just come out in support of Matt Goodwin... That tells you everything about the politics they intend to inject into this by-election, the politics of poisonous division, so we can see exactly where that's going.\" Read more:Farage and Polanski could both inflict huge damage on LabourWhat do local residents think of move to block Burnham? Labour is the \"only contender\", Sir Keir insisted, adding: \"So, it's Labour versus Reform and we will fight for renewal, for inclusive communities and bringing people together, and for true patriotism against the plastic patriotism of Reform.\" The prime minister did not say whether he would join the campaign efforts on the ground in the constituency. Labour previously won the seat with more than half the vote - 18,555 - in 2024, with Nigel Farage's Reform UK coming second with 5,142 votes, narrowly beating the Greens at 4,810. A Reform UK spokesman said the party has been \"consistently clear\" on its view of Robinson and that \"he isn't welcome in the party\"."
    },
    {
        "title": "Northern Ireland should hold unity referendum by 2030, first minister says",
        "description": "Northern Ireland should hold a referendum on whether it should become part of a united Ireland by 2030, the country's first minister has said.",
        "url": "https://news.sky.com/story/northern-ireland-should-hold-unity-referendum-by-2030-first-minister-says-13501305",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-michelle-o-neill-first-minister_7150990.jpg?20260131103555",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-31 09:26:00",
        "Headline": "Michelle O'Neill said \"now is the time for the plan and the preparation\" and claimed Brexit was \"done against the wishes of the people\".",
        "Content": "Northern Ireland should hold a referendum on whether it should become part of a united Ireland by 2030, the country's first minister has said. Speaking to the Sunday Morning With Trevor Phillips show ahead of its being shown tomorrow, Michelle O'Neill said it was an opportunity for the people of Northern Ireland to \"take control of our own fortunes\". Ms O'Neill was asked if she could imagine a so-called border poll during her time as first minister, and replied: \"Yes, I absolutely can.\" She said: \"I think my party's view is that we should have this by 2030. I think that's only a short way away. \"So now is the time for the plan and the preparation.\" The first minister added: \"I don't want done to the people here what was done in relation to Brexit. \"Brexit was an economic self-harm, a massive act of economic self-harm. \"It was done against the wishes of the people.\" She said: \"We have an ability to take control of our own fortunes. I encourage all political leaders to reach for that together.\" Her remarks appear to contradict what Ireland's premier Micheal Martin has said about the referendum. In September, the Irish prime minister (taoiseach) said \"there won't be a border poll before 2030\". Northern Ireland's deputy first minister also appeared on Sunday Morning With Trevor Phillips and said the nationalist and republican movements in Northern Ireland have not increased their vote share since Westminster devolved power to Northern Ireland in 1998. Emma Little Pengelly said: \"I'm a unionist, we have a Sinn Fein first minister. But I think it's important to say that in Northern Ireland nationalism and republicanism haven't increased their vote from 1998. \"Despite democratic change, they're sitting on and around the same percentage that they had in 1998. I think those who want to see the breakup of the union do try to constantly get this momentum. \"I have no doubt that you will hear that again because of course to serve their purpose is to try to get that sense of momentum towards that. That doesn't exist in Northern Ireland.\" The full interviews with Michelle O'Neill and Emma Little Pengelly will be broadcast on Sunday Morning With Trevor Phillips from 8.30am."
    },
    {
        "title": "Lord Triesman, ex-Labour minister and FA chairman, dies",
        "description": "Former Labour minister Lord Triesman, who was \"vital\" to New Labour, according to Sir Tony Blair, has died at the age of 82, the party has said.",
        "url": "https://news.sky.com/story/lord-triesman-ex-labour-minister-and-fa-chairman-dies-13501629",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-david-triesman-football-association_7151565.jpg?20260131184418",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-31 18:32:00",
        "Headline": "David Triesman, who was the party's general secretary and served as a Foreign Office minister and as under-secretary of state for innovation, universities and skills, died \"peacefully and at home,\" on Friday, Labour said in a statement.",
        "Content": "Former Labour minister Lord Triesman, who was \"vital\" to New Labour, according to Sir Tony Blair, has died at the age of 82, the party has said. David Triesman, who also served as chairman of the Football Association, died \"peacefully and at home\" on Friday, the party said in a statement. He was the general secretary of the AUT (Association of University Teachers), and the general secretary of the Labour Party, before he joined Sir Tony Blair's government in the House of Lords in 2004, Labour said. He served as a Foreign Office minister and then later as under-secretary of state for innovation, universities and skills before a stint as shadow minister for foreign affairs. The statement said he was \"a politician, a trade union leader, an academic and a merchant banker\" who \"pursued a very active role in the House of Lords from 2004 [as Baron Triesman, of Tottenham] until his death\". He was also a Lord in Waiting to Queen Elizabeth II from 2004-2022, Labour's statement said. The party added: \"A passionate Spurs fan, Lord Triesman became the first patron of the Tottenham Hotspur Foundation and the first independent chair of the FA (Football Association) from which platform he advocated intensely against racism in football and for the increased centrality of the women's football. \n                  Postponed local elections - what is happening?\n                 \n                  Scotland's health secretary Neil Gray repeatedly asked if Queen Elizabeth University Hospital is 'safe'\n                 \n                  Gorton and Denton by-election: Farage and Polanski could both inflict huge damage on Labour\n                 \"He later played an important role in the exposing of corruption within FIFA.\" The statement concluded: \"Beyond his many public roles, David will be ever missed by his family and friends for his warmth, love, humour, insight and the ceaseless encouragement he gave to the younger generations of their family and their friends' families.\" Prime Minister Sir Keir Starmer said he was \"saddened\" by the news, adding that Lord Triesman \"will be remembered for his brilliant contribution to our party and country, including as Labour general secretary and a government minister. \"My thoughts are with his family and friends,\" the prime minister said. Health Secretary Wes Streeting said Lord Triesman was \"a great man\", who offered him \"wisdom and advice when he was an NUS (National Union of Students) officer\". Former prime minister Sir Tony Blair said the peer was a \"vital part of the New Labour movement and became in time a great friend\". The peer was \"passionate about the cause, whether the Labour Party or football\" and was \"deeply committed to making change to improve people's lives\". The FA said on X it was \"saddened\" to hear of his death. Baroness Angela Smith, leader of the House of Lords, said he was \"respected and loved by his colleagues for his courtesy, kindness, wisdom, loyalty and generosity of spirit\". Read more on Sky News:Starmer ducks Trump's China jibeUnited Ireland ballot 'by 2030' - O'NeillEpstein 'sent cash to Mandelson's partner' \"He was great company with a wide circle of friends who shared lively conversations on his many interests and enthusiasms, particularly but not exclusively, politics and football,\" she added. \"David bore his illness with amazing courage and even in the last weeks of his life he was engaging company.\" Hollie Ridley, Labour's general secretary, also said her predecessor's \"commitment to public service was admirable and he will be much missed by those who he worked so closely with\". He is survived by his wife Lucy, Lady Triesman, and their daughter Ilona, the party said, adding that they asked for \"their privacy to be respected at this sad time\"."
    },
    {
        "title": "'Robots listening to robots': How AI music fraudsters are spamming sites and taking cash from real musicians",
        "description": "The moment you make your first AI music track can feel quite magical, especially if you are as profoundly unmusical as me.",
        "url": "https://news.sky.com/story/robots-listening-to-robots-how-ai-music-fraudsters-are-spamming-sites-and-taking-cash-from-real-musicians-13500953",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-ai-music_7151028.jpg?20260131112736",
        "type": "Technology",
        "Author": "Rowland Manthorpe",
        "Date Published": "2026-01-31 00:01:00",
        "Headline": "The tracks are not fraudulent, but the behaviour around them is. Someone will upload an AI track then use a bot to repeatedly listen to it to rack up royalties. Streaming services face a increasing battle to stem the flow.",
        "Content": "\n          Technology correspondent\n              @rowlsmanthorpe\n The moment you make your first AI music track can feel quite magical, especially if you are as profoundly unmusical as me. I cannot hold a note or even reliably maintain a beat, yet in 30 seconds I can now make an entire pop song, lyrics and all. Or a soul song. Or a metal track. Whatever comes to mind - you just tell the AI engine what you want and it does the rest. The output might be a little generic, but as far as listeners are concerned it's indistinguishable from the real thing. Even people far more musically aware than me cannot tell the difference between human and artificial songs. The musical Turing Test has been well and truly passed. AI music is a perfect example of the power of artificial intelligence to take complicated tasks and automate them to a standard that was unimaginable only a few years ago. Yet, as ever with technology, removing friction comes with a cost. I have spent the last few months investigating AI music. What has emerged is a picture of a vast attempted fraud, as technologically-equipped criminals use AI tools to try and take billions of pounds away from real-life musicians. \n                  AI-assisted mammograms result in fewer aggressive and advanced breast cancers, study suggests\n                 \n                  UK rolls out free AI training, but will it save your job?\n                 \n                  Actors' union offered better deal over AI protections\n                 The fraud takes place in two stages which sound like something from a science-fiction novel, but are now part of everyday life in the hidden world of the internet economy. First, the fraudsters make huge amounts of AI music. Then, they build bots to stream that music over and over again and thereby make some royalties. Yes, this is a case of robots listening to robot music. The defence? More robots. Let me explain. Thanks to the ease with which AI music can be made, production of it is already reaching an industrial scale. The best figures we have on the number of AI tracks being released come from Deezer, a streaming site which is the French equivalent of Spotify or Apple Music. It estimates that 60,000 fully AI tracks are being uploaded to its site every day, over a third of all production. To put that into context: in 2015 the entire US music industry made around 57,000 songs. A decade later, Deezer is set to receive 21 million AI tracks a year - and this is a conservative estimate, because the scale of AI music production is growing by the month. \"It's a way to totally flood the music streaming services,\" says Romain Hennequin, head of research at Deezer, who has developed an algorithm to detect AI music being uploaded to the platform, picking up tiny features of the music which are inaudible to the human ear. The tracks themselves are not actually fraudulent, but the behaviour around them is. Someone will upload an AI track then use an automated system - a bot - to listen to a song again and again in order to make royalties from it. This isn't a minor aspect of AI music perpetrated by a few bad apples. According to Thibault Roucou, Deezer's head of royalties: \"The vast majority of the listeners of this content is in fact what we call stream manipulation or fraud.\" His algorithms, which pick up unnatural activity on the platform in the same way that a bank looks for unusual activity around payments, suggest that as much as 85% of all listens on fully AI music are fraudulent. This is not just an issue for Deezer, but also for artists, because of the way that payments work on streaming services. There is no set price for a single stream; instead, artists get paid from a common royalty pool depending on the proportion of streams they get. This means that if someone generates a huge number of streams, they will take money away from everyone else, by reducing the amount in the common pool. The sums involved are extremely large. \"We detect 8 to 9% of the stream as being fraudulent,\" says Alexis Lanternier, CEO of Deezer. \"If you implement this 8% to the world of music, it's roughly a few billion dollars, two to three.\" 'An ongoing battle' Deezer says it is identifying the bots using their own automated systems in order to prevent the tracks they stream from generating royalties, but the fraudsters are always looking for new ways to get past the defences. \"It's an ongoing battle,\" says head of royalties Roucou. \"I think we will not lose, but we will not win anyway because they will continue to improve, and we will also. And we hope we will be able… to prevent them from taking too much money from other artists.\" When I spoke to human artists about the situation, they were shocked. \"As artists, we get such a small fraction of the money that we actually deserve to get because of the streaming system. And for that to just be getting cut shorter and shorter and shorter through robots… it makes my blood boil,\" says folk musician Lila Tristram. \"The music industry needs to get their hands around this a little bit, otherwise it could rapidly get quite out of control,\" says Aidan Grant, founder of music production agency Different Sauce. But what can be done? The genie of AI music is out of the bottle now, so currently the debate is on the best way to alert consumers and musicians. Deezer has decided to label fully AI tracks as AI, but right now it is the only streaming site to take this approach. Spotify, the world's biggest streaming service, has opted against it, for fear it might stigmatise musicians who used AI, a potential problem for a future in which every track is made using some kind of artificial assistance. Read more from Sky News:Driverless cars are coming to London 'this year' Man given Musk's AI brain chip says it feels 'magical' Neither YouTube nor Apple Music label AI tracks. YouTube said it asks creators to mark AI as AI if it looked realistic. Apple didn't respond to a request for comment. Where Spotify has joined Deezer is in trying to block the flood of AI music and fraudulent streams. Last year, it removed 75 million spam tracks, many of which will have been AI. For context, Spotify's whole catalogue stands at 100 million. The one silver lining for musicians? Although some AI tracks have gathered a lot of hype and generated millions of streams, so far there is no great appetite for it outside the occasional one-off viral hit - and of course the fraudsters. It seems that music still needs to be played and promoted by someone with genuine personal appeal for it to find a meaningful audience. The human connection matters… for the moment anyway."
    },
    {
        "title": "When can you spot this year's Snow Moon, and where did it gets its name?",
        "description": "You could catch a glimpse of the so-called Snow Moon tomorrow as it lights the night sky. ",
        "url": "https://news.sky.com/story/when-can-you-spot-this-years-snow-moon-and-where-did-it-gets-its-name-13501327",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-full-moon-uk_6983896.jpg?20250806083044",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-31 11:02:00",
        "Headline": "February's full moon has also been referred to as the Storm Moon, for weather-related reasons, or the Hunger Moon, due to the scarcity of food and hard hunting conditions of the month.",
        "Content": "You could catch a glimpse of the so-called Snow Moon tomorrow as it lights the night sky.  The full moon is expected to peak at 10.09pm UK time on Sunday, according to the Royal Observatory Greenwich. Even if you miss it, the moon tends to appear full for a couple of days before it moves into its next phase, the Waning Gibbous, when the lighted side appears to shrink. According to NASA, this full moon - the second of the year - got its name from tribes in northeast America, because of the heavy snow the season typically gets. It has also been referred to as the Storm Moon, also for weather-related reasons, or the Hunger Moon, due to the scarcity of food and hard hunting conditions during the month. There are 12 or 13 full moons each year, which all have different names typically originating from Native Americans, who branded them based on their way of life. The lunar cycle was an important method of timekeeping for tribes, the names of which were later adopted by Colonial Americans and eventually made popular in modern culture, according to the Observatory. \n                  Mandelson told Epstein he was 'trying hard' to change bonus policy after payment to husband, files show\n                 \n                  Epstein files latest: Starmer calls for Andrew to testify before US Congress as 'victims have to be first priority'\n                 \n                  Sir Richard Branson told Epstein 'bring your harem' and advised him on PR, new emails show\n                 Read more:Astronauts are going back to the moon - here's what you need to knowThe vast hi-tech fraud that could cost musicians billions of pounds You can see the full moon with the naked eye. NASA says, however, that if you look at the full moon with binoculars, it will have more details like craters and large mountain ridges. Using a telescope will make the moon too big to take in at once, it adds, but you'll see real mountains, valleys, and the cracks in the moon's surface called rilles, formed from lava. The Snow Moon is just one of the many names given to each full moon of the year, predominantly by Native Americans. Here are some of the others, according to the Royal Observatory Greenwich: January: Wolf Moon This one is named after the howling of wolves struggling for food in midwinter. February: Snow Moon March: Worm Moon Native Americans named this after the worm trails that would appear in the thawed ground as it warmed up when winter made way for spring.  April: Pink Moon This one was named after a species of early blooming wildflower. May: Flower Moon This refers to the vast blooming seen as spring gets properly under way. June: Strawberry Moon This is its North American name, a nod to the harvesting of strawberries in June. July: Buck Moon A tribute to male deer, which begin to grow back their antlers in July, having shed them earlier in the year.  August: Sturgeon Moon Sturgeons, now the most endangered species group on Earth, used to appear in large numbers during August.  September: Full Corn Moon September is the month crops are gathered following the end of summer.  The Full Corn Moon appears bright and rises early, allowing farmers to continue harvesting into the night.  October: Hunter's Moon Like its predecessor, the Hunter's Moon is bright and long, which gives hunters a rare opportunity to search for prey at night.  Hunters also benefit from deer and fox being unable to hide in fields which lay bare after crops are harvested. November: Beaver Moon There is debate over why Native Americans chose this name.  Some believe it came from them setting beaver traps during this month, while others say it comes from many beavers building their winter dams. December: Cold Moon A straightforward name for this winter month's full moon. Others include the Long Night Moon and the Oak Moon. The Blue Moon This is where the phrase \"once in a blue moon\" comes from – because these come about every so often. The moon completes 12 full cycles of its phases in about 354 days – meaning it's around 11 days short of a calendar year. Every two and a half years or so the difference adds up to an extra, 13th full moon occurring during the year, the Observatory says. We also sometimes refer to a second full moon occurring in one month as a Blue Moon. Unlike with our typical moon names, we don't know exactly where this one came from."
    },
    {
        "title": "Everything to know about Artemis II - the NASA mission to send astronauts around the moon",
        "description": "NASA is poised to send astronauts around the moon and back for the first time in more than 50 years.",
        "url": "https://news.sky.com/story/everything-to-know-about-artemis-ii-the-nasa-mission-to-send-astronauts-around-the-moon-13497536",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-artemis-space_7150117.jpg?20260130085323",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-31 00:01:00",
        "Headline": "The space agency's Artemis II mission will take the crew further than humans ‍have ever ventured in space before. Here is everything you need to know.",
        "Content": "NASA is poised to send astronauts around the moon and back for the first time in more than 50 years. The space agency's Artemis II mission will take the crew further than humans ‍have ever ventured in space before. The mission is planned for as soon as 6 February, but take-off depends on some pretty important factors. Here is everything you need to know. What is the Artemis programme? Artemis is NASA's lunar exploration programme. It aims to return humans to the moon for the first time since the last lunar landing in December 1972, which was the last mission of the Apollo programme. The Artemis missions are part of NASA's long-term plans to build a space station - called Lunar Gateway - where astronauts will be able to live and work and prepare for missions to Mars. Artemis I launched in November 2022. It involved sending an empty Orion crew capsule to circle the moon to ultimately test NASA’s Space Launch System (SLS) rocket. The programme is the pinnacle of renewed interest in the moon (after funding waned in the 1970s). It is also America’s best effort to beat the likes of China in the space race to return to the moon. The rocket and spacecraft  The SLS that will take the crew around the moon was unveiled by NASA on 17 January. The enormous rocket took a painstaking 11.5 hours to travel four miles from the hangar to the launch pad at the Kennedy Space Centre in Florida. The rocket is taller than Big Ben - standing at 98m - and is in two main sections. The core stage, which includes the fuel tanks, contains two million litres of hydrogen and 750 million litres of oxygen, frozen so that the gases become liquid. When mixed and ignited, the chemical reaction produces vast amounts of steam that is forced out of the engine nozzles at 10,000mph. Clamped to the core stage are two boosters. Just one of these produces the same thrust as 14 jumbo jets and together they produce 75% of the power in the first two minutes of flight. Once the rocket reaches orbit, the boosters will fall away, leaving the upper stage containing the Orion crew capsule - which has everything the crew need to eat, sleep and exercise - to continue. NASA says the SLS is the only rocket capable of sending astronauts, cargo and the Orion capsule directly to the moon in a single flight, but a mission like that doesn't come cheap. The SLS rocket programme has cost $23.8bn since its inception in 2011, according to data from the Planetary Society. The Orion space capsule has cost $20.4bn over 10 years since the programme started. Coupled with the cost of ground infrastructure, NASA has spent a total of $49.9bn on the programme between 2006 and their first test launch in 2022. The price tag per-launch is roughly $4bn, according to Space.com. What will happen during the mission? During the 10-day mission, the crew on Artemis II will test life support, navigation and communication systems to confirm everything operates as it should in deep space. Many of these tests will be completed while the capsule is still in the Earth’s orbit, so that the astronauts are closer to home in the event of anything going wrong. The capsule will then enter Earth’s high orbit where the crew will manually pilot Orion before control is handed back to controllers at NASA's Johnson Space Center in Houston, Texas. The astronauts will then spend four days circling the moon, travelling approximately 4,600 miles beyond its far side before returning to Earth and splashing down in the Pacific Ocean. How successful the mission is will be critical in bringing NASA one step closer to landing astronauts on the moon, the goal of Artemis III. This third stage is currently aimed to launch in mid-2027. Who will be on board? Artemis II's crew consists of three American astronauts and a Canadian. Scroll across and click on the squares to find out more about each astronaut. On 23 January the crew entered quarantine - also known as the health stabilisation programme - which ensures they do not pick up any illness before take-off. The astronauts typically start quarantine 14 days before a scheduled launch, but are able to come out again if it is cancelled - which could still happen in this case. What could delay the launch? Weighing on the 6 February launch date is the outcome of a key wet dress rehearsal, which happens four days prior and simulates the launch countdown to catch any snags or issues before flight. Artemis launch director Charlie Blackwell-Thompson told reporters in January that the wet dress is the \"driver\" of the launch schedule, adding: \"You're going to need a little bit of time to look at the data.\" Crucial flaws during a test flight three years ago have already put Artemis II behind schedule. The test flight in 2022, without humans on board, identified significant problems with the Orion crew capsule's life support system and heat shield, which required design modifications to fix. The weather could also be the critical factor between a launch or a delay. NASA has a detailed weather criterion to consider factors including the temperature, wind, precipitation, lightning, clouds and solar activity, to check whether a launch is safe or not. If there is any rain, the launch will likely not go ahead. When else could it launch? Artemis II has three launch windows through to April, timed carefully with orbital mechanics to allow for a complex path around the moon and back. If the 6 February is called off, the mission could take place on the following dates:• 7, 8,10,11 February• 6,7,8,9,11 March• 1,3,4,5,6,30 April"
    }
]