[
    {
        "title": "UFOs and Pizzagate: Hillary Clinton attacks line of questioning over Epstein",
        "description": "Hillary Clinton has denied knowledge about Jeffrey Epstein's crimes and attacked US politicians for their line of questioning.",
        "url": "https://news.sky.com/story/ufos-and-pizzagate-hillary-clinton-attacks-line-of-questioning-over-epstein-13512717",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-hillary-clinton-chappaqua_7176249.jpg?20260226231908",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-26 21:44:00",
        "Headline": "At one point, her testimony in New York was suspended after a photograph of Ms Clinton at the committee was published on social media, violating the rules for depositions.",
        "Content": "Hillary Clinton has denied knowledge about Jeffrey Epstein's crimes and attacked US politicians for their line of questioning. The former US secretary of state was compelled to appear before the US House Oversight Committee in New York and asked about the disgraced financier. After the deposition, she told reporters: \"I thought it was very repetitive... they asked literally the same questions over and over again, which didn't seem to me to be very productive. \"I did not know Jeffrey Epstein. I never went to his island. I never went to his homes. I never went to his offices.\" She then added that the questions became more bizarre and \"off subject\". She said: \"It then got, at the end, quite unusual, because I started being asked about UFOs and a series of questions about Pizzagate, one of the most vile, bogus conspiracy theories that was propagated on the internet.\" Pizzagate was a conspiracy theory used to smear Clinton when she ran as the Democrat candidate at the 2016 US election. \n                  Trump hits back at Hillary Clinton over Epstein files 'cover-up' claim\n                 \n                  The Epstein Files - where's Donald Trump?\n                 \n                  Epstein files latest: Democrats rebuke Republicans for 'clown show' Clinton deposition after 'unacceptable' interruption\n                 The long-debunked theory alleged high-profile Democrats ran a paedophile abuse ring from a Washington pizza restaurant. At one point, Ms Clinton's testimony in New York was suspended after a photograph of her at the committee was published on social media, violating the rules for depositions. The image was posted on X by Benny Johnson, a right-wing political commentator and YouTuber, claiming it was provided to him by Republican representative Lauren Boebert. Sky News's US correspondent James Matthews said Ms Clinton made a \"blistering attack\" on the oversight committee, which she accused of \"partisan political theatre\" and \"alleging a cover-up to protect Donald Trump\". In an opening statement, which she shared on social media, she said the committee \"run by elected officials with a commitment to transparency would ensure the full release of all the files... if it wanted to get to the bottom of reports that DoJ [Department of Justice] withheld FBI interviews in which a survivor accuses President Trump of heinous crimes\". She claimed she was being compelled to testify \"to distract attention from President Trump's actions\". Democrats claim material from the Epstein files was withheld, including records of a woman who accused the president of sexually abusing her when she was a child. Mr Trump has consistently denied any wrongdoing. Ms Clinton said Epstein was a \"heinous individual\" but is \"far from alone\", calling the crimes he committed a \"global scourge with an unimaginable human toll\". Meanwhile, Democrats on the House Oversight Committee have been backing Ms Clinton, and criticised the leak of a photo from inside the deposition. Congresswoman Yassamin Ansari described the deposition as an \"incredibly unserious clown show\". Fellow Democrat Robert Garcia also spoke to call for President Trump to testify: \"We want to understand right now where the missing FBI files are. \"These are files that accuse the president of the United States about serious, serious accusations around sexual abuse,\" he said. Donald Trump has denied all accusations of wrongdoing, saying the Epstein files exonerated him. Read more from Sky News:Chance of US attack on Iran recedesZelenskyy: 'I'm not the best father'Afghanistan strikes Pakistan Hillary Clinton, and her husband Bill, agreed to appear before the committee after their offers of sworn statements were rejected by the House Oversight panel. Mr Clinton's testimony on Friday will be the first time a former president has been forced to testify before Congress. A close friend and former aide of the Clintons has told Sky News that Republicans have \"created a trap\" for Donald Trump by enforcing a summons on Bill Clinton to testify about Jeffrey Epstein. Sidney Blumenthal said the Democrats will surely respond by forcing Mr Trump to testify himself \"if and when\" they take control of Congress. He says cabinet members such as Howard Lutnick, commerce secretary, and Pam Bondi, attorney general, could also be called to testify, as could Melania Trump over her previous relationship with Epstein co-conspirator Ghislaine Maxwell."
    },
    {
        "title": "'I'm not the best father,' admits Volodymyr ​Zelenskyy as president says Ukraine hit by harshest winter for decades'",
        "description": "Ukraine's president has spoken of personal challenges, after several years of conflict with Ukraine, admitting \"I'm not the best father\" in a Sky News interview.",
        "url": "https://news.sky.com/story/im-not-the-best-father-admits-volodymyr-8203zelenskyy-as-president-says-ukraine-hit-by-harshest-winter-for-decades-13512689",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-ukraine-russia_7176138.jpg?20260226212023",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-26 20:26:00",
        "Headline": "The Ukrainian leader told Sky News that his presidential role and responsibilities had taken their toll on his family.",
        "Content": "Ukraine's president has spoken of personal challenges, after several years of conflict with Ukraine, admitting \"I'm not the best father\" in a Sky News interview. Speaking to international correspondent, Alex Rossi, Volodymyr ​Zelenskyy also praised the work of civilians to fix Ukraine's energy systems after repeated Russian attacks, amid an extremely harsh winter. On Thursday, he said Russia launched 420 drones ‌and 39 missiles, injuring dozens ‌of people and damaging buildings. Ukraine war latest: Moscow 'divides' coalition of the willing During the interview in Kyiv, Mr Zelenskyy said there were \"phenomenal people\" who were repairing power supplies amid a \"very difficult\" winter. \"I mean, this was the harshest winter for a couple of decades... minus 20... at night minus 30. \"But it doesn't matter, day or night, because if you don't have heating, it's difficult during the day, during the night... because minus 30 is so difficult, [a] big challenge for our people,\" he said. \n                  EU not doing enough to stop Russian shadow fleet, European Parliament president says\n                 \n                  European leaders came together in solidarity on Ukraine war fourth anniversary - but peace seems a long way off\n                 \n                  'Not a Palestinian in sight': Inside Gaza after the ceasefire \n                 Speaking in English, the president talked about the sacrifices made by civilians to keep the lights on. \"Also with civilians, who are really very helpful during this war... we had absolutely heroic teams who renovated electricity, energy system and also we had losses because they did it [repairs] under missile attacks,\" he said. Read more from Sky News:The hunt for Russia's shadow fleetUkrainian family denied UK asylumUkraine teens on life in a war zone But Mr Zelenskyy also accepted that his presidential role and responsibilities had taken their toll on his family. \"During the war, I'm not the best father... because I don't have too much time for my children. \"I'm the president of Ukraine, I don´t compare my job... because my choice... is duty. My choice is Ukraine. That's why I said I'm no good father during the war.\" Separately, Ukrainian and US officials met in Geneva on Thursday for talks on post-war reconstruction despite a deadlock in peace negotiations with Russia. Mr Zelenskyy confirmed the next ‌round of US-brokered ​peace negotiations will likely ​take place in Abu ​Dhabi ⁠in early ⁠March. Ukrainian ‌negotiator Rustem Umerov also said negotiators ​were working on finalising ⁠economic and security issues to \"make the ⁠next trilateral ​meeting involving the US and ​Russia as substantive as possible\"."
    },
    {
        "title": "'Miracle' boy expected to be paralysed due to spina bifida able to walk after ground-breaking surgery in the womb",
        "description": "A three-year-old boy who would almost certainly have been born paralysed because of a severe spinal abnormality is able to walk after having ground-breaking stem cell surgery while still in the womb.",
        "url": "https://news.sky.com/story/miracle-boy-expected-to-be-paralysed-due-to-spina-bifida-able-to-walk-after-ground-breaking-surgery-in-the-womb-13512709",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-science-spina-bifida_7176175.jpg?20260226221137",
        "type": "Home",
        "Author": "Thomas Moore",
        "Date Published": "2026-02-26 21:26:00",
        "Headline": "Tobi Maginnis, who had a condition in which the spinal cord fails to develop properly, underwent pioneering stem cell surgery as part of a world-first clinical trial. ",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n A three-year-old boy who would almost certainly have been born paralysed because of a severe spinal abnormality is able to walk after having ground-breaking stem cell surgery while still in the womb. An ultrasound scan 20 weeks into pregnancy showed Tobi Maginnis had spina bifida, a disabling condition in which the spinal cord fails to develop properly during pregnancy, leaving part of it growing outside the body. But he became just the second baby to have the abnormality repaired before he was born using rejuvenating stem cells taken from the placenta. His mum, Michelle Johnson, told Sky News that he was full of energy. \"He runs, he walks, he jumps, he is all over the place,\" she said. \"We expected Tobi to be wheelchair-bound. So to see where he is now, it's nothing short of a miracle.\" 'Blessed every day' Tobi was one of six babies in a world-first clinical trial led by the University of California Davis Children's Hospital. Around 25 weeks into pregnancy surgeons made a small opening in the mothers' abdomen and womb. They then placed a patch of stem cells over the babies' exposed spinal cord and then closed up the incision to allow the tissue to regenerate. All were born healthy, with no sign of side effects from treatment, according to results published in The Lancet medical journal. Tobi's dad, Jeff Maginnis, said: \"He's the second human to go through this surgery with stem cells. So there was a lot of uncertainty, a lot of unknowns. \"We're just blessed every day when we see how Tobi's reacted and been affected by this very successful surgery.\" Clinicians 'cautiously optimistic' Dr Diana Farmer, who led the study and has pioneered the technique, said the birth of the first baby, a girl called Robbie, had been a surprise. \"The most exciting thing was the baby came out kicking her legs and wiggling her toes, which really exceeded expectations,\" she said. \"We expected her, had she not had treatment, to not be able to have that kind of leg movement.\" Dr Farmer said she was \"cautiously optimistic\". \"We're just making sure that there are no unexpected things from having stem cells in the spinal cord of a foetus,\" she said. \"This is brand new.\" Read more from Sky News:Meet the kids who want a social media banUK connects first mobile network to Elon Musk's satellites Hope for the future Around 500 babies a year in the UK are born with myelomeningocele, the most severe form of spina bifida. Developing spinal tissue fails to seal up properly in early pregnancy leaving babies at risk of total paralysis of the legs and problems with bowel and bladder control. Surgery in the womb to correct the abnormality is increasingly common, but one study showed around half of babies are unable to walk independently. The US surgeons hope that using stem cells will improve success rates, helping with walking and potty training. They've started a larger clinical trial of 35 pregnant women. Their babies will be monitored over several years to confirm whether the stem cell technique is effective in the longer term."
    },
    {
        "title": "Child killer Ian Huntley will be vulnerable to another attack if he survives",
        "description": "Any prisoner convicted of a child sex crime is a target for other inmates.",
        "url": "https://news.sky.com/story/child-killer-ian-huntley-will-be-vulnerable-to-another-attack-if-he-survives-13512553",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-frankland-durham-prison_6637099.jpg?20260226175927",
        "type": "Home",
        "Author": "Martin Brunt",
        "Date Published": "2026-02-26 15:09:00",
        "Headline": "Huntley, who is serving a life sentence for the murders of 10-year-olds Holly Wells and Jessica Chapman, was seriously injured in an assault in prison on Thursday morning.",
        "Content": "\n          Crime commentator\n              @skymartinbrunt\n Any prisoner convicted of a child sex crime is a target for other inmates. The court may have delivered justice in a case such as Ian Huntley's, but for some fellow criminals, what's really needed is revenge - to make you suffer like you made your victims suffer. From his first day in inside, there was a price on Huntley's head - not a monetary one, but the promise of \"respect\" for anyone who attacked him. Read more: Soham murderer Ian Huntley seriously injured In the violent world of a top security jail, respect from your fellow cons is everything and there's nothing quite like hurting a prisoner considered \"the lowest of the low\". An infamous villain once described to me over lunch how he witnessed a planned prison knife attack on a child sex offender, a story he told years later with relish, laughter and no grim detail spared. Huntley would have been on Rule 43, held in the prison's unit for vulnerable inmates, mostly sex offenders, but police informants too. But it's impossible to fully protect everyone, especially in today's chaotic jail system with overcrowding and increased violence, alongside the regular departure of disillusioned older warders who are replaced with more inexperienced officers. Read more from Sky News:Jersey votes to allow assisted dyingOcado to cut 1,000 jobs under restructuring plan Mark Leech, editor of the Prisons Handbook, said: \"The upcoming young thugs in prison see people like Huntley as a way of gaining kudos, especially if they are already serving lengthy sentences.\" If Huntley recovers, he will always be vulnerable to another attack. Some prisoners have long memories and plenty of time to think."
    },
    {
        "title": "Defence secretary orders search for record of Epstein trafficking women through RAF bases",
        "description": "Defence Secretary John Healey has told officials to review military records to find any evidence of Jeffrey Epstein trafficking women into Britain through RAF bases.",
        "url": "https://news.sky.com/story/defence-secretary-orders-search-for-record-of-epstein-trafficking-women-through-raf-bases-13512708",
        "image_url": "https://e3.365dm.com/21/12/1920x1080/skynews-ghislaine-maxwell-i_5620997.jpg?20260217201432",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-26 21:13:00",
        "Headline": "The latest tranche of Epstein files revealed the paedophile used RAF bases to land his private jet.",
        "Content": "Defence Secretary John Healey has told officials to review military records to find any evidence of Jeffrey Epstein trafficking women into Britain through RAF bases. He has told them to leave \"no stone unturned\" as they search through more than 20 years of Ministry of Defence (MoD) documents to find evidence of the paedophile billionaire's private jet landing at bases. Private jets are allowed to land at military bases by prior arrangement, and for a fee, as long as they do not interfere with any operations. Mr Healey's order comes after Gordon Brown last week claimed the British state may have facilitated Epstein's crimes by allowing his plane to land at RAF bases, sometimes with unknown women onboard. The former prime minister noted one particular flight in December 2000, when Epstein's Gulfstream plane landed at a Norfolk airbase before he visited Sandringham with Andrew Mountbatten-Windsor. The former prince was arrested last week on suspicion of misconduct in public office after emails released by the US Department of Justice appeared to show he sent confidential information to Epstein from his time as a trade envoy. He has always denied wrongdoing. \n                  Mandelson arrested as Trump attacks Supreme Court \n                 \n                  Government to consider new law to remove Andrew Mountbatten-Windsor from royal line of succession\n                 \n                  Epstein files see to arrest of Andrew Mountbatten-Windsor\n                 Epstein files latest: Democrats call Clinton deposition 'clown show' An MoD spokesperson told Sky News: \"The defence secretary has ordered a review of all records that the department may hold relating to Epstein flights landing at RAF bases to ensure that any information which relates to Epstein's crimes is uncovered and provided to the relevant authorities. \"The MoD will support any civilian police investigations. \"Our thoughts are with all the victims of Epstein's vile crimes.\" Other emails from the latest tranche show Epstein flew into RAF Northolt in northwest London and RAF Marham in Norfolk at least four times between 2000 and 2019. Read more:Police apologise to second parliamentary Speaker over Mandelson arrest leakUkrainian family denied UK asylum told to block out bombs with headphones Further flights, including passenger manifests, could be unearthed in the military records search. It is understood officials will look through MoD emails to find any record of Epstein or his team booking RAF airfields. The US administration has released details of Epstein's plane, which will be used to search for any records. While RAF flight logs are deleted after three months, it is understood emails between MoD officials and private travellers are kept."
    },
    {
        "title": "Driver who crashed while gambling on mobile is jailed after pregnant woman suffered premature birth",
        "description": "A driver has been jailed after crashing into the back of a car while gambling on his mobile phone, and causing a pregnant woman to go into labour.",
        "url": "https://news.sky.com/story/driver-who-crashed-while-gambling-on-mobile-is-jailed-after-pregnant-woman-suffered-premature-birth-13512591",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-jack-bentley-derby-crown-court_7175884.png?20260226164423",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-26 16:32:00",
        "Headline": "Jack Bentley admitted driving into the back of a stationary vehicle on the A50 in Derbyshire in April 2025.",
        "Content": "A driver has been jailed after crashing into the back of a car while gambling on his mobile phone, and causing a pregnant woman to go into labour. Derby Crown Court heard Jack Bentley, 30, from Meadow Way, Derby, was seen veering into the grass verge of the A50 in Derbyshire, swerving between lanes and lane hogging on 6 April 2025. His Ford Focus then collided into the back of a Nissan X Trail, which was queuing in stationary traffic. A pregnant passenger in the Nissan suffered a fractured pelvis, was rushed to hospital and gave birth prematurely, leaving her baby in intensive care, the court was told. The Nissan's driver and two other children were also injured, while the family's pet dog had to undergo emergency surgery. Bentley admitted two counts of causing serious injury by dangerous driving and, on 11 February, was jailed for two years and four months. In a victim impact statement, the woman said she found the emergency caesarean \"very traumatic\" and \"missed out on so much in those early moments\" following the birth because her baby was in an incubator. \n                  Turkey butcher guilty of killing and cutting up girlfriend 15 years ago\n                 \n                  Derbyshire police force fined £60,000 after officers burned by petrol bombs during riot training\n                 \n                  Derby police evacuate around 200 homes as men arrested on suspicion of explosives offences\n                 She added: \"I remember being there watching when all the nurses and doctors rushed around because her lung had collapsed and I had to lay there scared for her. Hours later, the other lung also collapsed. \"She wasn't strong enough for the world yet. For my first pregnancy, this was a very traumatic experience and one no parent expects or wants to experience.\" Read more from Sky News:Soham murderer seriously injuredParents alerted over suicide searchesDrop in asylum seeker hotel figures Dashcam footage from another motorist captured the crash, as Bentley's Ford Focus continued moving at speed towards the stationary line of vehicles, then collided into the rear of the Nissan, causing debris to fly into the air and scatter across the road. After Bentley's arrest at the scene, analysis of his phone data showed he had been using his phone while driving, visiting online gambling sites as he travelled from Blackpool to Derby. PC Richard Morris, who led the investigation, said: \"This was an appalling display of driving by Bentley, who spent the majority of his journey distracted by being on his phone. \"From watching the dashcam footage, it was clear that had he been paying attention he would have seen the queue of traffic in front of him and been able to stop in time. \"I know that the physical, mental and emotional trauma from this incident continues to impact on this family.\" Bentley was also disqualified from driving for three years and two months."
    },
    {
        "title": "Police apologise to second parliamentary Speaker in two days over Mandelson arrest leak",
        "description": "The Metropolitan Police has apologised to a second parliamentary Speaker in two days after he was incorrectly named as the person who passed on information about Lord Mandelson, which led to his arrest.",
        "url": "https://news.sky.com/story/police-apologise-to-second-parliamentary-speaker-in-two-days-over-mandelson-arrest-leak-13512540",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-peter-mandelson-arrest_7175616.jpg?20260226131900",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-26 14:33:00",
        "Headline": "The former British ambassador to the US was arrested on Monday on suspicion of misconduct in public office.",
        "Content": "The Metropolitan Police has apologised to a second parliamentary Speaker in two days after he was incorrectly named as the person who passed on information about Lord Mandelson, which led to his arrest. Michael Forsyth, the Lord Speaker of the House of Lords, was named in reports as having warned the police that Lord Mandelson was going to flee to the British Virgin Islands. It was actually Sir Lindsay Hoyle, the speaker of the House of Commons, who had. Lord Mandelson was arrested on Monday on suspicion of misconduct in public office, regarding his time as business secretary in Gordon Brown's cabinet in the 2000s. He went with police from his home in Camden, north London, at about 4.15pm on Monday to a police station, where he was questioned for eight hours before being released on bail just after 1am. Lord Mandelson was seen on Thursday for the first time since returning home from his arrest, appearing stony-faced as he left his house just after 1pm and returned at about 4pm. The former Labour peer denies any wrongdoing. \n                  Greens look to be in the lead in by-election - with Labour blame game already under way\n                 \n                  Assisted dying bill will almost certainly fail due to a lack of time\n                 \n                  Sky's deputy political editor explains why the Assisted Dying Bill is likely to fail\n                 It emerged on Tuesday that he was arrested because police had been told he was a flight risk. However, the wrong Speaker was named as the source of the claim. After Lord Forsyth was named, Sir Lindsay Hoyle, the House of Commons Speaker, told MPs on Wednesday morning it was actually he who had warned the police after he was passed the information while he was on holiday in the British Virgin Islands last week. The Met apologised to Sir Lindsay on Wednesday, saying it had \"inadvertently\" revealed information about why Lord Mandelson had been taken into custody. Read more:Mandelson's 'vile' Epstein emails make me 'angry' - foreign secretary'No proper vetting' of 'Trump whisperer' Mandelson Now, the force has apologised to Lord Forsyth as well. A spokesperson said on Thursday: \"The Met has also apologised to the Speaker of the House of Lords, following the inadvertent revealing of information into allegations of misconduct in public office.\" Lawyers for Lord Mandelson denied the \"baseless\" allegation that he was going to flee, and said he had already agreed to attend a voluntary interview in a fortnight's time. They have also asked the Met for the \"evidence relied upon to justify the arrest\". Lord Mandelson was sacked as British ambassador to the US in September after it emerged he remained in close contact with billionaire Jeffrey Epstein after his conviction for paedophilia. Sir Keir Starmer has said the former minister lied to him as part of the vetting process. At the beginning of this month, the US Department of Justice released another tranche of Epstein emails, which revealed how close their relationship was. Lord Mandelson resigned from the Labour Party to avoid causing \"further embarrassment\", then stepped down from the House of Lords - but he remains a Lord in name as peerages can only be taken away through an Act of Parliament."
    },
    {
        "title": "Assisted dying bill will almost certainly fail due to a lack of time",
        "description": "Controversial legislation to permit assisted dying in England and Wales is set to fail because of a lack of parliamentary time, Sky News can reveal.",
        "url": "https://news.sky.com/story/assisted-dying-bill-will-almost-certainly-fail-due-to-a-lack-of-time-13512476",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-assisted-dying-kim-leadbeater_7175417.jpg?20260226132827",
        "type": "Home",
        "Author": "Sam Coates",
        "Date Published": "2026-02-26 12:25:00",
        "Headline": "The government says it will not give the bill any further debate time in the Lords, meaning the parliamentary session will end before it can pass.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Controversial legislation to permit assisted dying in England and Wales is set to fail because of a lack of parliamentary time, Sky News can reveal. The Labour chief whip in the Lords, Roy Kennedy, said this week that the government would not give the Terminally Ill Adults (End of Life) Bill more time before the May deadline, when all legislation must have passed or automatically falls. The team behind the bill also confirmed they now expected the legislation in its current form to fail. There are six remaining sitting days left before May, when the King's Speech happens, and the government is not repeating what it did in December by giving more time. Politics latest - follow live Advocates for the bill did not blame the government, which it said had been helpful to date, and instead aimed their fire on a minority of peers who have been asking thousands of questions about the details of the bill. Broadcaster and campaigner Esther Rantzen told Sky News: \"This is absolute blatant sabotage. This is a handful of peers putting down 1,200 amendments not to scrutinise the bill, which is their job, but to block it. \n                  Jersey votes to allow assisted dying\n                 \n                  'My mum wouldn't have chosen that end - she knew exactly what was going to happen'\n                 \n                  'Outrageous': Assisted dying critics attack 'unprecedented' plan to force through bill\n                 \"A few peers for their own reasons have decided that they're going to stop this going through parliament, and the only way to stop them would be to invoke the Parliament Act, which has happened before, or get rid of the House of Lords - they're clearly not fit for purpose.\" She said she was still hopeful the change would come, as there is a rising cry for reform all around the world. She paid tribute to Sir Keir Starmer, who favours a change in the law, and said he had done everything he promised her before the election. Frank Sutton, who has terminal cancer and wants to choose how she dies, told Sky News: \"I don't want to die without dignity, without it being my choice, without my family knowing that this is what I want.\" Dr Gordon McDonald, chief executive of Care Not Killing, which is opposed to assisted dying, told Sky News: \"This issue is very difficult, and it needs proper scrutiny - that's what the members of the House of Lords have been doing. \"It didn't get proper scrutiny in the House of Commons. It's right that parliaments look at these bills properly and give them due consideration, that's what the House of Lords is doing.\" Many members of the public and even MPs were unaware that the bill was likely to fail. Earlier this week, the Welsh Parliament approved a \"legislative consent order\", endorsing in theory the legislation that it expected to come out of Parliament. The debate will now focus on what happens after May, with proponents of a change in the law saying the public polling and the repeated backing of MPs means that this legislation should be given a second chance. However, the government is likely to continue keeping the issue at arms length, since there is no single cabinet position on the issue and members of the cabinet like Wes Streeting and Shabana Mahmood are implacably hostile to the change. This makes a change in the law much more tricky. Some MPs who backed the bill in its Commons stages have told Sky News the process was so torturous that they would not want a repeat of it. Supporters have suggested that you would not have to go through the entire process - avoiding committee stage if the same bill was resurrected - and the Commons stages could in theory be done in one day, and the Parliament Act then deployed to override the objections in the Lords. However, the more turbulent political context for the government, the bandwidth that even this would occupy in government, and the fact the reforms would not be complete before a general election, mean that this would be a significantly bigger challenge second time around."
    },
    {
        "title": "YouTuber accused of murdering pregnant girlfriend 'recorded livestream alibi four days earlier'",
        "description": "A YouTuber accused of murdering his pregnant girlfriend recorded the livestream he used as an alibi four days earlier, a court heard.",
        "url": "https://news.sky.com/story/youtuber-accused-of-murdering-pregnant-girlfriend-recorded-livestream-alibi-four-days-earlier-13512680",
        "image_url": "https://e3.365dm.com/23/01/1920x1080/skynews-natalie-mcnally-blevins_6016387.jpg?20230106165146",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-26 19:49:00",
        "Headline": "Stephen McCullagh claimed he was playing computer games while Natalie McNally was being stabbed, beaten and strangled at her home in County Armagh.",
        "Content": "A YouTuber accused of murdering his pregnant girlfriend recorded the livestream he used as an alibi four days earlier, a court heard. Stephen McCullagh appeared to be broadcasting himself live playing Grand Theft Auto and drinking Guinness in his house in County Antrim while Natalie McNally was being killed around 30 miles away in Lurgan, County Armagh. McCullagh, 36, has denied murdering his 32-year-old partner, who was 15 weeks pregnant with their son. But the prosecution argued the stream was pre-recorded and posted as if it was live on 18 December 2022, while McCullagh disguised himself and took a bus to Lurgan before walking to Ms McNally's house and attacking her. He later returned home by taxi, before going back to Ms McNally's house the next evening and calling 999, it was claimed. Earlier this week the trial heard Ms McNally was subjected to a prolonged assault, suffering stab wounds to the neck, strangulation and heavy blows to the head. Prosecutors allege her murder was \"planned, calculated and premeditated, one which he [McCullagh] hoped to get away with\". On Wednesday, the court was shown over an hour of footage from the supposed livestream, which showed McCullagh playing Grand Theft Auto and Robot Wars while drinking Guinness and Baileys, and making references to broadcasting live. During evidence heard the following day, digital forensic analyst Detective Constable Matthews said his examination of the defendant's computer \"provided extensive evidence indicating that the broadcast was pre-recorded and later streamed as a live event\". Read more from Sky News:Assisted dying bill almost certainly failing due to lack of timeWoman fled Nottingham attacker by jumping from window DC Matthews said probe of the computer indicated the six-hour broadcast had been recorded on 14 December and saved as a video file. He said it was then broadcast as live on McCullagh's YouTube account on 18 December. And DC Matthews explained the software showed no signs of user activity between 6pm and just after midnight on 19 December. The video file was then deleted in the early hours of 19 December and then removed from the computer's recycling bin. \"Activity relating to video recording was taking place on the 14th, the creation of the pre-recorded video file was completed on the 15th, in the early hours,\" he said. \"There was the creation of a social media advert between the 14th and 17th and a live stream of a pre-recorded video file was carried out between the 18th and 19th, and finally the deletion of the said file in the early hours of the 19th, 2022.\" The trial was also shown clips from CCTV and doorbell cameras on the evening of 18 December showing a person walking from the street to a bus stop where they paid cash to take a bus to Lurgan and then walked to Ms McNally's street. Later footage showed a figure wearing a different outfit and walking from Ms McNally's street into Lurgan, where they got into a taxi which was seen in another clip arriving on McCullagh's street. The trial continues."
    },
    {
        "title": "'Significant progress' in US-Iran talks - but no deal - as negotiations to resume next week",
        "description": "The US and Iran held indirect talks over Tehran's nuclear programme on Thursday, but left the negotiating table without a deal.",
        "url": "https://news.sky.com/story/significant-progress-in-us-iran-talks-but-no-deal-as-negotiations-to-resume-next-week-13512695",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-iran-usiran-talks_7176169.jpg?20260226220829",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-26 20:45:00",
        "Headline": "US President Donald Trump wants to reach a deal restricting Iran's nuclear programme and hopes to take advantage of the turmoil in Iran.",
        "Content": "The US and Iran held indirect talks over Tehran's nuclear programme on Thursday, but left the negotiating table without a deal. They made \"significant progress\" in Geneva, Oman's Foreign Minister Badr al-Busaidi, who participated as a mediator, said afterwards, without elaborating. It comes as the US has gathered a large fleet of aircraft and warships in the Middle East following widespread nationwide protests in Iran. If the US launches an attack on Iran, Tehran has vowed to retaliate by targeting US military bases and by attacking Israel. On 19 February, Trump said that the world would find out \"over the next, probably, 10 days\" whether a deal would be reached or the US would take military action. Talks to 'resume soon' Donald Trump wants to reach a deal restricting Iran's nuclear programme and hopes to take advantage of the turmoil in Iran. But Tehran appears to be standing firm, with state television reporting just before the talks ended that Iran was determined to continue enriching uranium - a key step to build a nuclear bomb - and had rejected proposals to transfer it abroad and sought the lifting of international sanctions. Mediator Mr al-Busaidi said the talks \"will resume soon\", with technical-level negotiations to continue in Vienna next week. The United Nations' atomic watchdog, the International Atomic Energy Agency, is based in Vienna and would likely be critical in any deal. International affairs editor Talks many feared could end up breaking down and leading to war in the Middle East, have instead finished in Geneva inconclusively. There was no complete breakdown in the negotiations between Iran and America, which are mediated by Oman. That means the chances of Donald Trump unleashing the massive firepower he has been amassing in the region recede for now. But there was no breakthrough either. Instead, the two sides will continue talking, at a \"technical level\", say the Omanis, in Vienna next week. The Iranians say they will focus on the nuclear issue and sanctions only.  The Americans had wanted agreement on Iran's ballistic missiles, use of proxies and brutal treatment of its people, too. If Iranians have managed to shift the argument away from those issues, that will be seen as a diplomatic victory for Tehran. The news suggests both sides found something to agree on in principle if the next level is discussing technical details. The best guess is that the focus will be on uranium enrichment. Trump wants the Iranians to stop enriching uranium entirely; the Iranians insist they have the right to do so if only at low levels.  The good news is we are moving away from war, and diplomacy continues. But we are not out of the woods. President Trump is mercurial and unpredictable. He may still grow impatient with the peace of talks next week. Americans' big fear is that they get drawn into protracted, drawn-out negotiations and are played for time by the Iranians. The talks may still fail to reach an agreement, but there will be relief across the region that the prospect of war is - for now at least - diminishing. US Special Envoy Steve Witkoff, a billionaire real estate developer and friend of Mr Trump, led the US delegation at the talks, which also included the president's son-in-law, Jared Kushner. Apart from demanding Iran halt its enrichment of uranium, which Tehran maintains it has the right to do, Mr Witkoff also tried to convince Iranian Foreign Minister Abbas Araghchi that Tehran should curtail or stop its production of long-range missiles, a topic Iran refused to discuss. Iran says it will only discuss nuclear issues and claims its atomic programme is only for peaceful purposes. Read more: Trump's plan for Iran isn't working - he has three options 'Most intense negotiations' Mr Araghchi told Iranian state television that US-Iran talks were some of his country's \"most intense and longest rounds of negotiations\". It was the third meeting since Israel launched a 12-day war against Iran last June, which saw the US carrying out strikes against several Iranian nuclear sites, leaving them in ruins. Read more from Sky News:Jerusalem braces for prospect of Middle East war How Iran may be preparing for US strike The Iranian delegation presented its latest proposal to its US counterparts and while Mr Araghchi offered no specifics on Tehran's demands, he said \"what needs to happen has been clearly spelled out from our side\". The White House has not yet commented on Thursday's negotiations. But Ali Vaez, an Iran expert for the International Crisis Group, told the Associated Press that it was a good sign that the US delegation did not walk away immediately after receiving Tehran's proposal, explaining that it shows \"there is enough common ground between the two sides\"."
    },
    {
        "title": "'Miracle' boy expected to be paralysed due to spina bifida able to walk after ground-breaking surgery in the womb",
        "description": "A three-year-old boy who would almost certainly have been born paralysed because of a severe spinal abnormality is able to walk after having ground-breaking stem cell surgery while still in the womb.",
        "url": "https://news.sky.com/story/miracle-boy-expected-to-be-paralysed-due-to-spina-bifida-able-to-walk-after-ground-breaking-surgery-in-the-womb-13512709",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-science-spina-bifida_7176175.jpg?20260226221137",
        "type": "UK",
        "Author": "Thomas Moore",
        "Date Published": "2026-02-26 21:26:00",
        "Headline": "Tobi Maginnis, who had a condition in which the spinal cord fails to develop properly, underwent pioneering stem cell surgery as part of a world-first clinical trial. ",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n A three-year-old boy who would almost certainly have been born paralysed because of a severe spinal abnormality is able to walk after having ground-breaking stem cell surgery while still in the womb. An ultrasound scan 20 weeks into pregnancy showed Tobi Maginnis had spina bifida, a disabling condition in which the spinal cord fails to develop properly during pregnancy, leaving part of it growing outside the body. But he became just the second baby to have the abnormality repaired before he was born using rejuvenating stem cells taken from the placenta. His mum, Michelle Johnson, told Sky News that he was full of energy. \"He runs, he walks, he jumps, he is all over the place,\" she said. \"We expected Tobi to be wheelchair-bound. So to see where he is now, it's nothing short of a miracle.\" 'Blessed every day' Tobi was one of six babies in a world-first clinical trial led by the University of California Davis Children's Hospital. Around 25 weeks into pregnancy surgeons made a small opening in the mothers' abdomen and womb. They then placed a patch of stem cells over the babies' exposed spinal cord and then closed up the incision to allow the tissue to regenerate. All were born healthy, with no sign of side effects from treatment, according to results published in The Lancet medical journal. Tobi's dad, Jeff Maginnis, said: \"He's the second human to go through this surgery with stem cells. So there was a lot of uncertainty, a lot of unknowns. \"We're just blessed every day when we see how Tobi's reacted and been affected by this very successful surgery.\" Clinicians 'cautiously optimistic' Dr Diana Farmer, who led the study and has pioneered the technique, said the birth of the first baby, a girl called Robbie, had been a surprise. \"The most exciting thing was the baby came out kicking her legs and wiggling her toes, which really exceeded expectations,\" she said. \"We expected her, had she not had treatment, to not be able to have that kind of leg movement.\" Dr Farmer said she was \"cautiously optimistic\". \"We're just making sure that there are no unexpected things from having stem cells in the spinal cord of a foetus,\" she said. \"This is brand new.\" Read more from Sky News:Meet the kids who want a social media banUK connects first mobile network to Elon Musk's satellites Hope for the future Around 500 babies a year in the UK are born with myelomeningocele, the most severe form of spina bifida. Developing spinal tissue fails to seal up properly in early pregnancy leaving babies at risk of total paralysis of the legs and problems with bowel and bladder control. Surgery in the womb to correct the abnormality is increasingly common, but one study showed around half of babies are unable to walk independently. The US surgeons hope that using stem cells will improve success rates, helping with walking and potty training. They've started a larger clinical trial of 35 pregnant women. Their babies will be monitored over several years to confirm whether the stem cell technique is effective in the longer term."
    },
    {
        "title": "Police apologise to second parliamentary Speaker in two days over Mandelson arrest leak",
        "description": "The Metropolitan Police has apologised to a second parliamentary Speaker in two days after he was incorrectly named as the person who passed on information about Lord Mandelson, which led to his arrest.",
        "url": "https://news.sky.com/story/police-apologise-to-second-parliamentary-speaker-in-two-days-over-mandelson-arrest-leak-13512540",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-peter-mandelson-arrest_7175616.jpg?20260226131900",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-26 14:33:00",
        "Headline": "The former British ambassador to the US was arrested on Monday on suspicion of misconduct in public office.",
        "Content": "The Metropolitan Police has apologised to a second parliamentary Speaker in two days after he was incorrectly named as the person who passed on information about Lord Mandelson, which led to his arrest. Michael Forsyth, the Lord Speaker of the House of Lords, was named in reports as having warned the police that Lord Mandelson was going to flee to the British Virgin Islands. It was actually Sir Lindsay Hoyle, the speaker of the House of Commons, who had. Lord Mandelson was arrested on Monday on suspicion of misconduct in public office, regarding his time as business secretary in Gordon Brown's cabinet in the 2000s. He went with police from his home in Camden, north London, at about 4.15pm on Monday to a police station, where he was questioned for eight hours before being released on bail just after 1am. Lord Mandelson was seen on Thursday for the first time since returning home from his arrest, appearing stony-faced as he left his house just after 1pm and returned at about 4pm. The former Labour peer denies any wrongdoing. \n                  Greens look to be in the lead in by-election - with Labour blame game already under way\n                 \n                  Assisted dying bill will almost certainly fail due to a lack of time\n                 \n                  Sky's deputy political editor explains why the Assisted Dying Bill is likely to fail\n                 It emerged on Tuesday that he was arrested because police had been told he was a flight risk. However, the wrong Speaker was named as the source of the claim. After Lord Forsyth was named, Sir Lindsay Hoyle, the House of Commons Speaker, told MPs on Wednesday morning it was actually he who had warned the police after he was passed the information while he was on holiday in the British Virgin Islands last week. The Met apologised to Sir Lindsay on Wednesday, saying it had \"inadvertently\" revealed information about why Lord Mandelson had been taken into custody. Read more:Mandelson's 'vile' Epstein emails make me 'angry' - foreign secretary'No proper vetting' of 'Trump whisperer' Mandelson Now, the force has apologised to Lord Forsyth as well. A spokesperson said on Thursday: \"The Met has also apologised to the Speaker of the House of Lords, following the inadvertent revealing of information into allegations of misconduct in public office.\" Lawyers for Lord Mandelson denied the \"baseless\" allegation that he was going to flee, and said he had already agreed to attend a voluntary interview in a fortnight's time. They have also asked the Met for the \"evidence relied upon to justify the arrest\". Lord Mandelson was sacked as British ambassador to the US in September after it emerged he remained in close contact with billionaire Jeffrey Epstein after his conviction for paedophilia. Sir Keir Starmer has said the former minister lied to him as part of the vetting process. At the beginning of this month, the US Department of Justice released another tranche of Epstein emails, which revealed how close their relationship was. Lord Mandelson resigned from the Labour Party to avoid causing \"further embarrassment\", then stepped down from the House of Lords - but he remains a Lord in name as peerages can only be taken away through an Act of Parliament."
    },
    {
        "title": "Driver who crashed while gambling on mobile is jailed after pregnant woman suffered premature birth",
        "description": "A driver has been jailed after crashing into the back of a car while gambling on his mobile phone, and causing a pregnant woman to go into labour.",
        "url": "https://news.sky.com/story/driver-who-crashed-while-gambling-on-mobile-is-jailed-after-pregnant-woman-suffered-premature-birth-13512591",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-jack-bentley-derby-crown-court_7175884.png?20260226164423",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-26 16:32:00",
        "Headline": "Jack Bentley admitted driving into the back of a stationary vehicle on the A50 in Derbyshire in April 2025.",
        "Content": "A driver has been jailed after crashing into the back of a car while gambling on his mobile phone, and causing a pregnant woman to go into labour. Derby Crown Court heard Jack Bentley, 30, from Meadow Way, Derby, was seen veering into the grass verge of the A50 in Derbyshire, swerving between lanes and lane hogging on 6 April 2025. His Ford Focus then collided into the back of a Nissan X Trail, which was queuing in stationary traffic. A pregnant passenger in the Nissan suffered a fractured pelvis, was rushed to hospital and gave birth prematurely, leaving her baby in intensive care, the court was told. The Nissan's driver and two other children were also injured, while the family's pet dog had to undergo emergency surgery. Bentley admitted two counts of causing serious injury by dangerous driving and, on 11 February, was jailed for two years and four months. In a victim impact statement, the woman said she found the emergency caesarean \"very traumatic\" and \"missed out on so much in those early moments\" following the birth because her baby was in an incubator. \n                  Turkey butcher guilty of killing and cutting up girlfriend 15 years ago\n                 \n                  Derbyshire police force fined £60,000 after officers burned by petrol bombs during riot training\n                 \n                  Derby police evacuate around 200 homes as men arrested on suspicion of explosives offences\n                 She added: \"I remember being there watching when all the nurses and doctors rushed around because her lung had collapsed and I had to lay there scared for her. Hours later, the other lung also collapsed. \"She wasn't strong enough for the world yet. For my first pregnancy, this was a very traumatic experience and one no parent expects or wants to experience.\" Read more from Sky News:Soham murderer seriously injuredParents alerted over suicide searchesDrop in asylum seeker hotel figures Dashcam footage from another motorist captured the crash, as Bentley's Ford Focus continued moving at speed towards the stationary line of vehicles, then collided into the rear of the Nissan, causing debris to fly into the air and scatter across the road. After Bentley's arrest at the scene, analysis of his phone data showed he had been using his phone while driving, visiting online gambling sites as he travelled from Blackpool to Derby. PC Richard Morris, who led the investigation, said: \"This was an appalling display of driving by Bentley, who spent the majority of his journey distracted by being on his phone. \"From watching the dashcam footage, it was clear that had he been paying attention he would have seen the queue of traffic in front of him and been able to stop in time. \"I know that the physical, mental and emotional trauma from this incident continues to impact on this family.\" Bentley was also disqualified from driving for three years and two months."
    },
    {
        "title": "Woman who fell from window to flee Nottingham attacker warned by police 'he could have killed her'",
        "description": "A woman who broke her back falling from a window trying to flee Nottingham attacker Valdo Calocane was warned by police he could have killed her, an inquiry heard.",
        "url": "https://news.sky.com/story/woman-who-fell-from-window-to-flee-nottingham-attacker-warned-by-police-he-could-have-killed-her-13512589",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-calocane-nottingham_6768206.jpg?20241206113512",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-26 16:26:00",
        "Headline": "The woman said she was told by police Valdo Calocane could not be prosecuted because of his mental health problems.",
        "Content": "A woman who broke her back falling from a window trying to flee Nottingham attacker Valdo Calocane was warned by police he could have killed her, an inquiry heard. Three years before going on his killing spree in 2023, Calocane tried to get into the woman's flat while she was showering - forcing her to escape by leaping from the first-floor of her student accommodation. When police detained him, Calocane was taken to a mental health unit rather than charged with an offence by police, chair of the hearing Deborah Taylor was told. The woman said she was told by police Calocane could not be prosecuted because of his mental health problems and was instead taken to hospital. Calocane had also been arrested earlier in the day on suspicion of causing criminal damage to a different door in the same block of flats, but the incident was not given \"the attention it deserved\" by officers, the public inquiry heard on Thursday. Police body-worn camera footage of the first arrest could not be found, an officer told the hearing. Calocane killed University of Nottingham students Barnaby Webber and Grace O'Malley-Kumar, both 19, as well as 65-year-old caretaker Ian Coates, and attempted to kill three more people in the June 2023 attacks. He admitted manslaughter by diminished responsibility and attempted murder and was sentenced to an indefinite hospital order in January 2024. The inquiry heard more than three years before the attacks, on 24 May 2020, the young woman believed there was a group of thieves trying to break in when the triple-killer shook her door. The woman, who was left needing surgery after suffering a fractured spine, was visited by an officer after she was discharged from hospital who told her she had been \"brave\" when she escaped and told Calocane could have killed her or been violent if he got to her, the inquiry was told. Read more:Police failed to arrest killer on warrant months before attacksAttack survivor demands 'someone take the blame' 'I was very scared' The woman said she heard \"someone knocking repeatedly on the door\", which \"became louder and louder with kicks\" and when she asked who was there, Calocane replied, \"it's me, open, open\". \"I could see that the door was shaking, I could feel it coming off,\" she said. \"I thought as a matter of fact it was a group of thieves or someone who wanted to hurt me.\" She said she initially leant out of the first-floor window, which was around 10 to 12ft from the ground and was shouting for help, but no one was around because of the COVID lockdown. \"I tried to jump but I slipped and I fell on to the ground. I was scared, I was very scared,\" she said. \"I was shaking. I could not hold on to the window very well at all. I thought that someone wanted to hurt me, I did not know what to do. I was by myself.\" She told the inquiry Calocane then tried to come towards her after she fell, but police \"pinned him down\". Woman left in 'constant' pain The inquiry heard the woman, who had never seen Calocane before, had to undergo surgery on her spine and has been left in \"constant\" pain. Describing what the officer told her after her injury, she said: \"He also told me I had been brave, if I had not jumped out of the window many things could have happened to me. \"He could have killed me or could have been violent.\" Calocane 'could not be prosecuted' She added: \"They [the police] said they tried doing anything they could but because of his mental health problems, they mentioned schizophrenia, this person could not be jailed and he was therefore taken to a mental health hospital. \"I was very upset and angry. I thought this was not enough, the psychiatric hospital was not enough, but because there were no other possibilities I accepted it.\" The woman said: \"I thought 'what would happen to the person who tried to attack me - how would this end?'\" Calocane had been released from custody earlier that evening after damaging another door when mental health professionals \"considered\" research about the disproportionate detention of young black men when deciding to release him into the community. The inquiry heard after his first arrest that day, Calocane was talking about seeing \"devils and demons\" before he was released back to the same accommodation. Former judge Ms Taylor will hear evidence until June this year, then write a report and give recommendations in 2027."
    },
    {
        "title": "Assisted dying bill will almost certainly fail due to a lack of time",
        "description": "Controversial legislation to permit assisted dying in England and Wales is set to fail because of a lack of parliamentary time, Sky News can reveal.",
        "url": "https://news.sky.com/story/assisted-dying-bill-will-almost-certainly-fail-due-to-a-lack-of-time-13512476",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-assisted-dying-kim-leadbeater_7175417.jpg?20260226132827",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2026-02-26 12:25:00",
        "Headline": "The government says it will not give the bill any further debate time in the Lords, meaning the parliamentary session will end before it can pass.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Controversial legislation to permit assisted dying in England and Wales is set to fail because of a lack of parliamentary time, Sky News can reveal. The Labour chief whip in the Lords, Roy Kennedy, said this week that the government would not give the Terminally Ill Adults (End of Life) Bill more time before the May deadline, when all legislation must have passed or automatically falls. The team behind the bill also confirmed they now expected the legislation in its current form to fail. There are six remaining sitting days left before May, when the King's Speech happens, and the government is not repeating what it did in December by giving more time. Politics latest - follow live Advocates for the bill did not blame the government, which it said had been helpful to date, and instead aimed their fire on a minority of peers who have been asking thousands of questions about the details of the bill. Broadcaster and campaigner Esther Rantzen told Sky News: \"This is absolute blatant sabotage. This is a handful of peers putting down 1,200 amendments not to scrutinise the bill, which is their job, but to block it. \n                  Jersey votes to allow assisted dying\n                 \n                  'My mum wouldn't have chosen that end - she knew exactly what was going to happen'\n                 \n                  'Outrageous': Assisted dying critics attack 'unprecedented' plan to force through bill\n                 \"A few peers for their own reasons have decided that they're going to stop this going through parliament, and the only way to stop them would be to invoke the Parliament Act, which has happened before, or get rid of the House of Lords - they're clearly not fit for purpose.\" She said she was still hopeful the change would come, as there is a rising cry for reform all around the world. She paid tribute to Sir Keir Starmer, who favours a change in the law, and said he had done everything he promised her before the election. Frank Sutton, who has terminal cancer and wants to choose how she dies, told Sky News: \"I don't want to die without dignity, without it being my choice, without my family knowing that this is what I want.\" Dr Gordon McDonald, chief executive of Care Not Killing, which is opposed to assisted dying, told Sky News: \"This issue is very difficult, and it needs proper scrutiny - that's what the members of the House of Lords have been doing. \"It didn't get proper scrutiny in the House of Commons. It's right that parliaments look at these bills properly and give them due consideration, that's what the House of Lords is doing.\" Many members of the public and even MPs were unaware that the bill was likely to fail. Earlier this week, the Welsh Parliament approved a \"legislative consent order\", endorsing in theory the legislation that it expected to come out of Parliament. The debate will now focus on what happens after May, with proponents of a change in the law saying the public polling and the repeated backing of MPs means that this legislation should be given a second chance. However, the government is likely to continue keeping the issue at arms length, since there is no single cabinet position on the issue and members of the cabinet like Wes Streeting and Shabana Mahmood are implacably hostile to the change. This makes a change in the law much more tricky. Some MPs who backed the bill in its Commons stages have told Sky News the process was so torturous that they would not want a repeat of it. Supporters have suggested that you would not have to go through the entire process - avoiding committee stage if the same bill was resurrected - and the Commons stages could in theory be done in one day, and the Parliament Act then deployed to override the objections in the Lords. However, the more turbulent political context for the government, the bandwidth that even this would occupy in government, and the fact the reforms would not be complete before a general election, mean that this would be a significantly bigger challenge second time around."
    },
    {
        "title": "Instagram to notify parents if teens search for suicide content",
        "description": "Instagram will start notifying parents if their children repeatedly search for suicide and self-harm content.&#160;",
        "url": "https://news.sky.com/story/instagram-to-notify-parents-if-teens-search-for-suicide-content-13512502",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-instagram-meta_7175626.png?20260226132326",
        "type": "UK",
        "Author": "Mickey Carroll",
        "Date Published": "2026-02-26 13:16:00",
        "Headline": "The alerts will be sent through email, text, or WhatsApp as well as a notification on Instagram - depending on the parent's settings.",
        "Content": "\n          Science and technology reporter\n       Instagram will start notifying parents if their children repeatedly search for suicide and self-harm content.  However, a leading online safety charity criticised the update as \"flimsy\" and say it risks leaving parents \"panicked and ill-prepared\" for the difficult conversations that may follow. In the coming weeks, parents who have parental supervision set up on their children's Instagram accounts in the UK, US, Australia and Canada will start receiving the notifications. The messages will be sent if an underage user repeatedly searches for phrases promoting suicide or self-harm, phrases that suggest a teen wants to hurt themselves, and terms like \"suicide\" or \"self-harm\" in a short space of time. The alerts will be sent through email, text, or WhatsApp, as well as a notification on Instagram - if the parents are signed up to the platform's optional supervision setting. As well as an alert about what the under-18 has been searching for, parents will also be given the option to see \"expert resources\" to help them approach \"sensitive conversations with their teen\", according to Meta. Soon, alerts will also be sent if a youngster is talking to Meta AI about suicide or self-harm. \n                  Instagram use can be 'problematic' but not addictive, says app's chief\n                 \n                  Parents of Scottish sextortion victim who took his own life sue Instagram owner Meta\n                 \n                  There's one big problem with Australia's social media ban\n                 Search terms relating to suicide and self-harm should already be blocked on Instagram and guardrails exist within Meta AI to stop harmful discussions and instead signpost helpful organisations. However, the Molly Rose Foundation (MRF) says its research has shown suicide and self-harm content is still available on the app. Read more:Spain's battle against doomscrolling schoolchildrenWill 'tobacco trials' haunt tech giants?Instagram can be 'problematic', says app's chief \"This clumsy announcement is fraught with risk and we are concerned that forced disclosures could do more harm than good,\" said Andy Burrows, chief executive of the charity. \"Every parent would want to know if their child is struggling, but these flimsy notifications will leave parents panicked and ill-prepared to have the sensitive and difficult conversations that will follow. \"Our research shows Instagram's algorithm still actively recommends harmful depression, suicide and self-harm material to vulnerable young people and the onus should be on addressing these risks rather than making yet another cynically timed announcement that passes the buck to parents.\" Meta says it removes content that promotes suicide or self-harm, shows graphic imagery or depicts methods or materials associated with them and goes further for teens, hiding content that discusses these topics altogether. It also says it blocks many search terms related to suicide and self-harm, and directs anyone searching for this content to local organisations for support. Instagram's \"teen accounts\" for under 16s were started in 2024 and need a parent's permission to change settings, with an extra layer of monitoring that can be selected with the agreement of their child. As a default for these account, Instagram turns on many privacy settings for all under 18s and children aged 13 to 15 will only be able to adjust these features by adding a parent or guardian to their account. Meta is currently facing a significant lawsuit in the US, where it is being accused of creating addictive apps that harm young people's mental health. It denies the claims and Meta chief executive Mark Zuckerberg told the court last week the company's aim has always been \"to try to build useful services that people connect to\". Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Soham murderer Ian Huntley in serious condition after workshop prison attack, as assault suspect identified  ",
        "description": "Ian Huntley has suffered head injuries in an assault in prison this morning, with the suspect identified by police. ",
        "url": "https://news.sky.com/story/soham-murderer-ian-huntley-in-serious-condition-after-workshop-prison-attack-as-assault-suspect-identified-13512440",
        "image_url": "https://e3.365dm.com/21/03/1920x1080/skynews-ian-huntley-holly-wells_5304228.jpg?20210314081207",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-26 11:54:00",
        "Headline": "Huntley was convicted of the murders of 10-year-olds Holly Wells and Jessica Chapman in Soham, Cambridgeshire, in 2002.",
        "Content": "Ian Huntley has suffered head injuries in an assault in prison this morning, with the suspect identified by police.  The Soham murderer, 52, was taken to hospital after being found in a pool of blood following an alleged attack by an unknown inmate, Sky News understands. A spokesman for Durham Constabulary said: \"The 52-year-old prisoner who was injured during this morning's assault in the workshop at HMP Frankland remains in a serious condition in hospital following treatment for head injuries. \"Police forensic teams have examined the scene of the attack throughout the day to gather evidence. \"A suspect, a male prisoner in his mid-40s, has been identified by officers investigating the incident. He has not been arrested at this stage but remains in detention within the prison.\" A North East Ambulance Service spokesperson said: \"We received a call at 9.23am on Thursday 26 February 2026 to reports of an incident at HM Prison Frankland in County Durham. \"We dispatched two ambulance crews to the scene and requested support from the Great North Air Ambulance Service (GNAAS). One patient was transported to hospital by road.\" In a statement, a Prison Service spokesperson said: \"A prisoner is receiving treatment after an incident at HMP Frankland on Thursday morning. It would be inappropriate to comment further while police investigate.\" Read more from Sky News:Jersey votes to allow assisted dyingOcado to cut 1,000 jobs under restructuring plan Huntley was convicted of the murders of 10-year-olds Holly Wells and Jessica Chapman in Soham, Cambridgeshire, in 2002 and is serving a life sentence with a minimum of 40 years at HMP Frankland in County Durham. The latest incident is not the first time Huntley has been attacked at HMP Frankland. In 2011, an inmate who slashed Huntley's throat with a makeshift knife was jailed for life. Damien Fowkes was sentenced to a minimum of 20 years for the attempted murder of Huntley in March 2010 and the manslaughter of child killer Colin Hatch. Fowkes inflicted a wound seven inches long on the Soham murderer's neck and the court was told it was only \"good fortune\" that the weapon missed anything vital. The disappearance and murders of the two 10-year-old schoolgirls captured the attention of the nation in 2002. Huntley killed them in August of that year after they left a family barbecue to buy sweets, and then dumped their bodies in a ditch. He was their school caretaker and put himself forward as a volunteer to help search for them after they went missing - and was interviewed by reporters on camera. The efforts to locate the girls in the 13 days after they disappeared have been described as one of the most intense and extensive in British criminal history. Huntley was convicted of the murder of both girls in December 2003 and sentenced to two terms of life imprisonment. His girlfriend, Maxine Carr - the girls' teaching assistant - had knowingly provided Huntley with a false alibi. She received a three-and-a-half year prison sentence for conspiring with Huntley to pervert the course of justice."
    },
    {
        "title": "The UK's delicate deal to get the Bayeux Tapestry loaned from France - a diplomatic coup or cultural gamble?",
        "description": "When the Bayeux Tapestry goes on show at the British Museum later this year it will be the culmination of one of the most impressive cultural exchanges this century.",
        "url": "https://news.sky.com/story/the-uks-delicate-deal-to-get-the-bayeux-tapestry-loaned-from-france-a-diplomatic-coup-or-cultural-gamble-13512493",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-bayeux-tapestry-katie-spencer_7175641.jpg?20260226134557",
        "type": "UK",
        "Author": "Katie Spencer",
        "Date Published": "2026-02-26 13:08:00",
        "Headline": "Nearly a thousand years old, the Bayeux Tapestry is one of the earliest visual stories in Europe. Later this year, it will travel from France to the UK's British Museum for an exhibition - but not everyone is happy about the move.",
        "Content": "\n          Arts and entertainment correspondent\n       When the Bayeux Tapestry goes on show at the British Museum later this year it will be the culmination of one of the most impressive cultural exchanges this century. Nearly a thousand years old, the tapestry is one of the earliest visual stories in Europe. A medieval graphic novel, if you like, that's shaped how we remember 1066 and how William the Conqueror came from France to become King of England. And it is big, wider than a football field. The 11th-century masterpiece is being loaned from France and will feature in an exhibition at the British Museum from September. So forget about Taylor Swift or Oasis - insiders are anticipating a Glastonbury-esque fight to get hold of tickets. \"Next year we are expecting 7.5m visitors,\" George Osborne, chair of the British Museum, tells Sky News. \"That's more than the entire 270-odd year history of the British Museum.\" The state-to-state loan should, according to the museum's director Nicholas Cullinan, be viewed as an international event which \"shows that culture can bring people together\". But while it is without question a bit of a diplomatic coup, the decision to move the fragile Norman masterpiece in the first place is a contentious one. 'You don't play with this kind of masterpiece' From 2005 to 2010, Isabelle Attard was the director of the Bayeux Tapestry Museum in France. A former Green party deputy in the French National Assembly, she feels French President Emmanuel Macron's decision to loan the masterpiece is a \"joke\". \"I am not sure that everybody understands how fragile the tapestry is,\" she says. \"Emmanuel Macron [has] never cared about the advice and the opinion of the people who specialise in textile preservation. \"You just don't play with this kind of masterpiece because it's not replaceable. What surprised me is that curators in the British Museum can just see [the tapestry] like a normal item. It's not the case.\" Attard's sentiment is shared by renowned British artist David Hockney who, in an an op-ed for The Independent, said that \"some things are too precious to take a risk with\", and warned moving it could cause \"fibre contraction or expansion or colour fading\", all for \"the vanity of a museum\". The British Museum has repeatedly insisted it is experienced at moving precious artefacts internationally and that it isn't taking the fragility of the tapestry for granted. \"A museum's primary concern is to look after objects either in its care or on loan and we send around 3,000 objects every year,\" says Cullinan. \"We have incredible conservation staff to do this every day. \"Of course, the tapestry is supremely important. There's a degree of fragility, but the reality is much more fragile things travel all the time.\" Secret 'dummy runs' to test route For security reasons, the museum cannot say when the tapestry is being transported to London. We do know that it's being driven over on a lorry, going by road and rail, with secret \"dummy runs\" of the route taking place. And it has already been moved a short distance. When its official home in Bayeux closed for refurbishment last September, 80 people helped concertina it up, moving it first on to rails before it was covered with cotton wrapping and put into a storage box. While great care will be taken, not everyone is convinced that the move is worth the risk. More than 77,000 people have signed a French petition calling it a crime against their heritage. In Bayeux, while some locals were in favour of it at least going on show again somewhere, others told us they were worried. \"It's a disgrace... there's no reason to let them have it,\" one man from the town, called Joel, told us. \"We don't know what condition it'll be returned in.\" Julie, a younger cafe worker, says it feels \"frustrating\", and that \"when you read the specialists' studies, they mostly say it's not in a condition to travel right now\". Is the risk worth the reward? But Dr David Musgrove, author of The Story of the Bayeux Tapestry: Unravelling The Norman Conquest, says it is \"a question of risk and reward\". He concedes that the item is fragile, but says: \"The reward is that actually it gives it a long-term survival boost because it means everyone is going to be aware of it. It's giving it massive media attention.\" Chancellor Rachel Reeves has agreed to sign off on indemnity paperwork which effectively means British taxpayers will stump up anything up to £800m should anything go wrong with the move. As a former chancellor himself, Osborne says this is standard practice. \"I'm really grateful to the government... and Rachel Reeves for signing the indemnity on behalf of everyone,\" he says. \"It's the taxpayer who stands behind this, but that's not unusual.\" Lord Peter Ricketts, envoy for the Bayeux Tapestry loan, firmly believes the move is a cause for celebration. \"Rightly the French are very concerned to make sure that it comes over here and it goes back, and we've promised it will go back in the same condition it arrived,\" he says. \"I think after Brexit, Macron was looking for a way to really remind people that UK-French relations are important and they go deep into the culture of both countries.\" And... what about the Elgin Marbles? While the British Museum is understandably delighted to accept the loan on behalf of the UK, a handful of countries, such as Greece, will also be watching what's happening rather closely. Could such a loan pave the way for the Parthenon sculptures, also known as the Elgin Marbles, to return home to Greece? \"I'm engaged with the Greek government,\" Osborne says. \"I would love there to be, an exchange. It's hard to get everything right and hard to get everything aligned, but I'm really working hard to try and pull it off.\" The Bayeux Tapestry will open in early September, with general admission tickets on sale from 1 July."
    },
    {
        "title": "YouTuber accused of murdering pregnant girlfriend 'recorded livestream alibi four days earlier'",
        "description": "A YouTuber accused of murdering his pregnant girlfriend recorded the livestream he used as an alibi four days earlier, a court heard.",
        "url": "https://news.sky.com/story/youtuber-accused-of-murdering-pregnant-girlfriend-recorded-livestream-alibi-four-days-earlier-13512680",
        "image_url": "https://e3.365dm.com/23/01/1920x1080/skynews-natalie-mcnally-blevins_6016387.jpg?20230106165146",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-26 19:49:00",
        "Headline": "Stephen McCullagh claimed he was playing computer games while Natalie McNally was being stabbed, beaten and strangled at her home in County Armagh.",
        "Content": "A YouTuber accused of murdering his pregnant girlfriend recorded the livestream he used as an alibi four days earlier, a court heard. Stephen McCullagh appeared to be broadcasting himself live playing Grand Theft Auto and drinking Guinness in his house in County Antrim while Natalie McNally was being killed around 30 miles away in Lurgan, County Armagh. McCullagh, 36, has denied murdering his 32-year-old partner, who was 15 weeks pregnant with their son. But the prosecution argued the stream was pre-recorded and posted as if it was live on 18 December 2022, while McCullagh disguised himself and took a bus to Lurgan before walking to Ms McNally's house and attacking her. He later returned home by taxi, before going back to Ms McNally's house the next evening and calling 999, it was claimed. Earlier this week the trial heard Ms McNally was subjected to a prolonged assault, suffering stab wounds to the neck, strangulation and heavy blows to the head. Prosecutors allege her murder was \"planned, calculated and premeditated, one which he [McCullagh] hoped to get away with\". On Wednesday, the court was shown over an hour of footage from the supposed livestream, which showed McCullagh playing Grand Theft Auto and Robot Wars while drinking Guinness and Baileys, and making references to broadcasting live. During evidence heard the following day, digital forensic analyst Detective Constable Matthews said his examination of the defendant's computer \"provided extensive evidence indicating that the broadcast was pre-recorded and later streamed as a live event\". Read more from Sky News:Assisted dying bill almost certainly failing due to lack of timeWoman fled Nottingham attacker by jumping from window DC Matthews said probe of the computer indicated the six-hour broadcast had been recorded on 14 December and saved as a video file. He said it was then broadcast as live on McCullagh's YouTube account on 18 December. And DC Matthews explained the software showed no signs of user activity between 6pm and just after midnight on 19 December. The video file was then deleted in the early hours of 19 December and then removed from the computer's recycling bin. \"Activity relating to video recording was taking place on the 14th, the creation of the pre-recorded video file was completed on the 15th, in the early hours,\" he said. \"There was the creation of a social media advert between the 14th and 17th and a live stream of a pre-recorded video file was carried out between the 18th and 19th, and finally the deletion of the said file in the early hours of the 19th, 2022.\" The trial was also shown clips from CCTV and doorbell cameras on the evening of 18 December showing a person walking from the street to a bus stop where they paid cash to take a bus to Lurgan and then walked to Ms McNally's street. Later footage showed a figure wearing a different outfit and walking from Ms McNally's street into Lurgan, where they got into a taxi which was seen in another clip arriving on McCullagh's street. The trial continues."
    },
    {
        "title": "Child killer Ian Huntley will be vulnerable to another attack if he survives",
        "description": "Any prisoner convicted of a child sex crime is a target for other inmates.",
        "url": "https://news.sky.com/story/child-killer-ian-huntley-will-be-vulnerable-to-another-attack-if-he-survives-13512553",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-frankland-durham-prison_6637099.jpg?20260226175927",
        "type": "UK",
        "Author": "Martin Brunt",
        "Date Published": "2026-02-26 15:09:00",
        "Headline": "Huntley, who is serving a life sentence for the murders of 10-year-olds Holly Wells and Jessica Chapman, was seriously injured in an assault in prison on Thursday morning.",
        "Content": "\n          Crime commentator\n              @skymartinbrunt\n Any prisoner convicted of a child sex crime is a target for other inmates. The court may have delivered justice in a case such as Ian Huntley's, but for some fellow criminals, what's really needed is revenge - to make you suffer like you made your victims suffer. From his first day in inside, there was a price on Huntley's head - not a monetary one, but the promise of \"respect\" for anyone who attacked him. Read more: Soham murderer Ian Huntley seriously injured In the violent world of a top security jail, respect from your fellow cons is everything and there's nothing quite like hurting a prisoner considered \"the lowest of the low\". An infamous villain once described to me over lunch how he witnessed a planned prison knife attack on a child sex offender, a story he told years later with relish, laughter and no grim detail spared. Huntley would have been on Rule 43, held in the prison's unit for vulnerable inmates, mostly sex offenders, but police informants too. But it's impossible to fully protect everyone, especially in today's chaotic jail system with overcrowding and increased violence, alongside the regular departure of disillusioned older warders who are replaced with more inexperienced officers. Read more from Sky News:Jersey votes to allow assisted dyingOcado to cut 1,000 jobs under restructuring plan Mark Leech, editor of the Prisons Handbook, said: \"The upcoming young thugs in prison see people like Huntley as a way of gaining kudos, especially if they are already serving lengthy sentences.\" If Huntley recovers, he will always be vulnerable to another attack. Some prisoners have long memories and plenty of time to think."
    },
    {
        "title": "'I'm not the best father,' admits Volodymyr ​Zelenskyy as president says Ukraine hit by harshest winter for decades'",
        "description": "Ukraine's president has spoken of personal challenges, after several years of conflict with Ukraine, admitting \"I'm not the best father\" in a Sky News interview.",
        "url": "https://news.sky.com/story/im-not-the-best-father-admits-volodymyr-8203zelenskyy-as-president-says-ukraine-hit-by-harshest-winter-for-decades-13512689",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-ukraine-russia_7176138.jpg?20260226212023",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-26 20:26:00",
        "Headline": "The Ukrainian leader told Sky News that his presidential role and responsibilities had taken their toll on his family.",
        "Content": "Ukraine's president has spoken of personal challenges, after several years of conflict with Ukraine, admitting \"I'm not the best father\" in a Sky News interview. Speaking to international correspondent, Alex Rossi, Volodymyr ​Zelenskyy also praised the work of civilians to fix Ukraine's energy systems after repeated Russian attacks, amid an extremely harsh winter. On Thursday, he said Russia launched 420 drones ‌and 39 missiles, injuring dozens ‌of people and damaging buildings. Ukraine war latest: Moscow 'divides' coalition of the willing During the interview in Kyiv, Mr Zelenskyy said there were \"phenomenal people\" who were repairing power supplies amid a \"very difficult\" winter. \"I mean, this was the harshest winter for a couple of decades... minus 20... at night minus 30. \"But it doesn't matter, day or night, because if you don't have heating, it's difficult during the day, during the night... because minus 30 is so difficult, [a] big challenge for our people,\" he said. \n                  EU not doing enough to stop Russian shadow fleet, European Parliament president says\n                 \n                  European leaders came together in solidarity on Ukraine war fourth anniversary - but peace seems a long way off\n                 \n                  'Not a Palestinian in sight': Inside Gaza after the ceasefire \n                 Speaking in English, the president talked about the sacrifices made by civilians to keep the lights on. \"Also with civilians, who are really very helpful during this war... we had absolutely heroic teams who renovated electricity, energy system and also we had losses because they did it [repairs] under missile attacks,\" he said. Read more from Sky News:The hunt for Russia's shadow fleetUkrainian family denied UK asylumUkraine teens on life in a war zone But Mr Zelenskyy also accepted that his presidential role and responsibilities had taken their toll on his family. \"During the war, I'm not the best father... because I don't have too much time for my children. \"I'm the president of Ukraine, I don´t compare my job... because my choice... is duty. My choice is Ukraine. That's why I said I'm no good father during the war.\" Separately, Ukrainian and US officials met in Geneva on Thursday for talks on post-war reconstruction despite a deadlock in peace negotiations with Russia. Mr Zelenskyy confirmed the next ‌round of US-brokered ​peace negotiations will likely ​take place in Abu ​Dhabi ⁠in early ⁠March. Ukrainian ‌negotiator Rustem Umerov also said negotiators ​were working on finalising ⁠economic and security issues to \"make the ⁠next trilateral ​meeting involving the US and ​Russia as substantive as possible\"."
    },
    {
        "title": "The UK's delicate deal to get the Bayeux Tapestry loaned from France - a diplomatic coup or cultural gamble?",
        "description": "When the Bayeux Tapestry goes on show at the British Museum later this year it will be the culmination of one of the most impressive cultural exchanges this century.",
        "url": "https://news.sky.com/story/the-uks-delicate-deal-to-get-the-bayeux-tapestry-loaned-from-france-a-diplomatic-coup-or-cultural-gamble-13512493",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-bayeux-tapestry-katie-spencer_7175641.jpg?20260226134557",
        "type": "World",
        "Author": "Katie Spencer",
        "Date Published": "2026-02-26 13:08:00",
        "Headline": "Nearly a thousand years old, the Bayeux Tapestry is one of the earliest visual stories in Europe. Later this year, it will travel from France to the UK's British Museum for an exhibition - but not everyone is happy about the move.",
        "Content": "\n          Arts and entertainment correspondent\n       When the Bayeux Tapestry goes on show at the British Museum later this year it will be the culmination of one of the most impressive cultural exchanges this century. Nearly a thousand years old, the tapestry is one of the earliest visual stories in Europe. A medieval graphic novel, if you like, that's shaped how we remember 1066 and how William the Conqueror came from France to become King of England. And it is big, wider than a football field. The 11th-century masterpiece is being loaned from France and will feature in an exhibition at the British Museum from September. So forget about Taylor Swift or Oasis - insiders are anticipating a Glastonbury-esque fight to get hold of tickets. \"Next year we are expecting 7.5m visitors,\" George Osborne, chair of the British Museum, tells Sky News. \"That's more than the entire 270-odd year history of the British Museum.\" The state-to-state loan should, according to the museum's director Nicholas Cullinan, be viewed as an international event which \"shows that culture can bring people together\". But while it is without question a bit of a diplomatic coup, the decision to move the fragile Norman masterpiece in the first place is a contentious one. 'You don't play with this kind of masterpiece' From 2005 to 2010, Isabelle Attard was the director of the Bayeux Tapestry Museum in France. A former Green party deputy in the French National Assembly, she feels French President Emmanuel Macron's decision to loan the masterpiece is a \"joke\". \"I am not sure that everybody understands how fragile the tapestry is,\" she says. \"Emmanuel Macron [has] never cared about the advice and the opinion of the people who specialise in textile preservation. \"You just don't play with this kind of masterpiece because it's not replaceable. What surprised me is that curators in the British Museum can just see [the tapestry] like a normal item. It's not the case.\" Attard's sentiment is shared by renowned British artist David Hockney who, in an an op-ed for The Independent, said that \"some things are too precious to take a risk with\", and warned moving it could cause \"fibre contraction or expansion or colour fading\", all for \"the vanity of a museum\". The British Museum has repeatedly insisted it is experienced at moving precious artefacts internationally and that it isn't taking the fragility of the tapestry for granted. \"A museum's primary concern is to look after objects either in its care or on loan and we send around 3,000 objects every year,\" says Cullinan. \"We have incredible conservation staff to do this every day. \"Of course, the tapestry is supremely important. There's a degree of fragility, but the reality is much more fragile things travel all the time.\" Secret 'dummy runs' to test route For security reasons, the museum cannot say when the tapestry is being transported to London. We do know that it's being driven over on a lorry, going by road and rail, with secret \"dummy runs\" of the route taking place. And it has already been moved a short distance. When its official home in Bayeux closed for refurbishment last September, 80 people helped concertina it up, moving it first on to rails before it was covered with cotton wrapping and put into a storage box. While great care will be taken, not everyone is convinced that the move is worth the risk. More than 77,000 people have signed a French petition calling it a crime against their heritage. In Bayeux, while some locals were in favour of it at least going on show again somewhere, others told us they were worried. \"It's a disgrace... there's no reason to let them have it,\" one man from the town, called Joel, told us. \"We don't know what condition it'll be returned in.\" Julie, a younger cafe worker, says it feels \"frustrating\", and that \"when you read the specialists' studies, they mostly say it's not in a condition to travel right now\". Is the risk worth the reward? But Dr David Musgrove, author of The Story of the Bayeux Tapestry: Unravelling The Norman Conquest, says it is \"a question of risk and reward\". He concedes that the item is fragile, but says: \"The reward is that actually it gives it a long-term survival boost because it means everyone is going to be aware of it. It's giving it massive media attention.\" Chancellor Rachel Reeves has agreed to sign off on indemnity paperwork which effectively means British taxpayers will stump up anything up to £800m should anything go wrong with the move. As a former chancellor himself, Osborne says this is standard practice. \"I'm really grateful to the government... and Rachel Reeves for signing the indemnity on behalf of everyone,\" he says. \"It's the taxpayer who stands behind this, but that's not unusual.\" Lord Peter Ricketts, envoy for the Bayeux Tapestry loan, firmly believes the move is a cause for celebration. \"Rightly the French are very concerned to make sure that it comes over here and it goes back, and we've promised it will go back in the same condition it arrived,\" he says. \"I think after Brexit, Macron was looking for a way to really remind people that UK-French relations are important and they go deep into the culture of both countries.\" And... what about the Elgin Marbles? While the British Museum is understandably delighted to accept the loan on behalf of the UK, a handful of countries, such as Greece, will also be watching what's happening rather closely. Could such a loan pave the way for the Parthenon sculptures, also known as the Elgin Marbles, to return home to Greece? \"I'm engaged with the Greek government,\" Osborne says. \"I would love there to be, an exchange. It's hard to get everything right and hard to get everything aligned, but I'm really working hard to try and pull it off.\" The Bayeux Tapestry will open in early September, with general admission tickets on sale from 1 July."
    },
    {
        "title": "NASA reveals details of medical incident that led to historic evacuation from ISS",
        "description": "NASA has revealed details of an incident aboard the ISS that prompted the first medical evacuation in the space station's 25-year history.",
        "url": "https://news.sky.com/story/nasa-reveals-details-of-medical-incident-that-led-to-historic-evacuation-from-iss-13512419",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-mike-fincke-nasa-astronaut_7175587.jpg?20260226125311",
        "type": "World",
        "Author": "Mickey Carroll",
        "Date Published": "2026-02-26 11:16:00",
        "Headline": "\"Spaceflight is an incredible privilege and sometimes it reminds us just how human we are,\" said astronaut Mike Fincke.",
        "Content": "\n          Science and technology reporter\n       NASA has revealed details of an incident aboard the ISS that prompted the first medical evacuation in the space station's 25-year history. On 7 January, astronaut Mike Fincke \"experienced a medical event that required immediate attention from my incredible crewmates\", according to a statement by him, which NASA shared online. \"Thanks to their quick response and the guidance of our NASA flight surgeons, my status quickly stabilised\", wrote the astronaut. NASA decided the safest course of action was to bring him and the other three members of Crew-11 back from the International Space Station so Mr Fincke could have advanced medical imaging, that was not available on the ISS. \"[It was] not an emergency but a carefully coordinated plan,\" said Mr Fincke. The crew, which also included fellow NASA astronaut Zena Cardman, Japanese astronaut Kimiya Yui and Russian cosmonaut Oleg Platonov, splashed down on 15 January after spending five and a half months on the space station. As well as thanking his crew, NASA and SpaceX's team and his doctors, Mr Fincke said he is doing \"very well and continuing standard post-flight reconditioning\" at NASA's base in Houston. \n                  NASA astronauts were 'stranded' in space by life-threatening  mishap, report finds\n                 \n                  International Space Station astronauts back after first ever emergency return\n                 \n                  International Space Station astronauts begin evacuation due to 'serious medical condition'\n                 \"Spaceflight is an incredible privilege and sometimes it reminds us just how human we are,\" he said. After the crew returned to Earth in January, NASA administrator Jared Isaacman said it was a \"serious situation\" in orbit but that the crew member in question had been safe and stable ever since. Read more science and tech news:Sky News forms consortium to drive push for AI standardsMeet the children who want a social media ban The evacuation left only three crew members on board the space station - one American and two Russians - and prompted NASA to pause space walks and reduce research output. They were joined by four new astronauts in February and normal service has resumed."
    },
    {
        "title": "American jailed over suitcase murder deported from Bali",
        "description": "Indonesia has freed and deported an American man after he spent 11 years in jail for the premeditated murder of his then-girlfriend's mother, in a case known as the Bali \"suitcase murder\".",
        "url": "https://news.sky.com/story/american-jailed-over-suitcase-murder-deported-from-bali-13512350",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-heather-mack-tommy-schaefer_7175426.jpg?20260226095343",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-26 08:57:00",
        "Headline": "Tommy Schaefer spent 11 years in prison for the premeditated murder of his then-girlfriend's mother in Bali.",
        "Content": "Indonesia has freed and deported an American man after he spent 11 years in jail for the premeditated murder of his then-girlfriend's mother, in a case known as the Bali \"suitcase murder\". Tommy Schaefer was sentenced to 18 years in prison for the 2014 murder of Sheila von Wiese-Mack, the mother of Heather Mack, during a holiday on the island. The battered body of the Chicago socialite was found in a suitcase in the boot of a taxi at a luxury resort. The couple were trying to gain access to a $1.5m (£1.1m) trust fund, prosecutors have said. Mack, who was a few weeks pregnant at the time of the attack, told the court in 2015 her mother objected to her relationship with Schaefer. She covered her 62-year-old mother's mouth while Schaefer used a fruit bowl for the assault. Read more from Sky News:Cubans shot on speedboat during 'terrorist infiltration' attemptMeet the kids who want a social media ban Police in Bali arrested Mack, nearly 19 at the time, and the then-21-year-old Schaefer a day later. Schaefer was deported back to the US from Bali International Airport on Tuesday after serving his sentence and receiving a number of remissions for good behaviour, said Felucia Sengky Ratna, head of the Bali Regional Office of the directorate general of immigration. He was in custody and arrived in Illinois on Wednesday, a spokesperson for the US Marshals Service, which transports federal prisoners, confirmed. Schaefer was scheduled to make an initial court appearance in Chicago on Thursday morning on federal charges of conspiracy to kill someone in a foreign country, conspiracy to commit murder and tampering with a victim. Mack served seven years of a 10-year prison sentence in Bali for helping with the murder and was deported in October 2021. She was also sentenced to 26 years in prison in Chicago in January 2024, after she pleaded guilty to helping kill her mother and stuffing the body in a suitcase."
    },
    {
        "title": "Schengen rules will apply at Gibraltar border under post-Brexit deal",
        "description": "Gibraltar will remain British, but dual Gibraltarian-Spanish passport checks will be required for those arriving by air and sea, according to a new post-Brexit deal.",
        "url": "https://news.sky.com/story/schengen-rules-will-apply-at-gibraltar-border-under-post-brexit-deal-13512475",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-gibraltar-spain-uk_7175571.jpg?20260226123340",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-26 12:16:00",
        "Headline": "The deal will mean no routine passport checks at the Spain-Gibraltar border for the 15,000 people who cross it every day.",
        "Content": "Gibraltar will remain British, but dual Gibraltarian-Spanish passport checks will be required for those arriving by air and sea, according to a new post-Brexit deal. The UK, alongside the government of Gibraltar, has published a draft treaty with the EU that outlines the arrangements for a \"fluid border\" for people and goods. The deal will mean no routine passport checks at the Spain-Gibraltar border for the 15,000 people who cross it every day. Instead, checks will apply to those arriving by air, and if needed, at ports. Those arriving by air and sea will face dual border controls: one check from Gibraltarian officials and another by the Spanish on behalf of the EU. There will also be a tailored customs model to \"eliminate burdensome goods checks\", the UK government said. The draft agreement does not affect sovereignty, stating that nothing signed \"shall constitute the basis for any assertion or denial of sovereignty\" over the Rock, and protects UK autonomy of key military facilities. \n                  Sir Keir Starmer to accuse Reform UK and Greens of being 'soft on Russia' and 'weak on NATO'\n                 \n                  Nick Clegg on Brexit regret and what Britain does next | 10 Years of Brexit Pt 2    \n                 \n                  The vote that fractured politics | 10 Years of Brexit Pt 1\n                 Gibraltar's airport is run by the Ministry of Defence and hosts an RAF base. The overseas territory also has an important naval facility. Chief Minister of Gibraltar, Fabian Picardo, said the treaty protects the \"British way of life\" on the Rock, while \"unlocking new opportunities for growth\". The treaty, published in draft form on Thursday, still needs to be signed, ratified and implemented. In June 2025, the UK, EU, Spain and Gibraltar announced they had agreed on the core aspects of a future formal treaty between the EU and the UK in respect of Gibraltar. At the time, the then foreign secretary, David Lammy, confirmed that UK nationals who are not residents of Gibraltar would have their time in the territory counted as part of the time-limited allowance for short stays in the Schengen area. Citizens of countries outside the EU or Schengen area, including the UK, can only spend 90 days in the Schengen area in any 180-day period. Read more from Sky News:Jersey votes to allow assisted dyingKim Jong Un warns South Korea The EU sees the checks at arrival points into Gibraltar as necessary to ensure that anyone entering the British territory and then crossing into Spain is complying with rules on staying in the Schengen area. Shadow Foreign Office minister Wendy Morton said: \"This is a treaty of over a thousand pages with profound constitutional changes that fundamentally reshapes how Gibraltar's border, airport and legal framework will operate, yet Parliament has not seen a single page of it\". \"Any treaty that hands Spain new powers over entry, residency, infrastructure or enforcement must be examined line by line by parliament before it takes effect.\" Gibraltar was ceded to the UK by Spain under the Treaty of Utrecht in 1713 and the population has historically been heavily in favour of remaining a British overseas territory. The last time it voted on a proposal to share sovereignty with Spain, in 2002, almost 99% of Gibraltarians rejected the move. Talks on rules governing the border have been ongoing since Britain left the European Union in 2020."
    },
    {
        "title": "Danish PM calls snap election after surge in support over Greenland crisis ",
        "description": "Denmark's Prime Minister Mette Frederiksen has announced the country will hold an early election next month. ",
        "url": "https://news.sky.com/story/danish-pm-calls-snap-election-after-surge-in-support-over-greenland-crisis-13512506",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-mette-frederiksen-denmark_7175648.jpg?20260226134915",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-26 13:27:00",
        "Headline": "Mette Frederiksen has spent recent months rallying European leaders against Donald Trump's renewed interest in annexing the Arctic island. ",
        "Content": "Denmark's Prime Minister Mette Frederiksen has announced the country will hold an early election next month.  It comes as the country continues a standoff with the US over President Donald Trump's designs on Greenland, with Ms Frederiksen seeking to capitalise on a surge in support for her defiant stance. \"I have recommended to King Frederik that elections be held on March 24,\" Ms Frederiksen told the Danish parliament in Copenhagen on Thursday. The country was due to go to the polls no later than the end of October. The Folketing, or parliament, has 179 seats - 175 of which are allocated to lawmakers representing Denmark and two apiece to lawmakers from Greenland and the Faroe Islands, its two semi-autonomous territories. Ms Frederiksen, 48, has spent recent months discussing with European leaders ways to counter the US president's renewed interest in annexing the Arctic island. Opinion polls suggest this has provided a much-needed popularity boost for the Danish prime minister after public dissatisfaction over rising living costs and welfare pressures. \"This will be a decisive election, because it will be in the next four years that we as Danes and as Europeans will really have to stand on our own feet,\" Ms Frederiksen said. \"We need to define our relationship with the United States, and we must rearm to ensure peace on our continent.\" She added: \"As everyone knows, the conflict over Greenland is not over yet. The government will of course continue to look after Denmark's interests.\" Mr Trump's push to annex Greenland resulted in his short-lived threat last month to impose new tariffs on Denmark and several other European nations. Read more from Sky News:Jimmy Lai's fraud conviction quashed but he remains in jailNASA reveals details of incident that led to historic evacuationThe US, Denmark and Greenland subsequently held discussions on an Arctic security deal, though Ms Frederiksen and other Danish and Greenlandic officials have refused to negotiate on sovereignty. After the negotiations, the US leader said he had \"formed the framework of a future deal with respect to Greenland\". A general election must be held at least every four years in Denmark - but the prime minister can call one at any point. The last election of the NATO and European Union member country was held on 1 November, 2022, and resulted in a three-party coalition staggering the left-right divide.Ms Frederiksen, a centre-left Social Democrat, has held office since mid-2019. She currently heads a government with the Liberal Party of Defence Minister, Troels Lund Poulsen, and the centrist Moderate party of Foreign Minister Lars Lokke Rasmussen, a former PM. The Social Democrats suffered a significant setback in the 2025 municipal elections, losing the Copenhagen mayoralty for the first time in 87 years. However, although the party's support fell to 18% in polls in December, it has since rebounded to 22%, the highest of any party, as Ms Frederiksen's approval ratings were boosted by her handling of the Greenland dispute. Discussing the Greenland crisis earlier this month, Ms Frederiksen said she remains wary, though the situation has calmed. The standoff has further raised Ms Frederiksen's profile on the international stage, where she gained attention for her swift response to the COVID-19 pandemic and for bolstering European support for Ukraine."
    },
    {
        "title": "'Miracle' boy expected to be paralysed due to spina bifida able to walk after ground-breaking surgery in the womb",
        "description": "A three-year-old boy who would almost certainly have been born paralysed because of a severe spinal abnormality is able to walk after having ground-breaking stem cell surgery while still in the womb.",
        "url": "https://news.sky.com/story/miracle-boy-expected-to-be-paralysed-due-to-spina-bifida-able-to-walk-after-ground-breaking-surgery-in-the-womb-13512709",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-science-spina-bifida_7176175.jpg?20260226221137",
        "type": "World",
        "Author": "Thomas Moore",
        "Date Published": "2026-02-26 21:26:00",
        "Headline": "Tobi Maginnis, who had a condition in which the spinal cord fails to develop properly, underwent pioneering stem cell surgery as part of a world-first clinical trial. ",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n A three-year-old boy who would almost certainly have been born paralysed because of a severe spinal abnormality is able to walk after having ground-breaking stem cell surgery while still in the womb. An ultrasound scan 20 weeks into pregnancy showed Tobi Maginnis had spina bifida, a disabling condition in which the spinal cord fails to develop properly during pregnancy, leaving part of it growing outside the body. But he became just the second baby to have the abnormality repaired before he was born using rejuvenating stem cells taken from the placenta. His mum, Michelle Johnson, told Sky News that he was full of energy. \"He runs, he walks, he jumps, he is all over the place,\" she said. \"We expected Tobi to be wheelchair-bound. So to see where he is now, it's nothing short of a miracle.\" 'Blessed every day' Tobi was one of six babies in a world-first clinical trial led by the University of California Davis Children's Hospital. Around 25 weeks into pregnancy surgeons made a small opening in the mothers' abdomen and womb. They then placed a patch of stem cells over the babies' exposed spinal cord and then closed up the incision to allow the tissue to regenerate. All were born healthy, with no sign of side effects from treatment, according to results published in The Lancet medical journal. Tobi's dad, Jeff Maginnis, said: \"He's the second human to go through this surgery with stem cells. So there was a lot of uncertainty, a lot of unknowns. \"We're just blessed every day when we see how Tobi's reacted and been affected by this very successful surgery.\" Clinicians 'cautiously optimistic' Dr Diana Farmer, who led the study and has pioneered the technique, said the birth of the first baby, a girl called Robbie, had been a surprise. \"The most exciting thing was the baby came out kicking her legs and wiggling her toes, which really exceeded expectations,\" she said. \"We expected her, had she not had treatment, to not be able to have that kind of leg movement.\" Dr Farmer said she was \"cautiously optimistic\". \"We're just making sure that there are no unexpected things from having stem cells in the spinal cord of a foetus,\" she said. \"This is brand new.\" Read more from Sky News:Meet the kids who want a social media banUK connects first mobile network to Elon Musk's satellites Hope for the future Around 500 babies a year in the UK are born with myelomeningocele, the most severe form of spina bifida. Developing spinal tissue fails to seal up properly in early pregnancy leaving babies at risk of total paralysis of the legs and problems with bowel and bladder control. Surgery in the womb to correct the abnormality is increasingly common, but one study showed around half of babies are unable to walk independently. The US surgeons hope that using stem cells will improve success rates, helping with walking and potty training. They've started a larger clinical trial of 35 pregnant women. Their babies will be monitored over several years to confirm whether the stem cell technique is effective in the longer term."
    },
    {
        "title": "'There's no shame in having an addiction', Prince Harry tells recovered users on Jordan trip",
        "description": "Prince Harry has told a group of recovered addicts \"there's no shame in having an addiction\", as he urged them to go back to their communities and help others.",
        "url": "https://news.sky.com/story/theres-no-shame-in-having-an-addiction-prince-harry-tells-recovered-users-on-jordan-trip-13512367",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-duke-of-sussex-prince-harry_7175502.jpg?20260226111829",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-26 09:18:00",
        "Headline": "During the second day of their trip to Jordan, Harry and Meghan visited the National Centre for Rehabilitation, describing it as \"incredible\".",
        "Content": "Prince Harry has told a group of recovered addicts \"there's no shame in having an addiction\", as he urged them to go back to their communities and help others. During the second day of their Jordan trip, the Duke and Duchess of Sussex visited the country's National Centre for Rehabilitation of Addicts which they called \"incredible\". The couple listened to a group of men describing the emotional toll of substance abuse and the assistance they have received from the facility in the capital Amman. It has a holistic approach to helping patients, providing activities like a gym and yoga classes. The pair were invited to write messages of support. Harry's message on a sticky-note, left on a wall with others, read: \"It's ok to not be ok. Trust each other. \"Congratulations on your recovery. Now share your courage and experience.\" \n                  Prince Harry v Daily Mail: A huge day, but a surprisingly short time on the stand in his case against Associated Newspapers\n                 \n                  Prince Harry expected in court to give evidence in legal action against Daily Mail publisher\n                 \n                  Meghan contacts estranged father Thomas Markle in Philippines hospital\n                 Meghan wrote: \"Congratulations on your dedication to your care. Wishing you continued healing and happiness.\" The couple were with a World Health Organisation delegation, including its director-general Dr Tedros Adhanom Ghebreyesu, who invited the couple to Jordan. The Duke and Duchess of Sussex also visited the regional offices of the World Central Kitchen (WCK). While there, they heard about the organisation's huge logistical task of feeding a million Palestinians in Gaza. Harry and Meghan talked via a video call with a distribution leader at one of WCK's six field kitchens in the Palestinian territory, producing daily hot meals for around 60% of the population. Wadhah Hubaishi, the organisation's response director for the Middle East and North Africa, told the couple that ochre and rice was the meal for Thursday. He said: \"This is one of our most delicious meals for the Gaza people. Within two hours, we will start distributing the food.\" \"We need 20 trucks (of supplies) every day from Egypt, not enough trucks are coming in, that really affects us more than any other actor.\" Read more from Sky News:Epstein blamed 'Charles' on day Andrew lost UK trade envoy jobMet Police apologises to Commons Speaker over Lord Mandelson tip-off Mr Hubaishi said their mantra was \"food with smiles\" provided by Gazans for Gazans and highlighted the need for food by telling the couple the touching story of a boy who had never seen a banana. He explained how \"a three-year-old ate a banana and asked his father 'can I eat the peel'\"."
    },
    {
        "title": "At least 46 killed in Brazil's floods while thousands are displaced",
        "description": "At least 46 people have been killed in devastating floods which hit the southeastern Brazilian state of &#8204;Minas Gerais, while thousands have been displaced.",
        "url": "https://news.sky.com/story/at-least-46-killed-in-brazils-floods-while-thousands-are-displaced-13512360",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-brazil-uba_7175337.jpg?20260226080923",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-26 09:10:00",
        "Headline": "Juiz de Fora's city hall said in a statement on Wednesday that around 600 families living in endangered areas were about to be relocated to local schools improvised as shelters and that the city experienced double the rain expected for February.",
        "Content": "At least 46 people have been killed in devastating floods which hit the southeastern Brazilian state of ‌Minas Gerais, while thousands have been displaced. According to the state fire department, 21 people remain ‌missing while about 3,600 people have been displaced by flooding and landslides in the cities of Juiz de Fora and Uba. The two cities are about 110km (68 miles) apart and some 310 kilometers (192 miles) north of Rio de Janeiro. Juiz de Fora resident Ricardo Dutra lost his 11-year-old son, Bernardo Lopes Dutra - whose funeral was held on Wednesday after he was killed when the rain caused his house to collapse. Mr Dutra's daughter and wife are being treated in hospital. \"I'm trying to pick up the pieces,\" he ⁠said, as his city's streets were covered in mud and authorities feared more landslides. \"It's a tragedy that no one was expecting,\" Mr Dutra added as he described Bernardo as \"a boy with a big heart who, in his own way, touched everyone around him\". Mayor Margarida Salomão said at least 20 landslides had been reported since the torrential rain began Monday evening. Read more from Sky News:You're 'carpet-bombing the countryside', Labour told'Lovers' Arch' collapses into the sea on Valentine's Day The Rev. Ananias Simoes, the pastor at the church that Mr Dutra and his family regularly attended in the 560,000-strong city of Juiz de Fora, said the building has been turned into a temporary shelter. \"We're doing what we can, collecting food, water. We're in a war situation,\" Simoes said. Dario Tiberio, a 41-year-old truck driver, decided to leave his house along with his family for fear of collapse. He found refuge at the church, while he waits on authorities to say his home is risk-free. \"There's a danger that the mud and earth can come and bury us along with the debris. We have this feeling of insecurity,\" he said. Classes were suspended in both Juiz de Fora and the 107,000-strong Uba, their mayors said. Juiz de Fora's city hall said in a statement on Wednesday that around 600 families living in endangered areas were about to be relocated to local schools improvised as shelters and that the city experienced double the rain expected for February. Brazil's federal government has sped up relief and humanitarian aid to the region, sending health agents and national defence professionals, according to a statement. \"No matter how ⁠hard you try, at some point you feel powerless. You ​witness a situation like this - people trapped in the ​rubble - and there is nothing more you can do, ​your contribution has a limit,\" said Nalvan Luiz, a friend of Bernardo ⁠Dutra, at the funeral."
    },
    {
        "title": "Kim Jong Un warns North Korea could 'completely destroy' South if threatened",
        "description": "North Korea's leader has warned his country could \"initiate arbitrary action\" and \"completely destroy\" South Korea if its security was threatened. ",
        "url": "https://news.sky.com/story/kim-jong-un-warns-north-korea-could-completely-destroy-south-if-threatened-13512338",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-kim-jong-un-north-korea_7175427.jpg?20260226095345",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-26 08:01:00",
        "Headline": "South Korea's president responded to the comments by saying: \"A long-established sense of hostility and confrontation cannot be eliminated in an instant\". ",
        "Content": "North Korea's leader has warned his country could \"initiate arbitrary action\" and \"completely destroy\" South Korea if its security was threatened.  Kim Jong-un added that South Korea's \"complete collapse cannot be ruled out\". The remarks appear to be Mr Kim's most direct warnings against Seoul and were reported by state media KCNA on Thursday. Mr Kim revealed plans to expand the country's nuclear and intercontinental ballistic missiles arsenal, ruling out discussions with South Korea and labelling them as the \"most hostile enemy\". He added that the country would focus on expanding its nuclear arsenal, and prospects for bettering relations with the US rested entirely on Washington's attitude. The comments highlight the increasingly different approaches pursued by Seoul and Pyongyang towards each other. South Korean President Lee Jae Myung responded to Mr Kim's comments on Thursday by saying the value his country needs to espouse is peace. \n                  The teen who could lead North Korea: Who is Kim Ju Ae?\n                 \n                  Who is Kim Ju Ae? The teenager who could be North Korea's next leader\n                 \n                  Kim Jong Un set to name daughter as next leader of North Korea, spy agency says\n                 \"A long-established sense of hostility and confrontation cannot be eliminated in an instant. We ‌must build trust through continuous efforts,\" Mr Lee said. However, speaking at the country's week-long Ninth Congress of the ruling Workers' Party, Mr Kim vowed to develop stronger intercontinental ballistic missiles. The country also wants to develop attack systems that use artificial intelligence, unmanned drones, and weapons that can hit enemy satellites, KCNA said. The Congress is reported to have wrapped up with a military parade in the capital on Wednesday. The presence ‌of Mr Kim's daughter, known as Ju Ae, will fuel further speculation over whether she is being groomed as his successor. North Korea has assembled around 50 warheads and possesses enough fissile material to produce up to 40 more, the Stockholm International Peace Research Institute (SIPRI) estimated last year. Read more from Sky News:Cubans shot on speedboat during 'infiltration' attemptA city on the edge and braced for war The thinktank also believes that Pyongyang is accelerating the production of further fissile material. The North's leader has so far not accepted overtures by US President Donald Trump, whom he met with three times during the 79-year-old's first term, but he has left the door open for discussions with the US. \"If the US withdraws its policy of confrontation with North ‌Korea by respecting our country's current status... There is no reason why we cannot get along well with the US,\" he said, according to KCNA. Mr Trump plans to travel to China from 31 March to 2 April. South Korea's spy agency has speculated that the two leaders could meet around that time."
    },
    {
        "title": "UFOs and Pizzagate: Hillary Clinton attacks line of questioning over Epstein",
        "description": "Hillary Clinton has denied knowledge about Jeffrey Epstein's crimes and attacked US politicians for their line of questioning.",
        "url": "https://news.sky.com/story/ufos-and-pizzagate-hillary-clinton-attacks-line-of-questioning-over-epstein-13512717",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-hillary-clinton-chappaqua_7176249.jpg?20260226231908",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-26 21:44:00",
        "Headline": "At one point, her testimony in New York was suspended after a photograph of Ms Clinton at the committee was published on social media, violating the rules for depositions.",
        "Content": "Hillary Clinton has denied knowledge about Jeffrey Epstein's crimes and attacked US politicians for their line of questioning. The former US secretary of state was compelled to appear before the US House Oversight Committee in New York and asked about the disgraced financier. After the deposition, she told reporters: \"I thought it was very repetitive... they asked literally the same questions over and over again, which didn't seem to me to be very productive. \"I did not know Jeffrey Epstein. I never went to his island. I never went to his homes. I never went to his offices.\" She then added that the questions became more bizarre and \"off subject\". She said: \"It then got, at the end, quite unusual, because I started being asked about UFOs and a series of questions about Pizzagate, one of the most vile, bogus conspiracy theories that was propagated on the internet.\" Pizzagate was a conspiracy theory used to smear Clinton when she ran as the Democrat candidate at the 2016 US election. \n                  Trump hits back at Hillary Clinton over Epstein files 'cover-up' claim\n                 \n                  The Epstein Files - where's Donald Trump?\n                 \n                  Epstein files latest: Democrats rebuke Republicans for 'clown show' Clinton deposition after 'unacceptable' interruption\n                 The long-debunked theory alleged high-profile Democrats ran a paedophile abuse ring from a Washington pizza restaurant. At one point, Ms Clinton's testimony in New York was suspended after a photograph of her at the committee was published on social media, violating the rules for depositions. The image was posted on X by Benny Johnson, a right-wing political commentator and YouTuber, claiming it was provided to him by Republican representative Lauren Boebert. Sky News's US correspondent James Matthews said Ms Clinton made a \"blistering attack\" on the oversight committee, which she accused of \"partisan political theatre\" and \"alleging a cover-up to protect Donald Trump\". In an opening statement, which she shared on social media, she said the committee \"run by elected officials with a commitment to transparency would ensure the full release of all the files... if it wanted to get to the bottom of reports that DoJ [Department of Justice] withheld FBI interviews in which a survivor accuses President Trump of heinous crimes\". She claimed she was being compelled to testify \"to distract attention from President Trump's actions\". Democrats claim material from the Epstein files was withheld, including records of a woman who accused the president of sexually abusing her when she was a child. Mr Trump has consistently denied any wrongdoing. Ms Clinton said Epstein was a \"heinous individual\" but is \"far from alone\", calling the crimes he committed a \"global scourge with an unimaginable human toll\". Meanwhile, Democrats on the House Oversight Committee have been backing Ms Clinton, and criticised the leak of a photo from inside the deposition. Congresswoman Yassamin Ansari described the deposition as an \"incredibly unserious clown show\". Fellow Democrat Robert Garcia also spoke to call for President Trump to testify: \"We want to understand right now where the missing FBI files are. \"These are files that accuse the president of the United States about serious, serious accusations around sexual abuse,\" he said. Donald Trump has denied all accusations of wrongdoing, saying the Epstein files exonerated him. Read more from Sky News:Chance of US attack on Iran recedesZelenskyy: 'I'm not the best father'Afghanistan strikes Pakistan Hillary Clinton, and her husband Bill, agreed to appear before the committee after their offers of sworn statements were rejected by the House Oversight panel. Mr Clinton's testimony on Friday will be the first time a former president has been forced to testify before Congress. A close friend and former aide of the Clintons has told Sky News that Republicans have \"created a trap\" for Donald Trump by enforcing a summons on Bill Clinton to testify about Jeffrey Epstein. Sidney Blumenthal said the Democrats will surely respond by forcing Mr Trump to testify himself \"if and when\" they take control of Congress. He says cabinet members such as Howard Lutnick, commerce secretary, and Pam Bondi, attorney general, could also be called to testify, as could Melania Trump over her previous relationship with Epstein co-conspirator Ghislaine Maxwell."
    },
    {
        "title": "NASA reveals details of medical incident that led to historic evacuation from ISS",
        "description": "NASA has revealed details of an incident aboard the ISS that prompted the first medical evacuation in the space station's 25-year history.",
        "url": "https://news.sky.com/story/nasa-reveals-details-of-medical-incident-that-led-to-historic-evacuation-from-iss-13512419",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-mike-fincke-nasa-astronaut_7175587.jpg?20260226125311",
        "type": "US",
        "Author": "Mickey Carroll",
        "Date Published": "2026-02-26 11:16:00",
        "Headline": "\"Spaceflight is an incredible privilege and sometimes it reminds us just how human we are,\" said astronaut Mike Fincke.",
        "Content": "\n          Science and technology reporter\n       NASA has revealed details of an incident aboard the ISS that prompted the first medical evacuation in the space station's 25-year history. On 7 January, astronaut Mike Fincke \"experienced a medical event that required immediate attention from my incredible crewmates\", according to a statement by him, which NASA shared online. \"Thanks to their quick response and the guidance of our NASA flight surgeons, my status quickly stabilised\", wrote the astronaut. NASA decided the safest course of action was to bring him and the other three members of Crew-11 back from the International Space Station so Mr Fincke could have advanced medical imaging, that was not available on the ISS. \"[It was] not an emergency but a carefully coordinated plan,\" said Mr Fincke. The crew, which also included fellow NASA astronaut Zena Cardman, Japanese astronaut Kimiya Yui and Russian cosmonaut Oleg Platonov, splashed down on 15 January after spending five and a half months on the space station. As well as thanking his crew, NASA and SpaceX's team and his doctors, Mr Fincke said he is doing \"very well and continuing standard post-flight reconditioning\" at NASA's base in Houston. \n                  NASA astronauts were 'stranded' in space by life-threatening  mishap, report finds\n                 \n                  International Space Station astronauts back after first ever emergency return\n                 \n                  International Space Station astronauts begin evacuation due to 'serious medical condition'\n                 \"Spaceflight is an incredible privilege and sometimes it reminds us just how human we are,\" he said. After the crew returned to Earth in January, NASA administrator Jared Isaacman said it was a \"serious situation\" in orbit but that the crew member in question had been safe and stable ever since. Read more science and tech news:Sky News forms consortium to drive push for AI standardsMeet the children who want a social media ban The evacuation left only three crew members on board the space station - one American and two Russians - and prompted NASA to pause space walks and reduce research output. They were joined by four new astronauts in February and normal service has resumed."
    },
    {
        "title": "Ocado to cut 1,000 jobs under restructuring plan",
        "description": "Ocado is to cut around 1,000 jobs as part of a plan to slash costs and restructure its operations.",
        "url": "https://news.sky.com/story/ocado-to-cut-1000-jobs-under-restructuring-plan-13512335",
        "image_url": "https://e3.365dm.com/23/06/1920x1080/skynews-ocado-robots_6191259.jpg?20230618145404",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2026-02-26 07:56:00",
        "Headline": "Shares fall sharply, building on earlier losses, as investors continue to fret over growth prospects for the company's distribution centre model.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Ocado is to cut around 1,000 jobs as part of a plan to slash costs and restructure its operations. The company, which provides automated technology for distribution centres and runs its own UK online grocery business through a joint venture with Marks & Spencer, said two-thirds of the job losses would be in the UK. The majority of those affected have roles at its headquarters in Hatfield. Money latest: The kitchen towels offering the best value No one connected to the retail side of the business is under threat. Ocado chief executive Tim Steiner said of the shake-up: \"Regrettably, this means a significant number of roles will no longer be required. \"We are grateful to colleagues who are affected by these changes, and whose talent and hard work have made a lasting contribution to Ocado. \n                  Pizza Express announces move into chicken | Money blog\n                 \n                  Mark Kleinman blog | See the latest stories from Sky News' City editor\n                 \n                  EU not doing enough to stop Russian shadow fleet, European Parliament president says\n                 \"We will support those impacted through this process,\" he told investors. The company, which has 20,000 staff globally, said it was targeting savings of £150m through its wider plans that would also see spending cut on research and development following years of major investment. Its Ocado Solutions and Ocado Intelligent Automation divisions were to be merged, according to the statement. Ocado made the announcements after revealing annual results which showed a 59% jump in its core underlying profit measure to £178m. The improved group performance, which also extended to its bottom line, masks huge concerns among investors however over its business model. Shares fell by almost 11% in early trading on Thursday, building on a 27% loss over the past year. Much of that decline can be explained by both its North American partners deciding to close a total of four robotic customer fulfilment centres (CFCs) due to weak demand. Many retailers have been choosing to complete online orders via stores instead, according to analysts. Verushka Shetty, equity research analyst at Morningstar, said of its performance: \"Ocado had a decent consensus beat in its half-year 2025 results but subsequent announcements from Kroger and Sobeys about site closures have weakened investor confidence. \"Nevertheless, we still see long-term growth drivers, including Ocado ramping up its deployment of capital-light solutions and intelligent automation, as well as the shift away from exclusivity deals in the majority of markets, which previously limited the company to one client per market. \"However, our main concern is a negative flywheel effect, where shutdowns and slower CFC rollouts deter potential partners from signing on or existing partners from adding more CFCs.\""
    },
    {
        "title": "Sky News forms consortium to drive push for AI standards",
        "description": "Sky News has formed a consortium with other major news organisations to develop industry standards for AI's fair use of their material.",
        "url": "https://news.sky.com/story/sky-news-forms-consortium-to-drive-push-for-ai-standards-13512156",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-david-rhodes-chairman_7175470.jpg?20260226103252",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-02-26 11:00:00",
        "Headline": "A coalition of five major British outlets is warning that AI's use of news content without a common standard to enable fair use is \"weakening the economic model that supports journalism\", and urging others to join their new alliance.  ",
        "Content": "Sky News has formed a consortium with other major news organisations to develop industry standards for AI's fair use of their material. The founding members - the Financial Times, The Guardian, the Daily Telegraph, the BBC and Sky News - are calling on other media leaders to join in and develop shared protocols to \"protect original journalism\" and respond to a \"global challenge\". In an open letter released on Thursday, they write: \"Across the industry, our reporting, our archives, our original content, have become foundational training material for AI systems. \"This material has been scraped, copied and reused with no common standards to enable permission or payment, weakening the economic model that supports journalism.\" The alliance, called the Standards for Publisher Usage Rights coalition (SPUR), says that while the rise of AI brings opportunities for publishers and their audiences, it \"also raises urgent questions about fairness, consent, attribution, transparency and trust\". It adds: \"The lack of transparency about how AI answers are created risks eroding public trust in both the news and the technologies used to access it.\" The letter outlining SPUR's mission was signed by Sky News chairman David Rhodes; Telegraph Media Group chief executive Anna Jones; Financial Times chief executive Jon Slade; The Guardian chief executive Anna Bateson; and BBC director-general Tim Davie. \n                  Scotland considering criminalising creation of deepfake images in bid to protect women and girls\n                 \n                  AI bubble remains intact for now as Nvidia continues to defy expectations\n                 \n                  AI is developing so fast it is becoming hard to measure, experts say\n                 They add in the joint letter: \"Artificial Intelligence is fundamentally reshaping how content is created, distributed, discovered and monetised. \"We believe we need to come together to protect original journalism and secure the long-term sustainability of our industry.\" The move is seen as a response to widespread concerns over AI \"scraping\" of media sources without their permission. SPUR said its goals were to work with tech companies and policy-makers to build a framework to \"shape a market that rewards original reporting and supports responsible AI innovation\". SPUR said it would develop shared industry standards that allow \"original journalism to be used sustainably\", identify gaps in technical tools needed to \"protect intellectual property and support their creation\", and enable the transparent use of news content. Read more from Sky News:AI is developing so fast it is becoming hard to measure, experts sayPolice still using AI tool despite inaccurate evidence in fan ban The coalition will also reduce friction in licensing, ensure that high-value content can be accessed through \"rights cleared, accountable channels\", and evaluate existing industry infrastructure, including assessing where new approaches are needed. It also spelled out its ambitions to become a global coalition, acknowledging the widespread challenges posed by the AI innovation to news organisations all over the world. To learn more or to express interest in joining the coalition, contact info@spurcoalition.org An Open Letter to Our Fellow Leaders in Global Media From: Tim Davie, BBC Director-General; Jon Slade, CEO, Financial Times; Anna Bateson, CEO, The Guardian; David Rhodes, Executive Chairman, Sky News; Anna Jones, CEO, Telegraph Media Group We write to you at a pivotal moment for our industry. We invite you – global leaders across publishing, broadcasting, media and news – to join us as founding members of a new coalition: SPUR - the Standards for Publisher Usage Rights coalition. Artificial Intelligence is fundamentally reshaping how content is created, distributed, discovered and monetised. We believe we need to come together to protect original journalism and secure the long-term sustainability of our industry. AI brings opportunities for publishers and our audience. Our organisations are already at the forefront of using AI in responsible ways to benefit our audiences. But AI also raises urgent questions about fairness, consent, attribution, transparency and trust. Across the industry, our reporting, our archives, our original content, have become foundational training material for AI systems. This material has been scraped, copied and reused with no common standards to enable permission or payment, weakening the economic model that supports journalism. The lack of transparency about how AI answers are created risks eroding public trust in both the news and the technologies used to access it. SPUR's mission is clear: to establish shared technical standards and responsible licensing frameworks that ensure AI developers can access high quality, reliable journalism in legitimate, responsible and convenient ways, while guaranteeing that publishers retain practical control of their content and receive fair value when it is used. The coalition will:\n • Develop shared industry standards, creating responsible ways for original journalism to be used sustainably • Reduce friction in licensing and bridge the gap between publishers and AI developers • Identify gaps in the technical tools needed to protect intellectual property, and support their creation • Ensure high value content can be accessed through rights cleared, accountable channels  • Evaluate existing industry infrastructure and assess where new technologies or approaches are needed • Enable transparent, scalable use of journalistic content For more than two centuries, media organisations have invested in journalism and newsgathering that underpin informed, connected societies. Our work strengthens democracy, empowers citizens, and holds those in power to account. This contribution rests not only on our reach, but on the standards that sustain it: editorial accuracy, accountability and trust. Trust earned over decades. This is a global challenge, and SPUR's ambition is to be a global coalition. Working across the industry, we can build systems that respect original reporting, uphold public trust, and enable both journalism and AI to thrive. Together, we will work with tech companies to adopt responsible, rights-cleared pathways to journalistic content, and with policymakers to build a modern regulatory framework that protects publisher rights and sets clear expectations for responsible AI development. Our goal is to help shape a market that rewards original reporting and supports responsible AI innovation. We look forward to hearing from you.\n David Rhodes, Executive Chairman, Sky News Anna Jones, CEO, Telegraph Media Group Anna Bateson, CEO, The Guardian Tim Davie, BBC Director-General Jon Slade, CEO, Financial Times"
    },
    {
        "title": "Assisted dying bill will almost certainly fail due to a lack of time",
        "description": "Controversial legislation to permit assisted dying in England and Wales is set to fail because of a lack of parliamentary time, Sky News can reveal.",
        "url": "https://news.sky.com/story/assisted-dying-bill-will-almost-certainly-fail-due-to-a-lack-of-time-13512476",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-assisted-dying-kim-leadbeater_7175417.jpg?20260226132827",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2026-02-26 12:25:00",
        "Headline": "The government says it will not give the bill any further debate time in the Lords, meaning the parliamentary session will end before it can pass.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Controversial legislation to permit assisted dying in England and Wales is set to fail because of a lack of parliamentary time, Sky News can reveal. The Labour chief whip in the Lords, Roy Kennedy, said this week that the government would not give the Terminally Ill Adults (End of Life) Bill more time before the May deadline, when all legislation must have passed or automatically falls. The team behind the bill also confirmed they now expected the legislation in its current form to fail. There are six remaining sitting days left before May, when the King's Speech happens, and the government is not repeating what it did in December by giving more time. Politics latest - follow live Advocates for the bill did not blame the government, which it said had been helpful to date, and instead aimed their fire on a minority of peers who have been asking thousands of questions about the details of the bill. Broadcaster and campaigner Esther Rantzen told Sky News: \"This is absolute blatant sabotage. This is a handful of peers putting down 1,200 amendments not to scrutinise the bill, which is their job, but to block it. \n                  Jersey votes to allow assisted dying\n                 \n                  'My mum wouldn't have chosen that end - she knew exactly what was going to happen'\n                 \n                  'Outrageous': Assisted dying critics attack 'unprecedented' plan to force through bill\n                 \"A few peers for their own reasons have decided that they're going to stop this going through parliament, and the only way to stop them would be to invoke the Parliament Act, which has happened before, or get rid of the House of Lords - they're clearly not fit for purpose.\" She said she was still hopeful the change would come, as there is a rising cry for reform all around the world. She paid tribute to Sir Keir Starmer, who favours a change in the law, and said he had done everything he promised her before the election. Frank Sutton, who has terminal cancer and wants to choose how she dies, told Sky News: \"I don't want to die without dignity, without it being my choice, without my family knowing that this is what I want.\" Dr Gordon McDonald, chief executive of Care Not Killing, which is opposed to assisted dying, told Sky News: \"This issue is very difficult, and it needs proper scrutiny - that's what the members of the House of Lords have been doing. \"It didn't get proper scrutiny in the House of Commons. It's right that parliaments look at these bills properly and give them due consideration, that's what the House of Lords is doing.\" Many members of the public and even MPs were unaware that the bill was likely to fail. Earlier this week, the Welsh Parliament approved a \"legislative consent order\", endorsing in theory the legislation that it expected to come out of Parliament. The debate will now focus on what happens after May, with proponents of a change in the law saying the public polling and the repeated backing of MPs means that this legislation should be given a second chance. However, the government is likely to continue keeping the issue at arms length, since there is no single cabinet position on the issue and members of the cabinet like Wes Streeting and Shabana Mahmood are implacably hostile to the change. This makes a change in the law much more tricky. Some MPs who backed the bill in its Commons stages have told Sky News the process was so torturous that they would not want a repeat of it. Supporters have suggested that you would not have to go through the entire process - avoiding committee stage if the same bill was resurrected - and the Commons stages could in theory be done in one day, and the Parliament Act then deployed to override the objections in the Lords. However, the more turbulent political context for the government, the bandwidth that even this would occupy in government, and the fact the reforms would not be complete before a general election, mean that this would be a significantly bigger challenge second time around."
    },
    {
        "title": "Police apologise to second parliamentary Speaker in two days over Mandelson arrest leak",
        "description": "The Metropolitan Police has apologised to a second parliamentary Speaker in two days after he was incorrectly named as the person who passed on information about Lord Mandelson, which led to his arrest.",
        "url": "https://news.sky.com/story/police-apologise-to-second-parliamentary-speaker-in-two-days-over-mandelson-arrest-leak-13512540",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-peter-mandelson-arrest_7175616.jpg?20260226131900",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-26 14:33:00",
        "Headline": "The former British ambassador to the US was arrested on Monday on suspicion of misconduct in public office.",
        "Content": "The Metropolitan Police has apologised to a second parliamentary Speaker in two days after he was incorrectly named as the person who passed on information about Lord Mandelson, which led to his arrest. Michael Forsyth, the Lord Speaker of the House of Lords, was named in reports as having warned the police that Lord Mandelson was going to flee to the British Virgin Islands. It was actually Sir Lindsay Hoyle, the speaker of the House of Commons, who had. Lord Mandelson was arrested on Monday on suspicion of misconduct in public office, regarding his time as business secretary in Gordon Brown's cabinet in the 2000s. He went with police from his home in Camden, north London, at about 4.15pm on Monday to a police station, where he was questioned for eight hours before being released on bail just after 1am. Lord Mandelson was seen on Thursday for the first time since returning home from his arrest, appearing stony-faced as he left his house just after 1pm and returned at about 4pm. The former Labour peer denies any wrongdoing. \n                  Greens look to be in the lead in by-election - with Labour blame game already under way\n                 \n                  Assisted dying bill will almost certainly fail due to a lack of time\n                 \n                  Sky's deputy political editor explains why the Assisted Dying Bill is likely to fail\n                 It emerged on Tuesday that he was arrested because police had been told he was a flight risk. However, the wrong Speaker was named as the source of the claim. After Lord Forsyth was named, Sir Lindsay Hoyle, the House of Commons Speaker, told MPs on Wednesday morning it was actually he who had warned the police after he was passed the information while he was on holiday in the British Virgin Islands last week. The Met apologised to Sir Lindsay on Wednesday, saying it had \"inadvertently\" revealed information about why Lord Mandelson had been taken into custody. Read more:Mandelson's 'vile' Epstein emails make me 'angry' - foreign secretary'No proper vetting' of 'Trump whisperer' Mandelson Now, the force has apologised to Lord Forsyth as well. A spokesperson said on Thursday: \"The Met has also apologised to the Speaker of the House of Lords, following the inadvertent revealing of information into allegations of misconduct in public office.\" Lawyers for Lord Mandelson denied the \"baseless\" allegation that he was going to flee, and said he had already agreed to attend a voluntary interview in a fortnight's time. They have also asked the Met for the \"evidence relied upon to justify the arrest\". Lord Mandelson was sacked as British ambassador to the US in September after it emerged he remained in close contact with billionaire Jeffrey Epstein after his conviction for paedophilia. Sir Keir Starmer has said the former minister lied to him as part of the vetting process. At the beginning of this month, the US Department of Justice released another tranche of Epstein emails, which revealed how close their relationship was. Lord Mandelson resigned from the Labour Party to avoid causing \"further embarrassment\", then stepped down from the House of Lords - but he remains a Lord in name as peerages can only be taken away through an Act of Parliament."
    },
    {
        "title": "Number of asylum seekers housed in hotels drops - with a rise in small boat arrivals",
        "description": "The number of asylum seekers being housed in hotels across the UK has dropped to the lowest level for 18 months, new data shows.",
        "url": "https://news.sky.com/story/number-of-asylum-seekers-housed-in-hotels-drops-with-a-rise-in-small-boat-arrivals-13512376",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-bell-hotel-epping-protest_7005324.jpg?20250830034049",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-26 09:49:00",
        "Headline": "There has been a fall in asylum claims and in people applying for work, study or family visas, compared with 2024.",
        "Content": "The number of asylum seekers being housed in hotels across the UK has dropped to the lowest level for 18 months, new data shows. The number of asylum claims also fell by 4% in 2025, from 104,000 to 101,000 - despite a 13% rise in small boat arrivals. There are 30,657 people seeking asylum being housed in hotels, down from 56,018 under the previous Tory government at the end of September 2023, Home Office figures published on Thursday reveal. Politics latest - follow live However, the current number of asylum seekers in hotels remains slightly higher than when Labour took office, when there were 29,561 people in government-funded hotel housing. There were 20% fewer asylum seekers in hotels at the end of 2025 compared with the end of the previous year - the three months from September to December saw a 15% drop. The Home Office has said this is saving the taxpayer £620m a year in costs, with hotel housing costing around £5,377,991,249 in 202/24, and falling to £4,757,226,306 in 2024/25. \n                  Ukrainian family denied UK asylum told to block out bombs with headphones\n                 \n                  'It's a disaster in the making': Empathy but mostly concern in town set to house hundreds of asylum seekers \n                 \n                  Asylum hotel migrant evictions set to begin in the spring\n                 Labour has pledged to end the use of hotels to house asylum seekers completely by the end of the parliament, in 2029. Housing asylum seekers in hotels has proved controversial, with protests held outside some, such as the Bell Hotel in Epping, Essex. The number of people waiting for an initial decision on their asylum claim also nearly halved, falling from 124,802 as of 31 December 2024, to 64,426 the following year. The Home Office has said this significant drop is in part due to the use of AI tools, such as those able to summarise cases. Overall number of returns falls - but rise in enforced returns The total number of people returned from the UK fell marginally in 2025, from 57,912 in 2024, to 56,197 in 2025. But the number of enforced returns rose 20% on last year, and the highest since 2017, rising from 8,169 to 9,914. However, it should be noted that there were more enforced returns in each year between 2004 and 2017. The number of voluntary returns rose, from 26,589 to 28,004, the highest total since 2016. There were also more than 10,000 \"assisted returns\", up 49% on 2024. Assisted returns are a subset of voluntary returns in which the government effectively pays for somebody to leave. There were the highest number of assisted returns on records going back to 2004. Foreign national offenders made up 10% of all returns in 2025, with more than 5,600 removed. What about legal migration? There was a 13% drop in the number of study, work or family visas granted in 2025 compared with the previous year, with 757,000 of these issued, down from 874,000 in 2024. The number of study visas issued actually rose in 2025 by 2.4%, but the overall decrease is due to a 29% fall in work visas and a 22% decrease in family visas. The refusal rate for all visa applications was also the highest it has been since 2007, at 18%. The proportion of work visa applications has almost doubled in two years, rising to nearly 12% in 2025, up from around 6% in 2023. How has the government responded? Reacting to the figures, a Home Office spokesperson said: \"These statistics show real progress as we restore order and control to our borders. \"We have removed nearly 60,000 illegal migrants, numbers in asylum hotels are down, law enforcement action against people smugglers is at record levels, and we are bearing down on the asylum backlog. \"But we must go further. The number of people crossing the Channel is too high, and too many hotels remain in use. \"That is why the home secretary is introducing sweeping reforms to tackle the pull factors drawing illegal migrants to Britain, and we are ramping up removals of those with no right to be here.\""
    },
    {
        "title": "Scotland considering criminalising creation of deepfake images in bid to protect women and girls",
        "description": "A new law on the creation of deepfake intimate images is being considered by the Scottish government as part of a series of reforms aimed at tackling violence against women and girls.",
        "url": "https://news.sky.com/story/scotland-considering-criminalising-creation-of-deepfake-images-in-bid-to-protect-women-and-girls-13512435",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-angela-constance-justice-secretary_7175821.jpg?20260226155646",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2026-02-26 11:50:00",
        "Headline": "A Scottish government paper said it is \"behaviour often committed by men in abusive and manipulative ways\".",
        "Content": "\n          Scotland reporter\n              @Jenster13\n A new law on the creation of deepfake intimate images is being considered by the Scottish government as part of a series of reforms aimed at tackling violence against women and girls. While laws already exist covering the sharing of such images, public views are being sought on proposals for a new offence which would address issues around the use of artificial intelligence (AI) to create pictures without consent. The consultation is also seeking opinions in regards to criminalising digital tools that are designed solely to generate intimate images and videos. It is already an offence to disclose, or threaten to disclose, deepfake images if it is done either for the purpose of causing fear, alarm or distress to the person featured, or the perpetrator is reckless as to whether doing so would be likely to cause them fear, alarm or distress. The Scottish government paper said: \"It is behaviour often committed by men in abusive and manipulative ways to seek to control women and girls.\" It added: \"The criminal law needs to adapt to the new ways in which forms of misogynistic abuse target women and girls. \"Where technology advances, it should not be acceptable to use new tools to manipulate images to give an appearance of a person in an intimate state. \n                  Sky News forms consortium to drive push for AI standards\n                 \n                  AI bubble remains intact for now as Nvidia continues to defy expectations\n                 \n                  AI is developing so fast it is becoming hard to measure, experts say\n                 \"By focusing on the creation of such images rather than the disclosing or threats to disclose such images, this can help make clear how such behaviour is unacceptable, as well as helping to reduce demand for tools that can be used to create such images (which may then go on to be shared).\" In addition to this, ministers are also looking at making pregnancy an aggravating factor for domestic abuse cases, so that when a mother-to-be is the victim of a crime the courts would have to treat the case more seriously in sentencing. To tackle spiking crimes, where someone is given alcohol or drugs without their consent, views are being sought on the creation of a standalone offence, rather than dealing with such cases under the current common law offence of drugging. Read more from Sky News:Tech firms must take down abusive images in 48 hours Consideration is also being given to whether non-harassment orders could be imposed by the Crown Office and Procurator Fiscal Service (COPFS) as an alternative to prosecuting some cases in court. And while the Scottish government does not support the creation of a new standalone offence for non-fatal strangulation, it does ask if there should be better recording of criminal cases where it arises. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 The consultation will run until 19 June. Justice Secretary Angela Constance said: \"Violence against women and girls is abhorrent and we must ensure we are doing all we can to tackle it, whether it is established or emerging forms of harm. \"We have made significant progress already - including the introduction of the domestic abuse offence, improved training for those supporting victims and new powers to enforce protective orders in Scotland imposed elsewhere in the UK.\" Ms Constance said she is \"particularly keen\" to hear from those with direct experience of harm. She added: \"The responses will help to inform future action that is needed to achieve the outcome we all seek: stronger protections and actions which lead to lower levels of violence against women and girls and a safer Scotland.\""
    },
    {
        "title": "Defence secretary orders search for record of Epstein trafficking women through RAF bases",
        "description": "Defence Secretary John Healey has told officials to review military records to find any evidence of Jeffrey Epstein trafficking women into Britain through RAF bases.",
        "url": "https://news.sky.com/story/defence-secretary-orders-search-for-record-of-epstein-trafficking-women-through-raf-bases-13512708",
        "image_url": "https://e3.365dm.com/21/12/1920x1080/skynews-ghislaine-maxwell-i_5620997.jpg?20260217201432",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-26 21:13:00",
        "Headline": "The latest tranche of Epstein files revealed the paedophile used RAF bases to land his private jet.",
        "Content": "Defence Secretary John Healey has told officials to review military records to find any evidence of Jeffrey Epstein trafficking women into Britain through RAF bases. He has told them to leave \"no stone unturned\" as they search through more than 20 years of Ministry of Defence (MoD) documents to find evidence of the paedophile billionaire's private jet landing at bases. Private jets are allowed to land at military bases by prior arrangement, and for a fee, as long as they do not interfere with any operations. Mr Healey's order comes after Gordon Brown last week claimed the British state may have facilitated Epstein's crimes by allowing his plane to land at RAF bases, sometimes with unknown women onboard. The former prime minister noted one particular flight in December 2000, when Epstein's Gulfstream plane landed at a Norfolk airbase before he visited Sandringham with Andrew Mountbatten-Windsor. The former prince was arrested last week on suspicion of misconduct in public office after emails released by the US Department of Justice appeared to show he sent confidential information to Epstein from his time as a trade envoy. He has always denied wrongdoing. \n                  Mandelson arrested as Trump attacks Supreme Court \n                 \n                  Government to consider new law to remove Andrew Mountbatten-Windsor from royal line of succession\n                 \n                  Epstein files see to arrest of Andrew Mountbatten-Windsor\n                 Epstein files latest: Democrats call Clinton deposition 'clown show' An MoD spokesperson told Sky News: \"The defence secretary has ordered a review of all records that the department may hold relating to Epstein flights landing at RAF bases to ensure that any information which relates to Epstein's crimes is uncovered and provided to the relevant authorities. \"The MoD will support any civilian police investigations. \"Our thoughts are with all the victims of Epstein's vile crimes.\" Other emails from the latest tranche show Epstein flew into RAF Northolt in northwest London and RAF Marham in Norfolk at least four times between 2000 and 2019. Read more:Police apologise to second parliamentary Speaker over Mandelson arrest leakUkrainian family denied UK asylum told to block out bombs with headphones Further flights, including passenger manifests, could be unearthed in the military records search. It is understood officials will look through MoD emails to find any record of Epstein or his team booking RAF airfields. The US administration has released details of Epstein's plane, which will be used to search for any records. While RAF flight logs are deleted after three months, it is understood emails between MoD officials and private travellers are kept."
    },
    {
        "title": "'Miracle' boy expected to be paralysed due to spina bifida able to walk after ground-breaking surgery in the womb",
        "description": "A three-year-old boy who would almost certainly have been born paralysed because of a severe spinal abnormality is able to walk after having ground-breaking stem cell surgery while still in the womb.",
        "url": "https://news.sky.com/story/miracle-boy-expected-to-be-paralysed-due-to-spina-bifida-able-to-walk-after-ground-breaking-surgery-in-the-womb-13512709",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-science-spina-bifida_7176175.jpg?20260226221137",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2026-02-26 21:26:00",
        "Headline": "Tobi Maginnis, who had a condition in which the spinal cord fails to develop properly, underwent pioneering stem cell surgery as part of a world-first clinical trial. ",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n A three-year-old boy who would almost certainly have been born paralysed because of a severe spinal abnormality is able to walk after having ground-breaking stem cell surgery while still in the womb. An ultrasound scan 20 weeks into pregnancy showed Tobi Maginnis had spina bifida, a disabling condition in which the spinal cord fails to develop properly during pregnancy, leaving part of it growing outside the body. But he became just the second baby to have the abnormality repaired before he was born using rejuvenating stem cells taken from the placenta. His mum, Michelle Johnson, told Sky News that he was full of energy. \"He runs, he walks, he jumps, he is all over the place,\" she said. \"We expected Tobi to be wheelchair-bound. So to see where he is now, it's nothing short of a miracle.\" 'Blessed every day' Tobi was one of six babies in a world-first clinical trial led by the University of California Davis Children's Hospital. Around 25 weeks into pregnancy surgeons made a small opening in the mothers' abdomen and womb. They then placed a patch of stem cells over the babies' exposed spinal cord and then closed up the incision to allow the tissue to regenerate. All were born healthy, with no sign of side effects from treatment, according to results published in The Lancet medical journal. Tobi's dad, Jeff Maginnis, said: \"He's the second human to go through this surgery with stem cells. So there was a lot of uncertainty, a lot of unknowns. \"We're just blessed every day when we see how Tobi's reacted and been affected by this very successful surgery.\" Clinicians 'cautiously optimistic' Dr Diana Farmer, who led the study and has pioneered the technique, said the birth of the first baby, a girl called Robbie, had been a surprise. \"The most exciting thing was the baby came out kicking her legs and wiggling her toes, which really exceeded expectations,\" she said. \"We expected her, had she not had treatment, to not be able to have that kind of leg movement.\" Dr Farmer said she was \"cautiously optimistic\". \"We're just making sure that there are no unexpected things from having stem cells in the spinal cord of a foetus,\" she said. \"This is brand new.\" Read more from Sky News:Meet the kids who want a social media banUK connects first mobile network to Elon Musk's satellites Hope for the future Around 500 babies a year in the UK are born with myelomeningocele, the most severe form of spina bifida. Developing spinal tissue fails to seal up properly in early pregnancy leaving babies at risk of total paralysis of the legs and problems with bowel and bladder control. Surgery in the womb to correct the abnormality is increasingly common, but one study showed around half of babies are unable to walk independently. The US surgeons hope that using stem cells will improve success rates, helping with walking and potty training. They've started a larger clinical trial of 35 pregnant women. Their babies will be monitored over several years to confirm whether the stem cell technique is effective in the longer term."
    },
    {
        "title": "Sky News forms consortium to drive push for AI standards",
        "description": "Sky News has formed a consortium with other major news organisations to develop industry standards for AI's fair use of their material.",
        "url": "https://news.sky.com/story/sky-news-forms-consortium-to-drive-push-for-ai-standards-13512156",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-david-rhodes-chairman_7175470.jpg?20260226103252",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-26 11:00:00",
        "Headline": "A coalition of five major British outlets is warning that AI's use of news content without a common standard to enable fair use is \"weakening the economic model that supports journalism\", and urging others to join their new alliance.  ",
        "Content": "Sky News has formed a consortium with other major news organisations to develop industry standards for AI's fair use of their material. The founding members - the Financial Times, The Guardian, the Daily Telegraph, the BBC and Sky News - are calling on other media leaders to join in and develop shared protocols to \"protect original journalism\" and respond to a \"global challenge\". In an open letter released on Thursday, they write: \"Across the industry, our reporting, our archives, our original content, have become foundational training material for AI systems. \"This material has been scraped, copied and reused with no common standards to enable permission or payment, weakening the economic model that supports journalism.\" The alliance, called the Standards for Publisher Usage Rights coalition (SPUR), says that while the rise of AI brings opportunities for publishers and their audiences, it \"also raises urgent questions about fairness, consent, attribution, transparency and trust\". It adds: \"The lack of transparency about how AI answers are created risks eroding public trust in both the news and the technologies used to access it.\" The letter outlining SPUR's mission was signed by Sky News chairman David Rhodes; Telegraph Media Group chief executive Anna Jones; Financial Times chief executive Jon Slade; The Guardian chief executive Anna Bateson; and BBC director-general Tim Davie. \n                  Scotland considering criminalising creation of deepfake images in bid to protect women and girls\n                 \n                  AI bubble remains intact for now as Nvidia continues to defy expectations\n                 \n                  AI is developing so fast it is becoming hard to measure, experts say\n                 They add in the joint letter: \"Artificial Intelligence is fundamentally reshaping how content is created, distributed, discovered and monetised. \"We believe we need to come together to protect original journalism and secure the long-term sustainability of our industry.\" The move is seen as a response to widespread concerns over AI \"scraping\" of media sources without their permission. SPUR said its goals were to work with tech companies and policy-makers to build a framework to \"shape a market that rewards original reporting and supports responsible AI innovation\". SPUR said it would develop shared industry standards that allow \"original journalism to be used sustainably\", identify gaps in technical tools needed to \"protect intellectual property and support their creation\", and enable the transparent use of news content. Read more from Sky News:AI is developing so fast it is becoming hard to measure, experts sayPolice still using AI tool despite inaccurate evidence in fan ban The coalition will also reduce friction in licensing, ensure that high-value content can be accessed through \"rights cleared, accountable channels\", and evaluate existing industry infrastructure, including assessing where new approaches are needed. It also spelled out its ambitions to become a global coalition, acknowledging the widespread challenges posed by the AI innovation to news organisations all over the world. To learn more or to express interest in joining the coalition, contact info@spurcoalition.org An Open Letter to Our Fellow Leaders in Global Media From: Tim Davie, BBC Director-General; Jon Slade, CEO, Financial Times; Anna Bateson, CEO, The Guardian; David Rhodes, Executive Chairman, Sky News; Anna Jones, CEO, Telegraph Media Group We write to you at a pivotal moment for our industry. We invite you – global leaders across publishing, broadcasting, media and news – to join us as founding members of a new coalition: SPUR - the Standards for Publisher Usage Rights coalition. Artificial Intelligence is fundamentally reshaping how content is created, distributed, discovered and monetised. We believe we need to come together to protect original journalism and secure the long-term sustainability of our industry. AI brings opportunities for publishers and our audience. Our organisations are already at the forefront of using AI in responsible ways to benefit our audiences. But AI also raises urgent questions about fairness, consent, attribution, transparency and trust. Across the industry, our reporting, our archives, our original content, have become foundational training material for AI systems. This material has been scraped, copied and reused with no common standards to enable permission or payment, weakening the economic model that supports journalism. The lack of transparency about how AI answers are created risks eroding public trust in both the news and the technologies used to access it. SPUR's mission is clear: to establish shared technical standards and responsible licensing frameworks that ensure AI developers can access high quality, reliable journalism in legitimate, responsible and convenient ways, while guaranteeing that publishers retain practical control of their content and receive fair value when it is used. The coalition will:\n • Develop shared industry standards, creating responsible ways for original journalism to be used sustainably • Reduce friction in licensing and bridge the gap between publishers and AI developers • Identify gaps in the technical tools needed to protect intellectual property, and support their creation • Ensure high value content can be accessed through rights cleared, accountable channels  • Evaluate existing industry infrastructure and assess where new technologies or approaches are needed • Enable transparent, scalable use of journalistic content For more than two centuries, media organisations have invested in journalism and newsgathering that underpin informed, connected societies. Our work strengthens democracy, empowers citizens, and holds those in power to account. This contribution rests not only on our reach, but on the standards that sustain it: editorial accuracy, accountability and trust. Trust earned over decades. This is a global challenge, and SPUR's ambition is to be a global coalition. Working across the industry, we can build systems that respect original reporting, uphold public trust, and enable both journalism and AI to thrive. Together, we will work with tech companies to adopt responsible, rights-cleared pathways to journalistic content, and with policymakers to build a modern regulatory framework that protects publisher rights and sets clear expectations for responsible AI development. Our goal is to help shape a market that rewards original reporting and supports responsible AI innovation. We look forward to hearing from you.\n David Rhodes, Executive Chairman, Sky News Anna Jones, CEO, Telegraph Media Group Anna Bateson, CEO, The Guardian Tim Davie, BBC Director-General Jon Slade, CEO, Financial Times"
    },
    {
        "title": "NASA reveals details of medical incident that led to historic evacuation from ISS",
        "description": "NASA has revealed details of an incident aboard the ISS that prompted the first medical evacuation in the space station's 25-year history.",
        "url": "https://news.sky.com/story/nasa-reveals-details-of-medical-incident-that-led-to-historic-evacuation-from-iss-13512419",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-mike-fincke-nasa-astronaut_7175587.jpg?20260226125311",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2026-02-26 11:16:00",
        "Headline": "\"Spaceflight is an incredible privilege and sometimes it reminds us just how human we are,\" said astronaut Mike Fincke.",
        "Content": "\n          Science and technology reporter\n       NASA has revealed details of an incident aboard the ISS that prompted the first medical evacuation in the space station's 25-year history. On 7 January, astronaut Mike Fincke \"experienced a medical event that required immediate attention from my incredible crewmates\", according to a statement by him, which NASA shared online. \"Thanks to their quick response and the guidance of our NASA flight surgeons, my status quickly stabilised\", wrote the astronaut. NASA decided the safest course of action was to bring him and the other three members of Crew-11 back from the International Space Station so Mr Fincke could have advanced medical imaging, that was not available on the ISS. \"[It was] not an emergency but a carefully coordinated plan,\" said Mr Fincke. The crew, which also included fellow NASA astronaut Zena Cardman, Japanese astronaut Kimiya Yui and Russian cosmonaut Oleg Platonov, splashed down on 15 January after spending five and a half months on the space station. As well as thanking his crew, NASA and SpaceX's team and his doctors, Mr Fincke said he is doing \"very well and continuing standard post-flight reconditioning\" at NASA's base in Houston. \n                  NASA astronauts were 'stranded' in space by life-threatening  mishap, report finds\n                 \n                  International Space Station astronauts back after first ever emergency return\n                 \n                  International Space Station astronauts begin evacuation due to 'serious medical condition'\n                 \"Spaceflight is an incredible privilege and sometimes it reminds us just how human we are,\" he said. After the crew returned to Earth in January, NASA administrator Jared Isaacman said it was a \"serious situation\" in orbit but that the crew member in question had been safe and stable ever since. Read more science and tech news:Sky News forms consortium to drive push for AI standardsMeet the children who want a social media ban The evacuation left only three crew members on board the space station - one American and two Russians - and prompted NASA to pause space walks and reduce research output. They were joined by four new astronauts in February and normal service has resumed."
    },
    {
        "title": "Instagram to notify parents if teens search for suicide content",
        "description": "Instagram will start notifying parents if their children repeatedly search for suicide and self-harm content.&#160;",
        "url": "https://news.sky.com/story/instagram-to-notify-parents-if-teens-search-for-suicide-content-13512502",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-instagram-meta_7175626.png?20260226132326",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2026-02-26 13:16:00",
        "Headline": "The alerts will be sent through email, text, or WhatsApp as well as a notification on Instagram - depending on the parent's settings.",
        "Content": "\n          Science and technology reporter\n       Instagram will start notifying parents if their children repeatedly search for suicide and self-harm content.  However, a leading online safety charity criticised the update as \"flimsy\" and say it risks leaving parents \"panicked and ill-prepared\" for the difficult conversations that may follow. In the coming weeks, parents who have parental supervision set up on their children's Instagram accounts in the UK, US, Australia and Canada will start receiving the notifications. The messages will be sent if an underage user repeatedly searches for phrases promoting suicide or self-harm, phrases that suggest a teen wants to hurt themselves, and terms like \"suicide\" or \"self-harm\" in a short space of time. The alerts will be sent through email, text, or WhatsApp, as well as a notification on Instagram - if the parents are signed up to the platform's optional supervision setting. As well as an alert about what the under-18 has been searching for, parents will also be given the option to see \"expert resources\" to help them approach \"sensitive conversations with their teen\", according to Meta. Soon, alerts will also be sent if a youngster is talking to Meta AI about suicide or self-harm. \n                  Instagram use can be 'problematic' but not addictive, says app's chief\n                 \n                  Parents of Scottish sextortion victim who took his own life sue Instagram owner Meta\n                 \n                  There's one big problem with Australia's social media ban\n                 Search terms relating to suicide and self-harm should already be blocked on Instagram and guardrails exist within Meta AI to stop harmful discussions and instead signpost helpful organisations. However, the Molly Rose Foundation (MRF) says its research has shown suicide and self-harm content is still available on the app. Read more:Spain's battle against doomscrolling schoolchildrenWill 'tobacco trials' haunt tech giants?Instagram can be 'problematic', says app's chief \"This clumsy announcement is fraught with risk and we are concerned that forced disclosures could do more harm than good,\" said Andy Burrows, chief executive of the charity. \"Every parent would want to know if their child is struggling, but these flimsy notifications will leave parents panicked and ill-prepared to have the sensitive and difficult conversations that will follow. \"Our research shows Instagram's algorithm still actively recommends harmful depression, suicide and self-harm material to vulnerable young people and the onus should be on addressing these risks rather than making yet another cynically timed announcement that passes the buck to parents.\" Meta says it removes content that promotes suicide or self-harm, shows graphic imagery or depicts methods or materials associated with them and goes further for teens, hiding content that discusses these topics altogether. It also says it blocks many search terms related to suicide and self-harm, and directs anyone searching for this content to local organisations for support. Instagram's \"teen accounts\" for under 16s were started in 2024 and need a parent's permission to change settings, with an extra layer of monitoring that can be selected with the agreement of their child. As a default for these account, Instagram turns on many privacy settings for all under 18s and children aged 13 to 15 will only be able to adjust these features by adding a parent or guardian to their account. Meta is currently facing a significant lawsuit in the US, where it is being accused of creating addictive apps that harm young people's mental health. It denies the claims and Meta chief executive Mark Zuckerberg told the court last week the company's aim has always been \"to try to build useful services that people connect to\". Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "UK connects first mobile network to Elon Musk's Starlink satellites",
        "description": "O2 has become the first mobile network in the UK to switch on user access to satellites, meaning that people living in rural areas with no signal may now be able to connect to mobile data.",
        "url": "https://news.sky.com/story/uk-connects-first-mobile-network-to-elon-musks-starlink-satellites-13512387",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-starlink-spacex_7175453.jpg?20260226102310",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2026-02-26 09:49:00",
        "Headline": "When traditional services like 4G aren't available, customers on the network will now automatically connect to Elon Musk's Starlink satellites.",
        "Content": "\n          Science and technology reporter\n       O2 has become the first mobile network in the UK to switch on user access to satellites, meaning that people living in rural areas with no signal may now be able to connect to mobile data. The new connection should bring coverage to an area around two-thirds of the size of Wales, according to O2. When traditional services like 4G aren't available, customers on the network will now automatically connect to Elon Musk's Starlink satellites. Starlink is a network of satellites in low-earth orbit that are designed to offer an alternative to traditional data coverage. However, one consumer tech expert told Sky News that it would be \"a while\" before O2 customers felt the benefit of the new service. \"Reliable signal is the lifeblood of any mobile network, yet our latest survey found that many customers experience inconsistent coverage with O2, awarding it just two stars out of five for connectivity,\" said Lisa Barber, Which? tech editor. \"Given this poor rating, improving network reliability is rightly a priority. However, it'll be a while before the benefits of O2's new Starlink service will be widely felt by consumers, with the service only available to a limited pool of customers at launch. \n                  'Tipping point' reached in creation of brain chips to help 'unlock' minds of people with paralysis\n                 \n                  French investigators raid Paris offices of Elon Musk's X\n                 \n                  Elon Musk's SpaceX buys Elon Musk's xAI\n                 \"For now, compatibility is restricted to selected Samsung Galaxy devices, meaning many customers will have to wait. Those hoping it will solve their coverage issues may also be disappointed to learn that in most cases, O2 Satellite will come at an additional monthly cost - news that may be hard to swallow on top of upcoming April price hikes.\" According to Ofcom's latest Connected Nations report, around 12% of the UK's landmass doesn't have access to a \"good\" outdoor data connection. Baroness Lloyd, minister for the digital economy, said it is a \"major achievement\" for the UK and demonstrates leadership in next-generation connectivity. \"Being the first in Europe to launch direct-to-device satellite data services puts the UK firmly at the forefront of mobile innovation.\" Customers on O2's monthly package will have to pay an additional £3 a month for the service and at the moment, only the Samsung Galaxy S25, Samsung Galaxy S25+, Samsung Galaxy S25 Ultra and Samsung Galaxy S25 Edge are compatible. Read more from Sky News:Elon Musk's race for spaceInternet and phone connections cut in Iran amid protests A limited number of apps will work on the satellite connection, including Facebook Messenger, Google Maps, WhatsApp and Elon Musk's X. Lutz Schuler, chief executive of Virgin Media O2, called it a \"defining moment\". \"By launching O2 Satellite, we've become the first operator in Europe to launch a space-based mobile data service.\" Earlier this month, during a debate in the Commons, the MP for North Shropshire, Helen Morgan, described the \"frustrations\" of living in a rural community with little access to data. She described her constituents' experiences, saying \"elderly residents in sheltered accommodation are forced into digital isolation, out of contact with their families\". \"Others have forked out for the privilege of playing provider bingo.\""
    },
    {
        "title": "UK's first deep geothermal electricity plant switches on",
        "description": "The UK's first deep geothermal plant that produces power from heat miles underground and lithium for batteries is being switched on in Cornwall. ",
        "url": "https://news.sky.com/story/uks-first-deep-geothermal-electricity-plant-switches-on-13512396",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-geothermal-engineering_7175544.jpg?20260226120026",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-26 10:32:00",
        "Headline": "The plan to generate deep geothermal electricity in Cornwall had been years in the making, but the discovery that the water was rich in lithium - a key component to make car batteries - was \"just lucky\".",
        "Content": "The UK's first deep geothermal plant that produces power from heat miles underground and lithium for batteries is being switched on in Cornwall.  Geothermal Engineering Ltd's (GEL) £50m United Downs site will deliver renewable electricity around the clock, generated from the country's deepest well ever drilled, at more than three miles (5km) below the surface. The site will draw up water at extremely high temperatures of more than 190C to drive turbines that will generate power for 10,000 homes. The water contains a high concentration of lithium, which will be extracted to produce zero-carbon lithium carbonate, which can be used in the production of electric car batteries. GEL said it will produce 100 tonnes of lithium carbonate annually starting from this year - enough to make 2,500 car batteries. The company said on its website: \"Geothermal energy is a form of renewable energy derived from the Earth's natural heat; the term 'geothermal' literally meaning 'heat from the Earth'. \"In Cornwall, natural fractures or faults in the rock, known locally as crosscourses, act as reservoirs for hot water within the granite. The naturally high temperatures found in the granite are ideal for geothermal energy production.\" \n                  Yellow weather warning for parts of England already hit by severe rain\n                 \n                  Teenager arrested on suspicion of murder after missing man found dead in Plymouth\n                 \n                  Man dies after tree falls on to caravan during Storm Goretti\n                 Ryan Law, GEL's chief executive and founder, said there were plans to expand the site and develop two other geothermal energy projects in Cornwall, with the potential to produce enough lithium for 250,000 cars a year. The first site will produce three megawatts of power, with the three projects generating up to 10 megawatts of power, GEL said. Octopus Energy has signed a long-term deal to purchase at least three megawatts of electricity, powering 10,000 homes. Dr Law said there was potential to expand geothermal energy across the UK to generate large amounts of renewable power. \"We're effectively tapping into a massive nuclear power station that someone's already built,\" he said. \"The resource is gigantic,\" he added. Dr Law said while the plan to produce deep geothermal electricity in Cornwall had been years in development, the company had not planned to produce lithium, it was \"just lucky\". \"When we tested the water in these very deep wells, we found it is full of lithium,\" he said. \"It's a very high concentration of lithium and it's a very clean fluid, so it's a natural thing to do as a by-product from the power.\" Read more from Sky News:Energy price cap to fall in AprilTemperatures to drop after hottest day of year Dr Law said the plant generates power to process the lithium, while the electricity generation process also cools the temperature of the liquid down to a level to be able to extract the mineral. He said the production of critical minerals needed to be scaled up in Europe, to reduce reliance on imports from other countries, such as China. Energy minister Alan Whitehead said: \"The UK's first ever geothermal power is a ground-breaking moment for UK energy innovation, powering thousands of homes with clean, homegrown power.\""
    },
    {
        "title": "UK weather: Temperatures to drop after hottest day of year - but 'explosion of colour' to come",
        "description": "The UK could be set for an \"explosion of colour\" as warmer conditions bring flowers rapidly into bloom over the next two weeks - but not before temperatures drop following the hottest day of the year so far.",
        "url": "https://news.sky.com/story/uk-weather-explosion-of-spring-colour-to-come-despite-temperatures-dropping-after-hottest-day-of-the-year-so-far-13512292",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-daffodils-warm-weather_7174544.jpg?20260225100711",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-26 01:37:00",
        "Headline": "Temperatures at Kew Gardens in London reached 18.6C on Wednesday afternoon, making it the hottest February day since 2019. ",
        "Content": "The UK could be set for an \"explosion of colour\" as warmer conditions bring flowers rapidly into bloom over the next two weeks - but not before temperatures drop following the hottest day of the year so far. Temperatures at Kew Gardens in London reached 18.6C on Wednesday - the hottest February day since 2019 - with parts of Kent and Suffolk topping 18C. Some areas experienced higher temperatures than in Spain and Malta - a pleasant change for many after an incredibly wet start to the year. However, Sky News meteorologist Dr Christopher England expects it to \"turn cooler\" from Thursday, due to \"a strengthening and increasingly westerly wind\" that could bring cloud and rain \"to most\". Dr England noted that \"temperatures will remain above average for most\". But forecasts of mild weather, some sunshine and double-figure daytime temperatures over the next fortnight could lead to colourful spring displays, according to the Royal Horticultural Society (RHS). Tim Upson, RHS director of gardens and horticulture, said plants such as daffodils, camellias, cyclamen and hyacinths were coming into flower at the charity's sites due to the warm weather. Mr Upson predicted there was likely to be a \"welcome explosion of colour and new life over the next two weeks\". Read more from Sky News:Epstein blamed 'Charles' after Andrew lost jobPolice apologises to Speaker over Mandelson It comes after figures from the UK Centre for Ecology and Hydrology revealed Northern Ireland and parts of the southwest of England had their wettest January on record. The Environment Agency (EA) has also warned of a risk of so-called groundwater flooding - an \"invisible threat\" caused by water rising up through the ground following a prolonged period of heavy rainfall - that could persist for months."
    },
    {
        "title": "The UK's delicate deal to get the Bayeux Tapestry loaned from France - a diplomatic coup or cultural gamble?",
        "description": "When the Bayeux Tapestry goes on show at the British Museum later this year it will be the culmination of one of the most impressive cultural exchanges this century.",
        "url": "https://news.sky.com/story/the-uks-delicate-deal-to-get-the-bayeux-tapestry-loaned-from-france-a-diplomatic-coup-or-cultural-gamble-13512493",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-bayeux-tapestry-katie-spencer_7175641.jpg?20260226134557",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2026-02-26 13:08:00",
        "Headline": "Nearly a thousand years old, the Bayeux Tapestry is one of the earliest visual stories in Europe. Later this year, it will travel from France to the UK's British Museum for an exhibition - but not everyone is happy about the move.",
        "Content": "\n          Arts and entertainment correspondent\n       When the Bayeux Tapestry goes on show at the British Museum later this year it will be the culmination of one of the most impressive cultural exchanges this century. Nearly a thousand years old, the tapestry is one of the earliest visual stories in Europe. A medieval graphic novel, if you like, that's shaped how we remember 1066 and how William the Conqueror came from France to become King of England. And it is big, wider than a football field. The 11th-century masterpiece is being loaned from France and will feature in an exhibition at the British Museum from September. So forget about Taylor Swift or Oasis - insiders are anticipating a Glastonbury-esque fight to get hold of tickets. \"Next year we are expecting 7.5m visitors,\" George Osborne, chair of the British Museum, tells Sky News. \"That's more than the entire 270-odd year history of the British Museum.\" The state-to-state loan should, according to the museum's director Nicholas Cullinan, be viewed as an international event which \"shows that culture can bring people together\". But while it is without question a bit of a diplomatic coup, the decision to move the fragile Norman masterpiece in the first place is a contentious one. 'You don't play with this kind of masterpiece' From 2005 to 2010, Isabelle Attard was the director of the Bayeux Tapestry Museum in France. A former Green party deputy in the French National Assembly, she feels French President Emmanuel Macron's decision to loan the masterpiece is a \"joke\". \"I am not sure that everybody understands how fragile the tapestry is,\" she says. \"Emmanuel Macron [has] never cared about the advice and the opinion of the people who specialise in textile preservation. \"You just don't play with this kind of masterpiece because it's not replaceable. What surprised me is that curators in the British Museum can just see [the tapestry] like a normal item. It's not the case.\" Attard's sentiment is shared by renowned British artist David Hockney who, in an an op-ed for The Independent, said that \"some things are too precious to take a risk with\", and warned moving it could cause \"fibre contraction or expansion or colour fading\", all for \"the vanity of a museum\". The British Museum has repeatedly insisted it is experienced at moving precious artefacts internationally and that it isn't taking the fragility of the tapestry for granted. \"A museum's primary concern is to look after objects either in its care or on loan and we send around 3,000 objects every year,\" says Cullinan. \"We have incredible conservation staff to do this every day. \"Of course, the tapestry is supremely important. There's a degree of fragility, but the reality is much more fragile things travel all the time.\" Secret 'dummy runs' to test route For security reasons, the museum cannot say when the tapestry is being transported to London. We do know that it's being driven over on a lorry, going by road and rail, with secret \"dummy runs\" of the route taking place. And it has already been moved a short distance. When its official home in Bayeux closed for refurbishment last September, 80 people helped concertina it up, moving it first on to rails before it was covered with cotton wrapping and put into a storage box. While great care will be taken, not everyone is convinced that the move is worth the risk. More than 77,000 people have signed a French petition calling it a crime against their heritage. In Bayeux, while some locals were in favour of it at least going on show again somewhere, others told us they were worried. \"It's a disgrace... there's no reason to let them have it,\" one man from the town, called Joel, told us. \"We don't know what condition it'll be returned in.\" Julie, a younger cafe worker, says it feels \"frustrating\", and that \"when you read the specialists' studies, they mostly say it's not in a condition to travel right now\". Is the risk worth the reward? But Dr David Musgrove, author of The Story of the Bayeux Tapestry: Unravelling The Norman Conquest, says it is \"a question of risk and reward\". He concedes that the item is fragile, but says: \"The reward is that actually it gives it a long-term survival boost because it means everyone is going to be aware of it. It's giving it massive media attention.\" Chancellor Rachel Reeves has agreed to sign off on indemnity paperwork which effectively means British taxpayers will stump up anything up to £800m should anything go wrong with the move. As a former chancellor himself, Osborne says this is standard practice. \"I'm really grateful to the government... and Rachel Reeves for signing the indemnity on behalf of everyone,\" he says. \"It's the taxpayer who stands behind this, but that's not unusual.\" Lord Peter Ricketts, envoy for the Bayeux Tapestry loan, firmly believes the move is a cause for celebration. \"Rightly the French are very concerned to make sure that it comes over here and it goes back, and we've promised it will go back in the same condition it arrived,\" he says. \"I think after Brexit, Macron was looking for a way to really remind people that UK-French relations are important and they go deep into the culture of both countries.\" And... what about the Elgin Marbles? While the British Museum is understandably delighted to accept the loan on behalf of the UK, a handful of countries, such as Greece, will also be watching what's happening rather closely. Could such a loan pave the way for the Parthenon sculptures, also known as the Elgin Marbles, to return home to Greece? \"I'm engaged with the Greek government,\" Osborne says. \"I would love there to be, an exchange. It's hard to get everything right and hard to get everything aligned, but I'm really working hard to try and pull it off.\" The Bayeux Tapestry will open in early September, with general admission tickets on sale from 1 July."
    },
    {
        "title": "Police officer sacked and banned from profession for using WFH trick",
        "description": "A police sergeant has been sacked for using a picture frame to weigh down her laptop keys and give the false impression she was working from home.",
        "url": "https://news.sky.com/story/police-officer-sacked-and-banned-from-profession-for-using-wfh-trick-13512434",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-keyboard-money_7175513.jpg?20260226113250",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2026-02-26 11:45:00",
        "Headline": "No subtitle found",
        "Content": "A police sergeant has been sacked for using a picture frame to weigh down her laptop keys and give the false impression she was working from home. Avon and Somerset Police said the officer, referred to as Sergeant X, used the trick on the majority of shifts she worked in April and May last year. The officer admitted using a corner of a frame to weigh down the keys so her laptop would not go into \"sleep mode\" during a period of challenges in her personal life. An investigation was opened after data used by the force's professional standards department showed the officer's keystrokes were significantly high. Find tips and consumer news in the Money blog Further evidence found the number of keystrokes were between three and eight times higher than colleagues in a similar role. Sergeant X was dismissed without notice and barred from police and other law enforcement agencies after a hearing found her behaviour amounted to gross misconduct. \n                  Ocado to cut 1,000 jobs under restructuring plan\n                 \n                  Pizza Express announces move into chicken | Money blog\n                 \n                  Mark Kleinman blog | See the latest stories from Sky News' City editor\n                 Detective superintendent Larisa Hunt of Avon and Somerset Police said: \"It is extremely disappointing an officer has behaved in a way which could not only discredit the police force, but also undermine the public confidence in respect of our duties and responsibilities. \"We know officers and staff deal with immense pressure and high workloads, and while Sergeant X had some mitigating circumstances, it's unacceptable for an officer to act in this deliberate and deceitful way by abusing the trust placed in her, by making it appear she was working when she was not.\""
    }
]