[
    {
        "title": "Budget 2025 income tax U-turn: What the hell just happened?",
        "description": "What the hell's just happened?&#160;",
        "url": "https://news.sky.com/story/budget-2025-income-tax-u-turn-what-the-hell-just-happened-13470226",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-downing-street_7081988.jpg?20251114131243",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-11-14 12:57:00",
        "Headline": "The Labour Party will no doubt feel relief today that the chancellor is not going to break the manifesto. But the shambles this week is staggering.",
        "Content": "\n          Political editor\n              @BethRigby\n What the hell's just happened?Â  On Thursday night I was told that Chancellor Rachel Reeves and Prime Minister Sir Keir Starmer were now not going to raise income tax, having had anonymous briefings for weeks that a manifesto-breaking tax rise was coming, culminating in the speech in Downing Street by the chancellor last week alluding to that. Politics live: U-turn on budget income tax rise triggers 'not normal' market volatility I had also heard the prime minister was going to make a speech next week to the same effect. The U-turn - first broken in the Financial Times - was not something the government wanted to leak, and there is anger in Downing Street. I was told late last night by a source that the decision had been taken to back off income tax rises. There is obviously some consternation, to say the least, that ministers, the party, the public have been marched up the hill, only to be marched back down again. It all adds to a sense of chaos and a government out of control. So what on earth is going on? Read more: How No 10 plunged itself into crisis  Let's first do the economics of it. I was told this morning by Treasury sources that the fiscal forecasts from the Office of Budget Responsibility are stronger than expected. There had been expectations of a Â£30bn-Â£40bn black hole in the public finances. But I'm told today that black hole is actually closer to Â£20bn: the chancellor also wants headroom of perhaps up to Â£15bn, but I'm told the change in forecasts has changed the calculation. I'm told wage growth has been stronger which has helped tax receipts and improved forecasts. So, where does that leave the government? Treasury figures tell me that the change in forecasts mean the manifesto-busting income tax hike is now not necessary. I don't need to spell out the jeopardy for such a move: Rachel Reeves was poised to be the first chancellor in 50 years to raise the basic rate of income tax and break the core manifesto pledge that Labour made to voters last year. It doesn't mean taxes are not going up. The government is set to freeze tax thresholds for another two years from 2028. That will raise around Â£8bn as millions of workers are dragged into higher tax bands and end up paying more tax. There will also be tax raising around pensions and salary sacrifice schemes and on electric vehicles, as well as other measures, as the chancellor casts around for Â£20bn. But what about the politics? Well, one government figure today insists that the decision to drop the income tax plan is nothing to do with the self-inflicted leadership crisis at No 10 after anonymous briefings designed to see off any potential post-budget coup against the prime minister spectacularly backfired. The changed forecasts, I'm told, came in last week. ðŸ‘‰ Click here to listen to Electoral Dysfunction on your podcast app ðŸ‘ˆ But of course there's tonnes of politics in this. The talk of higher wage growth perhaps offsetting some of the productivity downgrades was being flagged a couple of weeks back, before the chancellor made her speech. It's extremely unusual for a chancellor to pitch-roll their budget. But Reeves did it for a reason. That was laying the ground for a massive budget that would bring manifesto-breaking tax rises. She told us of the difficult environment, ruled out more borrowing or spending cuts before telling us \"everyone must play their part\". She repeatedly refused to stick to manifesto promises on tax. It doesn't get much more stark than that. That the government has U-turned on that decision is about far more than just the fiscal framework. Read more: What taxes could go up now?  With trust so low in the government, there were serious worries - and warnings - from the party that such a big manifesto break might be something from which the PM and the chancellor wouldn't recover. One senior party figure that thinks there could be a leadership challenge after the May elections told me this week that manifesto-breaking tax rises would only make that more likely because Labour would \"need a clean skin\" to try and rebuild with the public if Starmer broke his promises in that way. Read more: Is Starmer 'in office but not in power'? Lucy Powell, the deputy Labour leader, fired a warning shot last week when she said the party should stick to the manifesto and not raise tax: \"We should be following through on our manifesto, of course. There's no question about that,\" she told Matt Chorley on BBC Radio 5 Live. \"Trust in politics is a key part of that because if we're to take the country with us then they've got to trust us and that's really important too.\" The party will no doubt feel relief today that the chancellor is not going to break the manifesto. It would have only made things a whole lot worse for a government that is in real trouble. But the shambles of this week is staggering. From the self-inflicted leadership crisis to leaks over a massive budget U-turn, it all lends to the sense that this is a No 10 out of control, lurching from one mess to another. Strap in."
    },
    {
        "title": "Banksy art theft lands burglar with 13-month prison sentence",
        "description": "A man has been given a 13-month prison sentence for stealing Banksy's famous Girl With Balloon print from a London gallery.",
        "url": "https://news.sky.com/story/man-given-13-month-prison-sentence-for-stealing-banksy-painting-13470088",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-banksy-theft_7081720.jpg?20251114080958",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-14 07:27:00",
        "Headline": "Larry Fraser used a hammer to smash his way through a glass entrance door at the Grove Gallery in London before stealing Banksy's Girl With Balloon, valued at Â£270,000.",
        "Content": " A man has been given a 13-month prison sentence for stealing Banksy's famous Girl With Balloon print from a London gallery. Larry Fraser, 49, of Beckton, east London, was sentenced on Friday after pleading guilty to one count of non-residential burglary at Kingston Crown Court on 9 October. The print, one of the street artist's most famous, was stolen from a gallery in New Cavendish Street in London at around 11pm on 8 September last year. Fraser used a hammer to smash his way through a glass entrance door at the Grove Gallery before stealing the artwork, which was valued at Â£270,000. He concealed his identity with a mask, hooded jacket and gloves, but the Metropolitan Police's Flying Squad was able to identify him and track him to a location streets away. He was also caught on CCTV loading the artwork into a van before fleeing the scene. A second man, 54-year-old James Love, was accused of being the getaway driver in the burglary, but cleared of stealing the print. Fraser was arrested at his home address on 10 September, within 48 hours of the burglary, and charged the next day. Officers were able to recover the artwork after executing a warrant on the Isle of Dogs. It has now been returned to the gallery. Fraser pleaded to the court that he was struggling with a historic drug debt and agreed to steal the work \"under a degree of pressure and fear\". He said he did not know what he would be stealing, nor its value, until the day of the offence. Jeffrey Israel, defending, said Fraser lived with his mother as her principal carer, and had only managed to \"break his cycle of drug addiction\" after his last prison sentence. He added that it \"would take a bold advocate\" to suggest that the value of the print had increased by the burglary, but insisted \"that is probably the reality\". Read more:Banksy artwork 'worth millions' scrubbed off wall outside courtBlink-182 star to auction rare Banksy worth millions Judge Anne Brown was unmoved, however, and said the offence was \"simply too serious\" for a suspended sentence. \"This is a brazen and serious non-domestic burglary,\" she said. \"Whilst you did not know the precise value of the print, you obviously understood it to be very valuable.\" She added: \"Whilst I am sure there was a high degree of planning, this was not your plan.\" However, Fraser may be eligible for immediate release due to time spent on electronic curfew. Detective Chief Inspector Scott Mather, who led the Met's investigation, said: \"Banksy's Girl With Balloon is known across the world - and we reacted immediately to not just bring Fraser to justice but also reunite the artwork with the gallery. \"The speed at which this took place is a testament to the tireless work of the flying squad officers - in total it took just four days for normality to be restored.\" The 2004 artwork was part of a Â£1.5m collection of 13 Banksy pieces at the gallery. Gallery manager, Lindor Mehmetaj, said it was \"remarkable\" for the piece to have been recovered after the theft. The 29-year-old said: \"I was completely, completely shocked, but in a very, very positive way when the Flying Squad showed me the actual artwork. \"It's very hard to put into words, the weight that comes off your shoulders.\""
    },
    {
        "title": "Nursery worker detained for 10 years for rape and sexual abuse",
        "description": "A nursery worker has been detained for 10 years for rape and sexual abuse against boys as young as three.",
        "url": "https://news.sky.com/story/nursery-worker-detained-for-10-years-for-rape-and-sexual-abuse-13470328",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-thomas-waller_7082215.jpg?20251114210632",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-14 16:37:00",
        "Headline": "The mother of one victim said Thomas Waller had used his \"skills\" to \"build trust with my son and then exploit him\", while the parent of another victim described his actions as \"premeditated and calculated\".",
        "Content": "A nursery worker has been detained for 10 years for rape and sexual abuse against boys as young as three. Warning: Readers may find details in this story distressing. Thomas Waller, 18, took advantage of his position to gain the trust of two boys in his care before exploiting them, Guildford Crown Court heard. The teenager from Farnham, Surrey, was working at a nursery and his responsibilities included taking children to the toilet and helping them get changed. Sentencing him on Friday, Judge Claire Harden-Frost said it was \"heartbreaking\" to see the victims' parents feeling responsible for what had happened. Waller was found guilty of rape, two counts of causing or inciting sexual activity and taking indecent photos after a trial at Staines Youth Court earlier this year. He was sentenced to 15 years at a young offender institution, of which he must serve 10 in detention and five on licence. In a victim impact statement, one parent said: \"This was not an accident. It was not a poor decision on the spur of the moment, it was premeditated and calculated. \"This man continually gave no comment. This man chose to deny everything. He has had every opportunity to plead guilty and express remorse, and he has chosen not to. He has demonstrated no accountability for his actions.\" Another father of a victim said his son had \"gathered a collection of memories that I would never wish on a human being\". He described Waller as \"cold, sinister and calculated\". He added, \"Tom cannot be allowed to do this again.\" Read more from Sky News:Burglar jailed for Banksy art theftCold weather alert issued in England Meanwhile, another mother told the court in a statement that Waller had used his \"skills\" to \"build trust with my son and then exploit him\". She added that \"beautiful, brave, clever son\" questioned his own guilt as a result of giving evidence at court. Speaking outside court, Detective Superintendent Kate Hyde said a \"dangerous man\" had been put behind bars. \"This deeply distressing case is every parent's worst nightmare, and I would like to pay tribute to the victims and their families for their resilience throughout this whole process. \"Their support and strength enabled us to secure convictions and put a dangerous man behind bars. \"I hope the fact he has been brought to justice for the crimes he has committed helps the families affected by his crimes to start to move forward with their lives,\" she added."
    },
    {
        "title": "Severe flood warning for 'significant risk to life' as large part of England put on cold weather alert",
        "description": "Two severe flood warnings have been issued, meaning a significant risk to life, as a&#160;large part of England is put on alert for cold weather from Monday.",
        "url": "https://news.sky.com/story/severe-flood-warning-for-significant-risk-to-life-as-large-part-of-england-put-on-cold-weather-alert-13470395",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-richmond-park-freezing_7082310.jpg?20251114202317",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-14 19:00:00",
        "Headline": "Five regions of England are being warned of a cold snap, as the UK Health Security Agency (UKHSA) says \"significant impacts are possible across health and social care services\".",
        "Content": "Two severe flood warnings have been issued, meaning a significant risk to life, as aÂ large part of England is put on alert for cold weather from Monday. Severe flooding is expected in southeast Wales on the River Monnow at Skenfrith and also at Osbaston, Monmouthshire, according to Natural Resources Wales. Check the weather forecast where you are The warning states that \"significant risk to life and significant disruption to the community is expected\", including the possibility of homes being flooded. \"Flood water could be deep and fast flowing and pose a risk to life,\" the statement adds. Dozens of flood warnings have also been issued across England. The warning has been issued as Storm Claudia brought amber weather warnings and torrential rain to large parts of the UK on Friday. Meanwhile, a yellow alert for cold weather has also been issued by the UK Health Security Agency (UKHSA). \n                  UK weather: Flood and 'do not travel' warnings issued as Storm Claudia arrives\n                 \n                  Mildest Bonfire Night on record as UK experiences 'humid' conditions\n                 \n                  Storm Benjamin to bring heavy rain and winds to parts of UK\n                 Significant impacts possible It affects five regions: East Midlands, West Midlands, North East, North West and Yorkshire and The Humber from 8am on Monday 17 November until 8am on Friday 21 November. The UKHSA warns that \"significant impacts are possible across health and social care services\" including a rise deaths among those aged 65 and over, or those with health conditions. The Met Office is forecasting that temperatures could fall below freezing in some areas of the UK next week. A month of rain in 24 hours Storm Claudia has brought heavy downpours and flooding with the Met Office warning some areas could see up to a month's worth of rain in 24 hours. There has also been travel disruption. Rail passengers are being told not to use Great Western trains between London Paddington and Bristol and South Wales because of flooding on the line. Their services between Exeter St Davids and Barnstaple are not running for the same reason. Avanti West Coast, Northern, CrossCountry, TransPennine Express, Transport for Wales and Chiltern are also reporting disruption or cancellations to their timetable. An amber weather warning had been in force on Friday for parts of Wales, along with large areas of central England and some parts of northern England. By 4pm on Friday, 81.8mm of rain was registered in Tafalog, Gwent - which is 60% of the monthly November average for the region. The storm, named by Spain's meteorological service, has triggered weather warnings in Spain and Portugal, and is affecting the Canary Islands. Ireland's meteorological service, Met Eireann, has also issued weather warnings, with significant rain likely in the southeast for Dublin, Wexford and Wicklow into Saturday morning. It warns that significant flooding is possible along with hazardous travel conditions. Meanwhile, a yellow weather warning for rain remains in place until 6am on Saturday, for most of Wales, as well as an area of England roughly south of York. Some areas could expect 30 to 50mm (1.2 to 2in) of rainfall widely, with 100mm (3.9in) for parts of southeast Wales. A separate yellow warning applies from midnight until noon on Saturday across Counties Down and Armagh in Northern Ireland. The Met Office warns that 10 to 20mm (0.4 to 0.8in) is expected fairly widely, with potentially in excess of 40mm (1.6in) over the Mourne mountains."
    },
    {
        "title": "Man charged over allegedly wearing military uniform without permission on Remembrance Sunday",
        "description": "A man has been charged over allegedly dressing up as an admiral during a Remembrance Sunday event.",
        "url": "https://news.sky.com/story/man-charged-over-allegedly-wearing-military-uniform-without-permission-on-remembrance-sunday-13470336",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-admiral-remembrance_7082320.jpg?20251114215842",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-14 16:59:00",
        "Headline": "No subtitle found",
        "Content": "A man has been charged over allegedly dressing up as an admiral during a Remembrance Sunday event. Jonathan Carley, 64, from Harlech, Gwynedd, has been charged with wearing uniform/dress bearing the mark of His Majesty's Forces without permission. North Wales Police said they made an arrest on Friday after a man was seen wearing \"the uniform and medals of a high-ranking Navy officer\" during a wreath-laying service in Llandudno, Conwy county, on Sunday 9 November. He will appear at Caernarfon Magistrates' Court on December 11. Chief Inspector Trystan Bevan said: \"We understand that this incident has caused significant public concern, particularly given its occurrence on Remembrance Sunday. \"In response to the reports made to North Wales Police, officers have responded swiftly to make an arrest and proceed with charges. \"We urge members of the public to avoid online speculation and to refrain from sharing any content that could compromise future court proceedings.\""
    },
    {
        "title": "Trump calls for Epstein's 'ties' with Bill Clinton and other Democrats to be investigated",
        "description": "Donald Trump said he will ask the Justice Department to investigate Jeffrey Epstein's alleged ties to former US president Bill Clinton and other prominent Democrats.",
        "url": "https://news.sky.com/story/trump-calls-for-epsteins-ties-with-bill-clinton-and-other-democrats-to-be-investigated-13470363",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bill-clinton-new-york_7030552.jpg?20250924162215",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-14 18:08:00",
        "Headline": "It comes as fresh questions about Mr Trump's own relationship with the paedophile financier were raised as his name came up multiple times in a trove of Epstein emails published earlier this week.",
        "Content": " Donald Trump said he will ask the Justice Department to investigate Jeffrey Epstein's alleged ties to former US president Bill Clinton and other prominent Democrats. The call from the US president comes as fresh questions about Mr Trump's own relationship with the paedophile financier were raised as his name came up multiple times when 20,000 pages were released from Epstein's files earlier this week. Mr Trump has called claims to link him to Epstein as a \"hoax\". Mr Trump said he would ask US Attorney General Pamela Bondi to look into any alleged involvement between former Democrat leader Clinton and paedophile financier Epstein. She later wrote on X that she would assign the investigation to Jay Clayton, the US attorney for the Southern District of New York. Along with Mr Clinton, Mr Trump said he would also ask the Justice Department to investigate former treasury secretary Larry Summers, and Reid Hoffman, the LinkedIn founder, who is also a prominent Democratic donor. Read more:Who appears in the new Epstein files?Why this is dangerous terrain for TrumpWhat do Epstein documents say about Trump and Andrew? All three men were mentioned in the 20,000 Epstein-related documents released by the House Oversight Committee on Wednesday. None of them, however, have been accused of wrongdoing in the Epstein case. In a lengthy post on his social media platform Truth Social, Mr Trump said: \"Now that the Democrats are using the Epstein Hoax, involving Democrats, not Republicans, to try and deflect from their disastrous SHUTDOWN, and all of their other failures, I will be asking A.G. Pam Bondi, and the Department of Justice, together with our great patriots at the FBI, to investigate Jeffrey Epstein's involvement and relationship with Bill Clinton, Larry Summers, Reid Hoffman, J.P. Morgan, Chase, and many other people and institutions, to determine what was going on with them, and him.\" \n                  Donald Trump confirms he will sue the BBC over Panorama edit - despite broadcaster's apology\n                 \n                  Union demands Sir Robbie Gibb's removal from BBC board to defend 'political impartiality'\n                 \n                  'The dog that hasn't barked': Trump, Epstein, and the emails\n                 Mr Trump also said: \"Epstein was a Democrat, and he is the Democrat's problem, not the Republican's problem! \"They all know about him, don't waste your time with Trump. I have a Country to run!\" What do the named parties say about alleged links to Epstein? Angel Urena, deputy chief of staff for Mr Clinton, said in 2019: \"President Clinton knows nothing about the terrible crimes Jeffrey Epstein pleaded guilty to in Florida some time ago, or those with which he has been recently charged in New Yorkâ€¦has never been to Little St James Island, Epstein's ranch in New Mexico, or his residence in Florida.\" Epstein had been a JPMorgan client from 1998 until 2013. \"The firm deeply regrets any association with this man, and would never have continued doing business with him if it believed he was using the bank in any way to commit his heinous crimes,\" JPMorgan said in a statement in September 2023. Summers, former Harvard University president, recently issued a statement saying he has \"great regrets in my life.\" \"As I have said before, my association with Jeffrey Epstein was a major error of judgement,\" the statement said. Similarly, Mr Hoffman told Axios in 2019 he regretted his relationship with Epstein. \"My few interactions with Jeffrey Epstein came at the request of Joi Ito, for the purposes of fundraising for the MIT Media Lab. \"Prior to these interactions, I was told by Joi that Epstein had cleared the MIT vetting process, which was the basis for my participation. \"My last interaction with Epstein was in 2015. Still, by agreeing to participate in any fundraising activity where Epstein was present, I helped to repair his reputation and perpetuate injustice. For this, I am deeply regretful.\""
    },
    {
        "title": "Man weeps after being found guilty of stalking Dame Penny Mordaunt",
        "description": "A former councillor has been found guilty of stalking Dame Penny Mordaunt but acquitted of the more serious offence of stalking involving serious alarm or distress.",
        "url": "https://news.sky.com/story/man-weeps-after-being-found-guilty-of-stalking-dame-penny-mordaunt-13470530",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-edward-brandt-stalking_7082359.jpg?20251114220019",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-14 21:52:00",
        "Headline": "Dame Penny said in a statement to police that she \"feared sexual violence\" because of the defendant's \"creepy\" behaviour.",
        "Content": "A former councillor has been found guilty of stalking Dame Penny Mordaunt but acquitted of the more serious offence of stalking involving serious alarm or distress. A jury convicted Edward Brandt, 61, of the lesser charge by a majority of 10 to two following a trial at Southampton Crown Court. Brandt wept and held his hands over his face after he heard the verdicts. The court heard the former Conservative cabinet minister believed he was a \"real threat\" and feared \"sexual violence\". The trial was told that Brandt sent at least 17 emails and three phone messages to Ms Mordaunt, as well as turning up at her Portsmouth constituency office out of hours between 11 September 2023 and 12 May 2024. Brandt, who lived on the Isle of Wight at the time, failed to comply with the terms of a conditional caution issued in April 2024 which required him to complete a victim awareness course and not to contact Dame Penny, the trial heard. The divorced father-of-two, who now lives in Lymington, Hampshire, then left two voicemail messages for her on 6 and 10 May, and in one of the messages, he said: \"I am going to go on gently knocking at your door in order to shake your hand, I am not giving up.\" \n                  Penny Mordaunt 'threatened to pull out of TV debate' if she couldn't apologise for D-Day blunder\n                 \n                  Behind the scenes of the Tory government's fall from power - Part 2\n                 \n                  Behind the scenes of the Tory government's fall from power - Part 1\n                 Brandt, who worked as a professional sailor, was also made subject to an interim stalking protection order at Isle of Wight Magistrates' Court on 16 July 2024. Dame Penny said in a statement to police that she \"feared sexual violence\" because of the defendant's \"creepy\" behaviour. Judge William Mousley KC adjourned the case for a pre-sentence report to be prepared on Brandt, a former councillor for East Hampshire District Council, and released him on conditional bail until the sentencing hearing on 16 January. Read more from Sky News:Zarah Sultana is being 'sabotaged'Budget 2025: Income tax U-turn 'This man was a real threat' Dame Penny, who was emotional at times, told the court: \"I have been a parliamentarian for 14 years and during that time I have had to deal with all kinds of threats and issues. \"I have a lot of life experience and dealing with vulnerable people or people who are mentally unwell or strange in another way, and I believe this man was a real threat to me and still is.\" Explaining why he wanted to meet the Conservative Party leadership candidate, Brandt told the court: \"I wanted to commiserate with her for not getting the top job in the autumn, I think she would still have been prime minister if she had been. \"I wanted to congratulate her because she was a reforming leader of the Commons, I wanted to congratulate her on the coronation, chat to her about her time in office, have her sign a copy of her book. \"It was entirely political and entirely harmless.\" Brandt, who said that he had been diagnosed as having ADHD and being on the autism spectrum, said that he had not had responses from Dame Penny's office about his requests to meet her, and added: \"I wasn't getting a reply, I harmlessly kept trying.\""
    },
    {
        "title": "A US man is believed to be the first to have died from a meat allergy linked to tick bites",
        "description": "A 47-year-old New Jersey man died last year from alpha-gal syndrome, a red meat allergy caused by a tick bite. ",
        "url": "https://news.sky.com/story/a-us-man-is-believed-to-be-the-first-to-have-died-from-a-meat-allergy-linked-to-tick-bites-13470460",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-steak-meat-flat-iron_6926532.jpg?20250525074436",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-14 20:37:00",
        "Headline": "The 47-year-old pilot died last year in what researchers believe is the first documented death of its kind.",
        "Content": "A 47-year-old New Jersey man died last year from alpha-gal syndrome, a red meat allergy caused by a tick bite.  His death is believed to be the first documented death from a meat allergy triggered by tick bites. Symptoms for alpha-gal syndrome - which in 2011 was first linked to bites from the Lone Star tick - can include hives, nausea, vomiting, diarrhoea, severe stomach pain, difficulty breathing, dizziness and swelling of the lips, throat, tongue or eyelids. The reaction to the foods that cause the symptoms can be delayed, and usually present themselves a few hours later, unlike some other food allergies, which occur soon after eating. The new research follows the case of a healthy airline pilot who went camping in 2024 with his wife and children. They had steak for supper. This was unusual, as he rarely ate meat. He woke at 2am with violent pain in his abdomen, vomiting and diarrhoea. The next day he ate breakfast and went on a five-mile walk. \n                  Police pantomime and migrants shopping for life jackets: Inside the route to the Channel\n                 \n                  Ukraine war latest: Russia accused of 'scorched earth' tactic - as Moscow's ambassador confronted in Romania\n                 \n                  Trump calls for Epstein's 'ties' with Bill Clinton and other Democrats to be investigated\n                 A fortnight later, back in New Jersey, he went to a barbecue, where he ate a hamburger. About four hours later, he grew ill. Shortly afterwards, his son found him on the bathroom floor unconscious. His son called paramedics, and he was admitted to hospital, but the man was announced dead later that night. Blood tests conducted by researchers revealed evidence of the alpha-gal syndrome. Proof that it came from a Lone Star tick is inconclusive. The researchers made the link after a statement from the man's wife, who had said he had 12 or 13 \"chigger\" bites near his ankles earlier in the summer. But the conclusion makes sense, as people in eastern America sometimes mistake the bites from mites with those from larval ticks. More than 100,000 people in the U.S. have become allergic to red meat since 2010 because of the syndrome, according to one estimate. Read more:Spending on special needs provision could push councils to breaking pointKing cuts birthday cake with a little help from the Queen Dr Scott Commins, a leading alpha-gal syndrome researcher at the University of North Carolina, called his death an \"unmitigated tragedy\". \"Totally unnecessary and with increased awareness, this won't happen again,\" he said in an email."
    },
    {
        "title": "Banksy art theft lands burglar with 13-month prison sentence",
        "description": "A man has been given a 13-month prison sentence for stealing Banksy's famous Girl With Balloon print from a London gallery.",
        "url": "https://news.sky.com/story/man-given-13-month-prison-sentence-for-stealing-banksy-painting-13470088",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-banksy-theft_7081720.jpg?20251114080958",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-14 07:27:00",
        "Headline": "Larry Fraser used a hammer to smash his way through a glass entrance door at the Grove Gallery in London before stealing Banksy's Girl With Balloon, valued at Â£270,000.",
        "Content": " A man has been given a 13-month prison sentence for stealing Banksy's famous Girl With Balloon print from a London gallery. Larry Fraser, 49, of Beckton, east London, was sentenced on Friday after pleading guilty to one count of non-residential burglary at Kingston Crown Court on 9 October. The print, one of the street artist's most famous, was stolen from a gallery in New Cavendish Street in London at around 11pm on 8 September last year. Fraser used a hammer to smash his way through a glass entrance door at the Grove Gallery before stealing the artwork, which was valued at Â£270,000. He concealed his identity with a mask, hooded jacket and gloves, but the Metropolitan Police's Flying Squad was able to identify him and track him to a location streets away. He was also caught on CCTV loading the artwork into a van before fleeing the scene. A second man, 54-year-old James Love, was accused of being the getaway driver in the burglary, but cleared of stealing the print. Fraser was arrested at his home address on 10 September, within 48 hours of the burglary, and charged the next day. Officers were able to recover the artwork after executing a warrant on the Isle of Dogs. It has now been returned to the gallery. Fraser pleaded to the court that he was struggling with a historic drug debt and agreed to steal the work \"under a degree of pressure and fear\". He said he did not know what he would be stealing, nor its value, until the day of the offence. Jeffrey Israel, defending, said Fraser lived with his mother as her principal carer, and had only managed to \"break his cycle of drug addiction\" after his last prison sentence. He added that it \"would take a bold advocate\" to suggest that the value of the print had increased by the burglary, but insisted \"that is probably the reality\". Read more:Banksy artwork 'worth millions' scrubbed off wall outside courtBlink-182 star to auction rare Banksy worth millions Judge Anne Brown was unmoved, however, and said the offence was \"simply too serious\" for a suspended sentence. \"This is a brazen and serious non-domestic burglary,\" she said. \"Whilst you did not know the precise value of the print, you obviously understood it to be very valuable.\" She added: \"Whilst I am sure there was a high degree of planning, this was not your plan.\" However, Fraser may be eligible for immediate release due to time spent on electronic curfew. Detective Chief Inspector Scott Mather, who led the Met's investigation, said: \"Banksy's Girl With Balloon is known across the world - and we reacted immediately to not just bring Fraser to justice but also reunite the artwork with the gallery. \"The speed at which this took place is a testament to the tireless work of the flying squad officers - in total it took just four days for normality to be restored.\" The 2004 artwork was part of a Â£1.5m collection of 13 Banksy pieces at the gallery. Gallery manager, Lindor Mehmetaj, said it was \"remarkable\" for the piece to have been recovered after the theft. The 29-year-old said: \"I was completely, completely shocked, but in a very, very positive way when the Flying Squad showed me the actual artwork. \"It's very hard to put into words, the weight that comes off your shoulders.\""
    },
    {
        "title": "Does the government have the power to push through unpopular decisions?",
        "description": "Back in June, it was the U-turn on welfare that raised eyebrows. Now it's a perceived volte-face on tax. ",
        "url": "https://news.sky.com/story/does-the-government-have-the-power-to-push-through-unpopular-decisions-13470369",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-cash-money-hmrc-tax_7078297.jpg?20251110151814",
        "type": "UK",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-11-14 18:20:00",
        "Headline": "It's not a new question. Traders have been asking it for some time. Today, it was again at the forefront of their minds.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Back in June, it was the U-turn on welfare that raised eyebrows. Now it's a perceived volte-face on tax.  After weeks of suggestions that income tax may have to rise in the forthcoming budget, government sources have confirmed that Chancellor Rachel Reeves will do no such thing. The government is flip-flopping in a febrile environment. Markets are sensitive to levels of government debt, which climbed by 17.9% between 2019 and 2024. In the context of an ageing population, slow growth and comparatively high inflation, there are concerns that UK debt is on an unsustainable path. Markets want consolidation - for the chancellor to get a grip on tax and spending. Ms Reeves, with her insistence on iron-clad fiscal rules, promised discipline. But flip-flopping doesn't look like discipline. Markets are letting their thoughts be known - and their thoughts matter because the government borrows from them. Government bond yields, the interest rate demanded on UK debt, jumped amid fears that the government is not prepared to face down opposition from its own backbenchers, from political opponents or the public. The 30-year gilt was up 16 basis points after its worst day since July, when the chancellor was seen crying in the Commons. The 10-year gilt was up 13 points. \n                  Telegraph future in limbo again as RedBird abandons Â£500m deal\n                 \n                  Direct cost of Jaguar Land Rover cyber attack which impacted UK economic growth revealed\n                 \n                  Budget 2025: Starmer and Reeves ditch plans to raise income tax\n                 Borrowing costs are already costing the country more than Â£100bn a year - about 10% of total spending. The more money the government is spending on interest, the less flexibility it has to spend more in other areas, like schools or hospitals. It appears that Ms Reeves has changed tack because official forecasts from the Office for Budget Responsibility (OBR), whose forecasts underpin the budget, show the fiscal black hole is closer to Â£20bn, rather than the Â£30bn first feared. It means she can take less radical steps to raise money. Markets are pleased that the chancellor is sticking to her rules, but they are viewing this move with scepticism. Many view the OBR forecasts as overly optimistic. These are smaller tax rises to tackle a smaller problem on paper, but is what's written on that paper credible? Andrew Goodwin, of Oxford Economics, said: \"If investors suspect the government is leaning on convenient assumptions, they may assume more trouble ahead - and yields could rise further.\" Then there's the speculation over which taxes could rise. Markets have a clear preference towards income tax because, unlike the increase in national insurance contributions on businesses in the last budget, it's not inflationary. And alternative sources, such as tweaks to stamp duty or EV taxes, are less dependable revenue raisers. \"Avoiding the politically sensitive income tax lever implies less willingness to tackle the structural deficit later,\" said Gordon Shannon, of TwentyFour Asset Management. Read more:'Staggering' 20-year fall in domestic UK flightsDoctors in England begin five-day strike Traders are eyeing the long-term trajectory of the UK, and they are bristling at short-term fixes and tweaks that don't address the fundamental fiscal position. There are those in policy who are also frustrated at the approach, which has seen the government pick and drop policies to meet fiscal rules by fine margin. It is difficult to find any political vision in it all."
    },
    {
        "title": "'Incredibly dangerous' sex offender Chao Xu jailed - as police say there could be hundreds more victims",
        "description": "An \"incredibly dangerous\" sex offender who drugged his victims and installed spy cameras around his home has been jailed for life with a minimum term of 14 years &#8211; as police appeal for hundreds more potential victims to come forward.",
        "url": "https://news.sky.com/story/sex-offender-chao-xu-jailed-as-police-say-there-could-be-hundreds-more-victims-13469742",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/chao-xu-skynews-comp_7081874.jpg?20251114164654",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-14 15:32:00",
        "Headline": "Xu admitted 24 offences including rape, drugging victims and upskirting.",
        "Content": " An \"incredibly dangerous\" sex offender who drugged his victims and installed spy cameras around his home has been jailed for life with a minimum term of 14 years â€“ as police appeal for hundreds more potential victims to come forward. Warning: This article contains details of sexual offences  Chinese national Chao Xu, 33, has been described by police as \"one of the most prolific offenders ever uncovered\" by the Metropolitan Police. Xu, who was a law postgraduate student at the University of Greenwich in London between 2015 and 2016, ran his own recruitment business and targeted victims at networking events at his home. He invented his \"Spring of Life\" cocktail, a mix of alcohols and Chinese herbal medicines, to sedate guests, and planted spy cameras in items including air fresheners, sanitary packaging and speakers. Police found thousands of pictures and videos, with some showing unconscious or incapacitated victims in his flat in Greenwich, south-east London. Xu, who is from China but is believed to have been living in the UK since 2013, also covertly filmed women on their daily commutes at stations such as London Bridge in so-called upskirting incidents. He pleaded guilty to 24 sex offences between 2021 and 2025 at Woolwich Crown Court in August relating to six victims, with two charges relating to a seventh woman left to lie on file. Xu admitted four counts of rape, eight counts of assault by penetration, four counts of sexual assault, four counts of voyeurism, two counts of administering a substance with intent and two counts of operating equipment beneath the clothing of another without consent (commonly known as upskirting). 'Incredibly dangerous man' His Honour Judge Christopher Grout described Xu as an \"incredibly dangerous man\" who \"took great enjoyment\" from his offending. \"Your behaviour was calculated and planned, evidenced by the covert recording systems you had set up in your flats and the fact you had incapacitated a number of your victims by drugging them. \"You betrayed the trust of a number of women who you befriended in the most appalling ways imaginable,\" he added. Could be hundreds of victims Another 11 alleged victims have since come forward but the Metropolitan Police believe there are hundreds more in the UK and China, with offences committed in workplaces, public spaces and overseas. Acting Detective Superintendent Lewis Sanderson described Xu as one of the \"most prolific\" offenders the force has ever investigated, adding that his \"crimes were calculated, sustained, and devastating\". Speaking outside the court on Friday, he said: \"Chao Xu was a prolific and predatory sexual offender who committed some of the most cowardly and abhorrent crimes imaginable. His actions caused deep and lasting harm.\" \"The number of victims of sexual assault, voyeurism and upskirting is believed to be in the hundreds. This includes individuals filmed without consent in Xu's flat at his workplace and in public spaces. \"That is why today I'm making a direct appeal. If you believe you may have been a victim of Chao Xu, or if you have any information that could assist our investigation, please come forward. You will be listened to. You will be believed and you will be supported.\"  He said all of the sexual assault victims were Chinese women, aged between 18 and 30, while the voyeurism victims are also young females but of different ethnicities. He added that there will be women who may not know they are victims of his crimes, as they may have been drugged by Xu. Detectives were alerted to Xu's crimes after he held a networking event in Greenwich in June. Read more from Sky News:Man admits to summer camp attacksMurder investigation after girl's deathBurglar jailed over Banksy theft When one of the women who attended became unwell, Xu offered to let her stay, before raping her several times, the Metropolitan Police said. They later found he had drugged her with substances known to cause drowsiness and incapacitation. The case included six million messages on WeChat, the popular Chinese messaging app, most of them in Mandarin, which all had to be checked with the help of a translator."
    },
    {
        "title": "Summer camp leader pleads guilty to drugging and sexually assaulting two boys",
        "description": "A former vet has admitted drugging and sexually assaulting two boys at a summer camp after lacing sweets with sedatives.",
        "url": "https://news.sky.com/story/summer-camp-leader-pleads-guilty-to-drugging-and-sexually-assaulting-two-boys-13470263",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jonathon-ruben-leicester_6980556.jpg?20250802110145",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-14 14:18:00",
        "Headline": "Jon Ruben, of Nottinghamshire, admitted sexual assault of a child under 13, assault of a child under 13 by penetration, eight counts of child cruelty, three counts of making indecent images of children and four drugs charges.",
        "Content": "A former vet has admitted drugging and sexually assaulting two boys at a summer camp after lacing sweets with sedatives. Jon Ruben, 76, of Nottinghamshire, admitted sexual assault of a child under 13, assault of a child under 13 by penetration, eight counts of child cruelty, three counts of making indecent images of children and four drugs charges. Leicester Crown Court was told Ruben, who prosecutors said had run a holiday camp for at least 27 years, laced sweets with tranquilising drugs and attacked two children after asking youngsters to play \"a sweet game\". Ruben denied a further charge of assault by penetration. Prosecutors have been given two weeks to consider if they will proceed with this charge. Prosecutor Mary Prior KC said the charges related to a summer camp held at rented premises near a village in Leicestershire last summer. The prosecutor told the court: \"The defendant, for at least 27 years, has run a holiday camp. \"There is a long history of children feeling sick at the camp over many years.\" The rented premises, Stathern Lodge, were not connected to the camp itself, the court heard, and Ruben was in charge of youngsters there, Ms Prior said. \"He made the rules,\" she added. \"For many years he has played what he calls a sweet game with the children in which he goes into the bedrooms. \"The game is that each has to eat really sticky sweets as quickly as they can but they must chew them. \"Children have always felt ill the next day but he explained it as they were overwrought.\" Ruben was remanded in custody until a further hearing at the same court on 28 November. Temporary Detective Chief Inspector Neil Holden said: \"This has been a horrific, complex and emotional investigation involving multiple young, innocent, vulnerable victims and a man who committed the vilest crimes. \"Our focus today must of course remain on the young victims and with the support of partners and dedicated family liaison officers, we have and continue to support their welfare and to ensure their safeguarding going forward.\""
    },
    {
        "title": "Man weeps after being found guilty of stalking Dame Penny Mordaunt",
        "description": "A former councillor has been found guilty of stalking Dame Penny Mordaunt but acquitted of the more serious offence of stalking involving serious alarm or distress.",
        "url": "https://news.sky.com/story/man-weeps-after-being-found-guilty-of-stalking-dame-penny-mordaunt-13470530",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-edward-brandt-stalking_7082359.jpg?20251114220019",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-14 21:52:00",
        "Headline": "Dame Penny said in a statement to police that she \"feared sexual violence\" because of the defendant's \"creepy\" behaviour.",
        "Content": "A former councillor has been found guilty of stalking Dame Penny Mordaunt but acquitted of the more serious offence of stalking involving serious alarm or distress. A jury convicted Edward Brandt, 61, of the lesser charge by a majority of 10 to two following a trial at Southampton Crown Court. Brandt wept and held his hands over his face after he heard the verdicts. The court heard the former Conservative cabinet minister believed he was a \"real threat\" and feared \"sexual violence\". The trial was told that Brandt sent at least 17 emails and three phone messages to Ms Mordaunt, as well as turning up at her Portsmouth constituency office out of hours between 11 September 2023 and 12 May 2024. Brandt, who lived on the Isle of Wight at the time, failed to comply with the terms of a conditional caution issued in April 2024 which required him to complete a victim awareness course and not to contact Dame Penny, the trial heard. The divorced father-of-two, who now lives in Lymington, Hampshire, then left two voicemail messages for her on 6 and 10 May, and in one of the messages, he said: \"I am going to go on gently knocking at your door in order to shake your hand, I am not giving up.\" \n                  Penny Mordaunt 'threatened to pull out of TV debate' if she couldn't apologise for D-Day blunder\n                 \n                  Behind the scenes of the Tory government's fall from power - Part 2\n                 \n                  Behind the scenes of the Tory government's fall from power - Part 1\n                 Brandt, who worked as a professional sailor, was also made subject to an interim stalking protection order at Isle of Wight Magistrates' Court on 16 July 2024. Dame Penny said in a statement to police that she \"feared sexual violence\" because of the defendant's \"creepy\" behaviour. Judge William Mousley KC adjourned the case for a pre-sentence report to be prepared on Brandt, a former councillor for East Hampshire District Council, and released him on conditional bail until the sentencing hearing on 16 January. Read more from Sky News:Zarah Sultana is being 'sabotaged'Budget 2025: Income tax U-turn 'This man was a real threat' Dame Penny, who was emotional at times, told the court: \"I have been a parliamentarian for 14 years and during that time I have had to deal with all kinds of threats and issues. \"I have a lot of life experience and dealing with vulnerable people or people who are mentally unwell or strange in another way, and I believe this man was a real threat to me and still is.\" Explaining why he wanted to meet the Conservative Party leadership candidate, Brandt told the court: \"I wanted to commiserate with her for not getting the top job in the autumn, I think she would still have been prime minister if she had been. \"I wanted to congratulate her because she was a reforming leader of the Commons, I wanted to congratulate her on the coronation, chat to her about her time in office, have her sign a copy of her book. \"It was entirely political and entirely harmless.\" Brandt, who said that he had been diagnosed as having ADHD and being on the autism spectrum, said that he had not had responses from Dame Penny's office about his requests to meet her, and added: \"I wasn't getting a reply, I harmlessly kept trying.\""
    },
    {
        "title": "Man charged over allegedly wearing military uniform without permission on Remembrance Sunday",
        "description": "A man has been charged over allegedly dressing up as an admiral during a Remembrance Sunday event.",
        "url": "https://news.sky.com/story/man-charged-over-allegedly-wearing-military-uniform-without-permission-on-remembrance-sunday-13470336",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-admiral-remembrance_7082320.jpg?20251114215842",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-14 16:59:00",
        "Headline": "No subtitle found",
        "Content": "A man has been charged over allegedly dressing up as an admiral during a Remembrance Sunday event. Jonathan Carley, 64, from Harlech, Gwynedd, has been charged with wearing uniform/dress bearing the mark of His Majesty's Forces without permission. North Wales Police said they made an arrest on Friday after a man was seen wearing \"the uniform and medals of a high-ranking Navy officer\" during a wreath-laying service in Llandudno, Conwy county, on Sunday 9 November. He will appear at Caernarfon Magistrates' Court on December 11. Chief Inspector Trystan Bevan said: \"We understand that this incident has caused significant public concern, particularly given its occurrence on Remembrance Sunday. \"In response to the reports made to North Wales Police, officers have responded swiftly to make an arrest and proceed with charges. \"We urge members of the public to avoid online speculation and to refrain from sharing any content that could compromise future court proceedings.\""
    },
    {
        "title": "Nursery worker detained for 10 years for rape and sexual abuse",
        "description": "A nursery worker has been detained for 10 years for rape and sexual abuse against boys as young as three.",
        "url": "https://news.sky.com/story/nursery-worker-detained-for-10-years-for-rape-and-sexual-abuse-13470328",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-thomas-waller_7082215.jpg?20251114210632",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-14 16:37:00",
        "Headline": "The mother of one victim said Thomas Waller had used his \"skills\" to \"build trust with my son and then exploit him\", while the parent of another victim described his actions as \"premeditated and calculated\".",
        "Content": "A nursery worker has been detained for 10 years for rape and sexual abuse against boys as young as three. Warning: Readers may find details in this story distressing. Thomas Waller, 18, took advantage of his position to gain the trust of two boys in his care before exploiting them, Guildford Crown Court heard. The teenager from Farnham, Surrey, was working at a nursery and his responsibilities included taking children to the toilet and helping them get changed. Sentencing him on Friday, Judge Claire Harden-Frost said it was \"heartbreaking\" to see the victims' parents feeling responsible for what had happened. Waller was found guilty of rape, two counts of causing or inciting sexual activity and taking indecent photos after a trial at Staines Youth Court earlier this year. He was sentenced to 15 years at a young offender institution, of which he must serve 10 in detention and five on licence. In a victim impact statement, one parent said: \"This was not an accident. It was not a poor decision on the spur of the moment, it was premeditated and calculated. \"This man continually gave no comment. This man chose to deny everything. He has had every opportunity to plead guilty and express remorse, and he has chosen not to. He has demonstrated no accountability for his actions.\" Another father of a victim said his son had \"gathered a collection of memories that I would never wish on a human being\". He described Waller as \"cold, sinister and calculated\". He added, \"Tom cannot be allowed to do this again.\" Read more from Sky News:Burglar jailed for Banksy art theftCold weather alert issued in England Meanwhile, another mother told the court in a statement that Waller had used his \"skills\" to \"build trust with my son and then exploit him\". She added that \"beautiful, brave, clever son\" questioned his own guilt as a result of giving evidence at court. Speaking outside court, Detective Superintendent Kate Hyde said a \"dangerous man\" had been put behind bars. \"This deeply distressing case is every parent's worst nightmare, and I would like to pay tribute to the victims and their families for their resilience throughout this whole process. \"Their support and strength enabled us to secure convictions and put a dangerous man behind bars. \"I hope the fact he has been brought to justice for the crimes he has committed helps the families affected by his crimes to start to move forward with their lives,\" she added."
    },
    {
        "title": "Severe flood warning for 'significant risk to life' as large part of England put on cold weather alert",
        "description": "Two severe flood warnings have been issued, meaning a significant risk to life, as a&#160;large part of England is put on alert for cold weather from Monday.",
        "url": "https://news.sky.com/story/severe-flood-warning-for-significant-risk-to-life-as-large-part-of-england-put-on-cold-weather-alert-13470395",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-richmond-park-freezing_7082310.jpg?20251114202317",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-14 19:00:00",
        "Headline": "Five regions of England are being warned of a cold snap, as the UK Health Security Agency (UKHSA) says \"significant impacts are possible across health and social care services\".",
        "Content": "Two severe flood warnings have been issued, meaning a significant risk to life, as aÂ large part of England is put on alert for cold weather from Monday. Severe flooding is expected in southeast Wales on the River Monnow at Skenfrith and also at Osbaston, Monmouthshire, according to Natural Resources Wales. Check the weather forecast where you are The warning states that \"significant risk to life and significant disruption to the community is expected\", including the possibility of homes being flooded. \"Flood water could be deep and fast flowing and pose a risk to life,\" the statement adds. Dozens of flood warnings have also been issued across England. The warning has been issued as Storm Claudia brought amber weather warnings and torrential rain to large parts of the UK on Friday. Meanwhile, a yellow alert for cold weather has also been issued by the UK Health Security Agency (UKHSA). \n                  UK weather: Flood and 'do not travel' warnings issued as Storm Claudia arrives\n                 \n                  Mildest Bonfire Night on record as UK experiences 'humid' conditions\n                 \n                  Storm Benjamin to bring heavy rain and winds to parts of UK\n                 Significant impacts possible It affects five regions: East Midlands, West Midlands, North East, North West and Yorkshire and The Humber from 8am on Monday 17 November until 8am on Friday 21 November. The UKHSA warns that \"significant impacts are possible across health and social care services\" including a rise deaths among those aged 65 and over, or those with health conditions. The Met Office is forecasting that temperatures could fall below freezing in some areas of the UK next week. A month of rain in 24 hours Storm Claudia has brought heavy downpours and flooding with the Met Office warning some areas could see up to a month's worth of rain in 24 hours. There has also been travel disruption. Rail passengers are being told not to use Great Western trains between London Paddington and Bristol and South Wales because of flooding on the line. Their services between Exeter St Davids and Barnstaple are not running for the same reason. Avanti West Coast, Northern, CrossCountry, TransPennine Express, Transport for Wales and Chiltern are also reporting disruption or cancellations to their timetable. An amber weather warning had been in force on Friday for parts of Wales, along with large areas of central England and some parts of northern England. By 4pm on Friday, 81.8mm of rain was registered in Tafalog, Gwent - which is 60% of the monthly November average for the region. The storm, named by Spain's meteorological service, has triggered weather warnings in Spain and Portugal, and is affecting the Canary Islands. Ireland's meteorological service, Met Eireann, has also issued weather warnings, with significant rain likely in the southeast for Dublin, Wexford and Wicklow into Saturday morning. It warns that significant flooding is possible along with hazardous travel conditions. Meanwhile, a yellow weather warning for rain remains in place until 6am on Saturday, for most of Wales, as well as an area of England roughly south of York. Some areas could expect 30 to 50mm (1.2 to 2in) of rainfall widely, with 100mm (3.9in) for parts of southeast Wales. A separate yellow warning applies from midnight until noon on Saturday across Counties Down and Armagh in Northern Ireland. The Met Office warns that 10 to 20mm (0.4 to 0.8in) is expected fairly widely, with potentially in excess of 40mm (1.6in) over the Mourne mountains."
    },
    {
        "title": "Budget 2025 income tax U-turn: What the hell just happened?",
        "description": "What the hell's just happened?&#160;",
        "url": "https://news.sky.com/story/budget-2025-income-tax-u-turn-what-the-hell-just-happened-13470226",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-downing-street_7081988.jpg?20251114131243",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-11-14 12:57:00",
        "Headline": "The Labour Party will no doubt feel relief today that the chancellor is not going to break the manifesto. But the shambles this week is staggering.",
        "Content": "\n          Political editor\n              @BethRigby\n What the hell's just happened?Â  On Thursday night I was told that Chancellor Rachel Reeves and Prime Minister Sir Keir Starmer were now not going to raise income tax, having had anonymous briefings for weeks that a manifesto-breaking tax rise was coming, culminating in the speech in Downing Street by the chancellor last week alluding to that. Politics live: U-turn on budget income tax rise triggers 'not normal' market volatility I had also heard the prime minister was going to make a speech next week to the same effect. The U-turn - first broken in the Financial Times - was not something the government wanted to leak, and there is anger in Downing Street. I was told late last night by a source that the decision had been taken to back off income tax rises. There is obviously some consternation, to say the least, that ministers, the party, the public have been marched up the hill, only to be marched back down again. It all adds to a sense of chaos and a government out of control. So what on earth is going on? Read more: How No 10 plunged itself into crisis  Let's first do the economics of it. I was told this morning by Treasury sources that the fiscal forecasts from the Office of Budget Responsibility are stronger than expected. There had been expectations of a Â£30bn-Â£40bn black hole in the public finances. But I'm told today that black hole is actually closer to Â£20bn: the chancellor also wants headroom of perhaps up to Â£15bn, but I'm told the change in forecasts has changed the calculation. I'm told wage growth has been stronger which has helped tax receipts and improved forecasts. So, where does that leave the government? Treasury figures tell me that the change in forecasts mean the manifesto-busting income tax hike is now not necessary. I don't need to spell out the jeopardy for such a move: Rachel Reeves was poised to be the first chancellor in 50 years to raise the basic rate of income tax and break the core manifesto pledge that Labour made to voters last year. It doesn't mean taxes are not going up. The government is set to freeze tax thresholds for another two years from 2028. That will raise around Â£8bn as millions of workers are dragged into higher tax bands and end up paying more tax. There will also be tax raising around pensions and salary sacrifice schemes and on electric vehicles, as well as other measures, as the chancellor casts around for Â£20bn. But what about the politics? Well, one government figure today insists that the decision to drop the income tax plan is nothing to do with the self-inflicted leadership crisis at No 10 after anonymous briefings designed to see off any potential post-budget coup against the prime minister spectacularly backfired. The changed forecasts, I'm told, came in last week. ðŸ‘‰ Click here to listen to Electoral Dysfunction on your podcast app ðŸ‘ˆ But of course there's tonnes of politics in this. The talk of higher wage growth perhaps offsetting some of the productivity downgrades was being flagged a couple of weeks back, before the chancellor made her speech. It's extremely unusual for a chancellor to pitch-roll their budget. But Reeves did it for a reason. That was laying the ground for a massive budget that would bring manifesto-breaking tax rises. She told us of the difficult environment, ruled out more borrowing or spending cuts before telling us \"everyone must play their part\". She repeatedly refused to stick to manifesto promises on tax. It doesn't get much more stark than that. That the government has U-turned on that decision is about far more than just the fiscal framework. Read more: What taxes could go up now?  With trust so low in the government, there were serious worries - and warnings - from the party that such a big manifesto break might be something from which the PM and the chancellor wouldn't recover. One senior party figure that thinks there could be a leadership challenge after the May elections told me this week that manifesto-breaking tax rises would only make that more likely because Labour would \"need a clean skin\" to try and rebuild with the public if Starmer broke his promises in that way. Read more: Is Starmer 'in office but not in power'? Lucy Powell, the deputy Labour leader, fired a warning shot last week when she said the party should stick to the manifesto and not raise tax: \"We should be following through on our manifesto, of course. There's no question about that,\" she told Matt Chorley on BBC Radio 5 Live. \"Trust in politics is a key part of that because if we're to take the country with us then they've got to trust us and that's really important too.\" The party will no doubt feel relief today that the chancellor is not going to break the manifesto. It would have only made things a whole lot worse for a government that is in real trouble. But the shambles of this week is staggering. From the self-inflicted leadership crisis to leaks over a massive budget U-turn, it all lends to the sense that this is a No 10 out of control, lurching from one mess to another. Strap in."
    },
    {
        "title": "Trump calls for Epstein's 'ties' with Bill Clinton and other Democrats to be investigated",
        "description": "Donald Trump said he will ask the Justice Department to investigate Jeffrey Epstein's alleged ties to former US president Bill Clinton and other prominent Democrats.",
        "url": "https://news.sky.com/story/trump-calls-for-epsteins-ties-with-bill-clinton-and-other-democrats-to-be-investigated-13470363",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bill-clinton-new-york_7030552.jpg?20250924162215",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-14 18:08:00",
        "Headline": "It comes as fresh questions about Mr Trump's own relationship with the paedophile financier were raised as his name came up multiple times in a trove of Epstein emails published earlier this week.",
        "Content": " Donald Trump said he will ask the Justice Department to investigate Jeffrey Epstein's alleged ties to former US president Bill Clinton and other prominent Democrats. The call from the US president comes as fresh questions about Mr Trump's own relationship with the paedophile financier were raised as his name came up multiple times when 20,000 pages were released from Epstein's files earlier this week. Mr Trump has called claims to link him to Epstein as a \"hoax\". Mr Trump said he would ask US Attorney General Pamela Bondi to look into any alleged involvement between former Democrat leader Clinton and paedophile financier Epstein. She later wrote on X that she would assign the investigation to Jay Clayton, the US attorney for the Southern District of New York. Along with Mr Clinton, Mr Trump said he would also ask the Justice Department to investigate former treasury secretary Larry Summers, and Reid Hoffman, the LinkedIn founder, who is also a prominent Democratic donor. Read more:Who appears in the new Epstein files?Why this is dangerous terrain for TrumpWhat do Epstein documents say about Trump and Andrew? All three men were mentioned in the 20,000 Epstein-related documents released by the House Oversight Committee on Wednesday. None of them, however, have been accused of wrongdoing in the Epstein case. In a lengthy post on his social media platform Truth Social, Mr Trump said: \"Now that the Democrats are using the Epstein Hoax, involving Democrats, not Republicans, to try and deflect from their disastrous SHUTDOWN, and all of their other failures, I will be asking A.G. Pam Bondi, and the Department of Justice, together with our great patriots at the FBI, to investigate Jeffrey Epstein's involvement and relationship with Bill Clinton, Larry Summers, Reid Hoffman, J.P. Morgan, Chase, and many other people and institutions, to determine what was going on with them, and him.\" \n                  Donald Trump confirms he will sue the BBC over Panorama edit - despite broadcaster's apology\n                 \n                  Union demands Sir Robbie Gibb's removal from BBC board to defend 'political impartiality'\n                 \n                  'The dog that hasn't barked': Trump, Epstein, and the emails\n                 Mr Trump also said: \"Epstein was a Democrat, and he is the Democrat's problem, not the Republican's problem! \"They all know about him, don't waste your time with Trump. I have a Country to run!\" What do the named parties say about alleged links to Epstein? Angel Urena, deputy chief of staff for Mr Clinton, said in 2019: \"President Clinton knows nothing about the terrible crimes Jeffrey Epstein pleaded guilty to in Florida some time ago, or those with which he has been recently charged in New Yorkâ€¦has never been to Little St James Island, Epstein's ranch in New Mexico, or his residence in Florida.\" Epstein had been a JPMorgan client from 1998 until 2013. \"The firm deeply regrets any association with this man, and would never have continued doing business with him if it believed he was using the bank in any way to commit his heinous crimes,\" JPMorgan said in a statement in September 2023. Summers, former Harvard University president, recently issued a statement saying he has \"great regrets in my life.\" \"As I have said before, my association with Jeffrey Epstein was a major error of judgement,\" the statement said. Similarly, Mr Hoffman told Axios in 2019 he regretted his relationship with Epstein. \"My few interactions with Jeffrey Epstein came at the request of Joi Ito, for the purposes of fundraising for the MIT Media Lab. \"Prior to these interactions, I was told by Joi that Epstein had cleared the MIT vetting process, which was the basis for my participation. \"My last interaction with Epstein was in 2015. Still, by agreeing to participate in any fundraising activity where Epstein was present, I helped to repair his reputation and perpetuate injustice. For this, I am deeply regretful.\""
    },
    {
        "title": "A US man is believed to be the first to have died from a meat allergy linked to tick bites",
        "description": "A 47-year-old New Jersey man died last year from alpha-gal syndrome, a red meat allergy caused by a tick bite. ",
        "url": "https://news.sky.com/story/a-us-man-is-believed-to-be-the-first-to-have-died-from-a-meat-allergy-linked-to-tick-bites-13470460",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-steak-meat-flat-iron_6926532.jpg?20250525074436",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-14 20:37:00",
        "Headline": "The 47-year-old pilot died last year in what researchers believe is the first documented death of its kind.",
        "Content": "A 47-year-old New Jersey man died last year from alpha-gal syndrome, a red meat allergy caused by a tick bite.  His death is believed to be the first documented death from a meat allergy triggered by tick bites. Symptoms for alpha-gal syndrome - which in 2011 was first linked to bites from the Lone Star tick - can include hives, nausea, vomiting, diarrhoea, severe stomach pain, difficulty breathing, dizziness and swelling of the lips, throat, tongue or eyelids. The reaction to the foods that cause the symptoms can be delayed, and usually present themselves a few hours later, unlike some other food allergies, which occur soon after eating. The new research follows the case of a healthy airline pilot who went camping in 2024 with his wife and children. They had steak for supper. This was unusual, as he rarely ate meat. He woke at 2am with violent pain in his abdomen, vomiting and diarrhoea. The next day he ate breakfast and went on a five-mile walk. \n                  Police pantomime and migrants shopping for life jackets: Inside the route to the Channel\n                 \n                  Ukraine war latest: Russia accused of 'scorched earth' tactic - as Moscow's ambassador confronted in Romania\n                 \n                  Trump calls for Epstein's 'ties' with Bill Clinton and other Democrats to be investigated\n                 A fortnight later, back in New Jersey, he went to a barbecue, where he ate a hamburger. About four hours later, he grew ill. Shortly afterwards, his son found him on the bathroom floor unconscious. His son called paramedics, and he was admitted to hospital, but the man was announced dead later that night. Blood tests conducted by researchers revealed evidence of the alpha-gal syndrome. Proof that it came from a Lone Star tick is inconclusive. The researchers made the link after a statement from the man's wife, who had said he had 12 or 13 \"chigger\" bites near his ankles earlier in the summer. But the conclusion makes sense, as people in eastern America sometimes mistake the bites from mites with those from larval ticks. More than 100,000 people in the U.S. have become allergic to red meat since 2010 because of the syndrome, according to one estimate. Read more:Spending on special needs provision could push councils to breaking pointKing cuts birthday cake with a little help from the Queen Dr Scott Commins, a leading alpha-gal syndrome researcher at the University of North Carolina, called his death an \"unmitigated tragedy\". \"Totally unnecessary and with increased awareness, this won't happen again,\" he said in an email."
    },
    {
        "title": "High Court rules company liable for Brazil dam collapse - the country's worst environmental disaster",
        "description": "A judge has ruled that a company can be held liable for a dam collapse which devastated indigenous communities in Brazil and became the country's worst environmental catastrophe.",
        "url": "https://news.sky.com/story/high-court-rules-company-liable-for-brazil-dam-collapse-the-countrys-worst-environmental-disaster-13470079",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-mariana-dam-mariana_7081665.jpg?20251114065520",
        "type": "World",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-11-14 09:40:00",
        "Headline": "The 2015 Fundao Dam collapse - also known as the Mariana dam disaster - resulted in flooding that devastated two nearby villages. The case was brought in the UK as company BHP was listed on the London Stock Exchange at the time of the collapse.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n A judge has ruled that a company can be held liable for a dam collapse which devastated indigenous communities in Brazil and became the country's worst environmental catastrophe. At the High Court in London, Judge Finola O'Farrell ruled that mining giant BHP should not have continued to raise the height of the Fundao Dam before its collapse. This, she ruled, was \"a direct and immediate cause\" of the disaster. BHP said immediately after that it would appeal the decision. The case was brought in British courts because BHP was listed on the London Stock Exchange at the time of the collapse. Brought by the international law firm Pogust Goodhead on behalf of hundreds of thousands of victims, the claim marks the first time any of the mining companies behind the dam have been held legally responsible for the disaster. The dam's collapse released approximately 40 million tons of toxic sludge, including arsenic, which spread 370 miles along the Doce River and out to sea. In total, 19 people died, while hundreds of homes were destroyed. The case has become the largest environmental group action in English legal history, representing a significant milestone for holding corporations accountable and advancing environmental justice. Gelvana Rodrigues da Silva, who lost her seven-year-old son Thiago in the flood, said in a statement: \"Finally, justice has begun to be served, and those responsible have been held accountable for destroying our lives.\" One of the largest civil claims ever in England The Fundao Dam near the city of Mariana was operated by Samarco, a joint venture between BHP and Brazilian company Vale. Its collapse happened almost 10 years ago to the day. With 620,000 claimants, the case is one of the largest civil claims ever lodged in England and Wales. Brazil is currently hosting the COP30 climate summit in the Amazonian city of Belem, aiming to position itself as a climate leader and champion of indigenous rights. Shirley Djukurna Krenak, an indigenous leader whose community has lived for generations along the Doce River, said the summit is removed from the realities faced by indigenous peoples, and full of \"greenwashing\" and false promises. \"If all the previous COPs had worked, we wouldn't still be talking about crimes like this,\" she said. Read more from Sky News:Starmer and Reeves ditch plans to raise income taxDoctors in England begin five-day strike  In October 2024, Brazil's government and the states of Minas Gerais and Espirito Santo signed a 132bn Brazilian real (Â£20bn) compensation settlement with Samarco, Vale and BHP, to fund social and environmental repairs. BHP had argued that the court case in Britain duplicates other legal proceedings and reparations work. Reacting to Friday's judgment, the company said that settlements in Brazil would reduce the size of the London lawsuit by about half. Vale, the co-owner of the company operating the dam, announced after the verdict that it estimated an additional expense of about $500m (Â£381m) in its 2025 financial statements to cover obligations linked to the disaster. A second trial to determine the damages BHP is liable to pay is due to begin in October 2026. How the Mariana dam disaster unfolded On 5 November 2015, the Fundao tailings dam collapsed in Minas Gerais, Brazil. It released approximately 40 million tons of toxic sludge, including arsenic, which buried the small town of Bento Rodrigues and poured pollution into the Doce River. The mud travelled so quickly that residents did not have time to escape, and it killed 19 people. Around 600 people lost their homes. The toxic waste made its way to the Atlantic Ocean, destroying water supplies, vehicles, habitats, livestock and livelihoods. Ten years later, reconstruction and reparations have dragged on through legal disputes, and the indigenous Krenak people are still struggling to live along the Doce River that remains contaminated with heavy metals."
    },
    {
        "title": "Several dead or injured after being hit by bus in Stockholm",
        "description": "Several people have been hit by a bus in Sweden's capital of Stockholm, according to local police.",
        "url": "https://news.sky.com/story/several-people-injured-or-killed-after-being-hit-by-bus-in-stockholm-13470293",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-stockholm-sweden_7082139.jpg?20251114155723",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-14 15:32:00",
        "Headline": "Police say there are both \"injured and deceased\" in the incident on Valhallavagen street, near the University of Technology.",
        "Content": "Several people have been hit by a bus in Sweden's capital of Stockholm, according to local police. Police say there are both \"injured and deceased\" in the incident on Valhallavagen street, close to the city's University of Technology. Swedish media reported several fatalities, however police have not confirmed any numbers. According to Reuters, the vehicle hit a bus stop in central Stockholm. The cause of the crash is not yet known. In a statement, police said: \"At this time, the police are not commenting on the number, gender or ages of those affected.\" It added: \"Police, rescue services and ambulance are working at the scene and due to the operation, Valhallavagen is closed between Odengatan and Engelbrektsgatan.\" A spokesperson for Stockholm's rescue services said six people were affected by the incident. The spokesperson said there were no passengers on the bus at the time. The scene has been cordoned off, police added. \"It is being investigated as involuntary manslaughter. \"The bus driver has been arrested but that is routine in such an incident,\" a police spokesperson said, adding they had no information pointing to it being an attack. Prime Minister Ulf Kristersson said in a post on X: \"We do not yet know the cause of this, but right now my thoughts are foremost with those who have been affected and their families.\" This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Former Spanish football boss who kissed player without consent pelted with eggs",
        "description": "The former head of Spain's football federation was pelted with eggs thrown by his own uncle as he released a memoir detailing his fall from grace after kissing a female player.",
        "url": "https://news.sky.com/story/former-spanish-football-boss-who-kissed-player-without-consent-pelted-with-eggs-13470160",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-luis-rubiales-spain_7081913.jpg?20251114114553",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-14 10:42:00",
        "Headline": "Luis Rubiales kissed Jenni Hermoso against her wishes during the 2023 Women's World Cup medal ceremony. She later said in court that he had 'stained one of the happiest days' of her life.",
        "Content": "The former head of Spain's football federation was pelted with eggs thrown by his own uncle as he released a memoir detailing his fall from grace after kissing a female player. Luis Rubiales was forced to quickly spin away to avoid at least two of the eggs, with one splattering on a screen nearby. Mr Rubiales told reporters: \"A man entered, who I later saw was my uncle, who is a troubled man, and always has been. \"He had some eggs and threw some at me, but I didn't know what he had in his hands, and when I first saw him I thought he might be carrying a weapon.\" When targeted, he was launching his book, Matar A Rubiales (Killing Rubiales) - a 500-page account of his professional demise. The ex-boss's woes began when he kissed Spanish forward Jenni Hermoso, the team's captain, during the 2023 Women's World Cup awards ceremony after she and her teammates had won the tournament. Video footage of the incident, in which Mr Rubiales grabs her head and kisses her on the lips, sparked outrage. \n                  Sir Keir Starmer expresses 'sincere regret' over appointment of Labour donor to chair football regulator\n                 \n                  Football fans infiltrated tightly-controlled derby clash disguised as stewards\n                 \n                  Over 1,000 players suspended in widening Turkish football betting investigation\n                 Ms Hermoso insisted she had not given permission for the kiss and that Mr Rubiales had \"stained one of the happiest days\" of her life and \"disrespected\" her. Mr Rubiales has always denied he kissed Ms Hermoso without her consent. Read more from Sky News:Three dead and 15 injured in Tenerife tidal surgeStranded Chinese astronauts return to Earth He eventually stepped down under immense pressure from the government, football officials, women players and fans. Earlier this year, he was found guilty of sexual assault for the unsolicited kiss by a Spanish court, fined â‚¬10,800 (Â£9,206) and banned from going within 200m of Ms Hermoso or contacting her for one year. He later lost an appeal against the conviction. The court said he had managed to restrain himself when interacting with other players and \"could also have done so, without too much effort, with the captain\". In Matar A Rubiales, according to its publisher, the former football federation boss claims to have been the victim of a \"conspiracy of different powers of Spanish public life\", including the government and \"the profitable world of feminism\"."
    },
    {
        "title": "Police shoot and wound man with knife at Paris train station",
        "description": "French police shot and wounded a man carrying a knife at a train station in Paris, the city's prosecutor's office has said.",
        "url": "https://news.sky.com/story/police-shoot-and-wound-man-with-knife-at-paris-train-station-13470274",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-france-evacuation-paris_7082043.jpg?20251114141408",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-14 14:44:00",
        "Headline": "The man was shot in the legs and then inflicted knife wounds on himself in incident at Montparnasse station.",
        "Content": "French police shot and wounded a man carrying a knife at a train station in Paris, the city's prosecutor's office has said. The man was shot in the legs and then inflicted knife wounds on himself, according to the prosecutor's office. The incident took place at Montparnasse station in the French capital, the city's prosecutor officer said in a statement. The man was \"known for domestic violence\", the statement added. A police source told Reuters the man had threatened his wife and children in a Paris suburb before taking a train destined for Montparnasse, where police were waiting for him. When officers confronted him, he threatened to kill himself and was then shot, the source added. The prosecutor's office said at least one gunshot was heard. A witness told Reuters they heard several shots. A Reuters photographer at the station said the police intervention caused a crowd surge through the concourse. Read more from Sky News:Epstein calls Trump 'dangerous' in released emailStranded ship carrying nearly 3,000 cattle now at sea for 55 days Police evacuated the station, which serves suburban commuter routes as well as high-speed trains to the country's west and southwest. Another witness told BFM TV he heard a loud bang before panic broke out. \"It took me two or three seconds to realise what was happening. People started saying: 'We have to get out of here, we have to leave quickly,' so that got my heart racing and I got up and ran,\" the witness said."
    },
    {
        "title": "Former heavyweight world champion Joseph Parker tests positive for cocaine",
        "description": "Former heavyweight world champion Joseph Parker could face up to a two-year ban from boxing after testing positive for cocaine.",
        "url": "https://news.sky.com/story/former-heavyweight-world-champion-joseph-parker-tests-positive-for-cocaine-13470238",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-joseph-parker_7082114.jpg?20251114153706",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-14 13:21:00",
        "Headline": "Details of the failed test, taken on the day the New Zealander lost to Briton Fabio Wardley, only emerged on Friday and cast serious doubt over the boxerâ€™s future in the sport.",
        "Content": "Former heavyweight world champion Joseph Parker could face up to a two-year ban from boxing after testing positive for cocaine. Traces of the drug were discovered in a routine test given to the Voluntary Anti-Doping Agency, a source has confirmed to Sky Sports News. The test was conducted on 25 October - the day the 33-year-old New Zealander lost to Britain's Fabio Wardley. Details of Parker's failed test only became available on Friday, and Sky Sports News has since contacted Parker's manager for comment. Frank Warren's Queensbury Promotions said in a statement on X: \"The Voluntary Anti-Doping Association [VADA] last night informed all required parties that Joseph Parker returned an adverse finding following an anti-doping test conducted on October 25 in relation to his bout with Fabio Wardley. \"While the matter is investigated further, no additional comment will be made at this time.\" Parker went into the fight against Wardley in arguably the best form of his career, according to Sky Sports News. Read more from Sky News:Ariana Grande rushed by red carpet intruder at premiereFlood and 'do not travel' warnings issued as storm arrives After his 2022 defeat to Joe Joyce, Parker went on a six-fight winning streak before facing Wardley, securing notable victories over Deontay Wilder and Zhilei Zhang and claiming the WBO interim title. He lost his world champion belt to Anthony Joshua in 2018. Parker was due to face then-IBF champion Daniel Dubois in February, but Dubois fell ill just days before the fight. He risked his status as the WBO mandatory challenger to undisputed champion Oleksandr Usyk by accepting the fight with Wardley. "
    },
    {
        "title": "Stranded Chinese astronauts return to Earth after space capsule damaged",
        "description": "Three Chinese astronauts have successfully returned to Earth from their nation's space station after their capsule was damaged.",
        "url": "https://news.sky.com/story/stranded-chinese-astronauts-return-to-earth-after-space-capsule-damaged-13470140",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-shenzhou-chen-zhongrui_7082008.jpg?20251114133253",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-14 09:47:00",
        "Headline": "The men landed in a remote site in the Gobi Desert in Asia on Friday after their journey home from a six-month rotation at the Tiangong space station was delayed due to a possible collision with tiny particles of space debris.",
        "Content": "Three Chinese astronauts have successfully returned to Earth from their nation's space station after their capsule was damaged. The team deployed a red and white striped parachute as they descended, before landing at a remote site in the Gobi Desert in Asia on Friday. The astronauts - Chen Dong, Chen Zhongrui and Wang Jie - had been due to return on 5 November to end their six-month rotation at the Tiangong space station. However, their journey back was delayed by nine days because the Shenzhou-20 return capsule they were due to travel in was found to have tiny cracks. These were most likely caused by the impact of space debris hitting the craft, China's space agency said. There are millions of pieces of mostly tiny particles that circle the Earth at speeds faster than a bullet. They can come from launches and collisions and pose a risk to satellites, space stations and the astronauts who operate outside them. With the Shenzhou-20 out of action, the crew - who travelled to the space station in April - used a Shenzhou-21 craft instead, which had brought a three-person replacement crew to the station. The Chinese space agency said the stranded taikonauts - the Chinese word for astronauts - had remained in good condition throughout. The first module of the Tiangong, which means \"Heavenly Palace\", was launched by the Chinese state in 2021. It is smaller than the International Space Station, from which Beijing is blocked, due to US national security concerns. China's space programme has developed steadily since 2003. Read more:NASA cancels space launchJeff Bezos's rocket lands on Earth In a long term plan to advance its orbital capabilities, China plans to land a person on the moon by 2030 and has already explored Mars with a robotic rover. The Asian nation's latest space mission brought four mice to study how weightlessness and confinement would affect them. An engineer from the Chinese Academy of Sciences said the study will help master key technologies for breeding and monitoring small mammals in space."
    },
    {
        "title": "Stranded ship carrying nearly 3,000 cattle now at sea for 55 days",
        "description": "A stranded ship carrying nearly 3,000 cattle from Uruguay to Turkey has now been at sea for 55 days, according to the vessel-tracking website MarineTraffic.",
        "url": "https://news.sky.com/story/stranded-ship-carrying-nearly-3000-cattle-now-at-sea-for-55-days-13470146",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-cattle-at-sea-ship-cattle_7081829.jpg?20251114101618",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-14 10:09:00",
        "Headline": "The Togo-flagged Spiridon II remains off Bandirma, Turkey, after authorities reportedly denied it entry over ear-tag discrepancies, with at least 58 animals said to be dead",
        "Content": "A stranded ship carrying nearly 3,000 cattle from Uruguay to Turkey has now been at sea for 55 days, according to the vessel-tracking website MarineTraffic. 5The Togo-flagged Spiridon II carrier departed the port of Montevideo, the capital city, on 20 September and arrived outside Bandirma, Turkey, on 22 October, where it took on supplies on 8 November. But local media said the ship soon returned to sea to drop anchor, after Turkish authorities denied it entry due to discrepancies in cattle ear-tag records. As such, the vessel has been unable to offload its cargo and remains in the area awaiting clearance, with animal welfare organisations expressing growing concerns about the animals on board. The Germany-based Animal Welfare Foundation has said that at least 58 cattle have reportedly died. \"It is still unclear what will happen to the cattle, which appear to be pregnant heifers,\" the charity said in a statement on its website, calling on Turkish authorities \"to immediately unload the animals to prevent further suffering\". The charity said that 140 of the heifers reportedly gave birth, and that 50 newborn calves were \"detected\", but it was unclear if all the calves were alive. \n                  Police pantomime and migrants shopping for life jackets: Inside the route to the Channel\n                 \n                  Ukraine war latest: Russia accused of 'scorched earth' tactic - as Moscow's ambassador confronted in Romania\n                 \n                  Trump calls for Epstein's 'ties' with Bill Clinton and other Democrats to be investigated\n                 The whereabouts of the other 90 calves is \"unknown,\" the charity said. The charity has said that although the case doesn't involve EU animals, it has formally appealed to the European Commission to intervene and \"take all possible diplomatic and technical steps to enable the immediate unloading of the surviving cattle.\" Even if only animals with proper identification could be unloaded at first, it would ease overcrowding and give the remaining animals improved access to limited resources, the charity said. \"After the long journey from Uruguay to Turkey, the animals are already weakened. Every further delay means massive suffering,\" the charity's project manager, Dr Maria Boada SaÃ±a, said. The Spiridon II mainly transports animals from South America to the Middle East and no longer has a permit to load animals in European ports, according to the Animal Welfare Foundation."
    },
    {
        "title": "Ariana Grande rushed by red carpet intruder at premiere of Wicked: For Good",
        "description": "Video footage has shown the moment singer and actress Ariana Grande was accosted by a fan at a film premiere.",
        "url": "https://news.sky.com/story/ariana-grande-rushed-by-red-carpet-intruder-at-premiere-of-wicked-for-good-13470136",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ariana-grande-wicked_7081816.jpg?20251114100520",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-14 09:35:00",
        "Headline": "The singer and actress was in Singapore for the film's debut when the incident unfolded on Thursday.",
        "Content": " Video footage has shown the moment singer and actress Ariana Grande was accosted by a fan at a film premiere. Grande was in Singapore for the debut of Wicked: For Good when the incident unfolded on Thursday. The video captured the moment the fan scaled the barricade and pushed past photographers towards Grande. He then threw his arms around her, before co-star Cynthia Erivo intervened and security swoops in to stop him. The man, now identified as Johnson Wen, 26, is reportedly a notorious red carpet crasher. Wen, who has since been charged with being a public nuisance, goes by the nickname Pyjama Man, and gloated as he shared footage of the intrusion online. \"Dear Ariana Grande, Thank You for letting me Jump on the Yellow Carpet with You,\" he wrote on Instagram. \n                  MTV VMAs in pictures: Lady Gaga, Ariana Grande and Sabrina Carpenter triumph as tribute paid to Ozzy Osbourne\n                 \n                  Oscars red carpet 2025: All the best looks from the nominees and guests\n                 \n                  Oscars 2025 predictions: Who will win and who should win?\n                 In video stories posted to the site beforehand, he was seen at the Universal Studios venue, revealing his intentions. In one, he said: \"I feel like I'm in a dream, that's my best friend, Ariana Grande, and I'm gonna meet her. I've been dreaming about that.\" Read more:When you should actually arrive at cinema to avoid adsTV and film's obsession with upper-class actors The Australian has ambushed several performers on stage, according to reports, including Katy Perry and The Chainsmokers at concerts in Sydney, and The Weeknd in Melbourne. It has been reported that Wen intends to plead guilty and that he could face a fine of more than Â£1,000. Grande took a moment to gather herself in the aftermath of the intrusion, visibly shocked by the incident. She didn't address the incident on her own Instagram, but shared some photos with the caption \"thank you, Singapore\", adding \"we love you\". The singer battled post-traumatic stress disorder after her 2017 concert in Manchester was bombed, leaving 22 people dead. She told Vogue in 2018: \"It's hard to talk about because so many people have suffered such severe, tremendous loss. But, yeah, it's a real thing. \"I know those families and my fans, and everyone there experienced a tremendous amount of it as well. Time is the biggest thing. \"I feel like I shouldn't even be talking about my own experience - like I shouldn't even say anything. I don't think I'll ever know how to talk about it and not cry.\" In the same interview she also addressed her own anxiety, saying she has \"always\" had it. Grande plays Galinda Upland in Wicked: For Good, the character who becomes Glinda the Good Witch. Ms Erivo plays Elphaba, the character who becomes the Wicked Witch of the West. The film is released in UK cinemas on 21 November."
    },
    {
        "title": "Telegraph future in limbo again as RedBird abandons Â£500m deal",
        "description": "The future ownership of the Daily Telegraph has been plunged back into crisis after RedBird Capital Partners abandoned its proposed &#163;500m takeover.",
        "url": "https://news.sky.com/story/telegraph-future-in-limbo-again-as-redbird-abandons-163500m-deal-13470211",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-daily-telegraph-newspaper_6774322.jpg?20241212171804",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-14 12:32:00",
        "Headline": "RedBird has confirmed a Sky News report that it has withdrawn its Â£500m bid to buy the right-leaning newspaper titles.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n  The future ownership of the Daily Telegraph has been plunged back into crisis after RedBird Capital Partners abandoned its proposed Â£500m takeover. Sky News has learnt that a consortium led by RedBird and including the UAE-based investor IMI has formally withdrawn its offer to buy the right-leaning newspaper titles. In a statement issued to Sky News, a RedBird Capital Partners spokesman confirmed: \"RedBird has today withdrawn its bid for the Telegraph Media Group. \"We remain fully confident that the Telegraph and its world-class team have a bright future ahead of them and we will work hard to help secure a solution which is in the best interests of employees and readers.\" Money blog: Apple launches Â£220 iPhone 'sock' The move comes nearly two-and-a-half years after the Telegraph's future was plunged into doubt when its lenders seized control from the Barclay family, its long-standing proprietors. RedBird IMI then extended financing which gave it a call option to own the newspapers, but its original proposal was thwarted by objections to foreign state ownership of British national newspapers. A new deal was then stitched together which included funding from Daily Mail owner Lord Rothermere and Sir Leonard Blavatnik, the billionaire owner of sports streaming platform DAZN. Under that deal, Abu Dhabi-based IMI would have taken a 15% stake in Telegraph Media Group. Read more from Sky News:Lloyds clinches Â£120m deal for digital wallet provider CurveStarmer and Reeves in U-turn over income tax'Staggering' 20-year fall in domestic UK flights In recent weeks, RedBird principal Gerry Cardinale had reiterated his desire to own the titles despite apparently having been angered by reporting by Telegraph journalists which explored links between RedBird and Chinese state influences. Unrest from the Telegraph newsroom is said to have been one of the main factors in RedBird's decision to withdraw its offer. The collapse of the deal means a further auction of the titles is now likely to take place in the new year."
    },
    {
        "title": "Direct cost of Jaguar Land Rover cyber attack which impacted UK economic growth revealed",
        "description": "The cyber attack on Jaguar Land Rover (JLR), which halted production for nearly six weeks at its sites, cost the company roughly &#163;200m, it has been revealed.",
        "url": "https://news.sky.com/story/direct-cost-of-jaguar-land-rover-cyber-attack-which-impacted-uk-economic-growth-revealed-13470193",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jaguar-land-rover_7014411.jpg?20250908133052",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-11-14 11:43:00",
        "Headline": "The production pause was a large contributor to the contraction in economic growth in September, which a company executive said was \"interesting to hear\".",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The cyber attack on Jaguar Land Rover (JLR), which halted production for nearly six weeks at its sites, cost the company roughly Â£200m, it has been revealed. Latest accounts released on Friday showed \"cyber-related costs\" were Â£196m, which does not include the fall in sales. Profits took a nose dive, falling from nearly Â£400m (Â£398m) a year ago to a loss of Â£485m in the three months to the end of September. Money blog: Apple launches Â£220 iPhone 'sock' today - fans are divided Revenues dropped nearly 25% and the effects may continue as the manufacturing halt could slow sales in the final three months of the year, executives said. The impact of the shutdown also hit factories across the car-making supply chain. Slowing the UK economy The production pause was a large contributor to a contraction in UK economic growth in September, official figures showed. Had car output not fallen 28.6%, the UK economy would have grown by 0.1% during the month. Instead, it fell by 0.1%.  Read more from Sky News:Telegraph future in limbo again as RedBird abandons Â£500m deal Reacting to JLR's impact on the GDP contraction, its chief financial officer, Richard Molyneux, said it was \"interesting to hear\" and it \"goes to reinforce\" that JLR is really important in the UK economy. The company, he said, is the \"biggest exporter of goods in the entire country\" and the effect on GDP \"is a reflection of the success JLR has had in past years\". Recovery The company said operations were \"pretty much back running as normal\" and plants were \"at or approaching capacity\". Production of all luxury vehicles resumed. Investigations are underway into the attack, with law enforcement in \"many jurisdictions\" involved, the company said. When asked about the cause of the hack and the hackers, JLR said it was not in a position to answer questions due to the live investigation. A run of attacks  The manufacturer was just one of a number of major companies to be seriously impacted by cyber criminals in recent months.  High street retailer Marks and Spencer estimated the cost of its IT outage was roughly Â£136m. The sum only covers the cost of immediate incident systems response and recovery, as well as specialist legal and professional services support. The Co-Op and Harrods also suffered service disruption caused by cyber attacks. Four people were arrested by police investigating the incidents."
    },
    {
        "title": "Lloyds clinches Â£120m deal for digital wallet provider Curve",
        "description": "Britain's biggest high street lender has struck a &#163;120m deal to buy Curve, the digital wallet provider, despite recriminations from shareholders about the distribution of the sale proceeds.",
        "url": "https://news.sky.com/story/lloyds-clinches-163120m-deal-for-digital-wallet-provider-curve-13470132",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-lloyds-bank_6531355.jpg?20240424072847",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-14 09:31:00",
        "Headline": "Lloyds Banking Group has formally signed a controversial agreement to acquire Curve, which had ambitions to become one of the UK's most prominent fintech champions, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Britain's biggest high street lender has struck a Â£120m deal to buy Curve, the digital wallet provider, despite recriminations from shareholders about the distribution of the sale proceeds. Sky News has learnt Curve notified its investors this week that it had signed a share sale and purchase agreement with Lloyds Banking Group. An announcement is expected as early as next week. Money blog: Apple launches Â£220 iPhone 'sock' In the circular to shareholders, Curve said: \"We recognise that the value of this transaction falls short of the ambitions we all held for Curve, and we share the disappointment some of you may have in this outcome. \"Yet, the board strongly believes this transaction represents the best available path forward for Curve's creditors and shareholders as a whole.\" Since the talks about a sale to Lloyds emerged in the summer, Sky News has reported the fury of some early Curve investors about the price and the proposed distribution of proceeds. In a statement issued on Friday morning, IDC Ventures, its biggest external shareholder with a 12% stake, said it remained \"deeply concerned about the conduct of Curve's management and board during the current sale process\". \"Issues regarding the company's governance and ownership are disputed, and IDC is reserving all legal rights pending further developments,\" it said. \"It is a matter of real surprise to shareholders that Lloyds Banking Group, a leading UK institution, would contemplate proceeding with a transaction that IDC believes in not in the best interests of the company or its shareholders. \"As such, IDC does not intend to support the proposed sale and does not believe that it is capable of being implemented without its support. \"IDC expects the board and any prospective purchasers to act responsibly and transparently, and will take all necessary steps to protect shareholder interests if those obligations are ignored.\" Efforts to remove Lord Fink, the City grandee who chairs Curve, and Shachar Bialick, the fintech's founder and chief executive, as directors of the company were voted down at a shareholder meeting early last month. IDC Ventures, which has appointed the London law firm Quinn Emanuel to advise it on the situation, first invested in Curve six years ago and has participated in or led several funding rounds for the company. Read more from Sky News:Starmer and Reeves in U-turn over income tax'Staggering' 20-year fall in domestic UK flights  Mr Bialick has previously acknowledged that the sale price was disappointing, and warned that the company would probably run out of money this year unless a sale to Lloyds was agreed. In total, Curve is understood to have raised at least Â£250m in funding since it was established. Lloyds hopes that buying Curve will give it an edge in the race to build smarter online payments systems amid growing pressure on Apple to open its payment services to rivals. Curve did not respond to an emailed request for comment on Friday."
    },
    {
        "title": "Budget 2025 income tax U-turn: What the hell just happened?",
        "description": "What the hell's just happened?&#160;",
        "url": "https://news.sky.com/story/budget-2025-income-tax-u-turn-what-the-hell-just-happened-13470226",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-downing-street_7081988.jpg?20251114131243",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-11-14 12:57:00",
        "Headline": "The Labour Party will no doubt feel relief today that the chancellor is not going to break the manifesto. But the shambles this week is staggering.",
        "Content": "\n          Political editor\n              @BethRigby\n What the hell's just happened?Â  On Thursday night I was told that Chancellor Rachel Reeves and Prime Minister Sir Keir Starmer were now not going to raise income tax, having had anonymous briefings for weeks that a manifesto-breaking tax rise was coming, culminating in the speech in Downing Street by the chancellor last week alluding to that. Politics live: U-turn on budget income tax rise triggers 'not normal' market volatility I had also heard the prime minister was going to make a speech next week to the same effect. The U-turn - first broken in the Financial Times - was not something the government wanted to leak, and there is anger in Downing Street. I was told late last night by a source that the decision had been taken to back off income tax rises. There is obviously some consternation, to say the least, that ministers, the party, the public have been marched up the hill, only to be marched back down again. It all adds to a sense of chaos and a government out of control. So what on earth is going on? Read more: How No 10 plunged itself into crisis  Let's first do the economics of it. I was told this morning by Treasury sources that the fiscal forecasts from the Office of Budget Responsibility are stronger than expected. There had been expectations of a Â£30bn-Â£40bn black hole in the public finances. But I'm told today that black hole is actually closer to Â£20bn: the chancellor also wants headroom of perhaps up to Â£15bn, but I'm told the change in forecasts has changed the calculation. I'm told wage growth has been stronger which has helped tax receipts and improved forecasts. So, where does that leave the government? Treasury figures tell me that the change in forecasts mean the manifesto-busting income tax hike is now not necessary. I don't need to spell out the jeopardy for such a move: Rachel Reeves was poised to be the first chancellor in 50 years to raise the basic rate of income tax and break the core manifesto pledge that Labour made to voters last year. It doesn't mean taxes are not going up. The government is set to freeze tax thresholds for another two years from 2028. That will raise around Â£8bn as millions of workers are dragged into higher tax bands and end up paying more tax. There will also be tax raising around pensions and salary sacrifice schemes and on electric vehicles, as well as other measures, as the chancellor casts around for Â£20bn. But what about the politics? Well, one government figure today insists that the decision to drop the income tax plan is nothing to do with the self-inflicted leadership crisis at No 10 after anonymous briefings designed to see off any potential post-budget coup against the prime minister spectacularly backfired. The changed forecasts, I'm told, came in last week. ðŸ‘‰ Click here to listen to Electoral Dysfunction on your podcast app ðŸ‘ˆ But of course there's tonnes of politics in this. The talk of higher wage growth perhaps offsetting some of the productivity downgrades was being flagged a couple of weeks back, before the chancellor made her speech. It's extremely unusual for a chancellor to pitch-roll their budget. But Reeves did it for a reason. That was laying the ground for a massive budget that would bring manifesto-breaking tax rises. She told us of the difficult environment, ruled out more borrowing or spending cuts before telling us \"everyone must play their part\". She repeatedly refused to stick to manifesto promises on tax. It doesn't get much more stark than that. That the government has U-turned on that decision is about far more than just the fiscal framework. Read more: What taxes could go up now?  With trust so low in the government, there were serious worries - and warnings - from the party that such a big manifesto break might be something from which the PM and the chancellor wouldn't recover. One senior party figure that thinks there could be a leadership challenge after the May elections told me this week that manifesto-breaking tax rises would only make that more likely because Labour would \"need a clean skin\" to try and rebuild with the public if Starmer broke his promises in that way. Read more: Is Starmer 'in office but not in power'? Lucy Powell, the deputy Labour leader, fired a warning shot last week when she said the party should stick to the manifesto and not raise tax: \"We should be following through on our manifesto, of course. There's no question about that,\" she told Matt Chorley on BBC Radio 5 Live. \"Trust in politics is a key part of that because if we're to take the country with us then they've got to trust us and that's really important too.\" The party will no doubt feel relief today that the chancellor is not going to break the manifesto. It would have only made things a whole lot worse for a government that is in real trouble. But the shambles of this week is staggering. From the self-inflicted leadership crisis to leaks over a massive budget U-turn, it all lends to the sense that this is a No 10 out of control, lurching from one mess to another. Strap in."
    },
    {
        "title": "Does the government have the power to push through unpopular decisions?",
        "description": "Back in June, it was the U-turn on welfare that raised eyebrows. Now it's a perceived volte-face on tax. ",
        "url": "https://news.sky.com/story/does-the-government-have-the-power-to-push-through-unpopular-decisions-13470369",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-cash-money-hmrc-tax_7078297.jpg?20251110151814",
        "type": "Politics",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-11-14 18:20:00",
        "Headline": "It's not a new question. Traders have been asking it for some time. Today, it was again at the forefront of their minds.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Back in June, it was the U-turn on welfare that raised eyebrows. Now it's a perceived volte-face on tax.  After weeks of suggestions that income tax may have to rise in the forthcoming budget, government sources have confirmed that Chancellor Rachel Reeves will do no such thing. The government is flip-flopping in a febrile environment. Markets are sensitive to levels of government debt, which climbed by 17.9% between 2019 and 2024. In the context of an ageing population, slow growth and comparatively high inflation, there are concerns that UK debt is on an unsustainable path. Markets want consolidation - for the chancellor to get a grip on tax and spending. Ms Reeves, with her insistence on iron-clad fiscal rules, promised discipline. But flip-flopping doesn't look like discipline. Markets are letting their thoughts be known - and their thoughts matter because the government borrows from them. Government bond yields, the interest rate demanded on UK debt, jumped amid fears that the government is not prepared to face down opposition from its own backbenchers, from political opponents or the public. The 30-year gilt was up 16 basis points after its worst day since July, when the chancellor was seen crying in the Commons. The 10-year gilt was up 13 points. \n                  Telegraph future in limbo again as RedBird abandons Â£500m deal\n                 \n                  Direct cost of Jaguar Land Rover cyber attack which impacted UK economic growth revealed\n                 \n                  Budget 2025: Starmer and Reeves ditch plans to raise income tax\n                 Borrowing costs are already costing the country more than Â£100bn a year - about 10% of total spending. The more money the government is spending on interest, the less flexibility it has to spend more in other areas, like schools or hospitals. It appears that Ms Reeves has changed tack because official forecasts from the Office for Budget Responsibility (OBR), whose forecasts underpin the budget, show the fiscal black hole is closer to Â£20bn, rather than the Â£30bn first feared. It means she can take less radical steps to raise money. Markets are pleased that the chancellor is sticking to her rules, but they are viewing this move with scepticism. Many view the OBR forecasts as overly optimistic. These are smaller tax rises to tackle a smaller problem on paper, but is what's written on that paper credible? Andrew Goodwin, of Oxford Economics, said: \"If investors suspect the government is leaning on convenient assumptions, they may assume more trouble ahead - and yields could rise further.\" Then there's the speculation over which taxes could rise. Markets have a clear preference towards income tax because, unlike the increase in national insurance contributions on businesses in the last budget, it's not inflationary. And alternative sources, such as tweaks to stamp duty or EV taxes, are less dependable revenue raisers. \"Avoiding the politically sensitive income tax lever implies less willingness to tackle the structural deficit later,\" said Gordon Shannon, of TwentyFour Asset Management. Read more:'Staggering' 20-year fall in domestic UK flightsDoctors in England begin five-day strike Traders are eyeing the long-term trajectory of the UK, and they are bristling at short-term fixes and tweaks that don't address the fundamental fiscal position. There are those in policy who are also frustrated at the approach, which has seen the government pick and drop policies to meet fiscal rules by fine margin. It is difficult to find any political vision in it all."
    },
    {
        "title": "Zarah Sultana allies claim she's being 'sabotaged', as Your Party hit by resignation ",
        "description": "Attacks on Zarah Sultana are aimed at sabotaging her ahead of a Your Party leadership battle, her allies have claimed.&#160;",
        "url": "https://news.sky.com/story/zarah-sultana-allies-claim-shes-being-sabotaged-as-your-party-hit-by-resignation-13470197",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-corbyn-zarah-sultana_7047989.jpg?20251010182657",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-11-14 11:53:00",
        "Headline": "New left-wing party descends into more infighting, after releasing a statement perceived as an attack on Ms Sultana. It comes as an MP quit, blaming a 'toxic culture'.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Attacks on Zarah Sultana are aimed at sabotaging her ahead of a Your Party leadership battle, her allies have claimed.Â  It comes as the fledgling left-wing party is hit by another row, with one of its independent MPs, Adnan Hussain, resigning from the founding process and hitting out at a culture of \"persistent infighting, factionalism and a struggle for power\". Politics Live: U-turn on budget income tax rise triggers 'not normal' market volatility Ms Sultana, who co-launched Your Party with Jeremy Corbyn in July, has been at the centre of a row over donations after taking over a company that collected supporters' money while the party was being formally constituted. She has insisted she is transferring it over in stages for legal reasons, but in a statement on social media last night, Your Party said it was â€œfrustratedâ€ that the bulk of the money was \"beyond its reach\" and that it was pursuing the full amount immediately. The statement dropped minutes before Ms Sultana appeared on BBC Question Time. A source close to her told Sky News: \"It's unbelievable really. She's transferring money as promised, so it's available for conference, they know perfectly well they're demanding something impossible, and they wait until she's about to appear on BBC QT to use official party social media channels to publish that.\" \n                  Budget 2025 income tax U-turn: What the hell just happened?\n                 \n                  Budget 2025: Starmer and Reeves ditch plans to raise income tax\n                 \n                  Starmer now 'more likely' to face leadership challenge, says Harriet Harman\n                 They added: \"It's hard to interpret it as anything other than deliberate sabotage, because they're worried she'll win a leadership contest because her vision is much closer to what members are looking for.\" Your Party members will elect a leader in the new year. Exactly how that will work will be fleshed out at the founding conference in just a few weeks' time. The draft founding documents, which members will vote on when they gather in Liverpool, have proposed a single leadership model, with elections to commence in the new year. It could result in a bitter battle if Ms Sultana and Mr Corbyn both go for the top job. Allies of Mr Corbyn point to his experience as Labour leader and say Ms Sultana can't be trusted because of her habit of making unilateral decisions - such as announcing Your Party early, and launching an unauthorised membership portal. But backers of Ms Sultana see her as a fresh face for the left and believe her vision for the party is more democratic. Your Party 'operating on a shoestring' Your Party promised to be a socialist alternative to the rise of the right, but it has been marred by factionalism and division from the beginning. In a statement on its official social media last night, Your Party said that hundreds of thousands of pounds were donated to the party \"by supporters in good faith, but have since remained beyond its reach\", which was described as being \"extremely frustrating and disheartening\". Although it didn't mention Ms Sultana by name, as Sky News has reported she is the sole director of MOU Operations, the company holding those donations - some Â£800k. This week she sent over Â£200k from that pot and laid out a plan to send a further Â£400k in tranches before the conference. She has said the rest will be sent once the company's' liabilities are settled, with a plan to wind it up by the end of March. But Your Party's statement said the \"small portion\" that had been sent over was \"insufficient\" and it wants the full amount now. It added that volunteers were working on a \"shoestring budget\" and while \"their efforts are heroic... without funding Your Party's capacity has been severely restricted\". The statement was signed by Mr Corbyn and the independence alliance (IA) of MPs who have been stewarding the party's founding process - Ayoub Khan, Adnan Hussain, Shockat Adam and Iqbal Mohamed. A Your Party source told Sky News that Mr Corbyn signed it against his better judgment after being railroaded by others. 'Toxic atmosphere' Meanwhile Mr Hussain has since resigned, issuing a lengthy statement on Friday which made claims of \"clique-like behaviour\" and a \"toxic atmosphere\" more focused on a struggle for power than a \"commitment to the common good\". He also raised concern about the treatment of Muslim men involved in Your Party, saying the rhetoric towards them \"has been disturbingly similar to the forces the left claims to oppose\". Mr Hussain is the independent MP for Blackburn, a constituency he won on a largely pro-Gaza platform. The independent alliance was formed after the general election last year, but there has been criticism of its involvement in Your Party as some of the group are considered to hold conservative views. Mr Hussain has previously faced criticism for saying there should 'third spaces' for trans women, which is at odds with the views of Mr Corbyn and Ms Sultana. Ms Sultana has previously fallen out with him and the independent alliance, branding them a \"sexist boys club\" in September when she launched her own membership drive - a move that triggered a major row and is still being investigated by the UK's data watchdog. The source close to Ms Sultana said Mr Hussain's departure shows what a \"strategically disastrous\" move it was to involve in Your Party's founding process MPs who \"do not share the politics\" of its supporters, claiming efforts to \"freeze\" her out had backfired."
    },
    {
        "title": "'Ticking time bomb': Warning that spiralling spending on special needs provision could push councils to breaking point",
        "description": "Some of England's largest councils have warned that the increasing cost of supporting children with special educational needs and disabilities (SEND) could push some local authorities to bankruptcy within a few years. ",
        "url": "https://news.sky.com/story/8216ticking-time-bomb8217-warning-that-spiralling-spending-on-special-needs-provision-could-push-councils-to-breaking-point-13470153",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-send-reform-protest_7021277.jpg?20250915122645",
        "type": "Politics",
        "Author": "Anjum Peerbacos",
        "Date Published": "2025-11-14 10:28:00",
        "Headline": "Experts warn that the current system threatens the stability of many councils ",
        "Content": "\n          Education reporter\n       Some of England's largest councils have warned that the increasing cost of supporting children with special educational needs and disabilities (SEND) could push some local authorities to bankruptcy within a few years.  The County Councils Network said many local authorities were struggling to cope with increased demand and that the money councils receive from central government under the Dedicated Schools Grant (DSG) was not sufficient. The report states the national high-needs block deficit will hit Â£6.6 billion in 2025/26, and, without urgent reform, will more than double to Â£13.4 billion by March 2028, when the statutory override that currently shields councils' balance sheets is due to end. One in three councils say they could be forced to effectively declare bankruptcy before the override ends because of increased costs. That rises to nearly nine in ten once the override is lifted, the report warned. Kevin McDonnell, headteacher at Stormont House School (a school for children with SEND in Hackney, London) said: \"If we truly want a high-quality, inclusive education system we will need to resource it properly. The current system is adversarial and often unhelpful.\" Even with the override currently in place, councils are experiencing severe financial pressures. Lost interest, borrowing requirements and other associated costs are expected to total Â£400 million this year, rising to nearly Â£1 billion by 2028/29. Finance officers warn this is already eroding day-to-day budgets at a time when councils are struggling to maintain core services. Mr McDonnell said: \"The statutory override is hiding the scale of the problem and in March 2028 we risk an implosion of local authority services through bankruptcy. This is surely something all political parties would wish to avoid. Wouldn't it be great if politicians could agree how to address this before we reach the point of crisis, taking into account the views of those directly involved?\" \n                  Donald Trump confirms he will sue the BBC over Panorama edit - despite broadcaster's apology\n                 \n                  Banksy art theft lands burglar with 13-month prison sentence\n                 \n                  Does the government have the power to push through unpopular decisions?\n                 Ninety percent of councils could declare bankruptcy  By 2026/27, the national SEND deficit is expected to exceed all local authorities' usable reserves. Two years later, it will surpass both usable and ring-fenced reserves combined, leaving councils without the financial capacity to absorb the losses. Finance leaders say that without government intervention, deficits currently concealed within ring-fenced accounts will soon overwhelm the entire local government system. Warnings from senior finance leaders Owen Mapley, chief executive of CIPFA (The Chartered Institute of Public Finance and Accountancy), said the latest figures confirm the severity of the crisis: \"CIPFA has long warned that the broken SEND funding system threatens councils' financial stability. The latest ALATS, (Association of Local Authority Treasurers' Societies), data confirms the situation is now critical. \"Even with the statutory override, some authorities could face effective bankruptcy unless the government sets out how these deficits will be resolved and the system reformed,\" said Lorna Baxter, the President of ALATS. She added that councils can no longer sustain the financial strain: \"The ALATS survey has clearly demonstrated the scale of the financial crisis in SEND. \"We often hear of the black hole in public finances but SEND deficits totalling billions of pounds are being hidden in local authority accounts. Without prompt government intervention, we risk an unprecedented local authority financial crisis.\" CIPFA and ALATS are now asking ministers to urgently outline how existing SEND deficits will be funded and to develop a sustainable long-term settlement that protects the future of council finances. Read more:How children with SEND from poorer families are being left behind at schoolRadical overhaul of how schools support special needs students demanded by MPs Rachel Filmer, Campaigns Manager for Special Needs Jungle, co-founders of the Save Our Children's Rights campaign said: \"Due to a complete failure to invest in the infrastructure and early intervention needed by children and young people with SEND, councils are now paying out billions a year to private schools and transport companies. \"This is not the fault of disabled children or their families, who need and are legally entitled to an accessible education.\" A Department for Education spokesperson said: \"This Government inherited a Send system on its knees, with thousands of families struggling to get the right support. \"We're determined to put that right by improving mainstream inclusion so every child can thrive at their local school. \"We've held over 100 listening sessions with families and will continue engaging parents as we deliver reform through the Schools White Paper. \"We're already making progress - with better training for teachers, Â£740 million for more specialist places, earlier intervention for speech and language needs, and Send leads in every Best Start Family Hub.\""
    },
    {
        "title": "Union demands Sir Robbie Gibb's removal from BBC board to defend 'political impartiality'",
        "description": "The biggest union among BBC employees has demanded that Sir Robbie Gibb is removed from the corporation's board.",
        "url": "https://news.sky.com/story/union-demands-sir-robbie-gibbs-removal-from-bbc-board-to-defend-political-impartiality-13470229",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-robbie-gibb-downing-street_7079041.jpg?20251111114719",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-14 13:05:00",
        "Headline": "The Broadcasting, Entertainment, Communications and Theatre Union said it was concerned about the BBC's ability to resist political pressure.",
        "Content": "The biggest union among BBC employees has demanded that Sir Robbie Gibb is removed from the corporation's board. The culture secretary, Lisa Nandy, has meanwhile insisted that the broadcaster believes itself to be safe from claims of defamation. Writing to her and Samir Shah, the chair of the BBC board, on Friday, the Broadcasting, Entertainment, Communications and Theatre Union (BECTU) claimed that their members are concerned about the organisation's ability to resist political pressure and \"uphold the integrity of its journalism\". The letter comes after BBC's director-general Tim Davie and chief executive Deborah Turness resigned amid concerns about the BBC's impartiality, including how a speech by US President Donald Trump was edited in an episode of Panorama last year. BECTU said it was vital that both the government and the BBC board are \"truly committed to the future of the organisation, its mission, its independence and its values\". To achieve this, they said, Sir Robbie Gibb - who worked as Theresa May's director of communications after a career at the corporation - should be removed from the broadcaster's board.  They continued: \"We simply do not see how staff can have faith in the BBC's leadership while a crucial position on the board is filled by someone perceived by many staff and external commentators as sympathetic to, or actively part of, a campaign to undermine the BBC and influence its political impartiality.\" \n                  Donald Trump confirms he will sue the BBC over Panorama edit - despite broadcaster's apology\n                 \n                  Why does BBC boardâ€™s Sir Robbie Gibb keep getting criticised?\n                 \n                  BBC apologises to Donald Trump over editing of Panorama but says there isn't 'basis for defamation claim'\n                 Since his appointment, Sir Robbie has faced opposition due to his ties to the Conservative party. The Guardian has reported that sources told the publication he had \"led the charge\" against Mr Davie, helping force his resignation through a \"coup\". A friend of Sir Robbie's suggested to Deadline that the coup theory was \"absolute nonsense\", however. Speaking to Sky News, Ms Nandy said she had been speaking \"daily, frequently\" to the chairman of the BBC board, the director general and senior staff members regarding the fallout from the edit of Trump's speech. Read more:BBC apologises to Donald TrumpWho is Sir Robbie Gibb? She claimed: \"They have consulted lawyers and are absolutely confident that they, are protected against defamation.\" The BBC revealed on Thursday that Mr Shah had personally written to Donald Trump to apologise for the way in which his speech was cut. In a message to staff at the corporation, he said that the national broadcaster was coming to the end of a \"difficult week\" for its staff. \"I'm aware there is sadness, anger and frustration in relation to what has happened in recent days and it is hard when the BBC is the focus of so much attention and news headlines,\" he wrote. Work to reflect on staff concerns had already begun, Mr Shah claimed, before adding that he was \"fiercely proud\" of the BBC's \"world-class journalism\". He continued: \"I refute any suggestion that there is institutional bias at the BBC. \"I know I speak for the whole Board when I say how hugely impressed I am by your resilience and focus, particularly this week, on delivering outstanding content for our audiences.\""
    },
    {
        "title": "High Court rules company liable for Brazil dam collapse - the country's worst environmental disaster",
        "description": "A judge has ruled that a company can be held liable for a dam collapse which devastated indigenous communities in Brazil and became the country's worst environmental catastrophe.",
        "url": "https://news.sky.com/story/high-court-rules-company-liable-for-brazil-dam-collapse-the-countrys-worst-environmental-disaster-13470079",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-mariana-dam-mariana_7081665.jpg?20251114065520",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-11-14 09:40:00",
        "Headline": "The 2015 Fundao Dam collapse - also known as the Mariana dam disaster - resulted in flooding that devastated two nearby villages. The case was brought in the UK as company BHP was listed on the London Stock Exchange at the time of the collapse.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n A judge has ruled that a company can be held liable for a dam collapse which devastated indigenous communities in Brazil and became the country's worst environmental catastrophe. At the High Court in London, Judge Finola O'Farrell ruled that mining giant BHP should not have continued to raise the height of the Fundao Dam before its collapse. This, she ruled, was \"a direct and immediate cause\" of the disaster. BHP said immediately after that it would appeal the decision. The case was brought in British courts because BHP was listed on the London Stock Exchange at the time of the collapse. Brought by the international law firm Pogust Goodhead on behalf of hundreds of thousands of victims, the claim marks the first time any of the mining companies behind the dam have been held legally responsible for the disaster. The dam's collapse released approximately 40 million tons of toxic sludge, including arsenic, which spread 370 miles along the Doce River and out to sea. In total, 19 people died, while hundreds of homes were destroyed. The case has become the largest environmental group action in English legal history, representing a significant milestone for holding corporations accountable and advancing environmental justice. Gelvana Rodrigues da Silva, who lost her seven-year-old son Thiago in the flood, said in a statement: \"Finally, justice has begun to be served, and those responsible have been held accountable for destroying our lives.\" One of the largest civil claims ever in England The Fundao Dam near the city of Mariana was operated by Samarco, a joint venture between BHP and Brazilian company Vale. Its collapse happened almost 10 years ago to the day. With 620,000 claimants, the case is one of the largest civil claims ever lodged in England and Wales. Brazil is currently hosting the COP30 climate summit in the Amazonian city of Belem, aiming to position itself as a climate leader and champion of indigenous rights. Shirley Djukurna Krenak, an indigenous leader whose community has lived for generations along the Doce River, said the summit is removed from the realities faced by indigenous peoples, and full of \"greenwashing\" and false promises. \"If all the previous COPs had worked, we wouldn't still be talking about crimes like this,\" she said. Read more from Sky News:Starmer and Reeves ditch plans to raise income taxDoctors in England begin five-day strike  In October 2024, Brazil's government and the states of Minas Gerais and Espirito Santo signed a 132bn Brazilian real (Â£20bn) compensation settlement with Samarco, Vale and BHP, to fund social and environmental repairs. BHP had argued that the court case in Britain duplicates other legal proceedings and reparations work. Reacting to Friday's judgment, the company said that settlements in Brazil would reduce the size of the London lawsuit by about half. Vale, the co-owner of the company operating the dam, announced after the verdict that it estimated an additional expense of about $500m (Â£381m) in its 2025 financial statements to cover obligations linked to the disaster. A second trial to determine the damages BHP is liable to pay is due to begin in October 2026. How the Mariana dam disaster unfolded On 5 November 2015, the Fundao tailings dam collapsed in Minas Gerais, Brazil. It released approximately 40 million tons of toxic sludge, including arsenic, which buried the small town of Bento Rodrigues and poured pollution into the Doce River. The mud travelled so quickly that residents did not have time to escape, and it killed 19 people. Around 600 people lost their homes. The toxic waste made its way to the Atlantic Ocean, destroying water supplies, vehicles, habitats, livestock and livelihoods. Ten years later, reconstruction and reparations have dragged on through legal disputes, and the indigenous Krenak people are still struggling to live along the Doce River that remains contaminated with heavy metals."
    },
    {
        "title": "Stranded Chinese astronauts return to Earth after space capsule damaged",
        "description": "Three Chinese astronauts have successfully returned to Earth from their nation's space station after their capsule was damaged.",
        "url": "https://news.sky.com/story/stranded-chinese-astronauts-return-to-earth-after-space-capsule-damaged-13470140",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-shenzhou-chen-zhongrui_7082008.jpg?20251114133253",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-11-14 09:47:00",
        "Headline": "The men landed in a remote site in the Gobi Desert in Asia on Friday after their journey home from a six-month rotation at the Tiangong space station was delayed due to a possible collision with tiny particles of space debris.",
        "Content": "Three Chinese astronauts have successfully returned to Earth from their nation's space station after their capsule was damaged. The team deployed a red and white striped parachute as they descended, before landing at a remote site in the Gobi Desert in Asia on Friday. The astronauts - Chen Dong, Chen Zhongrui and Wang Jie - had been due to return on 5 November to end their six-month rotation at the Tiangong space station. However, their journey back was delayed by nine days because the Shenzhou-20 return capsule they were due to travel in was found to have tiny cracks. These were most likely caused by the impact of space debris hitting the craft, China's space agency said. There are millions of pieces of mostly tiny particles that circle the Earth at speeds faster than a bullet. They can come from launches and collisions and pose a risk to satellites, space stations and the astronauts who operate outside them. With the Shenzhou-20 out of action, the crew - who travelled to the space station in April - used a Shenzhou-21 craft instead, which had brought a three-person replacement crew to the station. The Chinese space agency said the stranded taikonauts - the Chinese word for astronauts - had remained in good condition throughout. The first module of the Tiangong, which means \"Heavenly Palace\", was launched by the Chinese state in 2021. It is smaller than the International Space Station, from which Beijing is blocked, due to US national security concerns. China's space programme has developed steadily since 2003. Read more:NASA cancels space launchJeff Bezos's rocket lands on Earth In a long term plan to advance its orbital capabilities, China plans to land a person on the moon by 2030 and has already explored Mars with a robotic rover. The Asian nation's latest space mission brought four mice to study how weightlessness and confinement would affect them. An engineer from the Chinese Academy of Sciences said the study will help master key technologies for breeding and monitoring small mammals in space."
    },
    {
        "title": "Ariana Grande rushed by red carpet intruder at premiere of Wicked: For Good",
        "description": "Video footage has shown the moment singer and actress Ariana Grande was accosted by a fan at a film premiere.",
        "url": "https://news.sky.com/story/ariana-grande-rushed-by-red-carpet-intruder-at-premiere-of-wicked-for-good-13470136",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ariana-grande-wicked_7081816.jpg?20251114100520",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-14 09:35:00",
        "Headline": "The singer and actress was in Singapore for the film's debut when the incident unfolded on Thursday.",
        "Content": " Video footage has shown the moment singer and actress Ariana Grande was accosted by a fan at a film premiere. Grande was in Singapore for the debut of Wicked: For Good when the incident unfolded on Thursday. The video captured the moment the fan scaled the barricade and pushed past photographers towards Grande. He then threw his arms around her, before co-star Cynthia Erivo intervened and security swoops in to stop him. The man, now identified as Johnson Wen, 26, is reportedly a notorious red carpet crasher. Wen, who has since been charged with being a public nuisance, goes by the nickname Pyjama Man, and gloated as he shared footage of the intrusion online. \"Dear Ariana Grande, Thank You for letting me Jump on the Yellow Carpet with You,\" he wrote on Instagram. \n                  MTV VMAs in pictures: Lady Gaga, Ariana Grande and Sabrina Carpenter triumph as tribute paid to Ozzy Osbourne\n                 \n                  Oscars red carpet 2025: All the best looks from the nominees and guests\n                 \n                  Oscars 2025 predictions: Who will win and who should win?\n                 In video stories posted to the site beforehand, he was seen at the Universal Studios venue, revealing his intentions. In one, he said: \"I feel like I'm in a dream, that's my best friend, Ariana Grande, and I'm gonna meet her. I've been dreaming about that.\" Read more:When you should actually arrive at cinema to avoid adsTV and film's obsession with upper-class actors The Australian has ambushed several performers on stage, according to reports, including Katy Perry and The Chainsmokers at concerts in Sydney, and The Weeknd in Melbourne. It has been reported that Wen intends to plead guilty and that he could face a fine of more than Â£1,000. Grande took a moment to gather herself in the aftermath of the intrusion, visibly shocked by the incident. She didn't address the incident on her own Instagram, but shared some photos with the caption \"thank you, Singapore\", adding \"we love you\". The singer battled post-traumatic stress disorder after her 2017 concert in Manchester was bombed, leaving 22 people dead. She told Vogue in 2018: \"It's hard to talk about because so many people have suffered such severe, tremendous loss. But, yeah, it's a real thing. \"I know those families and my fans, and everyone there experienced a tremendous amount of it as well. Time is the biggest thing. \"I feel like I shouldn't even be talking about my own experience - like I shouldn't even say anything. I don't think I'll ever know how to talk about it and not cry.\" In the same interview she also addressed her own anxiety, saying she has \"always\" had it. Grande plays Galinda Upland in Wicked: For Good, the character who becomes Glinda the Good Witch. Ms Erivo plays Elphaba, the character who becomes the Wicked Witch of the West. The film is released in UK cinemas on 21 November."
    }
]