[
    {
        "title": "Elon Musk and Prince Andrew named in latest Epstein files release",
        "description": "Elon Musk's name has appeared in files relating to Jeffrey Epstein, with a reference made to the world's richest man potentially visiting the paedophile's island.",
        "url": "https://news.sky.com/story/elon-musk-and-prince-andrew-named-in-latest-epstein-files-release-13438742",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-elon-musk-x-tesla_7032542.jpg?20250926214813",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-26 18:25:00",
        "Headline": "The Duke of York is named as a passenger on the sex offender's private jet in documents released by Democrats on the House Oversight Committee in the US.",
        "Content": " Elon Musk's name has appeared in files relating to Jeffrey Epstein, with a reference made to the world's richest man potentially visiting the paedophile's island. The Duke of York is also named as a passenger on the sex offender's private jet in documents released by Democrats on the House Oversight Committee in the US. They show Musk as a potential visitor to Epstein's island, Little St James, on 6 December 2014 - six years after Epstein became a listed sex offender. His name appears on what appears to be Epstein's daily schedule, with the entry reading: \"Reminder: Elon Musk to island Dec.6 (is this still happening?)\" Musk issued a broad denial late Friday as he responded to another account's post on the subject on X, saying \"This is false\" without elaborating. In June, Musk claimed Donald Trump appeared in files relating to the disgraced financier and alleged his administration was concealing information about the US president's association with Epstein. He gave no evidence for the claim, which he made on X, and later appeared to have deleted the posts. Sky News has approached Musk for comment.  Prince Andrew named as passenger on Epstein jet The documents also show Prince Andrew as a listed passenger on a flight on Epstein's jet from Teterboro, New Jersey, to Palm Beach, Florida, on 12 May 2000. He is named alongside Epstein, his then-girlfriend Ghislaine Maxwell, who is now a convicted sex trafficker, and two names that have been redacted. Read more from Sky News:Farage on course to be next PM, mega poll projectsTerror charge against rapper cannot continue, court says Details of the duke travelling on Epstein's jet have previously been heard in court in Maxwell's trial. One of her accusers, who was 14 at the time, recalled she had travelled on a flight with Andrew. The duke strenuously denies any wrongdoing. In addition to Musk and the duke, the records also show he was in contact with Microsoft co-founder Bill Gates, PayPal founder Peter Thiel and Steve Bannon, who was Mr Trump's chief strategist during his first term. The names of victims in the records are redacted and the committee said it plans to release more files once they are redacted as well. Duchess of York dropped by charities over Epstein email The release comes days after an email surfaced from Sarah, Duchess of York, to Epstein, in which she apologised to him for disowning him in the media. In the letter, the duchess, Prince Andrew's ex-wife, called the sex offender a \"supreme friend\".  Her spokesperson said the message was written because he had threatened to sue her for defamation. The emergence of the email led to the duchess being dropped by a number of charities she had been a patron of. Earlier this month, Peter Mandelson, the British ambassador to the US, was sacked by Sir Keir Starmer after it was discovered he had also sent messages to Epstein, calling him \"my best pal\", after he was jailed awaiting sex trafficking charges. Epstein was found dead in his cell at a federal jail in Manhattan in August 2019 while he was awaiting trial on sex-trafficking charges. The death was ruled a suicide."
    },
    {
        "title": "Watch moment diplomats walk out as Israeli PM Netanyahu speaks at UN",
        "description": "Dozens of diplomats have walked out of the UN's assembly hall as Israel's prime minister took to the podium to speak.",
        "url": "https://news.sky.com/story/watch-the-moment-diplomats-walk-out-as-israeli-pm-speaks-at-un-13438551",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-benjamin-netanyahu_7032268.jpg?20250926140803",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-26 11:51:00",
        "Headline": "As the session's chairman called for order, there were boos and cheers while delegates streamed out, leaving masses of empty seats.",
        "Content": " Dozens of diplomats have walked out of the UN's assembly hall as Israel's prime minister took to the podium to speak. As the session's chairman called for order, there were boos and cheers while delegates streamed out, leaving masses of empty seats. Benjamin Netanyahu used his speech to speak directly to the hostages held in Gaza and their captors. UN latest: Dozens of delegates walk out on Netanyahu's UN address in protest He said loudspeakers had been put up around the territory and said Israeli spies had hacked mobile phones in Gaza so they carried his voice. To the hostages, he said: \"We have not forgotten you... we will not falter, we will not rest until we have brought all of you home.\" To Hamas's leadership, he said: \"Lay down your arms... free the hostages now. If you do you will live, if you don't Israel will hunt you down.\" He hit out at \"false charge of genocide\" and said: \"If Hamas agrees to demands, war could end.\"  Mr Netanyahu held a map of the region and crossed out the various threats he said had been eliminated, such as Hezbollah and Iran's nuclear capabilities. \"Israel rebounded from its darkest day to deliver one of the most stunning military comebacks in history,\" he said. Meanwhile, Donald Trump said he believes the US has reached a deal on easing fighting in Gaza, saying it \"will get the hostages back\" and \"end the war\". \"I think we maybe have a deal on Gaza, very close to a deal on Gaza,\" the US president told reporters on the White House lawn as he was leaving to attend the Ryder Cup. Mr Trump has repeatedly claimed an agreement to end the war was imminent, only for nothing to materialise. Weeks ago, he said: \"I think we're going to have a deal on Gaza very soon.\" It comes soon after the UK, France, Canada and Australia formally recognised a Palestinian state in an effort to keep alive the prospect of a two-state solution. The war in Gaza has been going on for nearly two years, with UN agencies and its chief repeatedly warning over the dire humanitarian situation. Israel's recently launched ground assault on Gaza City has only heightened concerns and seen thousands flee south in fear for their lives. Israel says it's designed to destroy what remains of Hamas after its October 2023 terror attack killed more than 1,200 people and kidnapped 251. The Israeli leader insisted Israel had to \"finish the job\" to ensure the atrocity is not repeated. \"They beheaded men. They raped women. They burned babies alive. They burned babies alive in front of their parents,\" he told the UN. Lead world news presenter Even before Benjamin Netanyahu reached the lectern on the floor of the United Nations General Assembly, dozens of diplomats had walked out of the cavernous hall.  The Israeli delegation attempted to counter this performative display by putting forward one of their own - cheering and giving a standing ovation at the appearance of their prime minister.  Almost immediately, Netanyahu did what he often does in these speeches - unfurling props, including a map of the region, and ticking off one by one the threats that have long menaced the Jewish State.  However, while Netanyahu attempted to remind the few still seated in the chamber about the horrors of the 7 October terrorist attack by Hamas, the principal impression from inside the room was of how isolated from the world the Israeli leader has become.  Underscoring this further was the circuitous path that Netanyahu's jet had to take in order to reach New York, winding its way around European countries to avoid the airspace of those potentially sympathetic to an ICC arrest warrant. \n Netanyahu's speech was broadcast live into Gaza - via Israeli military vehicles carrying loudspeakers - where he sent a message to the hostages and issued a threat to Hamas: \"Lay down your arms, free the hostages.\"  But throughout the week here in New York, the frustration at Netanyahu has been palpable, even among many of Israel's closest friends and supporters.  First, Britain, France, Australia, and Canada recognised a Palestinian state in a rebuke to Netanyahu. Now it seems that Israel's strongest and most important ally, Donald Trump, may have had enough too.  The US President, in a meeting with Muslim and Arab leaders earlier this week, reportedly assured them that he will bring an end to the Israeli war in Gaza and prevent Benjamin Netanyahu from annexing the West Bank. \n In an exclusive interview with Sky News, Saudi Arabia's Foreign Minister told me Trump is \"very, very committed\" to a pathway to peace to end the suffering of the Palestinian people.  Netanyahu is due to meet Trump at the White House early next week. After decades in public life, even Netanyahu's fiercest critics acknowledge his political skills and unmatched survival instincts; the question now is - with Trump, has he finally met his match?  Mr Netanyahu previously condemned the recognition of a Palestinian state by Western powers, saying it only rewarded Hamas and made it harder to win the release of the remaining hostages. There are fears he could retaliate by annexing the West Bank and recognising Israeli control over illegal settlements. However, Mr Trump - the only world leader believed to hold any sway over Israel - told reporters on Thursday he would \"not allow it\". The Israeli leader is subject to an arrest warrant from the International Criminal Court, which has accused him of crimes against humanity, which he denies. More than 65,000 Palestinians in Gaza have been killed in the war, according to the country's Hamas-run health ministry. Its figure does not differentiate between civilians and fighters. Ninety per cent of its population has also been displaced by attacks that have flattened most of the territory and left many people desperately short of food. 'Weak-kneed' Western leaders The Israeli prime minister told the UN \"the war could end right now\" if Gaza agreed to its demands. \"Israel would retain overriding security control, and a peaceful civilian authority would be established by Gazans and others committed to peace with Israel.\"  He also hit out at \"weak-kneed\" Western leaders who he accused of giving in to biased media and antisemitic mobs. \"For much of the past two years, Israel has had to fight a seven-front war against barbarism, with many of your nations opposing us,\" said Mr Netanyahu. He denied that his military was deliberately targeting civilians and referenced an assessment that it was taking more \"measures to minimise civilian casualties than any military in history\". Denying genocide claims, the prime minister said the \"truth had been turned on its head\" and cited his forces dropping millions of leaflets and sending text messages telling people to flee prior to attacks. "
    },
    {
        "title": "Netanyahu is famous for wriggling out of impossible predicaments - but this may be his biggest test yet",
        "description": "They call Benjamin Netanyahu the Houdini of the Middle East. Can he wriggle out of the straitjacket being prepared for him?",
        "url": "https://news.sky.com/story/netanyahu-is-famous-for-wriggling-out-of-impossible-predicaments-but-this-may-be-his-biggest-test-yet-13438831",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-netanyahu-un_7032625.jpg?20250926200927",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-09-26 18:57:00",
        "Headline": "Can the Israeli prime minister - known as the \"Houdini of the Middle East\" - wriggle out of the straitjacket being prepared for him?",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  They call Benjamin Netanyahu the Houdini of the Middle East. Can he wriggle out of the straitjacket being prepared for him? Donald Trump appears to be indicating that time is running out for the Israeli offensive in Gaza. The Arab and Muslim leaders he met here at the UN General Assembly this week are warning him that his signature foreign policy achievement is in jeopardy because of the war. The Abraham Accords normalised relations between Israel and the Gulf states, the UAE and Bahrain. But Israeli threats to annexe the West Bank and the relentless campaign in Gaza are threatening to unravel them.  The Trump team have a 21-point Gaza peace plan. Broadly speaking, it envisions the gradual withdrawal of Israeli forces, the release of the hostages, and an international security force in Gaza. But it also envisions the eventual return of the Palestinian Authority to run Gaza and makes no mention of Israeli settlements. On both points, the plan is at odds with the hopes of Netanyahu's far-right coalition allies, upon whose support he relies to stay in power. More than that, judging from his speech at the UN, Netanyahu is in no mood for an end to the war, not yet. He still wants to \"finish off the job\", he says, and is yearning for a \"speedy victory\". His generals are less optimistic. Commanders have warned his cabinet that the prospects of total success are limited and there are considerable risks.  There are political considerations, too, driven by Netanyahu's survival instincts. The sooner the war ends, the greater the likelihood of Netanyahu's coalition disintegrating and the prime minister facing the reckoning he has long avoided over his blame for October 7th. Trump has been more than generous in giving Netanyahu leeway to pursue a campaign Israel's allies lost patience with months ago. But Trump has a plan now, and the prospect of a breakthrough will be tantalising for a deal-hungry president. Not to mention the peril facing the Abrahamic grand bargain of his first term in office. Netanyahu is a magician famous for wriggling out of impossible predicaments. But this may be his biggest test yet."
    },
    {
        "title": "Hackers 'behind nursery cyber attack' tell Sky News they are releasing more data on dozens of children",
        "description": "Hackers who claimed to have stolen pictures, names and addresses of over 8,000 children in a cyber attack on a nursery chain have told Sky News they will release the profiles of more children and employees.",
        "url": "https://news.sky.com/story/hackers-behind-nursery-cyber-attack-tell-sky-news-they-are-releasing-more-data-on-dozens-of-children-13438696",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-children-nursery_7031980.jpg?20250926095844",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-26 15:16:00",
        "Headline": "The group, calling itself Radiant, had posted images of children attending the Kido nursery chain in London on the dark web and demanded a ransom from the company.",
        "Content": " Hackers who claimed to have stolen pictures, names and addresses of over 8,000 children in a cyber attack on a nursery chain have told Sky News they will release the profiles of more children and employees. The group, calling itself Radiant, had posted images of children attending the Kido nursery chain in London on the dark web and demanded a ransom from the company. So far, the information released has been restricted to the personal contact details of children who attend the nurseries, as well as their parents and carers. Radiant has told Sky News they intend to imminently release a new set of data, including the profiles of 30 more children and 100 employees. It said the release would include the personal information of the employees including \"full names, national insurance numbers, DOBs [date of births], full addresses, employment start date, email addresses and more\". The stolen information on the children includes medical records, incident reports and the allocation of drugs and medicine given to the children. The group claimed it typically demands around 1.5% of a company's yearly revenue in ransom. Sky News understands the group has not received any money from the Kido nursery group. Read more from Sky News:Harrods customers' details stolen in IT systems breachFarage on course to be next PM, mega poll projectsTerror charge against rapper cannot continue, court says  On Thursday, parents whose children attend a Kido nursery branch told Sky News they had received an email confirming the data incident and had been offered reassurance by the company. An Information Commissioner's Office spokesperson said: \"Kido International has reported an incident to us and we are assessing the information provided.\" The Metropolitan Police said they \"received a referral on Thursday, 25 September, following reports of a ransomware attack on a London-based organisation\". They said enquiries are at the early stages and no arrests have been made. Ciaran Martin, former chief of the National Cyber Security Centre, which is part of the GCHQ spy agency, told Sky News presenter Samantha Washington he believes the nursery chain should not pay the ransom. \"This data is not coming back. That's the bit that isn't reassuring. There is no way of guaranteeing the suppression of this data,\" he said, adding hacking groups often sell the data on to other criminals or use it for scams or fraud. \"And when law enforcement get to this group, even if the nursery pays the ransom, they'll find the data - they won't delete it. They never do. So it won't achieve anything.\" Recent high-profile victims of cyber criminals in the UK include retail giant Marks and Spencer, which lost an estimated £300m in a ransomware attack earlier this year. Meanwhile, the government has been urged to step in this week to support suppliers affected by a cyber attack on Jaguar Land Rover, after the car-making firm was forced to halt production at the end of August. A Kido spokesperson said: \"We recently identified and responded to a cyber incident. We are working with external specialists to investigate and determine what happened in more detail. \"We swiftly informed both our families and the relevant authorities and continue to liaise closely with them.\""
    },
    {
        "title": "Jimmy Kimmel's show back on Sinclair and Nexstar thanks to viewer feedback",
        "description": "Jimmy Kimmel's late-night talk show will return to ABC affiliates belonging to Sinclair and Nexstar after the two major network operators took his programme off-air over his comments in the wake of Charlie Kirk's assassination.",
        "url": "https://news.sky.com/story/jimmy-kimmels-show-back-on-sinclair-and-nexstar-thanks-to-viewer-feedback-13438996",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jimmy-kimmel-show_7030034.jpg?20250924074319",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-26 22:57:00",
        "Headline": "His show was suspended over Kimmel's comments in the wake of conservative activist Charlie Kirk's assassination. Disney announced the return of Jimmy Kimmel Live on Tuesday, but both Sinclair and Nexstar initially said they would not resume airing the programme.",
        "Content": "Jimmy Kimmel's late-night talk show will return to ABC affiliates belonging to Sinclair and Nexstar after the two major network operators took his programme off-air over his comments in the wake of Charlie Kirk's assassination. Kimmel was accused of being \"offensive and insensitive\" after using his programme, Jimmy Kimmel Live, to accuse Donald Trump and his allies of capitalising on the killing. Disney-owned ABC suspended the show last week following threats of potential repercussions from the Trump-appointed head of the Federal Communications Commission. Sinclair, which controls 38 ABC affiliates from Seattle to Washington DC, called on Kimmel to apologise to Mr Kirk's family over the comments and asked him to \"make a meaningful personal donation\" to Turning Point USA, the nonprofit that the conservative activist founded. On Tuesday, Disney announced the return of the programme after backlash to its suspension, but both Sinclair and Nexstar, which own more than 20% of ABC affiliates, initially said they would not resume airing the show. Kimmel criticised the ABC affiliates who preempted his show during his TV return, saying: \"That's not legal. That's not American. It's un-American.\" Three days later, the two major network operators announced that Jimmy Kimmel Live would return to their TV stations after the week-long boycott. \n                  Jessica Chastain criticises decision to delay release of The Savant after Charlie Kirk killing\n                 \n                  Trump makes major shift in Ukraine policy\n                 \n                  Jimmy Kimmel addresses Charlie Kirk comments in first show since being taken off-air\n                 The move came after Sinclair received \"thoughtful feedback from viewers, advertisers and community leaders\". In its statement, the company pointed to its \"responsibility as local broadcasters to provide programming that serves the interests of our communities, while also honouring our obligations to air national network programming.\"  Nexstar, which controls 28 ABC affiliates from Kansas to New Orleans, said in a similar statement that it was airing content that is \"in the best interest of the communities we serve\". Both companies said their decisions were not affected by influence from the Trump administration or anyone else. The president had criticised the programme's return on Tuesday, writing on Truth Social that he \"can't believe\" ABC gave Kimmel his show back and hinted at further action. \"Why would they want someone back who does so poorly, who's not funny, and who puts the Network in jeopardy by playing 99% positive Democrat GARBAGE,\" Mr Trump wrote. \"He is yet another arm of the DNC (Democratic National Committee) and, to the best of my knowledge, that would be a major illegal Campaign Contribution. I think we're going to test ABC out on this.\" During Kimmel's first show since being taken off-air, the presenter said it was \"never my intention to make light of\" Mr Kirk's death. \"I don't think there's anything funny about it,\" he said as he choked up. \"Nor was it my intention to blame any specific group for the actions of what was obviously a deeply disturbed individual. That was really the opposite of the point I was trying to make\". Read more from Sky News:Musk and Prince Andrew named in latest Epstein releaseTrump: 'Looks like we have a deal' to end war in Gaza Speaking on Tuesday night's show, Kimmel said he understood why the remarks \"felt either ill-timed or unclear, or maybe both\". New episodes of Jimmy Kimmel Live air Monday to Thursday, and Friday night's rerun will be of Tuesday's show, meaning viewers of Sinclair stations will be able to watch Kimmel's emotional return to the air."
    },
    {
        "title": "Prince of Wales says 2024 was 'hardest year' of his life",
        "description": "The Prince of Wales has told Schitt's Creek star Eugene Levy that 2024 was the \"hardest year\" of his life.",
        "url": "https://news.sky.com/story/prince-of-wales-says-2024-was-hardest-year-of-his-life-13438963",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-prince-of-wales-eugene-levy_7032834.jpg?20250926230507",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-26 21:25:00",
        "Headline": "The future king told Hollywood star Eugene Levy about last year, which saw his wife, the Princess of Wales, and his father, the King, both undergoing treatment for cancer.",
        "Content": " The Prince of Wales has told Schitt's Creek star Eugene Levy that 2024 was the \"hardest year\" of his life. The future king told the Hollywood star about last year, which saw his wife, the Princess of Wales, and his father, the King, both undergoing treatment for cancer. The pair were catching up over a pint in a pub as part of Apple TV+ series The Reluctant Traveler With Eugene Levy, which will air next month. In the episode Living The Royal Life In The UK, William tells Levy: \"I'd say 2024 was the hardest year I've ever had. \"Life is said to test us as well and being able to overcome that is what makes us who we are.\" The preview of the episode also saw Levy invited to \"pop down\" to Windsor Castle for a private tour by the prince. Levy, 78, can be seen reading out an invitation saying: \"I heard that your travels have brought you to the UK and I wondered if you might like to see Windsor Castle? \n                  Prince William praises 'remarkable legacies' of Southport victims' parents\n                 \n                  Trump100: The King and the Donald\n                 \n                  Sword, book and Union flag among gifts exchanged between the King and Donald Trump\n                 \"If you're free at 10 tomorrow, why don't you pop down to the Castle for a private tour. \"Would be great to see you!\" Read more from Sky News:Hackers 'behind nursery cyber attack' reveal details of threatElon Musk and Prince Andrew named in latest Epstein files release After touring the castle, Levy asks William what he does when he is at home, and the prince laughs and replies: \"Sleep. When you have three small children, sleep is an important part of my life.\" New episodes of The Reluctant Traveler With Eugene Levy will premiere weekly until the finale on 31 October 2025. The special episode with William will air on 3 October."
    },
    {
        "title": "King and Queen set to meet Pope Leo in Vatican state visit",
        "description": "The King and Queen will meet the new Pope during a state visit to Vatican City next month.",
        "url": "https://news.sky.com/story/king-and-queen-set-to-meet-pope-leo-in-vatican-state-visit-13438805",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-king-charles-pope_7032651.jpg?20250926202402",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-26 23:01:00",
        "Headline": "The couple will join Leo XIV, who was elected earlier this year after the death of Pope Francis, in late October to celebrate the 2025 jubilee year, Buckingham Palace has said.",
        "Content": "The King and Queen will meet the new Pope during a state visit to Vatican City next month. The couple will join Leo XIV, who was elected pope earlier this year after the death of Pope Francis, in late October to celebrate the 2025 jubilee year, Buckingham Palace said. The Catholic Church typically marks a papal jubilee every 25 years. Charles and Camilla's visit is expected to celebrate the ecumenical work by the Church of England and the Catholic Church, reflecting the Jubilee year's theme of walking together as \"Pilgrims of Hope\". The King is Supreme Governor of the Church of England, a role which dates back to Henry VIII, who named himself Supreme Head of the Church of England after he was excommunicated by Pope Paul III and broke from the Catholic Church in the 16th century to marry Anne Boleyn. Royal correspondent Postponed from the Italian state visit earlier this year, the King's invitation to the Holy See has both diplomatic and spiritual significance. It symbolises a shared desire from the King and Pope Leo to overcome denominational divisions of the past. The King has a deep respect for religious diversity. Five hundred years ago, it was another Pope Leo - Leo X - who gave Henry VIII the title Defender of the Faith. King Charles has long reflected on the meaning of this title within our modern, multi-faith and increasingly secular society. This has been a year of change for many Christians. Very soon, a new Archbishop of Canterbury will be announced. A protracted process compared with the two-day conclave in Rome. As the Supreme Governor of the Church of England, the King will approve the appointment. The King's recent presence at Westminster Cathedral, attending the requiem mass of the Catholic Duchess of Kent, was seen as an important moment of Christian unity. This state visit will be another example of the continued commitment between the Church of England and the Catholic Church. The King and Queen had a meeting with Pope Francis just 12 days before he died. Their historic state visit to the Vatican in early April was cancelled due to the then-pontiff's poor health, but they managed to visit him privately during their trip to Italy. \n                  Pope Leo's fears for a world gripped by polarisation and a United Nations unable to help\n                 \n                  'There is no more time': Madonna urges the Pope to go to Gaza\n                 \n                  Israel says it 'deeply regrets' deaths at Gaza's only Catholic church\n                 The meeting with Francis, in what would be the final weeks of his life, was arranged at the last minute and took place on their 20th wedding anniversary on 9 April, with the pontiff wanting to personally wish them a happy anniversary. Read more from Sky News:Elon Musk and Prince Andrew named in latest Epstein files releaseWatch moment diplomats walk out as Israeli PM speaks at UN In an official message released following the news of Francis's death on 21 April, the King said he and the Queen were \"most deeply saddened\". In May, Charles sent a private message to Pope Leo XIV congratulating him on his election, Buckingham Palace said."
    },
    {
        "title": "Samaritans warned of volunteer exodus if plans to close branches go ahead",
        "description": "Call handlers at the mental health helpline Samaritans are warning of a mass exodus of volunteers after the charity announced plans to close branches.",
        "url": "https://news.sky.com/story/samaritans-warned-of-volunteer-exodus-if-plans-to-close-branches-go-ahead-13438504",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-samaritans-mental-health_7032160.jpg?20250926123731",
        "type": "Home",
        "Author": "Sadiya Chowdhury",
        "Date Published": "2025-09-26 23:01:00",
        "Headline": "The mental health helpline's CEO, Julie Bentley, had said it was no longer sustainable to have so many branches.",
        "Content": "\n          News correspondent\n              @esadiya\n  Call handlers at the mental health helpline Samaritans are warning of a mass exodus of volunteers after the charity announced plans to close branches. The 'volunteer listeners' say a shortage of people taking calls will lead to longer wait times to have them answered. In July, Samaritans chief executive Julie Bentley said it was no longer sustainable to have so many branches. In a video message to staff, seen by Sky News, she said: \"Many of the branches we have today came into existence at a time when Samaritans was set up as a local service, providing separate local numbers. But that hasn't been the case for some time. \"Our service today doesn't need the number of buildings we currently have.\" Colm Martin, a volunteer listener for five years, said the announcement came \"out of the blue\". \"We cannot make sense of it. This is supposed to be about improving a service and we can't understand how closing half of all of the branches will improve the service or encourage more volunteers to come forward.\" \n                  'Our daughter was unlawfully killed - but loophole means she won't get justice'\n                 \n                  Family sue OpenAI over teenager's death after he confided in ChatGPT\n                 \n                  Ex-classmates died after being treated at same mental health hospital - as concerns raised over other deaths\n                 Mr Martin says he thinks Samaritans will lose volunteers. \"Not because they want to leave, but because they're forced out, because there isn't a branch local to them that they can go to,\" he said. Last year, three million people called the Samaritans in need of support. Its website reads \"every life lost to suicide is a tragedy\". Read more from Sky News:King and Queen set to meet Pope LeoHackers 'behind nursery cyber attack' reveal details of threatMusk and Prince Andrew named in latest Epstein files release About 23,000 trained volunteers work with the charity to listen and provide fast support to those experiencing suicidal thoughts as well as other mental health issues. Ms Bentley told Sky News: \"The improvements we're proposing would mean callers getting through to Samaritans quicker while making it easier for anyone to join our amazing group of volunteers, regardless of their circumstances or busy lifestyles. \"Samaritans will continue to be there for those struggling to cope across the UK and Republic of Ireland, day and night, 365 days a year.\" Surbiton-based Angela remembers calling Samaritans for help 40 years ago when her father was dying of cancer. \"Whenever I reached out to any family member, they'd say 'oh come on, you're strong, you know what you're doing. You're a nurse', she said. \"One night, I just reached an emotional limit. It was about two o'clock in the morning, and I thought 'I'm going to burst here'.\" Angela says she cannot recall how long the call lasted but says it was answered quickly. \"He hardly spoke, he just let me empty all my thoughts and he listened,\" she said. \"That was so powerful to have someone just listening and not interrupting, not dismissing my feelings.\" The charity is set to vote on the proposed changes, which would take place over the next seven to 10 years, this weekend, although in Ireland the consultation process is not due to start until 2027. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. Alternatively, you can call Mind's support line on 0300 102 1234, or NHS on 111."
    },
    {
        "title": "Harrods customers' details stolen in IT systems breach",
        "description": "Harrods has warned its e-commerce customers that their personal data may have been taken in an IT systems breach.",
        "url": "https://news.sky.com/story/harrods-customers-details-stolen-in-it-systems-breach-13438973",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-harrods-london_6727506.jpg?20250926225504",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-26 21:51:00",
        "Headline": "Information like customers' names and contact details was taken after one of Harrods' third-party provider systems was compromised, the luxury department store said in a statement.",
        "Content": "Harrods has warned its e-commerce customers that their personal data may have been taken in an IT systems breach. Information like customers' names and contact details was taken after one of Harrods' third-party provider systems was compromised, the luxury London department store said. Affected customers have been informed and reassured that the impacted data is \"limited to basic personal identifiers\", a spokesperson said. Account passwords or payment details were not affected in the breach. \"The third party has confirmed this is an isolated incident which has been contained, and we are working closely with them to ensure that all appropriate actions are being taken. We have notified all relevant authorities,\" Harrods added. \"No Harrods system has been compromised and it is important to note that the data was taken from a third-party provider.\" This comes four months after the department store restricted internet access as a precautionary measure due to \"attempts to gain unauthorised access\" to some of its systems. \n                  Hackers claim to have stolen pictures, names and addresses of children in nursery firm cyber attack\n                 \n                  Many small firms reliant on Jaguar Land Rover have 'weeks left' before damage 'untenable'\n                 \n                  Man arrested in connection with airports cyber attack\n                 Friday's breach is \"unconnected\" to the attempts in May, the spokesman said. Two men aged 19, a 17-year-old boy and a 20-year-old woman were arrested in July over their suspected involvement in cyber attacks on Harrods, Marks & Spencer, and the Co-op. Read more from Sky News:Jaguar Land Rover shutdown extended after cyber attackTeenagers charged over TfL cyber attack costing millions They were arrested on suspicion of blackmail, money laundering, offences linked ot the Computer Misuse Act, and participating in the activities of an organised crime group, the National Crime Agency said. All four have been bailed pending further inquiries.  It comes as hackers claim to have stolen pictures, names and addresses of thousands of children in a cyber attack on a nursery chain in London. The group, calling itself Radiant, has released personal information about children and staff at the Kido nursery chain on the dark web and demanded a ransom from the company. Radiant told Sky News on Friday it intends to imminently release the profiles of more children and employees."
    },
    {
        "title": "Man arrested after fire at London asylum seeker hotel",
        "description": "A man has been arrested on suspicion of arson with intent to endanger life after a fire at a hotel housing asylum seekers in central London.",
        "url": "https://news.sky.com/story/man-arrested-after-fire-at-london-asylum-seeker-hotel-13438929",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-thistle-city-barbican_7032752.jpg?20250926214645",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-26 21:21:00",
        "Headline": "The blaze took place in the grounds of Thistle City Barbican Hotel in Islington shortly after 10.50pm on Wednesday, the Metropolitan Police said.",
        "Content": "A man has been arrested on suspicion of arson with intent to endanger life after a fire at a hotel housing asylum seekers in central London. The blaze took place in the grounds of Thistle City Barbican Hotel in Islington shortly after 10.50pm on Wednesday, the Metropolitan Police said. The force said the incident was being investigated as a hate crime. The fire was put out by staff at the hotel before police attended. No one was injured. The man, 64, was also arrested on suspicion of possession of a bladed article, police said. He remains in custody. Commander Hayley Sewart, who is leading the investigation for the Met, said: \"I would like to thank my team for their quick and effective work in identifying the suspect and making this arrest. \"We understand the ongoing concern in the local community and our investigation is continuing at pace.\" Read more from Sky News:Hackers 'behind nursery cyber attack' reveal details of threatElon Musk and Prince Andrew named in latest Epstein files release Inquiries are ongoing and the incident continues to be investigated as a hate crime, the force added. Nine people were arrested after a protest and counter-protest took place outside the hotel in August."
    },
    {
        "title": "Hackers 'behind nursery cyber attack' tell Sky News they are releasing more data on dozens of children",
        "description": "Hackers who claimed to have stolen pictures, names and addresses of over 8,000 children in a cyber attack on a nursery chain have told Sky News they will release the profiles of more children and employees.",
        "url": "https://news.sky.com/story/hackers-behind-nursery-cyber-attack-tell-sky-news-they-are-releasing-more-data-on-dozens-of-children-13438696",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-children-nursery_7031980.jpg?20250926095844",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-26 15:16:00",
        "Headline": "The group, calling itself Radiant, had posted images of children attending the Kido nursery chain in London on the dark web and demanded a ransom from the company.",
        "Content": " Hackers who claimed to have stolen pictures, names and addresses of over 8,000 children in a cyber attack on a nursery chain have told Sky News they will release the profiles of more children and employees. The group, calling itself Radiant, had posted images of children attending the Kido nursery chain in London on the dark web and demanded a ransom from the company. So far, the information released has been restricted to the personal contact details of children who attend the nurseries, as well as their parents and carers. Radiant has told Sky News they intend to imminently release a new set of data, including the profiles of 30 more children and 100 employees. It said the release would include the personal information of the employees including \"full names, national insurance numbers, DOBs [date of births], full addresses, employment start date, email addresses and more\". The stolen information on the children includes medical records, incident reports and the allocation of drugs and medicine given to the children. The group claimed it typically demands around 1.5% of a company's yearly revenue in ransom. Sky News understands the group has not received any money from the Kido nursery group. Read more from Sky News:Harrods customers' details stolen in IT systems breachFarage on course to be next PM, mega poll projectsTerror charge against rapper cannot continue, court says  On Thursday, parents whose children attend a Kido nursery branch told Sky News they had received an email confirming the data incident and had been offered reassurance by the company. An Information Commissioner's Office spokesperson said: \"Kido International has reported an incident to us and we are assessing the information provided.\" The Metropolitan Police said they \"received a referral on Thursday, 25 September, following reports of a ransomware attack on a London-based organisation\". They said enquiries are at the early stages and no arrests have been made. Ciaran Martin, former chief of the National Cyber Security Centre, which is part of the GCHQ spy agency, told Sky News presenter Samantha Washington he believes the nursery chain should not pay the ransom. \"This data is not coming back. That's the bit that isn't reassuring. There is no way of guaranteeing the suppression of this data,\" he said, adding hacking groups often sell the data on to other criminals or use it for scams or fraud. \"And when law enforcement get to this group, even if the nursery pays the ransom, they'll find the data - they won't delete it. They never do. So it won't achieve anything.\" Recent high-profile victims of cyber criminals in the UK include retail giant Marks and Spencer, which lost an estimated £300m in a ransomware attack earlier this year. Meanwhile, the government has been urged to step in this week to support suppliers affected by a cyber attack on Jaguar Land Rover, after the car-making firm was forced to halt production at the end of August. A Kido spokesperson said: \"We recently identified and responded to a cyber incident. We are working with external specialists to investigate and determine what happened in more detail. \"We swiftly informed both our families and the relevant authorities and continue to liaise closely with them.\""
    },
    {
        "title": "Samaritans warned of volunteer exodus if plans to close branches go ahead",
        "description": "Call handlers at the mental health helpline Samaritans are warning of a mass exodus of volunteers after the charity announced plans to close branches.",
        "url": "https://news.sky.com/story/samaritans-warned-of-volunteer-exodus-if-plans-to-close-branches-go-ahead-13438504",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-samaritans-mental-health_7032160.jpg?20250926123731",
        "type": "UK",
        "Author": "Sadiya Chowdhury",
        "Date Published": "2025-09-26 23:01:00",
        "Headline": "The mental health helpline's CEO, Julie Bentley, had said it was no longer sustainable to have so many branches.",
        "Content": "\n          News correspondent\n              @esadiya\n  Call handlers at the mental health helpline Samaritans are warning of a mass exodus of volunteers after the charity announced plans to close branches. The 'volunteer listeners' say a shortage of people taking calls will lead to longer wait times to have them answered. In July, Samaritans chief executive Julie Bentley said it was no longer sustainable to have so many branches. In a video message to staff, seen by Sky News, she said: \"Many of the branches we have today came into existence at a time when Samaritans was set up as a local service, providing separate local numbers. But that hasn't been the case for some time. \"Our service today doesn't need the number of buildings we currently have.\" Colm Martin, a volunteer listener for five years, said the announcement came \"out of the blue\". \"We cannot make sense of it. This is supposed to be about improving a service and we can't understand how closing half of all of the branches will improve the service or encourage more volunteers to come forward.\" \n                  'Our daughter was unlawfully killed - but loophole means she won't get justice'\n                 \n                  Family sue OpenAI over teenager's death after he confided in ChatGPT\n                 \n                  Ex-classmates died after being treated at same mental health hospital - as concerns raised over other deaths\n                 Mr Martin says he thinks Samaritans will lose volunteers. \"Not because they want to leave, but because they're forced out, because there isn't a branch local to them that they can go to,\" he said. Last year, three million people called the Samaritans in need of support. Its website reads \"every life lost to suicide is a tragedy\". Read more from Sky News:King and Queen set to meet Pope LeoHackers 'behind nursery cyber attack' reveal details of threatMusk and Prince Andrew named in latest Epstein files release About 23,000 trained volunteers work with the charity to listen and provide fast support to those experiencing suicidal thoughts as well as other mental health issues. Ms Bentley told Sky News: \"The improvements we're proposing would mean callers getting through to Samaritans quicker while making it easier for anyone to join our amazing group of volunteers, regardless of their circumstances or busy lifestyles. \"Samaritans will continue to be there for those struggling to cope across the UK and Republic of Ireland, day and night, 365 days a year.\" Surbiton-based Angela remembers calling Samaritans for help 40 years ago when her father was dying of cancer. \"Whenever I reached out to any family member, they'd say 'oh come on, you're strong, you know what you're doing. You're a nurse', she said. \"One night, I just reached an emotional limit. It was about two o'clock in the morning, and I thought 'I'm going to burst here'.\" Angela says she cannot recall how long the call lasted but says it was answered quickly. \"He hardly spoke, he just let me empty all my thoughts and he listened,\" she said. \"That was so powerful to have someone just listening and not interrupting, not dismissing my feelings.\" The charity is set to vote on the proposed changes, which would take place over the next seven to 10 years, this weekend, although in Ireland the consultation process is not due to start until 2027. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. Alternatively, you can call Mind's support line on 0300 102 1234, or NHS on 111."
    },
    {
        "title": "Elon Musk and Prince Andrew named in latest Epstein files release",
        "description": "Elon Musk's name has appeared in files relating to Jeffrey Epstein, with a reference made to the world's richest man potentially visiting the paedophile's island.",
        "url": "https://news.sky.com/story/elon-musk-and-prince-andrew-named-in-latest-epstein-files-release-13438742",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-elon-musk-x-tesla_7032542.jpg?20250926214813",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-26 18:25:00",
        "Headline": "The Duke of York is named as a passenger on the sex offender's private jet in documents released by Democrats on the House Oversight Committee in the US.",
        "Content": " Elon Musk's name has appeared in files relating to Jeffrey Epstein, with a reference made to the world's richest man potentially visiting the paedophile's island. The Duke of York is also named as a passenger on the sex offender's private jet in documents released by Democrats on the House Oversight Committee in the US. They show Musk as a potential visitor to Epstein's island, Little St James, on 6 December 2014 - six years after Epstein became a listed sex offender. His name appears on what appears to be Epstein's daily schedule, with the entry reading: \"Reminder: Elon Musk to island Dec.6 (is this still happening?)\" Musk issued a broad denial late Friday as he responded to another account's post on the subject on X, saying \"This is false\" without elaborating. In June, Musk claimed Donald Trump appeared in files relating to the disgraced financier and alleged his administration was concealing information about the US president's association with Epstein. He gave no evidence for the claim, which he made on X, and later appeared to have deleted the posts. Sky News has approached Musk for comment.  Prince Andrew named as passenger on Epstein jet The documents also show Prince Andrew as a listed passenger on a flight on Epstein's jet from Teterboro, New Jersey, to Palm Beach, Florida, on 12 May 2000. He is named alongside Epstein, his then-girlfriend Ghislaine Maxwell, who is now a convicted sex trafficker, and two names that have been redacted. Read more from Sky News:Farage on course to be next PM, mega poll projectsTerror charge against rapper cannot continue, court says Details of the duke travelling on Epstein's jet have previously been heard in court in Maxwell's trial. One of her accusers, who was 14 at the time, recalled she had travelled on a flight with Andrew. The duke strenuously denies any wrongdoing. In addition to Musk and the duke, the records also show he was in contact with Microsoft co-founder Bill Gates, PayPal founder Peter Thiel and Steve Bannon, who was Mr Trump's chief strategist during his first term. The names of victims in the records are redacted and the committee said it plans to release more files once they are redacted as well. Duchess of York dropped by charities over Epstein email The release comes days after an email surfaced from Sarah, Duchess of York, to Epstein, in which she apologised to him for disowning him in the media. In the letter, the duchess, Prince Andrew's ex-wife, called the sex offender a \"supreme friend\".  Her spokesperson said the message was written because he had threatened to sue her for defamation. The emergence of the email led to the duchess being dropped by a number of charities she had been a patron of. Earlier this month, Peter Mandelson, the British ambassador to the US, was sacked by Sir Keir Starmer after it was discovered he had also sent messages to Epstein, calling him \"my best pal\", after he was jailed awaiting sex trafficking charges. Epstein was found dead in his cell at a federal jail in Manhattan in August 2019 while he was awaiting trial on sex-trafficking charges. The death was ruled a suicide."
    },
    {
        "title": "King and Queen set to meet Pope Leo in Vatican state visit",
        "description": "The King and Queen will meet the new Pope during a state visit to Vatican City next month.",
        "url": "https://news.sky.com/story/king-and-queen-set-to-meet-pope-leo-in-vatican-state-visit-13438805",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-king-charles-pope_7032651.jpg?20250926202402",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-26 23:01:00",
        "Headline": "The couple will join Leo XIV, who was elected earlier this year after the death of Pope Francis, in late October to celebrate the 2025 jubilee year, Buckingham Palace has said.",
        "Content": "The King and Queen will meet the new Pope during a state visit to Vatican City next month. The couple will join Leo XIV, who was elected pope earlier this year after the death of Pope Francis, in late October to celebrate the 2025 jubilee year, Buckingham Palace said. The Catholic Church typically marks a papal jubilee every 25 years. Charles and Camilla's visit is expected to celebrate the ecumenical work by the Church of England and the Catholic Church, reflecting the Jubilee year's theme of walking together as \"Pilgrims of Hope\". The King is Supreme Governor of the Church of England, a role which dates back to Henry VIII, who named himself Supreme Head of the Church of England after he was excommunicated by Pope Paul III and broke from the Catholic Church in the 16th century to marry Anne Boleyn. Royal correspondent Postponed from the Italian state visit earlier this year, the King's invitation to the Holy See has both diplomatic and spiritual significance. It symbolises a shared desire from the King and Pope Leo to overcome denominational divisions of the past. The King has a deep respect for religious diversity. Five hundred years ago, it was another Pope Leo - Leo X - who gave Henry VIII the title Defender of the Faith. King Charles has long reflected on the meaning of this title within our modern, multi-faith and increasingly secular society. This has been a year of change for many Christians. Very soon, a new Archbishop of Canterbury will be announced. A protracted process compared with the two-day conclave in Rome. As the Supreme Governor of the Church of England, the King will approve the appointment. The King's recent presence at Westminster Cathedral, attending the requiem mass of the Catholic Duchess of Kent, was seen as an important moment of Christian unity. This state visit will be another example of the continued commitment between the Church of England and the Catholic Church. The King and Queen had a meeting with Pope Francis just 12 days before he died. Their historic state visit to the Vatican in early April was cancelled due to the then-pontiff's poor health, but they managed to visit him privately during their trip to Italy. \n                  Pope Leo's fears for a world gripped by polarisation and a United Nations unable to help\n                 \n                  'There is no more time': Madonna urges the Pope to go to Gaza\n                 \n                  Israel says it 'deeply regrets' deaths at Gaza's only Catholic church\n                 The meeting with Francis, in what would be the final weeks of his life, was arranged at the last minute and took place on their 20th wedding anniversary on 9 April, with the pontiff wanting to personally wish them a happy anniversary. Read more from Sky News:Elon Musk and Prince Andrew named in latest Epstein files releaseWatch moment diplomats walk out as Israeli PM speaks at UN In an official message released following the news of Francis's death on 21 April, the King said he and the Queen were \"most deeply saddened\". In May, Charles sent a private message to Pope Leo XIV congratulating him on his election, Buckingham Palace said."
    },
    {
        "title": "Man arrested after fire at London asylum seeker hotel",
        "description": "A man has been arrested on suspicion of arson with intent to endanger life after a fire at a hotel housing asylum seekers in central London.",
        "url": "https://news.sky.com/story/man-arrested-after-fire-at-london-asylum-seeker-hotel-13438929",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-thistle-city-barbican_7032752.jpg?20250926214645",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-26 21:21:00",
        "Headline": "The blaze took place in the grounds of Thistle City Barbican Hotel in Islington shortly after 10.50pm on Wednesday, the Metropolitan Police said.",
        "Content": "A man has been arrested on suspicion of arson with intent to endanger life after a fire at a hotel housing asylum seekers in central London. The blaze took place in the grounds of Thistle City Barbican Hotel in Islington shortly after 10.50pm on Wednesday, the Metropolitan Police said. The force said the incident was being investigated as a hate crime. The fire was put out by staff at the hotel before police attended. No one was injured. The man, 64, was also arrested on suspicion of possession of a bladed article, police said. He remains in custody. Commander Hayley Sewart, who is leading the investigation for the Met, said: \"I would like to thank my team for their quick and effective work in identifying the suspect and making this arrest. \"We understand the ongoing concern in the local community and our investigation is continuing at pace.\" Read more from Sky News:Hackers 'behind nursery cyber attack' reveal details of threatElon Musk and Prince Andrew named in latest Epstein files release Inquiries are ongoing and the incident continues to be investigated as a hate crime, the force added. Nine people were arrested after a protest and counter-protest took place outside the hotel in August."
    },
    {
        "title": "Prince of Wales says 2024 was 'hardest year' of his life",
        "description": "The Prince of Wales has told Schitt's Creek star Eugene Levy that 2024 was the \"hardest year\" of his life.",
        "url": "https://news.sky.com/story/prince-of-wales-says-2024-was-hardest-year-of-his-life-13438963",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-prince-of-wales-eugene-levy_7032834.jpg?20250926230507",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-26 21:25:00",
        "Headline": "The future king told Hollywood star Eugene Levy about last year, which saw his wife, the Princess of Wales, and his father, the King, both undergoing treatment for cancer.",
        "Content": " The Prince of Wales has told Schitt's Creek star Eugene Levy that 2024 was the \"hardest year\" of his life. The future king told the Hollywood star about last year, which saw his wife, the Princess of Wales, and his father, the King, both undergoing treatment for cancer. The pair were catching up over a pint in a pub as part of Apple TV+ series The Reluctant Traveler With Eugene Levy, which will air next month. In the episode Living The Royal Life In The UK, William tells Levy: \"I'd say 2024 was the hardest year I've ever had. \"Life is said to test us as well and being able to overcome that is what makes us who we are.\" The preview of the episode also saw Levy invited to \"pop down\" to Windsor Castle for a private tour by the prince. Levy, 78, can be seen reading out an invitation saying: \"I heard that your travels have brought you to the UK and I wondered if you might like to see Windsor Castle? \n                  Prince William praises 'remarkable legacies' of Southport victims' parents\n                 \n                  Trump100: The King and the Donald\n                 \n                  Sword, book and Union flag among gifts exchanged between the King and Donald Trump\n                 \"If you're free at 10 tomorrow, why don't you pop down to the Castle for a private tour. \"Would be great to see you!\" Read more from Sky News:Hackers 'behind nursery cyber attack' reveal details of threatElon Musk and Prince Andrew named in latest Epstein files release After touring the castle, Levy asks William what he does when he is at home, and the prince laughs and replies: \"Sleep. When you have three small children, sleep is an important part of my life.\" New episodes of The Reluctant Traveler With Eugene Levy will premiere weekly until the finale on 31 October 2025. The special episode with William will air on 3 October."
    },
    {
        "title": "Harrods customers' details stolen in IT systems breach",
        "description": "Harrods has warned its e-commerce customers that their personal data may have been taken in an IT systems breach.",
        "url": "https://news.sky.com/story/harrods-customers-details-stolen-in-it-systems-breach-13438973",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-harrods-london_6727506.jpg?20250926225504",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-26 21:51:00",
        "Headline": "Information like customers' names and contact details was taken after one of Harrods' third-party provider systems was compromised, the luxury department store said in a statement.",
        "Content": "Harrods has warned its e-commerce customers that their personal data may have been taken in an IT systems breach. Information like customers' names and contact details was taken after one of Harrods' third-party provider systems was compromised, the luxury London department store said. Affected customers have been informed and reassured that the impacted data is \"limited to basic personal identifiers\", a spokesperson said. Account passwords or payment details were not affected in the breach. \"The third party has confirmed this is an isolated incident which has been contained, and we are working closely with them to ensure that all appropriate actions are being taken. We have notified all relevant authorities,\" Harrods added. \"No Harrods system has been compromised and it is important to note that the data was taken from a third-party provider.\" This comes four months after the department store restricted internet access as a precautionary measure due to \"attempts to gain unauthorised access\" to some of its systems. \n                  Hackers claim to have stolen pictures, names and addresses of children in nursery firm cyber attack\n                 \n                  Many small firms reliant on Jaguar Land Rover have 'weeks left' before damage 'untenable'\n                 \n                  Man arrested in connection with airports cyber attack\n                 Friday's breach is \"unconnected\" to the attempts in May, the spokesman said. Two men aged 19, a 17-year-old boy and a 20-year-old woman were arrested in July over their suspected involvement in cyber attacks on Harrods, Marks & Spencer, and the Co-op. Read more from Sky News:Jaguar Land Rover shutdown extended after cyber attackTeenagers charged over TfL cyber attack costing millions They were arrested on suspicion of blackmail, money laundering, offences linked ot the Computer Misuse Act, and participating in the activities of an organised crime group, the National Crime Agency said. All four have been bailed pending further inquiries.  It comes as hackers claim to have stolen pictures, names and addresses of thousands of children in a cyber attack on a nursery chain in London. The group, calling itself Radiant, has released personal information about children and staff at the Kido nursery chain on the dark web and demanded a ransom from the company. Radiant told Sky News on Friday it intends to imminently release the profiles of more children and employees."
    },
    {
        "title": "Billy Vigar: FA to conduct safety review after death of ex-Arsenal academy player",
        "description": "The FA will review the safety of walls surrounding pitches at lower-league football grounds after the death of former Arsenal academy player Billy Vigar.",
        "url": "https://news.sky.com/story/billy-vigar-fa-to-conduct-safety-review-after-death-of-ex-arsenal-academy-player-13438736",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-billy-vigar-arsenal_7031783.jpg?20250926071512",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-26 18:06:00",
        "Headline": "Billy Vigar, who made one appearance in the EFL Trophy for Arsenal, died on Thursday after suffering a brain injury.",
        "Content": "The FA will review the safety of walls surrounding pitches at lower-league football grounds after the death of former Arsenal academy player Billy Vigar. The 21-year-old died on Thursday after sustaining a \"significant brain injury\" while playing for Chichester City at Wingate and Finchley FC last weekend. It has been reported that he collided with a concrete wall. The FA said on Friday it would conduct an immediate review of the safety of perimeter walls and boundaries in the National League system. A statement read: \"While the health and safety of participants and spectators at the National League System level is the responsibility of the clubs and their local authorities, we will now conduct an immediate review, working with leagues, clubs and relevant stakeholders across the game, that will focus on the safety of perimeter walls and boundaries around pitches in the National League System. \"This will include looking at ways we can assist National League System clubs to identify and implement additional measures at their stadiums that they determine will help to mitigate any potential safety risks.\" Chichester, who play in the Isthmian League Premier Division, have postponed Saturday's scheduled match against Lewes. The Professional Footballers' Association's chief, Maheta Molango, said there needed to be a formal investigation into the incident, having first urged the FA to act on the issue two years ago. He said: \"All footballers should expect to be safe when they go out to play or train, and to not be put at unnecessary and avoidable risk by factors beyond their control. \"When we previously highlighted potential safety issues in grounds and stadiums, the Sports Minister and I wrote to all the football authorities to urge them to be proactive on this and to make sure all their rules and regulations around player safety were fit for purpose. \"Again, whilst it is important that a proper investigation is allowed to conclude, we have to ensure that opportunities to make grounds safer for players have not been missed and that players don't feel that serious incidents involving their safety are necessary to prompt change.\" Vigar had joined Arsenal's academy, on schoolboy terms, aged 14, before earning a full-time scholarship for the 2020/21 season. He left the Premier League side in 2024 after making one appearance in the EFL Trophy. The striker, who also had loan spells at Derby Under-21s and Eastbourne Borough, signed for Hastings before moving to Chichester last month."
    },
    {
        "title": "Wallace and Gromit creator talks clay and creativity - as he returns home to reopen museum",
        "description": "It's hard to believe it's 35 years since a plasticine man in a sweater and slippers, along with his voiceless, but hugely expressive dog, burst on to our screens and won the hearts of millions with their mix of humour, charm and nostalgia.",
        "url": "https://news.sky.com/story/wallace-and-gromit-creator-talks-clay-and-creativity-as-he-returns-home-to-reopen-museum-13438652",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-wallace-and-gromit_7032389.jpg?20250926154530",
        "type": "UK",
        "Author": "Charlotte Leeming, north of England correspondent",
        "Date Published": "2025-09-26 14:15:00",
        "Headline": "A new Wallace and Gromit exhibition is being showcased at the Harris Museum in Preston, which the hit show's creator Nick Park visited frequently growing up.",
        "Content": "By Charlotte Leeming, north of England correspondent   It's hard to believe it's 35 years since a plasticine man in a sweater and slippers, along with his voiceless, but hugely expressive dog, burst on to our screens and won the hearts of millions with their mix of humour, charm and nostalgia. Wallace and Gromit managed to be both familiar and fresh, and their modest creator Nick Park couldn't have foreseen how their handmade adventures would change the world of animation and make Wensleydale cheese internationally famous. But three decades on and Preston-born Park is beginning to realise that his flair for feel-good filmmaking has made him a very big deal. Oscar wins and box office hits aside, his latest accolade, in the Lancashire city where he was born and bred, clearly means a lot. A new Wallace and Gromit exhibition is being showcased at the Harris Museum, which Park visited frequently growing up. The historic landmark looms large over the city centre and is filled with artefacts and treasures that inspired him as a boy. He was drawn to the library and devoured books on his favourite subject, you guessed it, animation. The museum has been closed for four years as part of a £19m revamp. And who better to re-open it this weekend than Park. As we meet at the exhibition, he tells me he was a quiet child who loved drawing. Visits to the museum helped shape his creativity and storytelling. He said: \"I used to love spending a day around here looking at all the artefacts, the paintings. I used to come to the library here, there was no internet, and so I would look for books on animation. \"I would scour the library for anything I could get my hands on.\" We chat in a life-size replica of Wallace and Gromit's living room. The wallpaper, standing lamp and armchair are so familiar. Park says it's like sitting in one of his own sets. The living room was actually based on his grandma's house, which he describes as a cosy 1960s home. And as he sits in the chair with his cup of tea, he jokes that he's now turned into Wallace. He said: \"I feel like I'm made of clay, sitting on a replica set, it's just incredible.\" But that's the joy of his films - the personal touch. And whilst they're unmistakably Northern, inspired by Park's family and upbringing, they're also universally relatable. He said: \"I used to draw from my own childhood a lot, and that's what inspired me. Because it feels true to do that. \"So, I went to memories of my granny, the lamp stand that my granny had and other objects, toasters, clocks, you name it.\" Park is now arguably as famous as his much-loved characters. Something he seems to be finally getting used to. He says he's honoured and a little overwhelmed that his hometown holds him and his clay creations so close to his heart. He said: \"I was a shy teenager, and just talking about this hobby, I never imagined they would become household names. \"So, to have statues of my characters in the centre of town and now to be opening this newly refurbished exhibition and my own exhibition. To be here with my own characters, it's just crazy.\" Read more from Sky News:Pokemon pushes back against ICE deportation videoStar criticises decision to delay release of new show after Charlie Kirk killing I ask what this stop motion supremo makes of the use of AI and technology in film. He said: \"We need to hang onto our values, there's something about handmade quality that gives everything charm and appeal. \"It would probably be wrong to completely ignore that.\" The exhibition is immersive and emotive. Being up close and personal with the models, drawings, and characters evokes the same feelings as the films do. Warmth, humour and nostalgia. A journey through the formative years of a young filmmaker and the birth of one of cinema's unlikeliest heroes. Park is now inspiring the next generation of storytellers and filmmakers at the museum, which played such an important part in his own success story. Wallace and Gromit in A Case at the Museum Exhibition opens on Sunday and runs until January."
    },
    {
        "title": "Policeman, 24, dies after being hit by car in Northamptonshire",
        "description": "A policeman has died after being hit by a car while responding to a collision.",
        "url": "https://news.sky.com/story/policeman-24-dies-after-being-hit-by-car-in-northamptonshire-13438764",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-police-officer-dies_7032559.png?20250926191238",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-26 17:32:00",
        "Headline": "PC Faizaan Najeeb died aged 24 after he was hit by a VW Polo.",
        "Content": "A policeman has died after being hit by a car while responding to a collision. PC Faizaan Najeeb, 24, was critically injured after he was hit by the blue VW Polo on 19 September. He was responding to a single vehicle collision in Station Road, Raunds, Northamptonshire, at around 12.35am. PC Najeeb was rushed to hospital but was pronounced dead earlier on Friday. A man in his 20s was arrested at the scene of the collision and has been bailed by police, pending further investigation. PC Najeeb had joined Northamptonshire Police in May 2022 and had served with the Response team in Wellingborough since. His collar number P1967, as is tradition for officers who die on duty, will be retired in his memory. \n                  Second arrest after man found dead on bench near Northampton canal\n                 \n                  Harry Dunn's family file complaint against former police chief after report\n                 \n                  Police admit failures in Harry Dunn case after report finds officers prioritised suspect's welfare\n                 Chief Constable Ivan Balhatchet, who announced the news on Friday, said: \"Words cannot describe the sadness felt when an officer loses his life serving in the line of duty. \"The entire Northamptonshire Police family wish to pass on our deepest condolences to his family and friends at this truly awful point in time. \"Colleagues from the Serious Collision Investigation Unit are still investigating the collision, and specialist family liaison officers will continue to support Faizaan's family in the coming days and weeks. \"We are also carrying out an internal health and safety investigation.\""
    },
    {
        "title": "Elon Musk and Prince Andrew named in latest Epstein files release",
        "description": "Elon Musk's name has appeared in files relating to Jeffrey Epstein, with a reference made to the world's richest man potentially visiting the paedophile's island.",
        "url": "https://news.sky.com/story/elon-musk-and-prince-andrew-named-in-latest-epstein-files-release-13438742",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-elon-musk-x-tesla_7032542.jpg?20250926214813",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-26 18:25:00",
        "Headline": "The Duke of York is named as a passenger on the sex offender's private jet in documents released by Democrats on the House Oversight Committee in the US.",
        "Content": " Elon Musk's name has appeared in files relating to Jeffrey Epstein, with a reference made to the world's richest man potentially visiting the paedophile's island. The Duke of York is also named as a passenger on the sex offender's private jet in documents released by Democrats on the House Oversight Committee in the US. They show Musk as a potential visitor to Epstein's island, Little St James, on 6 December 2014 - six years after Epstein became a listed sex offender. His name appears on what appears to be Epstein's daily schedule, with the entry reading: \"Reminder: Elon Musk to island Dec.6 (is this still happening?)\" Musk issued a broad denial late Friday as he responded to another account's post on the subject on X, saying \"This is false\" without elaborating. In June, Musk claimed Donald Trump appeared in files relating to the disgraced financier and alleged his administration was concealing information about the US president's association with Epstein. He gave no evidence for the claim, which he made on X, and later appeared to have deleted the posts. Sky News has approached Musk for comment.  Prince Andrew named as passenger on Epstein jet The documents also show Prince Andrew as a listed passenger on a flight on Epstein's jet from Teterboro, New Jersey, to Palm Beach, Florida, on 12 May 2000. He is named alongside Epstein, his then-girlfriend Ghislaine Maxwell, who is now a convicted sex trafficker, and two names that have been redacted. Read more from Sky News:Farage on course to be next PM, mega poll projectsTerror charge against rapper cannot continue, court says Details of the duke travelling on Epstein's jet have previously been heard in court in Maxwell's trial. One of her accusers, who was 14 at the time, recalled she had travelled on a flight with Andrew. The duke strenuously denies any wrongdoing. In addition to Musk and the duke, the records also show he was in contact with Microsoft co-founder Bill Gates, PayPal founder Peter Thiel and Steve Bannon, who was Mr Trump's chief strategist during his first term. The names of victims in the records are redacted and the committee said it plans to release more files once they are redacted as well. Duchess of York dropped by charities over Epstein email The release comes days after an email surfaced from Sarah, Duchess of York, to Epstein, in which she apologised to him for disowning him in the media. In the letter, the duchess, Prince Andrew's ex-wife, called the sex offender a \"supreme friend\".  Her spokesperson said the message was written because he had threatened to sue her for defamation. The emergence of the email led to the duchess being dropped by a number of charities she had been a patron of. Earlier this month, Peter Mandelson, the British ambassador to the US, was sacked by Sir Keir Starmer after it was discovered he had also sent messages to Epstein, calling him \"my best pal\", after he was jailed awaiting sex trafficking charges. Epstein was found dead in his cell at a federal jail in Manhattan in August 2019 while he was awaiting trial on sex-trafficking charges. The death was ruled a suicide."
    },
    {
        "title": "Watch moment diplomats walk out as Israeli PM Netanyahu speaks at UN",
        "description": "Dozens of diplomats have walked out of the UN's assembly hall as Israel's prime minister took to the podium to speak.",
        "url": "https://news.sky.com/story/watch-the-moment-diplomats-walk-out-as-israeli-pm-speaks-at-un-13438551",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-benjamin-netanyahu_7032268.jpg?20250926140803",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-26 11:51:00",
        "Headline": "As the session's chairman called for order, there were boos and cheers while delegates streamed out, leaving masses of empty seats.",
        "Content": " Dozens of diplomats have walked out of the UN's assembly hall as Israel's prime minister took to the podium to speak. As the session's chairman called for order, there were boos and cheers while delegates streamed out, leaving masses of empty seats. Benjamin Netanyahu used his speech to speak directly to the hostages held in Gaza and their captors. UN latest: Dozens of delegates walk out on Netanyahu's UN address in protest He said loudspeakers had been put up around the territory and said Israeli spies had hacked mobile phones in Gaza so they carried his voice. To the hostages, he said: \"We have not forgotten you... we will not falter, we will not rest until we have brought all of you home.\" To Hamas's leadership, he said: \"Lay down your arms... free the hostages now. If you do you will live, if you don't Israel will hunt you down.\" He hit out at \"false charge of genocide\" and said: \"If Hamas agrees to demands, war could end.\"  Mr Netanyahu held a map of the region and crossed out the various threats he said had been eliminated, such as Hezbollah and Iran's nuclear capabilities. \"Israel rebounded from its darkest day to deliver one of the most stunning military comebacks in history,\" he said. Meanwhile, Donald Trump said he believes the US has reached a deal on easing fighting in Gaza, saying it \"will get the hostages back\" and \"end the war\". \"I think we maybe have a deal on Gaza, very close to a deal on Gaza,\" the US president told reporters on the White House lawn as he was leaving to attend the Ryder Cup. Mr Trump has repeatedly claimed an agreement to end the war was imminent, only for nothing to materialise. Weeks ago, he said: \"I think we're going to have a deal on Gaza very soon.\" It comes soon after the UK, France, Canada and Australia formally recognised a Palestinian state in an effort to keep alive the prospect of a two-state solution. The war in Gaza has been going on for nearly two years, with UN agencies and its chief repeatedly warning over the dire humanitarian situation. Israel's recently launched ground assault on Gaza City has only heightened concerns and seen thousands flee south in fear for their lives. Israel says it's designed to destroy what remains of Hamas after its October 2023 terror attack killed more than 1,200 people and kidnapped 251. The Israeli leader insisted Israel had to \"finish the job\" to ensure the atrocity is not repeated. \"They beheaded men. They raped women. They burned babies alive. They burned babies alive in front of their parents,\" he told the UN. Lead world news presenter Even before Benjamin Netanyahu reached the lectern on the floor of the United Nations General Assembly, dozens of diplomats had walked out of the cavernous hall.  The Israeli delegation attempted to counter this performative display by putting forward one of their own - cheering and giving a standing ovation at the appearance of their prime minister.  Almost immediately, Netanyahu did what he often does in these speeches - unfurling props, including a map of the region, and ticking off one by one the threats that have long menaced the Jewish State.  However, while Netanyahu attempted to remind the few still seated in the chamber about the horrors of the 7 October terrorist attack by Hamas, the principal impression from inside the room was of how isolated from the world the Israeli leader has become.  Underscoring this further was the circuitous path that Netanyahu's jet had to take in order to reach New York, winding its way around European countries to avoid the airspace of those potentially sympathetic to an ICC arrest warrant. \n Netanyahu's speech was broadcast live into Gaza - via Israeli military vehicles carrying loudspeakers - where he sent a message to the hostages and issued a threat to Hamas: \"Lay down your arms, free the hostages.\"  But throughout the week here in New York, the frustration at Netanyahu has been palpable, even among many of Israel's closest friends and supporters.  First, Britain, France, Australia, and Canada recognised a Palestinian state in a rebuke to Netanyahu. Now it seems that Israel's strongest and most important ally, Donald Trump, may have had enough too.  The US President, in a meeting with Muslim and Arab leaders earlier this week, reportedly assured them that he will bring an end to the Israeli war in Gaza and prevent Benjamin Netanyahu from annexing the West Bank. \n In an exclusive interview with Sky News, Saudi Arabia's Foreign Minister told me Trump is \"very, very committed\" to a pathway to peace to end the suffering of the Palestinian people.  Netanyahu is due to meet Trump at the White House early next week. After decades in public life, even Netanyahu's fiercest critics acknowledge his political skills and unmatched survival instincts; the question now is - with Trump, has he finally met his match?  Mr Netanyahu previously condemned the recognition of a Palestinian state by Western powers, saying it only rewarded Hamas and made it harder to win the release of the remaining hostages. There are fears he could retaliate by annexing the West Bank and recognising Israeli control over illegal settlements. However, Mr Trump - the only world leader believed to hold any sway over Israel - told reporters on Thursday he would \"not allow it\". The Israeli leader is subject to an arrest warrant from the International Criminal Court, which has accused him of crimes against humanity, which he denies. More than 65,000 Palestinians in Gaza have been killed in the war, according to the country's Hamas-run health ministry. Its figure does not differentiate between civilians and fighters. Ninety per cent of its population has also been displaced by attacks that have flattened most of the territory and left many people desperately short of food. 'Weak-kneed' Western leaders The Israeli prime minister told the UN \"the war could end right now\" if Gaza agreed to its demands. \"Israel would retain overriding security control, and a peaceful civilian authority would be established by Gazans and others committed to peace with Israel.\"  He also hit out at \"weak-kneed\" Western leaders who he accused of giving in to biased media and antisemitic mobs. \"For much of the past two years, Israel has had to fight a seven-front war against barbarism, with many of your nations opposing us,\" said Mr Netanyahu. He denied that his military was deliberately targeting civilians and referenced an assessment that it was taking more \"measures to minimise civilian casualties than any military in history\". Denying genocide claims, the prime minister said the \"truth had been turned on its head\" and cited his forces dropping millions of leaflets and sending text messages telling people to flee prior to attacks. "
    },
    {
        "title": "Netanyahu is famous for wriggling out of impossible predicaments - but this may be his biggest test yet",
        "description": "They call Benjamin Netanyahu the Houdini of the Middle East. Can he wriggle out of the straitjacket being prepared for him?",
        "url": "https://news.sky.com/story/netanyahu-is-famous-for-wriggling-out-of-impossible-predicaments-but-this-may-be-his-biggest-test-yet-13438831",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-netanyahu-un_7032625.jpg?20250926200927",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-09-26 18:57:00",
        "Headline": "Can the Israeli prime minister - known as the \"Houdini of the Middle East\" - wriggle out of the straitjacket being prepared for him?",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  They call Benjamin Netanyahu the Houdini of the Middle East. Can he wriggle out of the straitjacket being prepared for him? Donald Trump appears to be indicating that time is running out for the Israeli offensive in Gaza. The Arab and Muslim leaders he met here at the UN General Assembly this week are warning him that his signature foreign policy achievement is in jeopardy because of the war. The Abraham Accords normalised relations between Israel and the Gulf states, the UAE and Bahrain. But Israeli threats to annexe the West Bank and the relentless campaign in Gaza are threatening to unravel them.  The Trump team have a 21-point Gaza peace plan. Broadly speaking, it envisions the gradual withdrawal of Israeli forces, the release of the hostages, and an international security force in Gaza. But it also envisions the eventual return of the Palestinian Authority to run Gaza and makes no mention of Israeli settlements. On both points, the plan is at odds with the hopes of Netanyahu's far-right coalition allies, upon whose support he relies to stay in power. More than that, judging from his speech at the UN, Netanyahu is in no mood for an end to the war, not yet. He still wants to \"finish off the job\", he says, and is yearning for a \"speedy victory\". His generals are less optimistic. Commanders have warned his cabinet that the prospects of total success are limited and there are considerable risks.  There are political considerations, too, driven by Netanyahu's survival instincts. The sooner the war ends, the greater the likelihood of Netanyahu's coalition disintegrating and the prime minister facing the reckoning he has long avoided over his blame for October 7th. Trump has been more than generous in giving Netanyahu leeway to pursue a campaign Israel's allies lost patience with months ago. But Trump has a plan now, and the prospect of a breakthrough will be tantalising for a deal-hungry president. Not to mention the peril facing the Abrahamic grand bargain of his first term in office. Netanyahu is a magician famous for wriggling out of impossible predicaments. But this may be his biggest test yet."
    },
    {
        "title": "King and Queen set to meet Pope Leo in Vatican state visit",
        "description": "The King and Queen will meet the new Pope during a state visit to Vatican City next month.",
        "url": "https://news.sky.com/story/king-and-queen-set-to-meet-pope-leo-in-vatican-state-visit-13438805",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-king-charles-pope_7032651.jpg?20250926202402",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-26 23:01:00",
        "Headline": "The couple will join Leo XIV, who was elected earlier this year after the death of Pope Francis, in late October to celebrate the 2025 jubilee year, Buckingham Palace has said.",
        "Content": "The King and Queen will meet the new Pope during a state visit to Vatican City next month. The couple will join Leo XIV, who was elected pope earlier this year after the death of Pope Francis, in late October to celebrate the 2025 jubilee year, Buckingham Palace said. The Catholic Church typically marks a papal jubilee every 25 years. Charles and Camilla's visit is expected to celebrate the ecumenical work by the Church of England and the Catholic Church, reflecting the Jubilee year's theme of walking together as \"Pilgrims of Hope\". The King is Supreme Governor of the Church of England, a role which dates back to Henry VIII, who named himself Supreme Head of the Church of England after he was excommunicated by Pope Paul III and broke from the Catholic Church in the 16th century to marry Anne Boleyn. Royal correspondent Postponed from the Italian state visit earlier this year, the King's invitation to the Holy See has both diplomatic and spiritual significance. It symbolises a shared desire from the King and Pope Leo to overcome denominational divisions of the past. The King has a deep respect for religious diversity. Five hundred years ago, it was another Pope Leo - Leo X - who gave Henry VIII the title Defender of the Faith. King Charles has long reflected on the meaning of this title within our modern, multi-faith and increasingly secular society. This has been a year of change for many Christians. Very soon, a new Archbishop of Canterbury will be announced. A protracted process compared with the two-day conclave in Rome. As the Supreme Governor of the Church of England, the King will approve the appointment. The King's recent presence at Westminster Cathedral, attending the requiem mass of the Catholic Duchess of Kent, was seen as an important moment of Christian unity. This state visit will be another example of the continued commitment between the Church of England and the Catholic Church. The King and Queen had a meeting with Pope Francis just 12 days before he died. Their historic state visit to the Vatican in early April was cancelled due to the then-pontiff's poor health, but they managed to visit him privately during their trip to Italy. \n                  Pope Leo's fears for a world gripped by polarisation and a United Nations unable to help\n                 \n                  'There is no more time': Madonna urges the Pope to go to Gaza\n                 \n                  Israel says it 'deeply regrets' deaths at Gaza's only Catholic church\n                 The meeting with Francis, in what would be the final weeks of his life, was arranged at the last minute and took place on their 20th wedding anniversary on 9 April, with the pontiff wanting to personally wish them a happy anniversary. Read more from Sky News:Elon Musk and Prince Andrew named in latest Epstein files releaseWatch moment diplomats walk out as Israeli PM speaks at UN In an official message released following the news of Francis's death on 21 April, the King said he and the Queen were \"most deeply saddened\". In May, Charles sent a private message to Pope Leo XIV congratulating him on his election, Buckingham Palace said."
    },
    {
        "title": "Gunman who targeted NFL HQ 'had brain disease that's linked to playing American football'",
        "description": "A gunman who murdered four people in a New York office building before taking his own life had CTE, a degenerative brain disease which has been linked to playing American football.",
        "url": "https://news.sky.com/story/gunman-who-targeted-skyscraper-housing-nfl-hq-had-brain-disease-thats-linked-to-playing-american-football-13438862",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-new-york-shooting-manhattan_6976519.jpg?20250729073422",
        "type": "World",
        "Author": "Martha Kelner",
        "Date Published": "2025-09-26 20:13:00",
        "Headline": "It is believed Shane Tamura carried out the deadly shooting at the Manhattan skyscraper because it housed the headquarters of the NFL. ",
        "Content": "\n          US correspondent\n              @marthakelner\n A gunman who murdered four people in a New York office building before taking his own life had CTE, a degenerative brain disease which has been linked to playing American football. It is believed Shane Tamura targeted the skyscraper in Manhattan because it houses the headquarters of the NFL. The 27-year-old, who played high school football, had \"unambiguous diagnostic evidence\" of low-stage CTE, or chronic traumatic encephalopathy, the New York City medical examiner said. In a three-page note discovered by police after the mass shooting, Tamura made repeated references to CTE. In his note, which was written on notepad paper and using a variety of ink, Tamura wrote \"CTE study my brain please. I'm sorry.\" And again: \"Please study brain for CTE. I'm sorry.\" He also specifically refers to Terry Long, a former NFL player who starred for the Pittsburgh Steelers. Long was diagnosed with CTE after drinking antifreeze to take his own life 20 years ago. CTE can only be diagnosed after death via post mortem. In a statement, the NFL said: \"We continue to grieve the senseless loss of lives, and our hearts remain with the victims’ families and our dedicated employees. \"There is no justification for the horrific acts that took place. As the medical examiner notes ‘the science around this condition continues to evolve, and the physical and mental manifestations of CTE remain under study’.\"  A Sky News investigation last year explored the link between CTE and violent attacks, including mass murder.  We looked at the case of former high school football player Noah Green. He was 25 when he crashed into a security cordon protecting the capitol building in Washington DC and stabbed police officer William Evans to death, before he too was shot dead by responding police. Green's mother, Mazie, told me she believes his crime was caused by brain injuries sustained on the American football field. He also had CTE. The theory of a link between CTE and violent crime is increasingly cited in the courtroom.  Kellen Winslow, a former NFL player, argued for his sentence for multiple rapes to be reduced because of head trauma suffered on the football field. Former San Francisco 49ers star Phillip Adams shocked the country when he shot dead six people, including grandparents and their two grandchildren, then himself in 2021. He had severe CTE."
    },
    {
        "title": "Tony Blair being lined up to lead temporary Gaza administration - reports",
        "description": "Sir Tony Blair is being lined up to lead a temporary administration in the Gaza Strip to oversee reconstruction after the war, according to Israeli media reports.",
        "url": "https://news.sky.com/story/tony-blair-being-lined-up-to-lead-temporary-gaza-administration-reports-13438404",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-tony-blair-uk_7031960.jpg?20250926094138",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-26 08:05:00",
        "Headline": "The former UK prime minister met with Donald Trump in August to discuss Gaza's future, though his selection may prove controversial. ",
        "Content": "Sir Tony Blair is being lined up to lead a temporary administration in the Gaza Strip to oversee reconstruction after the war, according to Israeli media reports. The former UK prime minister has been proposed to chair a supervisory board called the Gaza International Transitional Authority. The transitional administration would govern Gaza for several years until it can be handed over to the Palestinian Authority, The Times of Israel reported. The plan would not involve the relocation of Palestinians, something that has been a red line for many in negotiations. However, Sky News' US correspondent Mark Stone said that others have cast doubt on the reports. US correspondent For many months, Sir Tony Blair has been heavily involved in \"day after\" plans for Gaza.  Working with Trump's son-in-law Jared Kushner, he has been a central part of an evolving series of proposals for the future of Gaza. He has made a number of trips to the White House and discussed the issue with President Trump.  Given his Iraq War legacy, his involvement in Gaza will seem incongruous and controversial for many.  The latest reporting, which first emerged in Israeli media outlets, suggests he would head a transitional governing authority for Gaza The proposal sounds similar to the Iraqi Coalition Provisional Authority, run by American technocrat Paul Bremer. That was a disaster.  I have spoken to a source from a Gulf country close to the negotiations who said the suggestions are \"not true\". I spoke to a source close to President Trump who said he had \"not heard that one\".  But, I spoke to a source close to Sir Tony who didn't steer me away from the reporting. So where's the truth?  Well, it's clear that Sir Tony would like to be involved. He believes he can offer a useful perspective and he certainly has deep knowledge of the Israeli-Palestinian challenge.  He was the envoy for the Middle East quartet for a decade and he knows Israeli and regional Arab leaders well.  My sense is that while, at the moment, it's not a confirmed plan, it could become one in the absence of anything better.  Trump would back it. Israel would back it. What choice would the Palestinians have?  And Arab nations may just go along with it. After all, it's more measured than President Trump's initial Gaza plans like the riviera proposal, American ownership of Gaza and deporting all Palestinians.  Sir Tony attended a meeting with US President Donald Trump and others to discuss the future of the devastated territory in August, and the plan has the backing of the White House. Conversations about the future of Gaza and the West Bank have dominated diplomatic circles in recent weeks, with the UK among nations formally recognising a Palestinian state ahead of this week's meeting of the UN General Assembly.  Read more:Microsoft blocks some services used by Israeli militaryWhy UK's Palestine move matters in the Middle East According to the reports, the proposal also includes plans for an international force to be stationed in the territory to guard its borders and prevent Hamas from re-establishing itself. The plan is being modelled on administrations that oversaw the transition process to statehood for places like Timor-Leste and Kosovo. Temporary administrations have been established in several countries after periods of war – often with the help of the United Nations and superpowers like the US. After deadly fighting between Indonesian militia and pro-independence groups in East Timor in 1999, Australia led a UN-authorised peacekeeping force called INTERFET to maintain order.  It also hoped to create the conditions to implement the results of that year's referendum, which had voted overwhelmingly in favour of independence. Later that year, the UN Transitional Administration in East Timor (UNTAET) was established to set up a parliamentary framework, civil and social services, and to ensure continued humanitarian support. The three-year arrangement was in place until 2002 when Xanana Gusmao became the first president of the Democratic Republic of Timor-Leste following another referendum. A UN peacekeeping force was also deployed to Kosovo in 1999 after NATO had to intervene to drive out Serbian troops from the area, which has been historically populated largely by ethnic Albanians.  The Kosovo Force (KFOR) is still stationed there to manage flare-ups in violence – but was originally introduced to determine its political future. At its peak, KFOR was staffed by 50,000 military personnel from 39 NATO and non-NATO countries and was split into five multinational brigades – each led by a different nation. It was accompanied by a UN-led interim administration (UNMIK), which, after years of talks between international allies, helped establish a new political system. In 2008, Kosovo finally declared independence, with KFOR and European Union-led monitors remaining in the region as a deterrent for further violence. After the downfall of Saddam Hussein in 2003, the US-led Coalition Provisional Authority (CPA) was set up in Iraq as a transitional government. It saw two American officials, an army lieutenant general followed by a diplomat, appointed as administrators – or de-facto leaders. The CPA was divided into four geographical regions, with a leader for each, to help rebuild communities on the way to a new political system. From 2004, it was replaced by various Iraqi-run interim authorities – the Iraqi Governing Council, the caretaker Iraqi Interim Government, and then the Iraqi Transitional Government. In 2005, parliamentary elections took place and a constitution was written, before the country's Muhasasa sectarian power-sharing system was established. Although designed to give equal representation to Shia, Sunni and Kurd groups, it has led to political gridlock and corruption. Any involvement of Sir Tony is likely to be controversial, however, given his previous involvement in the region with the Iraq War. After resigning as prime minister in 2007, he was appointed as the international community's special envoy to the Middle East with the goal of helping develop the Palestinian economy and institutions in order to prepare the groundwork for a Palestinian state. However, he struggled to deliver dramatic changes in the role and resigned in 2015."
    },
    {
        "title": "Trump threatens to move World Cup games from 'unsafe' host cities",
        "description": "Donald Trump has threatened to move World Cup games from cities he thinks are \"not safe\".",
        "url": "https://news.sky.com/story/trump-threatens-to-move-world-cup-games-from-unsafe-host-cities-13438416",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-world-cup_7031967.jpg?20250926095034",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-26 08:29:00",
        "Headline": "It is unclear whether the US president has the authority to change the venues for the international tournament, run by FIFA.",
        "Content": " Donald Trump has threatened to move World Cup games from cities he thinks are \"not safe\". The 2026 World Cup will be held across several states, including Democrat-run cities like New York, Los Angeles, Seattle and San Francisco. Speaking at the White House on Thursday, the US president said: \"If I think it's not safe, we're going to move it out of that city.\" Mr Trump added that if a stadium or city \"is going to be even a little bit dangerous for the World Cup\", or for the 2028 Olympic Games in Los Angeles, \"we'll move it around a little bit\". \"But I hope that's not going to happen,\" he added. It is unclear whether Mr Trump has the authority to change the venues for the international football tournament, run by the sport's world governing body FIFA, which is in charge of organising and selecting host cities. Any changes would face logistical challenges, with the World Cup officially starting on 11 June and the first US-hosted games taking place the next day. The United States is co-hosting the tournament with Canada and Mexico. Throughout his second term, the US president has claimed cities run by Democratic officials have high crime rates and are unsafe. In June, he ordered the National Guard to be deployed in Los Angeles over protests against immigration raids, and in August in Washington DC over crime. He has also repeatedly threatened to send troops into cities like Chicago. It comes after Sky News reported the Trump administration would push back on any attempt to ban Israeli football teams from UEFA and FIFA competitions.  'US will absolutely try to stop ban on Israel' Sky's sports correspondent Rob Harris reported on Wednesday that discussions are taking place at high levels in European football about whether Israel should be banned, but no decision has been taken. Alexandra Xanthaki, the UN special rapporteur for cultural rights, told Sky News: \"I think that when we talk about teams, national teams, not individual athletes, of states that are subject to valid claims of genocide... this is where this is for sure a red line.\" A day after the report, Sky News learnt the US government, through Marco Rubio's state department, had made a direct intervention to stop sporting sanctions being imposed. A state department spokesperson told Sky News: \"We will absolutely work to fully stop any effort to attempt to ban Israel's national soccer team from the World Cup.\" Read more from Sky News:Ex-FBI chief charged with lying to Congress after investigating TrumpShares in pharmaceutical firms drop as Trump reveals fresh tariffs FIFA and UEFA have previously rejected calls to suspend Israel. UEFA has previously publicly drawn a distinction between Russia's ban and Israel's participation - saying Russia launched an unprovoked invasion of Ukraine, and Israel's war in Gaza is a response to the 7 October 2023 Hamas attacks. Earlier this month, a commission established by the UN accused Israel of committing genocide in Gaza - accusations rejected by Israel."
    },
    {
        "title": "Ryder Cup 2025: Europe soar into early lead vs USA",
        "description": null,
        "url": "https://news.sky.com/story/ryder-cup-2025-europe-soar-into-early-lead-vs-usa-13438706",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-rory-mcilroy-ryder-cup_7032433.jpg?20250926162315",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-26 15:11:00",
        "Headline": "No subtitle found",
        "Content": ""
    },
    {
        "title": "Shares in pharmaceutical firms drop as Trump reveals fresh round of trade tariffs",
        "description": "Donald Trump has revealed a fresh round of trade tariffs on several key sectors, with the government confirming active engagement with the US on the most punitive rate threatened.   ",
        "url": "https://news.sky.com/story/trump-trade-war-expands-to-cover-many-drugs-trucks-and-furniture-13438348",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-united-nations_7029428.jpg?20250923150007",
        "type": "World",
        "Author": "James Sillars",
        "Date Published": "2025-09-26 04:59:00",
        "Headline": "Shares in pharmaceutical firms have fallen sharply overnight as industry groups scramble to seek clarification on the penalties they potentially face from next week.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump has revealed a fresh round of trade tariffs on several key sectors, with the government confirming active engagement with the US on the most punitive rate threatened.    The US president used his Truth Social account last night to confirm that a new 100% tariff would apply to any branded or patented pharmaceutical product from 1 October. He said that to escape the clutches of that duty, a company must have already broken ground on a new US factory. Money latest: Cost of a pint across UK revealed The UK government responded by confirming engagement with the Trump administration on the plans. The president further confirmed that from the same date, a 50% tariff would be applied to all imported kitchen and bathroom cabinets, while upholstered furniture faced a 30% rate. A 25% tariff faced shipments of heavy trucks. Mr Trump did not say whether the duties would be lower for nations which have agreed trade deals with his administration, including the UK and European Union. Each faces a blanket 10% and 15% rate on their exports, respectively, at the moment.  The UK's deal talked of intent to \"promptly negotiate significantly preferential treatment outcomes on pharmaceuticals and pharmaceutical ingredients\". No subsequent agreement has been announced. It leaves open the possibility that the new duties will be applied in line with other, higher, sectoral tariffs that are currently in place above the base rate, such as that for steel. A UK government spokesperson said: \"We know this will be concerning for industry, which is why we've been actively engaging with the US and will continue to do so over the coming days. \"Sectors such as pharmaceuticals are critical to our economy... so we will continue to press the US for outcomes that reflect the strength of our relationship and deliver real benefits for UK industry.\" Ireland's foreign minister Simon Harris said he understood that his country - also a major pharma player - would face the 15% baseline rate under the terms of the US-EU trade arrangement. \"The reason for this is the large scale \"FLOODING\" of these products into the United States by other outside countries,\" Trump said in his post. Shares in pharmaceutical firms listed in Asia fell sharply overnight as industry bodies rushed to seek clarification on the new rules.  Those for AstraZeneca (AZ) were down 1.4% at the open in Europe to top the losers on the FTSE 100. GSK and Hikma Pharmaceuticals' stocks were also among the fallers. However, values later recovered. AZ - the UK's most valuable listed company - already has vast US manufacturing and research operations and believes it is exempt from the regime on the basis of that and its current construction pipeline. In July, as the threat of tariffs loomed large, it revealed plans for $50bn of additional US investment by 2030 and recently cancelled a planned £200m project in the UK. US figures show the country imported $233bn of drugs and medicines from abroad last year, with the UK accounting for around $6.5bn of that sum. A 100% tariff rate, even on some of those shipments, risks ramping up the cost of US healthcare, according to critics of the president's approach. By imposing the 100% tariff rate, Mr Trump wants to bring prices down through encouraging domestic production and secure hundreds of billions of dollars for taxpayers through tariffs at the same time. US industry groups lined up to oppose the planned measures. The Pharmaceutical Research and Manufacturers of America said non-US companies were continuing to announce hundreds of billions of dollars in new US investments. \"Tariffs risk those plans,\" it said. The US Chamber of Commerce urged a U-turn on any truck tariffs. It said the five nations to be worst affected - Mexico, Canada, Japan, Germany and Finland - were \"allies or close partners of the United States posing no threat to US national security.\" Commenting on the 100% pharma tariff plan Nigel Green, chief executive of asset manager deVere Group, said the move undermined the very goal it claimed to serve. \"A tariff of this magnitude on high-value medicines will ripple through every part of the global health economy. \"Rather than sparking a manufacturing renaissance, it'll deter investment, heighten inflationary pressure and drive sophisticated capital to markets that remain open and predictable,\" he predicted."
    },
    {
        "title": "Elon Musk and Prince Andrew named in latest Epstein files release",
        "description": "Elon Musk's name has appeared in files relating to Jeffrey Epstein, with a reference made to the world's richest man potentially visiting the paedophile's island.",
        "url": "https://news.sky.com/story/elon-musk-and-prince-andrew-named-in-latest-epstein-files-release-13438742",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-elon-musk-x-tesla_7032542.jpg?20250926214813",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-26 18:25:00",
        "Headline": "The Duke of York is named as a passenger on the sex offender's private jet in documents released by Democrats on the House Oversight Committee in the US.",
        "Content": " Elon Musk's name has appeared in files relating to Jeffrey Epstein, with a reference made to the world's richest man potentially visiting the paedophile's island. The Duke of York is also named as a passenger on the sex offender's private jet in documents released by Democrats on the House Oversight Committee in the US. They show Musk as a potential visitor to Epstein's island, Little St James, on 6 December 2014 - six years after Epstein became a listed sex offender. His name appears on what appears to be Epstein's daily schedule, with the entry reading: \"Reminder: Elon Musk to island Dec.6 (is this still happening?)\" Musk issued a broad denial late Friday as he responded to another account's post on the subject on X, saying \"This is false\" without elaborating. In June, Musk claimed Donald Trump appeared in files relating to the disgraced financier and alleged his administration was concealing information about the US president's association with Epstein. He gave no evidence for the claim, which he made on X, and later appeared to have deleted the posts. Sky News has approached Musk for comment.  Prince Andrew named as passenger on Epstein jet The documents also show Prince Andrew as a listed passenger on a flight on Epstein's jet from Teterboro, New Jersey, to Palm Beach, Florida, on 12 May 2000. He is named alongside Epstein, his then-girlfriend Ghislaine Maxwell, who is now a convicted sex trafficker, and two names that have been redacted. Read more from Sky News:Farage on course to be next PM, mega poll projectsTerror charge against rapper cannot continue, court says Details of the duke travelling on Epstein's jet have previously been heard in court in Maxwell's trial. One of her accusers, who was 14 at the time, recalled she had travelled on a flight with Andrew. The duke strenuously denies any wrongdoing. In addition to Musk and the duke, the records also show he was in contact with Microsoft co-founder Bill Gates, PayPal founder Peter Thiel and Steve Bannon, who was Mr Trump's chief strategist during his first term. The names of victims in the records are redacted and the committee said it plans to release more files once they are redacted as well. Duchess of York dropped by charities over Epstein email The release comes days after an email surfaced from Sarah, Duchess of York, to Epstein, in which she apologised to him for disowning him in the media. In the letter, the duchess, Prince Andrew's ex-wife, called the sex offender a \"supreme friend\".  Her spokesperson said the message was written because he had threatened to sue her for defamation. The emergence of the email led to the duchess being dropped by a number of charities she had been a patron of. Earlier this month, Peter Mandelson, the British ambassador to the US, was sacked by Sir Keir Starmer after it was discovered he had also sent messages to Epstein, calling him \"my best pal\", after he was jailed awaiting sex trafficking charges. Epstein was found dead in his cell at a federal jail in Manhattan in August 2019 while he was awaiting trial on sex-trafficking charges. The death was ruled a suicide."
    },
    {
        "title": "Jimmy Kimmel's show back on Sinclair and Nexstar thanks to viewer feedback",
        "description": "Jimmy Kimmel's late-night talk show will return to ABC affiliates belonging to Sinclair and Nexstar after the two major network operators took his programme off-air over his comments in the wake of Charlie Kirk's assassination.",
        "url": "https://news.sky.com/story/jimmy-kimmels-show-back-on-sinclair-and-nexstar-thanks-to-viewer-feedback-13438996",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jimmy-kimmel-show_7030034.jpg?20250924074319",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-26 22:57:00",
        "Headline": "His show was suspended over Kimmel's comments in the wake of conservative activist Charlie Kirk's assassination. Disney announced the return of Jimmy Kimmel Live on Tuesday, but both Sinclair and Nexstar initially said they would not resume airing the programme.",
        "Content": "Jimmy Kimmel's late-night talk show will return to ABC affiliates belonging to Sinclair and Nexstar after the two major network operators took his programme off-air over his comments in the wake of Charlie Kirk's assassination. Kimmel was accused of being \"offensive and insensitive\" after using his programme, Jimmy Kimmel Live, to accuse Donald Trump and his allies of capitalising on the killing. Disney-owned ABC suspended the show last week following threats of potential repercussions from the Trump-appointed head of the Federal Communications Commission. Sinclair, which controls 38 ABC affiliates from Seattle to Washington DC, called on Kimmel to apologise to Mr Kirk's family over the comments and asked him to \"make a meaningful personal donation\" to Turning Point USA, the nonprofit that the conservative activist founded. On Tuesday, Disney announced the return of the programme after backlash to its suspension, but both Sinclair and Nexstar, which own more than 20% of ABC affiliates, initially said they would not resume airing the show. Kimmel criticised the ABC affiliates who preempted his show during his TV return, saying: \"That's not legal. That's not American. It's un-American.\" Three days later, the two major network operators announced that Jimmy Kimmel Live would return to their TV stations after the week-long boycott. \n                  Jessica Chastain criticises decision to delay release of The Savant after Charlie Kirk killing\n                 \n                  Trump makes major shift in Ukraine policy\n                 \n                  Jimmy Kimmel addresses Charlie Kirk comments in first show since being taken off-air\n                 The move came after Sinclair received \"thoughtful feedback from viewers, advertisers and community leaders\". In its statement, the company pointed to its \"responsibility as local broadcasters to provide programming that serves the interests of our communities, while also honouring our obligations to air national network programming.\"  Nexstar, which controls 28 ABC affiliates from Kansas to New Orleans, said in a similar statement that it was airing content that is \"in the best interest of the communities we serve\". Both companies said their decisions were not affected by influence from the Trump administration or anyone else. The president had criticised the programme's return on Tuesday, writing on Truth Social that he \"can't believe\" ABC gave Kimmel his show back and hinted at further action. \"Why would they want someone back who does so poorly, who's not funny, and who puts the Network in jeopardy by playing 99% positive Democrat GARBAGE,\" Mr Trump wrote. \"He is yet another arm of the DNC (Democratic National Committee) and, to the best of my knowledge, that would be a major illegal Campaign Contribution. I think we're going to test ABC out on this.\" During Kimmel's first show since being taken off-air, the presenter said it was \"never my intention to make light of\" Mr Kirk's death. \"I don't think there's anything funny about it,\" he said as he choked up. \"Nor was it my intention to blame any specific group for the actions of what was obviously a deeply disturbed individual. That was really the opposite of the point I was trying to make\". Read more from Sky News:Musk and Prince Andrew named in latest Epstein releaseTrump: 'Looks like we have a deal' to end war in Gaza Speaking on Tuesday night's show, Kimmel said he understood why the remarks \"felt either ill-timed or unclear, or maybe both\". New episodes of Jimmy Kimmel Live air Monday to Thursday, and Friday night's rerun will be of Tuesday's show, meaning viewers of Sinclair stations will be able to watch Kimmel's emotional return to the air."
    },
    {
        "title": "Gunman who targeted NFL HQ 'had brain disease that's linked to playing American football'",
        "description": "A gunman who murdered four people in a New York office building before taking his own life had CTE, a degenerative brain disease which has been linked to playing American football.",
        "url": "https://news.sky.com/story/gunman-who-targeted-skyscraper-housing-nfl-hq-had-brain-disease-thats-linked-to-playing-american-football-13438862",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-new-york-shooting-manhattan_6976519.jpg?20250729073422",
        "type": "US",
        "Author": "Martha Kelner",
        "Date Published": "2025-09-26 20:13:00",
        "Headline": "It is believed Shane Tamura carried out the deadly shooting at the Manhattan skyscraper because it housed the headquarters of the NFL. ",
        "Content": "\n          US correspondent\n              @marthakelner\n A gunman who murdered four people in a New York office building before taking his own life had CTE, a degenerative brain disease which has been linked to playing American football. It is believed Shane Tamura targeted the skyscraper in Manhattan because it houses the headquarters of the NFL. The 27-year-old, who played high school football, had \"unambiguous diagnostic evidence\" of low-stage CTE, or chronic traumatic encephalopathy, the New York City medical examiner said. In a three-page note discovered by police after the mass shooting, Tamura made repeated references to CTE. In his note, which was written on notepad paper and using a variety of ink, Tamura wrote \"CTE study my brain please. I'm sorry.\" And again: \"Please study brain for CTE. I'm sorry.\" He also specifically refers to Terry Long, a former NFL player who starred for the Pittsburgh Steelers. Long was diagnosed with CTE after drinking antifreeze to take his own life 20 years ago. CTE can only be diagnosed after death via post mortem. In a statement, the NFL said: \"We continue to grieve the senseless loss of lives, and our hearts remain with the victims’ families and our dedicated employees. \"There is no justification for the horrific acts that took place. As the medical examiner notes ‘the science around this condition continues to evolve, and the physical and mental manifestations of CTE remain under study’.\"  A Sky News investigation last year explored the link between CTE and violent attacks, including mass murder.  We looked at the case of former high school football player Noah Green. He was 25 when he crashed into a security cordon protecting the capitol building in Washington DC and stabbed police officer William Evans to death, before he too was shot dead by responding police. Green's mother, Mazie, told me she believes his crime was caused by brain injuries sustained on the American football field. He also had CTE. The theory of a link between CTE and violent crime is increasingly cited in the courtroom.  Kellen Winslow, a former NFL player, argued for his sentence for multiple rapes to be reduced because of head trauma suffered on the football field. Former San Francisco 49ers star Phillip Adams shocked the country when he shot dead six people, including grandparents and their two grandchildren, then himself in 2021. He had severe CTE."
    },
    {
        "title": "Trump threatens to move World Cup games from 'unsafe' host cities",
        "description": "Donald Trump has threatened to move World Cup games from cities he thinks are \"not safe\".",
        "url": "https://news.sky.com/story/trump-threatens-to-move-world-cup-games-from-unsafe-host-cities-13438416",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-world-cup_7031967.jpg?20250926095034",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-26 08:29:00",
        "Headline": "It is unclear whether the US president has the authority to change the venues for the international tournament, run by FIFA.",
        "Content": " Donald Trump has threatened to move World Cup games from cities he thinks are \"not safe\". The 2026 World Cup will be held across several states, including Democrat-run cities like New York, Los Angeles, Seattle and San Francisco. Speaking at the White House on Thursday, the US president said: \"If I think it's not safe, we're going to move it out of that city.\" Mr Trump added that if a stadium or city \"is going to be even a little bit dangerous for the World Cup\", or for the 2028 Olympic Games in Los Angeles, \"we'll move it around a little bit\". \"But I hope that's not going to happen,\" he added. It is unclear whether Mr Trump has the authority to change the venues for the international football tournament, run by the sport's world governing body FIFA, which is in charge of organising and selecting host cities. Any changes would face logistical challenges, with the World Cup officially starting on 11 June and the first US-hosted games taking place the next day. The United States is co-hosting the tournament with Canada and Mexico. Throughout his second term, the US president has claimed cities run by Democratic officials have high crime rates and are unsafe. In June, he ordered the National Guard to be deployed in Los Angeles over protests against immigration raids, and in August in Washington DC over crime. He has also repeatedly threatened to send troops into cities like Chicago. It comes after Sky News reported the Trump administration would push back on any attempt to ban Israeli football teams from UEFA and FIFA competitions.  'US will absolutely try to stop ban on Israel' Sky's sports correspondent Rob Harris reported on Wednesday that discussions are taking place at high levels in European football about whether Israel should be banned, but no decision has been taken. Alexandra Xanthaki, the UN special rapporteur for cultural rights, told Sky News: \"I think that when we talk about teams, national teams, not individual athletes, of states that are subject to valid claims of genocide... this is where this is for sure a red line.\" A day after the report, Sky News learnt the US government, through Marco Rubio's state department, had made a direct intervention to stop sporting sanctions being imposed. A state department spokesperson told Sky News: \"We will absolutely work to fully stop any effort to attempt to ban Israel's national soccer team from the World Cup.\" Read more from Sky News:Ex-FBI chief charged with lying to Congress after investigating TrumpShares in pharmaceutical firms drop as Trump reveals fresh tariffs FIFA and UEFA have previously rejected calls to suspend Israel. UEFA has previously publicly drawn a distinction between Russia's ban and Israel's participation - saying Russia launched an unprovoked invasion of Ukraine, and Israel's war in Gaza is a response to the 7 October 2023 Hamas attacks. Earlier this month, a commission established by the UN accused Israel of committing genocide in Gaza - accusations rejected by Israel."
    },
    {
        "title": "Shares in pharmaceutical firms drop as Trump reveals fresh round of trade tariffs",
        "description": "Donald Trump has revealed a fresh round of trade tariffs on several key sectors, with the government confirming active engagement with the US on the most punitive rate threatened.   ",
        "url": "https://news.sky.com/story/trump-trade-war-expands-to-cover-many-drugs-trucks-and-furniture-13438348",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-united-nations_7029428.jpg?20250923150007",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2025-09-26 04:59:00",
        "Headline": "Shares in pharmaceutical firms have fallen sharply overnight as industry groups scramble to seek clarification on the penalties they potentially face from next week.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump has revealed a fresh round of trade tariffs on several key sectors, with the government confirming active engagement with the US on the most punitive rate threatened.    The US president used his Truth Social account last night to confirm that a new 100% tariff would apply to any branded or patented pharmaceutical product from 1 October. He said that to escape the clutches of that duty, a company must have already broken ground on a new US factory. Money latest: Cost of a pint across UK revealed The UK government responded by confirming engagement with the Trump administration on the plans. The president further confirmed that from the same date, a 50% tariff would be applied to all imported kitchen and bathroom cabinets, while upholstered furniture faced a 30% rate. A 25% tariff faced shipments of heavy trucks. Mr Trump did not say whether the duties would be lower for nations which have agreed trade deals with his administration, including the UK and European Union. Each faces a blanket 10% and 15% rate on their exports, respectively, at the moment.  The UK's deal talked of intent to \"promptly negotiate significantly preferential treatment outcomes on pharmaceuticals and pharmaceutical ingredients\". No subsequent agreement has been announced. It leaves open the possibility that the new duties will be applied in line with other, higher, sectoral tariffs that are currently in place above the base rate, such as that for steel. A UK government spokesperson said: \"We know this will be concerning for industry, which is why we've been actively engaging with the US and will continue to do so over the coming days. \"Sectors such as pharmaceuticals are critical to our economy... so we will continue to press the US for outcomes that reflect the strength of our relationship and deliver real benefits for UK industry.\" Ireland's foreign minister Simon Harris said he understood that his country - also a major pharma player - would face the 15% baseline rate under the terms of the US-EU trade arrangement. \"The reason for this is the large scale \"FLOODING\" of these products into the United States by other outside countries,\" Trump said in his post. Shares in pharmaceutical firms listed in Asia fell sharply overnight as industry bodies rushed to seek clarification on the new rules.  Those for AstraZeneca (AZ) were down 1.4% at the open in Europe to top the losers on the FTSE 100. GSK and Hikma Pharmaceuticals' stocks were also among the fallers. However, values later recovered. AZ - the UK's most valuable listed company - already has vast US manufacturing and research operations and believes it is exempt from the regime on the basis of that and its current construction pipeline. In July, as the threat of tariffs loomed large, it revealed plans for $50bn of additional US investment by 2030 and recently cancelled a planned £200m project in the UK. US figures show the country imported $233bn of drugs and medicines from abroad last year, with the UK accounting for around $6.5bn of that sum. A 100% tariff rate, even on some of those shipments, risks ramping up the cost of US healthcare, according to critics of the president's approach. By imposing the 100% tariff rate, Mr Trump wants to bring prices down through encouraging domestic production and secure hundreds of billions of dollars for taxpayers through tariffs at the same time. US industry groups lined up to oppose the planned measures. The Pharmaceutical Research and Manufacturers of America said non-US companies were continuing to announce hundreds of billions of dollars in new US investments. \"Tariffs risk those plans,\" it said. The US Chamber of Commerce urged a U-turn on any truck tariffs. It said the five nations to be worst affected - Mexico, Canada, Japan, Germany and Finland - were \"allies or close partners of the United States posing no threat to US national security.\" Commenting on the 100% pharma tariff plan Nigel Green, chief executive of asset manager deVere Group, said the move undermined the very goal it claimed to serve. \"A tariff of this magnitude on high-value medicines will ripple through every part of the global health economy. \"Rather than sparking a manufacturing renaissance, it'll deter investment, heighten inflationary pressure and drive sophisticated capital to markets that remain open and predictable,\" he predicted."
    },
    {
        "title": "Human remains found in Washington State identified as those of father accused of killing his three daughters",
        "description": "Human remains found in a remote wooded area of Washington state have been confirmed to be those of a former soldier suspected of kidnapping and murdering his three daughters, authorities have said.",
        "url": "https://news.sky.com/story/human-remains-found-in-washington-state-identified-as-father-accused-of-killing-his-three-daughters-13438320",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-decker-wenatchee_6934198.jpg?20250604051143",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-26 01:18:00",
        "Headline": "Travis Decker, 32, had been wanted since 2 June when an officer found his truck and the bodies of his three daughters - nine-year-old Paityn Decker, eight-year-old Evelyn Decker and five-year-old Olivia Decker - at a campsite on 2 June.",
        "Content": "Human remains found in a remote wooded area of Washington state have been confirmed to be those of a former soldier suspected of kidnapping and murdering his three daughters, authorities have said. Travis Decker, 32, had been wanted since 2 June when an officer found his truck and the bodies of his three daughters - nine-year-old Paityn Decker, eight-year-old Evelyn Decker and five-year-old Olivia Decker - at a campsite outside Leavenworth. They had been bound with zip ties and had plastic bags placed over their heads. Post-mortems found they had been suffocated. Human remains believed to be Decker's were discovered on a steep, remote, wooded slope up Grindstone Mountain, less than a mile (1.6km) from the campsite, last week, according to the Chelan County Sheriff's Office. Sheriff Mike Morrison said DNA tests on clothing found at the scene, as well as from the remains, matched Decker. The coroner's office is working to determine the cause and time of his death. The identification of the remains as Decker ended a three-month search by officers, who wanted to honour the girls' memory, the sheriff said. Mr Morrison apologised to the daughters' mother, Whitney Decker, for the search taking so long, telling her: \"I hope you can rest easier at night knowing that Travis is accounted for.\" \n                  Manhunt for former soldier suspected of murdering his three daughters in Washington state\n                 \n                  Three climbers dead after 200ft fall - while one 'miraculously' survives\n                 \n                  Killer whale Tahlequah who carried dead calf in 'show of grief' gives birth again - but experts are concerned\n                 The girls' bodies were found three days after Decker had failed to return his daughters to their mother's home in Wenatchee, about 100 miles east of Seattle, following a scheduled visit. Mrs Decker told police the girls did not return as planned and that Decker's phone went straight to voicemail. Last September, she had warned authorities that Decker was experiencing mental health issues and had become increasingly unstable. She described him as homeless and living in his truck, and sought to have their parenting plan changed to restrict him from having overnight visits with their daughters until he found somewhere to live. Officials said Decker joined the US army in 2013 and was deployed to Afghanistan for four months in 2014. He moved to the Washington National Guard in 2021, going part-time in the past few years, but stopped attending drills about a year ago. Read more from Sky News:Trump signs TikTok order to pave way for US ownershipSaudi minister: Trump 'committed' to ending Gaza war Authorities said he had training in navigation, survival and other skills, and once spent more than two months living in the backwoods off the grid. The search for Decker involved 100 personnel from state and federal agencies across hundreds of square miles, much of it mountainous and remote, by land, water and air. The US Marshals Service offered a reward of up to $20,000 (£14,800) for information leading to his capture."
    },
    {
        "title": "Ryder Cup 2025: Europe soar into early lead vs USA",
        "description": null,
        "url": "https://news.sky.com/story/ryder-cup-2025-europe-soar-into-early-lead-vs-usa-13438706",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-rory-mcilroy-ryder-cup_7032433.jpg?20250926162315",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-26 15:11:00",
        "Headline": "No subtitle found",
        "Content": ""
    },
    {
        "title": "Pokemon pushes back against ICE deportation video - joining list riled by Trump administration",
        "description": "Pokemon has said it did not give permission for the show's popular theme song to be used in a video showing deportations posted by the US government.",
        "url": "https://news.sky.com/story/pokemon-pushes-back-against-ice-deportation-video-joining-list-riled-by-trump-administration-13438421",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-pokemon-beyonce-rolling-stones_7031986.jpg?20250926100747",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-26 08:43:00",
        "Headline": "Multiple artists and brands have publicly spoken out after their images, songs and voices were used in government or political videos during Trump's campaign and presidency. Here are some of the most notable cases.",
        "Content": "Pokemon has said it did not give permission for the show's popular theme song to be used in a video showing deportations posted by the US government. The video, which was captioned with Pokemon's slogan \"Gotta catch 'em all\", showed border patrol and Immigration and Customs Enforcement (ICE) agents making several arrests. It also features snippets of Pokemon's anime TV show, showing the main character Ash Ketchum. In a statement, the Pokemon Company International said: \"Our company was not involved in the creation or distribution of this content, and permission was not granted for the use of our intellectual property.\" It was posted on the Homeland Security X account and the White House TikTok page and has been viewed millions of times. In response to Sky News' request for comment, a DHS spokesperson played on the lyrics of the Pokemon theme tune, saying: \"To arrest them is our real test. To deport them is our cause.\" Pokemon is just one in a long list of artists and brands that have publicly distanced themselves from the Trump administration after their images, songs or voices were used in government or political campaign videos. Here are some of the most notable times the White House - or Donald Trump himself - has clashed with popular culture. Theo Von The comedian and podcaster objected to a now-deleted DHS video which used a clip of him saying \"heard you got deported dude, bye\". Von, who interviewed Mr Trump during the presidential campaign on his podcast This Past Weekend, and is a popular figure among a mostly young male audience, shared the DHS video to his more than 1.6 million X followers on Tuesday, saying he \"didn't approve of this\". \"I know you know my address so send a cheque,\" Von said in a now-deleted post, according to Sky News' US partner network, NBC News. \"And please take this down and please keep me out of your 'banger' deportation videos. When it comes to immigration my thoughts and heart are a lot more nuanced than this video allows. Bye!\" NBC reported that shortly after its original article was published, DHS took down the video. Jess Glynne British singer-songwriter Jess Glynne said she felt \"sick\" after the DHS posted a video in July that overlaid her 2015 single Hold My Hand over footage of people being handcuffed and boarding planes. The song has become closely associated with holiday company Jet2, whose advert went viral on TikTok along with the voiceover \"nothing beats a Jet2 holiday\". Mocking the viral trend, the DHS video was captioned: \"When ICE books you a one-way Jet2 holiday to deportation. Nothing beats it!\" Responding to the video on her Instagram stories, Glynne said her music \"is about love, unity and spreading positivity - never about division or hate\". Black Rebel Motorcycle Club Californian rock band Black Rebel Motorcycle Club issued a cease and desist notice to the DSH in July after a video posted on Instagram used their version of the folk song, God's Gonna Cut You Down. A cease and desist letter is often sent before any formal legal action starts, and demands that the recipient stops their allegedly unlawful activity and does not repeat it. Reacting to the video, which shows a montage of border protection officers, the band accused the DHS of breaching copyright law. A statement said: \"For the record, we hereby order @dhsgov to cease and desist the use of our recording and demand that you immediately pull down your video.\" The video remains on the official DHS Instagram page. Beyonce  While on the presidential campaign trail in August 2024, Mr Trump's campaign spokesperson used Beyonce's song Freedom in a video of the president attending an event in Michigan. Shortly after the clip was posted on X, Beyonce's record label threatened to issue a cease and desist letter to the Trump campaign. A source told Rolling Stone magazine that they did not obtain permission to use the song, which is from the singer's 2016 album Lemonade. The song was then adopted by Kamala Harris's campaign and played regularly at her rallies, one of which Beyonce spoke at. Rolling Stones Ahead of the 2020 presidential election, the Rolling Stones warned the president that he would face legal action if he continued to use their songs at his campaign rallies. A statement released by the band's legal team at the time said that despite cease and desist letters being issued, the band was \"taking further steps\" to exclude Mr Trump from using their songs for his political campaigning. The band warned it was working with performing rights organisation the BMI, and would bring a lawsuit if Mr Trump continued to use music that had not been licensed. So what does the law say? In short, to use music for online promotional content, licences are needed from the owners of the composition and sound recording. Without the proper licences, companies can expose themselves to risks of copyright infringement claims, including when content is posted by influencers - and this can come with hefty financial penalties. TikTok provides users with a library of licensed music, which includes songs that can be used in videos. However, these can be used for personal entertainment or non-commercial purposes only. The social media platform says content that promotes a brand, product, or service should use music from its commercial music library, which is pre-cleared for commercial use. Meta, the company which owns Instagram and Facebook, has similar rules on music use. Politicians on a campaign trail may be able to use copyrighted music under fair use - a legal doctrine in the US, similar to the UK's fair dealing. To qualify as fair use, four factors need to be considered, including purpose, the nature of the copyrighted work, the amount and sustainability used and the effect it could potentially have on the value of the copyrighted work."
    },
    {
        "title": "Harrods customers' details stolen in IT systems breach",
        "description": "Harrods has warned its e-commerce customers that their personal data may have been taken in an IT systems breach.",
        "url": "https://news.sky.com/story/harrods-customers-details-stolen-in-it-systems-breach-13438973",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-harrods-london_6727506.jpg?20250926225504",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-26 21:51:00",
        "Headline": "Information like customers' names and contact details was taken after one of Harrods' third-party provider systems was compromised, the luxury department store said in a statement.",
        "Content": "Harrods has warned its e-commerce customers that their personal data may have been taken in an IT systems breach. Information like customers' names and contact details was taken after one of Harrods' third-party provider systems was compromised, the luxury London department store said. Affected customers have been informed and reassured that the impacted data is \"limited to basic personal identifiers\", a spokesperson said. Account passwords or payment details were not affected in the breach. \"The third party has confirmed this is an isolated incident which has been contained, and we are working closely with them to ensure that all appropriate actions are being taken. We have notified all relevant authorities,\" Harrods added. \"No Harrods system has been compromised and it is important to note that the data was taken from a third-party provider.\" This comes four months after the department store restricted internet access as a precautionary measure due to \"attempts to gain unauthorised access\" to some of its systems. \n                  Hackers claim to have stolen pictures, names and addresses of children in nursery firm cyber attack\n                 \n                  Many small firms reliant on Jaguar Land Rover have 'weeks left' before damage 'untenable'\n                 \n                  Man arrested in connection with airports cyber attack\n                 Friday's breach is \"unconnected\" to the attempts in May, the spokesman said. Two men aged 19, a 17-year-old boy and a 20-year-old woman were arrested in July over their suspected involvement in cyber attacks on Harrods, Marks & Spencer, and the Co-op. Read more from Sky News:Jaguar Land Rover shutdown extended after cyber attackTeenagers charged over TfL cyber attack costing millions They were arrested on suspicion of blackmail, money laundering, offences linked ot the Computer Misuse Act, and participating in the activities of an organised crime group, the National Crime Agency said. All four have been bailed pending further inquiries.  It comes as hackers claim to have stolen pictures, names and addresses of thousands of children in a cyber attack on a nursery chain in London. The group, calling itself Radiant, has released personal information about children and staff at the Kido nursery chain on the dark web and demanded a ransom from the company. Radiant told Sky News on Friday it intends to imminently release the profiles of more children and employees."
    },
    {
        "title": "Shares in pharmaceutical firms drop as Trump reveals fresh round of trade tariffs",
        "description": "Donald Trump has revealed a fresh round of trade tariffs on several key sectors, with the government confirming active engagement with the US on the most punitive rate threatened.   ",
        "url": "https://news.sky.com/story/trump-trade-war-expands-to-cover-many-drugs-trucks-and-furniture-13438348",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-united-nations_7029428.jpg?20250923150007",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-09-26 04:59:00",
        "Headline": "Shares in pharmaceutical firms have fallen sharply overnight as industry groups scramble to seek clarification on the penalties they potentially face from next week.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump has revealed a fresh round of trade tariffs on several key sectors, with the government confirming active engagement with the US on the most punitive rate threatened.    The US president used his Truth Social account last night to confirm that a new 100% tariff would apply to any branded or patented pharmaceutical product from 1 October. He said that to escape the clutches of that duty, a company must have already broken ground on a new US factory. Money latest: Cost of a pint across UK revealed The UK government responded by confirming engagement with the Trump administration on the plans. The president further confirmed that from the same date, a 50% tariff would be applied to all imported kitchen and bathroom cabinets, while upholstered furniture faced a 30% rate. A 25% tariff faced shipments of heavy trucks. Mr Trump did not say whether the duties would be lower for nations which have agreed trade deals with his administration, including the UK and European Union. Each faces a blanket 10% and 15% rate on their exports, respectively, at the moment.  The UK's deal talked of intent to \"promptly negotiate significantly preferential treatment outcomes on pharmaceuticals and pharmaceutical ingredients\". No subsequent agreement has been announced. It leaves open the possibility that the new duties will be applied in line with other, higher, sectoral tariffs that are currently in place above the base rate, such as that for steel. A UK government spokesperson said: \"We know this will be concerning for industry, which is why we've been actively engaging with the US and will continue to do so over the coming days. \"Sectors such as pharmaceuticals are critical to our economy... so we will continue to press the US for outcomes that reflect the strength of our relationship and deliver real benefits for UK industry.\" Ireland's foreign minister Simon Harris said he understood that his country - also a major pharma player - would face the 15% baseline rate under the terms of the US-EU trade arrangement. \"The reason for this is the large scale \"FLOODING\" of these products into the United States by other outside countries,\" Trump said in his post. Shares in pharmaceutical firms listed in Asia fell sharply overnight as industry bodies rushed to seek clarification on the new rules.  Those for AstraZeneca (AZ) were down 1.4% at the open in Europe to top the losers on the FTSE 100. GSK and Hikma Pharmaceuticals' stocks were also among the fallers. However, values later recovered. AZ - the UK's most valuable listed company - already has vast US manufacturing and research operations and believes it is exempt from the regime on the basis of that and its current construction pipeline. In July, as the threat of tariffs loomed large, it revealed plans for $50bn of additional US investment by 2030 and recently cancelled a planned £200m project in the UK. US figures show the country imported $233bn of drugs and medicines from abroad last year, with the UK accounting for around $6.5bn of that sum. A 100% tariff rate, even on some of those shipments, risks ramping up the cost of US healthcare, according to critics of the president's approach. By imposing the 100% tariff rate, Mr Trump wants to bring prices down through encouraging domestic production and secure hundreds of billions of dollars for taxpayers through tariffs at the same time. US industry groups lined up to oppose the planned measures. The Pharmaceutical Research and Manufacturers of America said non-US companies were continuing to announce hundreds of billions of dollars in new US investments. \"Tariffs risk those plans,\" it said. The US Chamber of Commerce urged a U-turn on any truck tariffs. It said the five nations to be worst affected - Mexico, Canada, Japan, Germany and Finland - were \"allies or close partners of the United States posing no threat to US national security.\" Commenting on the 100% pharma tariff plan Nigel Green, chief executive of asset manager deVere Group, said the move undermined the very goal it claimed to serve. \"A tariff of this magnitude on high-value medicines will ripple through every part of the global health economy. \"Rather than sparking a manufacturing renaissance, it'll deter investment, heighten inflationary pressure and drive sophisticated capital to markets that remain open and predictable,\" he predicted."
    },
    {
        "title": "Energy supplier Ovo admits non-compliance with Ofgem capital regime",
        "description": "Ovo has become the latest major energy supplier to disclose its failure to meet new capital adequacy rules imposed by the industry watchdog.",
        "url": "https://news.sky.com/story/energy-supplier-ovo-admits-non-compliance-with-ofgem-capital-regime-13438573",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-ovo-energy_6593966.jpg?20240629095113",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-26 12:32:00",
        "Headline": "Ovo, which has four million UK energy customers, tells Sky News it has \"taken proactive measures\" to move towards compliance with rules which have been criticised by larger rival Octopus Energy.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Ovo has become the latest major energy supplier to disclose its failure to meet new capital adequacy rules imposed by the industry watchdog. Sky News has learnt that Ovo Energy is the second of the UK's biggest gas and electricity companies to be in technical default of an Ofgem-imposed regime which came into effect in March. Octopus Energy, which has overtaken British Gas to become Britain's largest household energy supplier, publicly revealed its own non-compliance with the rules earlier this year. Money latest: Major child benefit change for parents earning £60k On Friday, Greg Jackson, Octopus Energy's founder and chief executive, described the framework as \"crude\" in an interview with the Financial Times. According to measures introduced by Ofgem, energy suppliers must hold a certain level of cash or other tangible assets on their balance sheets, with the threshold set according to the number of customers they have. A recent change to the rules, which removed intangible assets from the calculation, meant that a number of companies, including Octopus Energy and Ovo, were not technically compliant.  The capital adequacy threshold is understood to work out at roughly £115 per dual-fuel customer. A spokesperson for Ovo said: \"We have taken proactive measures to align with Ofgem's new capital rules, working constructively to meet the requirements.\" Ovo was catapulted into the industry big league when it bought SSE's residential supply arm. It now has four million customers. The company, like Octopus Energy, has a supply arrangement with Shell, which it argues significantly strengthens its financial resilience."
    },
    {
        "title": "Pure Cremation owner Epiris kicks off £700m sale",
        "description": "The private equity backer of Pure Cremation, one of Britain's biggest funeral providers, has kicked off a sale process which could value the business at as much as &#163;700m.",
        "url": "https://news.sky.com/story/pure-cremation-owner-epiris-kicks-off-163700m-sale-13438389",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-coffin-funeral_6716876.jpg?20241015174412",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-26 07:41:00",
        "Headline": "The operator of the UK's busiest crematorium is sounding out bidders for the company, which was acquired by private equity firm Epiris less than three years ago, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The private equity backer of Pure Cremation, one of Britain's biggest funeral providers, has kicked off a sale process which could value the business at as much as £700m. Sky News has learnt that advisers to Epiris, which acquired the business from its founders in 2023, have begun sounding out prospective bidders about their interest. Houlihan Lokey, the investment bank, is handling the sale. Money latest: Cost of a pint across UK revealed Pure Cremation was founded in 2015 by Bryan and Catherine Powell, with the aim of meeting growing demand for so-called direct cremations, which involve a simple service without mourners in attendance. The company offers pre-paid plans, which the company is understood to believe represents a significant growth opportunity for a future owner. Pure Cremation is now run by Dean Lamble, the former chief executive of SunLife Insurance. \n                  Harrods customers' details stolen in IT systems breach\n                 \n                  Shares in pharmaceutical firms drop as Trump reveals fresh round of trade tariffs\n                 \n                  Money latest: Major change to how parents earning £60-80k repay child benefit\n                 Sources said the current owners expected to achieve an exit worth well in excess of £500m, and potentially as much as £700m, based on current and projected profitability. Read more from Sky News:Trump reveals fresh round of trade tariffs A decline in the number of religious funerals taking place in Britain each year has fuelled growth in lower-cost alternatives. Pure Cremation operates the UK's busiest crematorium, located in Andover, Hampshire. Epiris declined to comment."
    },
    {
        "title": "Eden Project losses double as visitor numbers fall and jobs go",
        "description": "Cornwall's Eden Project has revealed a doubling of losses and dwindling visitor numbers - as it also cut dozens of jobs. ",
        "url": "https://news.sky.com/story/eden-project-losses-double-as-visitor-numbers-fall-and-jobs-go-13438412",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-eden-project-cornwall_7031955.jpg?20250926093146",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-26 08:26:00",
        "Headline": "The company cited the rise in employer national insurance contributions - which has put pressure on many businesses - and the \"general inflationary impact\" of last year's budget as particular challenges.",
        "Content": "Cornwall's Eden Project has revealed a doubling of losses and dwindling visitor numbers - as it also cut dozens of jobs.  The attraction's famous domes are home to thousands of plant species but it has recently seen a 10% drop in people through the gate. It blamed \"more challenging trading conditions in South West tourism\" as visitors fell from 604,000 to 543,000 over the last financial year. Pre-tax losses also grew to £3.5m from £1.5m in the year to April, according to its latest accounts. The company said 75 jobs had been culled as part of a \"major restructuring\" to become more efficient and reduce employment costs. It cited the rise in employer national insurance contributions - which has put pressure on many businesses - and the \"general inflationary impact\" of last year's budget as particular challenges. However, it said it remained a \"must visit\" location for people visiting the area. \"As in previous years, we saw a large proportion of first-time visitors along with welcoming back seasoned visitors,\" the company added. Read more from Sky News:Farage on course to be next PM, poll projectsUK population grows by more than three-quarters of a million The architect behind the attraction, Sir Nicholas Grimshaw, died this month at the age of 85. The Eden Project opened in 2001, built in an old clay mine near St Austell - and four years ago hosted a reception for world leaders and Queen Elizabeth II as part of the G7 summit. Another Eden Project is planned for Morecambe in Lancashire, with construction set to start in 2028.  "
    },
    {
        "title": "NatWest boss continues leadership overhaul as operating chief leaves",
        "description": "The chief executive of NatWest Group is continuing his overhaul of the bank's leadership months after it returned to full private sector ownership.",
        "url": "https://news.sky.com/story/natwest-boss-continues-leadership-overhaul-as-operating-chief-leaves-13438393",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-natwest-banking_6455634.jpg?20240214173136",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-26 07:48:00",
        "Headline": "The bank's group COO Jen Tippin is leaving - as chief executive names a new chief customer and operations officer aimed at accelerating its transformation, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The chief executive of NatWest Group is continuing his overhaul of the bank's leadership months after it returned to full private sector ownership. Sky News has learnt that Paul Thwaite, who took over as the lender's boss two years ago, has created a new executive role aimed at sharpening its focus on customer service. James Holian, who has been at the company for over 15 years, has been installed as chief customer and operations officer, according to a memo circulated on Friday and seen by Sky News. Mr Holian's role will absorb many of the responsibilities of NatWest's group chief operating officer role, which was held by Jen Tippin. Ms Tippin, who was previously in charge of human resources and technology at NatWest, will leave the company. Money latest: Cost of a pint across UK revealed NatWest's profitability has surged under Mr Thwaite, enabling the government to sell the last of its stake this year - albeit at an overall loss of about £10bn on its £45.5bn rescue in 2008. \n                  Harrods customers' details stolen in IT systems breach\n                 \n                  Shares in pharmaceutical firms drop as Trump reveals fresh round of trade tariffs\n                 \n                  Money latest: Major change to how parents earning £60-80k repay child benefit\n                 Britain's banking landscape has also shifted significantly in recent years, with the growth of digital banks such as Monzo and Starling drawing millions of customers away from established high street lenders. Mr Thwaite is also keen to overhaul NatWest's use of technology, with artificial intelligence set to exert a profound influence on banks' interactions with customers. In July, the group announced a five-year partnership with Accenture and Amazon Web Services to re-examine its storage of customer data. Read more from Sky News:Trump reveals fresh round of trade tariffs Scott Marcar, another senior executive at NatWest, will - along with its so-called Digital X team - focus exclusively on accelerating its technology, AI and data capabilities. NatWest's fraud and financial crime teams will instead be moved under Mr Holian's remit. A NatWest spokesperson said: \"We thank Jen for her significant contribution to the group over the last five years. She has been instrumental in helping to drive our transformation and we wish her every success in the future.\""
    },
    {
        "title": "Sir Keir Starmer says next election will be 'open fight' between Labour and Reform",
        "description": "Sir Keir Starmer has said the next election will be an \"open fight\" between Labour and Reform UK.",
        "url": "https://news.sky.com/story/sir-keir-starmer-says-next-election-will-be-open-fight-between-labour-and-reform-13438610",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-uk-politics-keir-starmer_7032183.jpg?20250926125516",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-26 13:47:00",
        "Headline": "It is the first time the prime minister has publicly acknowledged Labour's opponent will be Reform, not the Conservatives.",
        "Content": "Sir Keir Starmer has said the next election will be an \"open fight\" between Labour and Reform UK. The prime minister, speaking at a conference alongside the leaders of Canada, Australia and Iceland, said the UK is \"at a crossroads\". \"There's a battle for the soul of this country, now, as to what sort of country do we want to be?\" he said. \"Because that toxic divide, that decline with Reform, it's built on a sense of grievance.\" It is the first time Sir Keir has explicitly said the next election would be a straight fight between his party and Reform - and comes the day before the Labour conference begins. Just hours before, after Sky News revealed Nigel Farage is on course to replace him, as a seat-by-seat YouGov poll found an election held tomorrow would result in a hung parliament, with Reform winning 311 seats - just 15 short of the 326 needed to win overall. Once the Speaker, whose seat is unopposed, and Sinn Fein MPs, who do not sit in parliament, are accounted for, no other party would be able to secure more MPs, so Reform would lead the government. \n                  Former Welsh Reform UK leader pleads guilty to bribery over pro-Russian statements\n                 \n                  Nigel Farage on course to be next prime minister, mega poll projects\n                 \n                  Farage and Tice right to scrutinise one of Bank of England's most radical monetary experiments in history\n                  Sir Keir said there is a \"right-wing proposition\" the UK has not had before, as it has been decades of either a Labour or Tory government, \"pitched usually pretty much on the centrepiece of politics, the centre ground of politics\". The PM said Reform and its leader, Mr Farage, provide a \"very different proposition\" of \"patriotic national renewal\" under Labour and a \"toxic divide\". He described his Labour government of being \"capable of expressing who and what we are as a country accurately and in a way where people feel they're valued and they belong, and that we can actually move forward together\". Sir Keir referenced a march down Whitehall two weeks ago, organised by Tommy Robinson, as having \"sent shivers through the spines of many communities well away from London\". Elon Musk appeared via videolink at the rally and said \"violence is coming to you\", prompting accusations of inciting violence. Read more:Starmer reveals digital ID planDavey warns Farage wants to turn Britain into 'Trump's America' The prime minister said the choice for voters at the next election, set to be in 2029, \"is not going to be the traditional Labour versus Conservative\". \"It's why I've said the Conservative Party is dead,\" he added. \"Centre-right parties in many European countries have withered on the vine and the same is happening in this country.\" Reacting to Sir Keir's comments, a Reform UK spokesman said: \"For decades, the British people have been betrayed by both Labour and the Conservatives. \"People have voted election after election for lower taxes and controlled immigration, instead, both parties have done the opposite.\"The public are now waking up to the fact Starmer is just continuing the Tory legacy of high taxes and mass immigration.\""
    },
    {
        "title": "Former Lib Dem leader Sir Menzies Campbell dies",
        "description": "Former Liberal Democrat leader Sir Menzies Campbell has died aged 84.",
        "url": "https://news.sky.com/story/former-lib-dem-leader-sir-menzies-campbell-dies-13438490",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-menzies-campbell-ming_7032060.jpg?20250926110747",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-09-26 10:05:00",
        "Headline": "Tributes have been paid to the peer, who rallied against the Iraq War and held the 100m UK record for many years.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Former Liberal Democrat leader Sir Menzies Campbell has died aged 84. The MP for North East Fife from 1987 to 2015, he served as Lib Dem leader from 2006 to 2007 and was well-known for speaking out on foreign policy. He was made a life peer in 2015 and was known as the Lord Campbell of Pittenweem, but his friends knew him as Ming. His grandson, Gregor Grant-Suttie, said Lord Campbell died in London after a period of respite care. He had been planning to return to Scotland but died \"peacefully\" at Kyn Hurlingham care home in the presence of his grandson. Mr Grant-Suttie said that one of his final days was spent watching the Liberal Democrat party conference and enjoying video messages from political friends. He said: \"The myriad of accolades and awards he collected in his professional life paled in comparison to his achievements as a husband, father figure, grandfather, and friend.\" Lord Campbell's grandson added that he was a \"rare breed of Scotsman whose contribution and ideas spanned so much further than his home country's border\", and gave Scotland \"the ability to be extremely proud of one of their own\". Lib Dem leader Sir Ed Davey said Lord Campbell was \"a dedicated public servant, a tireless champion for Fife, St Andrews and the UK, and a true Liberal giant\". He said he \"benefitted greatly\" from his advice and guidance, and added: \"But more than that, he was an incredibly warm and caring friend and colleague, with such generosity and humour. \"All of us in the Liberal Democrat family and beyond will miss him terribly. Our thoughts are with all who loved him.\" Scottish First Minister John Swinney said Lord Campbell was a \"formidable and courteous political leader\" who served his constituents \"with devotion\". He added: \"He was a strong voice for establishing the Scottish Parliament. My sympathy to the Lib Dems and to his family.\" Lord Campbell's wife, Lady Elspeth Grant-Suttie, died aged 83 in 2023. The couple were married for 53 years and had no children, but she had a son from her first marriage. Before moving into politics, Lord Campbell was an athlete, famously breaking Olympic gold medallist Wyndham Halswelle's 53-year-old Scottish 300 yards record in 1961 before competing at the 1964 Olympic Games in Tokyo. He also held the British 100m record from 1967 to 1974, beating aspiring athlete OJ Simpson with a 10.2-second race. The peer was a lawyer in Scotland before entering politics and was chancellor of the University of St Andrews from 2006 until his death. Lord Campbell became well-known for his opposition to the 2003 Iraq War when he was the Lib Dem foreign affairs spokesman and he argued Tony Blair's government should publish the attorney general's secret advice on the war's legality. Lord Blair paid tribute to Lord Campbell as \"one of the most honourable and decent people in politics\". \"He was a true Liberal who supported the New Labour government through its constitutional reforms, was a staunch advocate of multilateral institutions and was a colleague you could trust and work with,\" the former prime minister said. Lord Campbell was only Lib Dem leader for 19 months, after he came under pressure when the then-Labour prime minister Gordon Brown announced there would be no general election after intense speculation. Some in the party felt that without a general election to fight it was time for a younger leader who they felt could connect more with voters, which led to Lord Campbell's resignation - something he always felt was unfair. Sir Nick Clegg, who was championed by Lord Campbell and then leader in the Tory-Lib Dem coalition, said he had been a victim of ageism. Posting on X, former prime minister Mr Brown praised Lord Campbell as \"one of the great leaders of our times and a decent, compassionate man\". Lord Campbell stepped down as an MP at the 2015 general election and became a life peer soon after, despite stating he believed the House of Lords should be \"mainly elected\". He said he would continue to promote the idea \"within the house itself\"."
    },
    {
        "title": "Former Welsh Reform UK leader pleads guilty to bribery over pro-Russian statements",
        "description": "The former leader of Reform UK in Wales has pleaded guilty to bribery over pro-Russian statements about Ukraine in the European Parliament.",
        "url": "https://news.sky.com/story/former-welsh-reform-uk-leader-pleads-guilty-to-bribery-over-pro-russian-statements-13438586",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nathan-gill-court-reform_7032330.jpg?20250926150106",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-26 12:52:00",
        "Headline": "Nathan Gill, 52, of Anglesey, North Wales, pleaded guilty to eight counts of bribery between 6 December 2018 and 18 July 2019 at the Old Bailey on Friday.",
        "Content": "The former leader of Reform UK in Wales has pleaded guilty to bribery over pro-Russian statements about Ukraine in the European Parliament. Nathan Gill, 52, of Anglesey, North Wales, pleaded guilty to eight counts of bribery between 6 December 2018 and 18 July 2019 at the Old Bailey on Friday. The charges relate to when Gill was a Member of the European Parliament (MEP) for Wales before the UK left the European Union in 2020. He also led Reform UK's 2021 Welsh Parliament election campaign, but is no longer a member of the party. The charges state that he \"agreed to receive financial advantage, namely money\" in exchange for statements in both the EU Parliament and opinion pieces for news outlets such as 112 Ukraine that were \"supportive of a particular narrative\" and would \"benefit Russia regarding events in Ukraine\". He was told to make such statements on eight occasions by Oleg Voloshyn - who had been a Ukrainian government official before 2014 - \"and others\", before accepting \"quantities of money in cash\", the court heard. This amounted to \"improper performance\" as a person in elected office, the prosecution said. Gill denied one further charge of conspiracy to commit bribery, which the judge decided would lie on file. Gill was stopped by police at Manchester Airport on 13 September 2021 under the Counter Terrorism and Border Security Act 2019. Detectives seized his phone and searched his home in north Wales, where they took more of his electronic devices. Messages revealed communication between Gill and Mr Voloshyn of an \"agreement to receive money in connection with his performance in his duties as a member of the European Parliament\", Prosecutor Mark Heywood KC said. He was interviewed under caution in March 2022 and charged on 20 January 2025. Read more from Sky NewsFormer Lib Dem leader diesFarage on course to be next PM - pollCould Andy Burnham replace Sir Keir Starmer? Defending Gill, Peter Wright KC acknowledged he was facing a lengthy jail term, but asked for the father-of-five to be given bail ahead of his sentencing. Mrs Justice Chubb said that the former politician had pleaded guilty to the \"full facts\" laid out by the prosecution. \"This is a serious matter. Nathan Gill has admitted having asked questions, made statements and carried out other activities in or connected with the European Parliament in support of pro-Russian parties in the Ukraine conflict,\" she said. She granted him conditional bail ahead of sentencing at the same court on 21 November. Speaking after Friday's plea hearing, Commander Dominic Murphy, head of the Met's counter terrorism command, said: \"Our investigation uncovered an elected MEP was taking payments to peddle narratives that would have had the effect of being beneficial towards Russian interests. \"This case goes to the heart of our democratic values and as we've shown here, we will not hesitate to investigate and disrupt anyone seeking to harm or undermine these values and our national security.\""
    },
    {
        "title": "Watchdog will not reopen donations probe at group led by Starmer's top aide Morgan McSweeney",
        "description": "An investigation into undeclared donations to a campaign group led by Sir Keir Starmer's chief of staff will not be reopened, the political finance watchdog has said.",
        "url": "https://news.sky.com/story/watchdog-will-not-reopen-donations-probe-at-group-led-by-starmers-top-aide-morgan-mcsweeney-13438569",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-morgan-mcsweeney-starmer-inner-circle_6619153.jpg?20250924095254",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-26 12:31:00",
        "Headline": "The Conservatives have accused Morgan McSweeney of a cover-up over donations to a thinktank he ran, but the Electoral Commission said it will not re-investigate.",
        "Content": "An investigation into undeclared donations to a campaign group led by Sir Keir Starmer's chief of staff will not be reopened, the political finance watchdog has said. The Electoral Commission said it had found \"no evidence of any other potential offences\" so would not reopen its investigation into Labour Together. The group, previously led by the PM's closest aide Morgan McSweeney, was fined £14,250 in September 2021 over late reporting of £740,000 of donations after it reported itself to the Electoral Commission over what it said was an \"administrative error\". Mc McSweeney left his role in April 2020 to become a senior aide to Sir Keir in opposition and then in government but was leading Labour Together during the period it was fined for. The Conservatives had called for a new investigation by the Electoral Commission after obtaining leaked emails they claim show Mr McSweeney had attempted to cover up the late reporting of donations as an administrative error. An Electoral Commission spokesperson said: \"We have thoroughly reviewed this information and found no evidence of any other potential offences. We are confident that the initial determination and sanction were appropriate. \"We are therefore not reopening the investigation.\" \n                  Sir Keir Starmer says next election will be 'open fight' between Labour and Reform\n                 \n                  The pros and cons of digital IDs - and do we need them?\n                 \n                  Former Lib Dem leader Sir Menzies Campbell dies\n                 They added that Labour Together's fine had been \"significant\" and reflected \"the seriousness of the offences determined, for which no reasonable excuse was put forward\". Read more:Starmer's 'highly talented' aide will stay in post, minister saysMinister backs 'formidable' chief-of-staff McSweeney Tory party chairman Kevin Hollinrake said the commission's decision was \"wrong\". \"The commission must now publish all of their Morgan McSweeney files to ensure the public has full transparency,\" he added. \"It is clear that Morgan McSweeney deceived the Electoral Commission, but has dodged a criminal offence on a technicality. This loophole won't wash. \"The Conservatives uncovered clear evidence of McSweeney's industrial scale cover-up of a slush fund used to install Keir Starmer as Labour Leader. Despite the denials of Labour and Nothing to See Here Keir, it is clear that the prime minister's chief of staff still has very serious questions to answer. \"This is not over, we will continue to reveal more evidence, and continue to push for a full investigation by the Parliamentary Standards Commissioner into Keir Starmer. The British public deserve the full truth, not another cover-up, and the Conservatives will continue to fight until they get that.\" A spokesman for Labour Together said: \"Today, we welcome the Electoral Commission's decision that there are no new grounds for action or investigation. \"Labour Together proactively raised concerns about its own reporting of donations to the Electoral Commission in 2020. \"The Electoral Commission's investigation, with which Labour Together fully cooperated, was completed in 2021. Since then, we have taken measures to ensure Labour Together is fully compliant with all Electoral Commission regulations.\" A Labour Party spokesperson said: \"The Conservatives have zero answers to the challenges faced by working people. \"In a pathetic and desperate attempt to stay relevant, the Tories only hope is to throw mud at the wall and hope something sticks. There isn't a low that they won't stoop to. \"They can't be trusted and they haven't changed. The Electoral Commission considers this matter closed.\"This Labour government is solely focused on fixing the mess left by the Tories, and renewing Britain - to make people right across the country better off.\""
    },
    {
        "title": "Starmer reveals digital ID plan after admitting Labour 'shied away' from illegal immigration concerns",
        "description": "Sir Keir Starmer has unveiled a plan for a digital ID scheme after admitting Labour had previously shied away from addressing immigration concerns.",
        "url": "https://news.sky.com/story/starmer-admits-labour-previously-shied-away-from-immigration-concerns-13438323",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-northern-ireland_7025482.jpg?20250919183418",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-26 02:41:00",
        "Headline": "The prime minister says it's now \"essential\" to tackle \"every aspect of the problem of illegal immigration\".",
        "Content": " Sir Keir Starmer has unveiled a plan for a digital ID scheme after admitting Labour had previously shied away from addressing immigration concerns. \"You will not be able to work in the UK if you don't have a digital ID, it's as simple as that,\" Sir Keir told a conference in London. He said the scheme would \"make it tougher to work illegally in this country, making our borders more secure\". It would require anyone starting a job or renting a home to show it on their phone, which would then be checked against a database of those entitled to work and live here. The plan sees digital IDs becoming mandatory for the right to work by the end of this parliament. The prime minister wrote in The Daily Telegraph today that it was now \"essential\" to tackle \"every aspect of the problem of illegal immigration\". \"There is no doubt that for years left-wing parties, including my own, did shy away from people's concerns around illegal immigration,\" he said. Workers currently have to show at least one form of physical ID, but there are concerns these can be faked. The prime minister said the scheme would \"offer ordinary citizens countless benefits\", making it easier to apply for services such as driving licences, childcare and welfare. Read more:The pros and cons of digital IDs - and do we need them? A consultation will look at how the scheme could work for those who may not have a smartphone, such as older people or homeless people. French President Emmanuel Macron has repeatedly warned that the lack of ID cards acts as a major pull for Channel crossings, as migrants feel they can find work in the black economy.  Sir Keir told Friday's Global Progress Action Summit it had been \"too easy for people to come here, slip into the shadow economy and remain here illegally\". \"It is not compassionate left-wing politics to rely on labour that exploits foreign workers and undercuts fair wages,\" he added. \"But the simple fact is that every nation needs to have control over its borders.\" Culture Secretary Lisa Nandy told Sky News Breakfast: \"For people who come here and want to work, it will be compulsory to show it [the digital ID]. \"For all other UK citizens it will be compulsory to have it, but not to show it. People will be able to choose whether they use it or not.\"  Labour U-turn The plan represents a major shift, as last year ministers ruled out the idea following Sir Tony Blair's plea to bring in an ID scheme. In July, former home secretary Yvette Cooper said: \"It's not in our manifesto. That's not our approach.\" Read more from Sky News:Two more deported under UK-France returns dealCampaigners on why they oppose asylum hotels protests Former prime minister Sir Tony has long been an advocate of ID cards and also tried to get a scheme off the ground when he was in charge. Those proposals were scrapped after Labour lost power in 2010, having been opposed by the Liberal Democrats and the Tories at the time. A report by the Tony Blair Institute this week said digital ID can \"help close loopholes that trafficking gangs and unscrupulous employers currently exploit, reducing pull factors driving illegal migration to Britain and restoring control over borders\". However, the idea has long been opposed by civil liberty and privacy groups. Sir Keir is said to have shared their concerns but came around amid record levels of small boat crossings. Big Brother Watch believes ID cards will turn \"us into a checkpoint society that is wholly unBritish\", while Reform UK and the Tories argue they won't stop small boat crossings. A petition against digital ID cards has already reached half a million signatures."
    },
    {
        "title": "Microsoft blocks some services used by Israeli military unit after investigation into mass surveillance of Palestinians",
        "description": "Microsoft has blocked an Israeli military unit from accessing some services after preliminary evidence supported a media investigation that the software was used for surveillance of Palestinian civilian phone calls.",
        "url": "https://news.sky.com/story/microsoft-blocks-some-services-used-by-israeli-military-unit-after-investigation-into-mass-surveillance-of-palestinians-13438335",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-microsoft-logo-generic_7031860.jpg?20250926063222",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-26 04:04:00",
        "Headline": "Microsoft's Azure software was used to store \"millions\" of recordings of mobile phone calls made by Palestinians living in Gaza and the Israeli-occupied West Bank.",
        "Content": "Microsoft has blocked an Israeli military unit from accessing some services after preliminary evidence supported a media investigation that the software was used for surveillance of Palestinian civilian phone calls. The unit used Microsoft's Azure software to store \"millions\" of recordings of mobile phone calls made by Palestinians living in Gaza and the Israeli-occupied West Bank, according to a joint investigation by The Guardian and other outlets published in August. The investigation prompted an internal review by Microsoft, which found details of the Israel Ministry of Defence's (IMOD) consumption of Azure storage capacity in the Netherlands and the use of AI services supported the reporting. \"We do not provide technology to facilitate mass surveillance of civilians,\" Microsoft president Brad Smith said in a company blog. He said the decision to \"cease and disable\" certain IMOD subscriptions, including the use of specific cloud storage and AI services, would not impact Microsoft's cyber security services to Israel and other Middle Eastern countries. A spokesperson for the IMOD told Sky News' US partner network NBC that it had no comment following Microsoft's announcement. In August, the military told The Guardian that Microsoft \"is not and has not been working with the (Israeli military) on the storage or processing of data\". Microsoft has been the target of protests over its ties to Israel, including by a tech industry worker-led campaign group called No Azure for Apartheid. It is among pro-Palestinian groups that welcomed Microsoft's decision to block the Israeli military from certain services. Read more from Sky News:Trump 'very, very committed' to ending Gaza warUS president thinks 'some kind of deal' close in Gaza It is a \"point of vindication for those brave tech workers who stood up and protested\", said Imraan Siddiqi, executive director of the Washington state chapter of the Council on American Islamic Relations. The Guardian's investigation was conducted with Israeli-Palestinian publication +972 Magazine and Hebrew-language outlet Local Call."
    },
    {
        "title": "Wallace and Gromit creator talks clay and creativity - as he returns home to reopen museum",
        "description": "It's hard to believe it's 35 years since a plasticine man in a sweater and slippers, along with his voiceless, but hugely expressive dog, burst on to our screens and won the hearts of millions with their mix of humour, charm and nostalgia.",
        "url": "https://news.sky.com/story/wallace-and-gromit-creator-talks-clay-and-creativity-as-he-returns-home-to-reopen-museum-13438652",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-wallace-and-gromit_7032389.jpg?20250926154530",
        "type": "Entertainment",
        "Author": "Charlotte Leeming, north of England correspondent",
        "Date Published": "2025-09-26 14:15:00",
        "Headline": "A new Wallace and Gromit exhibition is being showcased at the Harris Museum in Preston, which the hit show's creator Nick Park visited frequently growing up.",
        "Content": "By Charlotte Leeming, north of England correspondent   It's hard to believe it's 35 years since a plasticine man in a sweater and slippers, along with his voiceless, but hugely expressive dog, burst on to our screens and won the hearts of millions with their mix of humour, charm and nostalgia. Wallace and Gromit managed to be both familiar and fresh, and their modest creator Nick Park couldn't have foreseen how their handmade adventures would change the world of animation and make Wensleydale cheese internationally famous. But three decades on and Preston-born Park is beginning to realise that his flair for feel-good filmmaking has made him a very big deal. Oscar wins and box office hits aside, his latest accolade, in the Lancashire city where he was born and bred, clearly means a lot. A new Wallace and Gromit exhibition is being showcased at the Harris Museum, which Park visited frequently growing up. The historic landmark looms large over the city centre and is filled with artefacts and treasures that inspired him as a boy. He was drawn to the library and devoured books on his favourite subject, you guessed it, animation. The museum has been closed for four years as part of a £19m revamp. And who better to re-open it this weekend than Park. As we meet at the exhibition, he tells me he was a quiet child who loved drawing. Visits to the museum helped shape his creativity and storytelling. He said: \"I used to love spending a day around here looking at all the artefacts, the paintings. I used to come to the library here, there was no internet, and so I would look for books on animation. \"I would scour the library for anything I could get my hands on.\" We chat in a life-size replica of Wallace and Gromit's living room. The wallpaper, standing lamp and armchair are so familiar. Park says it's like sitting in one of his own sets. The living room was actually based on his grandma's house, which he describes as a cosy 1960s home. And as he sits in the chair with his cup of tea, he jokes that he's now turned into Wallace. He said: \"I feel like I'm made of clay, sitting on a replica set, it's just incredible.\" But that's the joy of his films - the personal touch. And whilst they're unmistakably Northern, inspired by Park's family and upbringing, they're also universally relatable. He said: \"I used to draw from my own childhood a lot, and that's what inspired me. Because it feels true to do that. \"So, I went to memories of my granny, the lamp stand that my granny had and other objects, toasters, clocks, you name it.\" Park is now arguably as famous as his much-loved characters. Something he seems to be finally getting used to. He says he's honoured and a little overwhelmed that his hometown holds him and his clay creations so close to his heart. He said: \"I was a shy teenager, and just talking about this hobby, I never imagined they would become household names. \"So, to have statues of my characters in the centre of town and now to be opening this newly refurbished exhibition and my own exhibition. To be here with my own characters, it's just crazy.\" Read more from Sky News:Pokemon pushes back against ICE deportation videoStar criticises decision to delay release of new show after Charlie Kirk killing I ask what this stop motion supremo makes of the use of AI and technology in film. He said: \"We need to hang onto our values, there's something about handmade quality that gives everything charm and appeal. \"It would probably be wrong to completely ignore that.\" The exhibition is immersive and emotive. Being up close and personal with the models, drawings, and characters evokes the same feelings as the films do. Warmth, humour and nostalgia. A journey through the formative years of a young filmmaker and the birth of one of cinema's unlikeliest heroes. Park is now inspiring the next generation of storytellers and filmmakers at the museum, which played such an important part in his own success story. Wallace and Gromit in A Case at the Museum Exhibition opens on Sunday and runs until January."
    },
    {
        "title": "Prince of Wales says 2024 was 'hardest year' of his life",
        "description": "The Prince of Wales has told Schitt's Creek star Eugene Levy that 2024 was the \"hardest year\" of his life.",
        "url": "https://news.sky.com/story/prince-of-wales-says-2024-was-hardest-year-of-his-life-13438963",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-prince-of-wales-eugene-levy_7032834.jpg?20250926230507",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-26 21:25:00",
        "Headline": "The future king told Hollywood star Eugene Levy about last year, which saw his wife, the Princess of Wales, and his father, the King, both undergoing treatment for cancer.",
        "Content": " The Prince of Wales has told Schitt's Creek star Eugene Levy that 2024 was the \"hardest year\" of his life. The future king told the Hollywood star about last year, which saw his wife, the Princess of Wales, and his father, the King, both undergoing treatment for cancer. The pair were catching up over a pint in a pub as part of Apple TV+ series The Reluctant Traveler With Eugene Levy, which will air next month. In the episode Living The Royal Life In The UK, William tells Levy: \"I'd say 2024 was the hardest year I've ever had. \"Life is said to test us as well and being able to overcome that is what makes us who we are.\" The preview of the episode also saw Levy invited to \"pop down\" to Windsor Castle for a private tour by the prince. Levy, 78, can be seen reading out an invitation saying: \"I heard that your travels have brought you to the UK and I wondered if you might like to see Windsor Castle? \n                  Prince William praises 'remarkable legacies' of Southport victims' parents\n                 \n                  Trump100: The King and the Donald\n                 \n                  Sword, book and Union flag among gifts exchanged between the King and Donald Trump\n                 \"If you're free at 10 tomorrow, why don't you pop down to the Castle for a private tour. \"Would be great to see you!\" Read more from Sky News:Hackers 'behind nursery cyber attack' reveal details of threatElon Musk and Prince Andrew named in latest Epstein files release After touring the castle, Levy asks William what he does when he is at home, and the prince laughs and replies: \"Sleep. When you have three small children, sleep is an important part of my life.\" New episodes of The Reluctant Traveler With Eugene Levy will premiere weekly until the finale on 31 October 2025. The special episode with William will air on 3 October."
    },
    {
        "title": "Jimmy Kimmel's show back on Sinclair and Nexstar thanks to viewer feedback",
        "description": "Jimmy Kimmel's late-night talk show will return to ABC affiliates belonging to Sinclair and Nexstar after the two major network operators took his programme off-air over his comments in the wake of Charlie Kirk's assassination.",
        "url": "https://news.sky.com/story/jimmy-kimmels-show-back-on-sinclair-and-nexstar-thanks-to-viewer-feedback-13438996",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jimmy-kimmel-show_7030034.jpg?20250924074319",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-26 22:57:00",
        "Headline": "His show was suspended over Kimmel's comments in the wake of conservative activist Charlie Kirk's assassination. Disney announced the return of Jimmy Kimmel Live on Tuesday, but both Sinclair and Nexstar initially said they would not resume airing the programme.",
        "Content": "Jimmy Kimmel's late-night talk show will return to ABC affiliates belonging to Sinclair and Nexstar after the two major network operators took his programme off-air over his comments in the wake of Charlie Kirk's assassination. Kimmel was accused of being \"offensive and insensitive\" after using his programme, Jimmy Kimmel Live, to accuse Donald Trump and his allies of capitalising on the killing. Disney-owned ABC suspended the show last week following threats of potential repercussions from the Trump-appointed head of the Federal Communications Commission. Sinclair, which controls 38 ABC affiliates from Seattle to Washington DC, called on Kimmel to apologise to Mr Kirk's family over the comments and asked him to \"make a meaningful personal donation\" to Turning Point USA, the nonprofit that the conservative activist founded. On Tuesday, Disney announced the return of the programme after backlash to its suspension, but both Sinclair and Nexstar, which own more than 20% of ABC affiliates, initially said they would not resume airing the show. Kimmel criticised the ABC affiliates who preempted his show during his TV return, saying: \"That's not legal. That's not American. It's un-American.\" Three days later, the two major network operators announced that Jimmy Kimmel Live would return to their TV stations after the week-long boycott. \n                  Jessica Chastain criticises decision to delay release of The Savant after Charlie Kirk killing\n                 \n                  Trump makes major shift in Ukraine policy\n                 \n                  Jimmy Kimmel addresses Charlie Kirk comments in first show since being taken off-air\n                 The move came after Sinclair received \"thoughtful feedback from viewers, advertisers and community leaders\". In its statement, the company pointed to its \"responsibility as local broadcasters to provide programming that serves the interests of our communities, while also honouring our obligations to air national network programming.\"  Nexstar, which controls 28 ABC affiliates from Kansas to New Orleans, said in a similar statement that it was airing content that is \"in the best interest of the communities we serve\". Both companies said their decisions were not affected by influence from the Trump administration or anyone else. The president had criticised the programme's return on Tuesday, writing on Truth Social that he \"can't believe\" ABC gave Kimmel his show back and hinted at further action. \"Why would they want someone back who does so poorly, who's not funny, and who puts the Network in jeopardy by playing 99% positive Democrat GARBAGE,\" Mr Trump wrote. \"He is yet another arm of the DNC (Democratic National Committee) and, to the best of my knowledge, that would be a major illegal Campaign Contribution. I think we're going to test ABC out on this.\" During Kimmel's first show since being taken off-air, the presenter said it was \"never my intention to make light of\" Mr Kirk's death. \"I don't think there's anything funny about it,\" he said as he choked up. \"Nor was it my intention to blame any specific group for the actions of what was obviously a deeply disturbed individual. That was really the opposite of the point I was trying to make\". Read more from Sky News:Musk and Prince Andrew named in latest Epstein releaseTrump: 'Looks like we have a deal' to end war in Gaza Speaking on Tuesday night's show, Kimmel said he understood why the remarks \"felt either ill-timed or unclear, or maybe both\". New episodes of Jimmy Kimmel Live air Monday to Thursday, and Friday night's rerun will be of Tuesday's show, meaning viewers of Sinclair stations will be able to watch Kimmel's emotional return to the air."
    },
    {
        "title": "Paul Gallagher: Older brother of Oasis stars Liam and Noel denies rape charge",
        "description": "The older brother of Oasis stars Liam and Noel Gallagher has denied a charge of rape.",
        "url": "https://news.sky.com/story/paul-gallagher-older-brother-of-oasis-stars-liam-and-noel-denies-rape-charge-13436816",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-paul-gallagher-court_7032313.jpg?20250926144554",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-26 13:30:00",
        "Headline": "The 59-year-od also pleaded not guilty to other charges, including coercive and controlling behaviour, at Southwark Crown Court.",
        "Content": "The older brother of Oasis stars Liam and Noel Gallagher has denied a charge of rape. Paul Gallagher, 59, has also pleaded not guilty to coercive and controlling behaviour, three counts of sexual assault, three counts of intentional strangulation, two counts of making a threat to kill, and assault occasioning actual bodily harm. The alleged offences took place between 2022 and 2024, according to a charge sheet. Gallagher, of East Finchley, north London, entered his pleas from the dock at Harrow Crown Court, which was sitting at Southwark Crown Court on Friday. He was wearing a dark suit and shirt, and thick-rimmed glasses. Gallagher was released on conditional bail and will face trial on September 13, 2027. Judge Anupama Thompson told him: \"I'm very sorry that it's such a long time away, but we have a number of cases that need to be listed.\" Paul Gallagher, who is about a year older than Noel and seven years older than Liam, has never been involved in Oasis."
    },
    {
        "title": "Pokemon pushes back against ICE deportation video - joining list riled by Trump administration",
        "description": "Pokemon has said it did not give permission for the show's popular theme song to be used in a video showing deportations posted by the US government.",
        "url": "https://news.sky.com/story/pokemon-pushes-back-against-ice-deportation-video-joining-list-riled-by-trump-administration-13438421",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-pokemon-beyonce-rolling-stones_7031986.jpg?20250926100747",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-26 08:43:00",
        "Headline": "Multiple artists and brands have publicly spoken out after their images, songs and voices were used in government or political videos during Trump's campaign and presidency. Here are some of the most notable cases.",
        "Content": "Pokemon has said it did not give permission for the show's popular theme song to be used in a video showing deportations posted by the US government. The video, which was captioned with Pokemon's slogan \"Gotta catch 'em all\", showed border patrol and Immigration and Customs Enforcement (ICE) agents making several arrests. It also features snippets of Pokemon's anime TV show, showing the main character Ash Ketchum. In a statement, the Pokemon Company International said: \"Our company was not involved in the creation or distribution of this content, and permission was not granted for the use of our intellectual property.\" It was posted on the Homeland Security X account and the White House TikTok page and has been viewed millions of times. In response to Sky News' request for comment, a DHS spokesperson played on the lyrics of the Pokemon theme tune, saying: \"To arrest them is our real test. To deport them is our cause.\" Pokemon is just one in a long list of artists and brands that have publicly distanced themselves from the Trump administration after their images, songs or voices were used in government or political campaign videos. Here are some of the most notable times the White House - or Donald Trump himself - has clashed with popular culture. Theo Von The comedian and podcaster objected to a now-deleted DHS video which used a clip of him saying \"heard you got deported dude, bye\". Von, who interviewed Mr Trump during the presidential campaign on his podcast This Past Weekend, and is a popular figure among a mostly young male audience, shared the DHS video to his more than 1.6 million X followers on Tuesday, saying he \"didn't approve of this\". \"I know you know my address so send a cheque,\" Von said in a now-deleted post, according to Sky News' US partner network, NBC News. \"And please take this down and please keep me out of your 'banger' deportation videos. When it comes to immigration my thoughts and heart are a lot more nuanced than this video allows. Bye!\" NBC reported that shortly after its original article was published, DHS took down the video. Jess Glynne British singer-songwriter Jess Glynne said she felt \"sick\" after the DHS posted a video in July that overlaid her 2015 single Hold My Hand over footage of people being handcuffed and boarding planes. The song has become closely associated with holiday company Jet2, whose advert went viral on TikTok along with the voiceover \"nothing beats a Jet2 holiday\". Mocking the viral trend, the DHS video was captioned: \"When ICE books you a one-way Jet2 holiday to deportation. Nothing beats it!\" Responding to the video on her Instagram stories, Glynne said her music \"is about love, unity and spreading positivity - never about division or hate\". Black Rebel Motorcycle Club Californian rock band Black Rebel Motorcycle Club issued a cease and desist notice to the DSH in July after a video posted on Instagram used their version of the folk song, God's Gonna Cut You Down. A cease and desist letter is often sent before any formal legal action starts, and demands that the recipient stops their allegedly unlawful activity and does not repeat it. Reacting to the video, which shows a montage of border protection officers, the band accused the DHS of breaching copyright law. A statement said: \"For the record, we hereby order @dhsgov to cease and desist the use of our recording and demand that you immediately pull down your video.\" The video remains on the official DHS Instagram page. Beyonce  While on the presidential campaign trail in August 2024, Mr Trump's campaign spokesperson used Beyonce's song Freedom in a video of the president attending an event in Michigan. Shortly after the clip was posted on X, Beyonce's record label threatened to issue a cease and desist letter to the Trump campaign. A source told Rolling Stone magazine that they did not obtain permission to use the song, which is from the singer's 2016 album Lemonade. The song was then adopted by Kamala Harris's campaign and played regularly at her rallies, one of which Beyonce spoke at. Rolling Stones Ahead of the 2020 presidential election, the Rolling Stones warned the president that he would face legal action if he continued to use their songs at his campaign rallies. A statement released by the band's legal team at the time said that despite cease and desist letters being issued, the band was \"taking further steps\" to exclude Mr Trump from using their songs for his political campaigning. The band warned it was working with performing rights organisation the BMI, and would bring a lawsuit if Mr Trump continued to use music that had not been licensed. So what does the law say? In short, to use music for online promotional content, licences are needed from the owners of the composition and sound recording. Without the proper licences, companies can expose themselves to risks of copyright infringement claims, including when content is posted by influencers - and this can come with hefty financial penalties. TikTok provides users with a library of licensed music, which includes songs that can be used in videos. However, these can be used for personal entertainment or non-commercial purposes only. The social media platform says content that promotes a brand, product, or service should use music from its commercial music library, which is pre-cleared for commercial use. Meta, the company which owns Instagram and Facebook, has similar rules on music use. Politicians on a campaign trail may be able to use copyrighted music under fair use - a legal doctrine in the US, similar to the UK's fair dealing. To qualify as fair use, four factors need to be considered, including purpose, the nature of the copyrighted work, the amount and sustainability used and the effect it could potentially have on the value of the copyrighted work."
    },
    {
        "title": "Bob Vylan: BBC partly upholds complaints over Glastonbury set",
        "description": "Bob Vylan's Glastonbury Festival set breached BBC editorial standards when it was livestreamed, its Executive Complaints Unit (ECU) has found.",
        "url": "https://news.sky.com/story/bob-vylan-bbc-partly-upholds-complaints-over-glastonbury-set-13438423",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bob-vylan-glastonbury_6952866.jpg?20250628221842",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-26 08:44:00",
        "Headline": "While the investigation found harm and offence standards had been overstepped, the BBC was cleared of breaching its guidelines relating to material that is likely to encourage or incite crime.",
        "Content": "Bob Vylan's Glastonbury Festival set breached BBC editorial standards when it was livestreamed, its Executive Complaints Unit (ECU) has found. During their performance at Worthy Farm in June, the punk-rap duo led the crowd in chants of \"death to the IDF\". The ECU received four complaints about the performance relating to incitement to violence, terrorism or ethnic cleansing, hate speech and expressions of antisemitism. Its ruling, which was published on Thursday, was largely made based on frontman Bobby Vylan's chants, as well as reciting the slogans, \"From the river to the sea\" and \"Free, free Palestine\". The ruling also referenced when the same group member described the boss of a record company \"in the most abusive terms\" and referred to \"f****** Zionists\" - as it breached the guidelines of harm and offence that describe using \"unduly intimidating, humiliating, intrusive, aggressive or derogatory remarks aimed at real people\". But while the investigation found that harm and offence standards had been overstepped, the corporation was cleared of breaching its guidelines relating to material that is likely to encourage or incite crime. The ECU said: \"In the context of a performance at a music festival, the chanting of slogans can be regarded as primarily an invitation to endorse a particular attitude. \"References to 'Free Palestine' and 'From the river to the sea', while viewed by some as implying the disappearance of the state of Israel, can also be regarded as no more than expressions of support for aspirations to a Palestinian state and do not of themselves threaten violent action. \"'Death, death to the IDF' is clearly more problematic, but it is directed at an institution rather than individuals, and one which is not defined by ethnic or religious composition.\" It further characterised the comments made about the record boss as \"antisemitic\".  Read more:Who are Bob Vylan?- the duo who led anti-IDF chant at Glastonbury? The ECU said: \"Although Bob Vylan referred to 'Zionists' rather than 'Jews', that appeared to the ECU to be a distinction with very little difference in this instance. \"The ECU therefore shares the view that the content of this act, taken in the round, can fairly be characterised as antisemitic.\" The ruling cleared the BBC of breaching its standards of impartiality, stating that the coverage of the festival is not in line with coverage of news and current affairs. The ECU said: \"While there may be festivals the BBC would not cover on account of their polemical character, a wide tolerance for expressions of opinion by performers or audiences would be in keeping with audience expectations for events it does cover. \"While recognising there is widespread disagreement with the political views expressed by Bob Vylan on this occasion, the ECU did not consider they represented a breach of the BBC's standards of impartiality in this context.\" Following the performance the corporation issued an apology to viewers, especially the Jewish community, and promised to take action to \"ensure proper accountability\". In July, the BBC said they would no longer live broadcast \"high risk\" performances. The corporation also suggested disciplinary action could be taken against staff who failed to halt the livestream. Avon and Somerset Police also launched an investigation into the band's Glastonbury comments. Earlier this month, the band had a Dutch gig cancelled after their frontman made controversial comments over the death of right-wing political activist Charlie Kirk."
    },
    {
        "title": "Pokemon pushes back against ICE deportation video - joining list riled by Trump administration",
        "description": "Pokemon has said it did not give permission for the show's popular theme song to be used in a video showing deportations posted by the US government.",
        "url": "https://news.sky.com/story/pokemon-pushes-back-against-ice-deportation-video-joining-list-riled-by-trump-administration-13438421",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-pokemon-beyonce-rolling-stones_7031986.jpg?20250926100747",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-09-26 08:43:00",
        "Headline": "Multiple artists and brands have publicly spoken out after their images, songs and voices were used in government or political videos during Trump's campaign and presidency. Here are some of the most notable cases.",
        "Content": "Pokemon has said it did not give permission for the show's popular theme song to be used in a video showing deportations posted by the US government. The video, which was captioned with Pokemon's slogan \"Gotta catch 'em all\", showed border patrol and Immigration and Customs Enforcement (ICE) agents making several arrests. It also features snippets of Pokemon's anime TV show, showing the main character Ash Ketchum. In a statement, the Pokemon Company International said: \"Our company was not involved in the creation or distribution of this content, and permission was not granted for the use of our intellectual property.\" It was posted on the Homeland Security X account and the White House TikTok page and has been viewed millions of times. In response to Sky News' request for comment, a DHS spokesperson played on the lyrics of the Pokemon theme tune, saying: \"To arrest them is our real test. To deport them is our cause.\" Pokemon is just one in a long list of artists and brands that have publicly distanced themselves from the Trump administration after their images, songs or voices were used in government or political campaign videos. Here are some of the most notable times the White House - or Donald Trump himself - has clashed with popular culture. Theo Von The comedian and podcaster objected to a now-deleted DHS video which used a clip of him saying \"heard you got deported dude, bye\". Von, who interviewed Mr Trump during the presidential campaign on his podcast This Past Weekend, and is a popular figure among a mostly young male audience, shared the DHS video to his more than 1.6 million X followers on Tuesday, saying he \"didn't approve of this\". \"I know you know my address so send a cheque,\" Von said in a now-deleted post, according to Sky News' US partner network, NBC News. \"And please take this down and please keep me out of your 'banger' deportation videos. When it comes to immigration my thoughts and heart are a lot more nuanced than this video allows. Bye!\" NBC reported that shortly after its original article was published, DHS took down the video. Jess Glynne British singer-songwriter Jess Glynne said she felt \"sick\" after the DHS posted a video in July that overlaid her 2015 single Hold My Hand over footage of people being handcuffed and boarding planes. The song has become closely associated with holiday company Jet2, whose advert went viral on TikTok along with the voiceover \"nothing beats a Jet2 holiday\". Mocking the viral trend, the DHS video was captioned: \"When ICE books you a one-way Jet2 holiday to deportation. Nothing beats it!\" Responding to the video on her Instagram stories, Glynne said her music \"is about love, unity and spreading positivity - never about division or hate\". Black Rebel Motorcycle Club Californian rock band Black Rebel Motorcycle Club issued a cease and desist notice to the DSH in July after a video posted on Instagram used their version of the folk song, God's Gonna Cut You Down. A cease and desist letter is often sent before any formal legal action starts, and demands that the recipient stops their allegedly unlawful activity and does not repeat it. Reacting to the video, which shows a montage of border protection officers, the band accused the DHS of breaching copyright law. A statement said: \"For the record, we hereby order @dhsgov to cease and desist the use of our recording and demand that you immediately pull down your video.\" The video remains on the official DHS Instagram page. Beyonce  While on the presidential campaign trail in August 2024, Mr Trump's campaign spokesperson used Beyonce's song Freedom in a video of the president attending an event in Michigan. Shortly after the clip was posted on X, Beyonce's record label threatened to issue a cease and desist letter to the Trump campaign. A source told Rolling Stone magazine that they did not obtain permission to use the song, which is from the singer's 2016 album Lemonade. The song was then adopted by Kamala Harris's campaign and played regularly at her rallies, one of which Beyonce spoke at. Rolling Stones Ahead of the 2020 presidential election, the Rolling Stones warned the president that he would face legal action if he continued to use their songs at his campaign rallies. A statement released by the band's legal team at the time said that despite cease and desist letters being issued, the band was \"taking further steps\" to exclude Mr Trump from using their songs for his political campaigning. The band warned it was working with performing rights organisation the BMI, and would bring a lawsuit if Mr Trump continued to use music that had not been licensed. So what does the law say? In short, to use music for online promotional content, licences are needed from the owners of the composition and sound recording. Without the proper licences, companies can expose themselves to risks of copyright infringement claims, including when content is posted by influencers - and this can come with hefty financial penalties. TikTok provides users with a library of licensed music, which includes songs that can be used in videos. However, these can be used for personal entertainment or non-commercial purposes only. The social media platform says content that promotes a brand, product, or service should use music from its commercial music library, which is pre-cleared for commercial use. Meta, the company which owns Instagram and Facebook, has similar rules on music use. Politicians on a campaign trail may be able to use copyrighted music under fair use - a legal doctrine in the US, similar to the UK's fair dealing. To qualify as fair use, four factors need to be considered, including purpose, the nature of the copyrighted work, the amount and sustainability used and the effect it could potentially have on the value of the copyrighted work."
    }
]