[
    {
        "title": "Colombian man found guilty of double murder after leaving couple's bodies in suitcases on Bristol bridge",
        "description": "A Colombian man has been found guilty of two murders after taking his victims' bodies in suitcases to Bristol's Clifton Suspension Bridge last year.",
        "url": "https://news.sky.com/story/colombian-man-found-guilty-of-murder-after-leaving-couples-bodies-in-suitcases-on-bristol-bridge-13399496",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-yostin-andres-mosquera_6970055.jpg?20250721155139",
        "type": "Home",
        "Author": "Alice Porter",
        "Date Published": "2025-07-21 06:19:00",
        "Headline": "The gruesome footage of Albert Alfonso's murder, caught on cameras he had placed around the room, was repeatedly played to the jury.",
        "Content": "\n          News correspondent\n              @AlicePorterTV\n  A Colombian man has been found guilty of two murders after taking his victims' bodies in suitcases to Bristol's Clifton Suspension Bridge last year. Yostin Andres Mosquera was convicted on Monday of the murders of Paul Longworth and Albert Alfonso, who were killed in west London on 8 July 2024. Warning: This article contains graphic descriptions of murders. Mosquera's victims were 62-year-old Mr Alfonso and his civil partner, 71-year-old Mr Longworth. It is believed that Mosquera, a 35-year-old who worked in the adult film industry, first met Mr Alfonso online. Mosquera had been sharing paid sexual content of himself online for more than a decade, a jury heard.  The three men struck up a friendship, the couple visited Mosquera in Colombia, and they repeatedly flew Mosquera to the UK to stay with them at their flat in London. While the men would take day trips to tourist attractions, like Madame Tussauds, Mr Alfonso and Mosquera would engage in extreme sex together. But in the weeks leading up to their murders, Mosquera was clearly planning his attacks. He looked online for a freezer and, on the day of the killings, searched for: \"Where on the head is a knock fatal?\" The prosecution argued he was financially motivated. Mosquera repeatedly tried to find the price of the couple's property in Scotts Road, Shepherd's Bush, and stole money from Mr Alfonso after murdering him. Body hidden in divan bed On 8 July 2024, Mosquera killed Mr Longworth by hitting him with a hammer, shattering his skull, before hiding his body in a divan bed. That evening, during sex with Mr Alfonso, Mosquera stabbed him with a knife. A post-mortem examination revealed 22 stab wounds. All of this was recorded on cameras, which had been placed in the room by Mr Alfonso. Mosquera then decapitated the bodies - the heads were stored in a freezer which he had delivered on 9 July. The other remains were put in suitcases and on 10 July, Mosquera hired a van with a driver to transport him and the bags to Clifton Suspension Bridge, where it was claimed he planned to hurl the remains off the structure. 'Pubgoers offered to drive killer over the bridge' Detective Chief Inspector Ollie Stride, from the Metropolitan Police, said members of the public in a nearby pub came outside and tried to help Mosquera, by offering to drive him over the bridge as they saw he was struggling with the suitcases. \"But they simply couldn't lift them into the cars so... they helped him order the taxi, that took him over using Google Translate because they couldn't communicate him, [as] he spoke in Spanish.\" The prosecution argued Mosquera went to Bristol with the intention of throwing the bags off the bridge. But Mosquera caught the attention of passers-by, telling them the cases contained car parts. However, people noticed liquid leaking from the bags - which was blood. Mosquera ran off and was later arrested at Bristol Temple Meads station on 13 July 2024 and charged with both murders. When the case came to trial, initially at the Old Bailey and then at Woolwich Crown Court, the gruesome footage of Mr Alfonso's murder was repeatedly played to the jury. The trial was moved after the first jury was discharged due to problems identifying the accurate times of searches made by Mosquera on his laptop, which had been used as evidence. News correspondent It is not often a murder is caught on camera. It is even rarer when they are filmed from multiple angles, with sound. I was at the Old Bailey for the first trial, where the recording of Mosquera killing Albert Alfonso was repeatedly played to the jury. \n The two men are naked, taking part in consensual sex, which was filmed by Mr Alfonso on several cameras, a normal practice for the pair. Unwittingly, Mr Alfonso recorded his own murder. We see Mosquera hide the knife.  Then, when Mr Alfonso is at his most vulnerable, Mosquera calmly stabs him in the neck.  Mr Alfonso struggles against Mosquera, screaming, but is overpowered. Mosquera cruelly taunts him, asking, \"Do you like it?\" As Alfonso lay dying, Mosquera bizarrely sings and dances before going to Alfonso’s computer. The judge warned the jury about the graphic video, reassuring them that, if they felt unable to proceed due to its content, they would be excused. One jury member did not come back the next day and I could completely understand their discomfort. The sound of screaming was hard to forget. A murder is always upsetting to watch, but this felt intrusive. While many aspects of their sexual relationship could be disturbing to an outsider, Albert Alfonso could never have predicted that his private recordings would be so publicly analysed at a trial into his own murder. Miranda Jollie, senior crown prosecutor at the CPS, said she found the video \"horrific\", but maintained that it was necessary to show the video because of Mosquera's claims. 'Shocking' murder DCI Stride said it was \"one of the most disturbing\" murder cases he has investigated. He added: \"The video that we found of the murder is really shocking. Within seconds of the murder... he [Mosquera] appears to dance, sings a short song, and immediately after that, whilst Mr Alfonso is still lying on the floor, he's straight on the computer and starts searching for... and logging into bank accounts.\" Mosquera denied the murders, but admitted killing Mr Alfonso - his defence team argued it was manslaughter by loss of control. Read more from Sky News:Inquiry to 'uncover truth' behind bloody clashes at miners' strikeEpping protests are just the latest flashpoint of frustrationPaul Gascoigne taken to hospital after collapse - reports However, the video evidence contradicts this claim. It shows Mosquera had hidden the knife before sex, showing the attack was premeditated. He was also calm as he attacked Mr Alfonso, who was taken off guard, and went to Mr Alfonso's computer to try and steal from him as he lay dying. In court, Mosquera argued, through a Spanish interpreter, that Mr Alfonso had repeatedly \"raped him\" and that Mr Longworth had been killed by Mr Alfonso. But the prosecution argued there was no evidence to support these claims, while the couple's relationship was unconventional, it was also \"loving\", and Mr Alfonso would never have killed Mr Longworth. The judge, Mr Justice Bennathan KC, said he would sentence Mosquera on 24 October. He said: \"I am not going to pass sentence on you today, although the only one I can pass on you is one of life imprisonment. \"I am going to order a psychiatric report on you. It is in your interests to cooperate with the psychiatrist so that I can decide the minimum term you are going to serve.\" The judge also turned to the jury and said: \"I want a psychiatric report on this man. I want to know if there is anything in this case going on that we do not know about.\""
    },
    {
        "title": "Pressure grows to leave 'mad' Aarhus Convention used to block UK building projects",
        "description": "Pressure is growing to renegotiate or leave an international convention blamed for slowing building projects and increasing costs after a judge warned campaigners they are in danger of \"the misuse of judicial review\". ",
        "url": "https://news.sky.com/story/pressure-grows-to-leave-mad-aarhus-convention-used-to-block-uk-building-projects-13399877",
        "image_url": "https://e3.365dm.com/21/07/1920x1080/skynews-building-construction_5462675.jpg?20210730114658",
        "type": "Home",
        "Author": "Sam Coates",
        "Date Published": "2025-07-21 20:49:00",
        "Headline": "Shadow justice secretary Robert Jenrick says if the convention can't be reformed, the UK should \"absolutely should think about leaving because what we've got to do is put the interest of the British public first\".",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Pressure is growing to renegotiate or leave an international convention blamed for slowing building projects and increasing costs after a judge warned campaigners they are in danger of \"the misuse of judicial review\".  Under the Aarhus Convention, campaigners who challenge projects on environmental grounds but then lose in court against housing and big infrastructure have their costs above £10,000 capped and the rest met by the taxpayer. Government figures say this situation is \"mad\" but ministers have not acted, despite promising to do so for months. The Tories are today leading the call for change with a demand to reform or leave the convention. In March, Sky News revealed how a computer scientist from Norfolk had challenged a carbon capture and storage project attached to a gas-fired power station on multiple occasions. Andrew Boswell took his challenge all the way the appeal court, causing delays of months at a cost of over £100m to the developers. In May, the verdict handed down by the Court of Appeal was scathing about Dr Boswell's case. \n                  Politics latest: Starmer explains how he plans to make people 'better off'\n                 \n                  The wealth tax options Reeves could take to ease her fiscal bind\n                 \n                  President Bush determined to 'rid world of evil-doer Saddam Hussein', new records reveal\n                 \"Dr Boswell's approach is, we think, a classic example of the misuse of judicial review in order to continue a campaign against a development… once a party has lost the argument on the planning merits,\" wrote the judges. They added: \"Such an approach is inimical to the scheme enacted by parliament for the taking of decisions in the public interest,\" adding his case \"betrays a serious misunderstanding of the decision of the Supreme Court\" and \"the appeal must therefore be rejected\". Another case - against a housing development in a series of fields in Cranbrook, Kent - was thrown out by judges in recent weeks. The case was brought by CPRE Kent, the countryside challenge, to preserve a set of fields between two housing developments alongside an area of outstanding natural beauty. John Wotton, from CPRE Kent, suggested it would have been hard to bring the challenge without the costs being capped. \"We would've had to think very carefully about whether we could impose that financial risk on the charity,\" he told Sky News. After his case was dismissed, Berkeley Homes said the situation was \"clearly absurd and highlights how incredibly slow and uncertain our regulatory system has become\". They added: \"We welcome the government's commitment to tackle the blockages which stop businesses from investing and frustrate the delivery of much needed homes, jobs and growth. \"We need to make the current system work properly so that homes can actually get built instead of being tied-up in bureaucracy by any individual or organisation who wants to stop them against the will of the government.\" 'Reform could breach international law' Around 80 cases a year are brought under the Aarhus Convention, Sky News has learned. The way Britain interprets Aarhus is unique as a result of the UK's distinctive legal system and the loser pays principle. Barrister Nick Grant, a planning and environment expert who has represented government and campaigns, said the convention means more legally adventurous claims. \"What you might end up doing is bringing a claim on more adventurous grounds, additional grounds, running points - feeling comfortable running points - that you might not have otherwise run. \"So it's both people bringing claims, but also how they bring the claims, and what points they run. This cap facilitates it basically.\" However, Mr Grant said that it would be difficult to reform: \"Fundamentally, the convention is doing what it was designed to do, which is to facilitate access to justice. \"And it then becomes a question for the policymakers as to what effect is this having and do we want to maintain that? It will be difficult for us to reform it internally without being in breach of our international law obligations\" In March, Sky News was told Number 10 is actively looking at the convention. Multiple figures in government have said the situation with Britain's participation in the Aarhus Convention is \"mad\" but Sky News understands nothing of significance is coming on this subject. Read more from Sky News:Compensation scheme for blood scandal widenedGovernment to review state pension age The Tories, however, want action. Robert Jenrick, shadow justice secretary and former housing minister, said the Tories would reform or leave the convention. He told Sky News: \"I think the country faces a choice. Do we want to get the economy firing on all cylinders or not? \"We've got to reform the planning system and we've got to ensure that judicial review... is not used to gum up the system and this convention is clearly one of the issues that has to be addressed. \"We either reform it, if that's possible. I'm very sceptical because accords like this are very challenging and it takes many many years to reform them. \"If that isn't possible, then we absolutely should think about leaving because what we've got to do is put the interest of the British public first.\" Mr Jenrick also attacked the lawyers who work on Aarhus cases on behalf of clients. \"A cottage industry has grown. In fact, it's bigger than a cottage industry,\" he said. \"There are activist lawyers with campaign groups who are now, frankly, profiteering from this convention. And it is costing the British taxpayer a vast amount of money. These lawyers are getting richer. The country is getting poorer.\""
    },
    {
        "title": "The wealth tax options Reeves could take to ease her fiscal bind",
        "description": "Faced with a challenging set of numbers, the chancellor is having to make difficult choices with political consequences.",
        "url": "https://news.sky.com/story/the-wealth-tax-options-reeves-could-take-to-ease-her-fiscal-bind-13399694",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-reeves-money-gfx-budget_6965910.png?20250716092001",
        "type": "Home",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-07-21 13:00:00",
        "Headline": "Sky's Gurpreet Narwan says while there is support within Labour for a wealth tax, the government will be mindful to avoid a cash flight from the UK.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n  Faced with a challenging set of numbers, the chancellor is having to make difficult choices with political consequences. Tax rises and spending cuts are a hard sell. Now, some in her party are calling for a different approach: target the wealthy. Is there a way out of all of this for the chancellor? Economic growth is disappointing and spending pressures are mounting. The government was already examining ways to raise revenue when, earlier this month, Labour backbenchers forced the government to abandon welfare cuts and reinstate winter fuel payments - blowing a £6bn hole in the budget. The numbers are not adding up for Rachel Reeves, who is steadfastly committed to her fiscal rules. Short of more spending cuts, her only option is to raise taxes - taxes that are already at a generational high. For some in her party - including Lord Kinnock, the former Labour leader, the solution is simple: introduce a new tax.They say a flat wealth tax, targeting those with assets above £10m, could raise £12bn for the public purse. \n                  Most important part of chancellor's annual Mansion House speech was what wasn't said\n                 \n                  Chancellor Rachel Reeves considering 'changes' to ISAs - and says there's too much focus on 'risk' in investing\n                 \n                  Is there £15bn of wiggle room in Rachel Reeves's fiscal rules?\n                 Yet, the government is reportedly reluctant to pursue such a path. It is not convinced that wealth taxes will work. The evidence base is shaky and the debate over the efficacy of these types of taxes has divided the economics community.  Why are we talking about wealth? Wealth taxes are in the headlines but calls for this type of reform have been growing for some time. Proponents of the change point to shifts in our economy that will be obvious to most people living in Britain: work does not pay in the way it used to. At the same time wealth inequality has risen. The stock of wealth - that is the total value of everything owned - is much larger than our income, that is the total amount of money earned in a year. That disparity has been growing, especially during that era of low interest rates after 2008 that fuelled asset prices, while wages stagnated. It means the average worker will have to work for more years to buy assets, say a house, for example. Left-wing politicians and economists argue that instead of putting more pressure on workers - marginal income tax rates are as high as 70% for some workers - the government should instead target some of this accumulated wealth in order to balance the books.  The Inheritocracy At the heart of it all is a very straightforward argument about fairness. Few will argue that there aren't problems with the way our economy is functioning: that it is unfair that young people are struggling to buy homes and raise families. Proponents of a wealth tax say that it would not only raise revenue but create a fairer tax system. They argue that the wealth distortions are creating a divided society, where people's outcomes are determined by their inheritances. The gap is large. A typical 50-year old born to the poorest 20% of parents in the UK is already worth just a quarter of what someone born to the richest 20% of parents is worth at that age. This is before they inherit anything when their parents die. A lot of money is passed on earlier; for example, people may have had help buying their first home. That gap widens when the inheritance is passed on. This is when inheritance tax, one of the existing wealth taxes we have in the UK, kicks in. However, its impact in addressing that imbalance is negligible. Most people don't meet the threshold to pay it. The government could bring more people into the tax but it is already a deeply unpopular policy.  Alternatives So what other options could they explore? Lord Kinnock recently suggested a new tax on the stock of wealth - one to two percent on assets over £10m. That could raise between £12bn and £24bn. When making the case for the tax, Lord Kinnock told Sky News: \"That kind of levy does two things. One is to secure resources, which is very important in revenues. \"But the second thing it does is to say to the country, 'we are the government of equity'. This is a country which is very substantially fed up with the fact that whatever happens in the world, whatever happens in the UK, the same interests come out on top unscathed all the time while everybody else is paying more for getting services.\" However, there is a lot of scepticism about some of these numbers. Wealthier people tend to be more mobile and adept at arranging their tax affairs. Determining the value of their assets can be a challenge. In Downing Street, the fear is that they will simply leave, rendering the policy a failure. Policymakers are already fretting that a recent crackdown on non-doms will do the same. Critics point to countries where wealth taxes have been tried and repealed. Proponents say we should learn from their mistakes and design something better. Some say the government could start by improving existing taxes, such as capital gains tax - which people pay when they sell a second property or shares, for example. The Labour government has already raised capital gains tax rates but bringing them in line with income tax could raise £12bn. Then there is the potential for National Insurance contributions on investment income - such as rent from property or dividends. Estimates suggest that could bring in another £11bn. This is nothing to sniff at for a chancellor who needs to find tens of billions of pounds in order to balance her books. By the same token, she is operating on such fine margins that she can't afford to get the calculation wrong. There is no easy way out of this fiscal bind for Rachel Reeves. Whether wealth taxes are the solution or not, hers is a government that has promised reform and creative thinking. The tax system would be a good place to start."
    },
    {
        "title": "Gaza food situation 'worst it's ever been', charity says - as tank attack reportedly kills 12 at camp",
        "description": "An aid worker in Gaza has told Sky News the food situation in the enclave is \"absolutely desperate\" and \"the worst it's ever been\".",
        "url": "https://news.sky.com/story/gaza-food-situation-worst-its-ever-been-charity-says-8211-as-uk-promises-16340m-in-aid-13399832",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-gaza-food-aid_6970247.jpg?20250721190240",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-21 17:53:00",
        "Headline": "Rachael Cummings, humanitarian director for Save The Children, speaks to Sky News as Foreign Secretary David Lammy promises £40m for humanitarian assistance in Gaza.",
        "Content": " An aid worker in Gaza has told Sky News the food situation in the enclave is \"absolutely desperate\" and \"the worst it's ever been\". Her comments to chief presenter Mark Austin come amid fresh outcry over aid restrictions, with the UK joining 24 other countries to urge an immediate end to the war. It also comes as at least 12 more Palestinians were killed and dozens wounded when tanks shelled a tent encampment in western Gaza City, according to health authorities. Middle East latest: Key points from UK statement on Gaza Medics, speaking early on Tuesday, said two shells were fired at tents housing displaced people from tanks positioned north of the Shati camp. Israel hasn't yet commented on the reports. Rachael Cummings, humanitarian director for Save The Children, spoke to Sky News from Deir al Balah, a city where tens of thousands of people have sought refuge during repeated waves of mass displacement. \n                  Watch Deir al Balah skyline live from Gaza amid reports of Israeli offensive\n                 \n                  Israel launches ground assault on central Gazan city, says charity\n                 \n                  Trump, Epstein and a 'bawdy' birthday card\n                 She said: \"One of my colleagues said to me yesterday, 'We are all walking together towards death'. And this is the situation now for people in Gaza. \"There is no food for their children, it's absolutely desperate here.\" \"The markets are empty,\" she said. \"People may even have cash in their pockets yet they cannot buy bread [or] vegetables. \"My team have said to me, 'There's nothing in my house to feed my children, my children are crying all day, every day.\" Israel launched a ground assault on southern and eastern Deir al Balah for the first time on Monday after having issued an evacuation order. Local medics said at least three people were killed when houses and mosques were hit by tank shelling. Sources told Reuters news agency that Israel believes some of the hostages kidnapped by Hamas in October 2023 could be in the area. Ms Cummings's remarks came as the UK and 24 other nations issued a joint statement calling for a ceasefire. The statement criticised aid distribution in Gaza, which is being managed by a US and Israel-backed organisation, Gaza Health Foundation (GHF). Hundreds of people have reportedly been killed while trying to get food in recent weeks, both from GHF and UN convoys. \"The Israeli government's aid delivery model is dangerous, fuels instability and deprives Gazans of human dignity,\" the joint statement said. The 25 countries also called for the \"immediate and unconditional release\" of hostages captured by Hamas during the 7 October 2023 attacks. Lammy promises £40m for Gaza Foreign Secretary David Lammy has promised £40m for humanitarian assistance in Gaza. He told MPs: \"We are leading diplomatic efforts to show that there must be a viable pathway to a Palestinian state involving the Palestinian Authority, not Hamas, in the security and governance of the area. \"Hamas can have no role in the governance of Gaza, nor use it as a launchpad for terrorism.\"  Addressing the foreign secretaries' joint written statement, charity worker Liz Allcock - who works for Medical Aid for Palestinians (MAP) in Gaza - told Sky News: \"While we welcome this, there have been statements in the past 21 months and nothing has changed. \"In fact, things have only got worse. And every time we think it can't get worse, it does.\" \"Without a reversal of the siege, the lack of supplies, the constant bombardment, the forced displacement, the killing, the militarisation of aid, we are going to collapse as a humanitarian response,\" she said. \"And this would do a grave injustice to the 2.2 million people we're trying to serve. \"An immediate and permanent ceasefire, and avenues for accountability in line with international law, is the minimum people here deserve.\" The war in Gaza started in response to Hamas's attack on Israel on 7 October 2023, which killed 1,200 people and saw about 250 taken hostage. More than 59,000 Palestinians have since been killed, with more than half being women and children, according to Gaza's health ministry, which does not distinguish between civilians and combatants in its count. In recent weeks hundreds of Palestinians have reportedly been killed while waiting for food and aid. The Israeli military has blamed Hamas militants for fomenting chaos and endangering civilians."
    },
    {
        "title": "People smugglers to have assets frozen and be banned from UK",
        "description": "People smugglers face having their assets frozen and being banned from entering the UK, the foreign secretary has announced.",
        "url": "https://news.sky.com/story/people-smugglers-to-have-assets-frozen-and-be-banned-from-uk-13399703",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-france-gravelines-coast-guard_6966790.jpg?20250717093045",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-21 13:30:00",
        "Headline": "New powers under the Sanctions Act will see gang leaders, small boat suppliers, fake passport makers and anyone else enabling small boat crossings targeted.",
        "Content": "People smugglers face having their assets frozen and being banned from entering the UK, the foreign secretary has announced. David Lammy said new powers under the Sanctions Act will allow the UK to freeze the assets of anyone complicit in smuggling illegal migrants into the country. They can also be banned from travelling to the UK. The first wave of sanctions on smuggling gangs and their enablers will be imposed on Wednesday.  Mr Lammy said it is the \"world's first sanctions regime\" targeted at smuggling gangs. Gang leaders, small boat suppliers, people making and selling fake passports and middlemen facilitating payments by migrants through hawala networks (informal systems for transferring money) will all be targeted this week. \n                  UK restores diplomatic ties with Syria\n                 \n                  UK could send further capabilities to Middle East, minister says\n                 \n                  Foreign Secretary David Lammy in Gibraltar as negotiations over post-Brexit deal with Spain heat up\n                 They will be publicly named on a sanctions list, making it illegal for the UK financial system to engage with them. By using the Sanctions Act, the government said it can target the smuggling gangs wherever they are in the world, including where law enforcement and criminal justice approaches cannot reach.  Labour's manifesto promised to \"smash the gangs\", but the first half of 2025 has seen a record number of small boat crossings, with about 20,000 from January to June - the highest ever in that period, and 48% more than the first half of 2024. Earlier this month, the UK and France announced a pilot scheme under which migrants arriving in the UK illegally from France will be returned and a legitimate asylum seeker will be able to come to the UK. They did not say how many would be returned each week, but the suggestion was 50. On the latest sanctions, Foreign Secretary David Lammy said: \"For too long, criminal gangs have been lining their corrupt pockets and preying on the hopes of vulnerable people with impunity as they drive irregular migration to the UK. We will not accept this status quo. \"It is our moral duty and a key part of our Plan for Change to do all we can to smash these gangs and secure Britain's borders. \"That's why the UK has created the world's first sanctions regime targeted at gangs involved in people smuggling and driving irregular migration, as well as their enablers. \"From tomorrow, those involved will face having their assets frozen, being shut off from the UK financial system and banned from travelling to the UK.\" Home Secretary Yvette Cooper said the sanctions send a \"clear message that there is no hiding place for those who exploit vulnerable people and put lives at risk for profit\"."
    },
    {
        "title": "Watchdog must fine social media companies that are slow to remove racism after Jess Carter abuse, says culture secretary",
        "description": "The online safety regulator should use powers to fine social media companies that are not quickly removing racism, Culture Secretary Lisa Nandy told Sky News, after concerns were raised by England defender Jess Carter.",
        "url": "https://news.sky.com/story/watchdog-must-fine-social-media-companies-that-are-slow-to-remove-racism-after-jess-carter-abuse-says-culture-secretary-13399901",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jess-carter-england-women_6970393.jpg?20250721233131",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-07-21 22:06:00",
        "Headline": "Ofcom should be using new powers under the Online Safety Act to get tough with services such as Instagram and X if they are too slow to act, says Lisa Nandy.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  The online safety regulator should use powers to fine social media companies that are not quickly removing racism, Culture Secretary Lisa Nandy told Sky News, after concerns were raised by England defender Jess Carter. Carter has declared herself ready to play in the Women's European Championship semi-final against Italy on Tuesday after speaking out on the hate she has faced online during the tournament. Players have expressed frustration they are having to use their platform to pressure the tech firms, given how often footballers have had to deal with racist abuse. There is now the Online Safety Act which should be compelling the companies to take action. \"We've introduced new laws so that platforms are under a legal obligation to take down that sort of disgusting content immediately,\" Ms Nandy told Sky News. \"And they can be pursued through fines, through Ofcom, if they don't do it. \"It's now up to those platforms and up to Ofcom to fulfil those roles that we've given them and make sure that this is stamped out online, that it's dealt with very quickly.\" But Kick It Out chairman Sanjay Bhandari told Sky News on Sunday that \"it's got worse on social media, not better\" - singling out Elon Musk's X and Mark Zuckerberg's Instagram. Neither of the companies has responded to requests for comment, including via a public X post. England defender Lucy Bronze said \"online abuse is getting worse and worse\" in women's football. Ms Nandy said: \"The racial abuse that's been directed at Jess Carter is utterly disgusting and unfortunately is too common for women at the top of their game, not just in football but across sport as a whole. \"We're considering as a government what more we can do to protect women players who reach those levels of exposure.\" Read more from Sky News:Lionesses 'very optimistic' Williamson will be fit for semi The government has made dealing with sports issues a priority, with legislation passed today to introduce an independent regulator for men's football. The watchdog aims to ensure clubs are run sustainably and are accountable to their fans. Ms Nandy said: \"There are now protections in law for fans and for clubs to make sure that we have really fit and proper owners; that there is somebody who can tackle rogue owners when problems arise, that we get a proper financial flow to ensure the sustainability of clubs throughout the football pyramid and to make that fans are put back at the heart of the game where they belong.\" The Premier League remains concerned the regulator could harm the success of its competition through unintended consequences."
    },
    {
        "title": "Malcolm-Jamal Warner, who played The Cosby Show's Theo, drowns in Costa Rica",
        "description": "Malcolm-Jamal Warner, who played The Cosby Show character Theo, has drowned in Costa Rica, according to authorities.",
        "url": "https://news.sky.com/story/malcolm-jamal-warner-who-played-the-cosby-shows-theo-drowns-in-costa-rica-13399852",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-malcolm-jamal-warner_6970280.jpg?20250721193922",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-21 18:31:00",
        "Headline": "It is understood the 54-year-old was swimming at Playa Grande de Cocles in Limon province when he was pulled underwater by a current.",
        "Content": "Malcolm-Jamal Warner, who played The Cosby Show character Theo, has drowned in Costa Rica, according to authorities. The country's Judicial Investigation Department said the 54-year-old actor drowned on Sunday afternoon off a beach on the Caribbean coast. It is understood he was swimming at Playa Grande de Cocles in Limon province when he was pulled underwater by a current. \"He was rescued by people on the beach,\" according to the department's early report, but emergency workers from Costa Rica's Red Cross found him without any signs of life and he was taken to the morgue.  Warner was on holiday with his family at the time, according to US celebrity news site People. The Cosby Show aired from 1984 to 1992 on NBC in the US and is regarded as a groundbreaking show for its portrayal of a successful black middle-class family. It was also shown on Channel 4 in the UK at around the same time. Its star, Bill Cosby, played a doctor named Cliff Huxtable, with Warner in the role of Theo, his only son. The NBC sitcom was the most popular show in America for much of its run between 1984 and 1992. Warner played the role for eight seasons in all 197 episodes, winning an Emmy nomination for supporting actor in a comedy in 1986. For many, the lasting image of the character, and of Warner, is of him wearing a badly-botched mock designer shirt sewn by his sister Denise, played by Lisa Bonet. Warner 'proud' of show despite Cosby claims The legacy of The Cosby Show has been tarnished after Cosby was jailed in 2018 following a conviction for sexual assault. He was released in 2021 after his conviction was overturned. Dozens of women had accused Cosby of sexual assault or rape before the trial. Following his release from prison, Cosby was found liable for sexually assaulting a woman at the Playboy Mansion in 1975 when she was a teenager. Warner told the Associated Press in 2015: \"My biggest concern is when it comes to images of people of colour on television and film... We've always had 'The Cosby Show' to hold up against that. And the fact that we no longer have that, that's the thing that saddens me the most because in a few generations the Huxtables will have been just a fairy tale.\" In 2023, Warner told People in an interview: \"I know I can speak for all the cast when I say The Cosby Show is something that we are all still very proud of.\" Read more entertainment news:Danny Dyer on Mr Big StuffScuffle breaks out on Royal Opera House on stage Warner wins a Grammy  Following his career on The Cosby Show, Warner later appeared on the sitcom Malcolm & Eddie, co-starring with comedian Eddie Griffin in the series on the UPN network from 1996 to 2000. In the 2010s he starred opposite Tracee Ellis Ross as a family-blending couple for two seasons on the BET sitcom Read Between The Lines. He also had a role as OJ Simpson's friend Al Cowlings in American Crime Story and was a series regular on Fox's The Resident. Films he has appeared in include the 2008 rom-com Fool's Gold with Matthew McConaughey and Kate Hudson. A poet and a musician, Warner won a Grammy for best traditional R&B performance for the song Jesus Children with Robert Glasper and Lalah Hathaway. He was also nominated for best spoken word poetry album for Hiding In Plain View.Warner was married with a daughter, but chose to not publicly disclose their names."
    },
    {
        "title": "Buckingham Palace courtiers lobbied John Major government for a new royal yacht, files reveal",
        "description": "Buckingham Palace courtiers lobbied the government as ministers agonised over whether to replace the Royal Yacht Britannia, newly released official files reveal.",
        "url": "https://news.sky.com/story/buckingham-palace-courtiers-lobbied-john-major-government-for-a-new-royal-yacht-files-reveal-13399736",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-britannia-yacht_6970063.jpg?20250721155320",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-21 14:33:00",
        "Headline": "Senior staff privately approached No 10 back in 1993 to see if then PM John Major would stress Britannia's \"inestimable value\", official files show. ",
        "Content": "Buckingham Palace courtiers lobbied the government as ministers agonised over whether to replace the Royal Yacht Britannia, newly released official files reveal. By 1993, it was apparent Britannia was reaching the end of its life but John Major's government was yet to decide whether to commission a new vessel - at an estimated cost of £50m. It was widely thought Queen Elizabeth II strongly favoured the idea of a new yacht, but the royals could not be seen trying to influence politics. However files released by the National Archives at Kew, west London, show senior palace staff privately approached No 10 to see if the Conservative PM would stress Britannia's \"inestimable value\" in a Commons statement. The plan was scotched by the Cabinet Office, which said any such comment would be highly \"prejudicial\". The issue of the new yacht came as support for the Royal Family was at a low ebb. There had been an angry backlash the previous year when ministers said taxpayers would foot the bill - which ran to £36m - for Windsor Castle to be restored after a fire. In the aftermath of her \"annus horribilis\" - which included the separation of Prince Charles and Diana - Elizabeth II agreed she would pay taxes for the first time. With the prime minister due to announce the move to parliament, Queen Elizabeth II's private secretary Sir Robert Fellowes saw an opportunity. He asked Mr Major's principal private secretary Alex Allan if the PM would insert a passage on the importance of Britannia, as well as the royals' dedicated aircraft and train. He suggested the prime minister should say it was not just a question of cost \"but also the style in which we wish our head of state and members of the Royal Family to represent us\" in their public duties. \"I would also like to make clear that there is not, and never has been, any pressure from the Queen to build a replacement for HMY Britannia,\" he added. Read more:The signs that Prince Harry is trying to push resetIn pictures: Star-studded banquet for Macron However, Nicolas Bevan, leading the working group set up to consider the future of Britannia, warned the proposed remark could be \"prejudicial\" to any future decisions. \"Equally it hardly rings true to suggest that it is a matter of complete indifference to the Queen as to whether Britannia is replaced or not,\" he said. Despite misgivings over the cost, the government announced in January 1997 that a replacement yacht would be built if they retained power in the following year's general election. When Labour swept to power with a landslide win, they promptly reversed the decision. When Britannia was finally decommissioned, Queen Elizabeth II, who rarely displayed any emotion in public, was seen shedding a tear."
    },
    {
        "title": "Double decker bus crashes into bridge in Manchester",
        "description": "A double decker bus has crashed into a bridge in Manchester, police have said.",
        "url": "https://news.sky.com/story/double-decker-bus-crashes-into-bridge-in-manchester-13399840",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-manchester-bus-crash_6970291.png?20250721201100",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-21 18:10:00",
        "Headline": "Fifteen people were taken to hospital, according to North West Ambulance Service. Local media reported that one person was critically injured and two others were seriously hurt.",
        "Content": "A double decker bus has crashed into a bridge in Manchester, police have said. North West Ambulance Service (NWAS) had declared a \"major incident\" with 15 people taken to hospital following the incident on Barton Lane in Eccles. It has since \"stood down\" from major incident status. Local media reported that one person was critically injured and two others were seriously hurt. Pictures on social media showed the yellow bus with its roof torn off and emergency service workers aboard the upper deck. On X, Greater Manchester Police wrote: \"We are currently responding to a collision between a bus and a bridge at the junction of Barton Road and Trafford Road in Eccles. \"Emergency services are currently on scene as part of the ongoing work. \n                  Colombian man found guilty of double murder after leaving couple's bodies in suitcases on Bristol bridge\n                 \n                  Pressure grows to leave 'mad' Aarhus Convention used to block UK building projects\n                 \n                  The wealth tax options Reeves could take to ease her fiscal bind\n                 \"Please avoid the area as road closures are currently in place.\" In a statement, NWAS said: \"The trust dispatched a number of resources, including 10 emergency ambulances, advanced paramedics, our Hazard Area Response Team (HART) and colleagues from North West Air Ambulance. The first resource arrived on time at 15.10. \"NWAS treated 15 patients who were all taken to Salford Royal or Manchester Royal Infirmary hospitals.\" An unnamed eyewitness said they arrived at the scene about two minutes after the crash. They told the Manchester Evening News: \"I could just hear screaming coming from the top of the bus.\" Transport for Greater Manchester said the bus was a 100 service and was in operation at the time of the incident. Vernon Everitt, transport commissioner for Greater Manchester, said: \"An immediate and urgent investigation into the circumstances is under way and we are working closely with the investigation team at Greater Manchester Police and the bus operator, Stagecoach. \"This is clearly a distressing situation for everyone involved and we'd like to thank emergency services for their swift response.\" The service departs from Shudehill and travels to Salford, Trafford Centre, and Warrington. The location where the incident took place does not appear to be on the Bee Network Route map for the 100 service."
    },
    {
        "title": "Colombian man found guilty of double murder after leaving couple's bodies in suitcases on Bristol bridge",
        "description": "A Colombian man has been found guilty of two murders after taking his victims' bodies in suitcases to Bristol's Clifton Suspension Bridge last year.",
        "url": "https://news.sky.com/story/colombian-man-found-guilty-of-murder-after-leaving-couples-bodies-in-suitcases-on-bristol-bridge-13399496",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-yostin-andres-mosquera_6970055.jpg?20250721155139",
        "type": "UK",
        "Author": "Alice Porter",
        "Date Published": "2025-07-21 06:19:00",
        "Headline": "The gruesome footage of Albert Alfonso's murder, caught on cameras he had placed around the room, was repeatedly played to the jury.",
        "Content": "\n          News correspondent\n              @AlicePorterTV\n  A Colombian man has been found guilty of two murders after taking his victims' bodies in suitcases to Bristol's Clifton Suspension Bridge last year. Yostin Andres Mosquera was convicted on Monday of the murders of Paul Longworth and Albert Alfonso, who were killed in west London on 8 July 2024. Warning: This article contains graphic descriptions of murders. Mosquera's victims were 62-year-old Mr Alfonso and his civil partner, 71-year-old Mr Longworth. It is believed that Mosquera, a 35-year-old who worked in the adult film industry, first met Mr Alfonso online. Mosquera had been sharing paid sexual content of himself online for more than a decade, a jury heard.  The three men struck up a friendship, the couple visited Mosquera in Colombia, and they repeatedly flew Mosquera to the UK to stay with them at their flat in London. While the men would take day trips to tourist attractions, like Madame Tussauds, Mr Alfonso and Mosquera would engage in extreme sex together. But in the weeks leading up to their murders, Mosquera was clearly planning his attacks. He looked online for a freezer and, on the day of the killings, searched for: \"Where on the head is a knock fatal?\" The prosecution argued he was financially motivated. Mosquera repeatedly tried to find the price of the couple's property in Scotts Road, Shepherd's Bush, and stole money from Mr Alfonso after murdering him. Body hidden in divan bed On 8 July 2024, Mosquera killed Mr Longworth by hitting him with a hammer, shattering his skull, before hiding his body in a divan bed. That evening, during sex with Mr Alfonso, Mosquera stabbed him with a knife. A post-mortem examination revealed 22 stab wounds. All of this was recorded on cameras, which had been placed in the room by Mr Alfonso. Mosquera then decapitated the bodies - the heads were stored in a freezer which he had delivered on 9 July. The other remains were put in suitcases and on 10 July, Mosquera hired a van with a driver to transport him and the bags to Clifton Suspension Bridge, where it was claimed he planned to hurl the remains off the structure. 'Pubgoers offered to drive killer over the bridge' Detective Chief Inspector Ollie Stride, from the Metropolitan Police, said members of the public in a nearby pub came outside and tried to help Mosquera, by offering to drive him over the bridge as they saw he was struggling with the suitcases. \"But they simply couldn't lift them into the cars so... they helped him order the taxi, that took him over using Google Translate because they couldn't communicate him, [as] he spoke in Spanish.\" The prosecution argued Mosquera went to Bristol with the intention of throwing the bags off the bridge. But Mosquera caught the attention of passers-by, telling them the cases contained car parts. However, people noticed liquid leaking from the bags - which was blood. Mosquera ran off and was later arrested at Bristol Temple Meads station on 13 July 2024 and charged with both murders. When the case came to trial, initially at the Old Bailey and then at Woolwich Crown Court, the gruesome footage of Mr Alfonso's murder was repeatedly played to the jury. The trial was moved after the first jury was discharged due to problems identifying the accurate times of searches made by Mosquera on his laptop, which had been used as evidence. News correspondent It is not often a murder is caught on camera. It is even rarer when they are filmed from multiple angles, with sound. I was at the Old Bailey for the first trial, where the recording of Mosquera killing Albert Alfonso was repeatedly played to the jury. \n The two men are naked, taking part in consensual sex, which was filmed by Mr Alfonso on several cameras, a normal practice for the pair. Unwittingly, Mr Alfonso recorded his own murder. We see Mosquera hide the knife.  Then, when Mr Alfonso is at his most vulnerable, Mosquera calmly stabs him in the neck.  Mr Alfonso struggles against Mosquera, screaming, but is overpowered. Mosquera cruelly taunts him, asking, \"Do you like it?\" As Alfonso lay dying, Mosquera bizarrely sings and dances before going to Alfonso’s computer. The judge warned the jury about the graphic video, reassuring them that, if they felt unable to proceed due to its content, they would be excused. One jury member did not come back the next day and I could completely understand their discomfort. The sound of screaming was hard to forget. A murder is always upsetting to watch, but this felt intrusive. While many aspects of their sexual relationship could be disturbing to an outsider, Albert Alfonso could never have predicted that his private recordings would be so publicly analysed at a trial into his own murder. Miranda Jollie, senior crown prosecutor at the CPS, said she found the video \"horrific\", but maintained that it was necessary to show the video because of Mosquera's claims. 'Shocking' murder DCI Stride said it was \"one of the most disturbing\" murder cases he has investigated. He added: \"The video that we found of the murder is really shocking. Within seconds of the murder... he [Mosquera] appears to dance, sings a short song, and immediately after that, whilst Mr Alfonso is still lying on the floor, he's straight on the computer and starts searching for... and logging into bank accounts.\" Mosquera denied the murders, but admitted killing Mr Alfonso - his defence team argued it was manslaughter by loss of control. Read more from Sky News:Inquiry to 'uncover truth' behind bloody clashes at miners' strikeEpping protests are just the latest flashpoint of frustrationPaul Gascoigne taken to hospital after collapse - reports However, the video evidence contradicts this claim. It shows Mosquera had hidden the knife before sex, showing the attack was premeditated. He was also calm as he attacked Mr Alfonso, who was taken off guard, and went to Mr Alfonso's computer to try and steal from him as he lay dying. In court, Mosquera argued, through a Spanish interpreter, that Mr Alfonso had repeatedly \"raped him\" and that Mr Longworth had been killed by Mr Alfonso. But the prosecution argued there was no evidence to support these claims, while the couple's relationship was unconventional, it was also \"loving\", and Mr Alfonso would never have killed Mr Longworth. The judge, Mr Justice Bennathan KC, said he would sentence Mosquera on 24 October. He said: \"I am not going to pass sentence on you today, although the only one I can pass on you is one of life imprisonment. \"I am going to order a psychiatric report on you. It is in your interests to cooperate with the psychiatrist so that I can decide the minimum term you are going to serve.\" The judge also turned to the jury and said: \"I want a psychiatric report on this man. I want to know if there is anything in this case going on that we do not know about.\""
    },
    {
        "title": "Pressure grows to leave 'mad' Aarhus Convention used to block UK building projects",
        "description": "Pressure is growing to renegotiate or leave an international convention blamed for slowing building projects and increasing costs after a judge warned campaigners they are in danger of \"the misuse of judicial review\". ",
        "url": "https://news.sky.com/story/pressure-grows-to-leave-mad-aarhus-convention-used-to-block-uk-building-projects-13399877",
        "image_url": "https://e3.365dm.com/21/07/1920x1080/skynews-building-construction_5462675.jpg?20210730114658",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-07-21 20:49:00",
        "Headline": "Shadow justice secretary Robert Jenrick says if the convention can't be reformed, the UK should \"absolutely should think about leaving because what we've got to do is put the interest of the British public first\".",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Pressure is growing to renegotiate or leave an international convention blamed for slowing building projects and increasing costs after a judge warned campaigners they are in danger of \"the misuse of judicial review\".  Under the Aarhus Convention, campaigners who challenge projects on environmental grounds but then lose in court against housing and big infrastructure have their costs above £10,000 capped and the rest met by the taxpayer. Government figures say this situation is \"mad\" but ministers have not acted, despite promising to do so for months. The Tories are today leading the call for change with a demand to reform or leave the convention. In March, Sky News revealed how a computer scientist from Norfolk had challenged a carbon capture and storage project attached to a gas-fired power station on multiple occasions. Andrew Boswell took his challenge all the way the appeal court, causing delays of months at a cost of over £100m to the developers. In May, the verdict handed down by the Court of Appeal was scathing about Dr Boswell's case. \n                  Politics latest: Starmer explains how he plans to make people 'better off'\n                 \n                  The wealth tax options Reeves could take to ease her fiscal bind\n                 \n                  President Bush determined to 'rid world of evil-doer Saddam Hussein', new records reveal\n                 \"Dr Boswell's approach is, we think, a classic example of the misuse of judicial review in order to continue a campaign against a development… once a party has lost the argument on the planning merits,\" wrote the judges. They added: \"Such an approach is inimical to the scheme enacted by parliament for the taking of decisions in the public interest,\" adding his case \"betrays a serious misunderstanding of the decision of the Supreme Court\" and \"the appeal must therefore be rejected\". Another case - against a housing development in a series of fields in Cranbrook, Kent - was thrown out by judges in recent weeks. The case was brought by CPRE Kent, the countryside challenge, to preserve a set of fields between two housing developments alongside an area of outstanding natural beauty. John Wotton, from CPRE Kent, suggested it would have been hard to bring the challenge without the costs being capped. \"We would've had to think very carefully about whether we could impose that financial risk on the charity,\" he told Sky News. After his case was dismissed, Berkeley Homes said the situation was \"clearly absurd and highlights how incredibly slow and uncertain our regulatory system has become\". They added: \"We welcome the government's commitment to tackle the blockages which stop businesses from investing and frustrate the delivery of much needed homes, jobs and growth. \"We need to make the current system work properly so that homes can actually get built instead of being tied-up in bureaucracy by any individual or organisation who wants to stop them against the will of the government.\" 'Reform could breach international law' Around 80 cases a year are brought under the Aarhus Convention, Sky News has learned. The way Britain interprets Aarhus is unique as a result of the UK's distinctive legal system and the loser pays principle. Barrister Nick Grant, a planning and environment expert who has represented government and campaigns, said the convention means more legally adventurous claims. \"What you might end up doing is bringing a claim on more adventurous grounds, additional grounds, running points - feeling comfortable running points - that you might not have otherwise run. \"So it's both people bringing claims, but also how they bring the claims, and what points they run. This cap facilitates it basically.\" However, Mr Grant said that it would be difficult to reform: \"Fundamentally, the convention is doing what it was designed to do, which is to facilitate access to justice. \"And it then becomes a question for the policymakers as to what effect is this having and do we want to maintain that? It will be difficult for us to reform it internally without being in breach of our international law obligations\" In March, Sky News was told Number 10 is actively looking at the convention. Multiple figures in government have said the situation with Britain's participation in the Aarhus Convention is \"mad\" but Sky News understands nothing of significance is coming on this subject. Read more from Sky News:Compensation scheme for blood scandal widenedGovernment to review state pension age The Tories, however, want action. Robert Jenrick, shadow justice secretary and former housing minister, said the Tories would reform or leave the convention. He told Sky News: \"I think the country faces a choice. Do we want to get the economy firing on all cylinders or not? \"We've got to reform the planning system and we've got to ensure that judicial review... is not used to gum up the system and this convention is clearly one of the issues that has to be addressed. \"We either reform it, if that's possible. I'm very sceptical because accords like this are very challenging and it takes many many years to reform them. \"If that isn't possible, then we absolutely should think about leaving because what we've got to do is put the interest of the British public first.\" Mr Jenrick also attacked the lawyers who work on Aarhus cases on behalf of clients. \"A cottage industry has grown. In fact, it's bigger than a cottage industry,\" he said. \"There are activist lawyers with campaign groups who are now, frankly, profiteering from this convention. And it is costing the British taxpayer a vast amount of money. These lawyers are getting richer. The country is getting poorer.\""
    },
    {
        "title": "The wealth tax options Reeves could take to ease her fiscal bind",
        "description": "Faced with a challenging set of numbers, the chancellor is having to make difficult choices with political consequences.",
        "url": "https://news.sky.com/story/the-wealth-tax-options-reeves-could-take-to-ease-her-fiscal-bind-13399694",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-reeves-money-gfx-budget_6965910.png?20250716092001",
        "type": "UK",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-07-21 13:00:00",
        "Headline": "Sky's Gurpreet Narwan says while there is support within Labour for a wealth tax, the government will be mindful to avoid a cash flight from the UK.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n  Faced with a challenging set of numbers, the chancellor is having to make difficult choices with political consequences. Tax rises and spending cuts are a hard sell. Now, some in her party are calling for a different approach: target the wealthy. Is there a way out of all of this for the chancellor? Economic growth is disappointing and spending pressures are mounting. The government was already examining ways to raise revenue when, earlier this month, Labour backbenchers forced the government to abandon welfare cuts and reinstate winter fuel payments - blowing a £6bn hole in the budget. The numbers are not adding up for Rachel Reeves, who is steadfastly committed to her fiscal rules. Short of more spending cuts, her only option is to raise taxes - taxes that are already at a generational high. For some in her party - including Lord Kinnock, the former Labour leader, the solution is simple: introduce a new tax.They say a flat wealth tax, targeting those with assets above £10m, could raise £12bn for the public purse. \n                  Most important part of chancellor's annual Mansion House speech was what wasn't said\n                 \n                  Chancellor Rachel Reeves considering 'changes' to ISAs - and says there's too much focus on 'risk' in investing\n                 \n                  Is there £15bn of wiggle room in Rachel Reeves's fiscal rules?\n                 Yet, the government is reportedly reluctant to pursue such a path. It is not convinced that wealth taxes will work. The evidence base is shaky and the debate over the efficacy of these types of taxes has divided the economics community.  Why are we talking about wealth? Wealth taxes are in the headlines but calls for this type of reform have been growing for some time. Proponents of the change point to shifts in our economy that will be obvious to most people living in Britain: work does not pay in the way it used to. At the same time wealth inequality has risen. The stock of wealth - that is the total value of everything owned - is much larger than our income, that is the total amount of money earned in a year. That disparity has been growing, especially during that era of low interest rates after 2008 that fuelled asset prices, while wages stagnated. It means the average worker will have to work for more years to buy assets, say a house, for example. Left-wing politicians and economists argue that instead of putting more pressure on workers - marginal income tax rates are as high as 70% for some workers - the government should instead target some of this accumulated wealth in order to balance the books.  The Inheritocracy At the heart of it all is a very straightforward argument about fairness. Few will argue that there aren't problems with the way our economy is functioning: that it is unfair that young people are struggling to buy homes and raise families. Proponents of a wealth tax say that it would not only raise revenue but create a fairer tax system. They argue that the wealth distortions are creating a divided society, where people's outcomes are determined by their inheritances. The gap is large. A typical 50-year old born to the poorest 20% of parents in the UK is already worth just a quarter of what someone born to the richest 20% of parents is worth at that age. This is before they inherit anything when their parents die. A lot of money is passed on earlier; for example, people may have had help buying their first home. That gap widens when the inheritance is passed on. This is when inheritance tax, one of the existing wealth taxes we have in the UK, kicks in. However, its impact in addressing that imbalance is negligible. Most people don't meet the threshold to pay it. The government could bring more people into the tax but it is already a deeply unpopular policy.  Alternatives So what other options could they explore? Lord Kinnock recently suggested a new tax on the stock of wealth - one to two percent on assets over £10m. That could raise between £12bn and £24bn. When making the case for the tax, Lord Kinnock told Sky News: \"That kind of levy does two things. One is to secure resources, which is very important in revenues. \"But the second thing it does is to say to the country, 'we are the government of equity'. This is a country which is very substantially fed up with the fact that whatever happens in the world, whatever happens in the UK, the same interests come out on top unscathed all the time while everybody else is paying more for getting services.\" However, there is a lot of scepticism about some of these numbers. Wealthier people tend to be more mobile and adept at arranging their tax affairs. Determining the value of their assets can be a challenge. In Downing Street, the fear is that they will simply leave, rendering the policy a failure. Policymakers are already fretting that a recent crackdown on non-doms will do the same. Critics point to countries where wealth taxes have been tried and repealed. Proponents say we should learn from their mistakes and design something better. Some say the government could start by improving existing taxes, such as capital gains tax - which people pay when they sell a second property or shares, for example. The Labour government has already raised capital gains tax rates but bringing them in line with income tax could raise £12bn. Then there is the potential for National Insurance contributions on investment income - such as rent from property or dividends. Estimates suggest that could bring in another £11bn. This is nothing to sniff at for a chancellor who needs to find tens of billions of pounds in order to balance her books. By the same token, she is operating on such fine margins that she can't afford to get the calculation wrong. There is no easy way out of this fiscal bind for Rachel Reeves. Whether wealth taxes are the solution or not, hers is a government that has promised reform and creative thinking. The tax system would be a good place to start."
    },
    {
        "title": "Watchdog must fine social media companies that are slow to remove racism after Jess Carter abuse, says culture secretary",
        "description": "The online safety regulator should use powers to fine social media companies that are not quickly removing racism, Culture Secretary Lisa Nandy told Sky News, after concerns were raised by England defender Jess Carter.",
        "url": "https://news.sky.com/story/watchdog-must-fine-social-media-companies-that-are-slow-to-remove-racism-after-jess-carter-abuse-says-culture-secretary-13399901",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jess-carter-england-women_6970393.jpg?20250721233131",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-07-21 22:06:00",
        "Headline": "Ofcom should be using new powers under the Online Safety Act to get tough with services such as Instagram and X if they are too slow to act, says Lisa Nandy.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  The online safety regulator should use powers to fine social media companies that are not quickly removing racism, Culture Secretary Lisa Nandy told Sky News, after concerns were raised by England defender Jess Carter. Carter has declared herself ready to play in the Women's European Championship semi-final against Italy on Tuesday after speaking out on the hate she has faced online during the tournament. Players have expressed frustration they are having to use their platform to pressure the tech firms, given how often footballers have had to deal with racist abuse. There is now the Online Safety Act which should be compelling the companies to take action. \"We've introduced new laws so that platforms are under a legal obligation to take down that sort of disgusting content immediately,\" Ms Nandy told Sky News. \"And they can be pursued through fines, through Ofcom, if they don't do it. \"It's now up to those platforms and up to Ofcom to fulfil those roles that we've given them and make sure that this is stamped out online, that it's dealt with very quickly.\" But Kick It Out chairman Sanjay Bhandari told Sky News on Sunday that \"it's got worse on social media, not better\" - singling out Elon Musk's X and Mark Zuckerberg's Instagram. Neither of the companies has responded to requests for comment, including via a public X post. England defender Lucy Bronze said \"online abuse is getting worse and worse\" in women's football. Ms Nandy said: \"The racial abuse that's been directed at Jess Carter is utterly disgusting and unfortunately is too common for women at the top of their game, not just in football but across sport as a whole. \"We're considering as a government what more we can do to protect women players who reach those levels of exposure.\" Read more from Sky News:Lionesses 'very optimistic' Williamson will be fit for semi The government has made dealing with sports issues a priority, with legislation passed today to introduce an independent regulator for men's football. The watchdog aims to ensure clubs are run sustainably and are accountable to their fans. Ms Nandy said: \"There are now protections in law for fans and for clubs to make sure that we have really fit and proper owners; that there is somebody who can tackle rogue owners when problems arise, that we get a proper financial flow to ensure the sustainability of clubs throughout the football pyramid and to make that fans are put back at the heart of the game where they belong.\" The Premier League remains concerned the regulator could harm the success of its competition through unintended consequences."
    },
    {
        "title": "Buckingham Palace courtiers lobbied John Major government for a new royal yacht, files reveal",
        "description": "Buckingham Palace courtiers lobbied the government as ministers agonised over whether to replace the Royal Yacht Britannia, newly released official files reveal.",
        "url": "https://news.sky.com/story/buckingham-palace-courtiers-lobbied-john-major-government-for-a-new-royal-yacht-files-reveal-13399736",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-britannia-yacht_6970063.jpg?20250721155320",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-21 14:33:00",
        "Headline": "Senior staff privately approached No 10 back in 1993 to see if then PM John Major would stress Britannia's \"inestimable value\", official files show. ",
        "Content": "Buckingham Palace courtiers lobbied the government as ministers agonised over whether to replace the Royal Yacht Britannia, newly released official files reveal. By 1993, it was apparent Britannia was reaching the end of its life but John Major's government was yet to decide whether to commission a new vessel - at an estimated cost of £50m. It was widely thought Queen Elizabeth II strongly favoured the idea of a new yacht, but the royals could not be seen trying to influence politics. However files released by the National Archives at Kew, west London, show senior palace staff privately approached No 10 to see if the Conservative PM would stress Britannia's \"inestimable value\" in a Commons statement. The plan was scotched by the Cabinet Office, which said any such comment would be highly \"prejudicial\". The issue of the new yacht came as support for the Royal Family was at a low ebb. There had been an angry backlash the previous year when ministers said taxpayers would foot the bill - which ran to £36m - for Windsor Castle to be restored after a fire. In the aftermath of her \"annus horribilis\" - which included the separation of Prince Charles and Diana - Elizabeth II agreed she would pay taxes for the first time. With the prime minister due to announce the move to parliament, Queen Elizabeth II's private secretary Sir Robert Fellowes saw an opportunity. He asked Mr Major's principal private secretary Alex Allan if the PM would insert a passage on the importance of Britannia, as well as the royals' dedicated aircraft and train. He suggested the prime minister should say it was not just a question of cost \"but also the style in which we wish our head of state and members of the Royal Family to represent us\" in their public duties. \"I would also like to make clear that there is not, and never has been, any pressure from the Queen to build a replacement for HMY Britannia,\" he added. Read more:The signs that Prince Harry is trying to push resetIn pictures: Star-studded banquet for Macron However, Nicolas Bevan, leading the working group set up to consider the future of Britannia, warned the proposed remark could be \"prejudicial\" to any future decisions. \"Equally it hardly rings true to suggest that it is a matter of complete indifference to the Queen as to whether Britannia is replaced or not,\" he said. Despite misgivings over the cost, the government announced in January 1997 that a replacement yacht would be built if they retained power in the following year's general election. When Labour swept to power with a landslide win, they promptly reversed the decision. When Britannia was finally decommissioned, Queen Elizabeth II, who rarely displayed any emotion in public, was seen shedding a tear."
    },
    {
        "title": "President Bush determined to 'rid world of evil-doer Saddam Hussein', new records reveal",
        "description": "It would have been \"politically impossible\" to stop President Bush from invading Iraq, as he believed he was on a \"crusade against evil\", new records show.",
        "url": "https://news.sky.com/story/president-bush-determined-to-rid-world-of-evil-doer-saddam-hussein-new-records-reveal-13399625",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-tony-blair-george-bush_6969899.jpg?20250721130626",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-21 11:21:00",
        "Headline": "Newly released government files show the US president believed he was on a \"crusade against evil\", in the months before the invasion of Iraq.",
        "Content": "It would have been \"politically impossible\" to stop President Bush from invading Iraq, as he believed he was on a \"crusade against evil\", new records show. Newly declassified UK government files show Sir Tony Blair was warned by his US ambassador that George W Bush was determined to overthrow dictator Saddam Hussein, in the months before the invasion of Iraq. Sir Tony, who was prime minister at the time, was trying to encourage the US president to use diplomatic means to change the situation in the Middle Eastern country, and flew to Camp David in January 2003 to make the case, just two months before the joint US-UK invasion. The UK government was also hoping the United Nations Security Council would agree a new resolution specifically authorising the use of military force against Iraq. But the files, made public for the first time, show that Sir Tony's ambassador, Sir Christopher Meyer, warned him it would be \"politically impossible\" to sway Mr Bush away from an invasion unless Hussein surrendered. The documents, released by the National Archives at Kew in west London, show Sir Christopher also wrote that Mr Bush believed himself to be on \"a crusade against evil to be undertaken by God's chosen people\". Sir Tony's foreign policy adviser, Sir David Manning, told the PM that when he met Mr Bush, he should make the point that a new diplomatic resolution was \"politically essential for the UK, and almost certainly legally essential as well\". \n                  Starmer's challenge is to see if usual rules of special relationship still apply under Trump after years of love bombing\n                 \n                  Jimmy Carter funeral sees US presidents unite and Kamala Harris face-to-face with Donald Trump\n                 \n                  All five living US presidents pictured together at funeral of Jimmy Carter\n                 But the White House was becoming increasingly impatient at the unwillingness of France and Russia - both of whom held a veto - to agree a resolution so long as UN inspectors were unable to find any evidence of Iraqi weapons of mass destruction, the supposed justification for war. Sir Christopher warned Sir Tony shortly before his visit to see Mr Bush in January 2003 that options for a peaceful solution in Iraq had effectively run out. He wrote: \"It is politically impossible for Bush to back down from going to war in Iraq this spring, absent Saddam's surrender or disappearance from the scene. \"If Bush had any room for manoeuvre beforehand this was closed off by his State of the Union speech. \"In the high-flown prose to which Bush is drawn on these set-piece occasions, he said in effect that destroying Saddam is a crusade against evil to be undertaken by God's chosen people.\" In a cable sent the previous month, Sir Christopher said that much of the impulse for deposing Hussein was coming from the president, a born-again Christian, who was scornful of what he saw as the \"self-serving\" reservations of the Europeans. \"His view of the world is Manichean. He sees his mission as ridding it of evil-doers. He believes American values should be universal values,\" Sir Christopher stated. \"He is strongly allergic to Europeans collectively. Anyone who has sat round a dinner table with low-church Southerners will find these sentiments instantly recognisable.\" In the end, Sir Tony and Mr Bush abandoned efforts to get a new Security Council resolution, blaming French President Jacques Chirac for refusing, and launched the invasion of Iraq anyway. Lobbying from Mandelson and anger at the French Among the new files, there are also a number of other revelations. These include:"
    },
    {
        "title": "People smugglers to have assets frozen and be banned from UK",
        "description": "People smugglers face having their assets frozen and being banned from entering the UK, the foreign secretary has announced.",
        "url": "https://news.sky.com/story/people-smugglers-to-have-assets-frozen-and-be-banned-from-uk-13399703",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-france-gravelines-coast-guard_6966790.jpg?20250717093045",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-21 13:30:00",
        "Headline": "New powers under the Sanctions Act will see gang leaders, small boat suppliers, fake passport makers and anyone else enabling small boat crossings targeted.",
        "Content": "People smugglers face having their assets frozen and being banned from entering the UK, the foreign secretary has announced. David Lammy said new powers under the Sanctions Act will allow the UK to freeze the assets of anyone complicit in smuggling illegal migrants into the country. They can also be banned from travelling to the UK. The first wave of sanctions on smuggling gangs and their enablers will be imposed on Wednesday.  Mr Lammy said it is the \"world's first sanctions regime\" targeted at smuggling gangs. Gang leaders, small boat suppliers, people making and selling fake passports and middlemen facilitating payments by migrants through hawala networks (informal systems for transferring money) will all be targeted this week. \n                  UK restores diplomatic ties with Syria\n                 \n                  UK could send further capabilities to Middle East, minister says\n                 \n                  Foreign Secretary David Lammy in Gibraltar as negotiations over post-Brexit deal with Spain heat up\n                 They will be publicly named on a sanctions list, making it illegal for the UK financial system to engage with them. By using the Sanctions Act, the government said it can target the smuggling gangs wherever they are in the world, including where law enforcement and criminal justice approaches cannot reach.  Labour's manifesto promised to \"smash the gangs\", but the first half of 2025 has seen a record number of small boat crossings, with about 20,000 from January to June - the highest ever in that period, and 48% more than the first half of 2024. Earlier this month, the UK and France announced a pilot scheme under which migrants arriving in the UK illegally from France will be returned and a legitimate asylum seeker will be able to come to the UK. They did not say how many would be returned each week, but the suggestion was 50. On the latest sanctions, Foreign Secretary David Lammy said: \"For too long, criminal gangs have been lining their corrupt pockets and preying on the hopes of vulnerable people with impunity as they drive irregular migration to the UK. We will not accept this status quo. \"It is our moral duty and a key part of our Plan for Change to do all we can to smash these gangs and secure Britain's borders. \"That's why the UK has created the world's first sanctions regime targeted at gangs involved in people smuggling and driving irregular migration, as well as their enablers. \"From tomorrow, those involved will face having their assets frozen, being shut off from the UK financial system and banned from travelling to the UK.\" Home Secretary Yvette Cooper said the sanctions send a \"clear message that there is no hiding place for those who exploit vulnerable people and put lives at risk for profit\"."
    },
    {
        "title": "Could your summer holiday be greener? Government invests £63m into more sustainable types of jet fuel",
        "description": "The government is investing &#163;63m in new types of jet fuel that it hopes will make your summer holiday a little more eco-friendly - though not everyone is convinced.",
        "url": "https://news.sky.com/story/could-your-summer-holiday-be-greener-government-invests-16363m-into-more-sustainable-types-of-jet-fuel-13399766",
        "image_url": "https://e3.365dm.com/21/10/1920x1080/skynews-aviation-airlines-climate-teaser_5534594.jpg?20211004103633",
        "type": "UK",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-07-21 15:38:00",
        "Headline": "The government argues the cash will boost British industry and jobs in a fast-growing market, and benefit the climate. Campaigners warn the fuels will fail to deliver.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The government is investing £63m in new types of jet fuel that it hopes will make your summer holiday a little more eco-friendly - though not everyone is convinced. The cash will be shared by 17 British companies developing different types of \"sustainable aviation fuel\" (SAF), made from materials including forest cuttings, household rubbish, sugar beet or hydrogen gas. Ministers said the funds could support 1,400 jobs, add £5bn to the economy and help the British industry get ahead as global demand for SAF soars in order to meet stricter climate targets. But campaigners question how sustainable these fuels really are, saying the real answer is to deter \"frequent flying\". They warn the materials needed for sustainable fuels are hard to come by and too expensive to ever scale up. Industry says it needs this cash injection precisely in order to lower costs and grow, and global demand is booming.  As of January, flights taking off from the UK must use 2% SAF in their fuel, under new government rules. This will gradually rise to 10% in 2030 and 22% in 2040. \n                  Hundreds of passengers evacuated after Delta Air Lines Airbus A330 engine catches fire at Orlando International Airport\n                 \n                  Luton Airport expansion plans approved by transport secretary\n                 \n                  Boeing passenger jet catches fire after engine fault forces American Airlines flight to divert to Denver\n                 But there have been alarm bells warning not enough SAF will be available to meet those targets. The government says sustainable fuels cut emissions of greenhouse gases by 70% on average compared with kerosene over the course of its life, which includes producing it and burning it. Aviation minister Mike Kane said: \"We're not just backing brilliant British innovation, we're creating thousands of high-skilled jobs and positioning the UK at the forefront of the global sustainable aviation market.\" He said the move would \"kickstart economic growth, secure energy independence, and make Britain a clean energy superpower\". But campaigners say at best the fuels will reduce aviation emissions \"by a tiny fraction of the amount needed\", and are being used to justify \"irresponsible levels\" of airport expansion. James Sutton, co-director of climate charity Possible, told Sky News they were not anti-investment, but that the SAF plans would not bring down emissions at the pace and scale necessary. He said: \"We need to cut those emissions immediately if we have any hope of hitting our climate goals, not just sit and hope for the best in a few decades time. \"The technology and investment required for SAF to displace kerosene entirely is simply not there yet, but policies aimed at reducing demand for flights and taxing frequent flyers, which will therefore cut emissions, are possible now. \"So that is what we need to focus on first and foremost.\" The biggest winner in this round of funding was Stockton-on-Tees based Alfanar Energy, which will get £8m for converting waste wood from sawmills and forestry into SAF."
    },
    {
        "title": "Compensation scheme for infected blood scandal widened",
        "description": "More victims of the infected blood scandal will qualify for compensation while others will get higher awards under changes to the scheme. ",
        "url": "https://news.sky.com/story/compensation-scheme-for-infected-blood-scandal-widened-13399812",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-infected-blood-scandal_6684534.jpg?20240914050000",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-21 16:54:00",
        "Headline": "The new rules mean estates of affected people who have already died will be able to claim payments.",
        "Content": "More victims of the infected blood scandal will qualify for compensation while others will get higher awards under changes to the scheme.  The new rules mean estates of affected people who have already died will be able to claim payments. As well as this, around 1,000 people who are already eligible will be able to claim a higher amount, including chronic Hepatitis C individuals. Politics latest: Starmer explains how he plans to make people 'better off'  The reforms are being introduced following 16 recommendations from the Infected Blood Inquiry, which published an additional report earlier this month. Confirming the changes, minister for the Cabinet Office Nick Thomas-Symonds said the government has \"concentrated on removing barriers to quicker compensation\". \n                  Infected blood victims are 'waiting to die in limbo' - with hundreds still waiting for compensation\n                 \n                  New GP drive to find undiagnosed infected blood scandal victims\n                 \n                  Infected blood scandal: Victims 'scared they won't live to see compensation'\n                 He added: \"Our focus as we move forward must be working together to not only deliver justice to all those impacted, but also to restore trust in the state to people who have been let down too many times.\" Between the 1970s and early 1990s, more than 30,000 people in the UK were infected with HIV and hepatitis C while receiving NHS care.  Some 3,000 people have died after they were given contaminated blood and blood products, while survivors live with lifelong implications. In last October's Budget, Chancellor Rachel Reeves committed £11.8bn to compensate victims of the infected blood scandal, with the scheme opening at the end of last year. The changes will ensure that those who endured treatments with adverse side effects, such as interferon, will receive higher compensation to what is currently provided. Health correspondent The government will now hope its response to Sir Brian Langstaff's criticism will be enough to convince the Infected Blood chair - and more importantly those infected and affected by this scandal - is listening and acting with urgency.   The long-awaited report was published in May 2024. It was an afternoon charged with raw emotion. After decades of being lied to, ignored and gaslit, finally the infected blood community had found its champion. Someone who understood their pain and suffering.  Sir Brian called on the government to deliver compensation quickly, knowing that many were dying before seeing justice delivered.  But Sir Brian was not himself convinced. Even after the publication of the report he kept the Inquiry open.  This is unprecedented. It showed that he feared there would be more stalling and further delays to payments. He was, sadly, proved right.  It took an extraordinary intervention from Sir Brian last month to push the government to respond. It says it will implement all of the Inquiry's latest recommendations, some immediately and the rest after further consultation with the community.  More people will now qualify for payment and others will get more compensation. And importantly the claims of victims will not die with them but instead can now be passed on to surviving family members. All hugely important revisions.  The government says it understands the urgency. But it will also know it should not have taken an unprecedented intervention to force the issue. Higher compensation will also be available for the impacts currently recognised by the Infected Blood Support Scheme 'Special Category Mechanism' (SCM), which is provided to chronic Hepatitis C individuals who have experienced a significant impact on their ability to carry out daily duties. The government said the changes mean that over a thousand people will receive a higher amount than they would have under the existing scheme. Scheme widened to estates of deceased affected people  The scheme will also be widened to some people who don't currently qualify. Under the current mechanism, if someone who was infected dies before receiving full compensation, then any final award can be passed on to their relatives through their estate. However while compensation is also available to family members affected by the scandal - a partner, sibling or parent of someone who was infected, for example, this claim dies with them if they pass away. The changes announced today mean that if the affected person has died after May 21st 2024, or dies in future before receiving compensation, their estate will be able to make a claim. Memorial plans announced The government also announced that Clive Smith, president of the Haemophilia Society, will be the chair of the new Infected Blood Memorial Committee. The project will include plans for a UK memorial and support memorials in Scotland, Wales and Northern Ireland. In line with the Infected Blood Inquiry's recommendation, the committee will also develop plans for commemorative events and is planning to hold the first by the end of 2025. Mr Smith said the memorial is \"long overdue\". He added: \"It is a great privilege to be asked to lead this important work on behalf of the community. \"I am conscious that we are already behind in relation to implementing the Infected Blood Inquiry's recommendation that community events be held on a six-month basis post the Inquiry reporting. We intend to correct that by the end of this year. \"I look forward to working with the whole community across the UK on building an appropriate memorial to those we have lost and to act as a lasting memorial to the nation of what can happen when patient safety is not prioritised.\""
    },
    {
        "title": "Double decker bus crashes into bridge in Manchester",
        "description": "A double decker bus has crashed into a bridge in Manchester, police have said.",
        "url": "https://news.sky.com/story/double-decker-bus-crashes-into-bridge-in-manchester-13399840",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-manchester-bus-crash_6970291.png?20250721201100",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-21 18:10:00",
        "Headline": "Fifteen people were taken to hospital, according to North West Ambulance Service. Local media reported that one person was critically injured and two others were seriously hurt.",
        "Content": "A double decker bus has crashed into a bridge in Manchester, police have said. North West Ambulance Service (NWAS) had declared a \"major incident\" with 15 people taken to hospital following the incident on Barton Lane in Eccles. It has since \"stood down\" from major incident status. Local media reported that one person was critically injured and two others were seriously hurt. Pictures on social media showed the yellow bus with its roof torn off and emergency service workers aboard the upper deck. On X, Greater Manchester Police wrote: \"We are currently responding to a collision between a bus and a bridge at the junction of Barton Road and Trafford Road in Eccles. \"Emergency services are currently on scene as part of the ongoing work. \n                  Colombian man found guilty of double murder after leaving couple's bodies in suitcases on Bristol bridge\n                 \n                  Pressure grows to leave 'mad' Aarhus Convention used to block UK building projects\n                 \n                  The wealth tax options Reeves could take to ease her fiscal bind\n                 \"Please avoid the area as road closures are currently in place.\" In a statement, NWAS said: \"The trust dispatched a number of resources, including 10 emergency ambulances, advanced paramedics, our Hazard Area Response Team (HART) and colleagues from North West Air Ambulance. The first resource arrived on time at 15.10. \"NWAS treated 15 patients who were all taken to Salford Royal or Manchester Royal Infirmary hospitals.\" An unnamed eyewitness said they arrived at the scene about two minutes after the crash. They told the Manchester Evening News: \"I could just hear screaming coming from the top of the bus.\" Transport for Greater Manchester said the bus was a 100 service and was in operation at the time of the incident. Vernon Everitt, transport commissioner for Greater Manchester, said: \"An immediate and urgent investigation into the circumstances is under way and we are working closely with the investigation team at Greater Manchester Police and the bus operator, Stagecoach. \"This is clearly a distressing situation for everyone involved and we'd like to thank emergency services for their swift response.\" The service departs from Shudehill and travels to Salford, Trafford Centre, and Warrington. The location where the incident took place does not appear to be on the Bee Network Route map for the 100 service."
    },
    {
        "title": "Gaza food situation 'worst it's ever been', charity says - as tank attack reportedly kills 12 at camp",
        "description": "An aid worker in Gaza has told Sky News the food situation in the enclave is \"absolutely desperate\" and \"the worst it's ever been\".",
        "url": "https://news.sky.com/story/gaza-food-situation-worst-its-ever-been-charity-says-8211-as-uk-promises-16340m-in-aid-13399832",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-gaza-food-aid_6970247.jpg?20250721190240",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-21 17:53:00",
        "Headline": "Rachael Cummings, humanitarian director for Save The Children, speaks to Sky News as Foreign Secretary David Lammy promises £40m for humanitarian assistance in Gaza.",
        "Content": " An aid worker in Gaza has told Sky News the food situation in the enclave is \"absolutely desperate\" and \"the worst it's ever been\". Her comments to chief presenter Mark Austin come amid fresh outcry over aid restrictions, with the UK joining 24 other countries to urge an immediate end to the war. It also comes as at least 12 more Palestinians were killed and dozens wounded when tanks shelled a tent encampment in western Gaza City, according to health authorities. Middle East latest: Key points from UK statement on Gaza Medics, speaking early on Tuesday, said two shells were fired at tents housing displaced people from tanks positioned north of the Shati camp. Israel hasn't yet commented on the reports. Rachael Cummings, humanitarian director for Save The Children, spoke to Sky News from Deir al Balah, a city where tens of thousands of people have sought refuge during repeated waves of mass displacement. \n                  Watch Deir al Balah skyline live from Gaza amid reports of Israeli offensive\n                 \n                  Israel launches ground assault on central Gazan city, says charity\n                 \n                  Trump, Epstein and a 'bawdy' birthday card\n                 She said: \"One of my colleagues said to me yesterday, 'We are all walking together towards death'. And this is the situation now for people in Gaza. \"There is no food for their children, it's absolutely desperate here.\" \"The markets are empty,\" she said. \"People may even have cash in their pockets yet they cannot buy bread [or] vegetables. \"My team have said to me, 'There's nothing in my house to feed my children, my children are crying all day, every day.\" Israel launched a ground assault on southern and eastern Deir al Balah for the first time on Monday after having issued an evacuation order. Local medics said at least three people were killed when houses and mosques were hit by tank shelling. Sources told Reuters news agency that Israel believes some of the hostages kidnapped by Hamas in October 2023 could be in the area. Ms Cummings's remarks came as the UK and 24 other nations issued a joint statement calling for a ceasefire. The statement criticised aid distribution in Gaza, which is being managed by a US and Israel-backed organisation, Gaza Health Foundation (GHF). Hundreds of people have reportedly been killed while trying to get food in recent weeks, both from GHF and UN convoys. \"The Israeli government's aid delivery model is dangerous, fuels instability and deprives Gazans of human dignity,\" the joint statement said. The 25 countries also called for the \"immediate and unconditional release\" of hostages captured by Hamas during the 7 October 2023 attacks. Lammy promises £40m for Gaza Foreign Secretary David Lammy has promised £40m for humanitarian assistance in Gaza. He told MPs: \"We are leading diplomatic efforts to show that there must be a viable pathway to a Palestinian state involving the Palestinian Authority, not Hamas, in the security and governance of the area. \"Hamas can have no role in the governance of Gaza, nor use it as a launchpad for terrorism.\"  Addressing the foreign secretaries' joint written statement, charity worker Liz Allcock - who works for Medical Aid for Palestinians (MAP) in Gaza - told Sky News: \"While we welcome this, there have been statements in the past 21 months and nothing has changed. \"In fact, things have only got worse. And every time we think it can't get worse, it does.\" \"Without a reversal of the siege, the lack of supplies, the constant bombardment, the forced displacement, the killing, the militarisation of aid, we are going to collapse as a humanitarian response,\" she said. \"And this would do a grave injustice to the 2.2 million people we're trying to serve. \"An immediate and permanent ceasefire, and avenues for accountability in line with international law, is the minimum people here deserve.\" The war in Gaza started in response to Hamas's attack on Israel on 7 October 2023, which killed 1,200 people and saw about 250 taken hostage. More than 59,000 Palestinians have since been killed, with more than half being women and children, according to Gaza's health ministry, which does not distinguish between civilians and combatants in its count. In recent weeks hundreds of Palestinians have reportedly been killed while waiting for food and aid. The Israeli military has blamed Hamas militants for fomenting chaos and endangering civilians."
    },
    {
        "title": "Plane crashes into college campus in Bangladesh - at least 19 people dead",
        "description": "At least 19 people have died after a Bangladesh air force plane crashed into a college campus, the military said.",
        "url": "https://news.sky.com/story/plane-crashes-into-college-campus-in-bangladesh-at-least-19-people-dead-13399574",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-dhaka-bangladesh-milestone_6969819.jpg?20250721113846",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-21 09:35:00",
        "Headline": "The aircraft crashed into Milestone School and College where students were taking tests or attending regular classes.",
        "Content": " At least 19 people have died after a Bangladesh air force plane crashed into a college campus, the military said. The aircraft crashed into the campus of Milestone School and College in Uttara, in the northern area of the capital Dhaka, where students were taking tests or attending regular classes. The pilot was one of the people killed, and, according to the military, 164 were injured in the incident. The Bangladesh military's public relations department added that the aircraft was an F-7 BGI, and had taken off at 1.06pm local time before crashing shortly after. Video shows fire and smoke rising from the crash site, with hundreds looking on. The cause of the crash was not immediately clear. Bengali-language daily newspaper Prothom Alo said that most of the injured were students with burn injuries. Citing the duty officer at the fire service control room, Prothom Alo also reported that the plane had crashed on the roof of the college canteen. Read more from Sky News:Police search for missing woman last seen at petrol stationSix arrests after nearly 250 children poisoned by lead in food Rafiqa Taha, a 16-year-old student at the school who was not present at the time of the crash, told the Associated Press that the school has around 2,000 students. \"I was terrified watching videos on TV,\" she added. \"My God! It's my school.\""
    },
    {
        "title": "Trade war: Is  August escalation on - or will Trump chicken out?",
        "description": "Donald Trump is clearly seething over the term 'TACO' (Trump always chickens out) - a phrase that has characterised financial market trading over the past few months.",
        "url": "https://news.sky.com/story/trade-war-is-august-escalation-on-or-will-trump-chicken-out-13399658",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-trump-trade-us-economy_6965912.png?20250716092126",
        "type": "World",
        "Author": "James Sillars",
        "Date Published": "2025-07-21 12:00:00",
        "Headline": "Sky's James Sillars writes that optimism for further deals, similar to that for the UK, appears to be dimming but there is every reason to suspect that any tariff expansions from 1 August will be short-lived.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump is clearly seething over the term 'TACO' (Trump always chickens out) - a phrase that has characterised financial market trading over the past few months. It suggests that for all the president's bluster and threats during his on-off trade war to date, he rarely follows through. When asked by a reporter about TACO in late May, as his \"liberation day\" escalation remained on pause, he declared it a \"nasty\" question and said he wanted negotiations. Money latest: 'Biggest July house price drop in 20 years' Mr Trump wants a deal but to effectively bully America's trading partners into agreeing better terms. It's a playbook that has defined his time in the White House and, as things stand, more than 20 nations and territories, including Japan and South Korea, face heightened tariffs of up to 40% on their exports to the US from 1 August. Financial markets don't really believe it. Stock markets, for example, are still hovering near or at record levels in both the US and in Europe. The FTSE 100 closed above 9,000 points for the first time on Monday evening. TACO is ingrained in those values. \n                  Trump threatens to block Washington Commanders stadium deal unless they change name back to 'Redskins'\n                 \n                  Police Scotland threatened with potential legal action by own officers over Donald Trump visit plans\n                 \n                  What is chronic venous insufficiency? Symptoms and treatment after Trump diagnosed\n                 But are markets are in for a shock, especially when it comes to the fight with America's single largest trading partner, the European Union? It was created, Mr Trump has previously claimed, to \"screw\" the United States. It's fair to say there was great optimism in the EU earlier this month that a deal, similar to that agreed between the US and UK, was looming to avert the worst of a threatened 30% baseline tariff from 1 August.  But the mood music in Brussels changed at the back end of last week and now EU diplomats are even briefing that a broader range of retaliation measures is being considered beyond additional tariffs on US goods. The seriousness of this fight should not be underestimated. EU figures show trade in goods and services between the bloc and the US account for almost a third of all global trade, at a value in 2024 alone of €1.68trn (£1.45trn).  EU Trade Commissioner Maros Sefcovic has warned that a 30% tariff would \"practically prohibit\" the bloc's transatlantic trade, according to remarks via diplomats reported by the Reuters news agency. We're told that, even if time runs out, a truce could theoretically be agreed soon after 1 August. Much will depend on the EU's response. Does it go down the route taken by the UK and not retaliate, pending the conclusion of talks? There is growing pressure on Brussels to call Mr Trump's bluff.  The EU has a package of tariffs on €21bn of US goods ready to go from 6 August. An additional package is yet to be finalised. France is demanding US services are hit too, with even Germany now saying such an escalation should be considered. The so-called \"anti-coercion\" instrument, as it's known, would also potentially allow the bloc to limit US companies' access to financial service markets in the EU. So what happens after 1 August could be even more explosive. But there is every reason to believe that a tit-for-tat escalation is unlikely, at least for long. The very reason Donald Trump rowed back on his \"liberation day\" tariffs in April, allowing 90 days for talks, was likely the dire financial market reaction that followed news of the widespread duties. You have a president demanding interest rate cuts (at a time when inflation is on the rise due to the impact of tariffs) in a bid to boost flagging economic growth. Mr Trump says his trade war is all about boosting US manufacturing jobs but, at the end of the day, no powerbase of voters is going to accept a threat to the value of their investments for long. No big US company will stand by and see its sales suffer. TACO? It's a solid bet."
    },
    {
        "title": "Malcolm-Jamal Warner, who played The Cosby Show's Theo, drowns in Costa Rica",
        "description": "Malcolm-Jamal Warner, who played The Cosby Show character Theo, has drowned in Costa Rica, according to authorities.",
        "url": "https://news.sky.com/story/malcolm-jamal-warner-who-played-the-cosby-shows-theo-drowns-in-costa-rica-13399852",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-malcolm-jamal-warner_6970280.jpg?20250721193922",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-21 18:31:00",
        "Headline": "It is understood the 54-year-old was swimming at Playa Grande de Cocles in Limon province when he was pulled underwater by a current.",
        "Content": "Malcolm-Jamal Warner, who played The Cosby Show character Theo, has drowned in Costa Rica, according to authorities. The country's Judicial Investigation Department said the 54-year-old actor drowned on Sunday afternoon off a beach on the Caribbean coast. It is understood he was swimming at Playa Grande de Cocles in Limon province when he was pulled underwater by a current. \"He was rescued by people on the beach,\" according to the department's early report, but emergency workers from Costa Rica's Red Cross found him without any signs of life and he was taken to the morgue.  Warner was on holiday with his family at the time, according to US celebrity news site People. The Cosby Show aired from 1984 to 1992 on NBC in the US and is regarded as a groundbreaking show for its portrayal of a successful black middle-class family. It was also shown on Channel 4 in the UK at around the same time. Its star, Bill Cosby, played a doctor named Cliff Huxtable, with Warner in the role of Theo, his only son. The NBC sitcom was the most popular show in America for much of its run between 1984 and 1992. Warner played the role for eight seasons in all 197 episodes, winning an Emmy nomination for supporting actor in a comedy in 1986. For many, the lasting image of the character, and of Warner, is of him wearing a badly-botched mock designer shirt sewn by his sister Denise, played by Lisa Bonet. Warner 'proud' of show despite Cosby claims The legacy of The Cosby Show has been tarnished after Cosby was jailed in 2018 following a conviction for sexual assault. He was released in 2021 after his conviction was overturned. Dozens of women had accused Cosby of sexual assault or rape before the trial. Following his release from prison, Cosby was found liable for sexually assaulting a woman at the Playboy Mansion in 1975 when she was a teenager. Warner told the Associated Press in 2015: \"My biggest concern is when it comes to images of people of colour on television and film... We've always had 'The Cosby Show' to hold up against that. And the fact that we no longer have that, that's the thing that saddens me the most because in a few generations the Huxtables will have been just a fairy tale.\" In 2023, Warner told People in an interview: \"I know I can speak for all the cast when I say The Cosby Show is something that we are all still very proud of.\" Read more entertainment news:Danny Dyer on Mr Big StuffScuffle breaks out on Royal Opera House on stage Warner wins a Grammy  Following his career on The Cosby Show, Warner later appeared on the sitcom Malcolm & Eddie, co-starring with comedian Eddie Griffin in the series on the UPN network from 1996 to 2000. In the 2010s he starred opposite Tracee Ellis Ross as a family-blending couple for two seasons on the BET sitcom Read Between The Lines. He also had a role as OJ Simpson's friend Al Cowlings in American Crime Story and was a series regular on Fox's The Resident. Films he has appeared in include the 2008 rom-com Fool's Gold with Matthew McConaughey and Kate Hudson. A poet and a musician, Warner won a Grammy for best traditional R&B performance for the song Jesus Children with Robert Glasper and Lalah Hathaway. He was also nominated for best spoken word poetry album for Hiding In Plain View.Warner was married with a daughter, but chose to not publicly disclose their names."
    },
    {
        "title": "'Hugely talented' ice hockey player Gary Kelly dies in suspected fall from Ibiza hotel balcony",
        "description": "A \"hugely talented\" Scottish ice hockey player has died in a suspected fall from a hotel balcony while on holiday in Ibiza.",
        "url": "https://news.sky.com/story/hugely-talented-ice-hockey-player-gary-kelly-dies-in-suspected-fall-from-ibiza-hotel-balcony-13399843",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-gary-kelly-dundee-stars_6970257.jpg?20250721191941",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-21 18:03:00",
        "Headline": "The 19-year-old's death comes after another Scottish tourist, Evan Thomson, 26, fell to his death on the premises earlier this month.",
        "Content": "A \"hugely talented\" Scottish ice hockey player has died in a suspected fall from a hotel balcony while on holiday in Ibiza. Gary Kelly, who was part of the Dundee Stars, died at the Ibiza Rocks Hotel, in San Antonio, on Monday. The 19-year-old's death comes after another Scottish tourist, Evan Thomson, 26, fell to his death on the premises on 7 July. In light of their deaths, the hotel said it was pausing its events programme. It said in a statement: \"We are deeply shocked and devastated by the recent incidents that have tragically occurred. \"Our priority is to support those affected and their loved ones during this incredibly difficult time, and to fully assist the authorities with their investigations. \"The safety and wellbeing of our guests has, and always will remain, our highest priority.\" \n                  'I serve the rich but live in a van': Is Ibiza at breaking point?\n                 \n                  'I serve the rich but live in a van': Is Ibiza at breaking point?\n                 \n                  Ibiza: Chef at popular restaurant charged over 'attack on customer' who sent back food\n                 The hotel added: \"Given the seriousness of the situation and out of respect for those involved, we believe it is right to pause our advertised events programme at this time.\" The Dundee Stars paid tribute to Dundee-born Mr Kelly on the club's website. A statement read: \"Gary was hugely talented and charismatic individual who had a great future ahead of him. His loss will impact many in the ice hockey community and beyond. He will be sadly missed.\" Read more from Sky News:10-year-old boy killed in coach crash is namedPolice threatened with potential legal action over Trump visit Another of his clubs, Aberdeen Lynx, said: \"The Lynx family is heartbroken to share the devastating news of the sudden passing of one of our brightest young stars, Gary Kelly, while on holiday. \"Gary was more than just a talented hockey player - he was a young man full of heart, passion, and dedication. \"On the ice, he gave everything he had. Off the ice, he brought energy, kindness, and an infectious love of life that lifted everyone around him. He wore his heart on his sleeve, and that spirit left a lasting mark on our team, our club, and everyone who had the privilege of knowing him.\" A number of tributes were also paid to him by other UK ice hockey teams. A statement on X from Glasgow Clan said: \"The Glasgow Clan would like to express our deepest condolences to the family and friends of Gary Kelly. \"This is truly heartbreaking news. Our thoughts are with everyone affected by this tragic incident during this incredibly difficult time.\" Another from the Whitley Warriors, for whom he briefly played, said: \"Whitley Warriors are devastated to learn of the tragic passing of former Warrior Gary Kelly, aged just 19. \"Gary iced for Warriors on only a few occasions in the 2023-24 season but was a popular player in the dressing room despite the shortness of his time at Whitley.\" A spokesperson for the Foreign Office said: \"We are supporting the family of a British man who has died in Spain and are in contact with the local authorities.\""
    },
    {
        "title": "Notorious Ecuador gang boss Fito extradited to the US",
        "description": "Notorious Ecuadorian gang leader&#160;Jose&#160;Adolfo Macias Villamar - known as Fito - will face court in the US after being extradited, his lawyer has said.",
        "url": "https://news.sky.com/story/notorious-ecuador-gang-boss-fito-extradited-to-the-us-13399532",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ecuador-fito_6969722.jpg?20250721095311",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-21 08:14:00",
        "Headline": "Jose Adolfo Macias Villamar - known as Fito - mysteriously escaped prison in January 2024 before being recaptured last month.",
        "Content": "Notorious Ecuadorian gang leader Jose Adolfo Macias Villamar - known as Fito - will face court in the US after being extradited, his lawyer has said. The South American country's most-wanted fugitive vanished from prison in January 2024, with authorities desperately searching for him until he was finally recaptured last month. \"Fito\" has an extensive criminal record including charges of murder and organised crime, and he was sentenced to 34 years behind bars in 2011. While neither the US nor Ecuador have confirmed his extradition, Ecuadorian President Daniel Noboa previously said the move had been requested - and vowed that more notorious gang members \"will fall\".  The prisoner who lived like a king Even after being thrown behind bars, \"Fito\" continued to serve as the leader of the Los Choneros gang up until his escape. He also enjoyed access to mobile phones and the internet, watched TV and kept pets. \"His prison cell basically resembled a hotel room,\" Annette Idler, a professor of global security at the University of Oxford, previously told Sky News. \"He had access to women who were brought to him,\" she adds. \"It was a luxury room for him.\" Colourful murals of the gang leader were even daubed across the prison walls, including one of him flanked by two assault rifles. But then in January last year, he mysteriously vanished, leading to a nationwide manhunt. Officials are yet to explain how he escaped. Read more:How Fito lived like a king in prison 'Fito' recaptured After more than a year in hiding, \"Fito\" was found in his hometown of Manta last month. Footage from the Ecuadorian army showed a uniformed officer aiming a gun at the drug trafficker's head after finding him hiding in a small hole beneath a kitchen counter. The announcement of his arrest came in the same week that another gang leader was confirmed to have escaped from an Ecuadorian prison. Extradition to the US \"Fito\" will now face court in the US following his reported extradition from Ecuador. Flight data shows that a US government plane departed from Guayaquil after 2 pm local time on Sunday. \"Mr Macias and I will appear tomorrow before the Brooklyn federal court... where he will plead not guilty,\" his lawyer, Alexei Schacht, said. \"After, he will be held in a to-be-determined prison.\" The US Department of Justice has stated that under Macias' direction, Los Choneros committed violent acts against law enforcement, politicians, lawyers, prosecutors and civilians. Ecuador's government says the gang exercises vast control over the nation's prisons, which are plagued by corruption and overcrowding."
    },
    {
        "title": "Seventeen investigated after nearly 250 children poisoned by lead in their food",
        "description": "Seventeen people are being investigated in China after nearly 250 children were found to have high levels of lead in their blood, officials have said.",
        "url": "https://news.sky.com/story/six-arrests-after-nearly-250-children-poisoned-by-lead-in-their-food-in-china-13399575",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-china-smith-kindergarten-lead_6963070.jpg?20250711221421",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-21 09:27:00",
        "Headline": "Staff were accused earlier this month of adding paint powder to children's food at a kindergarten in northwestern China.",
        "Content": " Seventeen people are being investigated in China after nearly 250 children were found to have high levels of lead in their blood, officials have said. The individuals \"under disciplinary investigation\" includes the head of a local hospital, while 10 government officials have also been held \"accountable\". It comes after a scandal involving Heshi Peixin kindergarten in Maiji, northwestern China, emerged earlier this month. Police said staff at the private kindergarten had been adding paint powder to food in an apparent bid to make it look more appealing. Testing showed 247 out of 251 of the kindergarten's children and 28 members of staff had \"abnormal blood levels\". A further five children who finished attending the kindergarten in 2024 also recorded abnormal levels of lead in their blood, according to investigators. A Sky News team in Maiji reported how the local hospital had been accused of returning tests for lead showing much lower levels than at the bigger hospitals. Investigators have now found the management of the Second People's Hospital of Tianshui was \"chaotic\" and its laboratory department had been illegally modifying the results of the blood lead tests. The head of the hospital is one of the 17 people facing disciplinary investigation. Sky News was told how one child was found to have lead in her blood at 38 times the normal level. Read more from Sky News:System regulating UK water industry to be overhauledParts of UK could see half a month's rainfall in a day Lead poisoning at high levels can cause long term injuries to the brain and the central nervous system. A mother who lived near the kindergarten said: \"Now if people send children to primary school, the first thing they ask is are you safe? \"Can it guarantee the personal safety of our children in the future?\""
    },
    {
        "title": "Israel launches ground assault on central Gazan city, says charity",
        "description": "Medical aid has been suspended to a city in central Gaza due to an Israeli ground assault there, a charity has said.",
        "url": "https://news.sky.com/story/israel-launches-ground-assault-on-central-gazan-city-says-charity-13399479",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-deir-al-balah-gaza_6969839.jpg?20250721115402",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-21 05:09:00",
        "Headline": "Gaza medics said at least three Palestinians were killed and several were wounded in tank shelling that hit three mosques and eight houses, Reuters news agency reported.",
        "Content": "Medical aid has been suspended to a city in central Gaza due to an Israeli ground assault there, a charity has said. Medical Aid for Palestinians (MAP) said the Israeli military had launched a ground invasion of the city of Deir al Balah this morning. It added that thousands of displaced people are living in the area, including MAP staff, and the latest orders by Israel \"directly endanger vital humanitarian and primary healthcare sites\". It said the \"forced displacement orders do not allow for the transport of lifesaving medical equipment or supplies\" and this was \"further obstructing efforts to provide emergency assistance\". Steve Cutts, MAP's interim CEO, said: \"This latest forced displacement order is yet another attack on humanitarian operations and a deliberate attempt to sever the last remaining threads of Gaza's health and aid system. \"MAP now has to suspend critical services we have been providing to the Palestinian population, including a primary health clinic that serves hundreds of civilians every day. With Israel's systematic targeting of health and aid workers, no one is safe. \"Not only are we prevented from carrying out our lifesaving work to support Palestinians, we are also unable to protect our own teams.\" Gaza medics said at least three Palestinians were killed and several were wounded in tank shelling that hit three mosques and eight houses, Reuters news agency reported. Israeli sources said the Israel Defence Forces (IDF) had previously stayed out of Deir Al Balah because they suspect Hamas might be holding hostages there, Reuters added. At least 20 of the remaining 50 hostages in Gaza are believed to still be alive. 'People were simply trying to access food' The UN food agency has accused Israel of using tanks, snipers and other weapons to fire on a crowd of Palestinians seeking food aid. The World Food Programme (WFP) condemned violence that erupted in northern Gaza on Sunday as Palestinians tried to reach a convoy of trucks carrying food. Gaza's health ministry said at least 80 people were killed in the incident. The Israeli military said it fired warning shots \"to remove an immediate threat\" - and questioned the number of those killed as reported by the Palestinians. The WFP statement said the incident resulted in the loss of \"countless lives\" - and how the crowd surrounding its convoy \"came under fire from Israeli tanks, snipers and other gunfire\". \"These people were simply trying to access food to feed themselves and their families on the brink of starvation,\" it added. Earlier, the WFP said that shortly after entering Gaza, a convoy of 25 trucks carrying food aid encountered \"massive crowds of hungry civilians\" who then came under gunfire. \"WFP reiterates that any violence involving civilians seeking humanitarian aid is completely unacceptable,\" it said. UNRWA, the UN refugee agency dedicated to Palestinians, said in a social media post it was receiving messages from Gaza warning of starvation, including from its own staff, as food prices have increased 40-fold. \"Meanwhile, just outside Gaza, stockpiled in warehouses UNRWA has enough food for the entire population for over three months. Lift the siege and let aid in safely and at scale,\" it said.  Read more:Thousands trapped in besieged Syrian cityAt least 37 killed as tourist boat capsizes in Vietnam  In Khan Younis earlier on Monday, an Israeli airstrike killed at least five people in a tent, including a man, his wife, and their two children, medics said. Israel is yet to comment on the incidents. Meanwhile, Pope Leo warned against the \"indiscriminate use of force\" and the \"forced mass displacement\" of people in Gaza in a phone call with Palestinian President Mahmoud Abbas on Monday, the Vatican said in a statement. The war began when Hamas-led militants stormed into Israel on 7 October 2023, killing 1,200 people and taking 251 people hostage, according to Israeli tallies. The Israeli military campaign against Hamas in Gaza has since killed more than 58,000 Palestinians, according to health officials."
    },
    {
        "title": "Malcolm-Jamal Warner, who played The Cosby Show's Theo, drowns in Costa Rica",
        "description": "Malcolm-Jamal Warner, who played The Cosby Show character Theo, has drowned in Costa Rica, according to authorities.",
        "url": "https://news.sky.com/story/malcolm-jamal-warner-who-played-the-cosby-shows-theo-drowns-in-costa-rica-13399852",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-malcolm-jamal-warner_6970280.jpg?20250721193922",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-21 18:31:00",
        "Headline": "It is understood the 54-year-old was swimming at Playa Grande de Cocles in Limon province when he was pulled underwater by a current.",
        "Content": "Malcolm-Jamal Warner, who played The Cosby Show character Theo, has drowned in Costa Rica, according to authorities. The country's Judicial Investigation Department said the 54-year-old actor drowned on Sunday afternoon off a beach on the Caribbean coast. It is understood he was swimming at Playa Grande de Cocles in Limon province when he was pulled underwater by a current. \"He was rescued by people on the beach,\" according to the department's early report, but emergency workers from Costa Rica's Red Cross found him without any signs of life and he was taken to the morgue.  Warner was on holiday with his family at the time, according to US celebrity news site People. The Cosby Show aired from 1984 to 1992 on NBC in the US and is regarded as a groundbreaking show for its portrayal of a successful black middle-class family. It was also shown on Channel 4 in the UK at around the same time. Its star, Bill Cosby, played a doctor named Cliff Huxtable, with Warner in the role of Theo, his only son. The NBC sitcom was the most popular show in America for much of its run between 1984 and 1992. Warner played the role for eight seasons in all 197 episodes, winning an Emmy nomination for supporting actor in a comedy in 1986. For many, the lasting image of the character, and of Warner, is of him wearing a badly-botched mock designer shirt sewn by his sister Denise, played by Lisa Bonet. Warner 'proud' of show despite Cosby claims The legacy of The Cosby Show has been tarnished after Cosby was jailed in 2018 following a conviction for sexual assault. He was released in 2021 after his conviction was overturned. Dozens of women had accused Cosby of sexual assault or rape before the trial. Following his release from prison, Cosby was found liable for sexually assaulting a woman at the Playboy Mansion in 1975 when she was a teenager. Warner told the Associated Press in 2015: \"My biggest concern is when it comes to images of people of colour on television and film... We've always had 'The Cosby Show' to hold up against that. And the fact that we no longer have that, that's the thing that saddens me the most because in a few generations the Huxtables will have been just a fairy tale.\" In 2023, Warner told People in an interview: \"I know I can speak for all the cast when I say The Cosby Show is something that we are all still very proud of.\" Read more entertainment news:Danny Dyer on Mr Big StuffScuffle breaks out on Royal Opera House on stage Warner wins a Grammy  Following his career on The Cosby Show, Warner later appeared on the sitcom Malcolm & Eddie, co-starring with comedian Eddie Griffin in the series on the UPN network from 1996 to 2000. In the 2010s he starred opposite Tracee Ellis Ross as a family-blending couple for two seasons on the BET sitcom Read Between The Lines. He also had a role as OJ Simpson's friend Al Cowlings in American Crime Story and was a series regular on Fox's The Resident. Films he has appeared in include the 2008 rom-com Fool's Gold with Matthew McConaughey and Kate Hudson. A poet and a musician, Warner won a Grammy for best traditional R&B performance for the song Jesus Children with Robert Glasper and Lalah Hathaway. He was also nominated for best spoken word poetry album for Hiding In Plain View.Warner was married with a daughter, but chose to not publicly disclose their names."
    },
    {
        "title": "Man who died after being pulled into MRI machine was wearing 9kg weight-training chain, wife reveals",
        "description": "A man who died after being pulled into an MRI machine in New York was wearing a large weight-training chain around his neck, his wife has said.",
        "url": "https://news.sky.com/story/man-who-died-after-being-pulled-into-mri-machine-was-wearing-9kg-weight-training-chain-wife-reveals-13399458",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-mri-mcallister_6969585.jpg?20250721043309",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-21 02:53:00",
        "Headline": "Keith McAllister, 61, died after entering a room at an MRI clinic in New York while a scan was under way and being pulled into the machine.",
        "Content": " A man who died after being pulled into an MRI machine in New York was wearing a large weight-training chain around his neck, his wife has said. Keith McAllister, 61, entered a room at the Nassau Open MRI clinic while a scan of his wife's knee was under way. The machine's strong magnetic force drew him in by the 9kg metal chain around his neck, according to Nassau County Police. His wife, Adrienne Jones-McAllister, said she had called out to her husband to help her off the table. \"I yelled out Keith's name, [shouting] Keith, come help me up,\" she said in an interview with News 12 Long Island. She said her husband entered the room wearing the chain, which he uses for weight training. \"I saw the machine snatch him around and pull him into the machine,\" Ms Jones-McAllister said as tears streamed down her face. \"He died, he lost, he went limp in my arms.\" Police said that the accident last Wednesday \"resulted in a medical episode\" and left Mr McAllister in a critical condition in hospital. Ms Jones-McAllister said her husband had suffered a series of heart attacks after he was freed from the MRI machine. He was later pronounced dead. MRI stands for Magnetic Resonance Imaging. The machines use strong magnetic fields and radio waves to create detailed images of the inside of the body. Due to the magnetic fields, \"very powerful forces\" are exerted on objects made of iron, some steels, and other magnetic materials, the National Institute of Biomedical Imaging and Bioengineering says. It says the forces are \"strong enough to fling a wheelchair across the room\". Read more from Sky News:Trump diagnosed with chronic venous insufficiencyLA nightclub crowd crash may have been intentional, police say Sky News' US partner network NBC New York reported that MRI accidents are rare but can be fatal. It is not the first time someone has been killed by an MRI machine in New York. In 2001, six-year-old Michael Colombini died at the Westchester Medical Centre when an oxygen tank flew into the chamber, drawn in by the MRI's 10-ton electromagnet."
    },
    {
        "title": "Alaska Airlines grounds all flights after IT outage",
        "description": "Alaska Airlines temporarily grounded its planes following an IT outage.",
        "url": "https://news.sky.com/story/alaska-airlines-grounds-all-flights-after-it-outage-13399474",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-alaska-airlines-alaska_6969591.jpg?20250721054143",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-21 04:39:00",
        "Headline": "The carrier said it experienced the outage impacting its operations at around 8pm Pacific time on Sunday (4am Monday UK time).",
        "Content": "Alaska Airlines temporarily grounded its planes following an IT outage. The carrier said it experienced the outage impacting its operations at around 8pm Pacific time on Sunday (4am Monday UK time). It did not specify the nature of the outage. \"We requested a temporary, system-wide ground stop for Alaska and Horizon Air flights until the issue is resolved,\" the Seattle-based airline said in a statement. Horizon Air is the regional subsidiary operating Alaska Airlines flights. Alaska Airlines apologised for the ground stop of its flights and resumed operations hours later, but warned of \"residual impacts to our flights\". It will take some time to get our overall operations back to normal,\" it added in a social media post. Read more from Sky News:Man who died in MRI was wearing weight-lifting chainTrump diagnosed with chronic venous insufficiency Alaska Air Group maintains an operational fleet of 238 Boeing 737 aircraft and 87 Embraer 175 aircraft, according to its website. In June, Hawaiian Airlines, which is also owned by Alaska Air Group, said some of its IT systems were disrupted by a hack. The firm said it was still trying to determine the financial impact of the incident."
    },
    {
        "title": "Trade war: Is  August escalation on - or will Trump chicken out?",
        "description": "Donald Trump is clearly seething over the term 'TACO' (Trump always chickens out) - a phrase that has characterised financial market trading over the past few months.",
        "url": "https://news.sky.com/story/trade-war-is-august-escalation-on-or-will-trump-chicken-out-13399658",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-trump-trade-us-economy_6965912.png?20250716092126",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2025-07-21 12:00:00",
        "Headline": "Sky's James Sillars writes that optimism for further deals, similar to that for the UK, appears to be dimming but there is every reason to suspect that any tariff expansions from 1 August will be short-lived.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump is clearly seething over the term 'TACO' (Trump always chickens out) - a phrase that has characterised financial market trading over the past few months. It suggests that for all the president's bluster and threats during his on-off trade war to date, he rarely follows through. When asked by a reporter about TACO in late May, as his \"liberation day\" escalation remained on pause, he declared it a \"nasty\" question and said he wanted negotiations. Money latest: 'Biggest July house price drop in 20 years' Mr Trump wants a deal but to effectively bully America's trading partners into agreeing better terms. It's a playbook that has defined his time in the White House and, as things stand, more than 20 nations and territories, including Japan and South Korea, face heightened tariffs of up to 40% on their exports to the US from 1 August. Financial markets don't really believe it. Stock markets, for example, are still hovering near or at record levels in both the US and in Europe. The FTSE 100 closed above 9,000 points for the first time on Monday evening. TACO is ingrained in those values. \n                  Trump threatens to block Washington Commanders stadium deal unless they change name back to 'Redskins'\n                 \n                  Police Scotland threatened with potential legal action by own officers over Donald Trump visit plans\n                 \n                  What is chronic venous insufficiency? Symptoms and treatment after Trump diagnosed\n                 But are markets are in for a shock, especially when it comes to the fight with America's single largest trading partner, the European Union? It was created, Mr Trump has previously claimed, to \"screw\" the United States. It's fair to say there was great optimism in the EU earlier this month that a deal, similar to that agreed between the US and UK, was looming to avert the worst of a threatened 30% baseline tariff from 1 August.  But the mood music in Brussels changed at the back end of last week and now EU diplomats are even briefing that a broader range of retaliation measures is being considered beyond additional tariffs on US goods. The seriousness of this fight should not be underestimated. EU figures show trade in goods and services between the bloc and the US account for almost a third of all global trade, at a value in 2024 alone of €1.68trn (£1.45trn).  EU Trade Commissioner Maros Sefcovic has warned that a 30% tariff would \"practically prohibit\" the bloc's transatlantic trade, according to remarks via diplomats reported by the Reuters news agency. We're told that, even if time runs out, a truce could theoretically be agreed soon after 1 August. Much will depend on the EU's response. Does it go down the route taken by the UK and not retaliate, pending the conclusion of talks? There is growing pressure on Brussels to call Mr Trump's bluff.  The EU has a package of tariffs on €21bn of US goods ready to go from 6 August. An additional package is yet to be finalised. France is demanding US services are hit too, with even Germany now saying such an escalation should be considered. The so-called \"anti-coercion\" instrument, as it's known, would also potentially allow the bloc to limit US companies' access to financial service markets in the EU. So what happens after 1 August could be even more explosive. But there is every reason to believe that a tit-for-tat escalation is unlikely, at least for long. The very reason Donald Trump rowed back on his \"liberation day\" tariffs in April, allowing 90 days for talks, was likely the dire financial market reaction that followed news of the widespread duties. You have a president demanding interest rate cuts (at a time when inflation is on the rise due to the impact of tariffs) in a bid to boost flagging economic growth. Mr Trump says his trade war is all about boosting US manufacturing jobs but, at the end of the day, no powerbase of voters is going to accept a threat to the value of their investments for long. No big US company will stand by and see its sales suffer. TACO? It's a solid bet."
    },
    {
        "title": "Trump threatens to block Washington Commanders stadium deal unless they change name back to 'Redskins'",
        "description": "Donald Trump has threatened to block a stadium deal for the Washington Commanders unless they change their name back to the \"Redskins\".",
        "url": "https://news.sky.com/story/trump-threatens-to-block-washington-commanders-stadium-deal-unless-they-change-name-back-to-redskins-13399691",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-washington-commanders_6970008.jpg?20250721145526",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-21 13:04:00",
        "Headline": "The Washington Commanders announced in 2020 that they were \"retiring\" their old name and Native American head logo after decades of criticism. The term \"redskin\" is defined as an \"insulting and contemptuous term for an American Indian\".",
        "Content": "Donald Trump has threatened to block a stadium deal for the Washington Commanders unless they change their name back to the \"Redskins\". After years of playing in Maryland, the Commanders and the District of Columbia government agreed a deal earlier this year to build the American football team a new stadium at the site of the old RFK Stadium in Washington - where they played for more than three decades. However, the US president has now said he \"won't make a deal for\" the NFL team to move to a new ground unless they return to their former name. He posted on Truth Social on Sunday: \"The Washington 'Whatever's' should IMMEDIATELY change their name back to the Washington Redskins Football Team.\" Mr Trump also called for the Cleveland Guardians to revert their name to the \"Cleveland Indians\", and said: \"Our great Indian people, in massive numbers, want this to happen.\" He added later that he \"may put a restriction on\" the Commanders if they don't revert to the old the name, adding: \"I won't make a deal for them to build a Stadium in Washington. \"The Team would be much more valuable, and the Deal would be more exciting for everyone.\" \n                  Police Scotland threatened with potential legal action by own officers over Donald Trump visit plans\n                 \n                  Trade war: Is  August escalation on - or will Trump chicken out?\n                 \n                  What is chronic venous insufficiency? Symptoms and treatment after Trump diagnosed\n                 In the wake of the murder of George Floyd and racial justice protests in 2020, the Commanders announced that they were \"retiring\" their name and Native American head logo after decades of criticism.  A \"redskin\" is defined in the American Merriam-Webster dictionary as an \"insulting and contemptuous term for an American Indian\". Muriel Bowser, the mayor of DC, previously said the \"Redskins\" name was an \"obstacle\" to the team building a stadium in Washington. Currently, the team play at the Northwest Stadium in Landover, Maryland, which was known as the FedExField until 2024, and which is about nine miles (15km) east of the city centre. The old RFK stadium - which the new stadium would replace - was about three miles (5km) from the centre. Josh Harris, whose group bought the Commanders from former owner Dan Snyder in 2023, said in August last year that the team would not change their name back for \"obvious reasons\". The Commanders have not yet responded to Mr Trump's statement. Sky News has contacted the team for comment. Read more from Sky News:All we know about Trump and Epstein's 'friendship'Woman who killed her baby during COVID lockdown jailed The Cleveland Guardians also changed their name in 2021 in the wake of Mr Floyd's death and widespread protests. Chris Antonetti, the MLB team's president of baseball operations, said at a news conference on Sunday: \"We understand there are different perspectives on the decision we made a few years ago, but obviously it's a decision we made. \"We've got the opportunity to build a brand as the Guardians over the last four years and are excited about the future that's in front of us.\" Mr Trump's ability to constrain the deal to build a stadium in the District of Colombia is unclear. While president Joe Biden signed the bill in January transferring the land from the federal government to the district, DC residents elect a mayor, a city council and commissioners to run day-to-day operations and Congress maintains control of the city's budget."
    },
    {
        "title": "The wealth tax options Reeves could take to ease her fiscal bind",
        "description": "Faced with a challenging set of numbers, the chancellor is having to make difficult choices with political consequences.",
        "url": "https://news.sky.com/story/the-wealth-tax-options-reeves-could-take-to-ease-her-fiscal-bind-13399694",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-reeves-money-gfx-budget_6965910.png?20250716092001",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-07-21 13:00:00",
        "Headline": "Sky's Gurpreet Narwan says while there is support within Labour for a wealth tax, the government will be mindful to avoid a cash flight from the UK.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n  Faced with a challenging set of numbers, the chancellor is having to make difficult choices with political consequences. Tax rises and spending cuts are a hard sell. Now, some in her party are calling for a different approach: target the wealthy. Is there a way out of all of this for the chancellor? Economic growth is disappointing and spending pressures are mounting. The government was already examining ways to raise revenue when, earlier this month, Labour backbenchers forced the government to abandon welfare cuts and reinstate winter fuel payments - blowing a £6bn hole in the budget. The numbers are not adding up for Rachel Reeves, who is steadfastly committed to her fiscal rules. Short of more spending cuts, her only option is to raise taxes - taxes that are already at a generational high. For some in her party - including Lord Kinnock, the former Labour leader, the solution is simple: introduce a new tax.They say a flat wealth tax, targeting those with assets above £10m, could raise £12bn for the public purse. \n                  Most important part of chancellor's annual Mansion House speech was what wasn't said\n                 \n                  Chancellor Rachel Reeves considering 'changes' to ISAs - and says there's too much focus on 'risk' in investing\n                 \n                  Is there £15bn of wiggle room in Rachel Reeves's fiscal rules?\n                 Yet, the government is reportedly reluctant to pursue such a path. It is not convinced that wealth taxes will work. The evidence base is shaky and the debate over the efficacy of these types of taxes has divided the economics community.  Why are we talking about wealth? Wealth taxes are in the headlines but calls for this type of reform have been growing for some time. Proponents of the change point to shifts in our economy that will be obvious to most people living in Britain: work does not pay in the way it used to. At the same time wealth inequality has risen. The stock of wealth - that is the total value of everything owned - is much larger than our income, that is the total amount of money earned in a year. That disparity has been growing, especially during that era of low interest rates after 2008 that fuelled asset prices, while wages stagnated. It means the average worker will have to work for more years to buy assets, say a house, for example. Left-wing politicians and economists argue that instead of putting more pressure on workers - marginal income tax rates are as high as 70% for some workers - the government should instead target some of this accumulated wealth in order to balance the books.  The Inheritocracy At the heart of it all is a very straightforward argument about fairness. Few will argue that there aren't problems with the way our economy is functioning: that it is unfair that young people are struggling to buy homes and raise families. Proponents of a wealth tax say that it would not only raise revenue but create a fairer tax system. They argue that the wealth distortions are creating a divided society, where people's outcomes are determined by their inheritances. The gap is large. A typical 50-year old born to the poorest 20% of parents in the UK is already worth just a quarter of what someone born to the richest 20% of parents is worth at that age. This is before they inherit anything when their parents die. A lot of money is passed on earlier; for example, people may have had help buying their first home. That gap widens when the inheritance is passed on. This is when inheritance tax, one of the existing wealth taxes we have in the UK, kicks in. However, its impact in addressing that imbalance is negligible. Most people don't meet the threshold to pay it. The government could bring more people into the tax but it is already a deeply unpopular policy.  Alternatives So what other options could they explore? Lord Kinnock recently suggested a new tax on the stock of wealth - one to two percent on assets over £10m. That could raise between £12bn and £24bn. When making the case for the tax, Lord Kinnock told Sky News: \"That kind of levy does two things. One is to secure resources, which is very important in revenues. \"But the second thing it does is to say to the country, 'we are the government of equity'. This is a country which is very substantially fed up with the fact that whatever happens in the world, whatever happens in the UK, the same interests come out on top unscathed all the time while everybody else is paying more for getting services.\" However, there is a lot of scepticism about some of these numbers. Wealthier people tend to be more mobile and adept at arranging their tax affairs. Determining the value of their assets can be a challenge. In Downing Street, the fear is that they will simply leave, rendering the policy a failure. Policymakers are already fretting that a recent crackdown on non-doms will do the same. Critics point to countries where wealth taxes have been tried and repealed. Proponents say we should learn from their mistakes and design something better. Some say the government could start by improving existing taxes, such as capital gains tax - which people pay when they sell a second property or shares, for example. The Labour government has already raised capital gains tax rates but bringing them in line with income tax could raise £12bn. Then there is the potential for National Insurance contributions on investment income - such as rent from property or dividends. Estimates suggest that could bring in another £11bn. This is nothing to sniff at for a chancellor who needs to find tens of billions of pounds in order to balance her books. By the same token, she is operating on such fine margins that she can't afford to get the calculation wrong. There is no easy way out of this fiscal bind for Rachel Reeves. Whether wealth taxes are the solution or not, hers is a government that has promised reform and creative thinking. The tax system would be a good place to start."
    },
    {
        "title": "Compulsory water meters and regulator abolished - key recommendations from landmark report into 'broken' water industry",
        "description": "The system for regulating water companies in England and Wales should be overhauled and replaced with one single body in England and another in Wales, a once-in-a-generation review of the sector has advised.",
        "url": "https://news.sky.com/story/broken-water-industry-set-to-be-overhauled-nine-key-recommendations-from-landmark-report-13399475",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-water-tap_6935268.jpg?20250605165723",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-07-21 05:50:00",
        "Headline": "Major recommendations also include the ability to block company takeovers and taking a more interventionist approach to regulation. But nationalisation was excluded. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n  The system for regulating water companies in England and Wales should be overhauled and replaced with one single body in England and another in Wales, a once-in-a-generation review of the sector has advised. The report, which includes 88 recommendations, suggests a new single integrated regulator to replace existing water watchdogs, mandatory water metering, and a social tariff for vulnerable customers. The ability to block companies being taken over and the creation of eight new regional water authorities, with another for all of Wales to deliver local priorities, has also been suggested. Follow latest: 'This is our Great Stink moment', water report author says The review, the largest into the water industry since privatisation in the 1980s, was undertaken by Sir Jon Cunliffe, a career civil servant and former deputy governor of the Bank of England who oversaw the biggest clean-up of Britain's banking system in the wake of the financial crash. The government confirmed at a news conference on Monday that Ofwat will be abolished as part of an overhaul of a \"broken\" water regulation system. Sir Jon was coaxed out of retirement by Environment Secretary Steve Reed to lead the Independent Water Commission. Final recommendations of the commission have been published on Monday morning to clean up the sector and improve public confidence, as bills rise 36% over the next five years. Here are its nine key recommendations: • Single integrated water regulators - a single water regulator in England and a single water regulator in Wales. In England, this would replace Ofwat, the Drinking Water Inspectorate and water-environment related functions from the Environment Agency and Natural England. In Wales, Ofwat's economic responsibilities would be integrated into Natural Resources Wales. It's hoped this will solve the \"fragmented and overlapping\" regulation, and more stable regulation will improve investor confidence. Communications regulator Ofcom was given as an example of how combining five existing regulators into one worked. • Eight new regional water system planning authorities in England and one national authority in Wales to be responsible for water investment plans reflecting local priorities and streamlining the planning processes. The new authorities would be independent, made up of representatives from local councils, public health officials, environmental advocates, agricultural voices and consumers. The aim is they could direct funding and ensure accountability from all sectors impacting water. • Greater consumer protection - this includes upgrading the consumer body Consumer Council for Water, into an Ombudsman for Water to give stronger protection to customers and a clearer route to resolving complaints. Advocacy duties are to be transferred to Citizens Advice. • Stronger environmental regulation, including compulsory water meters. Also proposed by Sir Jon are changes to wholesale tariffs for industrial users and greater water reuse and rainwater harvesting schemes. A new long-term, legally binding target for the water environment was suggested. • Oversight of companies via the ability to block changes in ownership of water businesses when they are not seen to be prioritising the long-term interests of the company and its customers, and the addition of \"public benefit\" clauses in water company licences. To boost company financial resilience, as the UK's biggest provider, Thames Water struggles to remain in private ownership, the commission has recommended minimum financial requirements, like banks are subject to. This could mean utilities hold a certain amount of cash. It's hoped this will, in turn, make companies more appealing to potential investors. • The public health element of water has been recognised, and senior public health representation has been recommended for regional water planning authorities, as have new laws to address pollutants like forever chemicals and microplastics. • Fundamental reset of economic regulation - including changes to ensure companies are investing in and maintaining assets to help attract long-term, low-risk investment. A \"supervisory\" approach has been recommended to intervene before things like pollution occur, rather than penalising the businesses after the event. • Clear strategic direction - a long-term, 25-year national water strategy should be published by the UK and Welsh governments, with ministerial priorities given to water firms every five years. • Infrastructure and asset health reforms - companies should also be required to map and assess their assets and resilience. Nationalisation of the water industry was not in the Independent Water Commission's terms of reference and so was not considered. Sir Jon said the report has \"tried to attack the problem from all sides\". He warned that bills are going to rise by 30% over the next five years. \"There are some inescapable facts here,\" he said. \"The cost of producing water and dealing with our wastewater is going up.\" How has the report been received? In a speech responding to Sir Jon's report, Mr Reed said he was abolishing Ofwat. The water industry lobby group Water UK said \"fundamental change has been long overdue\". \"These recommendations should establish the foundations to secure our water supplies, support economic growth and end sewage entering our rivers and seas,\" a spokesperson said. \"The Independent Water Commission has written a comprehensive, detailed review of the whole sector, with many wide-ranging and ambitious recommendations. \"Crucially, it is now up to government to decide which recommendations it will adopt, and in what way, but the commission's work marks a significant step forward.\" Business and economics correspondent Sir Jon Cunliffe's review of the water sector is comprehensive, clear-eyed, and about as radical as allowed by terms of reference that explicitly ruled out renationalisation of England's private water and sewage companies. With that key demand of many campaigners off the table, the former Bank of England governor has focused on more effective regulation and securing a better deal for consumers and the investors without whom the industry will sink. So Ofwat, the embattled current regulator, is to be swept away on the tide of public anger at sewage outflows and shareholder dividends, and the disgruntlement of all its stakeholders. Having succeeded in its primary aim of keeping consumer bills down, it is now a victim of the consequences: a shortage of investment in infrastructure and a failure to apply similar rigour to shareholder dividends and executive pay. While campaigners and customers say it has failed to hold companies to account, the companies complain they are too tightly controlled to attract investment. Ofwat privately points out it can only apply the powers and political direction it is given - but the new government, going with the flow of angry voters, will not hesitate to pull the chain. Read more here Campaign group Surfers Against Sewage said the report \"utterly fails to prioritise public benefit over private profit\". \"This is not transformational reform, this is putting lipstick on a pig - and you can bet the champagne is flowing in water company boardrooms across the land,\" said its chief executive, Giles Bristow. \"Only one path forward remains: a full, systemic transformation that ends the ruthless pursuit of profit and puts the public good at the heart of our water services,\" he said. \"We welcome Sir Jon's calls for a national strategy, enshrining public health objectives in law and regional water planning. But we won't be taken for fools - abolishing Ofwat and replacing it with a shinier regulator won't stop sewage dumping or profiteering if the finance and ownership structures stay the same.\" Environmentalist Feargal Sharkey told Sky News, \"we were promised champagne, what we got was a glass of sour milk\". The regulator Ofwat said, it will now work with the government and the other regulators to form the new regulatory body in England, and \"to contribute to discussions on the options for Wales set out in the report\". \"In advance of the creation of the new body, we will continue to work hard within our powers to protect customers and the environment and to discharge our responsibilities under the current regulatory framework. We will also work collaboratively with all our stakeholders to ensure a smooth transition.\""
    },
    {
        "title": "Ofwat to be swept away on tide of public anger over sewage spills",
        "description": "Sir Jon Cunliffe's review of the water sector is comprehensive, clear-eyed, and about as radical as allowed by terms of reference that explicitly ruled out renationalisation of England's private water and sewage companies.",
        "url": "https://news.sky.com/story/ofwat-to-be-swept-away-on-tide-of-public-anger-over-sewage-spills-13399527",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sewage-pipe-river_6967947.jpg?20250718165159",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-07-21 07:55:00",
        "Headline": "A new regulator will have control over environmental and economic standards, which has to be better than the current division between three different bodies, and may help define targets and priorities for the industry.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Sir Jon Cunliffe's review of the water sector is comprehensive, clear-eyed, and about as radical as allowed by terms of reference that explicitly ruled out renationalisation of England's private water and sewage companies. With that key demand of many campaigners off the table, the former Bank of England deputy governor has focused on more effective regulation and securing a better deal for consumers and the investors without whom the industry will sink. So Ofwat, the embattled current regulator, is to be swept away on the tide of public anger at sewage outflows and shareholder dividends, and the disgruntlement of all its stakeholders. Money blog: Funeral director on why she speaks to dead people  Having succeeded in its primary aim of keeping consumer bills down, it is now a victim of the consequences: a shortage of investment in infrastructure and a failure to apply similar rigour to shareholder dividends and executive pay. While campaigners and customers say it has failed to hold companies to account, the companies complain they are too tightly controlled to attract investment. Ofwat privately points out it can only apply the powers and political direction it is given - but the new government, going with the flow of angry voters, will not hesitate to pull the chain. \n                  Compulsory water meters and regulator abolished - key recommendations from landmark report into 'broken' water industry\n                 \n                  Labour will eliminate unauthorised sewage spillages in a decade, environment secretary says\n                 \n                  Why aquatic life is facing a double whammy as sewage overflows spill into rivers amid heavy rain\n                  The new regulator that follows will have control over environmental as well as economic standards, which has to be better than the current division between three different bodies, and may help define targets and priorities for the industry, like cutting sewage outflows in half by 2030. But to deliver those targets, water companies need to be both sustainable and financially attractive.  Like it or not, that means paying a return to investors, a fact that Sir Jon, a veteran of the financial crisis, does not attempt to hide. Read more from Sky News:Police search for missing woman last seen at petrol stationOne of UK's busiest train stations issues 'do not travel' warning So while there will be tougher powers to vet and even block potential company owners, he wants to create a low-risk, low-return environment for investors who currently see better returns elsewhere without any of the political and public heat that comes with water."
    },
    {
        "title": "Trade war: Is  August escalation on - or will Trump chicken out?",
        "description": "Donald Trump is clearly seething over the term 'TACO' (Trump always chickens out) - a phrase that has characterised financial market trading over the past few months.",
        "url": "https://news.sky.com/story/trade-war-is-august-escalation-on-or-will-trump-chicken-out-13399658",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-trump-trade-us-economy_6965912.png?20250716092126",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-07-21 12:00:00",
        "Headline": "Sky's James Sillars writes that optimism for further deals, similar to that for the UK, appears to be dimming but there is every reason to suspect that any tariff expansions from 1 August will be short-lived.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump is clearly seething over the term 'TACO' (Trump always chickens out) - a phrase that has characterised financial market trading over the past few months. It suggests that for all the president's bluster and threats during his on-off trade war to date, he rarely follows through. When asked by a reporter about TACO in late May, as his \"liberation day\" escalation remained on pause, he declared it a \"nasty\" question and said he wanted negotiations. Money latest: 'Biggest July house price drop in 20 years' Mr Trump wants a deal but to effectively bully America's trading partners into agreeing better terms. It's a playbook that has defined his time in the White House and, as things stand, more than 20 nations and territories, including Japan and South Korea, face heightened tariffs of up to 40% on their exports to the US from 1 August. Financial markets don't really believe it. Stock markets, for example, are still hovering near or at record levels in both the US and in Europe. The FTSE 100 closed above 9,000 points for the first time on Monday evening. TACO is ingrained in those values. \n                  Trump threatens to block Washington Commanders stadium deal unless they change name back to 'Redskins'\n                 \n                  Police Scotland threatened with potential legal action by own officers over Donald Trump visit plans\n                 \n                  What is chronic venous insufficiency? Symptoms and treatment after Trump diagnosed\n                 But are markets are in for a shock, especially when it comes to the fight with America's single largest trading partner, the European Union? It was created, Mr Trump has previously claimed, to \"screw\" the United States. It's fair to say there was great optimism in the EU earlier this month that a deal, similar to that agreed between the US and UK, was looming to avert the worst of a threatened 30% baseline tariff from 1 August.  But the mood music in Brussels changed at the back end of last week and now EU diplomats are even briefing that a broader range of retaliation measures is being considered beyond additional tariffs on US goods. The seriousness of this fight should not be underestimated. EU figures show trade in goods and services between the bloc and the US account for almost a third of all global trade, at a value in 2024 alone of €1.68trn (£1.45trn).  EU Trade Commissioner Maros Sefcovic has warned that a 30% tariff would \"practically prohibit\" the bloc's transatlantic trade, according to remarks via diplomats reported by the Reuters news agency. We're told that, even if time runs out, a truce could theoretically be agreed soon after 1 August. Much will depend on the EU's response. Does it go down the route taken by the UK and not retaliate, pending the conclusion of talks? There is growing pressure on Brussels to call Mr Trump's bluff.  The EU has a package of tariffs on €21bn of US goods ready to go from 6 August. An additional package is yet to be finalised. France is demanding US services are hit too, with even Germany now saying such an escalation should be considered. The so-called \"anti-coercion\" instrument, as it's known, would also potentially allow the bloc to limit US companies' access to financial service markets in the EU. So what happens after 1 August could be even more explosive. But there is every reason to believe that a tit-for-tat escalation is unlikely, at least for long. The very reason Donald Trump rowed back on his \"liberation day\" tariffs in April, allowing 90 days for talks, was likely the dire financial market reaction that followed news of the widespread duties. You have a president demanding interest rate cuts (at a time when inflation is on the rise due to the impact of tariffs) in a bid to boost flagging economic growth. Mr Trump says his trade war is all about boosting US manufacturing jobs but, at the end of the day, no powerbase of voters is going to accept a threat to the value of their investments for long. No big US company will stand by and see its sales suffer. TACO? It's a solid bet."
    },
    {
        "title": "£104bn of water industry investment will come from bill payers, environment secretary concedes",
        "description": "Steve Reed has conceded that the bulk of the &#163;104bn of water industry investment which he boasts Labour has attracted since coming to office will come from bill payers.",
        "url": "https://news.sky.com/story/163104bn-of-water-industry-investment-will-come-from-bill-payers-environment-secretary-concedes-13399597",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-discharge-river-mersey_6969760.jpg?20250721134752",
        "type": "Business",
        "Author": "Sam Coates",
        "Date Published": "2025-07-21 10:08:00",
        "Headline": "The government has generated £104bn in private investment and industry has already started spending it. The money will be recouped over the coming decades.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Steve Reed has conceded that the bulk of the £104bn of water industry investment which he boasts Labour has attracted since coming to office will come from bill payers. In an interview with Sky News, the environment secretary sought to blame the previous Tory government for a string of high profile investors walking away from the sector over the last year. Mr Reed does not accept claims that further threats to jail water bosses and promises to curb price rises have deterred investment. Instead, he told Sky News that \"by bringing in the £104bn of private sector investment that we secured at the end of last year, we can make sure that the investment is going in to support\" the industry. When challenged that the £104bn was total expenditure not total investment, and that bill payers would pay back this expenditure over the coming decades, Mr Reed conceded this was right - and the money ultimately is coming from bill payers. \"The money comes in from investors up front so we can do that spending straight away,\" he said. \"Over decades, the investors got a modest return from the bills that customers are paying. That's how investment works.\" Some investors have warned they do not think it viable to fund the UK water sector because of the hostile political tone of ministers and lack of certainty. Ministers have said the government does not want to renationalise water as it would mean years of legal wrangling and cost a lot of money.  Labour has launched a record 81 criminal investigations into water companies over sewage dumping since winning the election last year. Water company bosses could be jailed for up to five years and the companies fined hundreds of millions of pounds if they are found guilty. Mr Reed committed to not interfering with those prosecutions, saying it would be \"highly inappropriate\" for any minister to do so. Read more:Key recommendations from the water reportLabour to eliminate unauthorised sewage spillages in 10 years He rejected suggestions ministers will be pressured to ensure water bosses do not serve jail time as this will deter investors. \"It's a judicial process, it would be highly inappropriate for any ministerial interference in the process,\" Mr Reed said. \"They will work their way through the court system, as they should do, and ministers will decide on sanctions after.\""
    },
    {
        "title": "Wise co-founder seeks talks with proxy advisers in US listing row",
        "description": "A co-founder of Wise wants the world's most influential corporate voting advisory firms to change their judgements on plans that would cement control of the money-transfer service in the hands of a small band of investors for another decade.",
        "url": "https://news.sky.com/story/wise-co-founder-seeks-talks-with-proxy-advisers-in-us-listing-row-13399667",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-wise-bank_6969917.jpg?20250721132310",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-21 12:12:00",
        "Headline": "Taavet Hinrikus, who owns over 5% of the £9bn fintech, wants Glass Lewis and ISS to warn investors about plans to extend its dual-class structure until 2036, he tells Sky News.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A co-founder of Wise wants the world's most influential corporate voting advisory firms to change their judgements on plans that would cement control of the money-transfer service in the hands of a small band of investors for another decade. Sky News has learnt that Taavet Hinrikus, who alongside current chief executive Kristo Kaarmann launched the company in 2011, is to press Glass Lewis and Institutional Shareholder Services (ISS) - whose recommendations carry significant sway among institutional investors - to advise Wise's shareholders to oppose plans to extend its dual-class shares until 2036. The row has arisen amid plans for Wise to shift its primary listing to New York, where dual-class ownership structures are far more common. Money latest: Why boxing fans are demanding refunds The structure was put in place in 2021, when Wise floated in London with a pledge that it would revert to a single class of shares five years after its stock market debut. Mr Hinrikus's ownership vehicle - Skaala Investments - holds just over 5.1% of Wise's shares, a stake worth roughly £450m at the current stock price. As a result of its ownership of Class B shares, Skaala also holds roughly 11% of Wise's voting rights. \n                  The wealth tax options Reeves could take to ease her fiscal bind\n                 \n                  Compulsory water meters and regulator abolished - key recommendations from landmark report into 'broken' water industry\n                 \n                  Ofwat to be swept away on tide of public anger over sewage spills\n                 Speaking exclusively to Sky News, Mr Hinrikus said he was \"disappointed that neither Glass Lewis nor ISS have flagged this important governance issue\". \"We are keen to discuss this with them and for them to revise their reports ahead of the vote.\" Mr Hinrikus has been angered by Wise's refusal to separate the questions of the US listing and the dual-class voting structure into distinct resolutions at its forthcoming general meeting to approve the move. In a statement issued more widely on Monday, Skaala said \"this material governance change was not clearly disclosed to Wise's share owners\". Read more from Sky News:Key recommendations from landmark report into 'broken' water industryBT in talks to dial up successor to veteran finance chief It was unclear which other shareholders in Wise were unhappy at the company's approach. Wise said: \"The dual-class share structure is essential to ensuring our continued successful performance.\""
    },
    {
        "title": "Usyk v Dubois fight: Boxing fans complain heavyweight title clash was plagued with 'buffering issues' on DAZN",
        "description": "Boxing fans are demanding refunds after their DAZN stream of the heavyweight world title fight was ruined by \"constant buffering\" issues.&#160;",
        "url": "https://news.sky.com/story/usyk-v-dubois-fight-boxing-fans-complain-heavyweight-title-clash-was-plagued-with-buffering-issues-on-dazn-13399737",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-usyk-boxing_6970069.jpg?20250721160046",
        "type": "Business",
        "Author": "Jess Sharp",
        "Date Published": "2025-07-21 14:47:00",
        "Headline": "Customers have complained about DAZN's coverage of the fight - here we speak to a consumer expert about how to get your money back if you've suffered the same problem.",
        "Content": "\n          Money live reporter\n              @JournoJess97\n Boxing fans are demanding refunds after their DAZN stream of the heavyweight world title fight was ruined by \"constant buffering\" issues.  Oleksandr Usyk stopped Daniel Dubois in the fifth round of Saturday night's fight, delivering a vicious punch that knocked his rival's gum shield out of his mouth. The epic moment secured the Ukrainian the undisputed world heavyweight champion title, but some fans missed it due to problems with the stream. Read all the latest Money news here 'They're denying anything was wrong' \"£25 to watch the boxing and all I got was constant buffering! Even missed the knockout punch. How do I get a refund for a service not received?\" one customer wrote on X. \"This will definitely be the first and last fight I watch on DAZN. The buffering and quality makes it unwatchable. What a shite service,\" said another. \n                  Ukraine's Oleksandr Usyk beats Daniel Dubois to become undisputed heavyweight champion for a second time\n                 \n                  Chris Eubank Jr taken to hospital after defeating Conor Benn by unanimous decision in middleweight clash\n                 \n                  'Bad times': Eubank Jr reveals conversation with father about attending Benn fight\n                 Some even called for fans to complain to the media regulator, Ofcom, about the poor service. \"They're [DAZN] refusing refunds and denying anything was wrong at their end (despite hundreds of complaints on Twitter with the exact same issues). We have complained to Ofcom. Only takes a few minutes,\" one customer said. The Money team spoke to several others who had suffered similar issues and had been refused refunds. John, 38, from Essex told us: \"The stream for the pay-per-view event was really poor, constantly buffering, sound cutting out and the picture being cut off completely. It was literally unwatchable. \"I raised the issue with DAZN yesterday and their response was an abrupt 'you're not entitled to a refund'. The best they could offer was to cancel my free 7-day trial, which I could do with a click of a button. \"This was the first time I have ever used DAZN and will not be doing it again. I think it's disgusting, to be honest, as the stream was virtually unwatchable. I am sympathetic when things go wrong but the right thing to do is refund me if I wasn't provided the service I was promised.\" Some customers said DAZN told them there was no issue with its stream, implying the problem was with the customer's own internet or TV services. On X, the company told people to follow five steps to try to get it fixed. \"Please follow the below-mentioned steps without skipping. \"1. Force restart the device. 2. Uninstall the app. 3. Update and Restart the device. 4. Reinstall the app. 5. Internet speed, try to stream on another device. If the issue persists, please DM us.\" 'Unable to process refunds' Some fans did follow up with a direct message, but were told that DAZN's policy means it is \"unable to process refunds for streaming issues even when evidence is provided\". \"I truly appreciate you sharing your experience and feedback. We will improve the service in the future,\" a company representative replied. We have contacted DAZN for comment. The streaming platform, which is the broadcast partner of boxing promoter Eddie Hearn's Matchroom, allows people to pay for a subscription to its services or a one-off fee for a particular event. It costs £14.99 a month for a 12-month deal, £24.99 a month to cancel anytime or £119.99 for an annual pass, with the Usyk v Dubois fight setting people back £24.99. This isn't the first time customers have complained about DAZN's poor service. It has received bad publicity for similar issues in the past, particularly during the highly anticipated Fury v Usyk fight last year. What should you do next if you want money back?  Consumer champion Scott Dixon, AKA the Complaints Resolver, said customers should raise a chargeback to get their money back if DAZN refuses to issue refunds. \"With so many people affected, this was clearly a widespread issue and DAZN cannot rely on a standard fob off citing there were no issues and blaming customers' internet when it's been widely reported that tens of thousands of viewers had issues,\" he told Money. He said the issue wasn't a minor glitch and instead was a \"failure to deliver the service viewers have paid for\". \"Evidence is crucial on these types of complaints. Provide links to media articles that evidence it was a widespread issue, screenshots of social media posts and time-stamped screen recordings if you have them,\" he said. \"Push hard and cite it's a clear 'breach of contract' under Section 49 of the Consumer Rights Act 2015, as the provider failed to perform the service with reasonable care and skill.\" Have you been affected by this issue? Tell us about your experiences by emailing money@sky.uk."
    },
    {
        "title": "BT in talks to dial up successor to veteran finance chief",
        "description": "BT Group is scouring for a new finance chief to succeed the veteran executive who joined the FTSE-100 telecoms company nearly a decade ago.",
        "url": "https://news.sky.com/story/bt-in-talks-to-dial-up-successor-to-veteran-finance-chief-13399560",
        "image_url": "https://e3.365dm.com/20/01/1920x1080/skynews-bt-british-telecom_4902558.jpg?20200126144559",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-21 09:07:00",
        "Headline": "The FTSE-100 telecoms company is working with headhunters to recruit a chief financial officer to replace Simon Lowth, who is to retire within a year, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n BT Group is scouring for a new finance chief to succeed the veteran executive who joined the FTSE-100 telecoms company nearly a decade ago. Sky News has learnt that Simon Lowth, who joined from BG Group in 2016, is preparing to step down in the next 12 months. Industry sources said that Allison Kirkby, who became BT's chief executive last year, had begun meeting candidates to succeed Mr Lowth. An appointment could come later this year, they added. Money blog: Funeral director on why she speaks to dead people The identities of the contenders to replace Mr Lowth were unclear on Monday. Mr Lowth's retirement will come with Deutsche Telekom and the Indian billionaire Sunil Bharti Mittal collectively holding more than a third of BT's shares. Their respective intentions towards their stakes may help shape the company's medium-term future, with Openreach - BT's infrastructure arm - accelerating its rollout of full-fibre broadband across the UK. BT said: \"As part of its business-as-usual activity, the BT board undertakes regular succession planning to ensure it is preparing appropriately for the future.\" Read more from Sky News:Key recommendations from landmark report into 'broken' water industryLakeland-owner Hilco eyes swoop for stricken jeweller Claire'sEY partner in talks to become boss of new football regulator The company declined to comment on details of the process to identify Mr Lowth's successor. On Monday morning, shares in BT were trading at about 198.7p, giving it a market value of about £20bn."
    },
    {
        "title": "Pressure grows to leave 'mad' Aarhus Convention used to block UK building projects",
        "description": "Pressure is growing to renegotiate or leave an international convention blamed for slowing building projects and increasing costs after a judge warned campaigners they are in danger of \"the misuse of judicial review\". ",
        "url": "https://news.sky.com/story/pressure-grows-to-leave-mad-aarhus-convention-used-to-block-uk-building-projects-13399877",
        "image_url": "https://e3.365dm.com/21/07/1920x1080/skynews-building-construction_5462675.jpg?20210730114658",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-07-21 20:49:00",
        "Headline": "Shadow justice secretary Robert Jenrick says if the convention can't be reformed, the UK should \"absolutely should think about leaving because what we've got to do is put the interest of the British public first\".",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Pressure is growing to renegotiate or leave an international convention blamed for slowing building projects and increasing costs after a judge warned campaigners they are in danger of \"the misuse of judicial review\".  Under the Aarhus Convention, campaigners who challenge projects on environmental grounds but then lose in court against housing and big infrastructure have their costs above £10,000 capped and the rest met by the taxpayer. Government figures say this situation is \"mad\" but ministers have not acted, despite promising to do so for months. The Tories are today leading the call for change with a demand to reform or leave the convention. In March, Sky News revealed how a computer scientist from Norfolk had challenged a carbon capture and storage project attached to a gas-fired power station on multiple occasions. Andrew Boswell took his challenge all the way the appeal court, causing delays of months at a cost of over £100m to the developers. In May, the verdict handed down by the Court of Appeal was scathing about Dr Boswell's case. \n                  Politics latest: Starmer explains how he plans to make people 'better off'\n                 \n                  The wealth tax options Reeves could take to ease her fiscal bind\n                 \n                  President Bush determined to 'rid world of evil-doer Saddam Hussein', new records reveal\n                 \"Dr Boswell's approach is, we think, a classic example of the misuse of judicial review in order to continue a campaign against a development… once a party has lost the argument on the planning merits,\" wrote the judges. They added: \"Such an approach is inimical to the scheme enacted by parliament for the taking of decisions in the public interest,\" adding his case \"betrays a serious misunderstanding of the decision of the Supreme Court\" and \"the appeal must therefore be rejected\". Another case - against a housing development in a series of fields in Cranbrook, Kent - was thrown out by judges in recent weeks. The case was brought by CPRE Kent, the countryside challenge, to preserve a set of fields between two housing developments alongside an area of outstanding natural beauty. John Wotton, from CPRE Kent, suggested it would have been hard to bring the challenge without the costs being capped. \"We would've had to think very carefully about whether we could impose that financial risk on the charity,\" he told Sky News. After his case was dismissed, Berkeley Homes said the situation was \"clearly absurd and highlights how incredibly slow and uncertain our regulatory system has become\". They added: \"We welcome the government's commitment to tackle the blockages which stop businesses from investing and frustrate the delivery of much needed homes, jobs and growth. \"We need to make the current system work properly so that homes can actually get built instead of being tied-up in bureaucracy by any individual or organisation who wants to stop them against the will of the government.\" 'Reform could breach international law' Around 80 cases a year are brought under the Aarhus Convention, Sky News has learned. The way Britain interprets Aarhus is unique as a result of the UK's distinctive legal system and the loser pays principle. Barrister Nick Grant, a planning and environment expert who has represented government and campaigns, said the convention means more legally adventurous claims. \"What you might end up doing is bringing a claim on more adventurous grounds, additional grounds, running points - feeling comfortable running points - that you might not have otherwise run. \"So it's both people bringing claims, but also how they bring the claims, and what points they run. This cap facilitates it basically.\" However, Mr Grant said that it would be difficult to reform: \"Fundamentally, the convention is doing what it was designed to do, which is to facilitate access to justice. \"And it then becomes a question for the policymakers as to what effect is this having and do we want to maintain that? It will be difficult for us to reform it internally without being in breach of our international law obligations\" In March, Sky News was told Number 10 is actively looking at the convention. Multiple figures in government have said the situation with Britain's participation in the Aarhus Convention is \"mad\" but Sky News understands nothing of significance is coming on this subject. Read more from Sky News:Compensation scheme for blood scandal widenedGovernment to review state pension age The Tories, however, want action. Robert Jenrick, shadow justice secretary and former housing minister, said the Tories would reform or leave the convention. He told Sky News: \"I think the country faces a choice. Do we want to get the economy firing on all cylinders or not? \"We've got to reform the planning system and we've got to ensure that judicial review... is not used to gum up the system and this convention is clearly one of the issues that has to be addressed. \"We either reform it, if that's possible. I'm very sceptical because accords like this are very challenging and it takes many many years to reform them. \"If that isn't possible, then we absolutely should think about leaving because what we've got to do is put the interest of the British public first.\" Mr Jenrick also attacked the lawyers who work on Aarhus cases on behalf of clients. \"A cottage industry has grown. In fact, it's bigger than a cottage industry,\" he said. \"There are activist lawyers with campaign groups who are now, frankly, profiteering from this convention. And it is costing the British taxpayer a vast amount of money. These lawyers are getting richer. The country is getting poorer.\""
    },
    {
        "title": "The wealth tax options Reeves could take to ease her fiscal bind",
        "description": "Faced with a challenging set of numbers, the chancellor is having to make difficult choices with political consequences.",
        "url": "https://news.sky.com/story/the-wealth-tax-options-reeves-could-take-to-ease-her-fiscal-bind-13399694",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-reeves-money-gfx-budget_6965910.png?20250716092001",
        "type": "Politics",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-07-21 13:00:00",
        "Headline": "Sky's Gurpreet Narwan says while there is support within Labour for a wealth tax, the government will be mindful to avoid a cash flight from the UK.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n  Faced with a challenging set of numbers, the chancellor is having to make difficult choices with political consequences. Tax rises and spending cuts are a hard sell. Now, some in her party are calling for a different approach: target the wealthy. Is there a way out of all of this for the chancellor? Economic growth is disappointing and spending pressures are mounting. The government was already examining ways to raise revenue when, earlier this month, Labour backbenchers forced the government to abandon welfare cuts and reinstate winter fuel payments - blowing a £6bn hole in the budget. The numbers are not adding up for Rachel Reeves, who is steadfastly committed to her fiscal rules. Short of more spending cuts, her only option is to raise taxes - taxes that are already at a generational high. For some in her party - including Lord Kinnock, the former Labour leader, the solution is simple: introduce a new tax.They say a flat wealth tax, targeting those with assets above £10m, could raise £12bn for the public purse. \n                  Most important part of chancellor's annual Mansion House speech was what wasn't said\n                 \n                  Chancellor Rachel Reeves considering 'changes' to ISAs - and says there's too much focus on 'risk' in investing\n                 \n                  Is there £15bn of wiggle room in Rachel Reeves's fiscal rules?\n                 Yet, the government is reportedly reluctant to pursue such a path. It is not convinced that wealth taxes will work. The evidence base is shaky and the debate over the efficacy of these types of taxes has divided the economics community.  Why are we talking about wealth? Wealth taxes are in the headlines but calls for this type of reform have been growing for some time. Proponents of the change point to shifts in our economy that will be obvious to most people living in Britain: work does not pay in the way it used to. At the same time wealth inequality has risen. The stock of wealth - that is the total value of everything owned - is much larger than our income, that is the total amount of money earned in a year. That disparity has been growing, especially during that era of low interest rates after 2008 that fuelled asset prices, while wages stagnated. It means the average worker will have to work for more years to buy assets, say a house, for example. Left-wing politicians and economists argue that instead of putting more pressure on workers - marginal income tax rates are as high as 70% for some workers - the government should instead target some of this accumulated wealth in order to balance the books.  The Inheritocracy At the heart of it all is a very straightforward argument about fairness. Few will argue that there aren't problems with the way our economy is functioning: that it is unfair that young people are struggling to buy homes and raise families. Proponents of a wealth tax say that it would not only raise revenue but create a fairer tax system. They argue that the wealth distortions are creating a divided society, where people's outcomes are determined by their inheritances. The gap is large. A typical 50-year old born to the poorest 20% of parents in the UK is already worth just a quarter of what someone born to the richest 20% of parents is worth at that age. This is before they inherit anything when their parents die. A lot of money is passed on earlier; for example, people may have had help buying their first home. That gap widens when the inheritance is passed on. This is when inheritance tax, one of the existing wealth taxes we have in the UK, kicks in. However, its impact in addressing that imbalance is negligible. Most people don't meet the threshold to pay it. The government could bring more people into the tax but it is already a deeply unpopular policy.  Alternatives So what other options could they explore? Lord Kinnock recently suggested a new tax on the stock of wealth - one to two percent on assets over £10m. That could raise between £12bn and £24bn. When making the case for the tax, Lord Kinnock told Sky News: \"That kind of levy does two things. One is to secure resources, which is very important in revenues. \"But the second thing it does is to say to the country, 'we are the government of equity'. This is a country which is very substantially fed up with the fact that whatever happens in the world, whatever happens in the UK, the same interests come out on top unscathed all the time while everybody else is paying more for getting services.\" However, there is a lot of scepticism about some of these numbers. Wealthier people tend to be more mobile and adept at arranging their tax affairs. Determining the value of their assets can be a challenge. In Downing Street, the fear is that they will simply leave, rendering the policy a failure. Policymakers are already fretting that a recent crackdown on non-doms will do the same. Critics point to countries where wealth taxes have been tried and repealed. Proponents say we should learn from their mistakes and design something better. Some say the government could start by improving existing taxes, such as capital gains tax - which people pay when they sell a second property or shares, for example. The Labour government has already raised capital gains tax rates but bringing them in line with income tax could raise £12bn. Then there is the potential for National Insurance contributions on investment income - such as rent from property or dividends. Estimates suggest that could bring in another £11bn. This is nothing to sniff at for a chancellor who needs to find tens of billions of pounds in order to balance her books. By the same token, she is operating on such fine margins that she can't afford to get the calculation wrong. There is no easy way out of this fiscal bind for Rachel Reeves. Whether wealth taxes are the solution or not, hers is a government that has promised reform and creative thinking. The tax system would be a good place to start."
    },
    {
        "title": "President Bush determined to 'rid world of evil-doer Saddam Hussein', new records reveal",
        "description": "It would have been \"politically impossible\" to stop President Bush from invading Iraq, as he believed he was on a \"crusade against evil\", new records show.",
        "url": "https://news.sky.com/story/president-bush-determined-to-rid-world-of-evil-doer-saddam-hussein-new-records-reveal-13399625",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-tony-blair-george-bush_6969899.jpg?20250721130626",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-21 11:21:00",
        "Headline": "Newly released government files show the US president believed he was on a \"crusade against evil\", in the months before the invasion of Iraq.",
        "Content": "It would have been \"politically impossible\" to stop President Bush from invading Iraq, as he believed he was on a \"crusade against evil\", new records show. Newly declassified UK government files show Sir Tony Blair was warned by his US ambassador that George W Bush was determined to overthrow dictator Saddam Hussein, in the months before the invasion of Iraq. Sir Tony, who was prime minister at the time, was trying to encourage the US president to use diplomatic means to change the situation in the Middle Eastern country, and flew to Camp David in January 2003 to make the case, just two months before the joint US-UK invasion. The UK government was also hoping the United Nations Security Council would agree a new resolution specifically authorising the use of military force against Iraq. But the files, made public for the first time, show that Sir Tony's ambassador, Sir Christopher Meyer, warned him it would be \"politically impossible\" to sway Mr Bush away from an invasion unless Hussein surrendered. The documents, released by the National Archives at Kew in west London, show Sir Christopher also wrote that Mr Bush believed himself to be on \"a crusade against evil to be undertaken by God's chosen people\". Sir Tony's foreign policy adviser, Sir David Manning, told the PM that when he met Mr Bush, he should make the point that a new diplomatic resolution was \"politically essential for the UK, and almost certainly legally essential as well\". \n                  Starmer's challenge is to see if usual rules of special relationship still apply under Trump after years of love bombing\n                 \n                  Jimmy Carter funeral sees US presidents unite and Kamala Harris face-to-face with Donald Trump\n                 \n                  All five living US presidents pictured together at funeral of Jimmy Carter\n                 But the White House was becoming increasingly impatient at the unwillingness of France and Russia - both of whom held a veto - to agree a resolution so long as UN inspectors were unable to find any evidence of Iraqi weapons of mass destruction, the supposed justification for war. Sir Christopher warned Sir Tony shortly before his visit to see Mr Bush in January 2003 that options for a peaceful solution in Iraq had effectively run out. He wrote: \"It is politically impossible for Bush to back down from going to war in Iraq this spring, absent Saddam's surrender or disappearance from the scene. \"If Bush had any room for manoeuvre beforehand this was closed off by his State of the Union speech. \"In the high-flown prose to which Bush is drawn on these set-piece occasions, he said in effect that destroying Saddam is a crusade against evil to be undertaken by God's chosen people.\" In a cable sent the previous month, Sir Christopher said that much of the impulse for deposing Hussein was coming from the president, a born-again Christian, who was scornful of what he saw as the \"self-serving\" reservations of the Europeans. \"His view of the world is Manichean. He sees his mission as ridding it of evil-doers. He believes American values should be universal values,\" Sir Christopher stated. \"He is strongly allergic to Europeans collectively. Anyone who has sat round a dinner table with low-church Southerners will find these sentiments instantly recognisable.\" In the end, Sir Tony and Mr Bush abandoned efforts to get a new Security Council resolution, blaming French President Jacques Chirac for refusing, and launched the invasion of Iraq anyway. Lobbying from Mandelson and anger at the French Among the new files, there are also a number of other revelations. These include:"
    },
    {
        "title": "Could your summer holiday be greener? Government invests £63m into more sustainable types of jet fuel",
        "description": "The government is investing &#163;63m in new types of jet fuel that it hopes will make your summer holiday a little more eco-friendly - though not everyone is convinced.",
        "url": "https://news.sky.com/story/could-your-summer-holiday-be-greener-government-invests-16363m-into-more-sustainable-types-of-jet-fuel-13399766",
        "image_url": "https://e3.365dm.com/21/10/1920x1080/skynews-aviation-airlines-climate-teaser_5534594.jpg?20211004103633",
        "type": "Politics",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-07-21 15:38:00",
        "Headline": "The government argues the cash will boost British industry and jobs in a fast-growing market, and benefit the climate. Campaigners warn the fuels will fail to deliver.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The government is investing £63m in new types of jet fuel that it hopes will make your summer holiday a little more eco-friendly - though not everyone is convinced. The cash will be shared by 17 British companies developing different types of \"sustainable aviation fuel\" (SAF), made from materials including forest cuttings, household rubbish, sugar beet or hydrogen gas. Ministers said the funds could support 1,400 jobs, add £5bn to the economy and help the British industry get ahead as global demand for SAF soars in order to meet stricter climate targets. But campaigners question how sustainable these fuels really are, saying the real answer is to deter \"frequent flying\". They warn the materials needed for sustainable fuels are hard to come by and too expensive to ever scale up. Industry says it needs this cash injection precisely in order to lower costs and grow, and global demand is booming.  As of January, flights taking off from the UK must use 2% SAF in their fuel, under new government rules. This will gradually rise to 10% in 2030 and 22% in 2040. \n                  Hundreds of passengers evacuated after Delta Air Lines Airbus A330 engine catches fire at Orlando International Airport\n                 \n                  Luton Airport expansion plans approved by transport secretary\n                 \n                  Boeing passenger jet catches fire after engine fault forces American Airlines flight to divert to Denver\n                 But there have been alarm bells warning not enough SAF will be available to meet those targets. The government says sustainable fuels cut emissions of greenhouse gases by 70% on average compared with kerosene over the course of its life, which includes producing it and burning it. Aviation minister Mike Kane said: \"We're not just backing brilliant British innovation, we're creating thousands of high-skilled jobs and positioning the UK at the forefront of the global sustainable aviation market.\" He said the move would \"kickstart economic growth, secure energy independence, and make Britain a clean energy superpower\". But campaigners say at best the fuels will reduce aviation emissions \"by a tiny fraction of the amount needed\", and are being used to justify \"irresponsible levels\" of airport expansion. James Sutton, co-director of climate charity Possible, told Sky News they were not anti-investment, but that the SAF plans would not bring down emissions at the pace and scale necessary. He said: \"We need to cut those emissions immediately if we have any hope of hitting our climate goals, not just sit and hope for the best in a few decades time. \"The technology and investment required for SAF to displace kerosene entirely is simply not there yet, but policies aimed at reducing demand for flights and taxing frequent flyers, which will therefore cut emissions, are possible now. \"So that is what we need to focus on first and foremost.\" The biggest winner in this round of funding was Stockton-on-Tees based Alfanar Energy, which will get £8m for converting waste wood from sawmills and forestry into SAF."
    },
    {
        "title": "People smugglers to have assets frozen and be banned from UK",
        "description": "People smugglers face having their assets frozen and being banned from entering the UK, the foreign secretary has announced.",
        "url": "https://news.sky.com/story/people-smugglers-to-have-assets-frozen-and-be-banned-from-uk-13399703",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-france-gravelines-coast-guard_6966790.jpg?20250717093045",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-21 13:30:00",
        "Headline": "New powers under the Sanctions Act will see gang leaders, small boat suppliers, fake passport makers and anyone else enabling small boat crossings targeted.",
        "Content": "People smugglers face having their assets frozen and being banned from entering the UK, the foreign secretary has announced. David Lammy said new powers under the Sanctions Act will allow the UK to freeze the assets of anyone complicit in smuggling illegal migrants into the country. They can also be banned from travelling to the UK. The first wave of sanctions on smuggling gangs and their enablers will be imposed on Wednesday.  Mr Lammy said it is the \"world's first sanctions regime\" targeted at smuggling gangs. Gang leaders, small boat suppliers, people making and selling fake passports and middlemen facilitating payments by migrants through hawala networks (informal systems for transferring money) will all be targeted this week. \n                  UK restores diplomatic ties with Syria\n                 \n                  UK could send further capabilities to Middle East, minister says\n                 \n                  Foreign Secretary David Lammy in Gibraltar as negotiations over post-Brexit deal with Spain heat up\n                 They will be publicly named on a sanctions list, making it illegal for the UK financial system to engage with them. By using the Sanctions Act, the government said it can target the smuggling gangs wherever they are in the world, including where law enforcement and criminal justice approaches cannot reach.  Labour's manifesto promised to \"smash the gangs\", but the first half of 2025 has seen a record number of small boat crossings, with about 20,000 from January to June - the highest ever in that period, and 48% more than the first half of 2024. Earlier this month, the UK and France announced a pilot scheme under which migrants arriving in the UK illegally from France will be returned and a legitimate asylum seeker will be able to come to the UK. They did not say how many would be returned each week, but the suggestion was 50. On the latest sanctions, Foreign Secretary David Lammy said: \"For too long, criminal gangs have been lining their corrupt pockets and preying on the hopes of vulnerable people with impunity as they drive irregular migration to the UK. We will not accept this status quo. \"It is our moral duty and a key part of our Plan for Change to do all we can to smash these gangs and secure Britain's borders. \"That's why the UK has created the world's first sanctions regime targeted at gangs involved in people smuggling and driving irregular migration, as well as their enablers. \"From tomorrow, those involved will face having their assets frozen, being shut off from the UK financial system and banned from travelling to the UK.\" Home Secretary Yvette Cooper said the sanctions send a \"clear message that there is no hiding place for those who exploit vulnerable people and put lives at risk for profit\"."
    },
    {
        "title": "Compensation scheme for infected blood scandal widened",
        "description": "More victims of the infected blood scandal will qualify for compensation while others will get higher awards under changes to the scheme. ",
        "url": "https://news.sky.com/story/compensation-scheme-for-infected-blood-scandal-widened-13399812",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-infected-blood-scandal_6684534.jpg?20240914050000",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-21 16:54:00",
        "Headline": "The new rules mean estates of affected people who have already died will be able to claim payments.",
        "Content": "More victims of the infected blood scandal will qualify for compensation while others will get higher awards under changes to the scheme.  The new rules mean estates of affected people who have already died will be able to claim payments. As well as this, around 1,000 people who are already eligible will be able to claim a higher amount, including chronic Hepatitis C individuals. Politics latest: Starmer explains how he plans to make people 'better off'  The reforms are being introduced following 16 recommendations from the Infected Blood Inquiry, which published an additional report earlier this month. Confirming the changes, minister for the Cabinet Office Nick Thomas-Symonds said the government has \"concentrated on removing barriers to quicker compensation\". \n                  Infected blood victims are 'waiting to die in limbo' - with hundreds still waiting for compensation\n                 \n                  New GP drive to find undiagnosed infected blood scandal victims\n                 \n                  Infected blood scandal: Victims 'scared they won't live to see compensation'\n                 He added: \"Our focus as we move forward must be working together to not only deliver justice to all those impacted, but also to restore trust in the state to people who have been let down too many times.\" Between the 1970s and early 1990s, more than 30,000 people in the UK were infected with HIV and hepatitis C while receiving NHS care.  Some 3,000 people have died after they were given contaminated blood and blood products, while survivors live with lifelong implications. In last October's Budget, Chancellor Rachel Reeves committed £11.8bn to compensate victims of the infected blood scandal, with the scheme opening at the end of last year. The changes will ensure that those who endured treatments with adverse side effects, such as interferon, will receive higher compensation to what is currently provided. Health correspondent The government will now hope its response to Sir Brian Langstaff's criticism will be enough to convince the Infected Blood chair - and more importantly those infected and affected by this scandal - is listening and acting with urgency.   The long-awaited report was published in May 2024. It was an afternoon charged with raw emotion. After decades of being lied to, ignored and gaslit, finally the infected blood community had found its champion. Someone who understood their pain and suffering.  Sir Brian called on the government to deliver compensation quickly, knowing that many were dying before seeing justice delivered.  But Sir Brian was not himself convinced. Even after the publication of the report he kept the Inquiry open.  This is unprecedented. It showed that he feared there would be more stalling and further delays to payments. He was, sadly, proved right.  It took an extraordinary intervention from Sir Brian last month to push the government to respond. It says it will implement all of the Inquiry's latest recommendations, some immediately and the rest after further consultation with the community.  More people will now qualify for payment and others will get more compensation. And importantly the claims of victims will not die with them but instead can now be passed on to surviving family members. All hugely important revisions.  The government says it understands the urgency. But it will also know it should not have taken an unprecedented intervention to force the issue. Higher compensation will also be available for the impacts currently recognised by the Infected Blood Support Scheme 'Special Category Mechanism' (SCM), which is provided to chronic Hepatitis C individuals who have experienced a significant impact on their ability to carry out daily duties. The government said the changes mean that over a thousand people will receive a higher amount than they would have under the existing scheme. Scheme widened to estates of deceased affected people  The scheme will also be widened to some people who don't currently qualify. Under the current mechanism, if someone who was infected dies before receiving full compensation, then any final award can be passed on to their relatives through their estate. However while compensation is also available to family members affected by the scandal - a partner, sibling or parent of someone who was infected, for example, this claim dies with them if they pass away. The changes announced today mean that if the affected person has died after May 21st 2024, or dies in future before receiving compensation, their estate will be able to make a claim. Memorial plans announced The government also announced that Clive Smith, president of the Haemophilia Society, will be the chair of the new Infected Blood Memorial Committee. The project will include plans for a UK memorial and support memorials in Scotland, Wales and Northern Ireland. In line with the Infected Blood Inquiry's recommendation, the committee will also develop plans for commemorative events and is planning to hold the first by the end of 2025. Mr Smith said the memorial is \"long overdue\". He added: \"It is a great privilege to be asked to lead this important work on behalf of the community. \"I am conscious that we are already behind in relation to implementing the Infected Blood Inquiry's recommendation that community events be held on a six-month basis post the Inquiry reporting. We intend to correct that by the end of this year. \"I look forward to working with the whole community across the UK on building an appropriate memorial to those we have lost and to act as a lasting memorial to the nation of what can happen when patient safety is not prioritised.\""
    },
    {
        "title": "Nigel Farage says he would send violent offenders to El Salvador under crime crackdown",
        "description": "Nigel Farage has said violent UK offenders could be jailed overseas under his plans to cut crime by half.",
        "url": "https://news.sky.com/story/nigel-farage-says-he-would-send-violent-offenders-to-el-salvador-under-crime-crackdown-13399670",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-nigel-farage-reform_6969829.jpg?20250721114906",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-07-21 12:31:00",
        "Headline": "The Reform UK leader sets out plans to cut crime by half in the first term of parliament if his party wins the next election. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Nigel Farage has said violent UK offenders could be jailed overseas under his plans to cut crime by half. The Reform UK leader named El Salvador as a likely destination, though he said he has not held conversations with officials there and \"multiple\" partners would be considered. El Salvador is home to a notorious mega-prison, the Terrorism Confinement Center (CECOT). Politics Live: Starmer explains how he plans to make people 'better off'  In a speech on law and order on Monday, Mr Farage said: \"It is quite astonishing that to keep a prisoner in a British prison it costs nearly £52,000 a year. \"You could send a child Eton for that price. \"So we can send some of our worst violent criminals overseas to serve their terms. If that means Ian Huntley goes to El Salvador. Well, our attitude is 'so be it'.\" Huntley is serving a life term for the murders of two 10-year-old girls, Holly Wells and Jessica Chapman, in Soham, Cambridgeshire, in 2002. Asked if he had spoken to any members of the El Salvadoran government about his plans, Mr Farage said he had not but \"we do know they're quite happy to take American violent offenders\". In March, the Trump administration deported more than 130 alleged Venezuelan gang members to the CECOT while the US president has also spoken of sending \"homegrown criminals\" to the super max facility. Reform UK said it wanted to create 10,000 \"dynamic\" prison places overall by renting cells in third party countries, at a cost of £250m per year. This would involve \"multiple partners including El Salvador\", according to a document outlining the plan in further detail. This will come alongside a number of policies aimed at cutting crime by half if Mr Farage's party wins the next election. The Clacton MP wants to hire another 30,000 police officers, put stop and search in every area where knife crime is prevalent and implement a zero-tolerance policy to shoplifting so every offence \"however small\" is prosecuted. Mr Farage also said he would free up to 10,000 more prison places by deporting foreign criminals to their country of origin, saying he has already spoken to Albanian Prime Minister Edi Rama about this. He said he would take back British offenders who are incarcerated overseas in return but if countries are still reluctant \"we'll make it very straightforward. We'll just end travel\". Mr Farage did not say how much the plans would cost or how they would be funded in his speech, which marks the start of a six week \"lawless Britain\" campaign. However, in response to questions from media he said the plans would cost £17.4bn over a five-year parliament. He said the cost of crime is far greater than that so \"it isn't really a question of can we afford to do this, it's really a question of we can't afford not to do this\". He insisted he would not have to raise taxes, saying the money would come from \"huge cuts\" to public spending including axing HS2 and net zero policies and reducing the size of the state. Mr Farage claimed his plans are necessary because parts of Britain are facing \"nothing short of societal collapse\" due to spiralling crime rates. Read More:Government to conduct review into state pension ageFarage: Ex-Reform chair liking antisemitic post a 'little mistake' Sir Keir Starmer has made halving serious violent crime one of the missions of his government, but the pledge has been somewhat overshadowed by his controversial early prison release scheme, aimed at freeing up prison capacity due to overcrowding. A spokesperson for the prime minister said he is already deporting foreign national offenders, adding that Mr Farage's plans are \"unfunded and lack detail\" and that \"we are getting on with it\". The spokesperson ruled out moving prisoners overseas, saying the government is \"focused on investing and fixing prisons here\". He added: \"In the last 14 years we saw only 500 places added to prison estate and since then we have been going further to free up space in our prisons.\""
    },
    {
        "title": "£104bn of water industry investment will come from bill payers, environment secretary concedes",
        "description": "Steve Reed has conceded that the bulk of the &#163;104bn of water industry investment which he boasts Labour has attracted since coming to office will come from bill payers.",
        "url": "https://news.sky.com/story/163104bn-of-water-industry-investment-will-come-from-bill-payers-environment-secretary-concedes-13399597",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-discharge-river-mersey_6969760.jpg?20250721134752",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-07-21 10:08:00",
        "Headline": "The government has generated £104bn in private investment and industry has already started spending it. The money will be recouped over the coming decades.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Steve Reed has conceded that the bulk of the £104bn of water industry investment which he boasts Labour has attracted since coming to office will come from bill payers. In an interview with Sky News, the environment secretary sought to blame the previous Tory government for a string of high profile investors walking away from the sector over the last year. Mr Reed does not accept claims that further threats to jail water bosses and promises to curb price rises have deterred investment. Instead, he told Sky News that \"by bringing in the £104bn of private sector investment that we secured at the end of last year, we can make sure that the investment is going in to support\" the industry. When challenged that the £104bn was total expenditure not total investment, and that bill payers would pay back this expenditure over the coming decades, Mr Reed conceded this was right - and the money ultimately is coming from bill payers. \"The money comes in from investors up front so we can do that spending straight away,\" he said. \"Over decades, the investors got a modest return from the bills that customers are paying. That's how investment works.\" Some investors have warned they do not think it viable to fund the UK water sector because of the hostile political tone of ministers and lack of certainty. Ministers have said the government does not want to renationalise water as it would mean years of legal wrangling and cost a lot of money.  Labour has launched a record 81 criminal investigations into water companies over sewage dumping since winning the election last year. Water company bosses could be jailed for up to five years and the companies fined hundreds of millions of pounds if they are found guilty. Mr Reed committed to not interfering with those prosecutions, saying it would be \"highly inappropriate\" for any minister to do so. Read more:Key recommendations from the water reportLabour to eliminate unauthorised sewage spillages in 10 years He rejected suggestions ministers will be pressured to ensure water bosses do not serve jail time as this will deter investors. \"It's a judicial process, it would be highly inappropriate for any ministerial interference in the process,\" Mr Reed said. \"They will work their way through the court system, as they should do, and ministers will decide on sanctions after.\""
    },
    {
        "title": "Compulsory water meters and regulator abolished - key recommendations from landmark report into 'broken' water industry",
        "description": "The system for regulating water companies in England and Wales should be overhauled and replaced with one single body in England and another in Wales, a once-in-a-generation review of the sector has advised.",
        "url": "https://news.sky.com/story/broken-water-industry-set-to-be-overhauled-nine-key-recommendations-from-landmark-report-13399475",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-water-tap_6935268.jpg?20250605165723",
        "type": "Politics",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-07-21 05:50:00",
        "Headline": "Major recommendations also include the ability to block company takeovers and taking a more interventionist approach to regulation. But nationalisation was excluded. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n  The system for regulating water companies in England and Wales should be overhauled and replaced with one single body in England and another in Wales, a once-in-a-generation review of the sector has advised. The report, which includes 88 recommendations, suggests a new single integrated regulator to replace existing water watchdogs, mandatory water metering, and a social tariff for vulnerable customers. The ability to block companies being taken over and the creation of eight new regional water authorities, with another for all of Wales to deliver local priorities, has also been suggested. Follow latest: 'This is our Great Stink moment', water report author says The review, the largest into the water industry since privatisation in the 1980s, was undertaken by Sir Jon Cunliffe, a career civil servant and former deputy governor of the Bank of England who oversaw the biggest clean-up of Britain's banking system in the wake of the financial crash. The government confirmed at a news conference on Monday that Ofwat will be abolished as part of an overhaul of a \"broken\" water regulation system. Sir Jon was coaxed out of retirement by Environment Secretary Steve Reed to lead the Independent Water Commission. Final recommendations of the commission have been published on Monday morning to clean up the sector and improve public confidence, as bills rise 36% over the next five years. Here are its nine key recommendations: • Single integrated water regulators - a single water regulator in England and a single water regulator in Wales. In England, this would replace Ofwat, the Drinking Water Inspectorate and water-environment related functions from the Environment Agency and Natural England. In Wales, Ofwat's economic responsibilities would be integrated into Natural Resources Wales. It's hoped this will solve the \"fragmented and overlapping\" regulation, and more stable regulation will improve investor confidence. Communications regulator Ofcom was given as an example of how combining five existing regulators into one worked. • Eight new regional water system planning authorities in England and one national authority in Wales to be responsible for water investment plans reflecting local priorities and streamlining the planning processes. The new authorities would be independent, made up of representatives from local councils, public health officials, environmental advocates, agricultural voices and consumers. The aim is they could direct funding and ensure accountability from all sectors impacting water. • Greater consumer protection - this includes upgrading the consumer body Consumer Council for Water, into an Ombudsman for Water to give stronger protection to customers and a clearer route to resolving complaints. Advocacy duties are to be transferred to Citizens Advice. • Stronger environmental regulation, including compulsory water meters. Also proposed by Sir Jon are changes to wholesale tariffs for industrial users and greater water reuse and rainwater harvesting schemes. A new long-term, legally binding target for the water environment was suggested. • Oversight of companies via the ability to block changes in ownership of water businesses when they are not seen to be prioritising the long-term interests of the company and its customers, and the addition of \"public benefit\" clauses in water company licences. To boost company financial resilience, as the UK's biggest provider, Thames Water struggles to remain in private ownership, the commission has recommended minimum financial requirements, like banks are subject to. This could mean utilities hold a certain amount of cash. It's hoped this will, in turn, make companies more appealing to potential investors. • The public health element of water has been recognised, and senior public health representation has been recommended for regional water planning authorities, as have new laws to address pollutants like forever chemicals and microplastics. • Fundamental reset of economic regulation - including changes to ensure companies are investing in and maintaining assets to help attract long-term, low-risk investment. A \"supervisory\" approach has been recommended to intervene before things like pollution occur, rather than penalising the businesses after the event. • Clear strategic direction - a long-term, 25-year national water strategy should be published by the UK and Welsh governments, with ministerial priorities given to water firms every five years. • Infrastructure and asset health reforms - companies should also be required to map and assess their assets and resilience. Nationalisation of the water industry was not in the Independent Water Commission's terms of reference and so was not considered. Sir Jon said the report has \"tried to attack the problem from all sides\". He warned that bills are going to rise by 30% over the next five years. \"There are some inescapable facts here,\" he said. \"The cost of producing water and dealing with our wastewater is going up.\" How has the report been received? In a speech responding to Sir Jon's report, Mr Reed said he was abolishing Ofwat. The water industry lobby group Water UK said \"fundamental change has been long overdue\". \"These recommendations should establish the foundations to secure our water supplies, support economic growth and end sewage entering our rivers and seas,\" a spokesperson said. \"The Independent Water Commission has written a comprehensive, detailed review of the whole sector, with many wide-ranging and ambitious recommendations. \"Crucially, it is now up to government to decide which recommendations it will adopt, and in what way, but the commission's work marks a significant step forward.\" Business and economics correspondent Sir Jon Cunliffe's review of the water sector is comprehensive, clear-eyed, and about as radical as allowed by terms of reference that explicitly ruled out renationalisation of England's private water and sewage companies. With that key demand of many campaigners off the table, the former Bank of England governor has focused on more effective regulation and securing a better deal for consumers and the investors without whom the industry will sink. So Ofwat, the embattled current regulator, is to be swept away on the tide of public anger at sewage outflows and shareholder dividends, and the disgruntlement of all its stakeholders. Having succeeded in its primary aim of keeping consumer bills down, it is now a victim of the consequences: a shortage of investment in infrastructure and a failure to apply similar rigour to shareholder dividends and executive pay. While campaigners and customers say it has failed to hold companies to account, the companies complain they are too tightly controlled to attract investment. Ofwat privately points out it can only apply the powers and political direction it is given - but the new government, going with the flow of angry voters, will not hesitate to pull the chain. Read more here Campaign group Surfers Against Sewage said the report \"utterly fails to prioritise public benefit over private profit\". \"This is not transformational reform, this is putting lipstick on a pig - and you can bet the champagne is flowing in water company boardrooms across the land,\" said its chief executive, Giles Bristow. \"Only one path forward remains: a full, systemic transformation that ends the ruthless pursuit of profit and puts the public good at the heart of our water services,\" he said. \"We welcome Sir Jon's calls for a national strategy, enshrining public health objectives in law and regional water planning. But we won't be taken for fools - abolishing Ofwat and replacing it with a shinier regulator won't stop sewage dumping or profiteering if the finance and ownership structures stay the same.\" Environmentalist Feargal Sharkey told Sky News, \"we were promised champagne, what we got was a glass of sour milk\". The regulator Ofwat said, it will now work with the government and the other regulators to form the new regulatory body in England, and \"to contribute to discussions on the options for Wales set out in the report\". \"In advance of the creation of the new body, we will continue to work hard within our powers to protect customers and the environment and to discharge our responsibilities under the current regulatory framework. We will also work collaboratively with all our stakeholders to ensure a smooth transition.\""
    },
    {
        "title": "Government to conduct review into state pension age",
        "description": "The work and pensions secretary has announced a review of the state pension age.",
        "url": "https://news.sky.com/story/government-to-conduct-early-review-into-state-pension-age-13399571",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-pensions-review-pensions_6969752.jpg?20250721102047",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-21 09:31:00",
        "Headline": "Work and Pensions Secretary Liz Kendall says she is also reviving the Pension Commission to look at why future pensioners are set to be poorer than pensioners now.",
        "Content": " The work and pensions secretary has announced a review of the state pension age. The government is required to conduct a review into the state pension age - currently 66 - every six years. The last one concluded in 2023, and the new one announced today is due to finish in 2029. Politics latest: Water regulator Ofwat will be abolished The review will consider whether the current state pension age is still appropriate, based on factors such as life expectancy. The announcement comes following warnings from experts that people looking to retire in 2050 are on course to receive £800 per year less than current pensioners. The Department for Work and Pensions (DWP) said 45% of working-age adults were putting nothing into their pensions, with concerns that the cost of living crisis is preventing people from investing in their retirement. Liz Kendall said she was \"under no illusions\" about how difficult it would be to map out plans for pensions for the coming decades, as the cost of living crisis continues to bite. \n                  Kemi Badenoch hits back at claims she would means test pensions triple lock\n                 \n                  Tories will consider means-testing pensions triple lock, Kemi Badenoch says\n                 \n                  Waspi women accuse Starmer of misleading public over numbers who knew of pension age change\n                 She said \"many workers are more concerned about putting food on the table and keeping a roof over their heads than saving for a retirement that seems a long, long way away\", and that many businesses \"face huge challenges in keeping profitable and flexible in an increasingly uncertain world\". Giving a speech in west London, the work and pensions secretary also announced that she would revive the Pension Commission to consider why future pensioners are on track to be poorer than pensioners now. \"Just because pensioner poverty has fallen does not mean all the problems have gone away,\" she said. \"Far from it. Women who are now approaching retirement have half the private pension wealth of men, so the average woman in her late 50s can expect a private pension income of just over £100 a week, compared to £200 a week for men. \"Only one in five of the self-employed are saving into a private pension, down from half in the late 1990s, meaning over 3 million self-employed people aren't saving anything at all for their retirement.\" The commission, which was first launched in 2002 under Sir Tony Blair's government, will look at such challenges and consider policy ideas such as lowering the age and earnings threshold at which people are brought into auto enrolment. Ms Kendall argued that young people in particular were struggling to invest in their retirement because of housing costs. She said young people \" haven't got a hope in hell of getting on the housing ladder\" and were being \"killed by rent\" - which she said was driving a \"tsunami of pensioner poverty\". \"Put simply, unless we act, tomorrow's pensioners will be poorer than today's, because people who are saving aren't saving enough for their retirement,\" she said. \"And crucially, because almost half of the working age population isn't saving anything for their retirement at all.\" Speaking to reporters after the event, Ms Kendall said the pensions triple lock, the guarantee that the state pension rises in line with average earnings, inflation or 2.5% - whichever is highest - would not be reconsidered. She said it was \"non negotiable\" and \"out of scope for this review\". And asked whether businesses should be prepared to pay higher contributions - on top of the increase in employers' national insurance contributions that came into effect in April - she replied: \"We've ruled out any increase in contributions, either from employers or employees this parliament. \"What the commission has been tasked to do is to look to the long term in the middle of this century. How can the state pension and private pensions work together to give people a better income in retirement?\" Reform UK leader Nigel Farage said he believes the UK's retirement age will \"inevitably\" have to rise as life expectancy increases. Read more:Ofwat to be swept away on tide of public anger over sewage spillsFarage excuses ex-Reform chair liking antisemitic post about Jenrick He was asked at a press conference in Westminster whether he shared the concern that the pensions triple lock was \"increasingly unaffordable\". He replied: \"I share the concern with pensions being unaffordable on a national level, I also share the concern at the absolute scandal of the private pensions industry, which has served people terribly but done frightfully well for itself. \"We're going to have to face the reality that if people are living longer and longer, then inevitably retirement age is going to have to rise.\" The Pension Commission is expected to provide recommendations for how to boost retirement income in 2027. A Downing Street spokesperson said the review into the state pension age was \"routine\" and would report back in March 2029. They said the underlining principle was fixing the retirement savings crisis and helping working-age adults who are not able to save."
    },
    {
        "title": "Could your summer holiday be greener? Government invests £63m into more sustainable types of jet fuel",
        "description": "The government is investing &#163;63m in new types of jet fuel that it hopes will make your summer holiday a little more eco-friendly - though not everyone is convinced.",
        "url": "https://news.sky.com/story/could-your-summer-holiday-be-greener-government-invests-16363m-into-more-sustainable-types-of-jet-fuel-13399766",
        "image_url": "https://e3.365dm.com/21/10/1920x1080/skynews-aviation-airlines-climate-teaser_5534594.jpg?20211004103633",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-07-21 15:38:00",
        "Headline": "The government argues the cash will boost British industry and jobs in a fast-growing market, and benefit the climate. Campaigners warn the fuels will fail to deliver.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The government is investing £63m in new types of jet fuel that it hopes will make your summer holiday a little more eco-friendly - though not everyone is convinced. The cash will be shared by 17 British companies developing different types of \"sustainable aviation fuel\" (SAF), made from materials including forest cuttings, household rubbish, sugar beet or hydrogen gas. Ministers said the funds could support 1,400 jobs, add £5bn to the economy and help the British industry get ahead as global demand for SAF soars in order to meet stricter climate targets. But campaigners question how sustainable these fuels really are, saying the real answer is to deter \"frequent flying\". They warn the materials needed for sustainable fuels are hard to come by and too expensive to ever scale up. Industry says it needs this cash injection precisely in order to lower costs and grow, and global demand is booming.  As of January, flights taking off from the UK must use 2% SAF in their fuel, under new government rules. This will gradually rise to 10% in 2030 and 22% in 2040. \n                  Hundreds of passengers evacuated after Delta Air Lines Airbus A330 engine catches fire at Orlando International Airport\n                 \n                  Luton Airport expansion plans approved by transport secretary\n                 \n                  Boeing passenger jet catches fire after engine fault forces American Airlines flight to divert to Denver\n                 But there have been alarm bells warning not enough SAF will be available to meet those targets. The government says sustainable fuels cut emissions of greenhouse gases by 70% on average compared with kerosene over the course of its life, which includes producing it and burning it. Aviation minister Mike Kane said: \"We're not just backing brilliant British innovation, we're creating thousands of high-skilled jobs and positioning the UK at the forefront of the global sustainable aviation market.\" He said the move would \"kickstart economic growth, secure energy independence, and make Britain a clean energy superpower\". But campaigners say at best the fuels will reduce aviation emissions \"by a tiny fraction of the amount needed\", and are being used to justify \"irresponsible levels\" of airport expansion. James Sutton, co-director of climate charity Possible, told Sky News they were not anti-investment, but that the SAF plans would not bring down emissions at the pace and scale necessary. He said: \"We need to cut those emissions immediately if we have any hope of hitting our climate goals, not just sit and hope for the best in a few decades time. \"The technology and investment required for SAF to displace kerosene entirely is simply not there yet, but policies aimed at reducing demand for flights and taxing frequent flyers, which will therefore cut emissions, are possible now. \"So that is what we need to focus on first and foremost.\" The biggest winner in this round of funding was Stockton-on-Tees based Alfanar Energy, which will get £8m for converting waste wood from sawmills and forestry into SAF."
    },
    {
        "title": "Malcolm-Jamal Warner, who played The Cosby Show's Theo, drowns in Costa Rica",
        "description": "Malcolm-Jamal Warner, who played The Cosby Show character Theo, has drowned in Costa Rica, according to authorities.",
        "url": "https://news.sky.com/story/malcolm-jamal-warner-who-played-the-cosby-shows-theo-drowns-in-costa-rica-13399852",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-malcolm-jamal-warner_6970280.jpg?20250721193922",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-21 18:31:00",
        "Headline": "It is understood the 54-year-old was swimming at Playa Grande de Cocles in Limon province when he was pulled underwater by a current.",
        "Content": "Malcolm-Jamal Warner, who played The Cosby Show character Theo, has drowned in Costa Rica, according to authorities. The country's Judicial Investigation Department said the 54-year-old actor drowned on Sunday afternoon off a beach on the Caribbean coast. It is understood he was swimming at Playa Grande de Cocles in Limon province when he was pulled underwater by a current. \"He was rescued by people on the beach,\" according to the department's early report, but emergency workers from Costa Rica's Red Cross found him without any signs of life and he was taken to the morgue.  Warner was on holiday with his family at the time, according to US celebrity news site People. The Cosby Show aired from 1984 to 1992 on NBC in the US and is regarded as a groundbreaking show for its portrayal of a successful black middle-class family. It was also shown on Channel 4 in the UK at around the same time. Its star, Bill Cosby, played a doctor named Cliff Huxtable, with Warner in the role of Theo, his only son. The NBC sitcom was the most popular show in America for much of its run between 1984 and 1992. Warner played the role for eight seasons in all 197 episodes, winning an Emmy nomination for supporting actor in a comedy in 1986. For many, the lasting image of the character, and of Warner, is of him wearing a badly-botched mock designer shirt sewn by his sister Denise, played by Lisa Bonet. Warner 'proud' of show despite Cosby claims The legacy of The Cosby Show has been tarnished after Cosby was jailed in 2018 following a conviction for sexual assault. He was released in 2021 after his conviction was overturned. Dozens of women had accused Cosby of sexual assault or rape before the trial. Following his release from prison, Cosby was found liable for sexually assaulting a woman at the Playboy Mansion in 1975 when she was a teenager. Warner told the Associated Press in 2015: \"My biggest concern is when it comes to images of people of colour on television and film... We've always had 'The Cosby Show' to hold up against that. And the fact that we no longer have that, that's the thing that saddens me the most because in a few generations the Huxtables will have been just a fairy tale.\" In 2023, Warner told People in an interview: \"I know I can speak for all the cast when I say The Cosby Show is something that we are all still very proud of.\" Read more entertainment news:Danny Dyer on Mr Big StuffScuffle breaks out on Royal Opera House on stage Warner wins a Grammy  Following his career on The Cosby Show, Warner later appeared on the sitcom Malcolm & Eddie, co-starring with comedian Eddie Griffin in the series on the UPN network from 1996 to 2000. In the 2010s he starred opposite Tracee Ellis Ross as a family-blending couple for two seasons on the BET sitcom Read Between The Lines. He also had a role as OJ Simpson's friend Al Cowlings in American Crime Story and was a series regular on Fox's The Resident. Films he has appeared in include the 2008 rom-com Fool's Gold with Matthew McConaughey and Kate Hudson. A poet and a musician, Warner won a Grammy for best traditional R&B performance for the song Jesus Children with Robert Glasper and Lalah Hathaway. He was also nominated for best spoken word poetry album for Hiding In Plain View.Warner was married with a daughter, but chose to not publicly disclose their names."
    }
]