[
    {
        "title": "With one of his proudest achievements on the line, will Trump force Netanyahu's hand?",
        "description": "The moment could have felt so different. It should have felt so different.",
        "url": "https://news.sky.com/story/if-there-is-any-hope-for-an-end-to-the-war-in-gaza-it-rests-with-donald-trump-13436486",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-air-force-one_7028475.jpg?20250922120204",
        "type": "Home",
        "Author": "Mark Stone",
        "Date Published": "2025-09-22 21:52:00",
        "Headline": "The countries which have recognised Palestine at the UN in New York are jumping to the endpoint and hope to now fill in the gaps. But for an end to the Gaza conflict, only one man can possibly influence Israel's prime minister.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  The moment could have felt so different. It should have felt so different. It was supposed to come a long time ago, and it was supposed to be the outcome of a peace process, of reconciliation, of understanding, of coexistence and of healing. If it had happened the right way, then we'd be celebrating two states living alongside each other, coexisting, sharing a capital city. As it happened: France recognises Palestinian state Instead, the recognition of Palestine as a state comes out of the rubble of Gaza. It has come as a last-ditch effort to save all vanishing chances of a Palestinian state. Essentially, the countries which have recognised Palestine here at the UN in New York are jumping to the endpoint and hope to now fill in the gaps. Those gaps are huge. Even before the horror of the Hamas attack on 7 October 2023, there was almost no realistic prospect of a two-state solution.  Israeli settlement expansion in the West Bank and Benjamin Netanyahu's divide-and-conquer strategy for the Palestinian Authority in the West Bank and Hamas in Gaza had made reconciliation increasingly hard. The Hamas attack set back what little hope there was even further, while settlement expansion by the Israelis in the West Bank accelerated since then. The same questions which have made all this so intractable remain. How to share a capital city? Who controls Jerusalem's Old City, where the holy sites are located? If it's shared, then how? What happens to the settlements in the West Bank? If land swaps take place, then where? What happens to Gaza? Who governs the Palestinians? And how are the moderates on both sides emboldened to dominate the discourse and the policy?  Hope rests with Trump Right now, Palestinian extremism is holding out in Gaza with the hostages, and Israeli extremism is dominant on the other side, with Netanyahu now threatening to fully annex the West Bank as a reaction to the recognition declarations at the UN. It all feels pretty bleak and desperate. If there is cause for some hope, it rests with Donald Trump. Over the next 24 hours in New York, he will meet key Arab and Muslim leaders from the Middle East and Asia to present his latest plan for peace in Gaza. Saudi Arabia, the United Arab Emirates, Qatar, Egypt, Jordan, Turkey, Indonesia, and Pakistan will all participate in the meeting. They will listen to his plan, some may offer peacekeeping troops (a significant development if they do), some may offer to provide funding to rebuild the strip and, crucially, all are likely to tell him that his Abraham Accords plan - to forge ahead with diplomatic normalisation between Muslim nations and Israel - will not happen if Israel pushes ahead with any West Bank annexation. Netanyahu will address the UN at the end of the week, before travelling to the White House on Monday, where he will tell Trump what he plans to do next in both Gaza and the West Bank. Read more from Sky News:Typhoon brings 183mph winds as thousands evacuatedFlights suspended at European airport after drone sightings If Trump wants his Abraham Accords to expand and not collapse - and remember the accords represent a genuine diplomatic game changer for the region, one Trump is rightly proud of - then he will force Netanyahu to stop in Gaza and stop in the West Bank. He is the only man in the world who can."
    },
    {
        "title": "Jimmy Kimmel show to return after being taken off air over Charlie Kirk comments",
        "description": "Late-night talk show host Jimmy Kimmel, who was taken off the air following a row over comments about Charlie Kirk, will return on Tuesday.",
        "url": "https://news.sky.com/story/jimmy-kimmel-show-to-return-after-being-taken-off-air-over-charlie-kirk-comments-13436437",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jimmy-kimmel-emmy_7024453.jpg?20250918180335",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-22 19:34:00",
        "Headline": "Hundreds of stars had urged Americans to \"fight to defend and preserve our constitutionally protected rights\" in the wake of Kimmel's suspension.",
        "Content": " Late-night talk show host Jimmy Kimmel, who was taken off the air following a row over comments about Charlie Kirk, will return on Tuesday. The US presenter, who was accused of being \"offensive and insensitive\" because of what he said on his programme, Jimmy Kimmel Live, on Monday last week, will go back on air in his regular slot on the ABC network. Disney, which owns ABC, said in a statement: \"Last Wednesday, we made the decision to suspend production on the show to avoid further inflaming a tense situation at an emotional moment for our country. \"It is a decision we made because we felt some of the comments were ill-timed and thus insensitive. \"We have spent the last days having thoughtful conversations with Jimmy, and after those conversations, we reached the decision to return the show on Tuesday.\" Earlier on Monday, hundreds of Hollywood stars signed an open letter to defend free speech following Kimmel's suspension. Robert De Niro, Ben Affleck, Jennifer Aniston, Selena Gomez, Lin-Manuel Miranda, Tom Hanks and Meryl Streep were among those who have penned the appeal. \n                  Trump links paracetamol use in pregnancy to increased risk of autism - here's what the evidence says\n                 \n                  'I forgive him': Charlie Kirk's wife delivers tearful message - and one America needs to hear most\n                 \n                  Who is Erika Kirk? Charlie Kirk's widow and Turning Point USA's new CEO\n                 More than 430 of the stars, including comedians, directors and writers, urged Americans to \"fight to defend and preserve our constitutionally protected rights\". The letter was addressed to the American Civil Liberties Union (ACLU), and argued the decision was a \"dark moment for freedom of speech in our nation\". The letter added: \"Regardless of our political affiliation, or whether we engage in politics or not, we all love our country. \"We also share the belief that our voices should never be silenced by those in power - because if it happens to one of us, it happens to all of us.\" The list of signatures also included Emmy-winner Noah Wyle, Oscar-nominated Florence Pugh, comedian David Cross, Tony-winner Kelli O'Hara and Molly Ringwald. Pedro Pascal, Billy Crystal, Nathan Lane, Kerry Washington and Kevin Bacon have also signed the letter. The letter concluded: \"This is the moment to defend free speech across our nation. We encourage all Americans to join us, along with the ACLU, in the fight to defend and preserve our constitutionally protected rights.\" Kimmel had used his show to accuse President Trump and his allies of capitalising on conservative influencer Charlie Kirk's assassination. The TV presenter said: \"We hit some new lows over the weekend with the MAGA gang desperately trying to characterise this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it.\" Speaking about Donald Trump, he added: \"This is not how an adult grieves the murder of someone he calls a friend. This is how a four-year-old mourns a goldfish.\" \"Many in MAGA land are working very hard to capitalise on the murder of Charlie Kirk,\" he continued.  ABC pulled the show following criticism from Brendan Carr, chairman of the Federal Communications Commission (FCC). Mr Carr had threatened to \"take action\" against Disney and ABC. In an interview with conservative podcaster Benny Johnson, he said: \"We can do this the easy way or the hard way\". Mr Carr then praised the move, saying \"it is important for broadcasters to push back on Disney programming that they determine falls short of community values\". But the decision sparked a global, furious backlash from the public and high-profile figures around the world. Among them was former US president Barack Obama, who said on X: \"After years of complaining about cancel culture, the current administration has taken it to a new and dangerous level by routinely threatening regulatory action against media companies unless they muzzle or fire reporters and commentators it doesn't like.\" He added: \"This is precisely the kind of government coercion that the First Amendment was designed to prevent - and media companies need to start standing up rather than capitulating to it.\" The decision came at a time Disney and Nexstar, the network operator, had FCC business ahead of them, with the former seeking regulatory approval for ESPN's acquisition of the NFL Network and the latter needing the Trump administration's approval to complete a $6.2bn (£4.6bn) purchase of broadcast rival, Tegna. Mr Trump, who was on a state visit to the UK at the time, said Kimmel had been cut for \"bad ratings\". He had said: \"Well, Jimmy Kimmel was fired because he had bad ratings, more than anything else. \"And he said a horrible thing about a great gentleman known as Charlie Kirk.\" He added: \"Jimmy Kimmel is not a talented person. He had very bad ratings, and they should have fired him a long time ago. \"So, you know, you could call that free speech or not. He was fired for lack of talent.\""
    },
    {
        "title": "Trump links paracetamol use in pregnancy to increased risk of autism - here's what the evidence says",
        "description": "Donald Trump has claimed the use of paracetamol in pregnancy is linked to an increased risk of autism - but what does the evidence say?",
        "url": "https://news.sky.com/story/donald-trump-to-link-paracetamol-use-to-autism-heres-what-the-evidence-says-13436398",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-paracetamol-pregnancy_7028814.jpg?20250922182137",
        "type": "Home",
        "Author": "Tom Clarke",
        "Date Published": "2025-09-22 17:01:00",
        "Headline": "While most doctors would advise women only to take medicines in pregnancy when necessary, avoiding paracetamol could do more harm than good.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  Donald Trump has claimed the use of paracetamol in pregnancy is linked to an increased risk of autism - but what does the evidence say? Americans consume more than 40% of all the world's paracetamol, spending in excess of $4bn a year on products containing acetaminophen (as it is known in America - or by its leading brand name, Tylenol). Autism rates in the US are also on the rise - going up from about one in 150 children in the year 2000, to around one in 30 today. There have also been a number of well-publicised studies suggesting a correlation between mothers who took paracetamol during pregnancy and the birth of a child with autism or other neurodevelopmental disorders such as ADHD. So surely something must be going on? Well, not necessarily. In studies that have suggested a link, the authors have been unable to show the drug itself led to autism instead of other factors. These include: the genetics of the parents (autism's genetic links are well established); the lifestyle or environment in which the mother lives; or most confounding of all, that the reason the mother was taking paracetamol - a viral infection perhaps - wasn't a trigger rather than the drug itself. A study showing a correlation is not the same as finding a cause. Better understanding of autism has meant the criteria for diagnosing it have expanded over the last two decades to include far more people. Diagnoses may well be rising simply because we're better at recognising it. What's more, there are numerous studies showing evidence of no link to paracetamol at all. Chief among them is a huge study from last year that included 2.5 million children in Sweden. In Sweden, a mother's use of paracetamol during pregnancy is added to her medical records. The researchers found a marginal increase in the risk of autism and paracetamol use by the mother. But crucially, when they included data for siblings born to the same mothers from pregnancies during which she took no paracetamol, the apparent link disappeared. \"Which provides a pretty strong evidence against the notion that paracetamol would cause harm,\" said Dr Viktor Ahlqvist at the Karolinska Institute in Stockholm, who led the study. Paracetamol still recommended in UK The study showed not only that paracetamol wasn't linked to autism, but that other studies, with poorer quality data were prone to seeing a pattern that wasn't there. This balance of evidence is why health authorities, including here in the UK, are confident in recommending paracetamol for use in pregnancy. In fact, it's now recommended as the safest choice, as other painkillers - even ibuprofen - have been shown to cause potential or actual harm to mother or babies. While most doctors would advise women only to take medicines in pregnancy when necessary, avoiding paracetamol could do more harm than good. \"While you're pregnant, experiencing uncontrolled fevers or some of the side effects from pain, such as high blood pressure, will be a lot more detrimental to a developing baby and a mother than paracetamol will be,\" said Dr Monique Botha, who studies bias in autism research at the University of Durham. Talking up a link between autism and paracetamol is also likely to anger people with autism or their parents, suspects Dr Botha. \"Families with autistic children are often struggling with under-resourced care and someone standing up and declaring that they've potentially found the cause of autism - when it's so misguided - isn't going to change anything for them.\" Read more from Sky News:'I forgive him': Charlie Kirk's wife delivers tearful messageAI-generated 'minister' makes debut in Albanian parliament Researchers worry too, that posing a link between a drug taken during pregnancy and autism adds unnecessary stigma to mothers of autistic children. \"We've seen this many, many times, going back to the scary stories of the 1960s, that the blame is usually on the mother and parents where a child has a condition,\" said Dr Ahlqvist. \"With this current [US] administration, they're again pointing the finger at mothers, when we have no substantial evidence to suggest that this is the case.\" US correspondent Many will welcome that Trump is putting this issue on the agenda, but there's a disconnect between his rhetoric and the strength of the evidence. The danger is two-fold – parents could be misled into believing autism can be prevented, and may avoid treating fever or pain, exposing themselves and their babies to greater risk. The president's team is also promoting a drug used to treat cancer as a potential therapy, but scientifically, the evidence remains thin. Some are likening this to 2020, when Trump speculated publicly about whether disinfectants could be used inside the body to treat COVID-19. He later said those remarks were sarcastic and not meant to be taken literally, but it led to jokes that he was encouraging people to drink bleach. Under fire from many in the medical world, who accuse him of risking more harm, the timing of this \"big announcement\" is also drawing scrutiny. Ten months after the election, the administration is keen to show it's implementing policy and a bold move on autism is something that will resonate emotionally with many families. It appeals to the populist, health-concern base – the \"Make America Healthy Again\" movement reflecting a constituency concerned about environmental toxins and the huge pharmaceutical industry. Health secretary Robert Kennedy Jr has a controversial record on vaccine-autism issues, so this taps into his legion of supporters who distrust conventional medical authorities. Big announcements in health, especially controversial ones, can shift media and public attention when an administration wants to change the news cycle from other problems. Politically, there are potential gains, but they come with risks to public health, deepening divisions in an already politically charged environment and the threat of legal action by drug manufacturers. So, if paracetamol doesn't cause autism, what's causing the Trump administration to talk about it? With echoes of previous, and all too real, drug scandals like thalidomide, it's the kind of story to generate controversy by association - however false. And the Trump White House has form when it comes to finding issues to distract from genuine controversies surrounding the president. The story also fits a key theme of US health secretary Robert F Kennedy Jr's policy moves - like on childhood vaccines - that stem from his belief that children are being harmed by an overmedicated America. But the whole point of science is that it doesn't care what you believe, it's about what the best quality evidence tells you. So far, there's been precious little of that behind the latest changes in US health policy."
    },
    {
        "title": "Flights suspended at Copenhagen airport after drone sightings",
        "description": "Flights have been suspended at Copenhagen airport in Denmark after reports of drones in the air.",
        "url": "https://news.sky.com/story/flights-suspended-at-copenhagen-airport-after-drone-sightings-13436457",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-copenhagen-airport_7028910.jpg?20250922213743",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-22 20:38:00",
        "Headline": "Denmark's biggest airport was forced to close on Monday evening after police said two or three large drones had been seen flying in the area.",
        "Content": "Flights have been suspended at Copenhagen airport in Denmark after reports of drones in the air. Denmark's biggest airport was forced to close on Monday evening following the sightings. Police said two or three large drones had been seen flying in the area. The airport halted operations at 8.26pm local time (7.26pm UK time) according to flight tracking service FlightRadar. Around 35 flights were diverted to alternate airports, FlightRadar said. An airport spokesperson said police were working to identify the drones but declined to provide further details, citing the ongoing investigation. The airport was not confirmed to have reopened until gone midnight local time, but it warned of continued delays and cancellations. \"Passengers are requested to stay informed through their airline,\" the airport said in a statement on X. There are no details on where the drones may have come from. 'It's quite scary' Copenhagen Police Deputy Assistant Commissioner Jakob Hansen later said that the drones had \"disappeared\", with officers not having \"taken any of them\". Sky News presenter Jonathan Samuels, who was at Copenhagen airport, said passengers were stuck on aircraft about to take off, while others were in the terminal with limited information about when their flights might depart. Passenger Louise McFadzean said she was waiting at the gate about to board a flight to Heathrow when she suddenly \"saw blue lights on the runway\". \"We were told the plane we were due to get had been diverted to Sweden,\" she added. \"It's quite scary, and I don't know when I'm going to get home.\" It comes after disruption at Heathrow Airport last week following a cyber attack that also hit other major airports in Europe. The cyber attack targeted a service provider for check-in and boarding systems. Read more from Sky News:Typhoon brings 183mph winds as thousands evacuatedJailed British-Egyptian activist pardoned by Egypt's president The \"technical issue\" that hit Collins Aerospace resulted in 14 flights being cancelled at Brussels Airport on Saturday and several more at Heathrow, Berlin, Dublin, and others. Passengers complained they were unable to check in online, instead queuing for hours for staff to deal with them manually at desks and departure gates, where they were told their flights would not be taking off."
    },
    {
        "title": "Several charities cut ties with Duchess of York over Epstein email",
        "description": "Several charities have cut ties with Sarah, Duchess of York, after it emerged she sent an email apologising to paedophile financier Jeffrey Epstein for publicly disowning him.",
        "url": "https://news.sky.com/story/duchess-of-york-dropped-as-patron-of-childrens-hospice-julias-house-over-epstein-email-13436100",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sarah-ferguson-duchess-of-york_7028781.jpg?20250922175724",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-22 11:42:00",
        "Headline": "One charity, Julia's House, said it would be \"inappropriate\" for the Duchess of York to continue as a patron of the charity. It comes after it emerged she wrote an email apologising to paedophile financier Jeffrey Epstein.",
        "Content": " Several charities have cut ties with Sarah, Duchess of York, after it emerged she sent an email apologising to paedophile financier Jeffrey Epstein for publicly disowning him. The duchess - Prince Andrew's ex-wife - has been dropped as a patron of The Teenage Cancer Trust, the British Heart Foundation, children's hospice Julia's House, food allergy charity The Natasha Allergy Research Foundation, the Children's Literacy Charity, the National Foundation for Retired Service Animals and the organisation Prevent Breast Cancer. It comes after it emerged she had written a gushing message to Epstein, describing him as her \"supreme friend\". Julia's House said: \"Following the information shared this weekend on the Duchess of York's correspondence with Jeffrey Epstein, Julia's House has taken the decision that it would be inappropriate for her to continue as a patron of the charity. \"We have advised the Duchess of York of this decision and thank her for her past support.\" Nadim and Tanya Ednan-Laperouse, founders of The Natasha Allergy Research Foundation, said: \"We were disturbed to read of Sarah, Duchess of York's, correspondence with Jeffrey Epstein. \"Sarah Ferguson has not been actively involved with the charity for some years. She was a patron but, in the light of the recent revelations, we have taken the decision that it would be inappropriate for her to continue to be associated with the charity. We would like to thank her for her kindness and support in the past.\" The Children's Literacy Charity said \"given the recent information which has come to light about the Duchess of York and Jeffrey Epstein\", it had asked her to step down as patron - adding it would be \"inappropriate\" for her to continue in the role. The Teenage Cancer Trust said it had \"made the decision to end our relationship with the Duchess of York\", while the British Heart Foundation said the duchess was \"no longer serving as an ambassador\" for the charity. Meanwhile, Prevent Breast Cancer said the duchess was no longer a patron, adding: \"We have advised her of this decision and thank her for her past support.\" According to The Sun on Sunday, the duchess had emailed him in April 2011 and \"humbly apologised\" for linking him to paedophilia in the media a few weeks previously. She said in the message that he was a \"steadfast, generous and supreme friend\" to her. Her spokesperson has since said she only wrote the note because Epstein had threatened to sue her. The duchess's interview with the Evening Standard on 7 March 2011 saw her apologise for accepting £15,000 from Epstein. Read more:'Epstein is a scandal the royals can't shake'Prince Andrew's lack of royal status 'annoys him'   She told the newspaper: \"I abhor paedophilia and any sexual abuse of children and know that this was a gigantic error of judgment on my behalf. I am just so contrite, I cannot say. \"Whenever I can, I will repay the money and have nothing ever to do with Jeffrey Epstein ever again.\" But The Sun on Sunday reported that little over a month later, the duchess sent an email to the sex offender from her private account. She apologised to him and said she was \"bedridden with fear\", the paper reported. 'Her first thoughts are with his victims' In a statement at the weekend, the duchess's spokesman said: \"The duchess spoke of her regret about her association with Epstein many years ago, and as they have always been, her first thoughts are with his victims. \"Like many people, she was taken in by his lies. \"As soon as she was aware of the extent of the allegations against him, she not only cut off contact but condemned him publicly, to the extent that he then threatened to sue her for defamation for associating him with paedophilia. \"She does not resile from anything she said then. \"This email was sent in the context of advice the duchess was given to try to assuage Epstein and his threats.\""
    },
    {
        "title": "Davey accuses Trump of overseeing 'biggest threat to fight against cancer'",
        "description": "Sir Ed Davey will call on US experts fleeing an \"anti-science agenda\" to come to the UK, and pledge to make curing cancer a \"top priority\".",
        "url": "https://news.sky.com/story/davey-accuses-trump-of-overseeing-biggest-threat-to-fight-against-cancer-13436412",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-ed-davey-donald-trump_7003258.jpg?20250827233814",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-22 18:19:00",
        "Headline": "The Lib Dem leader will pledge to make curing cancer a \"top priority\" and warn that Donald Trump's policies are setting back progress.",
        "Content": "Sir Ed Davey will call on US experts fleeing an \"anti-science agenda\" to come to the UK, and pledge to make curing cancer a \"top priority\". The Liberal Democrat leader will use his keynote speech at the party's annual conference in Bournemouth today to call for a dedicated fellowship scheme to attract American scientists. The finale of the party's annual meeting will see him turn his ire on Donald Trump, having spent the past few days criticising tech titan Elon Musk and Nigel Farage's Reform UK. Sir Ed is expected to warn that \"what's happening on the other side of the Atlantic\" is the \"biggest threat to the fight against cancer\". \"The US is by far the world's biggest funder of cancer research - mostly through its National Cancer Institute,\" the leader will say. \"But since Donald Trump returned to the White House, he has cancelled hundreds of grants for cancer research projects. \"He's slashing billions of dollars from the National Cancer Institute's budget.\" Sir Ed will appeal to scientists who have had projects cancelled or funding cut to \"come here and finish it in the UK\". He believes a dedicated scheme should be established to allow them to move to work at British research institutions, without having to pay large visa fees. Sir Ed has is the only English party leader to explicitly criticise Mr Trump, and refused an invite to the state banquet with the King at Windsor Castle as part of the US president's state visit last week.  'Cast-iron guarantee' for cancer patients Sir Ed will also use his speech to pledge to boost healthcare and cancer research more widely. He is expected to tell party members: \"The UK should step up and say: if Trump won't back this research, we will. \"We'll boost funding for cancer research in the UK. We'll rebuild a National Cancer Research Institute, after it was closed under the Conservatives, to coordinate research and drive it forward. \"We'll pass a Cancer Survival Research Act to ensure funding for research into the deadliest cancers.\" He will announce a \"cast-iron guarantee\" that each patient in the UK diagnosed with cancer will start treatment within two months. Read more politics news:Farage plans to deport legal migrantsSultana aims to mend ties with Corbyn Sir Ed will also accuse Reform members of supporting the Trump administration's move to cut millions of pounds of research into mRNA vaccines, based on \"totally false conspiracy theories\". He will say they members \"enthusiastically applauded\" the decision at the party's conference earlier this month. It follows the Liberal Democrat leader refusing to rule out making a deal with Labour after the next general election to help keep Reform out of government. Speaking to Sky News political editor Beth Rigby, Sir Ed said he would \"wait to see the result of the next election\" before deciding on any agreement.  Across the conference, Sir Ed has also: The Liberal Democrats have already used the conference to announce plans for a windfall tax on big banks to help homeowners install solar panels and insulation, and propose cigarette-style health warnings on social media apps to protect children. They also want to introduce a law to ban ministers from lobbying on behalf of foreign leaders."
    },
    {
        "title": "Taxi driver who dropped off Southport attacker 'waited 50 minutes' to call 999, inquiry told ",
        "description": "The taxi driver who drove Axel Rudakubana to the scene of the&#160;Southport&#160;attack would have been expected to have called the emergency services earlier, a senior investigator has said.",
        "url": "https://news.sky.com/story/taxi-driver-who-dropped-off-southport-attacker-waited-50-minutes-to-call-999-inquiry-told-13436339",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-southport-victim_6809419.jpg?20250917171849",
        "type": "Home",
        "Author": "Duncan Gardham, security journalist",
        "Date Published": "2025-09-22 14:56:00",
        "Headline": "The inquiry at Liverpool Town Hall into the attack on a Taylor Swift-themed dance class also heard how a police sergeant paused for just six seconds before he entered the scene",
        "Content": "By Duncan Gardham, security journalist  The taxi driver who drove Axel Rudakubana to the scene of the Southport attack would have been expected to have called the emergency services earlier, a senior investigator has said. The inquiry heard driver Gary Poland, who picked Rudakubana up from his home in Banks, Lancashire, on 29 July last year, waited 50 minutes before calling 999. This was despite hearing children scream and seeing them fleeing the building in his mirror as he drove away. Bebe King, six, Elsie Dot Stancombe, seven, and Alice da Silva Aguiar, nine, were murdered at the Taylor Swift-themed class by Rudakubana, then aged 17. Rudakubana, who is being referred to in the inquiry as AR, also attempted to murder 10 others and was later jailed for a minimum of 52 years. At Liverpool Town Hall on Monday, Detective Chief Inspector Jason Pye, the senior investigating officer, said children were seen in the taxi's rear dashcam leaving the building and running alongside the vehicle - and \"you can hear the children screaming\". Mr Poland looked in the rearview mirror but still drove off, he added. The driver did not call the police until 12.36pm, 50 minutes after the attack, the inquiry was told. Nicholas Moss KC, counsel to the inquiry, asked DCI Pye: \"Would you have expected a member of the public, acting responsibly, to have called 999 as soon as they got to a place of safety, when it was safe to make that call?\" DCI Pye said: \"I would like to think morally that a call would have been made. \"There was enough evidence that he knew what was happening. You would expect a call to come in.\" Last week, during an earlier hearing, the lawyer for the families of the three girls murdered in the attack said the taxi driver was among those whose actions could have prevented what happened. DCI Pye was asked if the delay that occurred before Mr Poland called emergency services made any difference to the response. The detective chief inspector said: \"That was a consideration I had to give as the senior investigator and I don't believe it did.\" The inquiry also heard how a police sergeant paused for just six seconds before he entered the scene of the Southport attacks, armed only with a baton, to confront the killer. Sergeant Greg Gillespie was warned by a member of the public the attacker was armed with a knife. He asked over the radio for an officer equipped with a taser to join him, just as PC Luke Holden and PCSO Timothy Parry arrived. Mr Pye told the inquiry: \"Greg asked, is he ready to go in? And with, very, very little delay, they enter.\" Leaving PCSO Parry to guard the door, the two men entered the Hart Space at 11.57, six seconds after the other two officers arrived, the inquiry was told. Mr Moss said: \"There was no significant pause there at all to formulate some sort of complex plan. They go in very quickly.\" Firearms officers had been called to the scene, but the two officers did not wait, the inquiry was told. Read more from Sky News:Duchess of York dropped as patron of several charitiesHundreds of redundancies as chain to close all its stores When they got inside, they found Rudakubana on the landing and shouted at him to drop the knife, which he did, before they pushed him to the ground and arrested him, helped by PCSO Parry. Mr Poland is expected to give evidence later this week as the inquiry continues."
    },
    {
        "title": "Ex-England rugby star Tom Voyce was almost three times over the limit during fatal ford crash",
        "description": "A former England rugby star was almost three times over the drink drive limit when he drowned while trying to cross a swollen ford in his 4x4, an inquest heard.",
        "url": "https://news.sky.com/story/ex-england-rugby-star-tom-voyce-was-almost-three-times-over-the-limit-during-fatal-ford-crash-13436376",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-tom-voyce-england_7028766.jpg?20250922173746",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-22 16:30:00",
        "Headline": "The body of Tom Voyce, who won nine caps for England, was found in deep water four days after he went missing.",
        "Content": "A former England rugby star was almost three times over the drink drive limit when he drowned while trying to cross a swollen ford in his 4x4, an inquest heard. Tom Voyce, 43, died trying to cross Northumberland's River Aln in his Toyota Hilux in December during Storm Darragh. The body of Voyce, who won nine caps for England before retiring in 2013, was found four days later in deep water following a major search. Voyce had attended a shoot at his brother-in-law's farm on 7 December last year before spending the evening with him at the Queen's Head pub, Glanton. An inquest heard he had not taken his usual route home in the conditions that night. Coroner Andrew Hetherington ruled the death as an accident. After his death, Anna Voyce, Voyce's widow with whom she has one son, said in a statement: \"Absolutely devastated and heartbroken doesn't even describe how we feel.\" Hugh Wood, the brother of Voyce's widow, told the hearing he last saw him at around 11.45pm in the bar. The shoot had welcomed around 16 guests but was hampered by the weather. People had helped themselves to a bottle of port during the day, Mr Wood said, before the event ended at 5.30pm when everyone was extremely wet. Mr Wood, who said the storm left local roads water-logged, added that alcohol was consumed at the pub but he did not observe any ill-effects in Voyce that evening. The distance from there to Voyce's home in Alnwick was around eight miles, Mr Wood estimated. The next day Mrs Voyce raised the alarm when her husband failed to come home, with Mr Wood saying \"it dawned on us to look in the fords and that's where we came across his vehicle\". Pathologist Dr Clive Bloxham told the hearing that the cause of death was immersion in water. He was found by a diver on 12 December in two metres of water in a mill pond and there were no signs of external damage. Read More: Wife of ex-England rugby player Tom Voyce says she is 'devastated and heartbroken' by his death Dr Bloxham said there were no signs of drugs \"but he did have a high blood alcohol level\". There was a reading of 215mg of alcohol per 100ml of blood. The drink drive limit is 80mg. Dr Bloxham said: \"Despite the possibility of tolerance to drinking alcohol, this level would be expected to have impaired his co-ordination and judgement. \"You would expect him to have a significant degree of intoxication with this level and impaired decision-making prior to his death.\" Queen's Head publican, Lisa Chisholm, estimated Voyce had drunk around four bottles of Magners cider and bought drinks for other people. Detective Constable Victoria Henderson said part of the Hilux's number plate had broken off at the water's edge, indicating the vehicle had approached Abberwick ford at speed. The vehicle was found in reverse gear, which led to the belief that Voyce may have tried to go back the way he came when the vehicle stalled in the water. It was subsequently damaged by repeatedly hitting a footbridge near the ford, before water levels dropped, allowing it under the bridge. DC Henderson said it was unclear if he tried to get out of the vehicle himself or he had been swept away by the force of the water. The flooding would have given the illusion the road was flat when in reality the ford dropped 6ft, the inquest heard."
    },
    {
        "title": "Why Ed Davey is taking the fight to Farage - despite the Lib Dems and Reform sharing few voters",
        "description": "What was striking about our interview with Sir Ed Davey on Monday is the extent to which Nigel Farage is living rent-free in the Liberal Democrat leader's head.",
        "url": "https://news.sky.com/story/why-ed-davey-is-taking-the-fight-to-farage-despite-the-lib-dems-and-reform-sharing-few-voters-13436444",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-beth-rigby-ed-davey_7028708.jpg?20250922161658",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-09-22 19:53:00",
        "Headline": "Ed Davey has increased his attacks on Reform, as he defines how the battle for British politics is shaping up.",
        "Content": "\n          Political editor\n              @BethRigby\n  What was striking about our interview with Sir Ed Davey on Monday is the extent to which Nigel Farage is living rent-free in the Liberal Democrat leader's head. He kicked off our interview warning of that in Donald Trump's America, people are \"really fearful for democracy\" and that the Reform UK leader, Mr Farage, is intent on mimicking those politics here: \"I think he wants Britain to be like Trump's America\". In some ways, Sir Ed's attacks on Reform and Mr Farage make little sense, because as the leader of the Liberal Democrats, it is the Conservatives that would typically be where the competition lies. In the last general election, 58 of the Lib Dem's 60 seat gains came from the Tories. But in another way, the Lib Dem leader is giving an insight into how the battle in British politics is shaping up: Reform versus - in the words of Sir Ed - the \"mainstream\", as he seeks to cast Mr Farage as a right-wing populist, importing Trump's values to Britain. The logic of this is clear: While Reform and the Lib Dems are not typically fishing in the same pool of voters, there are gains to be made for Sir Ed's party by taking such a strong position against Reform, while also hooking Mr Farage to President Trump. Lib Dem insiders tell me this strategy helps them kick on against the Tories in the Conservative heartlands that dislike Trump, while criticism of the US president and his sidekick Elon Musk also appeals to Labour voters who don't much like Sir Keir Starmer's kowtowing to Trump. \"It is obvious, is it not, that mainstream politicians of all the mainstream parties don't want to undermine our democracy, don't want to take it in the direction of Trump's America like Nigel Farage,\" Ed Davey told me in our interview on Sky News. \n                  Sir Ed Davey refuses to rule out deal with Sir Keir Starmer to stop Reform winning power\n                 \n                  Lib Dems pledge windfall tax on banks to lower household energy bills\n                 \n                  Sir Ed Davey brands Elon Musk a criminal and calls for his arrest for 'allowing online harm to children'\n                 \"People look at Trump's America and what he's doing to it and are really fearful for democracy, for people's rights as well as for basic services like the health service, like the economy, Trump's doing a really bad job. \"But unfortunately, in our country, we're seeing politicians who want to mimic that, particularly people like Nigel Farage.\" But for all the criticism Sir Ed levelled against Reform, and its leader, he can't match Mr Farage when it comes to polling.  The Lib Dems have failed to make any progress since the general election as the public continues to turn away from the traditional big two - Labour and the Conservatives. Reform seems to be hoovering up voters' disillusionment, with support for the party growing from 14% at the general election to around 29% now, while the Lib Dems have nudged up just 3 percentage points to 15%. After a rather muted year since the general election, and under growing criticism that the Lib Dems aren't cutting through, Sir Ed wants to take the fight to Reform and is becoming more vocal about this endeavour. Just as Sir Keir Starmer has warned in recent days that Britain is in the \"fight of our times\" between \"patriotic renewal, and decline and toxic division\", so Sir Ed is clear he has a \"moral duty\" to keep Reform out of power. We are seeing how the contours of British politics are shaping up as Labour, the Liberal Democrats and the Greens all up the attacks on Reform, each for their own reasons, but each with the same effect of pitting progressive politics against what they dub Reform's right-wing populism. It is telling that Sir Ed was crystal clear in our interview today that he would never do any deal with Mr Farage, while refusing to rule out doing something with Labour to keep the Reform leader out of power, because while an election is a long way out, the dividing lines are becoming clearer between Reform's way of doing politics versus those politicians who stand for \"progressive\" Britain. Sir Ed may be known for his stunts, but at this conference, he's delivering a serious message - with hints at a more collective endeavour to try to turn the tide on Reform's surge."
    },
    {
        "title": "Davey accuses Trump of overseeing 'biggest threat to fight against cancer'",
        "description": "Sir Ed Davey will call on US experts fleeing an \"anti-science agenda\" to come to the UK, and pledge to make curing cancer a \"top priority\".",
        "url": "https://news.sky.com/story/davey-accuses-trump-of-overseeing-biggest-threat-to-fight-against-cancer-13436412",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-ed-davey-donald-trump_7003258.jpg?20250827233814",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-22 18:19:00",
        "Headline": "The Lib Dem leader will pledge to make curing cancer a \"top priority\" and warn that Donald Trump's policies are setting back progress.",
        "Content": "Sir Ed Davey will call on US experts fleeing an \"anti-science agenda\" to come to the UK, and pledge to make curing cancer a \"top priority\". The Liberal Democrat leader will use his keynote speech at the party's annual conference in Bournemouth today to call for a dedicated fellowship scheme to attract American scientists. The finale of the party's annual meeting will see him turn his ire on Donald Trump, having spent the past few days criticising tech titan Elon Musk and Nigel Farage's Reform UK. Sir Ed is expected to warn that \"what's happening on the other side of the Atlantic\" is the \"biggest threat to the fight against cancer\". \"The US is by far the world's biggest funder of cancer research - mostly through its National Cancer Institute,\" the leader will say. \"But since Donald Trump returned to the White House, he has cancelled hundreds of grants for cancer research projects. \"He's slashing billions of dollars from the National Cancer Institute's budget.\" Sir Ed will appeal to scientists who have had projects cancelled or funding cut to \"come here and finish it in the UK\". He believes a dedicated scheme should be established to allow them to move to work at British research institutions, without having to pay large visa fees. Sir Ed has is the only English party leader to explicitly criticise Mr Trump, and refused an invite to the state banquet with the King at Windsor Castle as part of the US president's state visit last week.  'Cast-iron guarantee' for cancer patients Sir Ed will also use his speech to pledge to boost healthcare and cancer research more widely. He is expected to tell party members: \"The UK should step up and say: if Trump won't back this research, we will. \"We'll boost funding for cancer research in the UK. We'll rebuild a National Cancer Research Institute, after it was closed under the Conservatives, to coordinate research and drive it forward. \"We'll pass a Cancer Survival Research Act to ensure funding for research into the deadliest cancers.\" He will announce a \"cast-iron guarantee\" that each patient in the UK diagnosed with cancer will start treatment within two months. Read more politics news:Farage plans to deport legal migrantsSultana aims to mend ties with Corbyn Sir Ed will also accuse Reform members of supporting the Trump administration's move to cut millions of pounds of research into mRNA vaccines, based on \"totally false conspiracy theories\". He will say they members \"enthusiastically applauded\" the decision at the party's conference earlier this month. It follows the Liberal Democrat leader refusing to rule out making a deal with Labour after the next general election to help keep Reform out of government. Speaking to Sky News political editor Beth Rigby, Sir Ed said he would \"wait to see the result of the next election\" before deciding on any agreement.  Across the conference, Sir Ed has also: The Liberal Democrats have already used the conference to announce plans for a windfall tax on big banks to help homeowners install solar panels and insulation, and propose cigarette-style health warnings on social media apps to protect children. They also want to introduce a law to ban ministers from lobbying on behalf of foreign leaders."
    },
    {
        "title": "Several charities cut ties with Duchess of York over Epstein email",
        "description": "Several charities have cut ties with Sarah, Duchess of York, after it emerged she sent an email apologising to paedophile financier Jeffrey Epstein for publicly disowning him.",
        "url": "https://news.sky.com/story/duchess-of-york-dropped-as-patron-of-childrens-hospice-julias-house-over-epstein-email-13436100",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sarah-ferguson-duchess-of-york_7028781.jpg?20250922175724",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-22 11:42:00",
        "Headline": "One charity, Julia's House, said it would be \"inappropriate\" for the Duchess of York to continue as a patron of the charity. It comes after it emerged she wrote an email apologising to paedophile financier Jeffrey Epstein.",
        "Content": " Several charities have cut ties with Sarah, Duchess of York, after it emerged she sent an email apologising to paedophile financier Jeffrey Epstein for publicly disowning him. The duchess - Prince Andrew's ex-wife - has been dropped as a patron of The Teenage Cancer Trust, the British Heart Foundation, children's hospice Julia's House, food allergy charity The Natasha Allergy Research Foundation, the Children's Literacy Charity, the National Foundation for Retired Service Animals and the organisation Prevent Breast Cancer. It comes after it emerged she had written a gushing message to Epstein, describing him as her \"supreme friend\". Julia's House said: \"Following the information shared this weekend on the Duchess of York's correspondence with Jeffrey Epstein, Julia's House has taken the decision that it would be inappropriate for her to continue as a patron of the charity. \"We have advised the Duchess of York of this decision and thank her for her past support.\" Nadim and Tanya Ednan-Laperouse, founders of The Natasha Allergy Research Foundation, said: \"We were disturbed to read of Sarah, Duchess of York's, correspondence with Jeffrey Epstein. \"Sarah Ferguson has not been actively involved with the charity for some years. She was a patron but, in the light of the recent revelations, we have taken the decision that it would be inappropriate for her to continue to be associated with the charity. We would like to thank her for her kindness and support in the past.\" The Children's Literacy Charity said \"given the recent information which has come to light about the Duchess of York and Jeffrey Epstein\", it had asked her to step down as patron - adding it would be \"inappropriate\" for her to continue in the role. The Teenage Cancer Trust said it had \"made the decision to end our relationship with the Duchess of York\", while the British Heart Foundation said the duchess was \"no longer serving as an ambassador\" for the charity. Meanwhile, Prevent Breast Cancer said the duchess was no longer a patron, adding: \"We have advised her of this decision and thank her for her past support.\" According to The Sun on Sunday, the duchess had emailed him in April 2011 and \"humbly apologised\" for linking him to paedophilia in the media a few weeks previously. She said in the message that he was a \"steadfast, generous and supreme friend\" to her. Her spokesperson has since said she only wrote the note because Epstein had threatened to sue her. The duchess's interview with the Evening Standard on 7 March 2011 saw her apologise for accepting £15,000 from Epstein. Read more:'Epstein is a scandal the royals can't shake'Prince Andrew's lack of royal status 'annoys him'   She told the newspaper: \"I abhor paedophilia and any sexual abuse of children and know that this was a gigantic error of judgment on my behalf. I am just so contrite, I cannot say. \"Whenever I can, I will repay the money and have nothing ever to do with Jeffrey Epstein ever again.\" But The Sun on Sunday reported that little over a month later, the duchess sent an email to the sex offender from her private account. She apologised to him and said she was \"bedridden with fear\", the paper reported. 'Her first thoughts are with his victims' In a statement at the weekend, the duchess's spokesman said: \"The duchess spoke of her regret about her association with Epstein many years ago, and as they have always been, her first thoughts are with his victims. \"Like many people, she was taken in by his lies. \"As soon as she was aware of the extent of the allegations against him, she not only cut off contact but condemned him publicly, to the extent that he then threatened to sue her for defamation for associating him with paedophilia. \"She does not resile from anything she said then. \"This email was sent in the context of advice the duchess was given to try to assuage Epstein and his threats.\""
    },
    {
        "title": "Two men who murdered e-bike riders after mistaking them for burglars jailed for life",
        "description": "Two men who murdered e-biker riders they mistook for burglars have been jailed for life.",
        "url": "https://news.sky.com/story/two-men-who-murdered-e-bike-riders-after-mistaking-them-for-burglars-jailed-for-life-13436396",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-charles-pardoe-alex-rose_7028729.jpg?20250922212138",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-22 17:13:00",
        "Headline": "Alex Rose thought William Birchard and Darren George were trying to burgle his home but a court heard they hadn't been \"anywhere near\" the property.",
        "Content": "Two men who murdered e-biker riders they mistook for burglars have been jailed for life. Landscape gardener Alex Rose, 30, deliberately drove his black pick-up truck into William Birchard, 21, and Darren George, 22, while going the wrong way along a motorway slip road in Sunbury-on-Thames, Surrey. It followed a 60mph chase, with passenger Charles Pardoe, 25, next to him, after Rose had thought they were trying to burgle his home in Sunbury on 22 July last year. But Guildford Crown Court heard they had not been \"anywhere near\" the property, and were instead on their way to a pub in Ashford. Rose was speaking to his girlfriend, Tara Knaggs, 25, on the phone throughout the chase. Mr Birchard and Mr George drove their e-bike the wrong way round a roundabout and the wrong way down the M3/A316 slip road in an attempt to get away from the duo. Rose followed in his vehicle before driving into the back of the e-bike. He then did a three-point turn before driving past the men lying on the tarmac. \n                  'Predatory' rapist could have given HIV to hundreds of men as police launch appeal\n                 \n                  Luigi Mangione: Terrorism charges dropped against alleged killer of healthcare boss\n                 \n                  Charlie Kirk suspect Tyler Robinson appears in court - as prosecutors say they will seek death penalty\n                 Their bodies were later found on the road by a lorry driver. Mr Birchard died at the scene, suffering fractures to his skull, face and a severe brain injury. Mr George died later in hospital on the same day. Jurors found Rose and Pardoe guilty earlier this month of two counts of murder. Rose was sentenced on Monday to life with a minimum of 34 years behind bars, while Pardoe was sentenced to life with a 29-year minimum term. Knaggs, who was found guilty by the same jury of assisting the offender, was jailed for three years. A fourth defendant, Samuel Aspden, 25, another of Mr Rose's friends who had driven around the area in his own car that same evening, was cleared of both murder charges. Mr Birchard's father said in a statement: \"William was not just a victim of a senseless crime, he was our beloved son, a brother, and a friend to many. \"His life was filled with promise, and his loss has left a gap that will never be filled. \"William had a kind heart, a bright smile, and a love for life that touched everyone who knew him.\""
    },
    {
        "title": "Taxi driver who dropped off Southport attacker 'waited 50 minutes' to call 999, inquiry told ",
        "description": "The taxi driver who drove Axel Rudakubana to the scene of the&#160;Southport&#160;attack would have been expected to have called the emergency services earlier, a senior investigator has said.",
        "url": "https://news.sky.com/story/taxi-driver-who-dropped-off-southport-attacker-waited-50-minutes-to-call-999-inquiry-told-13436339",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-southport-victim_6809419.jpg?20250917171849",
        "type": "UK",
        "Author": "Duncan Gardham, security journalist",
        "Date Published": "2025-09-22 14:56:00",
        "Headline": "The inquiry at Liverpool Town Hall into the attack on a Taylor Swift-themed dance class also heard how a police sergeant paused for just six seconds before he entered the scene",
        "Content": "By Duncan Gardham, security journalist  The taxi driver who drove Axel Rudakubana to the scene of the Southport attack would have been expected to have called the emergency services earlier, a senior investigator has said. The inquiry heard driver Gary Poland, who picked Rudakubana up from his home in Banks, Lancashire, on 29 July last year, waited 50 minutes before calling 999. This was despite hearing children scream and seeing them fleeing the building in his mirror as he drove away. Bebe King, six, Elsie Dot Stancombe, seven, and Alice da Silva Aguiar, nine, were murdered at the Taylor Swift-themed class by Rudakubana, then aged 17. Rudakubana, who is being referred to in the inquiry as AR, also attempted to murder 10 others and was later jailed for a minimum of 52 years. At Liverpool Town Hall on Monday, Detective Chief Inspector Jason Pye, the senior investigating officer, said children were seen in the taxi's rear dashcam leaving the building and running alongside the vehicle - and \"you can hear the children screaming\". Mr Poland looked in the rearview mirror but still drove off, he added. The driver did not call the police until 12.36pm, 50 minutes after the attack, the inquiry was told. Nicholas Moss KC, counsel to the inquiry, asked DCI Pye: \"Would you have expected a member of the public, acting responsibly, to have called 999 as soon as they got to a place of safety, when it was safe to make that call?\" DCI Pye said: \"I would like to think morally that a call would have been made. \"There was enough evidence that he knew what was happening. You would expect a call to come in.\" Last week, during an earlier hearing, the lawyer for the families of the three girls murdered in the attack said the taxi driver was among those whose actions could have prevented what happened. DCI Pye was asked if the delay that occurred before Mr Poland called emergency services made any difference to the response. The detective chief inspector said: \"That was a consideration I had to give as the senior investigator and I don't believe it did.\" The inquiry also heard how a police sergeant paused for just six seconds before he entered the scene of the Southport attacks, armed only with a baton, to confront the killer. Sergeant Greg Gillespie was warned by a member of the public the attacker was armed with a knife. He asked over the radio for an officer equipped with a taser to join him, just as PC Luke Holden and PCSO Timothy Parry arrived. Mr Pye told the inquiry: \"Greg asked, is he ready to go in? And with, very, very little delay, they enter.\" Leaving PCSO Parry to guard the door, the two men entered the Hart Space at 11.57, six seconds after the other two officers arrived, the inquiry was told. Mr Moss said: \"There was no significant pause there at all to formulate some sort of complex plan. They go in very quickly.\" Firearms officers had been called to the scene, but the two officers did not wait, the inquiry was told. Read more from Sky News:Duchess of York dropped as patron of several charitiesHundreds of redundancies as chain to close all its stores When they got inside, they found Rudakubana on the landing and shouted at him to drop the knife, which he did, before they pushed him to the ground and arrested him, helped by PCSO Parry. Mr Poland is expected to give evidence later this week as the inquiry continues."
    },
    {
        "title": "Ex-England rugby star Tom Voyce was almost three times over the limit during fatal ford crash",
        "description": "A former England rugby star was almost three times over the drink drive limit when he drowned while trying to cross a swollen ford in his 4x4, an inquest heard.",
        "url": "https://news.sky.com/story/ex-england-rugby-star-tom-voyce-was-almost-three-times-over-the-limit-during-fatal-ford-crash-13436376",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-tom-voyce-england_7028766.jpg?20250922173746",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-22 16:30:00",
        "Headline": "The body of Tom Voyce, who won nine caps for England, was found in deep water four days after he went missing.",
        "Content": "A former England rugby star was almost three times over the drink drive limit when he drowned while trying to cross a swollen ford in his 4x4, an inquest heard. Tom Voyce, 43, died trying to cross Northumberland's River Aln in his Toyota Hilux in December during Storm Darragh. The body of Voyce, who won nine caps for England before retiring in 2013, was found four days later in deep water following a major search. Voyce had attended a shoot at his brother-in-law's farm on 7 December last year before spending the evening with him at the Queen's Head pub, Glanton. An inquest heard he had not taken his usual route home in the conditions that night. Coroner Andrew Hetherington ruled the death as an accident. After his death, Anna Voyce, Voyce's widow with whom she has one son, said in a statement: \"Absolutely devastated and heartbroken doesn't even describe how we feel.\" Hugh Wood, the brother of Voyce's widow, told the hearing he last saw him at around 11.45pm in the bar. The shoot had welcomed around 16 guests but was hampered by the weather. People had helped themselves to a bottle of port during the day, Mr Wood said, before the event ended at 5.30pm when everyone was extremely wet. Mr Wood, who said the storm left local roads water-logged, added that alcohol was consumed at the pub but he did not observe any ill-effects in Voyce that evening. The distance from there to Voyce's home in Alnwick was around eight miles, Mr Wood estimated. The next day Mrs Voyce raised the alarm when her husband failed to come home, with Mr Wood saying \"it dawned on us to look in the fords and that's where we came across his vehicle\". Pathologist Dr Clive Bloxham told the hearing that the cause of death was immersion in water. He was found by a diver on 12 December in two metres of water in a mill pond and there were no signs of external damage. Read More: Wife of ex-England rugby player Tom Voyce says she is 'devastated and heartbroken' by his death Dr Bloxham said there were no signs of drugs \"but he did have a high blood alcohol level\". There was a reading of 215mg of alcohol per 100ml of blood. The drink drive limit is 80mg. Dr Bloxham said: \"Despite the possibility of tolerance to drinking alcohol, this level would be expected to have impaired his co-ordination and judgement. \"You would expect him to have a significant degree of intoxication with this level and impaired decision-making prior to his death.\" Queen's Head publican, Lisa Chisholm, estimated Voyce had drunk around four bottles of Magners cider and bought drinks for other people. Detective Constable Victoria Henderson said part of the Hilux's number plate had broken off at the water's edge, indicating the vehicle had approached Abberwick ford at speed. The vehicle was found in reverse gear, which led to the belief that Voyce may have tried to go back the way he came when the vehicle stalled in the water. It was subsequently damaged by repeatedly hitting a footbridge near the ford, before water levels dropped, allowing it under the bridge. DC Henderson said it was unclear if he tried to get out of the vehicle himself or he had been swept away by the force of the water. The flooding would have given the illusion the road was flat when in reality the ford dropped 6ft, the inquest heard."
    },
    {
        "title": "Isabelle Rose Welsh: Family pay tribute to 'murdered' two-year-old girl",
        "description": "The family of a two-year-old girl who was allegedly murdered have paid tribute to the toddler.",
        "url": "https://news.sky.com/story/isabelle-rose-welsh-family-pay-tribute-to-murdered-two-year-old-girl-13436358",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-rose-welsh-hartington-close_7028712.jpg?20250922173127",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-22 15:28:00",
        "Headline": "A 25-year-old woman and a 21-year-old man have both been charged with murder and causing or allowing the death of a child. The man has also been charged with rape.",
        "Content": "The family of a two-year-old girl who was allegedly murdered have paid tribute to the toddler. Isabelle Rose Welsh died in hospital following an incident in Thornaby, Stockton-on-Tees, on 13 September, Cleveland Police said. In a statement issued through the force, her family said: \"Rest in peace Isabelle, fly high little girl. Forever two.\" Cleveland Police said her family were \"devastated by her death and have asked for privacy as they begin to grieve the unimaginable loss of a child\". The force added: \"Specialist officers are supporting the family and our thoughts remain with them at this very difficult time.\" Read more from Sky News:Duchess of York dropped as patron of children's hospiceFormer Tory MP faces trial accused of having false passport A 25-year-old woman and a 21-year-old man have both been charged with murder and causing or allowing the death of a child. The man has also been charged with rape. The pair appeared at Teesside Crown Court on 19 September and were remanded in custody ahead of their next court appearance on 6 November."
    },
    {
        "title": "High street chain Bodycare to close all its stores - with hundreds of redundancies ",
        "description": "High Street beauty chain Bodycare is to close its 56 remaining stores, resulting in 444 redundancies, administrators have said.",
        "url": "https://news.sky.com/story/bodycare-to-close-56-remaining-stores-with-nearly-450-to-be-made-redundant-13436337",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bodycare-shop-retailer_7012005.jpg?20250905143641",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-22 14:57:00",
        "Headline": "The chain is just the latest retailer in trouble amid intensifying complaints from the industry about tax increases announced in last autumn's budget.",
        "Content": "High Street beauty chain Bodycare is to close its 56 remaining stores, resulting in 444 redundancies, administrators have said. Last week, it announced the closure of 30 shops, having collapsed into administration earlier this month. A shortage of stock and the cost of running stores meant it was no longer viable to keep its 115 stores open, administrators said at the time. Money blog: Airport scraps liquids rule Since the appointment of administrators, roughly 150 shops have been shut, and more than 1,000 people have lost their jobs. Bodycare specialised in selling fragrances, toiletries, cosmetics and skincare products and was founded on a Lancashire market stall more than half a century ago. It employed about 1,500 people. The news follows Sky News reporting that Bodycare was seeking a buyer in an attempt to avert its collapse. \n                  Next issues scathing attack on UK economy as it reports tens of millions in profit growth \n                 \n                  'If we're not there already we're coming to a town near you' Aldi says, vowing lower prices before Christmas\n                 \n                  Good weather and Women's Euros helps UK net surprise boost to retail sales\n                 Joint administrator and managing director at restructuring and advisory business Interpath, Nick Holloway, said: \"We understand this has been a difficult period and so we want to further express our sincere thanks to Bodycare's staff who, since day one of the administration, have maintained the strong standards of presentation and customer service that Bodycare was renowned for. \"We will continue to explore options for the company's assets, including the Bodycare brand, and will provide further updates in due course.\" What happened? Bodycare had come under pressure due to rising costs, a delayed transition from its online retail platform and cost-of-living pressures on shoppers. It also said it suffered a shortfall in funding after an aborted stock market listing last year, which also hit supplier relationships and led to stock shortages. Read more:Gatwick second runway given green light by governmentTrump reveals Murdochs could be involved in TikTok deal It had been profitable before the pandemic, but like many retailers, it lost millions of pounds in the financial years immediately after. At the time, it received state financial support in the form of a multimillion-pound loan from one of the Treasury's pandemic funding schemes. Just weeks ago, the retailer secured a £7m debt facility to buy it short-term breathing space. The brand was established by Graham and Margaret Blackledge in Skelmersdale in 1970, and sold branded products made by the likes of L'Oreal, Nivea and Elizabeth Arden. It was run by retail veteran Tony Brown, who held senior roles at BHS and Beales, the now-defunct department store groups. Just the latest retailer in trouble Bodycare is just the latest in a series of high street chains to face collapse this year, amid intensifying complaints from the industry about tax increases announced in last autumn's budget. In recent weeks, River Island and Poundland both narrowly avoided administration after winning creditor approval for restructuring plans involving store closures and job losses."
    },
    {
        "title": "Sir Ed Davey refuses to rule out deal with Sir Keir Starmer to stop Reform winning power",
        "description": "Sir Ed Davey has refused to rule out striking a deal with Sir Keir Starmer in order to stop Nigel Farage from entering Number 10.",
        "url": "https://news.sky.com/story/sir-ed-davey-refuses-to-rule-out-deal-with-sir-keir-starmer-to-stop-reform-winning-power-13436215",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ed-davey-lib-dems_7025218.jpg?20250922171421",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-22 10:44:00",
        "Headline": "The Liberal Democrat leader says he believes his party can challenge Nigel Farage by winning seats that used to vote Tory.",
        "Content": " Sir Ed Davey has refused to rule out striking a deal with Sir Keir Starmer in order to stop Nigel Farage from entering Number 10. Speaking to Sky News' political editor Beth Rigby, the Liberal Democrat leader said he would \"wait to see the result of the next election\" before deciding on any agreement with Labour. Asked whether he would ever do a deal with Sir Keir, the party chief said: \"Look, when it comes to deals with other parties beyond Reform, let's wait to see the result of the next election.\" Analysis: Why Davey is taking the fight to Farage Sir Ed, who was speaking during the party's conference in Bournemouth, categorically ruled out doing any kind of deal with Mr Farage's party, despite its current lead in the polls. He said: \"That's not going to happen. The truth is with the Reform Party, they represent values which are the complete polar opposite.\" The Lib Dem leader said he believed Mr Farage was seeking to mimic the politics of US President Donald Trump. \n                  Why Ed Davey is taking the fight to Farage - despite the Lib Dems and Reform sharing few voters\n                 \n                  Lib Dems pledge windfall tax on banks to lower household energy bills\n                 \n                  Sir Ed Davey brands Elon Musk a criminal and calls for his arrest for 'allowing online harm to children'\n                 \"I think people are worried about the direction of our country, because often in the past, sometimes we have seen a bit of American influence in our country,\" he said. \"We're seeing a lot more of it. And people look at Trump's America and what he's doing to it and are really fearful for democracy.\" 'If we win the right seats, it stops Reform getting a majority' Asked whether he felt he had a \"moral responsibility\" to keep Reform out of power by forming an alliance with other progressive parties, Sir Ed suggested it was not necessary because \"we can stop Reform by ourselves\". \"If Liberal Democrats keep winning seats and build on our best result for 100 years, at the last general election, we can stop Reform by ourselves,\" he said. \"We can deprive them of the seats that they would need to form a majority. And then the arithmetic of them getting to power falls to pieces. \"If we win the right seats, it stops them getting a majority and I am determined to target our resources to stop them winning the seats that will put them into power. And that's because in our elections, it's seat by seat, so many seats we took off the Tories last time, if we hadn't done, Reform might have done.\" He added: \"We didn't have pacts last time. We're not going to have pacts in the future.\" Sir Ed has been the only English party leader to explicitly criticise Mr Trump, and even refused an invitation to the state banquet with the King at Windsor Castle as part of the US president's state visit last week.  He has also criticised on Sky News' Sunday Morning with Trevor Phillips the president's former ally Elon Musk, branding the billionaire tech tycoon a \"criminal\" for \"allowing online harm to children\" on his social media platform X. The Lib Dem leader refused to apologise for the remark and denied it was \"irresponsible\" to call Mr Musk a criminal when no charges had been laid against him. He said he was not concerned about being sued by Mr Musk - who has previously called Sir Ed a \"snivelling cretin\". Will Davey continue with his stunts? Elsewhere in the interview, Sir Ed was challenged about his leadership style and whether the publicity stunts he famously relied on in the election were \"appropriate\" when the country was going through profound political and economic challenges. Beth Rigby highlighted reports showing that his own MPs had expressed a desire for their leader to \"drop bullshit stunts and raise your game\".  Read more from Sky News:Gatwick second runway given green lightWhat will UK's 'recognition' of Palestine achieve? In response, Sir Ed said he didn't think politics was \"a joke\" and that he was able to make \"serious points\" while engaging in stunts to attract attention. \"What happened was the cameras came there and they interviewed me and allowed me to give my serious points,\" he said. \"And, in previous elections, we haven't been able to do that. And when I was able to give the serious points on behalf of Liberal Democrats, we got our best result for 100 years.\" He added: \"The huge number of MPs who want to be part of my stunt suggests that they want to be part of it. \"We're not just stuffy old politicians, we're ordinary people like them\". On the question of whether he would lead the Liberal Democrats into the next election, Sir Ed replied: \"Yes.\""
    },
    {
        "title": "Why Ed Davey is taking the fight to Farage - despite the Lib Dems and Reform sharing few voters",
        "description": "What was striking about our interview with Sir Ed Davey on Monday is the extent to which Nigel Farage is living rent-free in the Liberal Democrat leader's head.",
        "url": "https://news.sky.com/story/why-ed-davey-is-taking-the-fight-to-farage-despite-the-lib-dems-and-reform-sharing-few-voters-13436444",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-beth-rigby-ed-davey_7028708.jpg?20250922161658",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-09-22 19:53:00",
        "Headline": "Ed Davey has increased his attacks on Reform, as he defines how the battle for British politics is shaping up.",
        "Content": "\n          Political editor\n              @BethRigby\n  What was striking about our interview with Sir Ed Davey on Monday is the extent to which Nigel Farage is living rent-free in the Liberal Democrat leader's head. He kicked off our interview warning of that in Donald Trump's America, people are \"really fearful for democracy\" and that the Reform UK leader, Mr Farage, is intent on mimicking those politics here: \"I think he wants Britain to be like Trump's America\". In some ways, Sir Ed's attacks on Reform and Mr Farage make little sense, because as the leader of the Liberal Democrats, it is the Conservatives that would typically be where the competition lies. In the last general election, 58 of the Lib Dem's 60 seat gains came from the Tories. But in another way, the Lib Dem leader is giving an insight into how the battle in British politics is shaping up: Reform versus - in the words of Sir Ed - the \"mainstream\", as he seeks to cast Mr Farage as a right-wing populist, importing Trump's values to Britain. The logic of this is clear: While Reform and the Lib Dems are not typically fishing in the same pool of voters, there are gains to be made for Sir Ed's party by taking such a strong position against Reform, while also hooking Mr Farage to President Trump. Lib Dem insiders tell me this strategy helps them kick on against the Tories in the Conservative heartlands that dislike Trump, while criticism of the US president and his sidekick Elon Musk also appeals to Labour voters who don't much like Sir Keir Starmer's kowtowing to Trump. \"It is obvious, is it not, that mainstream politicians of all the mainstream parties don't want to undermine our democracy, don't want to take it in the direction of Trump's America like Nigel Farage,\" Ed Davey told me in our interview on Sky News. \n                  Sir Ed Davey refuses to rule out deal with Sir Keir Starmer to stop Reform winning power\n                 \n                  Lib Dems pledge windfall tax on banks to lower household energy bills\n                 \n                  Sir Ed Davey brands Elon Musk a criminal and calls for his arrest for 'allowing online harm to children'\n                 \"People look at Trump's America and what he's doing to it and are really fearful for democracy, for people's rights as well as for basic services like the health service, like the economy, Trump's doing a really bad job. \"But unfortunately, in our country, we're seeing politicians who want to mimic that, particularly people like Nigel Farage.\" But for all the criticism Sir Ed levelled against Reform, and its leader, he can't match Mr Farage when it comes to polling.  The Lib Dems have failed to make any progress since the general election as the public continues to turn away from the traditional big two - Labour and the Conservatives. Reform seems to be hoovering up voters' disillusionment, with support for the party growing from 14% at the general election to around 29% now, while the Lib Dems have nudged up just 3 percentage points to 15%. After a rather muted year since the general election, and under growing criticism that the Lib Dems aren't cutting through, Sir Ed wants to take the fight to Reform and is becoming more vocal about this endeavour. Just as Sir Keir Starmer has warned in recent days that Britain is in the \"fight of our times\" between \"patriotic renewal, and decline and toxic division\", so Sir Ed is clear he has a \"moral duty\" to keep Reform out of power. We are seeing how the contours of British politics are shaping up as Labour, the Liberal Democrats and the Greens all up the attacks on Reform, each for their own reasons, but each with the same effect of pitting progressive politics against what they dub Reform's right-wing populism. It is telling that Sir Ed was crystal clear in our interview today that he would never do any deal with Mr Farage, while refusing to rule out doing something with Labour to keep the Reform leader out of power, because while an election is a long way out, the dividing lines are becoming clearer between Reform's way of doing politics versus those politicians who stand for \"progressive\" Britain. Sir Ed may be known for his stunts, but at this conference, he's delivering a serious message - with hints at a more collective endeavour to try to turn the tide on Reform's surge."
    },
    {
        "title": "Police appeal to trace further 18 people linked to disorder at Unite the Kingdom march",
        "description": "Police have appealed for help to identify an additional 18 people suspected of public order offences and assaults on emergency workers on the day of the Unite the Kingdom march.",
        "url": "https://news.sky.com/story/police-appeal-to-trace-further-18-people-linked-to-disorder-at-unite-the-kingdom-march-13436076",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-protest-london-met-police_7028234.jpg?20250922041340",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-22 03:14:00",
        "Headline": "Between 110,000 and 150,000 people turned out for far-right activist Tommy Robinson's rally on 13 September in central London.",
        "Content": "Police have appealed for help to identify an additional 18 people suspected of public order offences and assaults on emergency workers on the day of the Unite the Kingdom march. Between 110,000 and 150,000 people attended the rally in central London on 13 September, the Metropolitan Police estimates. Protesters heard a number of speeches, including from far-right activist Tommy Robinson, who organised the rally and called it the \"biggest freedom of speech\" event in British history. An anti-racism counter-protest, attended by about 5,000 campaigners, also took place, with the two groups clashing on Whitehall and Trafalgar Square, separated by lines of police. Police previously said 24 people were arrested at the protests, 23 of whom are believed to have been involved in the Unite the Kingdom rally, while one was believed to be involved in the counter-protest. The force launched an appeal to identify 11 people last week, one of whom was identified. Officers now want to speak to a further 18 people \"in connection with a range of public order offences and assaults on emergency workers\" and have released 16 new images. The Met previously said 26 officers were assaulted with kicks and punches, adding: \"Bottles, flares and other projectiles were also thrown and concerted attempts were made to get past barriers.\" \"Our post-event investigation continues and officers have looked through hundreds of hours of CCTV footage to review evidence to help with further inquiries,\" said Detective Chief Inspector Natalie Norris. \"We have 28 people we want to speak to in connection with a range of offences - and we are again appealing for the public's help to track them down.\" Read more from Sky News:UK to push peace plan at UN summitGatwick second runway given green light People may have travelled from outside London, so she said she was asking people \"across the country\" to look at a number of pictures that have been released and to get in touch if they recognise anyone."
    },
    {
        "title": "With one of his proudest achievements on the line, will Trump force Netanyahu's hand?",
        "description": "The moment could have felt so different. It should have felt so different.",
        "url": "https://news.sky.com/story/if-there-is-any-hope-for-an-end-to-the-war-in-gaza-it-rests-with-donald-trump-13436486",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-air-force-one_7028475.jpg?20250922120204",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-09-22 21:52:00",
        "Headline": "The countries which have recognised Palestine at the UN in New York are jumping to the endpoint and hope to now fill in the gaps. But for an end to the Gaza conflict, only one man can possibly influence Israel's prime minister.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  The moment could have felt so different. It should have felt so different. It was supposed to come a long time ago, and it was supposed to be the outcome of a peace process, of reconciliation, of understanding, of coexistence and of healing. If it had happened the right way, then we'd be celebrating two states living alongside each other, coexisting, sharing a capital city. As it happened: France recognises Palestinian state Instead, the recognition of Palestine as a state comes out of the rubble of Gaza. It has come as a last-ditch effort to save all vanishing chances of a Palestinian state. Essentially, the countries which have recognised Palestine here at the UN in New York are jumping to the endpoint and hope to now fill in the gaps. Those gaps are huge. Even before the horror of the Hamas attack on 7 October 2023, there was almost no realistic prospect of a two-state solution.  Israeli settlement expansion in the West Bank and Benjamin Netanyahu's divide-and-conquer strategy for the Palestinian Authority in the West Bank and Hamas in Gaza had made reconciliation increasingly hard. The Hamas attack set back what little hope there was even further, while settlement expansion by the Israelis in the West Bank accelerated since then. The same questions which have made all this so intractable remain. How to share a capital city? Who controls Jerusalem's Old City, where the holy sites are located? If it's shared, then how? What happens to the settlements in the West Bank? If land swaps take place, then where? What happens to Gaza? Who governs the Palestinians? And how are the moderates on both sides emboldened to dominate the discourse and the policy?  Hope rests with Trump Right now, Palestinian extremism is holding out in Gaza with the hostages, and Israeli extremism is dominant on the other side, with Netanyahu now threatening to fully annex the West Bank as a reaction to the recognition declarations at the UN. It all feels pretty bleak and desperate. If there is cause for some hope, it rests with Donald Trump. Over the next 24 hours in New York, he will meet key Arab and Muslim leaders from the Middle East and Asia to present his latest plan for peace in Gaza. Saudi Arabia, the United Arab Emirates, Qatar, Egypt, Jordan, Turkey, Indonesia, and Pakistan will all participate in the meeting. They will listen to his plan, some may offer peacekeeping troops (a significant development if they do), some may offer to provide funding to rebuild the strip and, crucially, all are likely to tell him that his Abraham Accords plan - to forge ahead with diplomatic normalisation between Muslim nations and Israel - will not happen if Israel pushes ahead with any West Bank annexation. Netanyahu will address the UN at the end of the week, before travelling to the White House on Monday, where he will tell Trump what he plans to do next in both Gaza and the West Bank. Read more from Sky News:Typhoon brings 183mph winds as thousands evacuatedFlights suspended at European airport after drone sightings If Trump wants his Abraham Accords to expand and not collapse - and remember the accords represent a genuine diplomatic game changer for the region, one Trump is rightly proud of - then he will force Netanyahu to stop in Gaza and stop in the West Bank. He is the only man in the world who can."
    },
    {
        "title": "China to evacuate 400,000 after 'super' typhoon hits Philippines and Taiwan",
        "description": "China&#160;will evacuate 400,000 people over a super typhoon that slammed into the Philippines and Taiwan today.",
        "url": "https://news.sky.com/story/china-to-evacuate-400000-after-super-typhoon-hits-philippines-and-taiwan-13436340",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-philippines-typhoon_7028298.jpg?20250922081823",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-22 15:00:00",
        "Headline": "Super Typhoon Ragasa has registered winds of 134mph, halting flights and ferries.",
        "Content": " China will evacuate 400,000 people over a super typhoon that slammed into the Philippines and Taiwan today. Super Typhoon Ragasa, which is heading to southeastern China, has sustained winds of 134mph. Thousands of people have already been evacuated from homes and schools in the Philippines and Taiwan, with hundreds of thousands more to leave their homes in China. Filipino forecasters said it slammed into Panuitan Island off Cagayan province with gusts of up to 183mph on Monday. More than 8,200 were evacuated to safety in Cagayan while 1,220 fled to emergency shelters in Apayao, which is prone to flash floods and landslides. Domestic flights were suspended in northern provinces hit by the typhoon, and fishing boats and inter-island ferries were prohibited from leaving ports over rough seas. In Taiwan's southern Taitung and Pingtung counties, closures were ordered in some coastal and mountainous areas along with the Orchid and Green islands. \n                  Thunderstorms and rain warnings issued for parts of UK\n                 \n                  New storm names for 2025-26 released: How are they chosen and why?\n                 \n                  Bank holiday temperatures to climb close to 30C today before rain arrives\n                 Officials in southern Chinese tech hub, Shenzhen, said they planned to relocate around 400,000 people including people in low-lying and flood-prone areas. Shenzhen's airport added it will halt flights from Tuesday night. In Fujian province, on China's southeast coast, 50 ferry routes were suspended. According to China's National Meteorological Centre, the typhoon will make landfall in the coastal area between Shenzhen city and Xuwen county in Guangdong province on Wednesday. A tropical cyclone with sustained winds of 115mph or higher is categorised in the Philippines as a super typhoon. The term was adopted years ago to demonstrate the urgency tied to extreme weather disturbances. Ragasa was heading west and was forecast to remain in the South China Sea until at least Wednesday while passing south of Taiwan and Hong Kong, before landfall on the China mainland. The Philippines' weather agency warned there was \"a high risk of life-threatening storm surge with peak heights exceeding three metres within the next 24 hours over the low-lying or exposed coastal localities\" of the northern provinces of Cagayan, Batanes, Ilocos Norte and Ilocos Sur. Power was cut out on Calayan island and in the entire northern mountain province of Apayao, west of Cagayan, disaster officials said. There were no immediate reports of casualties from Ragasa, which is known locally in the Philippines as Nando. On Monday, Philippine president Ferdinand Marcos Jr suspended government work and all classes on Monday in the capital, Manila, and 29 provinces in the main northern Luzon region."
    },
    {
        "title": "Jailed British-Egyptian activist Alaa Abd El Fattah pardoned by Egypt's president",
        "description": "A British-Egyptian activist who has spent years in prison has been pardoned by Egypt's president, according to his lawyer.",
        "url": "https://news.sky.com/story/british-egyptian-activist-alaa-abd-el-fattah-pardoned-13436268",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-alaa-abd-el-fattah_7028623.jpg?20250922154849",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-22 12:19:00",
        "Headline": "Alaa Abd El Fattah became a prominent campaigner during protests in Cairo in 2011 that led to the ousting of former president Hosni Mubarak. In 2014, he was sentenced to 15 years in prison - later reduced to five - with another five-year term in 2021 for \"spreading fake news\".",
        "Content": " A British-Egyptian activist who has spent years in prison has been pardoned by Egypt's president, according to his lawyer. Alaa Abd El Fattah became a prominent campaigner during protests in Cairo in 2011 that led to the ousting of former president Hosni Mubarak. In 2014, he was sentenced to 15 years in prison - later reduced to five - for protesting without permission. He was released in 2019 but arrested again for sharing a Facebook post about human rights abuses in Egyptian prisons. It led to another five-year term in 2021 for \"spreading fake news\". High-profile local and international campaigns have called for his release and Egypt removed him from its \"terrorism\" list last year. Mr Abd El Fattah has British citizenship through his UK-born mother, Laila Soueif, who went on hunger strike over his case and met Sir Keir Starmer to push for her son's freedom. \n                  Laila Soueif: It's a 'miracle' mother of jailed activist is alive on day 245 of hunger strike, family says\n                 \n                  'We are being ignored': Rishi Sunak urged to prioritise case of jailed writer Alaa Abd El-Fattah\n                 \n                  Alaa Abd el-Fattah: MPs and peers call for Egypt travel advice to be changed following 'lack of progress' over jailed activist \n                 The 43-year-old also undertook multiple hunger strikes of his own to highlight his case. Today his lawyer, Khaled Ali, writing in Arabic on Facebook, posted: \"God is the judge. The president of the republic has issued a decree pardoning Alaa Abd El Fattah. Congratulations.\" His sister said on X that she and her mother were \"heading to the prison now to inquire from where Alaa will be released and when\". \"Omg I can't believe we get our lives back!\" she added. The Egyptian president's office said another five prisoners were also pardoned - but it's unclear exactly when they will all be freed. Mr Ali said he expected his client to be released from Wadi Natron prison, north of Cairo, in the next few days. Mr Abd El Fattah became known for his blogging and social media activity during the Arab Spring protests in Cairo's Tahrir Square 14 years ago. But a wide-ranging crackdown on Islamists, liberals and leftists by the new president, former army chief Abdel Fattah al Sisi, led to the activist being imprisoned for the first time. During his second spell in jail, his family said he was locked up without sunlight, exercise and books - and abused by the guards. Mr Abd El Fattah's mother - a former maths professor - and lawyer father, who died in 2014, were also both activists. Khaled Ali tried to get Mr Abd El Fattah freed in 2024, arguing his client's two years of pre-trial detention should be counted, but prosecutors resisted and said he wouldn't be allowed out until January 2027. The refusal prompted his mother to begin another long hunger strike in September last year. She only ended it two months ago following pleas from her family after she lost 35kg and became seriously ill. Read more from Sky News:The exiles with £100k bounties on their headsHorner leaves Red Bull as '£75m payout' agreed Human rights groups say tens of thousands of prisoners of conscience have been incarcerated under the current president. They allege they are denied due process and suffer abuse and torture - claims denied by Egyptian officials. Chair of the foreign affairs select committee, the MP Emily Thornberry, said on X that she was \"absolutely delighted\" about Mr Abd El Fattah's pardon. She posted: \"Laila, Mona, Sanaa and Alaa's entire family's tireless campaign for his release has been incredibly moving - their love for him was clear when I met Sanaa last year, \"I am so glad they will get to see him come home.\""
    },
    {
        "title": "Flights suspended at Copenhagen airport after drone sightings",
        "description": "Flights have been suspended at Copenhagen airport in Denmark after reports of drones in the air.",
        "url": "https://news.sky.com/story/flights-suspended-at-copenhagen-airport-after-drone-sightings-13436457",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-copenhagen-airport_7028910.jpg?20250922213743",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-22 20:38:00",
        "Headline": "Denmark's biggest airport was forced to close on Monday evening after police said two or three large drones had been seen flying in the area.",
        "Content": "Flights have been suspended at Copenhagen airport in Denmark after reports of drones in the air. Denmark's biggest airport was forced to close on Monday evening following the sightings. Police said two or three large drones had been seen flying in the area. The airport halted operations at 8.26pm local time (7.26pm UK time) according to flight tracking service FlightRadar. Around 35 flights were diverted to alternate airports, FlightRadar said. An airport spokesperson said police were working to identify the drones but declined to provide further details, citing the ongoing investigation. The airport was not confirmed to have reopened until gone midnight local time, but it warned of continued delays and cancellations. \"Passengers are requested to stay informed through their airline,\" the airport said in a statement on X. There are no details on where the drones may have come from. 'It's quite scary' Copenhagen Police Deputy Assistant Commissioner Jakob Hansen later said that the drones had \"disappeared\", with officers not having \"taken any of them\". Sky News presenter Jonathan Samuels, who was at Copenhagen airport, said passengers were stuck on aircraft about to take off, while others were in the terminal with limited information about when their flights might depart. Passenger Louise McFadzean said she was waiting at the gate about to board a flight to Heathrow when she suddenly \"saw blue lights on the runway\". \"We were told the plane we were due to get had been diverted to Sweden,\" she added. \"It's quite scary, and I don't know when I'm going to get home.\" It comes after disruption at Heathrow Airport last week following a cyber attack that also hit other major airports in Europe. The cyber attack targeted a service provider for check-in and boarding systems. Read more from Sky News:Typhoon brings 183mph winds as thousands evacuatedJailed British-Egyptian activist pardoned by Egypt's president The \"technical issue\" that hit Collins Aerospace resulted in 14 flights being cancelled at Brussels Airport on Saturday and several more at Heathrow, Berlin, Dublin, and others. Passengers complained they were unable to check in online, instead queuing for hours for staff to deal with them manually at desks and departure gates, where they were told their flights would not be taking off."
    },
    {
        "title": "What could an Israeli annexation of the West Bank look like?",
        "description": "The rock has been hurled into the lake and now the ripples are spreading. ",
        "url": "https://news.sky.com/story/what-could-an-israeli-annexation-of-the-west-bank-look-like-13436283",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-israeli-troops-hebron_7028654.jpg?20250922145608",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-09-22 12:44:00",
        "Headline": "After several Western countries recognised a Palestinian state, the more extreme ministers in the Israeli cabinet, who carry great weight, are coalescing around a single rallying cry - the demand is annexation of the West Bank.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n The rock has been hurled into the lake and now the ripples are spreading.  The UK and several other Western countries recognising a Palestinian state was never likely to be an action without consequences. So what happens next? Well, firstly, a surge of angry rhetoric from across the Israeli political spectrum, almost all of whom described this as a victory for Hamas. Gaza latest: Countries boycott French two-state solution summit Prime Minister Benjamin Netanyahu called it \"an absurd prize for terrorism\" while Yair Lapid, leader of the opposition, described recognition as \"a bad move and a reward for terror\". Former defence minister Benny Gantz said it \"emboldens Hamas and extends the war\", and Naftali Bennett, the man who may well usurp Netanyahu as prime minister next year, said recognition could lead to a \"full-blown terror state\". The forum that represents the families of hostages called it \"a catastrophic failure\". \n                  Trump has 'heated phone call' with Netanyahu over strike targeting Hamas in Qatar\n                 \n                  Israel has crossed a huge diplomatic red line with Qatar strike\n                 \n                  Six killed in rush hour bus shooting in Jerusalem\n                 'Annexation' is incredibly complicated So that's unity in condemnation. But words are one thing; actions are another. And the more extreme ministers in Netanyahu's cabinet, who carry great weight, are coalescing around a single rallying cry - the demand is annexation of the West Bank. It sounds blunt, but it is incredibly complicated. For one thing, simply defining what is meant by \"annexation\" is near-on impossible.  The West Bank, which a growing number of Israelis refer to by its biblical name of Judea and Samaria, has been subject to Israeli military occupation since 1967. In a sense, it is already partly annexed - the West Bank is dotted with settlements and outposts that are home to hundreds of thousands of Israelis. So annexation could mean supporting and expanding those developments. Read more:What recognising a Palestinian state actually meansWhy UK's Palestine move matters in the Middle East Or annexation could mean sending in more soldiers, more equipment and taking more land, potentially in the Jordan valley. It could mean pumping resources into the controversial and internationally criticised E1 settlement programme, which would divide the West Bank in half. But it could even mean the very thing that you probably think of when you hear the word \"annexation\". It could mean Israel flooding the area with soldiers and claiming the land for itself - an invasion, in other words. It might sound appealing to the likes of Israeli far-right politicians Bezalel Smotrich and Itamar Ben-Gvir. At the same time, it would infuriate Arab nations, who are already seething that Israel chose to launch an airstrike on a building in Qatar to try, seemingly unsuccessfully, to kill Hamas leaders. A loyalty test for the US Full annexation would test the loyalty of the United States, which has, so far, supported Netanyahu through thick and thin. The attack on Doha has already prompted a mild rebuke; Israel's government will not want to risk losing the backing of its most important diplomatic ally. President Trump is due to meet Arab leaders on Tuesday, who will tell him of their fears for the future of the West Bank. This will not be easy for Netanyahu. He has to balance the need to retain Trump's friendship and support with a desire to dissuade other nations from recognising the State of Palestine, along with the need to keep Arab neighbours from turning against him while keeping Smotrich and Ben-Gvir in his cabinet. So Netanyahu is going to bide his time. He will not make a decision on next steps until he has returned from visiting both the United Nations and the White House. The immediate future of the West Bank might well be decided on a flight back from America."
    },
    {
        "title": "Kim Jong Un reveals he still has 'good memories' of Donald Trump",
        "description": "Kim Jong Un has revealed he still has good memories of Donald Trump as he urged Washington to drop its demand on his nation to surrender its nuclear weapons as a precondition for resuming long-stalled diplomacy.",
        "url": "https://news.sky.com/story/kim-jong-un-reveals-he-still-has-good-memories-of-donald-trump-13436175",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-kim-jong-un_7001189.jpg?20250922113951",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-22 09:43:00",
        "Headline": "The North Korean leader is urging Washington to drop its demand on his nation to surrender its nuclear weapons as a precondition for resuming long-stalled diplomacy.",
        "Content": "Kim Jong Un has revealed he still has good memories of Donald Trump as he urged Washington to drop its demand on his nation to surrender its nuclear weapons as a precondition for resuming long-stalled diplomacy. Speaking to Pyongyang's rubber-stamp parliament on Sunday, he stressed he has no intention of ever resuming dialogue with rival South Korea, a key US ally that helped broker his previous summits with Mr Trump during the American president's first term. The North Korean leader suspended virtually all cooperation with the South following the collapse of his second summit with Mr Trump in February 2019 over disagreements about US-led sanctions against the North. Tensions on the Korean Peninsula have worsened in recent years as Mr Kim has accelerated his weapons build-up and aligned with Russia over the war in Ukraine. His comments came as South Korean President Lee Jae Myung departed for New York to attend the UN General Assembly, where he is expected to address the nuclear tensions and call on North Korea to return to talks. Mr Trump is also expected to visit South Korea next month to attend the Asia-Pacific Economic Cooperation summit, prompting media speculation that he may try to meet Mr Kim at the inter-Korean border, as they did during their third meeting in June 2019, which ultimately failed to salvage their nuclear diplomacy. During his speech at the Supreme People's Assembly, Mr Kim reiterated that he would never give up his nuclear weapons programme, which experts say he sees as his strongest guarantee of survival and the extension of his family's dynastic rule. In his speech, published by state media on Monday, he said: \"The world already knows well what the United States does after forcing other countries to give up their nuclear weapons and disarm. \"We will never lay down our nuclear weapons... There will be no negotiations, now or ever, about trading anything with hostile countries in exchange for lifting sanctions.\" He revealed he still holds \"good personal memories\" of Mr Trump and that there is \"no reason not to\" resume talks with the US if Washington \"abandons its delusional obsession with denuclearisation\". Read more:Trump wants a reunion with Kim Jong Un - the timing is curious The North Korean leader has stepped up testing activities in recent years, demonstrating weapons of various ranges designed to strike the US mainland and US allies in Asia. Analysts say his nuclear push is aimed at eventually pressuring Washington to accept the idea of the North as a nuclear power and to negotiate economic and security concessions from a position of strength. He is also trying to bolster his leverage by strengthening cooperation with traditional allies Russia and China, in an emerging partnership aimed at undercutting US influence. North Korea has sent thousands of troops and huge supplies of military equipment to Russia to help support President Vladimir Putin's war in Ukraine.  Mr Kim visited Beijing earlier this month, sharing the spotlight with Chinese President Xi Jinping and Mr Putin at a massive military parade. Experts say Mr Kim's rare foreign trip was likely intended to boost his leverage ahead of a potential resumption of talks with the US. There's growing concern in Seoul it could lose its voice in future efforts to defuse the nuclear standoff on the peninsula, as the North seeks to negotiate directly with the US. Such fears were amplified last year when Mr Kim declared he was abandoning North Korea's long-standing goal of peaceful unification with South Korea and ordered a rewriting of the North's constitution to cement the South as a permanent enemy."
    },
    {
        "title": "Jimmy Kimmel show to return after being taken off air over Charlie Kirk comments",
        "description": "Late-night talk show host Jimmy Kimmel, who was taken off the air following a row over comments about Charlie Kirk, will return on Tuesday.",
        "url": "https://news.sky.com/story/jimmy-kimmel-show-to-return-after-being-taken-off-air-over-charlie-kirk-comments-13436437",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jimmy-kimmel-emmy_7024453.jpg?20250918180335",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-22 19:34:00",
        "Headline": "Hundreds of stars had urged Americans to \"fight to defend and preserve our constitutionally protected rights\" in the wake of Kimmel's suspension.",
        "Content": " Late-night talk show host Jimmy Kimmel, who was taken off the air following a row over comments about Charlie Kirk, will return on Tuesday. The US presenter, who was accused of being \"offensive and insensitive\" because of what he said on his programme, Jimmy Kimmel Live, on Monday last week, will go back on air in his regular slot on the ABC network. Disney, which owns ABC, said in a statement: \"Last Wednesday, we made the decision to suspend production on the show to avoid further inflaming a tense situation at an emotional moment for our country. \"It is a decision we made because we felt some of the comments were ill-timed and thus insensitive. \"We have spent the last days having thoughtful conversations with Jimmy, and after those conversations, we reached the decision to return the show on Tuesday.\" Earlier on Monday, hundreds of Hollywood stars signed an open letter to defend free speech following Kimmel's suspension. Robert De Niro, Ben Affleck, Jennifer Aniston, Selena Gomez, Lin-Manuel Miranda, Tom Hanks and Meryl Streep were among those who have penned the appeal. \n                  Trump links paracetamol use in pregnancy to increased risk of autism - here's what the evidence says\n                 \n                  'I forgive him': Charlie Kirk's wife delivers tearful message - and one America needs to hear most\n                 \n                  Who is Erika Kirk? Charlie Kirk's widow and Turning Point USA's new CEO\n                 More than 430 of the stars, including comedians, directors and writers, urged Americans to \"fight to defend and preserve our constitutionally protected rights\". The letter was addressed to the American Civil Liberties Union (ACLU), and argued the decision was a \"dark moment for freedom of speech in our nation\". The letter added: \"Regardless of our political affiliation, or whether we engage in politics or not, we all love our country. \"We also share the belief that our voices should never be silenced by those in power - because if it happens to one of us, it happens to all of us.\" The list of signatures also included Emmy-winner Noah Wyle, Oscar-nominated Florence Pugh, comedian David Cross, Tony-winner Kelli O'Hara and Molly Ringwald. Pedro Pascal, Billy Crystal, Nathan Lane, Kerry Washington and Kevin Bacon have also signed the letter. The letter concluded: \"This is the moment to defend free speech across our nation. We encourage all Americans to join us, along with the ACLU, in the fight to defend and preserve our constitutionally protected rights.\" Kimmel had used his show to accuse President Trump and his allies of capitalising on conservative influencer Charlie Kirk's assassination. The TV presenter said: \"We hit some new lows over the weekend with the MAGA gang desperately trying to characterise this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it.\" Speaking about Donald Trump, he added: \"This is not how an adult grieves the murder of someone he calls a friend. This is how a four-year-old mourns a goldfish.\" \"Many in MAGA land are working very hard to capitalise on the murder of Charlie Kirk,\" he continued.  ABC pulled the show following criticism from Brendan Carr, chairman of the Federal Communications Commission (FCC). Mr Carr had threatened to \"take action\" against Disney and ABC. In an interview with conservative podcaster Benny Johnson, he said: \"We can do this the easy way or the hard way\". Mr Carr then praised the move, saying \"it is important for broadcasters to push back on Disney programming that they determine falls short of community values\". But the decision sparked a global, furious backlash from the public and high-profile figures around the world. Among them was former US president Barack Obama, who said on X: \"After years of complaining about cancel culture, the current administration has taken it to a new and dangerous level by routinely threatening regulatory action against media companies unless they muzzle or fire reporters and commentators it doesn't like.\" He added: \"This is precisely the kind of government coercion that the First Amendment was designed to prevent - and media companies need to start standing up rather than capitulating to it.\" The decision came at a time Disney and Nexstar, the network operator, had FCC business ahead of them, with the former seeking regulatory approval for ESPN's acquisition of the NFL Network and the latter needing the Trump administration's approval to complete a $6.2bn (£4.6bn) purchase of broadcast rival, Tegna. Mr Trump, who was on a state visit to the UK at the time, said Kimmel had been cut for \"bad ratings\". He had said: \"Well, Jimmy Kimmel was fired because he had bad ratings, more than anything else. \"And he said a horrible thing about a great gentleman known as Charlie Kirk.\" He added: \"Jimmy Kimmel is not a talented person. He had very bad ratings, and they should have fired him a long time ago. \"So, you know, you could call that free speech or not. He was fired for lack of talent.\""
    },
    {
        "title": "Trump links paracetamol use in pregnancy to increased risk of autism - here's what the evidence says",
        "description": "Donald Trump has claimed the use of paracetamol in pregnancy is linked to an increased risk of autism - but what does the evidence say?",
        "url": "https://news.sky.com/story/donald-trump-to-link-paracetamol-use-to-autism-heres-what-the-evidence-says-13436398",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-paracetamol-pregnancy_7028814.jpg?20250922182137",
        "type": "US",
        "Author": "Tom Clarke",
        "Date Published": "2025-09-22 17:01:00",
        "Headline": "While most doctors would advise women only to take medicines in pregnancy when necessary, avoiding paracetamol could do more harm than good.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  Donald Trump has claimed the use of paracetamol in pregnancy is linked to an increased risk of autism - but what does the evidence say? Americans consume more than 40% of all the world's paracetamol, spending in excess of $4bn a year on products containing acetaminophen (as it is known in America - or by its leading brand name, Tylenol). Autism rates in the US are also on the rise - going up from about one in 150 children in the year 2000, to around one in 30 today. There have also been a number of well-publicised studies suggesting a correlation between mothers who took paracetamol during pregnancy and the birth of a child with autism or other neurodevelopmental disorders such as ADHD. So surely something must be going on? Well, not necessarily. In studies that have suggested a link, the authors have been unable to show the drug itself led to autism instead of other factors. These include: the genetics of the parents (autism's genetic links are well established); the lifestyle or environment in which the mother lives; or most confounding of all, that the reason the mother was taking paracetamol - a viral infection perhaps - wasn't a trigger rather than the drug itself. A study showing a correlation is not the same as finding a cause. Better understanding of autism has meant the criteria for diagnosing it have expanded over the last two decades to include far more people. Diagnoses may well be rising simply because we're better at recognising it. What's more, there are numerous studies showing evidence of no link to paracetamol at all. Chief among them is a huge study from last year that included 2.5 million children in Sweden. In Sweden, a mother's use of paracetamol during pregnancy is added to her medical records. The researchers found a marginal increase in the risk of autism and paracetamol use by the mother. But crucially, when they included data for siblings born to the same mothers from pregnancies during which she took no paracetamol, the apparent link disappeared. \"Which provides a pretty strong evidence against the notion that paracetamol would cause harm,\" said Dr Viktor Ahlqvist at the Karolinska Institute in Stockholm, who led the study. Paracetamol still recommended in UK The study showed not only that paracetamol wasn't linked to autism, but that other studies, with poorer quality data were prone to seeing a pattern that wasn't there. This balance of evidence is why health authorities, including here in the UK, are confident in recommending paracetamol for use in pregnancy. In fact, it's now recommended as the safest choice, as other painkillers - even ibuprofen - have been shown to cause potential or actual harm to mother or babies. While most doctors would advise women only to take medicines in pregnancy when necessary, avoiding paracetamol could do more harm than good. \"While you're pregnant, experiencing uncontrolled fevers or some of the side effects from pain, such as high blood pressure, will be a lot more detrimental to a developing baby and a mother than paracetamol will be,\" said Dr Monique Botha, who studies bias in autism research at the University of Durham. Talking up a link between autism and paracetamol is also likely to anger people with autism or their parents, suspects Dr Botha. \"Families with autistic children are often struggling with under-resourced care and someone standing up and declaring that they've potentially found the cause of autism - when it's so misguided - isn't going to change anything for them.\" Read more from Sky News:'I forgive him': Charlie Kirk's wife delivers tearful messageAI-generated 'minister' makes debut in Albanian parliament Researchers worry too, that posing a link between a drug taken during pregnancy and autism adds unnecessary stigma to mothers of autistic children. \"We've seen this many, many times, going back to the scary stories of the 1960s, that the blame is usually on the mother and parents where a child has a condition,\" said Dr Ahlqvist. \"With this current [US] administration, they're again pointing the finger at mothers, when we have no substantial evidence to suggest that this is the case.\" US correspondent Many will welcome that Trump is putting this issue on the agenda, but there's a disconnect between his rhetoric and the strength of the evidence. The danger is two-fold – parents could be misled into believing autism can be prevented, and may avoid treating fever or pain, exposing themselves and their babies to greater risk. The president's team is also promoting a drug used to treat cancer as a potential therapy, but scientifically, the evidence remains thin. Some are likening this to 2020, when Trump speculated publicly about whether disinfectants could be used inside the body to treat COVID-19. He later said those remarks were sarcastic and not meant to be taken literally, but it led to jokes that he was encouraging people to drink bleach. Under fire from many in the medical world, who accuse him of risking more harm, the timing of this \"big announcement\" is also drawing scrutiny. Ten months after the election, the administration is keen to show it's implementing policy and a bold move on autism is something that will resonate emotionally with many families. It appeals to the populist, health-concern base – the \"Make America Healthy Again\" movement reflecting a constituency concerned about environmental toxins and the huge pharmaceutical industry. Health secretary Robert Kennedy Jr has a controversial record on vaccine-autism issues, so this taps into his legion of supporters who distrust conventional medical authorities. Big announcements in health, especially controversial ones, can shift media and public attention when an administration wants to change the news cycle from other problems. Politically, there are potential gains, but they come with risks to public health, deepening divisions in an already politically charged environment and the threat of legal action by drug manufacturers. So, if paracetamol doesn't cause autism, what's causing the Trump administration to talk about it? With echoes of previous, and all too real, drug scandals like thalidomide, it's the kind of story to generate controversy by association - however false. And the Trump White House has form when it comes to finding issues to distract from genuine controversies surrounding the president. The story also fits a key theme of US health secretary Robert F Kennedy Jr's policy moves - like on childhood vaccines - that stem from his belief that children are being harmed by an overmedicated America. But the whole point of science is that it doesn't care what you believe, it's about what the best quality evidence tells you. So far, there's been precious little of that behind the latest changes in US health policy."
    },
    {
        "title": "'I forgive him': Charlie Kirk's wife delivers tearful message - and one America needs to hear most",
        "description": "\"I forgive him.\" They were three little words, and yet, they were huge.",
        "url": "https://news.sky.com/story/i-forgive-him-charlie-kirks-wife-delivers-tearful-message-and-one-america-needs-to-hear-most-13436084",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-charlie-kirk-donald-trump_7028248.jpg?20250922074026",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2025-09-22 04:03:00",
        "Headline": "In a stadium packed to capacity, Erika Kirk's address to an assassin was delivered in tears and received with silence until the crowd grew into applause.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n  \"I forgive him.\" They were three little words, and yet, they were huge. In a stadium packed to capacity, Erika Kirk's address to an assassin was delivered in tears and received with silence until the crowd grew into applause. \"The answer to hate is not hate,\" she added. It is, perhaps, the message America needs to hear most and the one it has heard least. As it happened: Trump delivers speech at Charlie Kirk's memorial The memorial to Charlie Kirk felt like a Republican state funeral in all but name. This was MAGA in mourning, an occasion that laid bare the influence of Charlie Kirk and his politics. They had travelled in their tens of thousands to the State Farm Stadium in Glendale, Arizona. \n                  Who is Erika Kirk? Charlie Kirk's widow and Turning Point USA's new CEO\n                 \n                  Trump and Musk's 'little conversation' at Charlie Kirk memorial after bitter bust-up\n                 \n                  Charlie Kirk's widow forgives his killer\n                  They saluted a conservative icon and the dress code crafted a patriotic spectacle in red, white and blue. It was an act of remembrance on a stadium scale, huge in size and sentiment. It was also big on politics. From the president down, the Trump administration's top tier spoke of politics after 10 September, the day Charlie Kirk was killed. This was a Republican movement in one place, with one microphone, after an assassination that accelerated the tectonic shift in US politics. A week and a half since the assassination, political reaction has distilled into a war over freedom of speech and that was revisited by the president, even if he reserved most of his speech to pay homage to Charlie Kirk. The White House decanted a full team from Washington DC to Arizona. They came for reasons of sympathy and bereavement, of course. It was also an occasion laced with politics.  This was Washington's travelling roadshow swinging by the support that Charlie built. The same support was critical in helping Donald Trump back into power at the last election, and the challenge confronting the White House is in harnessing that vote in his absence and carrying it forward.  Read more:Kirk producer: 'Miracle' stopped bullet killing anyone elseArmed man charged with impersonating officer at memorial Politically, it was a full-court press to style the horses amongst the youth vote and Christian nationalists. Charlie Kirk brought them onside, and Team Trump wants to keep them there."
    },
    {
        "title": "Who is Erika Kirk? Charlie Kirk's widow and Turning Point USA's new CEO",
        "description": "The shooting of prolific conservative influencer Charlie Kirk has thrown his wife Erika Kirk into the spotlight.",
        "url": "https://news.sky.com/story/who-is-erika-kirk-charlie-kirks-widow-and-turning-point-usas-new-ceo-13436243",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-erika-kirk-charlie-kirk_7028516.jpg?20250922124448",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-22 11:30:00",
        "Headline": "The mother of Charlie Kirk's two children now heads her husband's influential non-profit, aimed at mobilising university-aged Republicans.",
        "Content": " The shooting of prolific conservative influencer Charlie Kirk has thrown his wife Erika Kirk into the spotlight. The 36-year-old Arizonian, who is the mother of Kirk's two children, has found herself addressing the nation in powerful tributes to her late husband, while promising to continue his work as the CEO of Turning Point USA, the conservative youth organisation he co-founded. It all comes after Kirk was fatally shot in the neck while addressing students at Utah Valley University on 10 September. But what do we know about Mrs Kirk, how did she meet her husband and what has she said after his death? From basketball player to Miss Arizona Mrs Kirk, born Erika Frantzve, played collegiate basketball for Regis University in Denver, Colorado, before becoming a model and winning Miss Arizona USA in 2012. She told NBC's Arizona network that she set up a non-profit called Everyday Heroes Like You when she was 17, aiming to promote various existing charitable foundations in her community. Later, she set up a faith-oriented fashion brand called Proclaim, and began her own religious podcast, Midweek Rise Up, in 2019. When did she meet Charlie Kirk? The pair met in 2018, when Kirk invited Mrs Kirk to a burger restaurant in New York, after meeting her briefly at a Turning Point USA office opening. A clip recently shared by Mrs Kirk shows her husband recounting the story of how they met to their daughter. In it, he says: \"I was asking all these questions [about] philosophy, religion, Jesus. And then I realised, mama was beautiful, smart, elegant and Christ-like, and so I said: 'Forget this job interview, I want to date you'.\" In another recent Instagram post, Mrs Kirk said they bonded early in their relationship over their mutual love of basketball and played on court together to escape \"the demands of the world for a minute\". The couple became engaged in 2020, married the following year and had their two children in 2022 and 2024. Kirk emphasised the importance of family values and Christian ideology, while also promoting polarising right-wing views on contentious topics like gun control, free speech, LGBTQ+ rights, and abortion rights. What did Erika Kirk say after her husband's death? Days after Kirk's killing on 10 September, Mrs Kirk addressed the nation in a video filmed in the studio where her husband used to record his podcast, The Charlie Kirk Show. She described him as a \"perfect\" husband and father, before addressing his killer directly. \"You have no idea of the fire that you have ignited within this wife, the cries of this widow will echo around the world like a battle cry,\" she said. \"If you thought that my husband's mission was powerful before, you have no idea, you have no idea what you just have unleashed across this entire country and this world, you have no idea.\"  She thanked President Donald Trump and vice president JD Vance and his \"phenomenal\" wife, Usha, for their support, and praised the emergency teams who tried to save her husband's life. Kirk was a significant part of the Trump administration's MAGA movement, proving particularly influential among young people. \"I promise I will never let your legacy die,\" she said, addressing her husband, vowing to make his movement the \"biggest thing this nation has ever seen\". A week later she was formally announced as Turning Point USA's CEO. The non-profit, aimed at mobilising university-age Republicans, was set up by Kirk in 2012, when he was 18, alongside fellow conservative activist Bill Montgomery. Read more:Who was Charlie Kirk? The young MAGA influencer 'admired' by TrumpAnalysis: Kirk's wife delivers the message America needs to hear mostTrump and Musk's 'little conversation' at Kirk memorial Turning Point attached itself to Mr Trump's presidential campaign in 2016, and went on to become a hugely successful entity, raising hundreds of millions of dollars as it helped to build a coalition of young conservatives around the country. The group's website says it has 450 members of staff and presences in 3,000 high schools and university campuses. Mrs Kirk says she 'forgives' husband's killer Mrs Kirk spoke again at a memorial service for her husband on Sunday 21 September, this time in front of tens of thousands of people at State Farm Stadium in Arizona.  \"My husband, Charlie, he wanted to save young men, just like the one who took his life,\" she said. \"I forgive him,\" she said, adding it was \"what Charlie would do\". \"The answer to hate is not hate, the answer we know from the gospel is love, and always love - love for our enemies and love for those who persecute us.\" A 22-year-old Utah man, Tyler Robinson, has been charged with killing Kirk."
    },
    {
        "title": "Trump and Musk's 'little conversation' at Charlie Kirk memorial after bitter bust-up",
        "description": "Donald Trump has said he and Elon Musk had a \"little conversation\" when they were seen seated together at Charlie Kirk's memorial service.",
        "url": "https://news.sky.com/story/trump-and-musks-little-conversation-at-charlie-kirk-memorial-after-bitter-bust-up-13436156",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-elon-musk_7028494.jpg?20250922122006",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-22 08:54:00",
        "Headline": "Donald Trump and Elon Musk had a spectacular public fallout earlier this year, with the US president even threatening to \"take a look\" at deporting the tech billionaire.",
        "Content": " Donald Trump has said he and Elon Musk had a \"little conversation\" when they were seen seated together at Charlie Kirk's memorial service. The US president and Mr Musk were pictured talking despite their spectacular public fallout earlier this year which has seen tensions between the pair continue throughout the summer. They were seen shaking hands before Mr Musk - who also greeted other politicians - left his seat. Asked later about the exchange, Mr Trump said: \"Well, Elon came over and said hello. \"I thought it was nice that he came over. Had a little conversation. \"We had a good relationship, but it was nice that he came over.\" Mr Musk left his role in the Trump administration at the end of May after leading the newly formed Department Of Government Efficiency (DOGE). Weeks later, in a row over the tax and spending cuts bill, Mr Trump threatened to deport the tech billionaire as their relationship reached a low point, saying, \"I don't know, we'll have to take a look\". Mr Trump and Mr Musk were at the State Farm Stadium in Glendale, Arizona, on Sunday to pay tribute to Mr Kirk after he was killed during an appearance at a Utah college campus on 10 September. The speakers addressed the crowd from behind bulletproof glass. Mr Trump said \"none of us will ever forget Charlie\", while Mr Kirk's widow, Erika, told the crowd she forgives the person who took her 31-year-old husband's life.  The shooting has stirred fear among some Americans that Mr Trump is trying to harness outrage over the killing as justification to suppress the voices of his critics and political opponents. It has also set off a debate about violence, decency and free speech in an era of deep political division. Dozens of people, from journalists and teachers to TV late show host Jimmy Kimmel, have faced suspensions or lost their jobs as prominent conservative activists and administration officials target comments or references about Mr Kirk that they deem offensive or celebratory.  Mr Musk's appearance at the memorial came as Lib Dem leader Sir Ed Davey accused him of \"allowing online harm to children\" on the multi-billionaire's social media platform X. He told Sky News' Sunday Morning with Trevor Phillips that Mr Musk is \"inciting violence\" and his social media platform is actively failing to protect children. He said if Mr Musk comes to the UK, he should be arrested."
    },
    {
        "title": "Animal handler linked to 'Tiger King' Joe Exotic mauled to death by big cat at Oklahoma preserve",
        "description": "A tiger handler linked to \"Tiger King\" Joe Exotic has been killed by one of the big cats at the Oklahoma preserve where he worked.",
        "url": "https://news.sky.com/story/animal-handler-linked-to-tiger-king-joe-exotic-mauled-to-death-by-big-cat-at-oklahoma-preserve-13436169",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ryan-easley-tiger_7028352.jpg?20250922100306",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-22 09:24:00",
        "Headline": "Ryan Easley \"lost his life in an accident involving a tiger under his care\" on Saturday, the Growler Pines Tiger Preserve in Hugo said in a statement.",
        "Content": "A tiger handler linked to \"Tiger King\" Joe Exotic has been killed by one of the big cats at the Oklahoma preserve where he worked. Ryan Easley \"lost his life in an accident involving a tiger under his care\" on Saturday, the Growler Pines Tiger Preserve in Hugo said in a statement on its Facebook page. It said: \"Ryan was a passionate advocate for wildlife conservation. His love for animals, especially Big Cats, was evident in every aspect of his life. \"He dedicated his life to the protection and care of these magnificent animals, and he believed deeply in the mission of Growler Pines - to provide a safe and forever enriching home for the animals under his care. \"Growler Pines was more than just a place of work for Ryan, it was his calling, his passion and his life's purpose. His courage, compassion and unwavering commitment to wildlife will never be forgotten. \"This tragedy is a painful reminder of both the beauty and unpredictability of the natural world. Ryan understood those risks - not out of recklessness but out of love.\" It said: \"His legacy will live on in the lives he touched, the animals he protected and the example he set for others who dedicate their lives to working with wildlife.\" \n                  Lizard gives birth without mating in 'one of rarest events in animal kingdom'\n                 \n                  Pictures of 'zombie-rabbits' with twisting black horns go viral - so are they real?\n                 \n                  Police dog that took part in Queen Elizabeth II's funeral dies after car crash\n                 The preserve - which according to its website was established as Easley's travelling big cats show ShowMe Tigers - added all tours and encounters had been cancelled until further notice. It is a private facility where people can book guided tours to meet tigers and see demonstrations on how they are trained and cared for. Animal rights group PETA said in a statement on Sunday \"it's never safe for humans to interact directly with apex predators\". It called for wild animal exhibitors \"to get out of the business now and send animals to accredited sanctuaries where they can finally live in peace\". PETA said Easley had acquired tigers from \"associate\" Joe Exotic, whose real name is Joseph Maldonado, and Bhagavan \"Doc\" Antle, also a star of the Netflix series.  "
    },
    {
        "title": "Kim Jong Un reveals he still has 'good memories' of Donald Trump",
        "description": "Kim Jong Un has revealed he still has good memories of Donald Trump as he urged Washington to drop its demand on his nation to surrender its nuclear weapons as a precondition for resuming long-stalled diplomacy.",
        "url": "https://news.sky.com/story/kim-jong-un-reveals-he-still-has-good-memories-of-donald-trump-13436175",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-kim-jong-un_7001189.jpg?20250922113951",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-22 09:43:00",
        "Headline": "The North Korean leader is urging Washington to drop its demand on his nation to surrender its nuclear weapons as a precondition for resuming long-stalled diplomacy.",
        "Content": "Kim Jong Un has revealed he still has good memories of Donald Trump as he urged Washington to drop its demand on his nation to surrender its nuclear weapons as a precondition for resuming long-stalled diplomacy. Speaking to Pyongyang's rubber-stamp parliament on Sunday, he stressed he has no intention of ever resuming dialogue with rival South Korea, a key US ally that helped broker his previous summits with Mr Trump during the American president's first term. The North Korean leader suspended virtually all cooperation with the South following the collapse of his second summit with Mr Trump in February 2019 over disagreements about US-led sanctions against the North. Tensions on the Korean Peninsula have worsened in recent years as Mr Kim has accelerated his weapons build-up and aligned with Russia over the war in Ukraine. His comments came as South Korean President Lee Jae Myung departed for New York to attend the UN General Assembly, where he is expected to address the nuclear tensions and call on North Korea to return to talks. Mr Trump is also expected to visit South Korea next month to attend the Asia-Pacific Economic Cooperation summit, prompting media speculation that he may try to meet Mr Kim at the inter-Korean border, as they did during their third meeting in June 2019, which ultimately failed to salvage their nuclear diplomacy. During his speech at the Supreme People's Assembly, Mr Kim reiterated that he would never give up his nuclear weapons programme, which experts say he sees as his strongest guarantee of survival and the extension of his family's dynastic rule. In his speech, published by state media on Monday, he said: \"The world already knows well what the United States does after forcing other countries to give up their nuclear weapons and disarm. \"We will never lay down our nuclear weapons... There will be no negotiations, now or ever, about trading anything with hostile countries in exchange for lifting sanctions.\" He revealed he still holds \"good personal memories\" of Mr Trump and that there is \"no reason not to\" resume talks with the US if Washington \"abandons its delusional obsession with denuclearisation\". Read more:Trump wants a reunion with Kim Jong Un - the timing is curious The North Korean leader has stepped up testing activities in recent years, demonstrating weapons of various ranges designed to strike the US mainland and US allies in Asia. Analysts say his nuclear push is aimed at eventually pressuring Washington to accept the idea of the North as a nuclear power and to negotiate economic and security concessions from a position of strength. He is also trying to bolster his leverage by strengthening cooperation with traditional allies Russia and China, in an emerging partnership aimed at undercutting US influence. North Korea has sent thousands of troops and huge supplies of military equipment to Russia to help support President Vladimir Putin's war in Ukraine.  Mr Kim visited Beijing earlier this month, sharing the spotlight with Chinese President Xi Jinping and Mr Putin at a massive military parade. Experts say Mr Kim's rare foreign trip was likely intended to boost his leverage ahead of a potential resumption of talks with the US. There's growing concern in Seoul it could lose its voice in future efforts to defuse the nuclear standoff on the peninsula, as the North seeks to negotiate directly with the US. Such fears were amplified last year when Mr Kim declared he was abandoning North Korea's long-standing goal of peaceful unification with South Korea and ordered a rewriting of the North's constitution to cement the South as a permanent enemy."
    },
    {
        "title": "Trump reveals Rupert and Lachlan Murdoch could be involved in TikTok deal",
        "description": "Donald Trump has revealed that media mogul Rupert Murdoch and his son Lachlan could be part of a deal in which TikTok in the United States will come under American control.",
        "url": "https://news.sky.com/story/trump-reveals-rupert-and-lachlan-murdoch-could-be-involved-in-tiktok-deal-13436069",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-tiktok-donald-trump_6803725.jpg?20250922023046",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-22 01:25:00",
        "Headline": "The US president also namedropped Michael Dell, the founder and CEO of Dell Technologies, and Larry Ellison as possible participants in the deal.",
        "Content": "Donald Trump has revealed that media mogul Rupert Murdoch and his son Lachlan could be part of a deal in which TikTok in the United States will come under American control. The US president also namedropped Michael Dell, the founder and CEO of Dell Technologies, as a possible participant in the deal during an interview with Fox News, which is owned by the Murdochs. \"I think they're going to be in the group. A couple of others. Really great people, very prominent people,\" Mr Trump said. \"And they're also American patriots, you know, they love this country. I think they're going to do a really good job.\" Mr Trump said that Larry Ellison, founder and CEO of software firm Oracle, was part of the same group. His involvement in the potential TikTok deal had previously been revealed. White House press secretary Karoline Leavitt said on Saturday that Oracle would be responsible for the app's data and security, with Americans set to control six of the seven seats for a planned TikTok board. This comes after Mr Trump said he and China's Xi Jinping held a \"very productive call\" on Friday, discussing the final approval for the TikTok deal, much of which is still unknown. Once confirmed, the deal should stop TikTok from being banned in the US after lawmakers decided it posed a security risk to citizens' data. \n                  Trump and Xi discuss TikTok deal to stop US ban\n                 \n                  'We wouldn't let our children on the app': TikTok moderators warn users may be at risk after redundancies\n                 \n                  Will Trump's UK visit be make or break for Starmer?\n                 Officials warned that the algorithm TikTok uses is vulnerable to manipulation by Chinese authorities, who can use it to push specific content on the social media platform in a way that is difficult to detect. Congress had ordered the app shut down for American users by January 2025 if its Chinese owner ByteDance didn't sell its assets in the country - but the ban has been delayed four times by President Trump. Read more from Sky News:Trump delivers speech at Charlie Kirk's memorialPentagon orders journalists to agree to reporting rules Mr Trump said on Sunday that he might be \"a little prejudiced\" about TikTok, after telling reporters on Friday: \"I wasn't a fan of TikTok and then I got to use it and then I became a fan and it helped me win an election in a landslide.\" After the call with Mr Xi, Mr Trump said in a Truth Social post: \"We made progress on many very important issues, including Trade, Fentanyl, the need to bring the War between Russia and Ukraine to an end, and the approval of the TikTok Deal.\" Mr Trump later told reporters at the White House that Xi had approved the deal, but said it still needed to be signed. Representatives for the Murdochs, Mr Dell and Mr Ellison have not yet commented on a potential TikTok deal."
    },
    {
        "title": "High street chain Bodycare to close all its stores - with hundreds of redundancies ",
        "description": "High Street beauty chain Bodycare is to close its 56 remaining stores, resulting in 444 redundancies, administrators have said.",
        "url": "https://news.sky.com/story/bodycare-to-close-56-remaining-stores-with-nearly-450-to-be-made-redundant-13436337",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bodycare-shop-retailer_7012005.jpg?20250905143641",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-22 14:57:00",
        "Headline": "The chain is just the latest retailer in trouble amid intensifying complaints from the industry about tax increases announced in last autumn's budget.",
        "Content": "High Street beauty chain Bodycare is to close its 56 remaining stores, resulting in 444 redundancies, administrators have said. Last week, it announced the closure of 30 shops, having collapsed into administration earlier this month. A shortage of stock and the cost of running stores meant it was no longer viable to keep its 115 stores open, administrators said at the time. Money blog: Airport scraps liquids rule Since the appointment of administrators, roughly 150 shops have been shut, and more than 1,000 people have lost their jobs. Bodycare specialised in selling fragrances, toiletries, cosmetics and skincare products and was founded on a Lancashire market stall more than half a century ago. It employed about 1,500 people. The news follows Sky News reporting that Bodycare was seeking a buyer in an attempt to avert its collapse. \n                  Next issues scathing attack on UK economy as it reports tens of millions in profit growth \n                 \n                  'If we're not there already we're coming to a town near you' Aldi says, vowing lower prices before Christmas\n                 \n                  Good weather and Women's Euros helps UK net surprise boost to retail sales\n                 Joint administrator and managing director at restructuring and advisory business Interpath, Nick Holloway, said: \"We understand this has been a difficult period and so we want to further express our sincere thanks to Bodycare's staff who, since day one of the administration, have maintained the strong standards of presentation and customer service that Bodycare was renowned for. \"We will continue to explore options for the company's assets, including the Bodycare brand, and will provide further updates in due course.\" What happened? Bodycare had come under pressure due to rising costs, a delayed transition from its online retail platform and cost-of-living pressures on shoppers. It also said it suffered a shortfall in funding after an aborted stock market listing last year, which also hit supplier relationships and led to stock shortages. Read more:Gatwick second runway given green light by governmentTrump reveals Murdochs could be involved in TikTok deal It had been profitable before the pandemic, but like many retailers, it lost millions of pounds in the financial years immediately after. At the time, it received state financial support in the form of a multimillion-pound loan from one of the Treasury's pandemic funding schemes. Just weeks ago, the retailer secured a £7m debt facility to buy it short-term breathing space. The brand was established by Graham and Margaret Blackledge in Skelmersdale in 1970, and sold branded products made by the likes of L'Oreal, Nivea and Elizabeth Arden. It was run by retail veteran Tony Brown, who held senior roles at BHS and Beales, the now-defunct department store groups. Just the latest retailer in trouble Bodycare is just the latest in a series of high street chains to face collapse this year, amid intensifying complaints from the industry about tax increases announced in last autumn's budget. In recent weeks, River Island and Poundland both narrowly avoided administration after winning creditor approval for restructuring plans involving store closures and job losses."
    },
    {
        "title": "Trump reveals Rupert and Lachlan Murdoch could be involved in TikTok deal",
        "description": "Donald Trump has revealed that media mogul Rupert Murdoch and his son Lachlan could be part of a deal in which TikTok in the United States will come under American control.",
        "url": "https://news.sky.com/story/trump-reveals-rupert-and-lachlan-murdoch-could-be-involved-in-tiktok-deal-13436069",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-tiktok-donald-trump_6803725.jpg?20250922023046",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-22 01:25:00",
        "Headline": "The US president also namedropped Michael Dell, the founder and CEO of Dell Technologies, and Larry Ellison as possible participants in the deal.",
        "Content": "Donald Trump has revealed that media mogul Rupert Murdoch and his son Lachlan could be part of a deal in which TikTok in the United States will come under American control. The US president also namedropped Michael Dell, the founder and CEO of Dell Technologies, as a possible participant in the deal during an interview with Fox News, which is owned by the Murdochs. \"I think they're going to be in the group. A couple of others. Really great people, very prominent people,\" Mr Trump said. \"And they're also American patriots, you know, they love this country. I think they're going to do a really good job.\" Mr Trump said that Larry Ellison, founder and CEO of software firm Oracle, was part of the same group. His involvement in the potential TikTok deal had previously been revealed. White House press secretary Karoline Leavitt said on Saturday that Oracle would be responsible for the app's data and security, with Americans set to control six of the seven seats for a planned TikTok board. This comes after Mr Trump said he and China's Xi Jinping held a \"very productive call\" on Friday, discussing the final approval for the TikTok deal, much of which is still unknown. Once confirmed, the deal should stop TikTok from being banned in the US after lawmakers decided it posed a security risk to citizens' data. \n                  Trump and Xi discuss TikTok deal to stop US ban\n                 \n                  'We wouldn't let our children on the app': TikTok moderators warn users may be at risk after redundancies\n                 \n                  Will Trump's UK visit be make or break for Starmer?\n                 Officials warned that the algorithm TikTok uses is vulnerable to manipulation by Chinese authorities, who can use it to push specific content on the social media platform in a way that is difficult to detect. Congress had ordered the app shut down for American users by January 2025 if its Chinese owner ByteDance didn't sell its assets in the country - but the ban has been delayed four times by President Trump. Read more from Sky News:Trump delivers speech at Charlie Kirk's memorialPentagon orders journalists to agree to reporting rules Mr Trump said on Sunday that he might be \"a little prejudiced\" about TikTok, after telling reporters on Friday: \"I wasn't a fan of TikTok and then I got to use it and then I became a fan and it helped me win an election in a landslide.\" After the call with Mr Xi, Mr Trump said in a Truth Social post: \"We made progress on many very important issues, including Trade, Fentanyl, the need to bring the War between Russia and Ukraine to an end, and the approval of the TikTok Deal.\" Mr Trump later told reporters at the White House that Xi had approved the deal, but said it still needed to be signed. Representatives for the Murdochs, Mr Dell and Mr Ellison have not yet commented on a potential TikTok deal."
    },
    {
        "title": "Curve set for investor showdown over £120m Lloyds sale",
        "description": "The digital wallet provider Curve has scheduled a showdown with investors next week amid anger over the company's proposed &#163;120m takeover by Lloyds Banking Group.",
        "url": "https://news.sky.com/story/curve-set-for-investor-showdown-over-163120m-lloyds-sale-13436336",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-curve-payment_7013309.jpg?20250907095850",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-22 14:55:00",
        "Headline": "Curve, once-regarded as one of Britain's most promising fintechs, will hold an EGM in early October amid anger over its impending sale to Lloyds Banking Group, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The digital wallet provider Curve has scheduled a showdown with investors next week amid anger over the company's proposed £120m takeover by Lloyds Banking Group. Sky News understands that Curve has agreed to convene an extraordinary general meeting (EGM) in the first few days of October following a demand from IDC Ventures, its biggest external shareholder. Sources said on Monday that investors opposed to the terms of the sale of Lloyds were seeking the removal of both Lord Fink, the City grandee who chairs Curve, and Shachar Bialick, the fintech's founder and chief executive, as directors of the company. Money blog: Airport scraps liquids rule The EGM will reflect the hostility which has emerged between the two factions, with IDC - a 12% shareholder - angry at the proposed distribution of the sale proceeds. Curve, which has persistently ignored media enquiries about the deal, is understood to have insisted to shareholders that the transaction has been handled in a reasonable manner and in the interests of all shareholders. Last week, IDC Ventures issued a statement to Sky News in which it noted \"with concern the recent reappointment of Lord Stanley Fink as director and chairman on 31 July after the appointing shareholder had effected his removal on 29 July\". \n                  Man admits murdering customer in Derby bank branch knife attack\n                 \n                  Lloyds Bank's Charlie Nunn expects two more interest rate cuts in 2025\n                 \n                  Lloyds Banking Group in talks to buy digital wallet provider Curve\n                 IDC Ventures added: \"As long-standing investors in Curve, in almost every year since 2019, we are deeply disappointed by the board's approach to this transaction and failure to engage with us. \"The board is refusing to provide us with basic information about the transaction, or how it can lawfully be implemented without our support.\" IDC Ventures, which has appointed the London law firm Quinn Emanuel to advise it on the situation, first invested in Curve six years ago and has participated in or led several funding rounds for the company. Earlier this month, Sky News reported that Mr Bialick had acknowledged that the sale price was disappointing, and warned that the company would probably run out of money this year unless a sale to Lloyds was agreed. In total, Curve is understood to have raised at least £250m in funding since it was established. IDC Ventures added last week that it would \"act firmly and decisively to protect our commercial interests and expect the board, and Lloyds, to engage properly with our concerns before proceeding with any purchase and potentially exposing all stakeholders to prolonged and value-destructive litigation\". The fund had previously praised the company's technology and expressed a belief that it would be among the winners from the fast-evolving payments sector. \"Thanks to their unique technology... they have the capability to intercept the transaction and supercharge the customer experience, with its Double Dip Rewards, [and] eliminating nasty hidden fees,\" IDC Ventures said at the time of its Series C fundraising. \"And they do it seamlessly, without any need for the customer to change the cards they pay with.\" Lloyds hopes that buying Curve will give it an edge in the race to build smarter online payment systems amid growing regulatory pressure on Apple to open its payment services to rivals. Curve did not respond to an emailed request for comment about the timing of the shareholder meeting."
    },
    {
        "title": "Bidders serve Coca-Cola with lukewarm Costa Coffee bids ",
        "description": "A small number of suitors have served up initial bids for Costa Coffee as the chain's owner, The Coca-Cola Company, prepares to retain ownership of the brand's ready-to-drink portfolio.",
        "url": "https://news.sky.com/story/bidders-serve-coca-cola-with-lukewarm-costa-coffee-bids-13436155",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-costa-costa-coffee_6998424.jpg?20250823073628",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-22 08:57:00",
        "Headline": "Apollo Global Management, one of the parties which indicated an interest in a takeover of Britain's biggest coffee chain, decided against bidding ahead of last week's deadline, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A small number of suitors have served up initial bids for Costa Coffee as the chain's owner, The Coca-Cola Company, prepares to retain ownership of the brand's ready-to-drink portfolio. Sky News understands that Coca-Cola and its advisers set a deadline last week for indicative offers for Costa. City sources said on Monday that Apollo Global Management, the investment giant which had expressed an interest in the business, decided not to submit an offer. Other reported bidders include TDR Capital, the owner of Asda, although banking insiders said there had been a small number of proposals than expected.  Money latest: Lifetime ISA savers 'clobbered' One suggested that the value placed on Costa could be as low as £1.5bn, well under half the £3.9bn paid by Coca-Cola in 2021. \n                  High street chain Bodycare to close all its stores - with hundreds of redundancies \n                 \n                  Trump reveals Rupert and Lachlan Murdoch could be involved in TikTok deal\n                 \n                  Money blog: Airport scraps liquids rule; free £2,000 many parents don't claim; big rise in inheritance tax payments\n                 It was unclear whether Coca-Cola would be prepared to offload the business at that price. The American drinks behemoth is said to have told suitors that it would retain control of the ready-to-drink Costa range sold in supermarkets and other grocery outlets. Sky News revealed last month that Coca-Cola was exploring a disposal of Costa, which trades from more than 2,000 stores in the UK and well over 3,000 globally. It has been reported to have a global workforce numbering 35,000, although Coca-Cola has not responded to any questions from Sky News about the Costa business or sale process. Accounts filed at Companies House for Costa show that in 2023 the coffee chain recorded revenues of £1.22bn. While this represented a 9% increase on the previous year, it was below the £1.3bn recorded in 2018, the final year before Coca-Cola took control of the business. Coca-Cola has been grappling with the weak performance of Costa for some time, with Coca-Cola boss James Quincey saying on an earnings call in the summer: \"We're in the mode of reflecting on what we've learned, thinking about how we might want to find new avenues to grow in the coffee category while continuing to run the Costa business successfully. \"It's still a lot of money we put down, and we wanted that money to work as hard as possible.\" The deal was intended to provide Coca-Cola with a global platform in a growing area of the beverages market. Costa trades in dozens of countries, including India, Japan, Mexico and Poland, and operates a network of thousands of coffee vending machines internationally under the Costa Express brand. The chain was founded in 1971 by Italian brothers Sergio and Bruno Costa. It was sold to Whitbread for £19m in 1995, when it traded from fewer than 40 stores. Apollo declined to comment."
    },
    {
        "title": "Davey accuses Trump of overseeing 'biggest threat to fight against cancer'",
        "description": "Sir Ed Davey will call on US experts fleeing an \"anti-science agenda\" to come to the UK, and pledge to make curing cancer a \"top priority\".",
        "url": "https://news.sky.com/story/davey-accuses-trump-of-overseeing-biggest-threat-to-fight-against-cancer-13436412",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-ed-davey-donald-trump_7003258.jpg?20250827233814",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-22 18:19:00",
        "Headline": "The Lib Dem leader will pledge to make curing cancer a \"top priority\" and warn that Donald Trump's policies are setting back progress.",
        "Content": "Sir Ed Davey will call on US experts fleeing an \"anti-science agenda\" to come to the UK, and pledge to make curing cancer a \"top priority\". The Liberal Democrat leader will use his keynote speech at the party's annual conference in Bournemouth today to call for a dedicated fellowship scheme to attract American scientists. The finale of the party's annual meeting will see him turn his ire on Donald Trump, having spent the past few days criticising tech titan Elon Musk and Nigel Farage's Reform UK. Sir Ed is expected to warn that \"what's happening on the other side of the Atlantic\" is the \"biggest threat to the fight against cancer\". \"The US is by far the world's biggest funder of cancer research - mostly through its National Cancer Institute,\" the leader will say. \"But since Donald Trump returned to the White House, he has cancelled hundreds of grants for cancer research projects. \"He's slashing billions of dollars from the National Cancer Institute's budget.\" Sir Ed will appeal to scientists who have had projects cancelled or funding cut to \"come here and finish it in the UK\". He believes a dedicated scheme should be established to allow them to move to work at British research institutions, without having to pay large visa fees. Sir Ed has is the only English party leader to explicitly criticise Mr Trump, and refused an invite to the state banquet with the King at Windsor Castle as part of the US president's state visit last week.  'Cast-iron guarantee' for cancer patients Sir Ed will also use his speech to pledge to boost healthcare and cancer research more widely. He is expected to tell party members: \"The UK should step up and say: if Trump won't back this research, we will. \"We'll boost funding for cancer research in the UK. We'll rebuild a National Cancer Research Institute, after it was closed under the Conservatives, to coordinate research and drive it forward. \"We'll pass a Cancer Survival Research Act to ensure funding for research into the deadliest cancers.\" He will announce a \"cast-iron guarantee\" that each patient in the UK diagnosed with cancer will start treatment within two months. Read more politics news:Farage plans to deport legal migrantsSultana aims to mend ties with Corbyn Sir Ed will also accuse Reform members of supporting the Trump administration's move to cut millions of pounds of research into mRNA vaccines, based on \"totally false conspiracy theories\". He will say they members \"enthusiastically applauded\" the decision at the party's conference earlier this month. It follows the Liberal Democrat leader refusing to rule out making a deal with Labour after the next general election to help keep Reform out of government. Speaking to Sky News political editor Beth Rigby, Sir Ed said he would \"wait to see the result of the next election\" before deciding on any agreement.  Across the conference, Sir Ed has also: The Liberal Democrats have already used the conference to announce plans for a windfall tax on big banks to help homeowners install solar panels and insulation, and propose cigarette-style health warnings on social media apps to protect children. They also want to introduce a law to ban ministers from lobbying on behalf of foreign leaders."
    },
    {
        "title": "Sir Ed Davey refuses to rule out deal with Sir Keir Starmer to stop Reform winning power",
        "description": "Sir Ed Davey has refused to rule out striking a deal with Sir Keir Starmer in order to stop Nigel Farage from entering Number 10.",
        "url": "https://news.sky.com/story/sir-ed-davey-refuses-to-rule-out-deal-with-sir-keir-starmer-to-stop-reform-winning-power-13436215",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ed-davey-lib-dems_7025218.jpg?20250922171421",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-22 10:44:00",
        "Headline": "The Liberal Democrat leader says he believes his party can challenge Nigel Farage by winning seats that used to vote Tory.",
        "Content": " Sir Ed Davey has refused to rule out striking a deal with Sir Keir Starmer in order to stop Nigel Farage from entering Number 10. Speaking to Sky News' political editor Beth Rigby, the Liberal Democrat leader said he would \"wait to see the result of the next election\" before deciding on any agreement with Labour. Asked whether he would ever do a deal with Sir Keir, the party chief said: \"Look, when it comes to deals with other parties beyond Reform, let's wait to see the result of the next election.\" Analysis: Why Davey is taking the fight to Farage Sir Ed, who was speaking during the party's conference in Bournemouth, categorically ruled out doing any kind of deal with Mr Farage's party, despite its current lead in the polls. He said: \"That's not going to happen. The truth is with the Reform Party, they represent values which are the complete polar opposite.\" The Lib Dem leader said he believed Mr Farage was seeking to mimic the politics of US President Donald Trump. \n                  Why Ed Davey is taking the fight to Farage - despite the Lib Dems and Reform sharing few voters\n                 \n                  Lib Dems pledge windfall tax on banks to lower household energy bills\n                 \n                  Sir Ed Davey brands Elon Musk a criminal and calls for his arrest for 'allowing online harm to children'\n                 \"I think people are worried about the direction of our country, because often in the past, sometimes we have seen a bit of American influence in our country,\" he said. \"We're seeing a lot more of it. And people look at Trump's America and what he's doing to it and are really fearful for democracy.\" 'If we win the right seats, it stops Reform getting a majority' Asked whether he felt he had a \"moral responsibility\" to keep Reform out of power by forming an alliance with other progressive parties, Sir Ed suggested it was not necessary because \"we can stop Reform by ourselves\". \"If Liberal Democrats keep winning seats and build on our best result for 100 years, at the last general election, we can stop Reform by ourselves,\" he said. \"We can deprive them of the seats that they would need to form a majority. And then the arithmetic of them getting to power falls to pieces. \"If we win the right seats, it stops them getting a majority and I am determined to target our resources to stop them winning the seats that will put them into power. And that's because in our elections, it's seat by seat, so many seats we took off the Tories last time, if we hadn't done, Reform might have done.\" He added: \"We didn't have pacts last time. We're not going to have pacts in the future.\" Sir Ed has been the only English party leader to explicitly criticise Mr Trump, and even refused an invitation to the state banquet with the King at Windsor Castle as part of the US president's state visit last week.  He has also criticised on Sky News' Sunday Morning with Trevor Phillips the president's former ally Elon Musk, branding the billionaire tech tycoon a \"criminal\" for \"allowing online harm to children\" on his social media platform X. The Lib Dem leader refused to apologise for the remark and denied it was \"irresponsible\" to call Mr Musk a criminal when no charges had been laid against him. He said he was not concerned about being sued by Mr Musk - who has previously called Sir Ed a \"snivelling cretin\". Will Davey continue with his stunts? Elsewhere in the interview, Sir Ed was challenged about his leadership style and whether the publicity stunts he famously relied on in the election were \"appropriate\" when the country was going through profound political and economic challenges. Beth Rigby highlighted reports showing that his own MPs had expressed a desire for their leader to \"drop bullshit stunts and raise your game\".  Read more from Sky News:Gatwick second runway given green lightWhat will UK's 'recognition' of Palestine achieve? In response, Sir Ed said he didn't think politics was \"a joke\" and that he was able to make \"serious points\" while engaging in stunts to attract attention. \"What happened was the cameras came there and they interviewed me and allowed me to give my serious points,\" he said. \"And, in previous elections, we haven't been able to do that. And when I was able to give the serious points on behalf of Liberal Democrats, we got our best result for 100 years.\" He added: \"The huge number of MPs who want to be part of my stunt suggests that they want to be part of it. \"We're not just stuffy old politicians, we're ordinary people like them\". On the question of whether he would lead the Liberal Democrats into the next election, Sir Ed replied: \"Yes.\""
    },
    {
        "title": "Why Ed Davey is taking the fight to Farage - despite the Lib Dems and Reform sharing few voters",
        "description": "What was striking about our interview with Sir Ed Davey on Monday is the extent to which Nigel Farage is living rent-free in the Liberal Democrat leader's head.",
        "url": "https://news.sky.com/story/why-ed-davey-is-taking-the-fight-to-farage-despite-the-lib-dems-and-reform-sharing-few-voters-13436444",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-beth-rigby-ed-davey_7028708.jpg?20250922161658",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-09-22 19:53:00",
        "Headline": "Ed Davey has increased his attacks on Reform, as he defines how the battle for British politics is shaping up.",
        "Content": "\n          Political editor\n              @BethRigby\n  What was striking about our interview with Sir Ed Davey on Monday is the extent to which Nigel Farage is living rent-free in the Liberal Democrat leader's head. He kicked off our interview warning of that in Donald Trump's America, people are \"really fearful for democracy\" and that the Reform UK leader, Mr Farage, is intent on mimicking those politics here: \"I think he wants Britain to be like Trump's America\". In some ways, Sir Ed's attacks on Reform and Mr Farage make little sense, because as the leader of the Liberal Democrats, it is the Conservatives that would typically be where the competition lies. In the last general election, 58 of the Lib Dem's 60 seat gains came from the Tories. But in another way, the Lib Dem leader is giving an insight into how the battle in British politics is shaping up: Reform versus - in the words of Sir Ed - the \"mainstream\", as he seeks to cast Mr Farage as a right-wing populist, importing Trump's values to Britain. The logic of this is clear: While Reform and the Lib Dems are not typically fishing in the same pool of voters, there are gains to be made for Sir Ed's party by taking such a strong position against Reform, while also hooking Mr Farage to President Trump. Lib Dem insiders tell me this strategy helps them kick on against the Tories in the Conservative heartlands that dislike Trump, while criticism of the US president and his sidekick Elon Musk also appeals to Labour voters who don't much like Sir Keir Starmer's kowtowing to Trump. \"It is obvious, is it not, that mainstream politicians of all the mainstream parties don't want to undermine our democracy, don't want to take it in the direction of Trump's America like Nigel Farage,\" Ed Davey told me in our interview on Sky News. \n                  Sir Ed Davey refuses to rule out deal with Sir Keir Starmer to stop Reform winning power\n                 \n                  Lib Dems pledge windfall tax on banks to lower household energy bills\n                 \n                  Sir Ed Davey brands Elon Musk a criminal and calls for his arrest for 'allowing online harm to children'\n                 \"People look at Trump's America and what he's doing to it and are really fearful for democracy, for people's rights as well as for basic services like the health service, like the economy, Trump's doing a really bad job. \"But unfortunately, in our country, we're seeing politicians who want to mimic that, particularly people like Nigel Farage.\" But for all the criticism Sir Ed levelled against Reform, and its leader, he can't match Mr Farage when it comes to polling.  The Lib Dems have failed to make any progress since the general election as the public continues to turn away from the traditional big two - Labour and the Conservatives. Reform seems to be hoovering up voters' disillusionment, with support for the party growing from 14% at the general election to around 29% now, while the Lib Dems have nudged up just 3 percentage points to 15%. After a rather muted year since the general election, and under growing criticism that the Lib Dems aren't cutting through, Sir Ed wants to take the fight to Reform and is becoming more vocal about this endeavour. Just as Sir Keir Starmer has warned in recent days that Britain is in the \"fight of our times\" between \"patriotic renewal, and decline and toxic division\", so Sir Ed is clear he has a \"moral duty\" to keep Reform out of power. We are seeing how the contours of British politics are shaping up as Labour, the Liberal Democrats and the Greens all up the attacks on Reform, each for their own reasons, but each with the same effect of pitting progressive politics against what they dub Reform's right-wing populism. It is telling that Sir Ed was crystal clear in our interview today that he would never do any deal with Mr Farage, while refusing to rule out doing something with Labour to keep the Reform leader out of power, because while an election is a long way out, the dividing lines are becoming clearer between Reform's way of doing politics versus those politicians who stand for \"progressive\" Britain. Sir Ed may be known for his stunts, but at this conference, he's delivering a serious message - with hints at a more collective endeavour to try to turn the tide on Reform's surge."
    },
    {
        "title": "Labour and the Lib Dems could take lessons from how Farage 'hogs the headlines'",
        "description": "This is the story of two announcements - and the bigger lessons they tell us about the state of our politics.",
        "url": "https://news.sky.com/story/labour-and-the-lib-dems-could-take-lessons-from-how-farage-hogs-the-headlines-13436326",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nigel-farage-reform_7017704.jpg?20250912101047",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-09-22 14:33:00",
        "Headline": "Just as the Lib Dems might draw lessons from their own failure to get noticed, Labour could do worse than to take note of why Nigel Farage is again hogging the headlines today.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n This is the story of two announcements - and the bigger lessons they tell us about the state of our politics. First, there was a policy announcement by the Liberal Democrats as they gathered in Bournemouth for their annual conference. Some Lib Dems were already aggrieved they do not get coverage commensurate with their parliamentary strength, given they have 72 MPs. But there is no one outlet or platform choosing to downplay their content - it's worth analysing why their work does not travel further and wider. The party's main overnight policy call was for health warnings on social media apps for under-18s. The reason this was unlikely to garner a huge amount of attention is because it broadly falls in line with existing mainstream political consensus. Politically, it was a safe thing to call for, tying gently the party's anti-big tech and by extension anti-Trump agenda, but it was such safe territory that The Times reported this morning that ministerial action in the same area is coming soon. Perhaps more importantly, the idea of mandatory warnings on social media sites used by teens feels like small beer in the age of massive fiscal and migration challenges. The party conference is its big moment to convince the public it's about more than stunts and it can pose a coherent alternative: do its announcements rise to such a big moment? Even more depressing for activists in Bournemouth is that the Liberal Democrat announcement is being eclipsed by Nigel Farage's immigration statement. This is rightly getting more coverage - although also rightly, much of it focuses on whether this latest plan can possibly work, whether they've thought it through and whether their cost estimate is credible (probably not). \n                  Sir Ed Davey refuses to rule out deal with Sir Keir Starmer to stop Reform winning power\n                 \n                  Why Ed Davey is taking the fight to Farage - despite the Lib Dems and Reform sharing few voters\n                 \n                  Politics latest: Nigel Farage announces plan to deport legal migrants\n                 Even typing these words will draw a backlash from the parts of the political spectrum who resent the scale of the coverage a party with five MPs can muster. But just as the Lib Dems might draw lessons from their own failure to get noticed, Labour could do worse than to take note of why Reform leader Mr Farage is again hogging the headlines today. Reform UK is proposing two things: that it will end Indefinite Leave to Remain (ILR) as we know it - that's the right to settle in the UK, with access to benefits, after five years in the country. Within 100 days of entering office, Mr Farage says people would have to apply for five-year visas, qualifying only if they meet a higher salary threshold - closer to £60,000, from just over £40,000. There are questions about the practical workings of the policy - a vastly bureaucratic and potentially destabilising plan to assess old IRL claims seems at odds with their plans to slash the size of the state. Some rival politicians would query the ethical stance of their latest intervention. And Labour is loudly saying that Reform's claim that UK benefits will be restricted to UK citizens will generate savings in the hundreds of billions is based on thinktank research that has since been withdrawn. But that is secondary. The bigger thing Reform UK has done today is identify and loudly highlight an issue the Labour Party agrees with but does not dare make a big deal of. This allows Reform UK once again to set the terms of the debate in a sensitive area. Underlying the Reform UK policy is a simple set of figures: That the result of the huge migration surge triggered by Boris Johnson and overseen through the Liz Truss and Rishi Sunak premierships, means those eligible for Indefinite Leave to Remain, five years after their arrival, is about to spike. This poses profound and complex questions for policymakers. According to the government, last year 172,800 got Indefinite Leave to Remain. From next year there are estimates - not challenged this morning by the government when I checked - that about 270,000 migrants will become eligible to apply to live in the UK permanently. Then, up to 416,000 people will qualify in 2027, and 628,000 in 2028. These are huge numbers. And here's the key thing. While in public Labour have been trying to highlight aspects of this announcement that they say have \"fallen apart\", privately they acknowledge that this is a problem and they too will come up with solutions in this area - but cannot yet say what. Labour have already said they will increase the qualifying period for Indefinite Leave to Remain from 5 to 10 years, but it is unclear what will happen to those for whom the clock is already ticking - so, those in this coming wave. More on that is expected soon, but this is uncooked policy and the government is now racing to provide an answer. Read more from Sky NewsMinister defends France migrant returns dealLib Dems pledge windfall tax on banks We seem to have politics stuck on repeat. Mr Farage has yet again put up in lights something that Labour privately concede is an issue but as yet have no answer in public. New home secretary Shabana Mahmood knows she has to show she can be quicker off the mark and more punchy than her predecessor - her rival has been first off the mark in this area, however. But Mr Farage is also tackling the Tories too, punching the bruise by labelling the surge in migration post-2021 as the \"Boris-wave\". Understandably, the Tories themselves have been shy to dwell on this. But they have also tried to make it harder for people who arrived post-2021 to get ILR and have vowed to allow those on benefits to be able to apply. But they would draw the line on retrospective ILR claims, which could turn into one of the big dividing lines at the next election. And they are not shouting about a plan which effectively criticises the migration record of the last government. Mr Farage has come up with a deeply controversial policy. Retrospectively removing people who thought they could live indefinitely in the UK is a major shift in the compact the UK had with migrants already here. But he managed to put his rivals in a tangle this morning. The two biggest parties give the impression they still have little confidence when dealing with migration. Until they do, can they really take on Mr Farage?"
    },
    {
        "title": "Zarah Sultana drops legal threat to reconcile with Jeremy Corbyn after row",
        "description": "Zarah Sultana has said she will not pursue legal action in a bid to repair the row that has engulfed her new political party with Jeremy Corbyn.",
        "url": "https://news.sky.com/story/zarah-sultana-drops-legal-threat-to-reconcile-with-jeremy-corbyn-after-row-13436129",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jeremy-corbyn-zarah-sultana_7024201.jpg?20250918150806",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-09-22 07:53:00",
        "Headline": "The MP says she is \"determined to reconcile and move forward\" following the public spat in which she was accused of launching her own membership drive.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n Zarah Sultana has said she will not pursue legal action in a bid to repair the row that has engulfed her new political party with Jeremy Corbyn. Ms Sultana, who co-leads \"Your Party\" with the former Labour leader, initially said she had hired defamation lawyers following a public spat in which she was accused of launching her own \"unauthorised\" membership drive. Politics latest: Nigel Farage holds Reform UK news conference The former Labour MP, who now represents Coventry South as an independent, admitted she had launched the membership portal without her co-leader's sign-off, but claimed she did so because she had been \"sidelined\" by a \"sexist boys club\". Her actions led to Mr Corbyn issuing his own statement, in which he urged members of the party - which has been given the interim name of Your Party - to ignore an \"unauthorised\" email urging them to become paid members and that legal advice was being taken. In a fresh statement issued on Sunday evening, Ms Sultana acknowledged her supporters had been left feeling \"demoralised\" by the saga. \"For the sake of the party, and as an act of good faith, I will not be pursuing legal proceedings despite the baseless and unsubstantiated allegations against me,\" she said. \"I know many people are feeling demoralised - I share that feeling. We find ourselves in a regrettable situation, but my motivation has always been to ensure the collective strength of our movement, put members first and build the genuinely democratic conference and socialist party we so urgently need.\" She added: \"I am determined to reconcile and move forward. I am engaged in ongoing discussions with Jeremy, for whom, like all socialists of my generation, I have nothing but respect.\" Your Party got off to a shaky start when it was announced by Ms Sultana in early July, in a move that appeared to blindside Mr Corbyn. The pair confirmed the launch a few weeks later, sharing a link to a website called Yourparty.co.uk. It was later clarified that that was an interim name and that party members would decide a formal name at its inaugural conference in the autumn. It is understood there are still expectations the conference will go ahead, despite the public fallout last week. Read more:Inside Jeremy Corbyn's new party and the battle for leadershipWhat is happening at Your Party?   Despite her current attempts to repair the row, Your Party reported itself to the Information Commissioner's Office last week after the \"false membership\" system was \"unilaterally launched\" by Ms Sultana - which it said was its duty under the law. Questions remain over the handling of the data, which, as outlined in Your Party's privacy notice, is owned by the Peace and Justice Project, spearheaded by the former Labour leader and independent activist Pamela Fitzpatrick, who are listed as the directors on Companies House. The Coventry MP said in a statement after the row broke out that \"at no point was members' data misused or put at risk\" and that the portal was \"properly launched in accordance with the party's roadmap\". The ICO watchdog, which upholds information rights in the public interest, can issue fines up to £17.5m or 4% of global turnover, or pass fraud and negligence cases to police. A spokesperson for the ICO told Sky News on Friday: \"We can confirm we have received a report and are assessing the information provided.\""
    },
    {
        "title": "Former Tory MP Katie Wallis faces trial accused of having false passport",
        "description": "A former Conservative MP will go on trial next year accused of having a false passport during the time she was sitting in parliament.",
        "url": "https://news.sky.com/story/former-tory-mp-katie160wallis-faces-trial-accused-of-having-false-passport-13436229",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-katie-wallis-bridgend_6969853.jpg?20250922124616",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-22 11:03:00",
        "Headline": "Katie Wallis served as the MP for Bridgend from 2019 to 2024. The 41-year-old appeared before Newport Crown Court on Monday.",
        "Content": "A former Conservative MP will go on trial next year accused of having a false passport during the time she was sitting in parliament. Katie Wallis, 41, of Butetown, Cardiff, became the first openly transgender MP in the House of Commons in 2022. Wallis, who uses female pronouns and was previously known as Jamie, served as the MP for Bridgend in South Wales from 2019 to 2024. She appeared before Newport Crown Court on Monday and faces two charges relating to the possession of a false passport. The first is possession of an identity document with improper intention, \"namely a British passport in the name of Jamie Wallis, that was false and that she knew or believed to be false\". The second charge relates to the possession of a false identity document in the name of Jamie Wallis \"that was false\". Wallis was alleged to be in possession of the document in April 2022, while she was still serving as a Conservative MP. The defendant, who represented herself during the hearing, did not enter pleas to the two charges. Judge Tracey Lloyd-Clarke, the Recorder of Cardiff, fixed a trial date for 2 November next year. Wallis was released on conditional bail."
    },
    {
        "title": "Trump links paracetamol use in pregnancy to increased risk of autism - here's what the evidence says",
        "description": "Donald Trump has claimed the use of paracetamol in pregnancy is linked to an increased risk of autism - but what does the evidence say?",
        "url": "https://news.sky.com/story/donald-trump-to-link-paracetamol-use-to-autism-heres-what-the-evidence-says-13436398",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-paracetamol-pregnancy_7028814.jpg?20250922182137",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-09-22 17:01:00",
        "Headline": "While most doctors would advise women only to take medicines in pregnancy when necessary, avoiding paracetamol could do more harm than good.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  Donald Trump has claimed the use of paracetamol in pregnancy is linked to an increased risk of autism - but what does the evidence say? Americans consume more than 40% of all the world's paracetamol, spending in excess of $4bn a year on products containing acetaminophen (as it is known in America - or by its leading brand name, Tylenol). Autism rates in the US are also on the rise - going up from about one in 150 children in the year 2000, to around one in 30 today. There have also been a number of well-publicised studies suggesting a correlation between mothers who took paracetamol during pregnancy and the birth of a child with autism or other neurodevelopmental disorders such as ADHD. So surely something must be going on? Well, not necessarily. In studies that have suggested a link, the authors have been unable to show the drug itself led to autism instead of other factors. These include: the genetics of the parents (autism's genetic links are well established); the lifestyle or environment in which the mother lives; or most confounding of all, that the reason the mother was taking paracetamol - a viral infection perhaps - wasn't a trigger rather than the drug itself. A study showing a correlation is not the same as finding a cause. Better understanding of autism has meant the criteria for diagnosing it have expanded over the last two decades to include far more people. Diagnoses may well be rising simply because we're better at recognising it. What's more, there are numerous studies showing evidence of no link to paracetamol at all. Chief among them is a huge study from last year that included 2.5 million children in Sweden. In Sweden, a mother's use of paracetamol during pregnancy is added to her medical records. The researchers found a marginal increase in the risk of autism and paracetamol use by the mother. But crucially, when they included data for siblings born to the same mothers from pregnancies during which she took no paracetamol, the apparent link disappeared. \"Which provides a pretty strong evidence against the notion that paracetamol would cause harm,\" said Dr Viktor Ahlqvist at the Karolinska Institute in Stockholm, who led the study. Paracetamol still recommended in UK The study showed not only that paracetamol wasn't linked to autism, but that other studies, with poorer quality data were prone to seeing a pattern that wasn't there. This balance of evidence is why health authorities, including here in the UK, are confident in recommending paracetamol for use in pregnancy. In fact, it's now recommended as the safest choice, as other painkillers - even ibuprofen - have been shown to cause potential or actual harm to mother or babies. While most doctors would advise women only to take medicines in pregnancy when necessary, avoiding paracetamol could do more harm than good. \"While you're pregnant, experiencing uncontrolled fevers or some of the side effects from pain, such as high blood pressure, will be a lot more detrimental to a developing baby and a mother than paracetamol will be,\" said Dr Monique Botha, who studies bias in autism research at the University of Durham. Talking up a link between autism and paracetamol is also likely to anger people with autism or their parents, suspects Dr Botha. \"Families with autistic children are often struggling with under-resourced care and someone standing up and declaring that they've potentially found the cause of autism - when it's so misguided - isn't going to change anything for them.\" Read more from Sky News:'I forgive him': Charlie Kirk's wife delivers tearful messageAI-generated 'minister' makes debut in Albanian parliament Researchers worry too, that posing a link between a drug taken during pregnancy and autism adds unnecessary stigma to mothers of autistic children. \"We've seen this many, many times, going back to the scary stories of the 1960s, that the blame is usually on the mother and parents where a child has a condition,\" said Dr Ahlqvist. \"With this current [US] administration, they're again pointing the finger at mothers, when we have no substantial evidence to suggest that this is the case.\" US correspondent Many will welcome that Trump is putting this issue on the agenda, but there's a disconnect between his rhetoric and the strength of the evidence. The danger is two-fold – parents could be misled into believing autism can be prevented, and may avoid treating fever or pain, exposing themselves and their babies to greater risk. The president's team is also promoting a drug used to treat cancer as a potential therapy, but scientifically, the evidence remains thin. Some are likening this to 2020, when Trump speculated publicly about whether disinfectants could be used inside the body to treat COVID-19. He later said those remarks were sarcastic and not meant to be taken literally, but it led to jokes that he was encouraging people to drink bleach. Under fire from many in the medical world, who accuse him of risking more harm, the timing of this \"big announcement\" is also drawing scrutiny. Ten months after the election, the administration is keen to show it's implementing policy and a bold move on autism is something that will resonate emotionally with many families. It appeals to the populist, health-concern base – the \"Make America Healthy Again\" movement reflecting a constituency concerned about environmental toxins and the huge pharmaceutical industry. Health secretary Robert Kennedy Jr has a controversial record on vaccine-autism issues, so this taps into his legion of supporters who distrust conventional medical authorities. Big announcements in health, especially controversial ones, can shift media and public attention when an administration wants to change the news cycle from other problems. Politically, there are potential gains, but they come with risks to public health, deepening divisions in an already politically charged environment and the threat of legal action by drug manufacturers. So, if paracetamol doesn't cause autism, what's causing the Trump administration to talk about it? With echoes of previous, and all too real, drug scandals like thalidomide, it's the kind of story to generate controversy by association - however false. And the Trump White House has form when it comes to finding issues to distract from genuine controversies surrounding the president. The story also fits a key theme of US health secretary Robert F Kennedy Jr's policy moves - like on childhood vaccines - that stem from his belief that children are being harmed by an overmedicated America. But the whole point of science is that it doesn't care what you believe, it's about what the best quality evidence tells you. So far, there's been precious little of that behind the latest changes in US health policy."
    },
    {
        "title": "Trump reveals Rupert and Lachlan Murdoch could be involved in TikTok deal",
        "description": "Donald Trump has revealed that media mogul Rupert Murdoch and his son Lachlan could be part of a deal in which TikTok in the United States will come under American control.",
        "url": "https://news.sky.com/story/trump-reveals-rupert-and-lachlan-murdoch-could-be-involved-in-tiktok-deal-13436069",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-tiktok-donald-trump_6803725.jpg?20250922023046",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-22 01:25:00",
        "Headline": "The US president also namedropped Michael Dell, the founder and CEO of Dell Technologies, and Larry Ellison as possible participants in the deal.",
        "Content": "Donald Trump has revealed that media mogul Rupert Murdoch and his son Lachlan could be part of a deal in which TikTok in the United States will come under American control. The US president also namedropped Michael Dell, the founder and CEO of Dell Technologies, as a possible participant in the deal during an interview with Fox News, which is owned by the Murdochs. \"I think they're going to be in the group. A couple of others. Really great people, very prominent people,\" Mr Trump said. \"And they're also American patriots, you know, they love this country. I think they're going to do a really good job.\" Mr Trump said that Larry Ellison, founder and CEO of software firm Oracle, was part of the same group. His involvement in the potential TikTok deal had previously been revealed. White House press secretary Karoline Leavitt said on Saturday that Oracle would be responsible for the app's data and security, with Americans set to control six of the seven seats for a planned TikTok board. This comes after Mr Trump said he and China's Xi Jinping held a \"very productive call\" on Friday, discussing the final approval for the TikTok deal, much of which is still unknown. Once confirmed, the deal should stop TikTok from being banned in the US after lawmakers decided it posed a security risk to citizens' data. \n                  Trump and Xi discuss TikTok deal to stop US ban\n                 \n                  'We wouldn't let our children on the app': TikTok moderators warn users may be at risk after redundancies\n                 \n                  Will Trump's UK visit be make or break for Starmer?\n                 Officials warned that the algorithm TikTok uses is vulnerable to manipulation by Chinese authorities, who can use it to push specific content on the social media platform in a way that is difficult to detect. Congress had ordered the app shut down for American users by January 2025 if its Chinese owner ByteDance didn't sell its assets in the country - but the ban has been delayed four times by President Trump. Read more from Sky News:Trump delivers speech at Charlie Kirk's memorialPentagon orders journalists to agree to reporting rules Mr Trump said on Sunday that he might be \"a little prejudiced\" about TikTok, after telling reporters on Friday: \"I wasn't a fan of TikTok and then I got to use it and then I became a fan and it helped me win an election in a landslide.\" After the call with Mr Xi, Mr Trump said in a Truth Social post: \"We made progress on many very important issues, including Trade, Fentanyl, the need to bring the War between Russia and Ukraine to an end, and the approval of the TikTok Deal.\" Mr Trump later told reporters at the White House that Xi had approved the deal, but said it still needed to be signed. Representatives for the Murdochs, Mr Dell and Mr Ellison have not yet commented on a potential TikTok deal."
    },
    {
        "title": "Jimmy Kimmel show to return after being taken off air over Charlie Kirk comments",
        "description": "Late-night talk show host Jimmy Kimmel, who was taken off the air following a row over comments about Charlie Kirk, will return on Tuesday.",
        "url": "https://news.sky.com/story/jimmy-kimmel-show-to-return-after-being-taken-off-air-over-charlie-kirk-comments-13436437",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jimmy-kimmel-emmy_7024453.jpg?20250918180335",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-22 19:34:00",
        "Headline": "Hundreds of stars had urged Americans to \"fight to defend and preserve our constitutionally protected rights\" in the wake of Kimmel's suspension.",
        "Content": " Late-night talk show host Jimmy Kimmel, who was taken off the air following a row over comments about Charlie Kirk, will return on Tuesday. The US presenter, who was accused of being \"offensive and insensitive\" because of what he said on his programme, Jimmy Kimmel Live, on Monday last week, will go back on air in his regular slot on the ABC network. Disney, which owns ABC, said in a statement: \"Last Wednesday, we made the decision to suspend production on the show to avoid further inflaming a tense situation at an emotional moment for our country. \"It is a decision we made because we felt some of the comments were ill-timed and thus insensitive. \"We have spent the last days having thoughtful conversations with Jimmy, and after those conversations, we reached the decision to return the show on Tuesday.\" Earlier on Monday, hundreds of Hollywood stars signed an open letter to defend free speech following Kimmel's suspension. Robert De Niro, Ben Affleck, Jennifer Aniston, Selena Gomez, Lin-Manuel Miranda, Tom Hanks and Meryl Streep were among those who have penned the appeal. \n                  Trump links paracetamol use in pregnancy to increased risk of autism - here's what the evidence says\n                 \n                  'I forgive him': Charlie Kirk's wife delivers tearful message - and one America needs to hear most\n                 \n                  Who is Erika Kirk? Charlie Kirk's widow and Turning Point USA's new CEO\n                 More than 430 of the stars, including comedians, directors and writers, urged Americans to \"fight to defend and preserve our constitutionally protected rights\". The letter was addressed to the American Civil Liberties Union (ACLU), and argued the decision was a \"dark moment for freedom of speech in our nation\". The letter added: \"Regardless of our political affiliation, or whether we engage in politics or not, we all love our country. \"We also share the belief that our voices should never be silenced by those in power - because if it happens to one of us, it happens to all of us.\" The list of signatures also included Emmy-winner Noah Wyle, Oscar-nominated Florence Pugh, comedian David Cross, Tony-winner Kelli O'Hara and Molly Ringwald. Pedro Pascal, Billy Crystal, Nathan Lane, Kerry Washington and Kevin Bacon have also signed the letter. The letter concluded: \"This is the moment to defend free speech across our nation. We encourage all Americans to join us, along with the ACLU, in the fight to defend and preserve our constitutionally protected rights.\" Kimmel had used his show to accuse President Trump and his allies of capitalising on conservative influencer Charlie Kirk's assassination. The TV presenter said: \"We hit some new lows over the weekend with the MAGA gang desperately trying to characterise this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it.\" Speaking about Donald Trump, he added: \"This is not how an adult grieves the murder of someone he calls a friend. This is how a four-year-old mourns a goldfish.\" \"Many in MAGA land are working very hard to capitalise on the murder of Charlie Kirk,\" he continued.  ABC pulled the show following criticism from Brendan Carr, chairman of the Federal Communications Commission (FCC). Mr Carr had threatened to \"take action\" against Disney and ABC. In an interview with conservative podcaster Benny Johnson, he said: \"We can do this the easy way or the hard way\". Mr Carr then praised the move, saying \"it is important for broadcasters to push back on Disney programming that they determine falls short of community values\". But the decision sparked a global, furious backlash from the public and high-profile figures around the world. Among them was former US president Barack Obama, who said on X: \"After years of complaining about cancel culture, the current administration has taken it to a new and dangerous level by routinely threatening regulatory action against media companies unless they muzzle or fire reporters and commentators it doesn't like.\" He added: \"This is precisely the kind of government coercion that the First Amendment was designed to prevent - and media companies need to start standing up rather than capitulating to it.\" The decision came at a time Disney and Nexstar, the network operator, had FCC business ahead of them, with the former seeking regulatory approval for ESPN's acquisition of the NFL Network and the latter needing the Trump administration's approval to complete a $6.2bn (£4.6bn) purchase of broadcast rival, Tegna. Mr Trump, who was on a state visit to the UK at the time, said Kimmel had been cut for \"bad ratings\". He had said: \"Well, Jimmy Kimmel was fired because he had bad ratings, more than anything else. \"And he said a horrible thing about a great gentleman known as Charlie Kirk.\" He added: \"Jimmy Kimmel is not a talented person. He had very bad ratings, and they should have fired him a long time ago. \"So, you know, you could call that free speech or not. He was fired for lack of talent.\""
    },
    {
        "title": "Graham Linehan says satire is 'dying' and that he wouldn't be able to make Father Ted today",
        "description": "Graham Linehan has told Sky News he believes satire is \"dying\" and that it would be \"impossible\" to make his hit shows Father Ted or The IT Crowd today.",
        "url": "https://news.sky.com/story/graham-linehan-says-satire-is-dying-and-that-he-wouldnt-be-able-to-make-father-ted-today-13436161",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-graham-linehan-father-ted_7009241.jpg?20250902132421",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-22 09:09:00",
        "Headline": "Comedy writer Graham Linehan was arrested at the beginning of September over tweets sharing his views on trans rights, which were posted earlier this year.",
        "Content": " Graham Linehan has told Sky News he believes satire is \"dying\" and that it would be \"impossible\" to make his hit shows Father Ted or The IT Crowd today. The comedy writer, who has faced accusations of transphobic hate speech and the harassment of transgender people, was arrested at Heathrow Airport earlier this month over social media posts sharing his views on trans rights. Appearing on Sky News' Sunday Morning With Trevor Phillips, he said he is planning to sue the Metropolitan Police over his arrest, on grounds of \"false imprisonment\", and also addressed US talk show host Jimmy Kimmel being taken off air for comments he made following the death of Charlie Kirk.   Speaking about his own work, Linehan said: \"It would be impossible to do a comedy like Father Ted or The IT Crowd now. The feeling of a thousand people looking over your shoulder as you write would be intolerable, and the thousand people looking over your shoulder are the various supposed minority groups that TV executives think need protecting.\" In comedy, everyone should be a target, Linehan said. \"It's how you show someone's humanity, you show that they're not perfect, that they're funny, that they make mistakes. \"But all these, I have to say, white, middle class TV executives, they look down on everybody. So they think that when you make a joke, you're punching down. It's impossible to create comedy in that kind of atmosphere. \"The only people who can survive in that kind of atmosphere are people who simply never say anything interesting.\" 'We're going backwards' Asked if satire is dead, Linehan said it is \"dying\" - and also highlighted Chris Morris's \"boundary breaking\" Brass Eye, another satirical show from the 1990s and early 2000s. \"It is impossible to imagine it being made now. And so we're going backwards. We're not moving forwards, we're going backwards.\" Read more:What you can and can't say onlineWhy has Jimmy Kimmel's show been suspended? Linehan said he now lives in the US as he could not stay in the UK. He was arrested after landing at Heathrow at the beginning of September. In one of the posts he says he was questioned about, Linehan wrote: \"If a trans-identified male is in a female-only space, he is committing a violent, abusive act. Make a scene, call the cops and if all else fails, punch him in the balls.\" After his arrest drew criticism of the police and government from some politicians and supporters, Met Police Commissioner Sir Mark Rowley said his officers were in an \"impossible position\" and should not be \"policing toxic culture wars debates\". Linehan said he was \"surprised\" to be arrested over \"tweets that were mostly harmless\". He continued: \"One which was good safeguarding advice for any woman. And two silly things that I just kind of you know, conversationally threw online. I never thought that anyone would be so offended by them.\" A Met Police spokesperson said it would be inappropriate to comment on any potential claim in relation to the case. Linehan was interviewed by Sky News as other comedians and writers were speaking out about Kimmel being taken off air in the US. Tom Walker, better known as the ranting fictitious newsreader Jonathan Pie, told Sky News' Daily podcast he believes the UK has to be \"careful\" and protect free speech as debate becomes \"more and more toxic\" on both sides of the Atlantic. \"I certainly don't think that the Trump administration should be influencing decisions made by TV companies, that's definitely not on,\" Linehan said when asked by Phillips about the issue. \"But I do find it quite ironic, or I'm not sure what the word is, that nine or 10 days after a man was shot through the neck for literally trying to speak - you know, the symbol of Charlie Kirk's life is the microphone, not only in the sense that he used it himself, but he handed it to others and allowed them to make their points, without interrupting, without being superior or arrogant or argumentative - and he was silenced forever. \"So the idea that Jimmy Kimmel is some sort of hero of free speech is quite absurd after that happened.\""
    }
]