[
    {
        "title": "Budget 2025: The same old Labour? Why party's credibility might not be recoverable",
        "description": "Over and over again, in the run-up to the election and beyond, the prime minister and the chancellor told voters they would not put up taxes on working people - that their manifesto plans for government were fully costed and, with the tax burden at a 70-year high, they were not in the business of raising more taxes.",
        "url": "https://news.sky.com/story/rachel-reevess-budget-buys-keir-starmer-more-time-8211-but-labours-credibility-might-not-recover-13475870",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-beth-reeves_7092969.jpg?20251126212817",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-11-26 21:05:00",
        "Headline": "With more than 400 MPs, you might expect the PM and chancellor to take tough decisions. Instead, they find themselves just trying to survive.",
        "Content": "\n          Political editor\n              @BethRigby\n  Over and over again, in the run-up to the election and beyond, the prime minister and the chancellor told voters they would not put up taxes on working people - that their manifesto plans for government were fully costed and, with the tax burden at a 70-year high, they were not in the business of raising more taxes. On Wednesday the chancellor broke those pledges as she lifted taxes by another 춲26bn, adding to the 춲40bn rise in her first budget. She told working people a year ago she would not extend freezing tax thresholds - a Conservative policy - because it would \"hurt working people\". Budget latest: 'It can only lead to the death of us at the general election'   On Wednesday she ripped up that pledge, as she extended the threshold freeze for three years, dragging 800,000 workers into tax and another million into the higher tax band to raise 춲8.3bn. Rachel Reeves said it was a Labour budget and she's right. In the first 17 months of this government, Labour have raised tens of billions in taxes, while reversing on welfare reform - the U-turn on the winter fuel allowance and disability benefits has cost 춲6.6bn. Ms Reeves even lifted the two-child benefit cap on Wednesday, at a cost of 춲3bn, despite the prime minister making a point of not putting that pledge in the manifesto as part of the \"hard choices\" this government would make to try to bear down on the tax burden for ordinary people. The OBR predicts one in four people would be caught by the 40% higher rate of tax by the end of this parliament. Those higher taxes were necessary for two reasons and aimed at two audiences - the markets and the Labour Party. For the former, the tax rises help the chancellor meet her fiscal rules, which requires the day-to-day spending budget to be in a surplus by 2029-30. Before this budget, her headroom was just 춲9.9bn, which made her vulnerable to external shocks, rises in the cost of borrowing or lower tax takes. Now she has built her buffer to 춲22bn, which has pleased the markets and should mean investors begin to charge Britain less to borrow.  As for the latter, this was also the chancellor raising taxes to pay for spending and it pleased her backbenchers - when I saw some on the PM's team going into Downing Street in the early evening, they looked pretty pleased. I can see why: amid all the talk of leadership challenge, this was a budget that helped buy some time. \"This is a budget for self-preservation, not for the country,\" remarked one cabinet minister to me this week. You can see why: ducking welfare reform, lifting the two-child benefit cap - these are decisions a year-and-a-half into government that Downing Street has been forced into by a mutinous bunch of MPs. With a majority of 400 MPs, you might expect the PM and his chancellor to take the tough decisions and be on the front foot. Instead they find themselves just trying to survive, preserve their administration and try to lead from a defensive crouch. When I asked the chancellor about breaking manifesto promises to raise taxes on working people, she argued the pledge explicitly involved rates of income tax (despite her pledge not to extend the threshold freeze in the last budget because it \"hurt working people\"). Read more:Budget 2025: The key points at a glanceWhy Labour MPs may like Reeves's budget  Trying to argue it is not a technical breach - the Institute of Fiscal Studies disagreed - rather than taking it on and explaining those decisions to the country says a lot about the mindset of this administration. One of the main questions that struck me reflecting on this budget is accountability to the voters. Labour in opposition, and then in government, didn't tell anyone they might do this, and actually went further than that - explicitly saying they wouldn't. They were asked, again and again during the election, for tax honesty. The prime minister told me that he'd fund public spending through growth and had \"no plans\" to raise taxes on working people. Those people have been let down. Labour voters are predominantly middle earners and higher earning, educated middle classes - and it is these people who are the ones who will be hit by these tax rises that have been driven to pay for welfare spending rather than that much mooted black hole (tax receipts were much better than expected). This budget is also back-loaded - a spend-now-pay-later budget, as the IFS put it, with tax rises coming a year before the election. Perhaps Rachel Reeves is hoping again something might turn up - her downgraded growth forecasts suggests it won't. This budget does probably buy the prime minister and his chancellor more time. But as for credibility, that might not be recoverable. This administration was meant to change the country. Many will be looking at the tax rises and thinking it's the same old Labour."
    },
    {
        "title": "Budget 2025: The town where voters placed trust in Labour - and some now feel betrayed",
        "description": "Hitchin in Hertfordshire does well in the polls.",
        "url": "https://news.sky.com/story/budget-2025-the-town-where-voters-placed-trust-in-labour-and-some-now-feel-betrayed-13475763",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-hitchen-budget_7092927.png?20251126205632",
        "type": "Home",
        "Author": "Paul Kelso",
        "Date Published": "2025-11-26 15:07:00",
        "Headline": "Sky's Paul Kelso visits one of the country's happiest towns to see if taxpayers are still smiling after a switch to Labour and another tax-raising budget.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Hitchin in Hertfordshire does well in the polls. On the edge of the Chilterns and 30 minutes from central London by train, it's Britain's most expensive market town for first-time buyers. It's also been voted one of the top 10 best, and top 20 happiest, places to live in the country. Last summer Labour did well in the polls here too. Hitchin's 35,000 inhabitants, with above average earnings, levels of employment, and higher education, ejected the Conservatives for the first time in more than 50 years. Money latest: What the budget means for your money  Having swept into affluent southern constituencies, Rachel Reeves is now asking them to help pay for her plans via a combination of increased taxes on earnings and savings. While her first budget made business bear the brunt of tax rises, the higher earners of Hitchin, and those aspiring to join them, are unapologetically in the sights of the second. 游녤 Listen to Sky News Daily on your podcast app 游녣  Kai Walker, 27, runs Vantage Plumbing & Heating, a growing business employing seven engineers, all earning north of 춲45,000, with ambition to expand further. He's disappointed that the VAT threshold was not reduced - \"it makes us 20% less competitive than smaller players\" - and does not love the prospect of his fiancee paying per-mile to use her EV. But it's the freeze on income tax thresholds that will hit him and his employees hardest, inevitably dragging some into the 40% bracket, and taking more from those already there. \"It seems like the same thing year on end,\" he says. \"Work harder, pay more tax, the thresholds have been frozen again until 2031, so it's just a case where we see less of our money. Tax the rich has been a thing for a while or, you know, but I still don't think that it's fair. \"I think with a lot of us working class, it's just a case of dealing with the cost. Obviously, we hope for change and lower taxes and stuff, but ultimately it's a case of we do what we're told.\"  Reeves's central pitch is that taxes need to rise to reset the public finances, support the NHS, and fund welfare increases she had promised to cut. In Hitchin's Market Square it has been heard, but it is strikingly hard to find people who think this budget was for them.  Jamie and Adele Hughes both work, had their first child three weeks ago, and are unconvinced. \"We're going to be paying more, while other people are going to be getting more money and they're not going to be working. I don't think it's fair,\" says Adele. Jamie adds: \"If you're from a generation where you're trying to do well for yourself, trying to do things which were once possible for everybody, which are not possible for everybody now, like buying a house, starting a family like we just have, it's extremely difficult,\" says Jamie. Liz Felstead, managing director of recruitment company Essential Results, fears the increase in the minimum wage will hit young people's prospects hard. \"It's disincentivising employers to hire younger people. If you have a choice between someone with five years experience or someone with none, and it's only 춲2,000 difference, you are going to choose the experience.\" Read more:Budget takes UK into uncharted territory to allow spending spreeMain budget announcements at a glanceReeves reveals 춲26bn of tax risesCash ISA limit slashed - but some are exempt After five years, the cost of living crisis has not entirely passed Hitchin by. In the market Kim's World of Toys sells immaculately reconditioned and repackaged toys at a fraction of the price. Demand belies Hitchin's reputation. \"The way that it was received was a surprise to us I think, particularly because it's a predominantly affluent area,\" says Kim. \"We weren't sure whether that would work but actually the opposite was true. Some of the affluent people are struggling as well as those on lower incomes.\" Customer Joanne Levy, shopping for grandchildren, urges more compassion for those who will benefit from Reeves's spending plans: \"The elderly, they're struggling, bless them, the sick, people with young children, they are all struggling, even if they're working they are struggling.\""
    },
    {
        "title": "Almost 280 people missing as huge fire engulfs Hong Kong flats - dozens confirmed dead",
        "description": "At least 44 people have been killed after a fire engulfed several buildings at a high-rise residential complex in Hong Kong.",
        "url": "https://news.sky.com/story/dozens-killed-in-fire-in-high-rise-block-in-hong-kong-13475573",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-newspix-newspix281125_7092208.jpg?20251126090443",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-26 09:41:00",
        "Headline": "About 900 people have been evacuated to temporary shelters after Hong Kong's deadliest fire in years broke out at the Wang Fuk Court housing complex in the city's Tai Po district.",
        "Content": " At least 44 people have been killed after a fire engulfed several buildings at a high-rise residential complex in Hong Kong. Hong Kong leader John Lee said another 279 people were reported missing, while 45 are in a critical condition. About 900 people have been evacuated to temporary shelters after the blaze - Hong Kong's deadliest fire in years - broke out at the Wang Fuk Court housing complex in the city's Tai Po district. Three men have since been arrested on suspicion of manslaughter, broadcaster RTHK reported. Meanwhile, fire chiefs said the high temperatures were making it challenging for crews to mount rescue operations. Mr Lee said the fire was \"coming under control\" shortly after midnight. The blaze was upgraded to a level 5 alarm, the highest level of severity, as night fell. The dead included one firefighter, officials said earlier. A number of other firefighters were said to have been hurt while trying to tackle the flames as they ripped through the 31-storey towers. Records show the Wang Fuk Court site consists of eight blocks, with almost 2,000 apartments housing around 4,800 residents, including many elderly people. It was built in the 1980s and has recently been undergoing a major renovation. The fire, which broke out at 2.51pm local time, had spread on bamboo scaffolding and construction netting set up around the exterior of the complex. It was not known how the fire started, but officials said it began on the external scaffolding of one of the buildings before spreading inside and to nearby buildings, likely aided by windy conditions. Flames and smoke were still pouring out of many windows as night fell. Chinese President Xi Jinping expressed condolences to the firefighter who died, and extended his sympathies to the families of the victims, according to state broadcaster CCTV. He also urged an \"all-out\" effort to minimise casualties and losses. The UK's foreign secretary described the fire as \"truly devastating and deeply depressing\". Yvette Cooper said: \"The UK sends heartfelt condolences to all the families affected and to the people of Hong Kong.\" Tai Po is in the northern part of Hong Kong, and close to the border with the mainland Chinese city of Shenzhen. Read more from Sky News:Tokyo overtaken as world's biggest cityBrazil's ex-president begins 27-year prison sentence Bamboo scaffolding is a common sight in Hong Kong at building construction and renovation projects. However, the government said earlier this year it would start phasing it out for public projects because of safety concerns. The blaze is the deadliest fire in Hong Kong since the deaths of 41 people in a commercial building in Kowloon in November 1996. That fire was later found to have been caused by welding during internal renovations, with a public inquiry yielding sweeping updates to building standards and fire safety regulations in the city's high-rise offices, shops and homes."
    },
    {
        "title": "Paul Doyle in tears as he admits driving into fans at Liverpool FC trophy parade",
        "description": "A former Royal Marine wept in court as he admitted driving into crowds at Liverpool's Premier League victory parade.",
        "url": "https://news.sky.com/story/paul-doyle-in-tears-as-he-admits-driving-into-fans-at-liverpool-fc-trophy-parade-13475193",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-paul-doyle-liverpool_7092383.jpg?20251126114044",
        "type": "Home",
        "Author": "Henry Vaughan",
        "Date Published": "2025-11-26 13:05:00",
        "Headline": "Former Royal Marine hit more than 100 people in his Ford Galaxy Titanium in just seven minutes, with victims including children as young as six months.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n  A former Royal Marine wept in court as he admitted driving into crowds at Liverpool's Premier League victory parade. Paul Doyle, 54, was due to go on trial at Liverpool Crown Court over the incident on 26 May, when more than a million fans were gathered in the city centre to celebrate the football team's 20th title win. He had previously denied 31 charges, but sobbed in the dock, with his voice, at times, barely audible, as he dramatically changed his pleas to guilty. Doyle admitted dangerous driving, affray, 17 charges of attempting to cause grievous bodily harm (GBH) with intent, nine counts of causing GBH with intent and three counts of wounding with intent. Recorder of Liverpool Judge Andrew Menary KC remanded Doyle in custody ahead of a two-day sentencing hearing from 15 December, telling him a long prison sentence is \"inevitable\". Doyle, a married father-of-three, hit more than 100 people in just seven minutes with his Ford Galaxy Titanium at around 6pm as crowds made their way home from the open-top bus parade. The charges relate to 29 victims, aged between six months and 77 years old, including eight who were children at the time. The parents of the youngest victim, Teddy Eveson, later told media he was thrown about 15 feet down the road in his pram when the crash happened. Another victim Rob Darke, who was left with a \"life-changing\" injury after attending the parade with his two sons, told Sky News he thought it was a terrorist attack. \"There was people lying about all over the place. It was like a bomb had gone off... it was carnage everywhere... people crying and screaming,\" he said. \"I thought it was terrorists. That's the first thing that came into my head. Who else would do a thing like that?\" 'Turned celebration to mayhem' Prosecutors said dashcam footage from Doyle's car showed he became \"increasingly agitated by the crowds\" as he approached Dale Street and Water Street. \"Rather than wait for them to pass, he deliberately drove at them, forcing his way through,\" said Sarah Hammond, chief crown prosecutor for CPS Mersey-Cheshire. \"Driving a vehicle into a crowd is an act of calculated violence. This was not a momentary lapse by Paul Doyle - it was a choice he made that day and it turned celebration into mayhem.\" Read more from Sky News:Main announcements in the budget at a glanceRussia contradicts Trump on Ukraine peace talksTokyo overtaken as world's biggest city  Detective Chief Inspector John Fitzgerald, of Merseyside Police, said: \"It is only by sheer luck that nobody was killed because of Doyle's reckless actions. \"In just seven minutes his dangerous driving meant that his car collided with more than 100 people, including children, in some cases trapping people underneath and causing serious injuries.\" A Liverpool FC spokesman said: \"Our victory parade last May allowed an unprecedented number of Liverpool fans to celebrate together our Premier League title win - something we were unable to do in 2020. \"The day of incredible joy ended in unimaginable circumstances and we hope today's conviction brings some peace to all those affected by the horrific incident. Our thoughts are with them all.\" "
    },
    {
        "title": "Military chiefs in 'difficult meeting' as tensions mount over money",
        "description": "Britain's top military chiefs held a \"very difficult\" meeting this week amid tension over how to fund plans to rebuild the armed forces or face further cuts, defence sources have said.",
        "url": "https://news.sky.com/story/military-chiefs-in-difficult-meeting-as-tensions-mount-over-money-13475876",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ajax-tanks-british-army_7073345.png?20251126212948",
        "type": "Home",
        "Author": "Deborah Haynes",
        "Date Published": "2025-11-26 21:19:00",
        "Headline": "UK chiefs question how to deliver defence reforms as funding fails to meet requirements amid rising threats from Russia and China, and pressure from NATO allies.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  Britain's top military chiefs held a \"very difficult\" meeting this week amid tension over how to fund plans to rebuild the armed forces or face further cuts, defence sources have said. The Ministry of Defence (MoD) played down a report in the Spectator magazine that the top brass, led by Air Chief Marshal Sir Rich Knighton, the chief of the defence staff, planned to write an extraordinary joint letter to John Healey, the defence secretary, to explain that his defence review published in June cannot be delivered without more cash. \"There is not a letter,\" an MoD source said, adding that such a communication was not expected to be received either. However, other sources from within the army, navy and air force confirmed to Sky News that there is growing concern amongst the chiefs about a gap between the promises being made by Sir Keir Starmer's government to fix the UK's hollowed-out armed forces and the reality of the size of the defence budget, which is currently not seen as growing fast enough. That means either billions of additional pounds must be found more quickly, or ambitions to modernise the armed forces might need to be curbed despite warnings of mounting threats from Russia and China and pressure from Donald Trump on the UK and the rest of Europe to spend more on their own defences. \"The facts remain that the SDR (Strategic Defence Review) shot for the stars but we only have fuel for the moon,\" one source said. A second source agreed. \n                  Budget 2025: Reeves to face further questions after being accused of broken promises\n                 \n                  Paul Doyle in tears as he admits driving into fans at Liverpool FC trophy parade\n                 \n                  Budget 2025: The town where voters placed trust in Labour - and some now feel betrayed\n                 By way of example, they said General Sir Roly Walker, the head of the army, was all too aware of the financial challenges his service in particular was facing, especially given plans to regrow the force to 76,000 soldiers from 72,500 in the next parliament. The defence review set out the requirement for more troops, but such a move would need sufficient money to recruit, train and equip them. There is also a goal to expand reserve forces, which similarly costs money. Air Chief Marshal Knighton and General Walker were joined in the meeting on Tuesday at the Ministry of Defence by the other service heads, General Sir Gwyn Jenkins, the First Sea Lord, and Air Chief Marshal Harv Smyth, the Chief of the Air Staff. Read more:The Ajax fighting vehicle injured troops and cost billionsIs the army's new fighting vehicle any good? General Sir Jim Hockenhull, the commander of Cyber and Special Operations Command, was also likely to have been present. It is a regular fortnightly gathering of chiefs. This week they discussed the content of an upcoming plan on defence investment that is expected to be published next month - a timeline that is understood to have been delayed because of friction over how to make the money match the ambition. \"I know there was a very difficult meeting,\" a third source said. \"Shoehorning the SDR into the DIP (Defence Investment Plan) as inflation, foreign exchange movement, re-costing, in-year delivery drama and unforeseen additional costs arise was always going to be hard,\" the source said. \"The amount of money needed to make the thing balance is both small compared to other parts of the public sector, but also not available from this government. It's still a matter of choices, not overall affordability.\" The source pointed to what Germany and Poland are doing on defence, with both countries significantly and rapidly ramping up defence spending and expanding their militaries. By contrast, the UK will only inch up its core defence budget to 2.5% of GDP from around 2.3% by 2027, with plans to hit a new NATO target of 3.5% not expected to be reached until 2035. Responding to the Spectator claim, an MOD spokesperson said: \"All of defence is firmly behind delivery of our transformative Strategic Defence Review (SDR), which set out a deliverable and affordable plan to meet the challenges, threats, and opportunities of the 21st century. \"The plan is backed by the largest sustained increase in defence spending since the end of the Cold War - hitting 2.6% of GDP by 2027.\" The 2.6% figure cited by the spokesperson also includes intelligence spending on top of core defence spending."
    },
    {
        "title": "Guinea-Bissau: Military seizes power as President Umaro Sissoco Embalo 'deposed and arrested'",
        "description": "Soldiers have appeared on state TV in Guinea-Bissau to say the country's military has seized power, accusing its president of interfering in Sunday's election as he revealed he had been \"deposed\".",
        "url": "https://news.sky.com/story/guinea-bissau-military-seizes-power-as-president-umaro-sissoco-embalo-deposed-and-arrested-13475832",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-guinea-bissau-army-coup_7092819.jpg?20251126182206",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-26 18:26:00",
        "Headline": "The military said it was suspending the electoral process and media activities and closing borders after discovering a plot to \"manipulate electoral results\" aided by politicians, a drug lord, and foreigners.",
        "Content": "Soldiers have appeared on state TV in Guinea-Bissau to say the country's military has seized power, accusing its president of interfering in Sunday's election as he revealed he had been \"deposed\". Military spokesperson Dinis N'Tchama said in a statement that the military had decided to \"immediately depose the president of the republic\" and suspend all government institutions. He said they acted in response to the \"discovery of an ongoing plan\" that he said aimed to destabilise the country by attempting to \"manipulate electoral results\".   The \"scheme was set up by some national politicians with the participation of a well-known drug lord, and domestic and foreign nationals\", Mr N'Tchama said, but gave no details. The country has emerged as a hub for drug trafficking between Latin America and Europe. The electoral process was being suspended immediately, along with the activities of the media, while the country's borders were being closed, he said. Guinea-Bissau President Umaro Sissoco Embal칩 told French television network France 24: \"I have been deposed.\" French news outlet Jeune Afrique quoted Mr Embal칩 as saying he was arrested in what he called a coup led by the army chief of staff but did not suffer violence. An international election observer told Associated Press the president \"has been speaking to people saying he's being held by the military\". Gunfire was heard near the presidential palace in the capital, Bissau, around noon on Wednesday. A palace official said a group of armed men tried to attack the building, leading to an exchange of gunfire with guards. Gunshots were also heard around the nearby national electoral commission, an interior ministry official said. Both sources spoke on condition of anonymity. Roads leading to the palace were closed off, with checkpoints manned by heavily armed and masked soldiers, an AP reporter said. Meanwhile, Mr Embal칩 and opposition candidate Fernando Dias da Costa both claimed victory on Tuesday in the presidential and legislative elections held on Sunday, even though official provisional results were not expected until Thursday. Read more on Sky News:Man admits driving into football fansFire engulfs high-rise buildingsFarmers' parliament protest Mr Embal칩, who was elected in February 2020, was due to stand down earlier this year after serving a five-year term. That was extended until 4 September by the country's supreme court, but voting was delayed until this month. Guinea-Bissau has seen four coups and numerous attempted ones since it gained independence in 1974, including one reported last month."
    },
    {
        "title": "Charges against Donald Trump in Georgia election interference case dismissed",
        "description": "Charges against Donald Trump and others in an election interference case in the US state of Georgia have been dismissed.",
        "url": "https://news.sky.com/story/charges-against-donald-trump-in-georgia-election-interference-case-dismissed-13475789",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-donald-trump-air-force-one_7092064.jpg?20251126050835",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-26 16:04:00",
        "Headline": "It was unlikely the legal action, alleging widespread election interference by the US president, could have progressed while he was still in office, but others - including former New York mayor Rudy Giuliani - had faced charges.",
        "Content": "Charges against Donald Trump and others in an election interference case in the US state of Georgia have been dismissed. Pete Skandalakis, the prosecutor who recently took over the case, said in court papers on Wednesday that he has decided to take no further action. It was unlikely the legal action against the US president could have progressed while he was still in office, but the 14 others - including Mr Trump's personal lawyer, the former New York mayor Rudy Giuliani, and ex-White House chief of staff Mark Meadows - had still faced charges. After the charges were dismissed, Mr Trump posted on his Truth Social platform to say \"LAW and JUSTICE have prevailed in the Great State of Georgia\". He added: \"This case should have never been brought in the first place.\" The case was dismissed in full by Fulton County Superior Court judge Scott McAfee after Mr Skandalakis submitted his decision. Fulton County district attorney Fani Willis had alleged a wide-ranging conspiracy to illegally overturn Mr Trump's narrow loss to Democrat Joe Biden in the key swing state in the 2020 presidential election. Charges against Mr Trump centred around a phone call he made to Georgia's top election official, secretary of state Brad Raffensperger. According to recordings of the conversation, Mr Trump told his fellow Republican: \"I just want to find 11,780 votes.\" Mr Trump and 18 co-defendants were initially accused. Four of the accused made plea deals with prosecutors, while the others, including Mr Trump, Mr Giuliani and Mr Meadows, pleaded not guilty. Read more on Sky News:Man admits driving into football fansFire engulfs high-rise buildings An angry-looking Mr Trump was pictured as he was booked on the charges at the Fulton County Sheriff's Office, and copies of the mugshot generated sales of more than $7m (춲5.3m) in a matter of days, his campaign said. In a 22-page memo explaining his decision, Mr Skandalakis noted the entire case is \"without precedent\", and pointed in part to the challenges of trying a case against a sitting president. Mr Skandalakis wrote: \"In my professional opinion, the citizens of Georgia are not served by pursuing this case in full for another five to 10 years.\" He said he was ending the case \"to serve the interests of justice and promote judicial finality\" and his decision is \"not guided by a desire to advance an agenda but is based on my beliefs and understanding of the law\". Mr Trump's lawyer in the case, Steve Sadow, welcomed the end of what he called a \"political persecution\" of the US president. \"This case should never have been brought. A fair and impartial prosecutor has put an end to this lawfare,\" he said.  Ms Willis, who brought the case in August 2023, was disqualified from prosecuting it last December. An appeals court in the state capital, Atlanta, ruled that a romantic relationship she had with Nathan Wade, the special prosecutor she chose to lead the case, created \"a significant appearance of impropriety\". Defence lawyers claimed the district attorney profited from the case when Mr Wade used his earnings to pay for holidays the pair took. She appealed the verdict, but lost her case in September, despite Mr Wade having quit his role."
    },
    {
        "title": "Who is negotiating the potential peace deal for the US, Russia and Ukraine?",
        "description": "Earlier this week, representatives of the United States, Russia and Ukraine met in Abu Dhabi to try and find consensus on ending nearly four years of war after Russia invaded Ukraine.",
        "url": "https://news.sky.com/story/who-is-negotiating-the-potential-peace-deal-for-the-us-russia-and-ukraine-13475768",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-daniel-driscoll-kirill-dmitriev_7092701.jpg?20251126153348",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-26 15:18:00",
        "Headline": "As talks continue, our experts profile those seeking a deal for the US, Russia and Ukraine.",
        "Content": "Earlier this week, representatives of the United States, Russia and Ukraine met in Abu Dhabi to try and find consensus on ending nearly four years of war after Russia invaded Ukraine. As talks continue, our experts have written about who is negotiating the potential peace deal for the US, Russia and Ukraine. Ukraine war latest: Russia contradicts Trump on peace talks Who is US army secretary Dan Driscoll? By Mark Stone, US correspondent As army secretary, Dan Driscoll is one of the top civilians within the Pentagon. He leads the US Department of the Army, one of the three military departments within the Department of War (formerly the Department of Defence, before Donald Trump's rebrand). In the hierarchy, he sits just under Pete Hegseth, the secretary of war, but the speculation in Washington is that there is tension between the two of them. Mr Hegseth can't fire or purge Mr Driscoll, though, because he is a close friend of the vice president. He and JD Vance were at Yale together and Mr Trump likes him.  Unusually for a Trump official, he also enjoys bipartisan popularity. It was Mr Driscoll who was sent to present the 28-point plan to Ukrainian President Volodymyr Zelenskyy in Kyiv last week. Who is Russian envoy Kirill Dmitriev? By Ivor Bennett, Moscow correspondent A key figure on the Russian side is Kirill Dmitriev, Vladimir Putin's investment envoy, who seems to have developed a close relationship with Mr Trump's envoy Steve Witkoff in particular. Whenever the American envoy is in Moscow, Mr Dmitriev is never far away. The 50-year-old was born in Ukraine, and later educated in the US at Stanford and Harvard. A trained economist, he previously worked as an investment banker at Goldman Sachs and had a job with the consultancy firm McKinsey.  In 2011, he became head of Russia's sovereign wealth fund, and that's when he began to climb the Kremlin ladder. Personal connections may have aided his rise - his wife works closely with one of Mr Putin's daughters. And when it comes to dealing with America, he has long been Mr Putin's point man. In 2016, he led Moscow's early contacts with the first Trump administration, and he's been at the vanguard once again now. The initial 28-point peace plan, which heavily favoured Russia, was reportedly the result of a Miami meeting between Mr Witkoff, Mr Dmitriev and Mr Trump's son-in-law and informal adviser Jared Kushner in October. Who is Ukrainian commander Lieutenant General Kyrylo Budanov? By Deborah Haynes, security and defence editor Lieutenant General Kyrylo Budanov is one of Ukraine's top commanders and one of the country's youngest. At just 39, he's led the Ukrainian military intelligence service - or GUR - since before Russia's full-scale invasion. But Lt Gen Budanov has been waging covert operations against Russian forces since Vladimir Putin first targeted Ukraine in 2014. In that time, Lt Gen Budanov has been wounded on three occasions in battle, received awards for courage and even survived an assassination attempt. His wife has also been targeted in a poisoning. She too survived. A close ally of Volodymyr Zelenskyy, Lt Gen Budanov was once touted as a potential candidate to become defence minister. But he has stayed in his intelligence role, overseeing top secret operations, including a major ongoing mission to develop and deploy long-range drones loaded with explosives that are being launched against military and energy targets deep inside Russia. Wanted by Russia over an attack against a large bridge that links Crimea to Russia in 2022, Lt Gen Budanov's selection to take part in peace talks in Abu Dhabi with American and Russian officials may not be particularly welcomed by Moscow. Still, it is a sign that this Ukrainian general is one to watch."
    },
    {
        "title": "Paul Doyle in tears as he admits driving into fans at Liverpool FC trophy parade",
        "description": "A former Royal Marine wept in court as he admitted driving into crowds at Liverpool's Premier League victory parade.",
        "url": "https://news.sky.com/story/paul-doyle-in-tears-as-he-admits-driving-into-fans-at-liverpool-fc-trophy-parade-13475193",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-paul-doyle-liverpool_7092383.jpg?20251126114044",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2025-11-26 13:05:00",
        "Headline": "Former Royal Marine hit more than 100 people in his Ford Galaxy Titanium in just seven minutes, with victims including children as young as six months.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n  A former Royal Marine wept in court as he admitted driving into crowds at Liverpool's Premier League victory parade. Paul Doyle, 54, was due to go on trial at Liverpool Crown Court over the incident on 26 May, when more than a million fans were gathered in the city centre to celebrate the football team's 20th title win. He had previously denied 31 charges, but sobbed in the dock, with his voice, at times, barely audible, as he dramatically changed his pleas to guilty. Doyle admitted dangerous driving, affray, 17 charges of attempting to cause grievous bodily harm (GBH) with intent, nine counts of causing GBH with intent and three counts of wounding with intent. Recorder of Liverpool Judge Andrew Menary KC remanded Doyle in custody ahead of a two-day sentencing hearing from 15 December, telling him a long prison sentence is \"inevitable\". Doyle, a married father-of-three, hit more than 100 people in just seven minutes with his Ford Galaxy Titanium at around 6pm as crowds made their way home from the open-top bus parade. The charges relate to 29 victims, aged between six months and 77 years old, including eight who were children at the time. The parents of the youngest victim, Teddy Eveson, later told media he was thrown about 15 feet down the road in his pram when the crash happened. Another victim Rob Darke, who was left with a \"life-changing\" injury after attending the parade with his two sons, told Sky News he thought it was a terrorist attack. \"There was people lying about all over the place. It was like a bomb had gone off... it was carnage everywhere... people crying and screaming,\" he said. \"I thought it was terrorists. That's the first thing that came into my head. Who else would do a thing like that?\" 'Turned celebration to mayhem' Prosecutors said dashcam footage from Doyle's car showed he became \"increasingly agitated by the crowds\" as he approached Dale Street and Water Street. \"Rather than wait for them to pass, he deliberately drove at them, forcing his way through,\" said Sarah Hammond, chief crown prosecutor for CPS Mersey-Cheshire. \"Driving a vehicle into a crowd is an act of calculated violence. This was not a momentary lapse by Paul Doyle - it was a choice he made that day and it turned celebration into mayhem.\" Read more from Sky News:Main announcements in the budget at a glanceRussia contradicts Trump on Ukraine peace talksTokyo overtaken as world's biggest city  Detective Chief Inspector John Fitzgerald, of Merseyside Police, said: \"It is only by sheer luck that nobody was killed because of Doyle's reckless actions. \"In just seven minutes his dangerous driving meant that his car collided with more than 100 people, including children, in some cases trapping people underneath and causing serious injuries.\" A Liverpool FC spokesman said: \"Our victory parade last May allowed an unprecedented number of Liverpool fans to celebrate together our Premier League title win - something we were unable to do in 2020. \"The day of incredible joy ended in unimaginable circumstances and we hope today's conviction brings some peace to all those affected by the horrific incident. Our thoughts are with them all.\" "
    },
    {
        "title": "Budget 2025: The town where voters placed trust in Labour - and some now feel betrayed",
        "description": "Hitchin in Hertfordshire does well in the polls.",
        "url": "https://news.sky.com/story/budget-2025-the-town-where-voters-placed-trust-in-labour-and-some-now-feel-betrayed-13475763",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-hitchen-budget_7092927.png?20251126205632",
        "type": "UK",
        "Author": "Paul Kelso",
        "Date Published": "2025-11-26 15:07:00",
        "Headline": "Sky's Paul Kelso visits one of the country's happiest towns to see if taxpayers are still smiling after a switch to Labour and another tax-raising budget.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Hitchin in Hertfordshire does well in the polls. On the edge of the Chilterns and 30 minutes from central London by train, it's Britain's most expensive market town for first-time buyers. It's also been voted one of the top 10 best, and top 20 happiest, places to live in the country. Last summer Labour did well in the polls here too. Hitchin's 35,000 inhabitants, with above average earnings, levels of employment, and higher education, ejected the Conservatives for the first time in more than 50 years. Money latest: What the budget means for your money  Having swept into affluent southern constituencies, Rachel Reeves is now asking them to help pay for her plans via a combination of increased taxes on earnings and savings. While her first budget made business bear the brunt of tax rises, the higher earners of Hitchin, and those aspiring to join them, are unapologetically in the sights of the second. 游녤 Listen to Sky News Daily on your podcast app 游녣  Kai Walker, 27, runs Vantage Plumbing & Heating, a growing business employing seven engineers, all earning north of 춲45,000, with ambition to expand further. He's disappointed that the VAT threshold was not reduced - \"it makes us 20% less competitive than smaller players\" - and does not love the prospect of his fiancee paying per-mile to use her EV. But it's the freeze on income tax thresholds that will hit him and his employees hardest, inevitably dragging some into the 40% bracket, and taking more from those already there. \"It seems like the same thing year on end,\" he says. \"Work harder, pay more tax, the thresholds have been frozen again until 2031, so it's just a case where we see less of our money. Tax the rich has been a thing for a while or, you know, but I still don't think that it's fair. \"I think with a lot of us working class, it's just a case of dealing with the cost. Obviously, we hope for change and lower taxes and stuff, but ultimately it's a case of we do what we're told.\"  Reeves's central pitch is that taxes need to rise to reset the public finances, support the NHS, and fund welfare increases she had promised to cut. In Hitchin's Market Square it has been heard, but it is strikingly hard to find people who think this budget was for them.  Jamie and Adele Hughes both work, had their first child three weeks ago, and are unconvinced. \"We're going to be paying more, while other people are going to be getting more money and they're not going to be working. I don't think it's fair,\" says Adele. Jamie adds: \"If you're from a generation where you're trying to do well for yourself, trying to do things which were once possible for everybody, which are not possible for everybody now, like buying a house, starting a family like we just have, it's extremely difficult,\" says Jamie. Liz Felstead, managing director of recruitment company Essential Results, fears the increase in the minimum wage will hit young people's prospects hard. \"It's disincentivising employers to hire younger people. If you have a choice between someone with five years experience or someone with none, and it's only 춲2,000 difference, you are going to choose the experience.\" Read more:Budget takes UK into uncharted territory to allow spending spreeMain budget announcements at a glanceReeves reveals 춲26bn of tax risesCash ISA limit slashed - but some are exempt After five years, the cost of living crisis has not entirely passed Hitchin by. In the market Kim's World of Toys sells immaculately reconditioned and repackaged toys at a fraction of the price. Demand belies Hitchin's reputation. \"The way that it was received was a surprise to us I think, particularly because it's a predominantly affluent area,\" says Kim. \"We weren't sure whether that would work but actually the opposite was true. Some of the affluent people are struggling as well as those on lower incomes.\" Customer Joanne Levy, shopping for grandchildren, urges more compassion for those who will benefit from Reeves's spending plans: \"The elderly, they're struggling, bless them, the sick, people with young children, they are all struggling, even if they're working they are struggling.\""
    },
    {
        "title": "Budget 2025: The same old Labour? Why party's credibility might not be recoverable",
        "description": "Over and over again, in the run-up to the election and beyond, the prime minister and the chancellor told voters they would not put up taxes on working people - that their manifesto plans for government were fully costed and, with the tax burden at a 70-year high, they were not in the business of raising more taxes.",
        "url": "https://news.sky.com/story/rachel-reevess-budget-buys-keir-starmer-more-time-8211-but-labours-credibility-might-not-recover-13475870",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-beth-reeves_7092969.jpg?20251126212817",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-11-26 21:05:00",
        "Headline": "With more than 400 MPs, you might expect the PM and chancellor to take tough decisions. Instead, they find themselves just trying to survive.",
        "Content": "\n          Political editor\n              @BethRigby\n  Over and over again, in the run-up to the election and beyond, the prime minister and the chancellor told voters they would not put up taxes on working people - that their manifesto plans for government were fully costed and, with the tax burden at a 70-year high, they were not in the business of raising more taxes. On Wednesday the chancellor broke those pledges as she lifted taxes by another 춲26bn, adding to the 춲40bn rise in her first budget. She told working people a year ago she would not extend freezing tax thresholds - a Conservative policy - because it would \"hurt working people\". Budget latest: 'It can only lead to the death of us at the general election'   On Wednesday she ripped up that pledge, as she extended the threshold freeze for three years, dragging 800,000 workers into tax and another million into the higher tax band to raise 춲8.3bn. Rachel Reeves said it was a Labour budget and she's right. In the first 17 months of this government, Labour have raised tens of billions in taxes, while reversing on welfare reform - the U-turn on the winter fuel allowance and disability benefits has cost 춲6.6bn. Ms Reeves even lifted the two-child benefit cap on Wednesday, at a cost of 춲3bn, despite the prime minister making a point of not putting that pledge in the manifesto as part of the \"hard choices\" this government would make to try to bear down on the tax burden for ordinary people. The OBR predicts one in four people would be caught by the 40% higher rate of tax by the end of this parliament. Those higher taxes were necessary for two reasons and aimed at two audiences - the markets and the Labour Party. For the former, the tax rises help the chancellor meet her fiscal rules, which requires the day-to-day spending budget to be in a surplus by 2029-30. Before this budget, her headroom was just 춲9.9bn, which made her vulnerable to external shocks, rises in the cost of borrowing or lower tax takes. Now she has built her buffer to 춲22bn, which has pleased the markets and should mean investors begin to charge Britain less to borrow.  As for the latter, this was also the chancellor raising taxes to pay for spending and it pleased her backbenchers - when I saw some on the PM's team going into Downing Street in the early evening, they looked pretty pleased. I can see why: amid all the talk of leadership challenge, this was a budget that helped buy some time. \"This is a budget for self-preservation, not for the country,\" remarked one cabinet minister to me this week. You can see why: ducking welfare reform, lifting the two-child benefit cap - these are decisions a year-and-a-half into government that Downing Street has been forced into by a mutinous bunch of MPs. With a majority of 400 MPs, you might expect the PM and his chancellor to take the tough decisions and be on the front foot. Instead they find themselves just trying to survive, preserve their administration and try to lead from a defensive crouch. When I asked the chancellor about breaking manifesto promises to raise taxes on working people, she argued the pledge explicitly involved rates of income tax (despite her pledge not to extend the threshold freeze in the last budget because it \"hurt working people\"). Read more:Budget 2025: The key points at a glanceWhy Labour MPs may like Reeves's budget  Trying to argue it is not a technical breach - the Institute of Fiscal Studies disagreed - rather than taking it on and explaining those decisions to the country says a lot about the mindset of this administration. One of the main questions that struck me reflecting on this budget is accountability to the voters. Labour in opposition, and then in government, didn't tell anyone they might do this, and actually went further than that - explicitly saying they wouldn't. They were asked, again and again during the election, for tax honesty. The prime minister told me that he'd fund public spending through growth and had \"no plans\" to raise taxes on working people. Those people have been let down. Labour voters are predominantly middle earners and higher earning, educated middle classes - and it is these people who are the ones who will be hit by these tax rises that have been driven to pay for welfare spending rather than that much mooted black hole (tax receipts were much better than expected). This budget is also back-loaded - a spend-now-pay-later budget, as the IFS put it, with tax rises coming a year before the election. Perhaps Rachel Reeves is hoping again something might turn up - her downgraded growth forecasts suggests it won't. This budget does probably buy the prime minister and his chancellor more time. But as for credibility, that might not be recoverable. This administration was meant to change the country. Many will be looking at the tax rises and thinking it's the same old Labour."
    },
    {
        "title": "Military chiefs in 'difficult meeting' as tensions mount over money",
        "description": "Britain's top military chiefs held a \"very difficult\" meeting this week amid tension over how to fund plans to rebuild the armed forces or face further cuts, defence sources have said.",
        "url": "https://news.sky.com/story/military-chiefs-in-difficult-meeting-as-tensions-mount-over-money-13475876",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ajax-tanks-british-army_7073345.png?20251126212948",
        "type": "UK",
        "Author": "Deborah Haynes",
        "Date Published": "2025-11-26 21:19:00",
        "Headline": "UK chiefs question how to deliver defence reforms as funding fails to meet requirements amid rising threats from Russia and China, and pressure from NATO allies.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  Britain's top military chiefs held a \"very difficult\" meeting this week amid tension over how to fund plans to rebuild the armed forces or face further cuts, defence sources have said. The Ministry of Defence (MoD) played down a report in the Spectator magazine that the top brass, led by Air Chief Marshal Sir Rich Knighton, the chief of the defence staff, planned to write an extraordinary joint letter to John Healey, the defence secretary, to explain that his defence review published in June cannot be delivered without more cash. \"There is not a letter,\" an MoD source said, adding that such a communication was not expected to be received either. However, other sources from within the army, navy and air force confirmed to Sky News that there is growing concern amongst the chiefs about a gap between the promises being made by Sir Keir Starmer's government to fix the UK's hollowed-out armed forces and the reality of the size of the defence budget, which is currently not seen as growing fast enough. That means either billions of additional pounds must be found more quickly, or ambitions to modernise the armed forces might need to be curbed despite warnings of mounting threats from Russia and China and pressure from Donald Trump on the UK and the rest of Europe to spend more on their own defences. \"The facts remain that the SDR (Strategic Defence Review) shot for the stars but we only have fuel for the moon,\" one source said. A second source agreed. \n                  Budget 2025: Reeves to face further questions after being accused of broken promises\n                 \n                  Paul Doyle in tears as he admits driving into fans at Liverpool FC trophy parade\n                 \n                  Budget 2025: The town where voters placed trust in Labour - and some now feel betrayed\n                 By way of example, they said General Sir Roly Walker, the head of the army, was all too aware of the financial challenges his service in particular was facing, especially given plans to regrow the force to 76,000 soldiers from 72,500 in the next parliament. The defence review set out the requirement for more troops, but such a move would need sufficient money to recruit, train and equip them. There is also a goal to expand reserve forces, which similarly costs money. Air Chief Marshal Knighton and General Walker were joined in the meeting on Tuesday at the Ministry of Defence by the other service heads, General Sir Gwyn Jenkins, the First Sea Lord, and Air Chief Marshal Harv Smyth, the Chief of the Air Staff. Read more:The Ajax fighting vehicle injured troops and cost billionsIs the army's new fighting vehicle any good? General Sir Jim Hockenhull, the commander of Cyber and Special Operations Command, was also likely to have been present. It is a regular fortnightly gathering of chiefs. This week they discussed the content of an upcoming plan on defence investment that is expected to be published next month - a timeline that is understood to have been delayed because of friction over how to make the money match the ambition. \"I know there was a very difficult meeting,\" a third source said. \"Shoehorning the SDR into the DIP (Defence Investment Plan) as inflation, foreign exchange movement, re-costing, in-year delivery drama and unforeseen additional costs arise was always going to be hard,\" the source said. \"The amount of money needed to make the thing balance is both small compared to other parts of the public sector, but also not available from this government. It's still a matter of choices, not overall affordability.\" The source pointed to what Germany and Poland are doing on defence, with both countries significantly and rapidly ramping up defence spending and expanding their militaries. By contrast, the UK will only inch up its core defence budget to 2.5% of GDP from around 2.3% by 2027, with plans to hit a new NATO target of 3.5% not expected to be reached until 2035. Responding to the Spectator claim, an MOD spokesperson said: \"All of defence is firmly behind delivery of our transformative Strategic Defence Review (SDR), which set out a deliverable and affordable plan to meet the challenges, threats, and opportunities of the 21st century. \"The plan is backed by the largest sustained increase in defence spending since the end of the Cold War - hitting 2.6% of GDP by 2027.\" The 2.6% figure cited by the spokesperson also includes intelligence spending on top of core defence spending."
    },
    {
        "title": "Liverpool trophy parade victim tells of 'carnage' as Paul Doyle ploughed into crowds",
        "description": "A Liverpool fan has told how he thought he was caught up in a terrorist attack when a former Royal Marine drove into crowds at the club's victory parade.",
        "url": "https://news.sky.com/story/liverpool-trophy-parade-victim-tells-of-carnage-as-paul-doyle-ploughed-into-crowds-13475706",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rob-darke-liverpool-parade_7092604.jpg?20251126140122",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-26 13:31:00",
        "Headline": "Rob Darke, 62, says he thought he was caught in a terrorist attack when he was hit by the former Royal Marine's Ford Galaxy. ",
        "Content": " A Liverpool fan has told how he thought he was caught up in a terrorist attack when a former Royal Marine drove into crowds at the club's victory parade. Rob Darke, 62, was left with a \"life-changing injury\" after being hit by Paul Doyle's Ford Galaxy Titanium on 26 May. He had gone to celebrate Liverpool's Premier League title win with his two sons, but told Sky News how the \"fantastic day turned into a nightmare\" as he made his way home from the open-top bus parade. In an exclusive interview, he said he heard \"shouting and screaming\" and \"people coming flying towards me\" and then \"bang\". \"I just stepped off the curb and the car wheel crushed my foot,\" he said, describing the pain as \"absolutely incredible\" as the skin was ripped from his heel. \"I thought it was terrorists,\" he said. \"That's the first thing that came into my head. Who else would do a thing like that?\" \"There were people lying about all over the place. It was like a bomb had gone off... it was carnage everywhere... people crying and screaming.\" Mr Darke said he could hear \"thumps from the car as people were being run over\", adding: \"It was horrific.\" More than 130 people reported injuries after Doyle drove into crowds in Water Street just after 6pm. He was arrested at the scene. Doyle pleaded guilty at Liverpool Crown Court to 31 charges, relating to 29 victims, aged between six months and 77 years old, including eight who were children at the time. He admitted a charge of wounding with intent relating to Mr Darke, who says he was taken to hospital to be \"stitched up\" after the attack. Read more: This is what happened and when  'Life or limb' But he was left in \"excruciating pain\" when the injury became infected, and later needed to be rushed to A&E, where \"it was life or limb\". Mr Darke said he was in a wheelchair for three months and had been left with a \"life-changing injury\" and is undergoing counselling for PTSD. He said: \"Out of one-and-a-half million people, why did it have to be me?\" He said father-of-three Doyle made \"all the wrong choices\" when he \"decided he was going to plough into people\", including women and children. \"How on earth could you do that? It's just beyond any comprehension,\" he added."
    },
    {
        "title": "Man jailed over 춲1m Rolex and luxury watch fraud",
        "description": "A watch dealer who defrauded 50 victims out of more than &#163;1m has been jailed for just over five years.",
        "url": "https://news.sky.com/story/man-jailed-over-1631m-rolex-and-luxury-watch-fraud-13475804",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-watch-manchester_7092767.png?20251126170420",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-26 16:46:00",
        "Headline": "Adam Moore-Lynch pleaded guilty to fraud and was jailed for more than five years by Manchester Crown Court.",
        "Content": "A watch dealer who defrauded 50 victims out of more than 춲1m has been jailed for just over five years. Adam Moore-Lynch, who ran a business called Manchester Watch Hub, promised to sell on customer's high-value watches while taking a seller's cut. Instead, the 38-year-old sold the watches, some worth up to 춲120,000, and kept the money for himself, with total losses of around 춲1.2m. Detectives from Greater Manchester Police's economic and cybercrime unit started an investigation and arrested Mr Moore-Lynch, from Dumbarton in West Dunbartonshire, in January 2024. The force analysed the bank accounts of almost 50 victims and their mobile devices in the subsequent investigation. The defendant, who pleaded guilty to fraud, converting criminal property and carrying out a business with intent to defraud creditors between August 2023 and January 2024, was jailed for five years and one month when he was sentenced at Manchester Crown Court on Wednesday. One of the watches he took as part of the fraud was a Rolex Daytona timepiece worth 춲120,000. \n                  Children of murdered Muriel McKay lose bid to scan garden for her remains\n                 \n                  Pras Michel: Fugees rapper 'who betrayed US for money' is jailed for 14 years\n                 \n                  Billion-pound money laundering network operating in 28 towns and cities in UK\n                 It is likely that the watches were sold on to unsuspecting buyers which makes it even harder to recover them, according to Detective Constable Michelle Wilkinson, of the complex fraud investigation team. She added that: \"Although the sentence imposed will provide a degree of closure for the victims, it is recognised that this outcome remains overshadowed by the significant financial and emotional loss they continue to endure.\""
    },
    {
        "title": "NHS Tayside 'destroyed vital logbooks' linked to disgraced surgeon Sam Eljamel, inquiry hears",
        "description": "NHS Tayside has destroyed hard copy theatre logbooks linked to disgraced neurosurgeon Sam Eljamel despite a \"do not destroy\" order being in place, a public inquiry has heard.",
        "url": "https://news.sky.com/story/nhs-tayside-destroyed-vital-logbooks-linked-to-disgraced-surgeon-sam-eljamel-inquiry-hears-13475592",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sam-eljamel-eljamel-inquiry_7092333.jpg?20251126105946",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-11-26 10:20:00",
        "Headline": "Sam Eljamel is thought to have harmed dozens of patients while head of neurosurgery at Dundee's Ninewells Hospital from 1995 until his suspension in December 2013.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n NHS Tayside has destroyed hard copy theatre logbooks linked to disgraced neurosurgeon Sam Eljamel despite a \"do not destroy\" order being in place, a public inquiry has heard. Eljamel was head of neurosurgery at Dundee's Ninewells Hospital from 1995 until his suspension in December 2013. During that time he is thought to have harmed dozens of patients and left some with life-changing injuries. Eljamel resigned from his post in May 2014 and is now believed to be operating in Libya. The Eljamel Inquiry into his professional practice was announced by the Scottish government in 2023 and will probe how concerns were responded to by employer NHS Tayside and whether the systems in place to protect patients were adequate. Joanna Cherry KC, for the patient group, made an opening statement as part of the views of core participants at a hearing in Edinburgh on Wednesday. She claimed the group and legal team were \"appalled\" to learn that NHS Tayside had recently discovered that about 40 hard copy theatre logbooks, some of which would have contained information relating to Eljamel's surgeries in the period 1995 to 2013, were destroyed by health board employees in July. Ms Cherry said: \"It beggars belief that this should have occurred, notwithstanding everything that has gone before. \"Patients and their representatives have repeatedly raised concerns that their medical records may have been tampered with or be incomplete. \"And in these circumstances, it should have been obvious that these logbooks might have provided vital evidence for this inquiry to fill gaps in patient records.\" Ms Cherry highlighted the formal \"do not destroy notices\" issued in October 2024. She added: \"It seems to us that the only explanation for what has occurred must be gross negligence, or indeed possible malice.\" Ms Cherry urged for witnesses to be called upon to give evidence under oath about how the documents came to be destroyed. Speaking on behalf of NHS Tayside, Una Doherty KC admitted around 40 logbooks that dated from the 1960s onwards were \"unfortunately destroyed\". Ms Doherty said: \"NHS Tayside understands that some logbooks may have contained information of potential assistance to the inquiry's investigations.\" The matter was said to have been \"escalated immediately\" within the health board and an internal investigation launched, which found the employees were unaware of the connection between the logbooks and Eljamel. Ms Doherty added: \"Given the importance of this matter, it has been raised at a senior level within NHS Tayside. \"Renewed instructions have been communicated to staff in relation to identification, logging and retention of documentation relevant to Mr Eljamel to try to ensure that there is no further disruption of documents in error.\" Ms Doherty said much of the information within the destroyed logbooks should be contained in the patient records if those still exist. She added: \"It is hoped that much of the information will still be available to the inquiry, albeit in a different format. \"NHS Tayside deeply regrets this error and is committed to ensuring that it does not happen again.\" During her statement, Ms Cherry highlighted a \"small flavour\" of those reportedly affected by Eljamel's \"actions and inactions\". One patient, on the morning of her third surgery at the hands of Eljamel, was said to have been \"so scared that she vomited\". Ms Cherry said: \"She told a nurse that she had changed her mind and wanted to go home, but the next thing she remembers is waking up, having had the surgery. \"The long-term implications of that spinal surgery, which was botched, have been so severe that she's lost her marriage as well as her job and her home. \"She's been through some very dark times and has come very close to taking her own life. \"The mess that Mr Eljamel left her spine in is such that it is inoperable and she suffers constant falls and broken limbs.\" One patient was said to be \"left paralysed from the neck down\", while another was reportedly left with epilepsy and blindness in the right side of both eyes after undergoing three brain surgeries in the space of two weeks. Ms Cherry said: \"This gentleman was left unable to read and write and had to take early retirement.\" The lawyer said some of Eljamel's patients had \"suffered suicidal ideation\". She added: \"Some have lost their jobs, their ability to access work and education, their homes, their marriages and their families.\" Ms Cherry said some of the group members are representatives of patients who have since died \"without seeing justice\". The afternoon session was also expected to hear from Laura Thomson KC for Scottish ministers. On Thursday, submissions will be made on behalf of the Royal College of Surgeons (Edinburgh), Healthcare Improvement Scotland and NHS Education for Scotland. The inquiry will also hear from the separate Independent Clinical Review (ICR), which is not a core participant. Read more from Sky News:Why is flu season set to be worse this year?'One in four' GPs using AI at work despite lack of training The inquiry, chaired by Lord Weir, is expected to begin its evidential hearings in 2026. Jamie Dawson KC, senior counsel to the inquiry, revealed the first block has been delayed from February to a three-week slot commencing 20 April. It will include the roles of key bodies, individuals, policies and practices relevant to the inquiry. The section one hearings will look at the broad trajectory of Eljamel's career in Scotland, the types of work he undertook and the systems surrounding his NHS practice. They will also examine the circumstances surrounding his appointment to the role of consultant neurosurgeon at Ninewells Hospital along with other key positions, as well as the complaints and feedback systems in place at NHS Tayside. Ms Cherry said the inquiry's purpose is to \"establish facts, ensure accountability, and make recommendations for the future\". She added: \"The group and their loved ones need recognition, accountability and justice for years of suffering and years of deceit. \"They are seeking answers, not just for Mr Eljamel's actions, but also for the subsequent cover-ups and the impact that these cover-ups have had upon them.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Third of people affected by 'loan charge' could have debts wiped away",
        "description": "Almost a third of people affected by the \"loan charge\" could have their debts wiped away as the government attempts to draw a line under a tax scandal that has been linked to multiple suicides.",
        "url": "https://news.sky.com/story/third-of-people-affected-by-loan-charge-could-have-depts-wiped-away-13475755",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-westminster-loan-charge_6461336.jpg?20251126165654",
        "type": "UK",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-11-26 15:01:00",
        "Headline": "In a report published alongside the budget, the government said it would go beyond the recommendations outlined in an independent report. As a result, most people will see their bills cut in half, at a cost of hundreds of millions to the public purse. ",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Almost a third of people affected by the \"loan charge\" could have their debts wiped away as the government attempts to draw a line under a tax scandal that has been linked to multiple suicides. In a report published alongside the budget, the government said it would go beyond the recommendations outlined in an independent report, which was also published today. As a result, most people will see their bills cut in half, at a cost of 춲365m over the next five years to the public purse. Labour promised a review into the controversial tax policy, which was implemented by the Conservatives in 2019, to try to recover tax revenue from individuals whose employers did not pay it. Money latest: What the budget means for your money  Many of those affected were agency workers - cleaners or care workers - who were paid via umbrella companies, a poorly regulated industry rife with tax-avoidance schemes. Others were contractors who engaged umbrellas because it was less complicated than setting up as a limited company. In his 2016 budget, then chancellor, George Osborne, announced new legislation to try and recover the missing revenue, not from the umbrella companies but from the individuals. \n                  Budget 2025: Reeves to face further questions after being accused of broken promises\n                 \n                  Budget 2025: The same old Labour? Why party's credibility might not be recoverable\n                 \n                  Budget 2025: Chancellor spared wrath of bond vigilantes - for now\n                 Campaigners have long described the policy as grossly unfair, arguing that it attacks victims of mis-selling. Link to at least 10 suicides The policy has caused widespread financial despair and has been linked to 10 suicides. HMRC was made aware of a possible 11th suicide as the report was being finalised. The review, which was led by former HM Revenue & Customs inspector Ray McCann, recommended reducing liabilities by removing late payment interest penalties (thought to be worth about 25% of all liabilities). The original policy looked at all the money earned over several years and made it taxable in one year, meaning individuals saw larger chunks of their income fall into higher tax bands. The review suggested unstacking those years. It will also reduce the income under consideration by 10% each year to take into account the fees that the scheme operators deducted. That will be tapered to 5% above 춲50,000 and stop altogether after 춲150,000. The government accepted the findings, which will be made law through a finance bill. It will go beyond that by wiping 춲5,000 off each bill. It means lower earners will benefit disproportionately, with some seeing their bills entirely wiped away, but those with the highest debt burdens could still be facing six-figure bills. The Treasury said the total package would cost the public purse 춲365m over the next five years, but the Office for Budget Responsibility said it was still highly uncertain that all the money would be collected, with many of those affected now approaching or having retired. Calls for widening the scope The review was aimed at supporting people to reach a settlement, but it did not challenge the fundamental fairness of the policy. Campaigners repeatedly called for the scope to be widened, so that it examined the role of scheme developers, umbrella companies, recruitment agencies, accountants and tax advisers. They also called for the tax office to give individuals the same treatment as large corporations after it emerged that HMRC settled at just 15% with some large banks that used similar tax avoidance arrangements. Steve Packham, from the Loan Charge Action Group, said today: \"The McCann Review has only reviewed settlement terms of those facing the Loan Charge and as expected has therefore recommended some concessions. \"This is wholly different from a genuine review of the Loan Charge Scandal and being conducted by a former Assistant Director of HMRC, was clearly not independent. \"The concessions being offered are nowhere near the settlement deals offered to the big banks for use of similar arrangements. \"How can it be fair to give multi-billion-pound banks settlements of 10-15% whilst still demanding several times that from victims of mis-selling?\" Estimates vary, but around 70,000 people are thought to have been affected by the loan charge, with 25,000 having settled. The government will not be reviewing the cases it has already closed. \"The review also excludes those who were pushed to settle under duress from HMRC, which means they will have ended up paying more than those who didn't, which is grossly unfair,\" Mr Packham said. What was the loan charge? The \"loan charge\" was introduced in 2019 in an attempt to recover tax revenue that had been lost through disguised remuneration schemes. Many of these schemes paid workers through loans that were never intended to be paid back to try to circumvent income tax and national insurance. They started proliferating across the economy at the turn of the century, when the Labour government introduced new rules, known as IR35, that made it more difficult for contractors to operate as limited companies. While some of those who engaged in loan schemes entered into them with the explicit intent to minimise their tax bills, a large number were simply trying to do the right thing. Many contractors were advised by accountants to avoid setting up limited companies and to sign up to umbrella companies instead. These would manage their payments and limit the risk of falling foul of IR35 rules. However, the umbrella market was poorly regulated and a wild west of rogue operators, many of whom were, in fact, offshore tax avoidance schemes. Agency workers, including nurses, cleaners and council workers, were also affected. In many cases, they were told by recruitment agencies that they would be paid by an umbrella company, and some were given no other option. The NHS, local authorities and other public sector organisations all engaged workers who were part of these schemes. Back in 2021, HMRC even admitted that it had at least 15 contractors on its own books who were part of \"disguised remuneration schemes\" between 2016 and 2020. Sky News spoke to workers who saw deductions on their payslips that they presumed were tax deductions, but these were fees pocketed by the promoters. HMRC and the Treasury slowly became alert to the scale of the missing tax revenue and sought to recoup it, not from the companies but from the individuals. These schemes were deemed to be disguised remuneration and, in his 2016 budget, former chancellor George Osborne brought in the Loan Charge. The law was passed by parliament and made individuals liable for the tax that the employers should have paid. The schemes took different forms, but in many of the cases, the umbrella company would have been the legal employer of the workers. Read more:Accountants paid to place clients into tax avoidance schemesRise in suicide attempts linked to HMRC crackdownHMRC accused of 'dangerous' new tactics in tax crackdown It is a campaign that has driven people to the brink of bankruptcy, devastated families and has been linked to 10, possibly 11, suicides. Another 14 people have attempted to take their own lives. Labour promised a new independent review of the loan charge before the general election last year. A previous report by Lord Amyas Morse in 2019 was criticised for involving officials from the Treasury and HMRC, organisations that were architects of the loan charge. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. Alternatively, you can call Mind's support line on 0300 102 1234, or NHS on 111."
    },
    {
        "title": "Body found in Scotland amid search for missing Merseyside man, as police probe 'unexplained' death",
        "description": "A body has been found close to a major road in Scotland following a search for a man missing from Merseyside.",
        "url": "https://news.sky.com/story/body-found-in-scotland-amid-search-for-missing-merseyside-man-as-police-probe-unexplained-death-13475810",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-kenneth-unsworth-police-scotland_7092776.jpg?20251126171732",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-26 17:09:00",
        "Headline": "Kenneth Unsworth, 46, was last seen on 20 November, leaving the town of Huyton.",
        "Content": "A body has been found close to a major road in Scotland following a search for a man missing from Merseyside. Police Scotland said it was alerted to the discovery off the A90 between Brechin in Angus and Laurencekirk in Aberdeenshire at about 12.20pm on Wednesday. The force said formal identification is yet to take place, but the family of Kenneth Unsworth had been informed. Mr Unsworth, 46, was last seen on Thursday 20 November, leaving the town of Huyton. Read more from Sky News:Man admits driving into fans at Liverpool FC trophy parade A Police Scotland spokesperson said: \"The death is being treated as unexplained and enquiries are ongoing to establish the full circumstances.\""
    },
    {
        "title": "Almost 280 people missing as huge fire engulfs Hong Kong flats - dozens confirmed dead",
        "description": "At least 44 people have been killed after a fire engulfed several buildings at a high-rise residential complex in Hong Kong.",
        "url": "https://news.sky.com/story/dozens-killed-in-fire-in-high-rise-block-in-hong-kong-13475573",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-newspix-newspix281125_7092208.jpg?20251126090443",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-26 09:41:00",
        "Headline": "About 900 people have been evacuated to temporary shelters after Hong Kong's deadliest fire in years broke out at the Wang Fuk Court housing complex in the city's Tai Po district.",
        "Content": " At least 44 people have been killed after a fire engulfed several buildings at a high-rise residential complex in Hong Kong. Hong Kong leader John Lee said another 279 people were reported missing, while 45 are in a critical condition. About 900 people have been evacuated to temporary shelters after the blaze - Hong Kong's deadliest fire in years - broke out at the Wang Fuk Court housing complex in the city's Tai Po district. Three men have since been arrested on suspicion of manslaughter, broadcaster RTHK reported. Meanwhile, fire chiefs said the high temperatures were making it challenging for crews to mount rescue operations. Mr Lee said the fire was \"coming under control\" shortly after midnight. The blaze was upgraded to a level 5 alarm, the highest level of severity, as night fell. The dead included one firefighter, officials said earlier. A number of other firefighters were said to have been hurt while trying to tackle the flames as they ripped through the 31-storey towers. Records show the Wang Fuk Court site consists of eight blocks, with almost 2,000 apartments housing around 4,800 residents, including many elderly people. It was built in the 1980s and has recently been undergoing a major renovation. The fire, which broke out at 2.51pm local time, had spread on bamboo scaffolding and construction netting set up around the exterior of the complex. It was not known how the fire started, but officials said it began on the external scaffolding of one of the buildings before spreading inside and to nearby buildings, likely aided by windy conditions. Flames and smoke were still pouring out of many windows as night fell. Chinese President Xi Jinping expressed condolences to the firefighter who died, and extended his sympathies to the families of the victims, according to state broadcaster CCTV. He also urged an \"all-out\" effort to minimise casualties and losses. The UK's foreign secretary described the fire as \"truly devastating and deeply depressing\". Yvette Cooper said: \"The UK sends heartfelt condolences to all the families affected and to the people of Hong Kong.\" Tai Po is in the northern part of Hong Kong, and close to the border with the mainland Chinese city of Shenzhen. Read more from Sky News:Tokyo overtaken as world's biggest cityBrazil's ex-president begins 27-year prison sentence Bamboo scaffolding is a common sight in Hong Kong at building construction and renovation projects. However, the government said earlier this year it would start phasing it out for public projects because of safety concerns. The blaze is the deadliest fire in Hong Kong since the deaths of 41 people in a commercial building in Kowloon in November 1996. That fire was later found to have been caused by welding during internal renovations, with a public inquiry yielding sweeping updates to building standards and fire safety regulations in the city's high-rise offices, shops and homes."
    },
    {
        "title": "Guinea-Bissau: Military seizes power as President Umaro Sissoco Embalo 'deposed and arrested'",
        "description": "Soldiers have appeared on state TV in Guinea-Bissau to say the country's military has seized power, accusing its president of interfering in Sunday's election as he revealed he had been \"deposed\".",
        "url": "https://news.sky.com/story/guinea-bissau-military-seizes-power-as-president-umaro-sissoco-embalo-deposed-and-arrested-13475832",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-guinea-bissau-army-coup_7092819.jpg?20251126182206",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-26 18:26:00",
        "Headline": "The military said it was suspending the electoral process and media activities and closing borders after discovering a plot to \"manipulate electoral results\" aided by politicians, a drug lord, and foreigners.",
        "Content": "Soldiers have appeared on state TV in Guinea-Bissau to say the country's military has seized power, accusing its president of interfering in Sunday's election as he revealed he had been \"deposed\". Military spokesperson Dinis N'Tchama said in a statement that the military had decided to \"immediately depose the president of the republic\" and suspend all government institutions. He said they acted in response to the \"discovery of an ongoing plan\" that he said aimed to destabilise the country by attempting to \"manipulate electoral results\".   The \"scheme was set up by some national politicians with the participation of a well-known drug lord, and domestic and foreign nationals\", Mr N'Tchama said, but gave no details. The country has emerged as a hub for drug trafficking between Latin America and Europe. The electoral process was being suspended immediately, along with the activities of the media, while the country's borders were being closed, he said. Guinea-Bissau President Umaro Sissoco Embal칩 told French television network France 24: \"I have been deposed.\" French news outlet Jeune Afrique quoted Mr Embal칩 as saying he was arrested in what he called a coup led by the army chief of staff but did not suffer violence. An international election observer told Associated Press the president \"has been speaking to people saying he's being held by the military\". Gunfire was heard near the presidential palace in the capital, Bissau, around noon on Wednesday. A palace official said a group of armed men tried to attack the building, leading to an exchange of gunfire with guards. Gunshots were also heard around the nearby national electoral commission, an interior ministry official said. Both sources spoke on condition of anonymity. Roads leading to the palace were closed off, with checkpoints manned by heavily armed and masked soldiers, an AP reporter said. Meanwhile, Mr Embal칩 and opposition candidate Fernando Dias da Costa both claimed victory on Tuesday in the presidential and legislative elections held on Sunday, even though official provisional results were not expected until Thursday. Read more on Sky News:Man admits driving into football fansFire engulfs high-rise buildingsFarmers' parliament protest Mr Embal칩, who was elected in February 2020, was due to stand down earlier this year after serving a five-year term. That was extended until 4 September by the country's supreme court, but voting was delayed until this month. Guinea-Bissau has seen four coups and numerous attempted ones since it gained independence in 1974, including one reported last month."
    },
    {
        "title": "New Zealand 'suitcase murders': Woman jailed for life for killing her two children",
        "description": "A woman has been jailed for life in New Zealand for murdering her two children, whose bodies were found in suitcases in an abandoned storage unit more than three years ago.",
        "url": "https://news.sky.com/story/new-zealand-suitcase-murders-woman-jailed-for-life-for-killing-her-two-children-13475542",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-hakyung-lee-zealand_7029247.jpg?20250923115716",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-26 07:43:00",
        "Headline": "Hakyung Lee, born in South Korea, was convicted in September after admitting using anti-depressant medication to kill her children, aged six and eight, in 2018.",
        "Content": "A woman has been jailed for life in New Zealand for murdering her two children, whose bodies were found in suitcases in an abandoned storage unit more than three years ago. Hakyung Lee, born in South Korea, was convicted in September after admitting using anti-depressant medication to kill her children, aged six and eight, in 2018. Their bodies were discovered in the storage unit when its new owners were sorting through its contents after buying it in an online auction in August 2022. Lee - a New Zealand citizen - had money troubles and stopped paying rent on the Auckland storage unit. The 45-year-old was extradited to New Zealand in late 2022, after fleeing to South Korea shortly after the murders and changing her name. Her lawyers claimed the killings happened after she \"descended into madness\" following the death of her husband in 2017, and on Wednesday, argued that a life sentence would be unjust given her mental health issues. But prosecutors said there was no evidence Lee was suicidal at the time of the killings, according to the New Zealand Herald. Judge Geoffrey Venning rejected calls for a lesser penalty, but he did approve compulsory treatment at a secure psychiatric facility on the condition that Lee would return to prison once deemed mentally fit, the newspaper reported. The judge told Lee: \"You knew your actions were morally wrong... perhaps you could not bear to have your children around you as a constant reminder of your previous happy life.\" Lee was sentenced to life imprisonment and must serve a minimum non-parole period of 17 years. Read more from Sky News:Trump's peace plan had Russian fingerprints all over it - now we know whyDefiant Maduro wields sword as he sends message to US Detective Inspector Tofilau Faamanuia Va'aelua said: \"Yuna and Minu would have been 16 and 13 today. \"Our thoughts are with the wider family today for the tragic loss of these two young children.\"  Jimmy Sei Wook Jo, the children's uncle, was in court, where a lawyer read a statement on his behalf. \"I never imagined such a profound tragedy would ever befall our family,\" the statement said, according to local news outlets. \"I feel like I failed to look after my niece and nephew.\""
    },
    {
        "title": "Trump's peace plan had Russian fingerprints all over it - and now we know why",
        "description": "If there was much surprise and confusion about the origins of a US-backed peace proposal for Ukraine that had Russian fingerprints all over it, there is less now.",
        "url": "https://news.sky.com/story/trumps-peace-plan-had-russian-fingerprints-all-over-it-and-now-we-know-why-13475506",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-witkoff-putin_7092063.jpg?20251126043945",
        "type": "World",
        "Author": "James Matthews",
        "Date Published": "2025-11-26 04:31:00",
        "Headline": "There must be serious questions surrounding Steve Witkoff's engagement with the Russians - and serious concerns around consequences that are potentially catastrophic, writes Sky's James Matthews.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n If there was much surprise and confusion about the origins of a US-backed peace proposal for Ukraine that had Russian fingerprints all over it, there is less now. To learn of US envoy Steve Witkoff and his Russian interactions is to understand the handbrake turn towards Moscow. The Bloomberg report of Witkoff's recent involvement distills eye-watering detail of his contact with Yuri Ushakov, Vladimir Putin's senior adviser on foreign policy. Among the revelations, it tells of the American advising the Russian on dealing with Trump. In a phone call last month, Witkoff told Ushakov that Zelenskyy was coming to visit the White House, and suggested Putin speak to Trump beforehand. Witkoff reportedly said: \"The president will give me a lot of space and discretion to get to the deal.\" He spoke of Trump's 20-point Gaza peace plan and suggested that \"maybe we do the same thing with you\". Read more:Who actually wrote Trump's peace plan?Steve Witkoff: Real estate mogul turned envoy  A good impression of a useful idiot Subsequently, Witkoff drafted the controversial peace proposal with his Russian counterparts, and the US pressured Ukraine to accept it. The report paints an unflattering picture of Trump's envoy doing a good impression of a useful idiot. There must be serious questions surrounding his engagement with the Russians and serious concerns around consequences that are potentially catastrophic. Moscow's threat to Ukraine and to the security infrastructure of Western Europe is strengthened on his handshake. He'll press the flesh in Russia once more - Donald Trump is sending Witkoff back to Moscow for further talks aimed at bridging the Ukraine-Russia impasse.  Scandal isn't what it used to be Putin has given the Americans little to no encouragement around their reworked plan and Kyiv will shudder at what Trump's \"Mr Fixit\" might fix next. They will despair of his continued involvement at any level and what it says about Trump's perspective and where his loyalties lie. In any other job, Witkoff might have been sacked for being irredeemably compromised. At any other time, this would have been viewed, universally, as a major scandal. But under Donald Trump, scandal isn't what it used to be.  The president and his point man continue to consort with Vladimir Putin. On the evidence of Steve Witkoff's interaction, the power dynamic leans less Trump than we might have thought."
    },
    {
        "title": "Taiwan to prepare for combat by 2027, president says - as he warns China is preparing to take the country by force",
        "description": "Taiwan will prepare itself for combat within the next two years amid \"intensifying\" threats from China, the nation's president has declared.",
        "url": "https://news.sky.com/story/taiwan-to-prepare-for-combat-by-2027-president-says-as-he-warns-china-is-preparing-to-take-the-country-by-force-13475504",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-taiwan-army_7092056.jpg?20251126041320",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-26 03:48:00",
        "Headline": "President Lai Ching-te said the government will work to counter any attempts at \"repression\", and achieve a \"high level of combat preparedness\" within two years.",
        "Content": " Taiwan will prepare itself for combat within the next two years amid \"intensifying\" threats from China, the nation's president has declared. Lai Ching-te held a news conference on Wednesday morning amid a ramping up of military and political pressure by Beijing, which views the democratically-governed island as its own territory. Speaking after announcing plans to boost defence spending with a \"special\" $40bn (춲30.6bn) budget, Mr Lai said Xi Jinping's regime was \"speeding up military preparations to take Taiwan by force\". It comes after Mr Xi used a phone call with Donald Trump to describe Taiwan's return to mainland China as \"an integral part of the post-war international order\". Taiwan has rejected that assertion, and the prospect of becoming part of China. China has offered Taiwan a \"one country, two systems\" model, but this position is not supported by any mainstream political party. That model is the principle under which Hong Kong has been governed by Beijing, but recent years have seen an increasing erosion of civil liberties there. Such an arrangement is not supported by any mainstream political party in Taiwan. Mr Lai said the government will work to counter any attempts at \"repression\" by China, and achieve a \"high level of combat preparedness\" by 2027. The supplementary defence budget will be spent on equipment including missiles and drones, as well as investment in artificial intelligence, with greater cooperation with the US. Read more from Sky News:Bolsonaro begins prison sentenceTrump talks up Ukraine-Russia deal  The US has not taken a side when it comes to Taiwan's sovereignty, but is opposed to any use of force to seize the territory. However, the Trump administration has also been ambiguous over whether it would deploy troops if any war broke out in the Taiwan Strait. Washington has been pressuring Taiwan to increase its own defence spending, much as it has its allies in Europe. Mr Lai - who described relations with the US as \"rock solid\" - warned any attempt at compromise in the face of aggression \"will only bring war\". He described \"the most threatening scenario\" not as military action, but giving up."
    },
    {
        "title": "At least 17 dead after landslides and flash floods in Sumatra, Indonesia",
        "description": "Torrential rain has triggered flash floods and landslides in Sumatra, Indonesia, killing at least 17 people.",
        "url": "https://news.sky.com/story/at-least-17-dead-after-landslides-and-flash-floods-in-sumatra-indonesia-13475611",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sumatra-indonesia_7092313.jpg?20251126131218",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-26 10:36:00",
        "Headline": "Six people are also missing, officials said on Wednesday, as rescue teams struggled to reach affected areas.",
        "Content": "Torrential rain has triggered flash floods and landslides in Sumatra, Indonesia, killing at least 17 people. Six people are missing, officials said on Wednesday, as rescue teams struggled to reach affected areas in North Sumatra province. Monsoon rains over the past week have led to rivers bursting their banks and tearing through hilly villages as mud, rocks and trees tumbled down, leaving a trail of destruction, police said. Rescue workers had recovered at least five bodies and three injured people in the worst-hit city of Sibolga by Wednesday. They were searching for four villagers who were reported missing, a statement said. In the neighbouring district of Central Tapanuli, landslides struck several homes, killing a family of four, with floods submerging almost 2,000 homes and buildings. Rescuers recovered seven more bodies in South Tapanuli district, after floods and landslides that uprooted trees and prompted more than 2,800 residents to flee to temporary shelters. Abdul Muhari, spokesperson for the country's national disaster mitigation agency, said another 58 were injured. He said landslides also hit 50 houses in North Tapanuli district and destroyed at least two main bridges in the area. Videos posted on social media showed water streaming down from rooftops as panicked residents scrambled to safety. In some areas, flash floods dramatically worsened, transforming streets into raging torrents carrying tree trunks and debris. Sibolga police chief Eddy Inganta said emergency shelters had been set-up, and authorities urged residents in high-risk zones to evacuate immediately, warning continued rainfall could trigger further landslides. \"Bad weather and mudslides hampered the rescue operation,\" Mr Inganta said, adding access remained limited as rescuers battled harsh conditions. Tuesday's disasters occurred the same day the disaster mitigation agency declared the official end of relief efforts in two areas of Java, Indonesia's most populated island, after 10 days of operations. More than 1,000 rescue workers had been deployed to search for people buried under landslides triggered by torrential rains that left 38 people dead in Central Java's districts of Cilacap and Banjarnegara. At least two people in Cilacap and 11 in Banjarnegara were still unaccounted for when the operations ended, as unstable ground, bad weather and the depth and extent of the landfill material posed a high safety risk to residents and rescue teams, the agency said. Heavy seasonal rain from about October to March often causes flooding and landslides in Indonesia - an archipelago of more than 17,000 islands including Sumatra - where millions of people live in mountainous areas or near fertile floodplains. Read more from Sky News:Nearly 1,000 evacuated as Indonesian volcano eruptsAt least four killed in Hong Kong high-rise fireMaduro wields sword as he sends message to US Last week also saw nearly 1,000 people from three villages on Java forced to flee to shelters after the eruption of Mount Semeru, the island's highest volcano."
    },
    {
        "title": "Venezuela: Maduro brandishes sword and vows to defy any US attempt to overthrow his government ",
        "description": "Venezuelan President Nicolas Maduro has vowed to defy any US attempt to overthrow his government - telling crowds that \"failure is not an option\".",
        "url": "https://news.sky.com/story/venezuela-maduro-brandishes-sword-and-vows-to-defy-any-us-attempt-to-overthrow-his-government-13475505",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-venezuela-maduro_7092061.jpg?20251126041600",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-26 04:11:00",
        "Headline": "Donald Trump, like his predecessor Joe Biden, does not recognise Nicolas Maduro as the country's leader. He is currently on his third term after being declared the winner of last year's presidential election, despite evidence that the opposition defeated him by a 2-to-1 margin.",
        "Content": "Venezuelan President Nicolas Maduro has vowed to defy any US attempt to overthrow his government - telling crowds that \"failure is not an option\". The 63-year-old brandished a sword as he addressed supporters during a march in Caracas, against a backdrop of growing tensions with Donald Trump's administration. Dressed in camouflage fatigues, Mr Maduro said: \"We must be ready to defend every inch of this blessed land from imperialist threat or aggression, no matter where it comes from.\" Since September, US military forces have been conducting a series of strikes against vessels suspected of drug trafficking in international waters, killing at least 80 people. Washington has claimed that several of these boats had departed from Venezuela, with Mr Maduro describing the deployment as an assault on the nation's sovereignty. 'Stop this madness' Yesterday, Cuba also accused the US of seeking a violent overthrow of Mr Maduro's government - and called its military presence in the region \"exaggerated and aggressive\". The country's foreign minister, Bruno Rodriguez, said ousting Venezuela's leader would be extremely dangerous and irresponsible, not to mention a violation of international law. He added: \"We appeal to the people of the United States to stop this madness. The US government could cause an incalculable number of deaths and create a scenario of violence and instability in the hemisphere that would be unimaginable.\"  Reports suggest the US is planning to launch a new phase of Venezuela-related operations in the coming days. Critics have questioned the legality of America's campaign and argue it amounts to extrajudicial killings, with a recent poll suggesting just 29% of voters support this policy. Officials within Maduro's government have claimed that Washington's actions are being driven by economic motives. Venezuelan minister Delcy Rodriguez said: \"They want Venezuela's oil and gas reserves. For nothing, without paying. They want Venezuela's gold. \"They want Venezuela's diamonds, iron, bauxite. They want Venezuela's natural resources.\" Donald Trump, like his predecessor Joe Biden, does not recognise Mr Maduro as the country's leader. He is currently on his third term after being declared the winner of last year's presidential election, despite evidence that the opposition defeated him by a two-to-one margin. Mr Maduro and senior officials have been repeatedly accused of human rights violations against real and perceived government opponents. Earlier this week, the US designated Venezuela's Cartel de los Soles - Cartel of the Suns in English - as a foreign terrorist organisation for importing illegal drugs to the States.  The Trump administration has claimed that Maduro is part of this group, but Venezuelan officials have described its mere existence as a \"ridiculous fabrication\". Speaking to reporters on Air Force One as he travelled to Florida for Thanksgiving, the president suggested he might be planning to talk to Mr Maduro. \"If we can save lives, if we can do things the easy way, that's fine,\" the US president said. \"And if we have to do it the hard way, then that's fine too.\" Read more world news:Russia 'making concessions', Trump saysFour more arrests over Louvre heistBrazil's Bolsonaro begins 27-year jail term  Carlos Diaz Rosillo, a former US deputy assistant secretary of defence during the first Trump administration, does not believe America will go to war with Venezuela. He told The World With Dominic Waghorn: \"What I do see is a strategy of maximum pressure on the regime. I do think if there's any change, that change has to come from within the military.\" Dr Rosillo said the official position of the US government is not regime change, but Mr Trump would like to see that happen in Venezuela."
    },
    {
        "title": "Teenagers launch legal challenge over Australia's ban on social media for children",
        "description": "Two teenagers have launched a legal challenge over Australia's ban on social media for children younger than 16.",
        "url": "https://news.sky.com/story/teenagers-ask-judges-to-block-australias-ban-on-social-media-for-children-13475530",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-noah-jones-macy-neyland_7092209.jpg?20251126090829",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-26 07:13:00",
        "Headline": "Two 15-year-olds, Noah Jones and Macy Neyland, are listed as plaintiffs in the legal challenge. It comes two weeks before the pioneering law stopping under-16s from accessing platforms like TikTok is set to take effect.",
        "Content": "Two teenagers have launched a legal challenge over Australia's ban on social media for children younger than 16. The challenge comes two weeks before the law, a world first, is set to take effect. It is being organised by The Digital Freedom Project campaign group which said on Wednesday it had launched proceedings in Australia's high court in a bid to block the law. Two 15-year-olds, Noah Jones and Macy Neyland, are listed as plaintiffs in the case. More than one million accounts held by teenagers under-16 are set to be deactivated in Australia when the ban on platforms including YouTube, TikTok, Snapchat, Facebook and Instagram starts on 10 December. The Digital Freedom Project claims the ban \"robs\" young Australians of their freedom of political communication, an implied right in the constitution. Australia does not have an express right to free speech. \"The legislation is grossly excessive,\" the statement said. Miss Neyland said the law would ban young people from sharing their views online. Read more from Sky News:Maduro wields sword as he sends message to USFour more arrests made over Louvre heist  \"Young people like me are the voters of tomorrow... we shouldn't be silenced. It's like Orwell's book 1984, and that scares me,\" she said. After news of the legal challenge broke, Australia's communications minister Anika Wells said the country's centre-left government, led by Prime Minister Anthony Albanese, would not be put off by threats and legal challenges. \"Despite the fact that we are receiving threats and legal challenges by people with ulterior motives, the Albanese Labor government remains steadfastly on the side of parents, and not of platforms,\" Ms Wells said. Australian media has reported that YouTube has also threatened to launch a legal challenge on the grounds that the ban stifled political communication. Governments and tech firms worldwide are closely watching Australia's effort to implement the ban - one of the most comprehensive global efforts to police minors' social media access. The ban was passed into law in November last year and is supported by the majority of Australians, according to opinion polling. The Digital Freedom Project's president is John Ruddick, a member of the Libertarian Party in the New South Wales state Parliament. The Australian government said research showed social media over-use was harming young teens, including causing misinformation, enabling bullying and harmful depictions of body image. Companies that fail to comply with the ban could face penalties of up to A$49.5m (춲24.4m)."
    },
    {
        "title": "Charges against Donald Trump in Georgia election interference case dismissed",
        "description": "Charges against Donald Trump and others in an election interference case in the US state of Georgia have been dismissed.",
        "url": "https://news.sky.com/story/charges-against-donald-trump-in-georgia-election-interference-case-dismissed-13475789",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-donald-trump-air-force-one_7092064.jpg?20251126050835",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-26 16:04:00",
        "Headline": "It was unlikely the legal action, alleging widespread election interference by the US president, could have progressed while he was still in office, but others - including former New York mayor Rudy Giuliani - had faced charges.",
        "Content": "Charges against Donald Trump and others in an election interference case in the US state of Georgia have been dismissed. Pete Skandalakis, the prosecutor who recently took over the case, said in court papers on Wednesday that he has decided to take no further action. It was unlikely the legal action against the US president could have progressed while he was still in office, but the 14 others - including Mr Trump's personal lawyer, the former New York mayor Rudy Giuliani, and ex-White House chief of staff Mark Meadows - had still faced charges. After the charges were dismissed, Mr Trump posted on his Truth Social platform to say \"LAW and JUSTICE have prevailed in the Great State of Georgia\". He added: \"This case should have never been brought in the first place.\" The case was dismissed in full by Fulton County Superior Court judge Scott McAfee after Mr Skandalakis submitted his decision. Fulton County district attorney Fani Willis had alleged a wide-ranging conspiracy to illegally overturn Mr Trump's narrow loss to Democrat Joe Biden in the key swing state in the 2020 presidential election. Charges against Mr Trump centred around a phone call he made to Georgia's top election official, secretary of state Brad Raffensperger. According to recordings of the conversation, Mr Trump told his fellow Republican: \"I just want to find 11,780 votes.\" Mr Trump and 18 co-defendants were initially accused. Four of the accused made plea deals with prosecutors, while the others, including Mr Trump, Mr Giuliani and Mr Meadows, pleaded not guilty. Read more on Sky News:Man admits driving into football fansFire engulfs high-rise buildings An angry-looking Mr Trump was pictured as he was booked on the charges at the Fulton County Sheriff's Office, and copies of the mugshot generated sales of more than $7m (춲5.3m) in a matter of days, his campaign said. In a 22-page memo explaining his decision, Mr Skandalakis noted the entire case is \"without precedent\", and pointed in part to the challenges of trying a case against a sitting president. Mr Skandalakis wrote: \"In my professional opinion, the citizens of Georgia are not served by pursuing this case in full for another five to 10 years.\" He said he was ending the case \"to serve the interests of justice and promote judicial finality\" and his decision is \"not guided by a desire to advance an agenda but is based on my beliefs and understanding of the law\". Mr Trump's lawyer in the case, Steve Sadow, welcomed the end of what he called a \"political persecution\" of the US president. \"This case should never have been brought. A fair and impartial prosecutor has put an end to this lawfare,\" he said.  Ms Willis, who brought the case in August 2023, was disqualified from prosecuting it last December. An appeals court in the state capital, Atlanta, ruled that a romantic relationship she had with Nathan Wade, the special prosecutor she chose to lead the case, created \"a significant appearance of impropriety\". Defence lawyers claimed the district attorney profited from the case when Mr Wade used his earnings to pay for holidays the pair took. She appealed the verdict, but lost her case in September, despite Mr Wade having quit his role."
    },
    {
        "title": "Girl, 13, arrested after teenager shot dead in Los Angeles",
        "description": "A 13-year-old girl has been arrested following the fatal shooting a 16-year-old boy in Los Angeles County, California, police have said.",
        "url": "https://news.sky.com/story/girl-13-arrested-after-teenager-shot-dead-in-los-angeles-13475658",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-pomona-police-car_7092618.jpg?20251126141421",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-26 12:30:00",
        "Headline": "Police say the motive for crime is still unknown after officers were called to the incident in Pomona on Sunday afternoon.",
        "Content": "A 13-year-old girl has been arrested following the fatal shooting a 16-year-old boy in Los Angeles County, California, police have said. Officers responded on Sunday about 5pm to a report of a shooting in the city of Pomona. They found a teenage boy suffering from a gunshot wound. He was pronounced dead at the scene after firefighters arrived. A motive for the crime is as yet unknown, police said. Read more from Sky News:Taiwan's president sets date to prepare for combat with ChinaDefiant Maduro wields sword as he sends message to US Pomona Police Department said in a statement: \"Due to the nature of the incident, investigators from the Pomona Police Department's Major Crimes Unit responded to the scene and initiated an extensive investigation. \"During the course of their investigation, they identified a 13-year-old female as the possible perpetrator. She was taken into custody and transported to Juvenile Hall.\" The victim's and the suspect's identities have not been revealed."
    },
    {
        "title": "Trump's peace plan had Russian fingerprints all over it - and now we know why",
        "description": "If there was much surprise and confusion about the origins of a US-backed peace proposal for Ukraine that had Russian fingerprints all over it, there is less now.",
        "url": "https://news.sky.com/story/trumps-peace-plan-had-russian-fingerprints-all-over-it-and-now-we-know-why-13475506",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-witkoff-putin_7092063.jpg?20251126043945",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2025-11-26 04:31:00",
        "Headline": "There must be serious questions surrounding Steve Witkoff's engagement with the Russians - and serious concerns around consequences that are potentially catastrophic, writes Sky's James Matthews.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n If there was much surprise and confusion about the origins of a US-backed peace proposal for Ukraine that had Russian fingerprints all over it, there is less now. To learn of US envoy Steve Witkoff and his Russian interactions is to understand the handbrake turn towards Moscow. The Bloomberg report of Witkoff's recent involvement distills eye-watering detail of his contact with Yuri Ushakov, Vladimir Putin's senior adviser on foreign policy. Among the revelations, it tells of the American advising the Russian on dealing with Trump. In a phone call last month, Witkoff told Ushakov that Zelenskyy was coming to visit the White House, and suggested Putin speak to Trump beforehand. Witkoff reportedly said: \"The president will give me a lot of space and discretion to get to the deal.\" He spoke of Trump's 20-point Gaza peace plan and suggested that \"maybe we do the same thing with you\". Read more:Who actually wrote Trump's peace plan?Steve Witkoff: Real estate mogul turned envoy  A good impression of a useful idiot Subsequently, Witkoff drafted the controversial peace proposal with his Russian counterparts, and the US pressured Ukraine to accept it. The report paints an unflattering picture of Trump's envoy doing a good impression of a useful idiot. There must be serious questions surrounding his engagement with the Russians and serious concerns around consequences that are potentially catastrophic. Moscow's threat to Ukraine and to the security infrastructure of Western Europe is strengthened on his handshake. He'll press the flesh in Russia once more - Donald Trump is sending Witkoff back to Moscow for further talks aimed at bridging the Ukraine-Russia impasse.  Scandal isn't what it used to be Putin has given the Americans little to no encouragement around their reworked plan and Kyiv will shudder at what Trump's \"Mr Fixit\" might fix next. They will despair of his continued involvement at any level and what it says about Trump's perspective and where his loyalties lie. In any other job, Witkoff might have been sacked for being irredeemably compromised. At any other time, this would have been viewed, universally, as a major scandal. But under Donald Trump, scandal isn't what it used to be.  The president and his point man continue to consort with Vladimir Putin. On the evidence of Steve Witkoff's interaction, the power dynamic leans less Trump than we might have thought."
    },
    {
        "title": "British man accused of trying to drown daughter-in-law on Florida holiday released after plea deal",
        "description": "A British man who was accused of trying to drown his daughter-in-law at a Florida swimming pool has been released, after agreeing to a plea deal.",
        "url": "https://news.sky.com/story/british-man-accused-of-trying-to-drown-daughter-in-law-on-florida-holiday-released-after-plea-deal-13475617",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-florida-mark-gibbon_6984481.jpg?20250807003824",
        "type": "US",
        "Author": "Dylan Donnelly",
        "Date Published": "2025-11-26 11:19:00",
        "Headline": "State prosecutors in Florida told Sky News the victim wanted Gibbon to return to the UK as she felt he had been \"punished enough\".",
        "Content": "\n          news reporter\n       A British man who was accused of trying to drown his daughter-in-law at a Florida swimming pool has been released, after agreeing to a plea deal. Mark Raymond Gibbon, of Beaconsfield, Buckinghamshire, was arrested in August after an incident where he was alleged to have repeatedly held the 33-year-old underwater after they had argued about his grandchildren. The 62-year-old was arrested and taken to a Florida jail, where he was charged with attempted second-degree murder and two counts of battery. The Polk County Sheriff's Department said at the time: \"Gibbon is accused of pushing and holding the victim's head underwater multiple times, preventing her from breathing. \"The victim's nine-year-old daughter jumped into the pool in an attempt to stop Gibbon from drowning her mother.\" However, according to documents from Polk County Court, seen by Sky News, the charges against him were revised in September. And in a statement to Sky News, the State Attorney's Office for the 10th Judicial Circuit, the prosecuting office in Polk County, said the victim wanted Gibbon to return to the UK as she felt he had been \"punished enough\". \"The defendant in this case was charged with battery for repeatedly dunking the victim's head below water in a swimming pool during an argument,\" the office said. \"The victim was consulted regarding the resolution of this case. The victim informed our office that she felt the defendant had been punished enough and she desired that he be allowed to return to England and have contact with her and her daughter. \"She had no fear of him. The defendant completed an anger management course and was adjudicated guilty of battery.\" Documents showed charge downgraded A second booking sheet from the sheriff's office, dated 5 September, said Gibbon was charged with two counts of battery and one count of battery by strangulation. In Florida, battery is a misdemeanour offence, punishable by jail sentences of up to one year and fines up to $1,000 (춲761). Meanwhile, battery by strangulation is a second-degree felony, with sentences ranging from imprisonment up to 15 years, as well as a potential fine of up to $10,000 (춲7,610). Other documents - both bond receipts paid to the sheriff's office - show Gibbon paid $25,000 (춲19,026) and $1,000 to secure his temporary release during proceedings on 3 September. Read more from Sky News:OBR apologises after early release of budgetTourist tax to be introduced across England Sheriff Grady Judd said in August that the family were staying at a rental home in the Solterra Resort of Davenport, Florida, when the incident occurred. A memo from the court, dated 7 November, shows that a deal was agreed with Gibbon for sentencing on two counts of battery - removing the strangulation charge. That document said the court directed that his \"passport (is) to be released to defendant\". A felony plea from from the same day showed that Gibbon agreed and signed to plead guilty to the two charges \"pursuant to a plea agreement\" of time served and to pay costs totalling $1,308.68 (춲996)."
    },
    {
        "title": "Venezuela: Maduro brandishes sword and vows to defy any US attempt to overthrow his government ",
        "description": "Venezuelan President Nicolas Maduro has vowed to defy any US attempt to overthrow his government - telling crowds that \"failure is not an option\".",
        "url": "https://news.sky.com/story/venezuela-maduro-brandishes-sword-and-vows-to-defy-any-us-attempt-to-overthrow-his-government-13475505",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-venezuela-maduro_7092061.jpg?20251126041600",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-26 04:11:00",
        "Headline": "Donald Trump, like his predecessor Joe Biden, does not recognise Nicolas Maduro as the country's leader. He is currently on his third term after being declared the winner of last year's presidential election, despite evidence that the opposition defeated him by a 2-to-1 margin.",
        "Content": "Venezuelan President Nicolas Maduro has vowed to defy any US attempt to overthrow his government - telling crowds that \"failure is not an option\". The 63-year-old brandished a sword as he addressed supporters during a march in Caracas, against a backdrop of growing tensions with Donald Trump's administration. Dressed in camouflage fatigues, Mr Maduro said: \"We must be ready to defend every inch of this blessed land from imperialist threat or aggression, no matter where it comes from.\" Since September, US military forces have been conducting a series of strikes against vessels suspected of drug trafficking in international waters, killing at least 80 people. Washington has claimed that several of these boats had departed from Venezuela, with Mr Maduro describing the deployment as an assault on the nation's sovereignty. 'Stop this madness' Yesterday, Cuba also accused the US of seeking a violent overthrow of Mr Maduro's government - and called its military presence in the region \"exaggerated and aggressive\". The country's foreign minister, Bruno Rodriguez, said ousting Venezuela's leader would be extremely dangerous and irresponsible, not to mention a violation of international law. He added: \"We appeal to the people of the United States to stop this madness. The US government could cause an incalculable number of deaths and create a scenario of violence and instability in the hemisphere that would be unimaginable.\"  Reports suggest the US is planning to launch a new phase of Venezuela-related operations in the coming days. Critics have questioned the legality of America's campaign and argue it amounts to extrajudicial killings, with a recent poll suggesting just 29% of voters support this policy. Officials within Maduro's government have claimed that Washington's actions are being driven by economic motives. Venezuelan minister Delcy Rodriguez said: \"They want Venezuela's oil and gas reserves. For nothing, without paying. They want Venezuela's gold. \"They want Venezuela's diamonds, iron, bauxite. They want Venezuela's natural resources.\" Donald Trump, like his predecessor Joe Biden, does not recognise Mr Maduro as the country's leader. He is currently on his third term after being declared the winner of last year's presidential election, despite evidence that the opposition defeated him by a two-to-one margin. Mr Maduro and senior officials have been repeatedly accused of human rights violations against real and perceived government opponents. Earlier this week, the US designated Venezuela's Cartel de los Soles - Cartel of the Suns in English - as a foreign terrorist organisation for importing illegal drugs to the States.  The Trump administration has claimed that Maduro is part of this group, but Venezuelan officials have described its mere existence as a \"ridiculous fabrication\". Speaking to reporters on Air Force One as he travelled to Florida for Thanksgiving, the president suggested he might be planning to talk to Mr Maduro. \"If we can save lives, if we can do things the easy way, that's fine,\" the US president said. \"And if we have to do it the hard way, then that's fine too.\" Read more world news:Russia 'making concessions', Trump saysFour more arrests over Louvre heistBrazil's Bolsonaro begins 27-year jail term  Carlos Diaz Rosillo, a former US deputy assistant secretary of defence during the first Trump administration, does not believe America will go to war with Venezuela. He told The World With Dominic Waghorn: \"What I do see is a strategy of maximum pressure on the regime. I do think if there's any change, that change has to come from within the military.\" Dr Rosillo said the official position of the US government is not regime change, but Mr Trump would like to see that happen in Venezuela."
    },
    {
        "title": "OpenAI denies allegations ChatGPT is responsible for teenager's death",
        "description": "OpenAI has said a teenager who died after months of conversations with ChatGPT misused the chatbot and the company it is not liable for his death.",
        "url": "https://news.sky.com/story/openai-denies-allegations-chatgpt-is-responsible-for-teenagers-death-13475591",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-openai-logo_7051339.jpg?20251015090351",
        "type": "US",
        "Author": "Mickey Carroll",
        "Date Published": "2025-11-26 10:19:00",
        "Headline": "In a blog post on OpenAI's website, the company said its goal \"is to handle mental health-related court cases with care, transparency, and respect\".",
        "Content": "\n          Science and technology reporter\n       OpenAI has said a teenager who died after months of conversations with ChatGPT misused the chatbot and the company it is not liable for his death. Warning: This article contains references to suicide that some readers may find distressing Adam Raine died in April this year, prompting his parents to sue OpenAI in the company's first wrongful death lawsuit. The 16-year-old initially used ChatGPT to help him with schoolwork, but it quickly \"became Adam's closest confidant, leading him to open up about his anxiety and mental distress\", according to the original legal filing. The bot gave the teenager detailed information on how to hide evidence of a failed suicide attempt and validated his suicidal thoughts, according to his parents.  They accused Sam Altman, OpenAI's chief executive, of prioritising profits over user safety after GPT-4o, an older version of the chatbot, discouraged Adam from seeking mental health help, offered to write him a suicide note and advised him on how to commit suicide. In its legal response seen by Sky's US partner network NBC News, OpenAI argued: \"To the extent that any 'cause' can be attributed to this tragic event, plaintiffs' alleged injuries and harm were caused or contributed to, directly and proximately, in whole or in part, by Adam Raine's misuse, unauthorized use, unintended use, unforeseeable use, and/or improper use of ChatGPT.\" According to the AI company, Adam shouldn't have been using ChatGPT without consent from a parent or guardian, shouldn't have been using ChatGPT for \"suicide\" or \"self-harm\", and shouldn't have bypassed any of ChatGPT's protective measures or safety mitigations. In a blog post on OpenAI's website, the company said its goal \"is to handle mental health-related court cases with care, transparency, and respect\". It said its response to the Raine family's lawsuit included \"difficult facts about Adam's mental health and life circumstances\". \"Our deepest sympathies are with the Raine family for their unimaginable loss,\" the post said. Jay Edelson, the Raine family's lead counsel, told Sky News that OpenAI's response \"shows that they're flailing\". He wrote: \"ChatGPT 4o was deliberately designed to relentlessly engage, encourage, and validate its users - including people in mental health crises, for whom OpenAI specifically lowered the guardrails with the launch of 4o. \"Sam Altman, well before we filed suit, told the world that he knew those decisions had caused people-especially young people-to share the most intimate details of their lives with ChatGPT, using it as a therapist or a life coach. \"OpenAI knows that the sycophantic version of its chatbot encouraged users to commit suicide or egged them on to harm third parties. \"OpenAI's response to that? The company is off the hook because it buried something in the terms and conditions. If that's what OpenAI is planning to argue before a jury, it just shows that they're flailing.\" Read more: More than 1.2m people a week talk to ChatGPT about suicideThere's a new Bobbi on the beat - and they're powered by AI Since the Raine family began their lawsuit, seven more lawsuits have been lodged against Mr Altman and OpenAI, alleging wrongful death, assisted suicide, involuntary manslaughter, and a variety of product liability, consumer protection, and negligence claims. OpenAI appeared to reference these cases in its blog post, saying it is reviewing \"new legal filings\" to \"carefully understand the details\". Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Budget 2025: The town where voters placed trust in Labour - and some now feel betrayed",
        "description": "Hitchin in Hertfordshire does well in the polls.",
        "url": "https://news.sky.com/story/budget-2025-the-town-where-voters-placed-trust-in-labour-and-some-now-feel-betrayed-13475763",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-hitchen-budget_7092927.png?20251126205632",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-11-26 15:07:00",
        "Headline": "Sky's Paul Kelso visits one of the country's happiest towns to see if taxpayers are still smiling after a switch to Labour and another tax-raising budget.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Hitchin in Hertfordshire does well in the polls. On the edge of the Chilterns and 30 minutes from central London by train, it's Britain's most expensive market town for first-time buyers. It's also been voted one of the top 10 best, and top 20 happiest, places to live in the country. Last summer Labour did well in the polls here too. Hitchin's 35,000 inhabitants, with above average earnings, levels of employment, and higher education, ejected the Conservatives for the first time in more than 50 years. Money latest: What the budget means for your money  Having swept into affluent southern constituencies, Rachel Reeves is now asking them to help pay for her plans via a combination of increased taxes on earnings and savings. While her first budget made business bear the brunt of tax rises, the higher earners of Hitchin, and those aspiring to join them, are unapologetically in the sights of the second. 游녤 Listen to Sky News Daily on your podcast app 游녣  Kai Walker, 27, runs Vantage Plumbing & Heating, a growing business employing seven engineers, all earning north of 춲45,000, with ambition to expand further. He's disappointed that the VAT threshold was not reduced - \"it makes us 20% less competitive than smaller players\" - and does not love the prospect of his fiancee paying per-mile to use her EV. But it's the freeze on income tax thresholds that will hit him and his employees hardest, inevitably dragging some into the 40% bracket, and taking more from those already there. \"It seems like the same thing year on end,\" he says. \"Work harder, pay more tax, the thresholds have been frozen again until 2031, so it's just a case where we see less of our money. Tax the rich has been a thing for a while or, you know, but I still don't think that it's fair. \"I think with a lot of us working class, it's just a case of dealing with the cost. Obviously, we hope for change and lower taxes and stuff, but ultimately it's a case of we do what we're told.\"  Reeves's central pitch is that taxes need to rise to reset the public finances, support the NHS, and fund welfare increases she had promised to cut. In Hitchin's Market Square it has been heard, but it is strikingly hard to find people who think this budget was for them.  Jamie and Adele Hughes both work, had their first child three weeks ago, and are unconvinced. \"We're going to be paying more, while other people are going to be getting more money and they're not going to be working. I don't think it's fair,\" says Adele. Jamie adds: \"If you're from a generation where you're trying to do well for yourself, trying to do things which were once possible for everybody, which are not possible for everybody now, like buying a house, starting a family like we just have, it's extremely difficult,\" says Jamie. Liz Felstead, managing director of recruitment company Essential Results, fears the increase in the minimum wage will hit young people's prospects hard. \"It's disincentivising employers to hire younger people. If you have a choice between someone with five years experience or someone with none, and it's only 춲2,000 difference, you are going to choose the experience.\" Read more:Budget takes UK into uncharted territory to allow spending spreeMain budget announcements at a glanceReeves reveals 춲26bn of tax risesCash ISA limit slashed - but some are exempt After five years, the cost of living crisis has not entirely passed Hitchin by. In the market Kim's World of Toys sells immaculately reconditioned and repackaged toys at a fraction of the price. Demand belies Hitchin's reputation. \"The way that it was received was a surprise to us I think, particularly because it's a predominantly affluent area,\" says Kim. \"We weren't sure whether that would work but actually the opposite was true. Some of the affluent people are struggling as well as those on lower incomes.\" Customer Joanne Levy, shopping for grandchildren, urges more compassion for those who will benefit from Reeves's spending plans: \"The elderly, they're struggling, bless them, the sick, people with young children, they are all struggling, even if they're working they are struggling.\""
    },
    {
        "title": "Budget 2025: Are you a winner or loser? ",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>游녤 Listen to Sky News Daily on your podcast app 游녣</a>        ",
        "url": "https://news.sky.com/story/budget-2025-are-you-a-winner-or-loser-13475712",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-budget-daily-podcast_7092572.jpg?20251126133955",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-26 13:38:00",
        "Headline": "No subtitle found",
        "Content": "游녤 Listen to Sky News Daily on your podcast app 游녣  Will you be better or worse off than you were before Chancellor Rachel Reeves announced her tax and spending plans in her long-awaited budget?  From the minimum wage and scrapping of the two-child benefit cap to ISA caps and tax threshold freezes, Niall looks at how the budget will impact you with personal finance expert Iona Bain. Producers: Tom Gillespie and Araminta ParkerEditor: Wendy Parker"
    },
    {
        "title": "Budget was historic in at least two respects - as Britain taken into uncharted territory",
        "description": "In at least two respects - one expected, the other not - this was a historic budget.",
        "url": "https://news.sky.com/story/budget-takes-uk-into-uncharted-territory-to-allow-spending-spree-13475765",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-conway-budget_7092683.png?20251126151524",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-11-26 15:16:00",
        "Headline": "Sky's Ed Conway writes that while the dust is yet to settle on an extraordinary budget process, it is already clear that Rachel Reeves is imposing a record burden on voters to fund her spending plans.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  In at least two respects - one expected, the other not - this was a historic budget. The bit no one expected came just before midday. Normally on budget day, the documents containing all the measures and the official forecasts from the Office for Budget Responsibility (OBR) are published online when the chancellor has finished her speech. The minute she sits down in the House of Commons, traders, journalists and economists around the country start frantically refreshing their browsers, hoping for first sight of this critical document. It's critical because often there is a striking gap between what the chancellor says in her speech and the details inside the document. Money latest: What the budget means for your money Take, for instance, one of the chief money-raising measures in this year's budget: the decision to limit the amount of money people can put into salary sacrifice schemes - something that affects most private sector pensions. To judge from the chancellor's speech alone, you might have thought this was a somewhat minor move designed to close a loophole used mostly by wealthy people. But the document shows that, on the contrary, this is a massive tax-raising measure that will bring in a whopping 춲4.7bn the first year it's properly instituted. \n                  Budget 2025: Reeves to face further questions after being accused of broken promises\n                 \n                  Budget 2025: The same old Labour? Why party's credibility might not be recoverable\n                 \n                  Budget 2025: Chancellor spared wrath of bond vigilantes - for now\n                 That is a lot of money - a lot. And whenever the government raises those kinds of sums it invariably means a lot of people will end up paying quite a bit more money in tax. So you see the point: it's only when you get the final document that you can see the grisly details in black and white. And those details are more than academic. The contours of the numbers contained in the OBR's Economic and Fiscal Outlook (EFO) - to give it its proper name - are enormously market-sensitive. They are sometimes the evidence base upon which gilt traders decide whether or not to invest in UK securities.  All of which helps explain why, when the OBR accidentally published its EFO online, nearly an hour before the chancellor stood up to deliver her speech, it caused an extraordinary flurry in markets. The cost of government debt yo-yoed dramatically as investors hurriedly downloaded the documents and tried to work out what this budget meant for the UK economy. 游녤Listen to Politics at Sam and Anne's on your podcast app游녣 This was the biggest budget leak in history and doubtless we will hear more in the coming weeks about how it happened and about the consequences. But, as I said at the start, it was not the only historic thing about this budget. Because it also commits the government to a set of economic policies that take Britain into uncharted territory. The total level of taxation in the UK was already high before this budget - indeed, it was already heading up to the highest level in at least 70 years (actually it's really the highest level ever - it's just that the numbers only go back to the 1940s). But this budget supercharges the rise.  As a result of the policies contained in it, as well as the ones in last year's budget, this parliament is, according to the Institute for Fiscal Studies, heading towards being the biggest tax-raising Parliament in modern history (the numbers in this case only go back to 1970). Those higher taxes were, the chancellor judged, necessary for two reasons. First, they help her meet her fiscal rules, which in turn means investors begin to charge Britain less to borrow. And the early signs on this were promising: the yield on UK government debt dropped in the hours after that initial OBR-fuelled roller-coaster. Second, they give her enough money to finance extra spending, much of which is going into extra welfare, in part to fund the abolition of the two child benefit cap. In short, this government is taxing more to spend more. Read more:Main budget announcements at a glanceReeves reveals 춲26bn of tax risesCash ISA limit slashed - but some are exempt That raises at least two questions. First, how successful will it actually be in raising those taxes? After all, Britain has never been as highly taxed as it will be at the end of this decade. Will Britons be content to become a high tax economy - like many of our European neighbours - or is the government being too sanguine about what this will mean for growth and, more to the point, its coffers. Second, having spent much of its first 18 months trying and failing to control welfare spending - forced along the way into U-turns over its plans - can it really be depended on to keep to its expenditure plans off into the future? The short answer is: no-one really knows. But now that the flurry of excitement over that historic leak is over, this big budget will be thoroughly scrutinised and thoroughly tested in the coming weeks and months."
    },
    {
        "title": "Budget 2025: The key points at a glance",
        "description": "Chancellor Rachel Reeves has unveiled the long-anticipated budget.",
        "url": "https://news.sky.com/story/budget-2025-the-key-points-at-a-glance-13475533",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-budget-starmer-reeves_7064026.jpg?20251027163107",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire, business and economics reporter and Lauren Russell, news reporter",
        "Date Published": "2025-11-26 07:16:00",
        "Headline": "Here are the key points announced in Rachel Reeves's budget, from tax rises to the scrapping of the two-child benefit cap.",
        "Content": "By Sarah Taaffe-Maguire, business and economics reporter and Lauren Russell, news reporter    Chancellor Rachel Reeves has unveiled the long-anticipated budget. It comes after a report from the Office for Budget Responsibility (OBR), which analyses policies decided on by the chancellor, was published early in error. Here are the key points: Tax thresholds will be frozen for an additional three years from 2028 The point at which people start paying higher rates of tax will be held. It can mean earners will be dragged into higher tax bands when they get a pay rise. This will raise 춲8bn. Taxes hiked on gambling The gambling industry is going to be taxed more, to raise more than 춲1bn. Remote gaming duty will rise to 40% from 21% while online betting tax will rise from 15% to 25%. The bingo tax is being abolished from April. New mileage tax on electric cars Electric car drivers will be subject to a 3p charge for every mile they drive from April 2028. Plug-in hybrid vehicles will be charged 1.5p per-mile. This is expected to raise 춲1.4bn, according to the OBR report. Change to capital gains tax for employee ownership trusts Capital gains tax relief on business sales made to employee ownership trusts will be reduced from 100% to 50%. This is expected to raise 춲900m. Other tax hikes The tax paid on dividends - payments to shareholders - as well as property and savings income will rise 2 percentage points, raising 춲2.1bn. Two-child benefit cap scrapped The government will scrap the two-child benefit cap from April 2026. This currently limits the amount of benefits parents can claim for their third child or subsequent children who were born after 6 April 2017. By scrapping the cap, the government hopes an estimated 450,000 children will be lifted out of poverty. According to the OBR's analysis of the chancellor's budget this will cost the government 춲2.3bn. Salary-sacrifice pension contributions above 춲2,000 to face national insurance From April 2029, national insurance will be charged on salary-sacrificed pension contributions above an annual 춲2,000 threshold. This will raise 춲4.7bn and will come into effect in 2029. State pension increases There'll be an increase of 춲440 per year for the basic state pension and an increase of 춲575 per year for the new state pension. Reforms for cash ISAs Savers will only be able to put up to 춲12,000 into cash ISAs tax-free each year. This is reduced from 춲20,000 in the hopes that Britons will instead invest their money in stocks and shares ISAs. Over 65s can retain the full 춲20,000 allowance.  Fuel duty to be frozen until next September The duty, or tax, paid on diesel and petrol has been frozen at 52.95p per litre. This will cost the government 춲2.4bn next year and 춲900m each year after. Mansion tax introduced on properties worth more than 춲2m It means the most expensive properties in the country, worth more than 춲2m, will have to pay extra. This will be 춲2,500 for properties worth 춲2m to 춲2.5m and up to 춲7,500 for homes valued at 춲5m. This will raise 춲400m, the OBR has confirmed. Cut in energy bills The average annual energy bill will be cut by 춲150 from April by reducing levies. The Energy Company Obligation (ECO) scheme, which is designed to tackle fuel poverty and help reduce carbon emissions, will be scrapped. Luxury cars removed from the Motability scheme This scheme, which provides subsidies for people with a disability to lease a vehicle, is part of PIP. Freeze on student loan repayment rate The student loan repayment threshold will be maintained for three years. Training for apprentices under-25 free at small companies A new Youth Guarantee will give 춲820m towards efforts to guarantee every young person a place in college, an apprenticeship or personalised job support. After 18 months, 18-to-21 year-olds will be offered paid work instead of benefits. Books for school libraries  A total of 춲5m will be given to secondary schools for them to buy more books for their libraries. Wider inheritance tax rules A change to inheritance tax will allow the transfer of 100% relief allowance between spouses. Uber and Bolt journeys to be taxed Ride-hailing apps including Uber and Bolt will have to pay the full 20% rate of VAT, in a measure being described as a taxi tax. It is predicted to raise 춲700m a year. Currently, ride-hailing apps are only charged on the profit they take and not the fare itself. Rail fares frozen Rail fares will be frozen for the first time in 30 years, with passengers not paying any more for season tickets, peak return and off-peak return tickets between major cities. DLR extension  Although not in the chancellor's speech, the budget confirmed the Docklands Light Railway (DLR) will be extended to Thamesmead in southeast London. Business rate changes  Business rates will be reduced for 750,000 retail, hospitality and leisure properties, which will be funded by an increase on premises worth more than 춲500,000. The tax reduction will be paid for by an increase in taxes on properties worth 춲500,000 or more, like the warehouses used by online giants such as Amazon. Stamp duty break for companies new to London Stock Exchange A stamp duty holiday for companies newly listing on the London Stock Exchange will be in place for three years. OBR forecast Next year, economic growth is expected to be lower than the OBR thought in March. GDP will be 1.4% in 2026, down from a previously anticipated 1.9%. It will be 1.5% for the rest of the decade. According to the independent forecasters, prices are expected to rise faster than the OBR thought in March due to higher wages and food costs. Inflation will be 3.5% this year and 2.5% next. The amount of fiscal headroom the chancellor has doubled to 춲22bn in 2029-30. This means a 춲22bn financial cushion against price shocks such as the COVID-19 pandemic and soaring energy costs. NHS technology and new neighbourhood health centres The government will invest 춲300m in NHS technology and 250 new neighbourhood health centres with the aim of expanding more services into communities. Over 100 centres, including in Birmingham, Truro and Southall, are expected to be delivered by 2030. Prescription costs frozen The cost of an NHS prescription in England will be frozen at 춲9.90. 2.6% of GDP to be spent on defence The government will spend 2.6% of GDP, a measure of everything produced in the economy, on defence. National wage increases From next April, the national living wage will rise by 4.1% to 춲12.71 an hour for eligible workers aged 21 and over. The national minimum wage rate for 18 to 20-year-olds will increase by 8.5% to 춲10.85 an hour. For 16 to 17-year-olds and those on apprenticeships, the national minimum wage will increase by 6% to 춲8 an hour. Nations and local mayors The government of Northern Ireland will get an additional 춲317m, 춲505m for the Welsh government and 춲820m for the Scottish government. \"Flexible\" funding worth 춲13bn has been pledged for seven regional mayors to invest in skills, business support and infrastructure."
    },
    {
        "title": "Third of people affected by 'loan charge' could have debts wiped away",
        "description": "Almost a third of people affected by the \"loan charge\" could have their debts wiped away as the government attempts to draw a line under a tax scandal that has been linked to multiple suicides.",
        "url": "https://news.sky.com/story/third-of-people-affected-by-loan-charge-could-have-depts-wiped-away-13475755",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-westminster-loan-charge_6461336.jpg?20251126165654",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-11-26 15:01:00",
        "Headline": "In a report published alongside the budget, the government said it would go beyond the recommendations outlined in an independent report. As a result, most people will see their bills cut in half, at a cost of hundreds of millions to the public purse. ",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Almost a third of people affected by the \"loan charge\" could have their debts wiped away as the government attempts to draw a line under a tax scandal that has been linked to multiple suicides. In a report published alongside the budget, the government said it would go beyond the recommendations outlined in an independent report, which was also published today. As a result, most people will see their bills cut in half, at a cost of 춲365m over the next five years to the public purse. Labour promised a review into the controversial tax policy, which was implemented by the Conservatives in 2019, to try to recover tax revenue from individuals whose employers did not pay it. Money latest: What the budget means for your money  Many of those affected were agency workers - cleaners or care workers - who were paid via umbrella companies, a poorly regulated industry rife with tax-avoidance schemes. Others were contractors who engaged umbrellas because it was less complicated than setting up as a limited company. In his 2016 budget, then chancellor, George Osborne, announced new legislation to try and recover the missing revenue, not from the umbrella companies but from the individuals. \n                  Budget 2025: Reeves to face further questions after being accused of broken promises\n                 \n                  Budget 2025: The same old Labour? Why party's credibility might not be recoverable\n                 \n                  Budget 2025: Chancellor spared wrath of bond vigilantes - for now\n                 Campaigners have long described the policy as grossly unfair, arguing that it attacks victims of mis-selling. Link to at least 10 suicides The policy has caused widespread financial despair and has been linked to 10 suicides. HMRC was made aware of a possible 11th suicide as the report was being finalised. The review, which was led by former HM Revenue & Customs inspector Ray McCann, recommended reducing liabilities by removing late payment interest penalties (thought to be worth about 25% of all liabilities). The original policy looked at all the money earned over several years and made it taxable in one year, meaning individuals saw larger chunks of their income fall into higher tax bands. The review suggested unstacking those years. It will also reduce the income under consideration by 10% each year to take into account the fees that the scheme operators deducted. That will be tapered to 5% above 춲50,000 and stop altogether after 춲150,000. The government accepted the findings, which will be made law through a finance bill. It will go beyond that by wiping 춲5,000 off each bill. It means lower earners will benefit disproportionately, with some seeing their bills entirely wiped away, but those with the highest debt burdens could still be facing six-figure bills. The Treasury said the total package would cost the public purse 춲365m over the next five years, but the Office for Budget Responsibility said it was still highly uncertain that all the money would be collected, with many of those affected now approaching or having retired. Calls for widening the scope The review was aimed at supporting people to reach a settlement, but it did not challenge the fundamental fairness of the policy. Campaigners repeatedly called for the scope to be widened, so that it examined the role of scheme developers, umbrella companies, recruitment agencies, accountants and tax advisers. They also called for the tax office to give individuals the same treatment as large corporations after it emerged that HMRC settled at just 15% with some large banks that used similar tax avoidance arrangements. Steve Packham, from the Loan Charge Action Group, said today: \"The McCann Review has only reviewed settlement terms of those facing the Loan Charge and as expected has therefore recommended some concessions. \"This is wholly different from a genuine review of the Loan Charge Scandal and being conducted by a former Assistant Director of HMRC, was clearly not independent. \"The concessions being offered are nowhere near the settlement deals offered to the big banks for use of similar arrangements. \"How can it be fair to give multi-billion-pound banks settlements of 10-15% whilst still demanding several times that from victims of mis-selling?\" Estimates vary, but around 70,000 people are thought to have been affected by the loan charge, with 25,000 having settled. The government will not be reviewing the cases it has already closed. \"The review also excludes those who were pushed to settle under duress from HMRC, which means they will have ended up paying more than those who didn't, which is grossly unfair,\" Mr Packham said. What was the loan charge? The \"loan charge\" was introduced in 2019 in an attempt to recover tax revenue that had been lost through disguised remuneration schemes. Many of these schemes paid workers through loans that were never intended to be paid back to try to circumvent income tax and national insurance. They started proliferating across the economy at the turn of the century, when the Labour government introduced new rules, known as IR35, that made it more difficult for contractors to operate as limited companies. While some of those who engaged in loan schemes entered into them with the explicit intent to minimise their tax bills, a large number were simply trying to do the right thing. Many contractors were advised by accountants to avoid setting up limited companies and to sign up to umbrella companies instead. These would manage their payments and limit the risk of falling foul of IR35 rules. However, the umbrella market was poorly regulated and a wild west of rogue operators, many of whom were, in fact, offshore tax avoidance schemes. Agency workers, including nurses, cleaners and council workers, were also affected. In many cases, they were told by recruitment agencies that they would be paid by an umbrella company, and some were given no other option. The NHS, local authorities and other public sector organisations all engaged workers who were part of these schemes. Back in 2021, HMRC even admitted that it had at least 15 contractors on its own books who were part of \"disguised remuneration schemes\" between 2016 and 2020. Sky News spoke to workers who saw deductions on their payslips that they presumed were tax deductions, but these were fees pocketed by the promoters. HMRC and the Treasury slowly became alert to the scale of the missing tax revenue and sought to recoup it, not from the companies but from the individuals. These schemes were deemed to be disguised remuneration and, in his 2016 budget, former chancellor George Osborne brought in the Loan Charge. The law was passed by parliament and made individuals liable for the tax that the employers should have paid. The schemes took different forms, but in many of the cases, the umbrella company would have been the legal employer of the workers. Read more:Accountants paid to place clients into tax avoidance schemesRise in suicide attempts linked to HMRC crackdownHMRC accused of 'dangerous' new tactics in tax crackdown It is a campaign that has driven people to the brink of bankruptcy, devastated families and has been linked to 10, possibly 11, suicides. Another 14 people have attempted to take their own lives. Labour promised a new independent review of the loan charge before the general election last year. A previous report by Lord Amyas Morse in 2019 was criticised for involving officials from the Treasury and HMRC, organisations that were architects of the loan charge. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. Alternatively, you can call Mind's support line on 0300 102 1234, or NHS on 111."
    },
    {
        "title": "Salary-sacrifice pension contributions over 춲2k to face national insurance charge",
        "description": "Rachel Reeves has announced that salary-sacrificed pension contributions above an annual figure of &#163;2,000 are to be subject to national insurance charges.",
        "url": "https://news.sky.com/story/rachel-reeves-announces-1632000-salary-sacrifice-cap-in-budget-13475766",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-budget-rachel-reeves_7092775.jpg?20251126171701",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-26 15:17:00",
        "Headline": "The chancellor said the move was a \"pragmatic step\" that would protect those on low and middle incomes.",
        "Content": " Rachel Reeves has announced that salary-sacrificed pension contributions above an annual figure of 춲2,000 are to be subject to national insurance charges. The move, which comes into effect in April 2029, is expected to raise more than 춲4bn in that financial year. Budget latest: Income tax thresholds frozen and two-child benefit cap scrapped The chancellor said the move was a \"pragmatic step\" that would protect those on low and middle incomes. Salary sacrifice schemes for pensions are an arrangement by which employees can chose to give up a portion of their salary in exchange for their employer paying an equivalent amount into their pension. The part of the salary that is given up is currently not subject to income tax or national insurance as it is taken out of a worker's gross salary before the taxes are calculated. The schemes also benefit employers, who do not have to pay national insurance on the amount sacrificed by the employee. \n                  Budget 2025: Reeves to face further questions after being accused of broken promises\n                 \n                  Budget 2025: The same old Labour? Why party's credibility might not be recoverable\n                 \n                  Budget 2025: Chancellor spared wrath of bond vigilantes - for now\n                 Some employers also choose to add this saving to their employee's pension. But under the new changes, contributions above 춲2,000 will be treated as ordinary employee pension contributions, and will therefore be subject to both employer and employee national insurance contributions. The chancellor told the Commons that salary sacrifice for pensions was due to \"treble in cost from 춲2.8bn in 2017 to 춲8bn by 2030\". She said the \"greatest benefit\" was going to \"higher earners or to those in the financial services sector putting their bonuses into pensions tax-free, while those on the minimum wage or whose employers don't offer salary sacrifice don't benefit at all\".  Ms Reeves said: \"This is not sustainable for the public finances, putting pressure on the tax everyone else pays, and so I am introducing a 춲2,000 cap on salary sacrifice into a pension with contributions above that taxed in the same way as other employee pension contributions.\" She added: \"That is a pragmatic step so that people, especially on low and middle incomes, can continue to use salary sacrifice for their pension without paying any more tax than they do now. And to give individuals and employers time to adjust to these new arrangements, these changes will come into effect in 2029.\" The changes were outlined in a document written by the Office for Budget Responsibility (OBR) and released in error ahead of Ms Reeves' speech. The document said: \"The policy results in an increase in NICs (national insurance contributions), which is estimated to raise 춲4.7bn in 2029/30 and 춲2.6bn in 2030/31. Read more:Budget 2025: The key points at a glanceWhy Labour MPs may like Reeves's budget \"The costing assumes that, in most cases, employee pension contributions above 춲2,000 that were part of a salary-sacrifice scheme will become subject to employer and employee NICs, either because they move to a standard pension scheme or continue in a salary-sacrifice scheme under the new tax arrangements.\" The Society of Pensions Professionals (SPP) said around a third of private sector employees use a salary-sacrifice arrangement, compared with almost 10% of public sector workers. It said that while there was a 춲4bn cost to the government in providing salary sacrifice arrangements - 춲1.2bn for employees and 춲2.9bn for employers - there was also \"widespread recognition that this is a positive investment that incentivises pension saving\". The SPP said the change would affect basic rate taxpayers more than higher rate taxpayers because the main rate of national insurance contributions is 8% for employees, but only 2% on incomes above 춲50,270. Steve Hitchiner, chair of the tax group at the SPP, said: \"Abolishing salary sacrifice for pensions will affect the take-home pay of millions of employees - especially basic rate taxpayers - and is a tax on working people, in spirit if not in name. It is also another sizeable cost to employers and, perhaps most importantly, its removal will reduce pension saving.\""
    },
    {
        "title": "Budget 2025: Chancellor spared wrath of bond vigilantes - for now",
        "description": "This was a budget that had to recapture the confidence of the people who lend national governments money.",
        "url": "https://news.sky.com/story/budget-2025-chancellor-spared-wrath-of-bond-vigilantes-for-now-13475797",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-cost-living-money-notes_6965895.png?20250716091142",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-11-26 16:27:00",
        "Headline": "Sky's James Sillars explains how Rachel Reeves's second budget appears to have convinced some doubters over the state of the public finances, but that much will depend on expectations being met in the months ahead.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n This was a budget that had to recapture the confidence of the people who lend national governments money. It doesn't sound like a priority. Most of us want to hear about the big picture for our taxes, but there are thousands of traders who deliver a verdict that can make or break a chancellor. Just ask Kwasi Kwarteng. Cast your mind back to 2022 and his mini-budget that saw government borrowing costs, and things like mortgages, spike sharply. That was essentially the result of a bond market revolt against the then-chancellor's growth plans that gave rise to the so-called bond vigilante. Such people protest loudly when they don't like what they hear. The message then was clear, and it cost the public purse an estimated 춲10bn. The full extent of the damage will have been far greater. Money latest: What the budget means for your money Rachel Reeves was never at risk of causing such a bond market backlash in this budget. After all, we knew all the main policy details in advance and she had clearly stated a key aim of bringing down the UK's debt costs. \n                  Budget 2025: Reeves to face further questions after being accused of broken promises\n                 \n                  Budget 2025: The same old Labour? Why party's credibility might not be recoverable\n                 \n                  OBR chief Richard Hughes refuses to rule out resignation after budget leak\n                 But given the scale of this tax-raising budget wasn't in her original plans, she was under intense pressure to convince investors, who she has needed to tap to fund her spending plans to date, that her stewardship of the Treasury was steady. A series of U-turns on cutting welfare and winter fuel payments, along with stickier-than-expected inflation, have been reflected in the interest rates - the yield - demanded by investors to hold UK government debt this year. It meant she had to find more money today to fill the void created by those policy decisions.  There have been some scary stats and numbers to get to grips with. Long-term government borrowing costs hit their highest level since 1998 at the end of the summer, leaving the UK with the highest levels facing any G7 nation. The cost of servicing our national debt over the current financial year is now estimated to total around 춲114bn - that's more than 8% of the contents of the chancellor's purse that can not go on the NHS, defence or education. So today's budget was a big deal for a market that has spent weeks, like the rest of us, following every leak and rumour.  It is the Office for Budget Responsibility's verdict that really counts. The watchdog's findings - accidentally released before the chancellor had even got the chance to open her mouth in parliament - prompted a see-saw for bond yields. But the good news for the chancellor was that those yields later settled lower - down by a couple of basis points for both long and short-dated bonds. It's a cautious welcome. The bond market would have liked the 'Reeves freeze' - the three-year extension of the Tory freeze on income tax thresholds. Crucially, the OBR declared that the government will have 춲21.7bn of headroom in five years' time - up from the 춲9.9bn sum seen previously and placed in harm's way by those U-turns on spending cuts.  The pound rose, by 0.3%, against both the dollar and euro to above $1.32 and 1.14. The UK stock market rallied too. Both the FTSE 100 (up by 0.85%) and FTSE 250 (by 1.2%) ended the day higher on the back of a global rally though some sectors outperformed in the wake of the budget. There was relief in bank stocks, for example, after the industry was spared an extra tax on profits. Gaming firms suffered - but not all - due to planned hikes in online gambling rates. Shares in William Hill owner Evoke were 18% lower while those for Entain were leading the gainers on the FTSE 100. Both companies later told the market they were expecting budget hits of up to 춲135m and 춲200m respectively, on an annual basis, with Evoke warning it had torn up its UK investment plans. Assuming no further U-turns, the outlook for UK borrowing costs will now depend on how quickly inflation can come down. A quarter of UK government bonds are tied to the RPI measure of inflation. It is currently running at 4.3%. It stood at 3.6% when Labour came to office. Unlike her first budget when the chancellor imposed a 춲25bn tax on employment, which many businesses passed on, this speech was careful to avoid inflationary consequences down the track. Read more:Budget takes UK into uncharted territory to allow spending spreeMain budget announcements at a glanceReeves reveals 춲26bn of tax risesCash ISA limit slashed - but some are exempt It should help lock in an interest rate cut by the Bank of England before Christmas. Laith Khalaf, head of investment analysis at AJ Bell, said of the bond market reaction: \"Early signs are yields are drifting down, but only a touch. \"Given what뗩 happened at previous budgets that뗩 actually a pretty good result, so at least one group of stakeholders is happy. \"Breakeven rates were not much changed, which suggests market expectations for inflation have not been hugely shifted by the budget. That may be because falling inflation was already in the price, or perhaps the bond market is still digesting the data.\" Either way, it seems this budget has passed its first big test but Rachel Reeves knows only too well that bond market vigilantes will descend quickly if the OBR's rosier than expected outlook for the UK economy fails to materialise in these uncertain times, and she fails to change course."
    },
    {
        "title": "How much is the mansion tax and who will have to pay it?",
        "description": "Rachel Reeves has announced a mansion tax on homes worth more than &#163;2 million.",
        "url": "https://news.sky.com/story/how-much-is-the-mansion-tax-and-who-will-have-to-pay-it-13475737",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-mansion-tax-house_7092666.jpg?20251126145832",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-26 14:27:00",
        "Headline": "The chancellor announced a mansion tax in the budget, saying it would solve a \"long-standing source of wealth inequality\".",
        "Content": "Rachel Reeves has announced a mansion tax on homes worth more than 춲2 million. The \"high value council tax surcharge\" will apply in England from 2028 and will raise 춲400m a year for the government, the chancellor said in Wednesday's budget. Homeowners will have to pay the annual charge on top of their council tax bill. Politics latest: Reeves freezes income tax thresholds and scraps two-child benefit cap The move was widely rumoured before the budget, but what is notable is another proposal expected to be announced was not. Ms Reeves was expected to introduce a re-evaluation of homes in the three highest council tax tiers (F, G and H), with a surcharge on them. She did not announce this, but instead said there will be four bands for the new mansion tax, with values based on 2026 prices. \n                  Budget 2025: Reeves to face further questions after being accused of broken promises\n                 \n                  Budget 2025: The same old Labour? Why party's credibility might not be recoverable\n                 \n                  Budget 2025: Chancellor spared wrath of bond vigilantes - for now\n                  The lowest band, for properties worth between 춲2m and 춲2.5m, will pay 춲2,500. The highest band, for homes worth 춲5m or more, will pay 춲7,500. Ms Reeves and the Office for Budget Responsibility (OBR) did not reveal the two middle bands and charges. But she said the surcharge would be uprated annually by the Consumer Price Index (CPI) inflation. The extra revenue will go straight to central government, not to local councils, as is the case for standard council tax. Ms Reeves said the charge would apply to fewer than 1% of all properties, and would help \"deal with a long-standing source of wealth inequality\". There will be a consultation on support for homeowners and a deferral scheme for those unable to pay immediately, taking into account homes bought decades ago that have soared in value. Read more:Main budget announcementsWill you be hit by Reeves's 'stealth tax'?Cash ISA limit slashed - but some are exempt  The OBR said it was highly uncertain about the 춲400m it predicted the tax would raise each year, and would adjust the forecast, if needed, after the consultation. Paul Johnson, former director of the Institute for Fiscal Studies, said the bands would create \"big spikes at specific valuations\". Rob Hillock, head of personal financial planning at financial services consultancy Broadstone, said: \"The chancellor's introduction of a 'mansion tax' on houses valued above 춲2m will likely prompt many homeowners to get an up-to-date valuation of their property wealth. \"It has the potential to create market distortions as homeowners look to reduce the value of their home to avoid additional tax or prompt some to downsize to smaller, cheaper homes. \"The OBR notes in its comments that the reform could see price bunching below each of the four new price bands as homeowners look to minimise their tax liability.\"  Mark Campbell, head of wealth at financial consultancy Isio, said the mansion tax makes a \"flawed assumption\" that those living in homes worth more than 춲2m have the liquid wealth or income to pay the tax. He said it risks penalising people who are asset-rich and cash-poor, especially in London and the southeast. He also warned the mansion tax risks sending a message that the UK is a less attractive place for investors, wealth creators and entrepreneurs."
    },
    {
        "title": "Candy Kittens owner to Graze on Unilever snack brand",
        "description": "The owner of Candy Kittens, the vegetarian sweet brand, is in talks about a cut-price deal to buy Graze, the snacks range owned by FTSE-100 consumer goods giant Unilever.",
        "url": "https://news.sky.com/story/candy-kittens-owner-to-graze-on-unilever-snack-brand-13475579",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-graze-bar_7092282.jpg?20251126101147",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-26 09:52:00",
        "Headline": "Katjes Group, a German confectioner, is in advanced negotiations to pay about 춲35m to buy Graze, little more than 20% of the price forked out by Unilever in 2019, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of Candy Kittens, the vegetarian sweet brand, is in talks about a cut-price deal to buy Graze, the snacks range owned by FTSE-100 consumer goods giant Unilever. Sky News has learnt that Katjes Group, which is headquartered in Germany, is in advanced talks to buy Graze for about 춲35m. The price represents a huge discount on the roughly 춲150m Unilever paid to buy the healthy snacks brand in 2019. Graze's products, which are sold in major supermarkets and also through subscriptions directly to consumers, include espresso-flavoured almonds and honeycomb oat bars. Founded in 2008, Graze was bought by Unilever after it saw off interest from competing bidders including Kellogg and Pepsico, the owner of Walkers Crisps. The brand has performed poorly under Unilever's ownership, however, prompting new chief executive Fernando Fernandez to put it up for sale earlier this year. Nevertheless, the sale price of about 춲35m is lower than market estimates suggested earlier this year. \n                  Budget 2025: Reeves to face further questions after being accused of broken promises\n                 \n                  Pensions, salaries, benefits, petrol and property | What the budget means for you\n                 \n                  Budget 2025: The town where voters placed trust in Labour - and some now feel betrayed\n                 Mr Fernandez has also initiated a sale process for prominent British food brands including Colman's, Bovril and Marmite, according to reports last week. The new Unilever boss is prioritising investments in faster-growing areas in consumer healthcare and beauty, snapping up the personal care brand Wild earlier this year. Read more from Sky News:Money blog - your budget wishesReeves vows to make 'fair and necessary choices'  A Unilever spokesman declined to comment."
    },
    {
        "title": "Budget 2025: The same old Labour? Why party's credibility might not be recoverable",
        "description": "Over and over again, in the run-up to the election and beyond, the prime minister and the chancellor told voters they would not put up taxes on working people - that their manifesto plans for government were fully costed and, with the tax burden at a 70-year high, they were not in the business of raising more taxes.",
        "url": "https://news.sky.com/story/rachel-reevess-budget-buys-keir-starmer-more-time-8211-but-labours-credibility-might-not-recover-13475870",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-beth-reeves_7092969.jpg?20251126212817",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-11-26 21:05:00",
        "Headline": "With more than 400 MPs, you might expect the PM and chancellor to take tough decisions. Instead, they find themselves just trying to survive.",
        "Content": "\n          Political editor\n              @BethRigby\n  Over and over again, in the run-up to the election and beyond, the prime minister and the chancellor told voters they would not put up taxes on working people - that their manifesto plans for government were fully costed and, with the tax burden at a 70-year high, they were not in the business of raising more taxes. On Wednesday the chancellor broke those pledges as she lifted taxes by another 춲26bn, adding to the 춲40bn rise in her first budget. She told working people a year ago she would not extend freezing tax thresholds - a Conservative policy - because it would \"hurt working people\". Budget latest: 'It can only lead to the death of us at the general election'   On Wednesday she ripped up that pledge, as she extended the threshold freeze for three years, dragging 800,000 workers into tax and another million into the higher tax band to raise 춲8.3bn. Rachel Reeves said it was a Labour budget and she's right. In the first 17 months of this government, Labour have raised tens of billions in taxes, while reversing on welfare reform - the U-turn on the winter fuel allowance and disability benefits has cost 춲6.6bn. Ms Reeves even lifted the two-child benefit cap on Wednesday, at a cost of 춲3bn, despite the prime minister making a point of not putting that pledge in the manifesto as part of the \"hard choices\" this government would make to try to bear down on the tax burden for ordinary people. The OBR predicts one in four people would be caught by the 40% higher rate of tax by the end of this parliament. Those higher taxes were necessary for two reasons and aimed at two audiences - the markets and the Labour Party. For the former, the tax rises help the chancellor meet her fiscal rules, which requires the day-to-day spending budget to be in a surplus by 2029-30. Before this budget, her headroom was just 춲9.9bn, which made her vulnerable to external shocks, rises in the cost of borrowing or lower tax takes. Now she has built her buffer to 춲22bn, which has pleased the markets and should mean investors begin to charge Britain less to borrow.  As for the latter, this was also the chancellor raising taxes to pay for spending and it pleased her backbenchers - when I saw some on the PM's team going into Downing Street in the early evening, they looked pretty pleased. I can see why: amid all the talk of leadership challenge, this was a budget that helped buy some time. \"This is a budget for self-preservation, not for the country,\" remarked one cabinet minister to me this week. You can see why: ducking welfare reform, lifting the two-child benefit cap - these are decisions a year-and-a-half into government that Downing Street has been forced into by a mutinous bunch of MPs. With a majority of 400 MPs, you might expect the PM and his chancellor to take the tough decisions and be on the front foot. Instead they find themselves just trying to survive, preserve their administration and try to lead from a defensive crouch. When I asked the chancellor about breaking manifesto promises to raise taxes on working people, she argued the pledge explicitly involved rates of income tax (despite her pledge not to extend the threshold freeze in the last budget because it \"hurt working people\"). Read more:Budget 2025: The key points at a glanceWhy Labour MPs may like Reeves's budget  Trying to argue it is not a technical breach - the Institute of Fiscal Studies disagreed - rather than taking it on and explaining those decisions to the country says a lot about the mindset of this administration. One of the main questions that struck me reflecting on this budget is accountability to the voters. Labour in opposition, and then in government, didn't tell anyone they might do this, and actually went further than that - explicitly saying they wouldn't. They were asked, again and again during the election, for tax honesty. The prime minister told me that he'd fund public spending through growth and had \"no plans\" to raise taxes on working people. Those people have been let down. Labour voters are predominantly middle earners and higher earning, educated middle classes - and it is these people who are the ones who will be hit by these tax rises that have been driven to pay for welfare spending rather than that much mooted black hole (tax receipts were much better than expected). This budget is also back-loaded - a spend-now-pay-later budget, as the IFS put it, with tax rises coming a year before the election. Perhaps Rachel Reeves is hoping again something might turn up - her downgraded growth forecasts suggests it won't. This budget does probably buy the prime minister and his chancellor more time. But as for credibility, that might not be recoverable. This administration was meant to change the country. Many will be looking at the tax rises and thinking it's the same old Labour."
    },
    {
        "title": "Budget 2025: What Rachel Reeves didn't say",
        "description": " <a href=' https://podfollow.com/politics-at-sam-and-annes'>游녤Listen to Politics at Sam and Anne's on your podcast app游녣</a>",
        "url": "https://news.sky.com/story/budget-2025-what-rachel-reeves-didnt-say-13475609",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-politics-sam-coates_7021320.jpg?20250915170446",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-26 10:56:00",
        "Headline": "No subtitle found",
        "Content": " 游녤Listen to Politics at Sam and Anne's on your podcast app游녣 Has the chancellor done enough to save the government after weeks of official and unofficial briefings of the \"most trailed budget in history\"? We knew Rachel Reeves was taking taxes to an all-time high before she was even on her feet in the Commons - thanks to the full budget being published by mistake on the Office for Budget Responsibility's website - but what else was announced, and what didn't she say?   Sam and Anne break down the budget and talk about:  The smorgasbord of tax rises - taking it to an all-time high  Britain's economic outlook and downgrading of growth  The opposition's response to \"the worst chancellor in history\"  A potential rebellion from her own MPs"
    },
    {
        "title": "Budget 2025: The key points at a glance",
        "description": "Chancellor Rachel Reeves has unveiled the long-anticipated budget.",
        "url": "https://news.sky.com/story/budget-2025-the-key-points-at-a-glance-13475533",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-budget-starmer-reeves_7064026.jpg?20251027163107",
        "type": "Politics",
        "Author": "Sarah Taaffe-Maguire, business and economics reporter and Lauren Russell, news reporter",
        "Date Published": "2025-11-26 07:16:00",
        "Headline": "Here are the key points announced in Rachel Reeves's budget, from tax rises to the scrapping of the two-child benefit cap.",
        "Content": "By Sarah Taaffe-Maguire, business and economics reporter and Lauren Russell, news reporter    Chancellor Rachel Reeves has unveiled the long-anticipated budget. It comes after a report from the Office for Budget Responsibility (OBR), which analyses policies decided on by the chancellor, was published early in error. Here are the key points: Tax thresholds will be frozen for an additional three years from 2028 The point at which people start paying higher rates of tax will be held. It can mean earners will be dragged into higher tax bands when they get a pay rise. This will raise 춲8bn. Taxes hiked on gambling The gambling industry is going to be taxed more, to raise more than 춲1bn. Remote gaming duty will rise to 40% from 21% while online betting tax will rise from 15% to 25%. The bingo tax is being abolished from April. New mileage tax on electric cars Electric car drivers will be subject to a 3p charge for every mile they drive from April 2028. Plug-in hybrid vehicles will be charged 1.5p per-mile. This is expected to raise 춲1.4bn, according to the OBR report. Change to capital gains tax for employee ownership trusts Capital gains tax relief on business sales made to employee ownership trusts will be reduced from 100% to 50%. This is expected to raise 춲900m. Other tax hikes The tax paid on dividends - payments to shareholders - as well as property and savings income will rise 2 percentage points, raising 춲2.1bn. Two-child benefit cap scrapped The government will scrap the two-child benefit cap from April 2026. This currently limits the amount of benefits parents can claim for their third child or subsequent children who were born after 6 April 2017. By scrapping the cap, the government hopes an estimated 450,000 children will be lifted out of poverty. According to the OBR's analysis of the chancellor's budget this will cost the government 춲2.3bn. Salary-sacrifice pension contributions above 춲2,000 to face national insurance From April 2029, national insurance will be charged on salary-sacrificed pension contributions above an annual 춲2,000 threshold. This will raise 춲4.7bn and will come into effect in 2029. State pension increases There'll be an increase of 춲440 per year for the basic state pension and an increase of 춲575 per year for the new state pension. Reforms for cash ISAs Savers will only be able to put up to 춲12,000 into cash ISAs tax-free each year. This is reduced from 춲20,000 in the hopes that Britons will instead invest their money in stocks and shares ISAs. Over 65s can retain the full 춲20,000 allowance.  Fuel duty to be frozen until next September The duty, or tax, paid on diesel and petrol has been frozen at 52.95p per litre. This will cost the government 춲2.4bn next year and 춲900m each year after. Mansion tax introduced on properties worth more than 춲2m It means the most expensive properties in the country, worth more than 춲2m, will have to pay extra. This will be 춲2,500 for properties worth 춲2m to 춲2.5m and up to 춲7,500 for homes valued at 춲5m. This will raise 춲400m, the OBR has confirmed. Cut in energy bills The average annual energy bill will be cut by 춲150 from April by reducing levies. The Energy Company Obligation (ECO) scheme, which is designed to tackle fuel poverty and help reduce carbon emissions, will be scrapped. Luxury cars removed from the Motability scheme This scheme, which provides subsidies for people with a disability to lease a vehicle, is part of PIP. Freeze on student loan repayment rate The student loan repayment threshold will be maintained for three years. Training for apprentices under-25 free at small companies A new Youth Guarantee will give 춲820m towards efforts to guarantee every young person a place in college, an apprenticeship or personalised job support. After 18 months, 18-to-21 year-olds will be offered paid work instead of benefits. Books for school libraries  A total of 춲5m will be given to secondary schools for them to buy more books for their libraries. Wider inheritance tax rules A change to inheritance tax will allow the transfer of 100% relief allowance between spouses. Uber and Bolt journeys to be taxed Ride-hailing apps including Uber and Bolt will have to pay the full 20% rate of VAT, in a measure being described as a taxi tax. It is predicted to raise 춲700m a year. Currently, ride-hailing apps are only charged on the profit they take and not the fare itself. Rail fares frozen Rail fares will be frozen for the first time in 30 years, with passengers not paying any more for season tickets, peak return and off-peak return tickets between major cities. DLR extension  Although not in the chancellor's speech, the budget confirmed the Docklands Light Railway (DLR) will be extended to Thamesmead in southeast London. Business rate changes  Business rates will be reduced for 750,000 retail, hospitality and leisure properties, which will be funded by an increase on premises worth more than 춲500,000. The tax reduction will be paid for by an increase in taxes on properties worth 춲500,000 or more, like the warehouses used by online giants such as Amazon. Stamp duty break for companies new to London Stock Exchange A stamp duty holiday for companies newly listing on the London Stock Exchange will be in place for three years. OBR forecast Next year, economic growth is expected to be lower than the OBR thought in March. GDP will be 1.4% in 2026, down from a previously anticipated 1.9%. It will be 1.5% for the rest of the decade. According to the independent forecasters, prices are expected to rise faster than the OBR thought in March due to higher wages and food costs. Inflation will be 3.5% this year and 2.5% next. The amount of fiscal headroom the chancellor has doubled to 춲22bn in 2029-30. This means a 춲22bn financial cushion against price shocks such as the COVID-19 pandemic and soaring energy costs. NHS technology and new neighbourhood health centres The government will invest 춲300m in NHS technology and 250 new neighbourhood health centres with the aim of expanding more services into communities. Over 100 centres, including in Birmingham, Truro and Southall, are expected to be delivered by 2030. Prescription costs frozen The cost of an NHS prescription in England will be frozen at 춲9.90. 2.6% of GDP to be spent on defence The government will spend 2.6% of GDP, a measure of everything produced in the economy, on defence. National wage increases From next April, the national living wage will rise by 4.1% to 춲12.71 an hour for eligible workers aged 21 and over. The national minimum wage rate for 18 to 20-year-olds will increase by 8.5% to 춲10.85 an hour. For 16 to 17-year-olds and those on apprenticeships, the national minimum wage will increase by 6% to 춲8 an hour. Nations and local mayors The government of Northern Ireland will get an additional 춲317m, 춲505m for the Welsh government and 춲820m for the Scottish government. \"Flexible\" funding worth 춲13bn has been pledged for seven regional mayors to invest in skills, business support and infrastructure."
    },
    {
        "title": "Farmers ignore tractor ban and take inheritance tax protest to Westminster",
        "description": "Farmers have driven a convoy of tractors into Westminster on budget day over proposed inheritance tax changes.",
        "url": "https://news.sky.com/story/farmers-ignore-tractor-ban-and-bring-inheritance-tax-protest-to-westminster-13475555",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-farmers-protest-westminster_7092225.jpg?20251126091835",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-26 08:26:00",
        "Headline": "Police had banned tractors from Whitehall, but farmers angry about Rachel Reeves's tax changes brought their budget day protest to Westminster anyway.",
        "Content": " Farmers have driven a convoy of tractors into Westminster on budget day over proposed inheritance tax changes. They came despite Metropolitan Police restrictions banning agricultural machinery from the area. One tractor was parked outside Parliament on Abingdon Street bearing the slogan \"Fools vote Labour\", with more seen driving through Westminster on Wednesday morning. Police stopped about 20 tractors in the area, including one with a farmer dressed as Father Christmas whose tractor was parked on Whitehall and carried a large spruce tree with a sign reading: \"Farmer Christmas - the naughty list: Keir Starmer, Rachel Reeves, David Lammy, Diane Abbott, Angela Rayner & the BBC.\" \"Anyone breaching conditions by bringing vehicles, including tractors or agricultural vehicles, to today's farmers protest will be asked by officers to leave,\" police said in a statement. \"If they refuse to comply with the conditions, officers will have to make arrests for offences under the Public Order Act.\" Follow the latest on the budget: Chancellor vows to make 'fair and necessary choices' \n                  Budget 2025: Reeves to face further questions after being accused of broken promises\n                 \n                  Budget 2025: The same old Labour? Why party's credibility might not be recoverable\n                 \n                  Budget 2025: Chancellor spared wrath of bond vigilantes - for now\n                 The force said its officers had spoken to several people to advise them of the conditions, adding that while the majority had listened and complied, \"several arrests have been made\". Tractors were banned from Whitehall because of the \"serious disruption\" they may cause to the local area, including businesses, emergency services and the public, according to an earlier statement on Tuesday. The force added that people would still be able to demonstrate, but that they must remain in a specified area in Richmond Terrace, Whitehall. The protest comes as anger continues over Chancellor Rachel Reeves's plan to introduce a 20% inheritance tax on agricultural land and businesses worth more than 춲1m from April 2026. The sector is already struggling with rising costs, tough market conditions and the worsening impact of climate change. One of the organisers of the protest is Dan Willis, who owns Rookery Farms near Newbury in Berkshire. He told Sky News correspondent Dan Whitehead that he was \"absolutely devastated\" when the group was told the demonstration couldn't happen anymore, adding that it was \"very hard to get the word out to everybody\". \"They were coming anyway, so unfortunately the Met have scored an own goal here. They created carnage,\" Mr Willis said. \"We know it's come from government. We know they don't want to listen to us, whether it's in the House or on the street, but we need a road. We need to exercise our right to protest. At the end of the day, that's what's happening today.\" West of England and Wales correspondent The ban on tractors coming to Whitehall was announced the night before the budget  but despite the restriction, they still rolled into town on the M4 in the early hours. If anything, the Met Police order to stop agricultural vehicles attending the protest due to concerns about \"serious disruption\" led to even more chaos. Not allowed onto Whitehall, farmers ended up blocking Trafalgar Square and roads leading to Westminster, with several arrests made. \"The Met unfortunately have scored an own goal here and created carnage,\" organiser Dan Willis told me. As we spoke outside The Farmers Club near to Downing Street, a forestry shredder blasted out pulverised red cardboard dispatch boxes representing last year's budget  the one which has angered farmers so much.  As Rachel Reeves passed our camera outside Downing Street, the boos from 500 or so farmers were deafening. There may not have been any row back on the new inheritance tax by the Chancellor this year  but the 20% levy doesn't kick in till April 2026. Farmers will continue to push for it to be scrapped in the months to come. He added: \"These are all independent farmers who have come of their own volition. \"It's such an emotive issue. You're talking about death and losing family, a family asset, which is how we earn our living. And by the way, producing food, taxing the working people of this country, it's impossible for us to go on.\" Read more:Raft of tax hikes expected todayWill you be hit by expected 'stealth tax'?Are we set for yet another complex budget? Wednesday's protest is the latest in a string of demonstrations by farmers against proposed changes to inheritance tax. Farmers drove their tractors to Whitehall in December, with thousands of people protesting the decision they say will put their businesses and futures and the country's food security at risk."
    },
    {
        "title": "Salary-sacrifice pension contributions over 춲2k to face national insurance charge",
        "description": "Rachel Reeves has announced that salary-sacrificed pension contributions above an annual figure of &#163;2,000 are to be subject to national insurance charges.",
        "url": "https://news.sky.com/story/rachel-reeves-announces-1632000-salary-sacrifice-cap-in-budget-13475766",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-budget-rachel-reeves_7092775.jpg?20251126171701",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-26 15:17:00",
        "Headline": "The chancellor said the move was a \"pragmatic step\" that would protect those on low and middle incomes.",
        "Content": " Rachel Reeves has announced that salary-sacrificed pension contributions above an annual figure of 춲2,000 are to be subject to national insurance charges. The move, which comes into effect in April 2029, is expected to raise more than 춲4bn in that financial year. Budget latest: Income tax thresholds frozen and two-child benefit cap scrapped The chancellor said the move was a \"pragmatic step\" that would protect those on low and middle incomes. Salary sacrifice schemes for pensions are an arrangement by which employees can chose to give up a portion of their salary in exchange for their employer paying an equivalent amount into their pension. The part of the salary that is given up is currently not subject to income tax or national insurance as it is taken out of a worker's gross salary before the taxes are calculated. The schemes also benefit employers, who do not have to pay national insurance on the amount sacrificed by the employee. \n                  Budget 2025: Reeves to face further questions after being accused of broken promises\n                 \n                  Budget 2025: The same old Labour? Why party's credibility might not be recoverable\n                 \n                  Budget 2025: Chancellor spared wrath of bond vigilantes - for now\n                 Some employers also choose to add this saving to their employee's pension. But under the new changes, contributions above 춲2,000 will be treated as ordinary employee pension contributions, and will therefore be subject to both employer and employee national insurance contributions. The chancellor told the Commons that salary sacrifice for pensions was due to \"treble in cost from 춲2.8bn in 2017 to 춲8bn by 2030\". She said the \"greatest benefit\" was going to \"higher earners or to those in the financial services sector putting their bonuses into pensions tax-free, while those on the minimum wage or whose employers don't offer salary sacrifice don't benefit at all\".  Ms Reeves said: \"This is not sustainable for the public finances, putting pressure on the tax everyone else pays, and so I am introducing a 춲2,000 cap on salary sacrifice into a pension with contributions above that taxed in the same way as other employee pension contributions.\" She added: \"That is a pragmatic step so that people, especially on low and middle incomes, can continue to use salary sacrifice for their pension without paying any more tax than they do now. And to give individuals and employers time to adjust to these new arrangements, these changes will come into effect in 2029.\" The changes were outlined in a document written by the Office for Budget Responsibility (OBR) and released in error ahead of Ms Reeves' speech. The document said: \"The policy results in an increase in NICs (national insurance contributions), which is estimated to raise 춲4.7bn in 2029/30 and 춲2.6bn in 2030/31. Read more:Budget 2025: The key points at a glanceWhy Labour MPs may like Reeves's budget \"The costing assumes that, in most cases, employee pension contributions above 춲2,000 that were part of a salary-sacrifice scheme will become subject to employer and employee NICs, either because they move to a standard pension scheme or continue in a salary-sacrifice scheme under the new tax arrangements.\" The Society of Pensions Professionals (SPP) said around a third of private sector employees use a salary-sacrifice arrangement, compared with almost 10% of public sector workers. It said that while there was a 춲4bn cost to the government in providing salary sacrifice arrangements - 춲1.2bn for employees and 춲2.9bn for employers - there was also \"widespread recognition that this is a positive investment that incentivises pension saving\". The SPP said the change would affect basic rate taxpayers more than higher rate taxpayers because the main rate of national insurance contributions is 8% for employees, but only 2% on incomes above 춲50,270. Steve Hitchiner, chair of the tax group at the SPP, said: \"Abolishing salary sacrifice for pensions will affect the take-home pay of millions of employees - especially basic rate taxpayers - and is a tax on working people, in spirit if not in name. It is also another sizeable cost to employers and, perhaps most importantly, its removal will reduce pension saving.\""
    },
    {
        "title": "How much is the mansion tax and who will have to pay it?",
        "description": "Rachel Reeves has announced a mansion tax on homes worth more than &#163;2 million.",
        "url": "https://news.sky.com/story/how-much-is-the-mansion-tax-and-who-will-have-to-pay-it-13475737",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-mansion-tax-house_7092666.jpg?20251126145832",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-26 14:27:00",
        "Headline": "The chancellor announced a mansion tax in the budget, saying it would solve a \"long-standing source of wealth inequality\".",
        "Content": "Rachel Reeves has announced a mansion tax on homes worth more than 춲2 million. The \"high value council tax surcharge\" will apply in England from 2028 and will raise 춲400m a year for the government, the chancellor said in Wednesday's budget. Homeowners will have to pay the annual charge on top of their council tax bill. Politics latest: Reeves freezes income tax thresholds and scraps two-child benefit cap The move was widely rumoured before the budget, but what is notable is another proposal expected to be announced was not. Ms Reeves was expected to introduce a re-evaluation of homes in the three highest council tax tiers (F, G and H), with a surcharge on them. She did not announce this, but instead said there will be four bands for the new mansion tax, with values based on 2026 prices. \n                  Budget 2025: Reeves to face further questions after being accused of broken promises\n                 \n                  Budget 2025: The same old Labour? Why party's credibility might not be recoverable\n                 \n                  Budget 2025: Chancellor spared wrath of bond vigilantes - for now\n                  The lowest band, for properties worth between 춲2m and 춲2.5m, will pay 춲2,500. The highest band, for homes worth 춲5m or more, will pay 춲7,500. Ms Reeves and the Office for Budget Responsibility (OBR) did not reveal the two middle bands and charges. But she said the surcharge would be uprated annually by the Consumer Price Index (CPI) inflation. The extra revenue will go straight to central government, not to local councils, as is the case for standard council tax. Ms Reeves said the charge would apply to fewer than 1% of all properties, and would help \"deal with a long-standing source of wealth inequality\". There will be a consultation on support for homeowners and a deferral scheme for those unable to pay immediately, taking into account homes bought decades ago that have soared in value. Read more:Main budget announcementsWill you be hit by Reeves's 'stealth tax'?Cash ISA limit slashed - but some are exempt  The OBR said it was highly uncertain about the 춲400m it predicted the tax would raise each year, and would adjust the forecast, if needed, after the consultation. Paul Johnson, former director of the Institute for Fiscal Studies, said the bands would create \"big spikes at specific valuations\". Rob Hillock, head of personal financial planning at financial services consultancy Broadstone, said: \"The chancellor's introduction of a 'mansion tax' on houses valued above 춲2m will likely prompt many homeowners to get an up-to-date valuation of their property wealth. \"It has the potential to create market distortions as homeowners look to reduce the value of their home to avoid additional tax or prompt some to downsize to smaller, cheaper homes. \"The OBR notes in its comments that the reform could see price bunching below each of the four new price bands as homeowners look to minimise their tax liability.\"  Mark Campbell, head of wealth at financial consultancy Isio, said the mansion tax makes a \"flawed assumption\" that those living in homes worth more than 춲2m have the liquid wealth or income to pay the tax. He said it risks penalising people who are asset-rich and cash-poor, especially in London and the southeast. He also warned the mansion tax risks sending a message that the UK is a less attractive place for investors, wealth creators and entrepreneurs."
    },
    {
        "title": "The army's Ajax fighting vehicle injured troops and cost billions - there must be accountability",
        "description": "The army's &#163;10m Ajax fighting vehicle was not an accident waiting to happen - but one that was already unfolding even as a defence minister declared it to be safe.",
        "url": "https://news.sky.com/story/the-armys-ajax-fighting-vehicle-injured-troops-and-cost-billions-there-must-be-accountability-13475687",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ajax-military-vehicle_7091719.jpg?20251125175159",
        "type": "Politics",
        "Author": "Deborah Haynes",
        "Date Published": "2025-11-26 13:06:00",
        "Headline": "Ajax vehicles have been proclaimed as 'world class', but they have have left British soldiers in hospital and problems identified over several years seem to have persisted. Ministers will want answers.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  The army's 춲10m Ajax fighting vehicle was not an accident waiting to happen - but one that was already unfolding even as a defence minister declared it to be safe. Luke Pollard, the minister responsible for procurement, asked for and was given in writing \"senior assurances\" that previous problems with noise and vibration had been resolved before he announced on 6 November that it was ready for use. He also said other countries might be interested in buying what the UK government has billed as \"the world's most advanced medium-weight armoured fighting vehicle\". Yet, barely a fortnight later, 31 troops suffered sickness and hearing issues after being deployed on the Ajax vehicles during war games on Salisbury Plain. Also - just weeks before Mr Pollard made his announcement at a factory in Merthyr Tydfil, where the American defence company General Dynamics is manufacturing the machines - yet more soldiers had become unwell and even had to go to hospital after their time inside the vehicles. The procurement minister and his boss, John Healey, the defence secretary, will surely be demanding answers from General Sir Roly Walker, the head of the army, as well as civil servants at the Ministry of Defence's (MoD) procurement arm - Defence Equipment and Support - and General Dynamics. Ministers must be perplexed as to how this could possibly be happening again.  A litany of woes affecting the 춲5.5bn Ajax contract has been well documented by several inquiries. They were triggered when previous trials of the vehicle were belatedly halted in 2020 after troops were harmed by excessive noise and vibration. An investigation into that debacle found that senior officers had failed to act despite knowing for up to two years that the Ajax vehicle put soldiers at risk of harm. The health and safety report called the failure \"complex and systemic\" and said a culture existed of not treating safety as being equally important to cost and time. Read more: The Ajax fighting vehicle Efforts were made to find a fix with better ear protection and more cushions on seats, and trials restarted. But the fact that soldiers are still experiencing issues with hearing as well as sickness and shakes from riding inside the vehicles suggests the underlying cause has not been resolved. Defenders of the programme say that all armoured vehicles are noisy and vibrate. But Ajax is billed as \"world-class\", with a price tag to match. 'Debacle has been a disaster for the army' It can't be too much to ask that troops avoid injury inside them before ever heading towards an active frontline. The entire debacle has been a disaster for the army which is in desperate need of new fighting vehicles after previous attempts to acquire fleets over the decades floundered as budgets were squeezed. It is also a personal tragedy for those soldiers most severely impacted who have been left with permanent hearing damage. Mr Pollard has moved quickly to order that all use of the Ajax be halted for two weeks after learning about the latest incident over the weekend on Salisbury Plain. A safety investigation is being carried out. But when a previous bout of hearing and sickness injuries during Ajax trials over the summer emerged, the MoD justified pushing on with declaring the vehicle to be operational because no \"systemic\" problem had been found. If that verdict changes, the time must surely come for genuine accountability for a programme that is running years late, has cost the country billions of pounds, affected the health of soldiers and left the army without new armour at a time of growing threats. Read more from Sky News:At least 13 people killed as fire engulfs high-rise buildingsBrazil's ex-president begins 27-year prison sentence Commenting on what happened at the weekend, an MoD spokesperson said: \"This pause underlines our absolute commitment to the safety of our personnel. \"As with any major equipment programme, we continue to test and refine the vehicle to ensure safety and performance.\" General Dynamics has been approached for comment."
    },
    {
        "title": "OpenAI denies allegations ChatGPT is responsible for teenager's death",
        "description": "OpenAI has said a teenager who died after months of conversations with ChatGPT misused the chatbot and the company it is not liable for his death.",
        "url": "https://news.sky.com/story/openai-denies-allegations-chatgpt-is-responsible-for-teenagers-death-13475591",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-openai-logo_7051339.jpg?20251015090351",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-11-26 10:19:00",
        "Headline": "In a blog post on OpenAI's website, the company said its goal \"is to handle mental health-related court cases with care, transparency, and respect\".",
        "Content": "\n          Science and technology reporter\n       OpenAI has said a teenager who died after months of conversations with ChatGPT misused the chatbot and the company it is not liable for his death. Warning: This article contains references to suicide that some readers may find distressing Adam Raine died in April this year, prompting his parents to sue OpenAI in the company's first wrongful death lawsuit. The 16-year-old initially used ChatGPT to help him with schoolwork, but it quickly \"became Adam's closest confidant, leading him to open up about his anxiety and mental distress\", according to the original legal filing. The bot gave the teenager detailed information on how to hide evidence of a failed suicide attempt and validated his suicidal thoughts, according to his parents.  They accused Sam Altman, OpenAI's chief executive, of prioritising profits over user safety after GPT-4o, an older version of the chatbot, discouraged Adam from seeking mental health help, offered to write him a suicide note and advised him on how to commit suicide. In its legal response seen by Sky's US partner network NBC News, OpenAI argued: \"To the extent that any 'cause' can be attributed to this tragic event, plaintiffs' alleged injuries and harm were caused or contributed to, directly and proximately, in whole or in part, by Adam Raine's misuse, unauthorized use, unintended use, unforeseeable use, and/or improper use of ChatGPT.\" According to the AI company, Adam shouldn't have been using ChatGPT without consent from a parent or guardian, shouldn't have been using ChatGPT for \"suicide\" or \"self-harm\", and shouldn't have bypassed any of ChatGPT's protective measures or safety mitigations. In a blog post on OpenAI's website, the company said its goal \"is to handle mental health-related court cases with care, transparency, and respect\". It said its response to the Raine family's lawsuit included \"difficult facts about Adam's mental health and life circumstances\". \"Our deepest sympathies are with the Raine family for their unimaginable loss,\" the post said. Jay Edelson, the Raine family's lead counsel, told Sky News that OpenAI's response \"shows that they're flailing\". He wrote: \"ChatGPT 4o was deliberately designed to relentlessly engage, encourage, and validate its users - including people in mental health crises, for whom OpenAI specifically lowered the guardrails with the launch of 4o. \"Sam Altman, well before we filed suit, told the world that he knew those decisions had caused people-especially young people-to share the most intimate details of their lives with ChatGPT, using it as a therapist or a life coach. \"OpenAI knows that the sycophantic version of its chatbot encouraged users to commit suicide or egged them on to harm third parties. \"OpenAI's response to that? The company is off the hook because it buried something in the terms and conditions. If that's what OpenAI is planning to argue before a jury, it just shows that they're flailing.\" Read more: More than 1.2m people a week talk to ChatGPT about suicideThere's a new Bobbi on the beat - and they're powered by AI Since the Raine family began their lawsuit, seven more lawsuits have been lodged against Mr Altman and OpenAI, alleging wrongful death, assisted suicide, involuntary manslaughter, and a variety of product liability, consumer protection, and negligence claims. OpenAI appeared to reference these cases in its blog post, saying it is reviewing \"new legal filings\" to \"carefully understand the details\". Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Scientists detect what they believe is lightning on Mars",
        "description": "Scientists have detected what they believe to be lightning on Mars by analysing the swirling winds picked up by a NASA robotic spacecraft.",
        "url": "https://news.sky.com/story/scientists-detect-what-they-believe-is-lightning-on-mars-13475861",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-nasa-mars-perseverance_6278208.jpg?20230908120428",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-11-26 20:20:00",
        "Headline": "Researchers document 55 instances of what they describe as \"mini lightning\" - but some scientists express caution over findings.",
        "Content": "Scientists have detected what they believe to be lightning on Mars by analysing the swirling winds picked up by a NASA robotic spacecraft. A microphone aboard the Perseverance rover captured the crackling of electrical discharges, a French-led research team reported on Wednesday. The researchers documented 55 instances of what they describe as \"mini lightning\" over two Martian years - just under four Earth years - mostly occurring during dust storms. The electrical arcs, just a few inches in size, took place within about 6ft of the microphone mounted on the rover's tall mast, which is part of a system for examining Martian rocks with a camera and lasers. Scientists say sparks from the electrical bursts - similar to static electricity on Earth - can be heard clearly through the wind gusts and dust particles hitting the microphone. The study's lead author, Baptiste Chide, of the Institute for Research in Astrophysics and Planetology in Toulouse, said scientists have been looking for electrical activity and lightning on Mars for half a century. \"It opens a completely new field of investigation for Mars science,\" Mr Chide said. \"It's like finding a missing piece of the puzzle.\" \n                  Almost 280 people missing as huge fire engulfs Hong Kong flats - dozens confirmed dead\n                 \n                  Two National Guard members shot near White House in Washington DC\n                 \n                  Guinea-Bissau: Military seizes power as President Umaro Sissoco Embalo 'deposed and arrested'\n                 However, another scientist has pointed out that the evidence is strong, but it comes from a single instrument intended to study rock composition, and that the electrical discharges were heard - not seen. Read more from Sky News:Two National Guard members shot near White HouseAlmost 280 missing as huge fire engulfs Hong Kong flats \"It really is a chance discovery to hear something else going on nearby, and everything points to this being Martian lightning,\" said Daniel Mitchard, Senior Lecturer in Lightning Physics and Engineering at Cardiff University. But until new instruments are sent to verify the findings, \"I think there will still be a debate from some scientists as to whether this really was lightning\". Lightning has already been confirmed on Jupiter and Saturn, and researchers have suspected for years that Mars might have it, too. Mr Chide and his team analysed 28 hours of Perseverance recordings, documenting episodes of \"mini lightning\" based on acoustic and electric signals to verify possible lightning. Since 2021, Perseverance has been exploring an ancient Martian river delta, gathering rock samples that might contain traces of long-extinct microscopic life. NASA hopes to bring these drilled samples back to Earth for detailed study, but the return mission is currently paused while the agency looks for more affordable alternatives."
    },
    {
        "title": "There's a new Bobbi on the beat - and they're powered by AI",
        "description": "Forget \"ello, ello, ello\" - modern policing's now about \"AI, AI, AI\".",
        "url": "https://news.sky.com/story/theres-a-new-bobbi-on-the-beat-and-theyre-powered-by-ai-13475503",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-bobbi-police_7092054.png?20251126021443",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-11-26 02:16:00",
        "Headline": "Chief Superintendent Simon Dodds described the trial of the UK's first AI-powered police virtual assistant as a \"really exciting time\" - and hopes this will allow staff to focus on \"emergencies and complex, sensitive issues\".",
        "Content": "Forget \"ello, ello, ello\" - modern policing's now about \"AI, AI, AI\". The UK's first police virtual assistant, powered by artificial intelligence, has been launched by two police forces as part of a new trial. \"Bobbi\" interacts like a human and helps answer frequently asked questions - but it isn't designed to be used in emergencies. Thames Valley Police, as well as the Hampshire and Isle of Wight Constabulary, say the tool aims to complement online forms, phone lines and front counters not replace them. A spokesman for the forces said: \"You cannot use the technology to report a crime or as an alternative to the emergency 999 line. \"Bobbi has been tested by over 200 people during its development, including by representatives from victim care groups and independent scrutiny panel members.\" The AI tool uses the same guidelines and information available to human call handlers to make suggestions and recommendations. And if Bobbi is unable to answer a question - or if a user wants to speak to a person instead - they can be automatically redirected to a real-life operator. Read more tech news:'One in four' GPs using AI at workTikTok defends AI moderation  (Human) Chief Superintendent Simon Dodds described it as a \"really exciting time\" - and hopes this will allow staff to focus on \"emergencies and complex, sensitive issues\". He added: \"Empathy, common sense and that intangible gut instinct are some of the many human skills that need to guide our interactions with the public, particularly in their time of need. \"By providing quick responses to commonly asked, non-emergency questions, Bobbi will enhance our service to our communities, ensuring that every member of the public can get the help they need, whenever they need it.\" Mr Dodds went on to stress that Bobbi will remain a work in progress, with a team of experienced staff working to fix bugs and comply with regulations."
    },
    {
        "title": "Sexual assault civil trials against Kevin Spacey set for next year",
        "description": "Kevin Spacey is set to face civil trials at the High Court later next year, over separate lawsuits filed by three men who have accused him of sexual assault.",
        "url": "https://news.sky.com/story/sexual-assault-civil-trials-against-kevin-spacey-set-for-next-year-13475722",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-kevin-spacey-august-2025_7092781.jpg?20251126172026",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-26 13:56:00",
        "Headline": "A preliminary hearing for civil cases filed by three men against Hollywood actor Kevin Spacey has taken place at the High Court in London.",
        "Content": "Kevin Spacey is set to face civil trials at the High Court later next year, over separate lawsuits filed by three men who have accused him of sexual assault. A man called Ruari Cannon, who has waived his right to anonymity, and two other claimants who have not, alleged they were abused by the Hollywood actor at times between 2000 and 2015. They are taking legal action at the High Court against Spacey, while Mr Cannon is also bringing action against London's Old Vic theatre. The actor was artistic director there between 2004 and 2015. Spacey, 66, has denied allegations of wrongdoing. He has formally denied two of the claims and is yet to file a defence to the court in the third, which was submitted in September. In 2023, Spacey was acquitted of nine sex offences relating to four men in a criminal trial. At a preliminary hearing for the civil cases at the High Court on Wednesday, Mrs Justice Lambert set a provisional three-week window for all three to be heard there in October 2026. She said it is still to be determined whether the claims are heard in a single trial, or in three consecutive trials. Lawyers had made arguments for and against hearing the cases together. Elizabeth-Anne Gumbel KC, representing Mr Cannon and the other two claimants, known as LNP and GHI, said in written submissions that hearing the cases together would prevent Spacey and witnesses from having to give evidence more than once. William McCormick KC, representing Spacey, said the case brought by the man known as LNP should be heard in the county court, separate from that of Mr Cannon and the third man. In written submissions, he said: \"On a rational analysis, the only common feature is Kevin Spacey. \"The fact that he met, or in the case of Cannon, is said to have met, each claimant in the context of his work at the Old Vic takes matters no further. \"The circumstances of the alleged assaults are markedly different and occur many years apart.\""
    }
]