[
    {
        "title": "'Khan Younis looks like Stalingrad': British doctor in Gaza describes horror - and has message for world leaders",
        "description": "A British doctor working in Gaza has urged world leaders to \"stop talking and do something\" as he described how people are starving and the \"massive extent of destruction\".",
        "url": "https://news.sky.com/story/british-doctor-in-gaza-describes-horror-as-people-starve-and-tells-world-leaders-to-do-something-13371730",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-khan-younis_6922670.jpg?20250520204423",
        "type": "Home",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-05-20 18:20:00",
        "Headline": "Dr Tom Potokar, who is part of a group of British specialist doctors working in Khan Younis, says it is \"horrific\" as patients are malnourished - and children are suffering the worst.",
        "Content": "\n          Middle East correspondent\n              @AliBunkallSKY\n  A British doctor working in Gaza has urged world leaders to \"stop talking and do something\" as he described how people are starving and the \"massive extent of destruction\". Dr Tom Potokar - who has compared Gaza to a \"slaugherhouse\" because of the bombardment by Israeli forces - is part of a group of British specialist doctors and surgeons currently working in Khan Younis. Gaza latest: UK halts trade talks with Israel Sky News spent two days filming with them in Nasser and Amal hospitals - two of the last functioning hospitals in southern Gaza. They are plastic surgeons and orthopaedic specialists. The operating theatres are a rare zone of calm as the medics work with the war outside and a constant stream of wounded needing urgent treatment. All the patients are malnourished. Children are suffering the worst. The lack of food and water has made them weak and more vulnerable to their injuries. Hospitals in Gaza have repeatedly come under attack during the war. The Israel Defense Forces (IDF) claims Hamas has been hiding in them or in tunnels underneath. Nasser hospital hasn't escaped. The burns unit was one of the busiest parts of the hospital, until it was destroyed in an airstrike. The doctors sleep and spend downtime in small living quarters within the hospital itself. Food is one ready meal a day, only 400 calories. The 11-week blockade is affecting everyone. Dr Potokar was working in the European hospital on the western edge of Khan Younis but had to evacuate last week when it came under missile fire and had to close. He went to Amal hospital next to Nasser and is working again. He says he's seen a dramatic change since he was last in Gaza shortly after the Hamas attack on 7 October 2023.  \"The difference this time I think is the intensity,\" he says. \"Back in October to December '23 was the last time I was here, there was a lot of wounded, and it was very intense as well. \"I think the difference this time is because of the blockade there's so little stuff getting in, there's no food getting in so people are starving, there's very little medical supplies coming in but also the other very noticeable thing is the massive extent of destruction - I mean Khan Younis looks like Stalingrad.\"  Speaking about what he has witnessed in Gaza, Dr Potokar added: \"What can you say, it's horrific, it's a slaughterhouse. That's what it is, it's a slaughterhouse.\" He also urged world leaders to \"stop talking and do something\". Read more:What aid has entered Gaza and where is it going?Dad wrongly pronounced dead in 2014 is killed in airstrike The United Nations says 100 aid trucks were cleared for entry into Gaza on Tuesday, but Tom Fletcher, a former British diplomat who now heads the UN Office for the Coordination of Humanitarian Affairs, warned that 14,000 babies could die in the next 48 hours if they don't receive urgent aid. On Monday evening, the IDF-declared combat zone was only a few streets from the Nasser hospital. Drones flew low overhead through the day.  \"An evacuation order for most of Khan Younis went out today, which meant we lost several members of the team,\" said Dr Victoria Rose, a plastic surgeon. \"My anaesthetic nurse and Graeme's orthopaedic colleague had to leave us mid-case to go and evacuate their families to an area of safety.\" Dr Graeme Groom added: \"These are people just like you and me, they have their homes, their families, they live normal lives, many are very impressive people and without notice they have to pick up a grab bag and leave… look for food, look for water, look for shelter, but turn up at work each day.\" With the Israeli military operation getting closer, the doctors are also prepared to evacuate at short notice. Essential supplies have been gathered and packed ready in a storeroom. But Nasser hospital has the last remaining ICU department in the whole of southern Gaza - one of only two with a working oxygen supply. If it must be evacuated, then the remaining temporary field hospitals would likely be overwhelmed and unable to cope."
    },
    {
        "title": "Revealed: Why Keir Starmer's strategy to tackle Reform UK could end up backfiring",
        "description": "Has Labour got the right strategy to tackle Reform UK?",
        "url": "https://news.sky.com/story/revealed-why-keir-starmers-strategy-to-tackle-reform-uk-could-end-up-backfiring-13371866",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-keir-starmer-labour_6922820.jpg?20250520230945",
        "type": "Home",
        "Author": "Sam Coates",
        "Date Published": "2025-05-20 21:44:00",
        "Headline": "Nigel Farage's party is a threat to Labour MPs. But the PM's attempts to win round Reform voters could cause his own supporters to back someone else.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Has Labour got the right strategy to tackle Reform UK? Nigel Farage's party cost the Tories dozens, maybe 100-plus seats at the general election. Now it looks like the party is hitting Labour too. But has Sir Keir Starmer got the right answers? Last year, Labour won a landslide because the Tory vote collapsed, in part because Reform UK took chunks of their supporters in constituencies across the UK. And here is the situation on 1 May this year - the national equivalent vote share at the council elections put Reform well ahead in first place. Success - this time at the expense of Labour too. How big a threat is this to MPs? As a very crude experiment, Sky News has looked at what would happen if this result was replicated evenly across parliamentary constituencies. Within the areas where there were county council elections are 77 complete Westminster seats with sitting Labour MPs. This includes places like Wycombe, where Treasury minister Emma Reynolds holds. Or Lincoln, won by Foreign Office minister Hamish Falconer. \n                  Plans to spend millions on 'forgotten neighbourhoods' - could yours be one of them?\n                 \n                  Who PM was really trying to echo with 'island of strangers' speech\n                 \n                  Civil service relocation and AI officials at heart of government cost cutting measures\n                 Now if - for fun - we mapped the country council results from 1 May evenly across these general election constituencies, almost all those Labour seats are gone. All lost, apart from five. That's 72 out of 77 Labour MPs losing their seats and mostly to Reform UK. What if we took that swing an applied across the whole country, places where there weren't local elections? Angela Rayner in Greater Manchester and Jess Phillips in Birmingham would lose their seats. Yes this is a crude measure - it assumes a uniform swing can be drawn from the 1 May polls - and local and national elections are very different. But importantly, YouGov's latest national opinion polls paint a similar picture to the council elections. Meanwhile, 89 out of 98 constituencies where Reform came second place have Labour in first. Labour MPs are feeling the heat from Farage. The Reform threat is real. Sir Keir Starmer knows it - and this year has started chasing Reform votes. Slashing aid spending. Abandoning green promises. Hard talk about immigration and living on an \"Island of Strangers\". Sensible given the clear and evident Reform UK threat? Actually - maybe not. Look at the data in detail: This block here is all the people who voted Labour in last year's general election. Now thanks to YouGov polling, we know what people in this block would do with their vote now. It shows Labour has lost more than half of last year's voters. Just 46% still say they'd still vote for Sir Keir's party. But - despite the PM's strategy - they're not actually going to Reform in large numbers. Just 6% of Labour's voters at last year's general election - six out of every 100 - said they would vote Reform now. That's all. So where have they gone? Well, they've been lost much more to liberal and left-wing parties - 12% to the Lib Dems, 9% to the Greens. So just pause there. That means the number of Labour voters who have switched to the Lib Dems and Greens, arguably on the left of the political spectrum, is three times the number going to Reform to the right. Just 2% go to the Tories. And much more seriously for Labour, 22% aren't going to vote, don't know or won't say. The bottom line is people who voted Reform have never backed Labour in large numbers. This shows how Reform supporters last year voted in each election since 2005. You can see - Reform voters are former UKIP voters. They're Boris Johnson's Tories. Let's put it another way. While 11% of Labour voters may one day be open to voting Reform, 70% are at risk of going to the Lib Dems or Greens - seven times the threat from Reform. And typically, these voters don't like the hard line, Reform-leaning policies of Sir Keir Starmer recently. The local elections show there is a threat to Labour from Reform. But our data suggests Keir Starmer trying to be Nigel Farage lite isn't the answer. Is Labour's strategy really working?"
    },
    {
        "title": "Kyra Hill: Girl, 11, who drowned at Liquid Leisure waterpark was unlawfully killed, coroner finds",
        "description": "An 11-year-old girl who drowned at a waterpark was unlawfully killed, a coroner has found.",
        "url": "https://news.sky.com/story/girl-11-unlawfully-killed-after-she-drowned-at-waterpark-inquest-rules-13371361",
        "image_url": "https://e3.365dm.com/22/08/1920x1080/skynews-kyra-hill-collect_5872761.jpg?20250520101524",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-20 09:08:00",
        "Headline": "Kyra Hill died after getting into difficulty in a designated swimming area at the waterpark near Windsor, Berkshire, in August 2022.",
        "Content": " An 11-year-old girl who drowned at a waterpark was unlawfully killed, a coroner has found. Kyra Hill died after getting into difficulty in a designated swimming area at Liquid Leisure near Windsor in Berkshire while attending a birthday party on 6 August 2022. Senior coroner Heidi Connor ruled there were gross breaches of health and safety measures at the park which contributed to her death. The breaches related to the depth and visibility of the water and the absence of an emergency plan and risk assessment, she found. An inquest at Berkshire Coroner's Court heard how the schoolgirl was found more than an hour after emergency services were alerted and was taken to hospital, where she was pronounced dead. The inquest heard there were no signs warning of deep water at the leisure park. Despite various sharp drops of up to 4.5m (14.7ft) within the swimming zone, the only signs relating to depth said \"danger shallow water\". The lake where Kyra was seen going under was 2.68m (8.8ft) deep, a report carried out after the incident found. Liquid Leisure said in a statement after the inquest that the incident took place in the \"designated swimming area of our lake, which always had a fully trained Royal Life Saving Society (RLSS) lifeguard on duty\". A 17-year-old lifeguard managed to reach the point where Kyra disappeared but staff at the centre were only qualified to perform \"surface-water rescues\" - not underwater ones. The inquest heard evidence of how there was a 10-minute gap between the first and second searches for the youngster in that part of the lake. Although a manager attended rapidly, 37 minutes passed between Kyra struggling and 999 being called. The frantic search was likened to a \"nightmare\" by a mother attending the birthday party, while a police officer described it as a \"chaotic scene\" due to \"conflicting\" information being fed to the emergency crews. The diver who eventually found Kyra told the inquest the lake had \"almost zero visibility\". Parents and carers were not advised to attend with children in a ratio of one to four, and young children were permitted to swim without buoyancy aids, the coroner said. There was also no emergency plan or risk assessment that took those factors into account, and no control measures were identified and put in place to \"take account of these clear risks\", she added. A post-mortem examination confirmed Kyra's cause of death as \"drowning\". Read more from Sky News:People smuggler jailed for role in £12m operationFamily pay tribute to 'hero' firefighter killed in blaze Giving her conclusions, Ms Connor said: \"Members of the family, at no point have I forgotten that this was about your 11-year-old, Kyra, and I am so very sorry that you are here today. \"It must have been incredibly difficult to sit in court and hear some of the evidence that we've heard. I offer all of you my heartfelt condolences.\"  'She should have been saved' In an interview with Sky News presenter Sarah-Jane Mee after the inquest, Kyra's father Leonard Hill remembered the moment he received a call to be told his daughter was missing. He said: \"It's the most disturbing phone call I have ever received in my life... that Kyra is underwater, Kyra is missing. \"My immediate response is that there is no way she would have gone off... she would never have walked off and left her group.\" Mr Hill continued: \"To hear that your daughter is underwater, you're searching online 'how long can somebody survive underwater?'. \"You can see that within 10 minutes they can potentially come out brain damaged, but there is still a chance of survival. \"I remain of the stance that she could have been saved, and she should have been saved, and had Liquid Leisure had emergency plans in place, Kyra would have been saved.\" Mr Hill had earlier said outside court after the inquest: \"Summer should be a time of joy in creating happy memories with family and friends. \"It should never end in tragedy. It should never mark the day we mourn our children's lives, lost in places where they should have been safe. \"The terrible reality is that without urgent reform, more families will face these devastating goodbyes.\" Mr Hill described Kyra's life as a \"shining example of resilience and strength\". The youngster was a Manchester United fan and dreamed of becoming a professional footballer, with a back-up plan to pursue law.  Mr Hill added: \"Her memory demands that we demand safer standards now. No parent should endure this pain and no child's life should be sacrificed so recklessly. \"We must act today for Kyra and for every family that visits these leisure parks tomorrow. \"The time for words has passed. Now is the moment for action.\" At the time of the incident, Mr Hill told Sky News Kyra was \"left to drown\" and accused the operator of \"neglect\". Liquid Leisure has said in a statement: \"Everyone at Liquid Leisure was heartbroken by the tragic incident on August 6 2022 and our thoughts remain with Kyra's family and all those affected. \"The incident took place in the designated swimming area of our lake, which always had a fully trained Royal Life Saving Society (RLSS) lifeguard on duty. We have fully cooperated throughout the investigation, the subsequent criminal process, as well as the inquest. The designated swimming area was subsequently closed and we took the decision not to reopen that activity.\" The statement continues: \"Whilst we acknowledge the conclusions reached by the coroner, nothing is more important to us than the safety of our visitors.\""
    },
    {
        "title": "The Wargame: New Sky News and Tortoise Media podcast series simulates a Russian attack on UK",
        "description": "A top team of former government ministers and military and security chiefs have taken part in a wargame that simulates a Russian attack on the UK for a new podcast series announced on Wednesday by Sky News and Tortoise Media.",
        "url": "https://news.sky.com/story/the-wargame-new-sky-news-and-tortoise-media-podcast-series-simulates-a-russian-attack-on-uk-13371462",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-wargame-podcast-tile_6918416.png?20250516151445",
        "type": "Home",
        "Author": "Deborah Haynes",
        "Date Published": "2025-05-20 11:32:00",
        "Headline": "Former senior politicians, including Sir Ben Wallace, Jack Straw and Amber Rudd, play a fictional British government pitched against an imagined Kremlin.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n A top team of former government ministers and military and security chiefs have taken part in a wargame that simulates a Russian attack on the UK for a new podcast series announced on Wednesday by Sky News and Tortoise Media. Among the line-up, Sir Ben Wallace, a former Conservative defence secretary, plays the prime minister; Jack Straw, a former senior Labour politician, resumes his old job as foreign secretary; Amber Rudd steps back into her former role as home secretary and Jim Murphy, a secretary of state for Scotland under Gordon Brown, takes the position of chancellor. The defence secretary is played by James Heappey, a former armed forces minister. Lord Mark Sedwill is the national security adviser - a position he held for real under both Theresa May and Boris Johnson, while General Sir Richard Barrons, one of the leaders of a major defence review that is due to be published in the coming weeks, plays the role of chief of the defence staff, the UK's top military officer. Baroness Helena Kennedy, a barrister and expert on human rights law, appears as attorney general, while Lieutenant General Sir David Capewell resumes his former role as chief of joint operations, the UK's warfighting commander. 👉Search for The Wargame on your podcast app👈 The scenario is designed to test Britain's defences and national resilience at a time of mounting tensions with Russia. \n                  'Khan Younis looks like Stalingrad': British doctor in Gaza describes horror - and has message for world leaders\n                 \n                  Gaza live: UK halts trade talks with Israel and summons ambassador over 'cruel' Gaza blockade - as UN says no aid has reached Palestinians\n                 \n                  90% of Port-au-Prince controlled by gangs as thousands forced into heaving displacement camps\n                 It also explores the reliability - or otherwise - of key allies like the United States in a crisis. Asked why he wanted to take part in the project, Sir Ben said: \"I think it's really important that we demonstrate to the public how government makes decisions in real crises and emergencies and let them understand and hopefully be reassured that actually there is a process and it's at that moment in time that no matter what people's party politics are, people pull together for the right reasons.\" Launching on 10 June, the five-part podcast series will give listeners the chance to experience the kind of wargame that is genuinely tested inside government. The only difference with this version is that nothing discussed is classified. The tagline for the series is: \"Russia knows our weaknesses - but do you?\" Written and presented by me, The Wargame pitches a fictional British government, led by Sir Ben, against an imagined Kremlin in a high-stakes contest that draws on the real-life knowledge and experience of the cast. The series begins a few months in the future, with the prime minister and his top team assembling for a COBRA emergency meeting as tensions escalate with Moscow. Keir Giles, a Russia expert, author and senior consulting fellow at the Chatham House think tank, is playing the part of the Russian president. He leads the Russia team, made up of fellow experts. The British side has little idea about what is about to unfold, but they are about to find out. \"Ordinarily when this red team gets together, and we have done this before, we run rings around the opposition, partly because Russia has the initiative, partly because Russia has the tools, partly because Russia has the will and the determination to cause damage sometimes in ways that the opposition - whether it's the UK, NATO, another victim - doesn't imagine before the game actually starts,\" Mr Giles said. The scenario was devised and overseen by Rob Johnson, director of the Changing Character of War Centre at Oxford University and a former director of net assessment and challenge at the Ministry of Defence. \"We are trying to raise awareness through this war game to say, look, let's have a look at what might happen,\" he said. \"Unlikely and low probability though it is, so that we can start to put some measures in place and remind ourselves about how we used to do it - use history as our weapon, if you like, in that regard.\" He describes the events in his game as very low likelihood but high impact. That means a low chance of it happening but catastrophic consequences if it did. The Wargame is an exclusive collaboration between Sky News and Tortoise Media, now the new owners of The Observer. The first two episodes will premiere at 00.01 on 10 June across all Sky News platforms. Episodes three and four will follow on Tuesday 17 June, with the final episode airing Tuesday 24 June. The release comes as the UK government prepares to publish its Strategic Defence Review and as Britain and its allies prepare to meet for a major NATO summit next month."
    },
    {
        "title": "Cassie's mum describes Diddy's sex tape threats - as 'The Punisher' gives testimony",
        "description": "The mother of Cassie Ventura has told a court she felt \"physically sick\" when her daughter told her Sean \"Diddy\" Combs had threatened to \"release two explicit sex tapes\" after discovering his long-time girlfriend was dating someone else. ",
        "url": "https://news.sky.com/story/cassies-mum-describes-diddys-sex-tape-threats-as-the-punisher-gives-testimony-13371804",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-regina-ventura-diddy_6922815.jpg?20250520225922",
        "type": "Home",
        "Author": "Bethany Minelle",
        "Date Published": "2025-05-20 20:47:00",
        "Headline": "During the seventh day of the Sean \"Diddy\" Combs trial, the court heard of his explicit sex tape threats to Cassie when he discovered she was dating rapper Kid Cudi, and a male escort called \"The Punisher\" stepped on to the stand.  ",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n The mother of Cassie Ventura has told a court she felt \"physically sick\" when her daughter told her Sean \"Diddy\" Combs had threatened to \"release two explicit sex tapes\" after discovering his long-time girlfriend was dating someone else.  Giving evidence on Tuesday, the seventh day of the trial, Regina Ventura said she did not initially understand the email Cassie sent her in December 2011, saying, \"The sex tape threw me, [Diddy] was trying to hurt my daughter.\" The email said Combs was planning to release two explicit videos of her and send someone to hurt her and the man she was seeing, rapper Kid Cudi, whose real name is Scott Mescudi. Regina said the family took out a home equity loan and paid Diddy $20,000 to recoup money he had spent on Cassie \"because he demanded it,\" angry that Cassie was now dating Cudi. She said the money was returned days later. During her evidence, jurors were shown photographs of bruises on Cassie's body Ms Ventura said were taken when her daughter returned home for Christmas in 2011. Regina's time on the stand was fairly brief, as the defence declined the opportunity to question her. \n                  Pop star says Sean 'Diddy' Combs threatened to kill her if she spoke about violence as Cassie's ex-best friend gives evidence\n                 \n                  New York helicopter crash tour company to close immediately, says FAA\n                 \n                  Private plane crash in New York kills ex-college football star Karenna Groff and family\n                 Sean 'Diddy' Combs trial: Day 7 - As it happened Prosecutors say Combs, the founder of Bad Boy Records, forced women to take part in days-long, drug-fuelled sexual performances known as \"Freak Offs\" from 2004 to 2024, facilitated by his large retinue of staff. Combs, 55, has pleaded not guilty. The rapper faces five criminal counts: one count of racketeering conspiracy; two counts of sex trafficking by force, fraud or coercion; and two counts of transportation to engage in prostitution. Last week, the prosecutors' star witness, Cassie Ventura, who dated Combs for over a decade, spent four days giving evidence. Combs's legal team has sought to show jurors that his relationship with Ventura was complicated, and while they acknowledge he was an abusive partner, and had substance issues, they say the sex acts described by the prosecution were consensual. Read more:Everything you need to know about the Sean Combs trialThe rise and fall of Sean 'Diddy' Combs 'Diddy wanted our bodies to shine' A male exotic dancer nicknamed \"The Punisher\" also gave testimony, telling jurors that in the autumn of 2012, Cassie contacted him asking him to \"create a sexy, erotic scene\" Diddy, and using the pseudonym \"Janet\". Sharay Hayes said he went on to have eight to 12 more encounters with the couple, having sex with Cassie, while Diddy watched from a distance. He described the hotel rooms as routinely being dressed with electric candles and sheet-covered furniture, and says Cassie told him not to \"acknowledge\" her husband, and to \"try not to look at him and no communication\". He says Diddy would often wear a cap, and he could not see his face, but he later realised it was the famous rapper. \"The Punisher\" mentioned using a \"considerable amount of baby oil\" during the performances, saying \"[Diddy] wanted us to keep our bodies covered, to shine\". He later described the acts as \"a fetish type thing,\" and while he said he believed Cassie was fully consensual, he also said he \"did occasionally see her sigh or wince\" and said she would frequently look at Diddy \"for cues\". Paid between $1,200 (£900) and $2,000 (£1.500) for each performance, he said he was not called back after struggling to get an erection during one encounter. He said he never saw Diddy use drugs or saw filming during any of the performances. Car park dispute with Suge Knight David James, Diddy's ex-personal assistant, also completed his evidence and testified that he never saw physical violence between Cassie and his former boss. James, who worked for Diddy for two years, said he left Diddy's employment after he realised his \"life was in danger\" following a dispute in a car park with rival record label owner Suge Knight, which culminated in Diddy bringing three handguns to try to find Knight and his entourage. He also detailed an altercation between Diddy and his personal chef, Jourdan Atkinson, and said he refused to file a police report after Diddy told him to say \"Chef Jourdan hit him first\". The final person to give evidence was a special agent responsible for planning the March 2024 raids on Combs's Miami home on Star Island. Steve Gannon showed photos of items taken during the raid, including sex toys, high heels and loaded guns, and explained how an armoured vehicle was used to break down the mansion's front gate to gain entry while the family was away on a trip. Combs has been held in the Metropolitan Detention Center in Brooklyn since September and faces at least 15 years or possibly life in prison if convicted. The trial is set to last for around two months."
    },
    {
        "title": "Three dead and two missing after floods hit southern France - reports",
        "description": "Three people have died after severe thunderstorms caused flooding in the Var region of southeastern France, according to reports.",
        "url": "https://news.sky.com/story/three-dead-and-two-missing-after-floods-hit-southern-france-reports-13371867",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-le-lavandrou_6922835.jpg?20250520235415",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-20 22:43:00",
        "Headline": "Two of those who died were an elderly couple who were in their car as it was swept away by floodwaters in the seaside town of Le Lavandou, France 24 reports.",
        "Content": "Three people have died after severe thunderstorms caused flooding in the Var region of southeastern France, according to reports. The rain has also caused widespread damage as Meteo-France, the country's national weather agency, placed the region under an orange alert for rain, flooding and thunderstorms, French broadcaster BFM TV reported. Two of those who died were an elderly couple who were in their car as it was swept away by floodwaters in the seaside town of Le Lavandou, France 24 reported. Meanwhile, the gendarmerie said around 2.30pm local time (1:30pm UK time) that a person had been found drowned in their vehicle in the commune of Vidauban. Le Lavandou and the commune of Bormes-les-Mimosas were particularly hard hit by the storms. Gil Bernardi, mayor of Le Lavandou, said during a press conference: \"The roads, the bridges, the paving stones, there is no more electricity, water, or wastewater treatment plant. The shock is significant because the phenomenon is truly violent and incomprehensible. \"As we speak, an entire part of the commune is inaccessible.\" \n                  French police investigating series of crypto kidnappings with executives tied up and their fingers cut off\n                 \n                  French actor Gerard Depardieu found guilty of sexually assaulting two women\n                 \n                  French mosque stabbing suspect still at large after killing Muslim worshipper\n                 Power and water outages were also reported in the town of Cavaliere where 250mm of rain fell in the space of one hour. A parking lot collapsed in the town, and dozens of people were rescued, according to the authorities. Around 200 firefighters and 35 gendarmes have reportedly been responding to the floods in Var. Meteo-France had recorded cumulative rainfall exceeding 10cm as of 10am local time."
    },
    {
        "title": "George Wendt, who played Norm in Cheers, dies at age of 76",
        "description": "Actor George Wendt, who played Norm Peterson in the iconic sitcom Cheers, has died at the age of 76.",
        "url": "https://news.sky.com/story/george-wendt-who-played-norm-in-cheers-dies-at-age-of-76-13371602",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-george-wendt-cheers_6922694.jpg?20250520212326",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-20 15:10:00",
        "Headline": "Wendt's character as an affable, beer-loving barfly in Cheers was watched by millions in the 1980s - earning him six consecutive Emmy nominations for best supporting actor.",
        "Content": "Actor George Wendt, who played Norm Peterson in the iconic sitcom Cheers, has died at the age of 76. His family said he died early on Tuesday morning, peacefully in his sleep. \"George was a doting family man, a well-loved friend and confidant to all of those lucky enough to have known him. He will be missed forever,\" the family said in a statement. His character as an affable, beer-loving barfly in Cheers was watched by millions in the 1980s - earning him six consecutive Emmy nominations for best supporting actor. The sitcom was based in a Boston bar \"where everybody knows your name\" - proved true given everyone would shout \"Norm!\" when he walked in. Cheers also starred Ted Danson, Shelley Long, Rhea Perlman, Kelsey Grammer, John Ratzenberger, Kirstie Alley and Woody Harrelson. The show would spin off another success in Frasier and was nominated for 117 Emmy Awards, winning 28 of them. Wendt appeared in all 273 episodes of Cheers - with his regular first line of \"afternoon everybody\" a firm fan favourite. \n                  Cassie's mum describes Diddy's sex tape threats - as 'The Punisher' gives testimony\n                 \n                  The Thick of It creator reveals scene which cabinet ministers say happened in real life \n                 \n                  Sesame Street heading to Netflix after Trump cut PBS funding\n                 He was also a prominent presence on Broadway - appearing on stage in Art, Hairspray and Elf. Before rising to fame, he spent six years in Chicago's renowned Second City improvisation troupe. Read more from Sky News:Inside Diddy's star-studded partiesSesame Street heading to Netflix In an interview with GQ magazine, he revealed he did not have high hopes when he auditioned for the role that would catapult him to fame. \"My agent said: 'It's a small role, honey. It's one line. Actually, it's one word.' The word was 'beer.' \"I was having a hard time believing I was right for the role of 'the guy who looked like he wanted a beer.' \"So I went in, and they said, 'It's too small a role. Why don't you read this other one?' And it was a guy who never left the bar.\" One of nine children, Wendt was born in Chicago and graduated with a degree in economics. He married actress Bernadette Birkett in 1978, who voiced the character of Norm's wife in Cheers but never appeared on screen. They have three children. Wendt's nephew is Jason Sudeikis, who played the lead role in Ted Lasso."
    },
    {
        "title": "Success of the UK-EU trade deal will depend on whether promises are delivered",
        "description": "I have been chewing over some of the main elements of the UK-EU agreement.&#160;",
        "url": "https://news.sky.com/story/success-of-the-uk-eu-trade-deal-will-depend-on-whether-promises-are-delivered-13371468",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-beth-rigby-sir-keir-starmer_6921156.jpg?20250519013458",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-05-20 11:40:00",
        "Headline": "The UK and the EU agreed a new trade deal on Monday - the first since Boris Johnson's Brexit deal in 2020.",
        "Content": "\n          Political editor\n              @BethRigby\n I have been chewing over some of the main elements of the UK-EU agreement.  The reset was big on symbolism as the two sides committed to work together in a new post-Brexit era, and meet formally every year to that end. The acid test is how does this now develop? A key element - and prize for both sides - will be UK access to the EU's €150bn rearmament fund. Politics latest: Starmer says EU deal shows 'Britain is back' In an interview with Sky News on Monday afternoon, chief EU diplomat Kaja Kallas acknowledged the \"wounds of Brexit\" mean some member states might want UK access limited, amid reports the French had argued for UK access to be capped at 15% of the fund. It is fair to say there is a lack of detail around the pact, but Ms Kallas was clear she didn't see this as a zero-sum game. \"We should invest more in European industry,\" she said. \n                  Use of e-gates by British holidaymakers in EU still not guaranteed, minister suggests\n                 \n                  UK-EU deal tips Britain down path towards Swiss-style arrangement\n                 \n                  UK-EU trade deal: What is in the Brexit reset agreement?\n                 \"But we should also cooperate with our outside partners, like the UK is, because we actually need more defence. We need the defence industry to operate faster, so that the procurement times are shorter and the costs go down.\" She also told me that she expects the UK to be accessing the fund before the year is out, stressing the need for rapid European rearmament, would could be presented as a win for the PM.  On the economic side, the UK government says by 2040 the reset will boost the economy by £9bn, an uplift of 0.3% in GDP. To put that into context, the OBR forecasts the Brexit effect on the economy would lead to GDP being 4% lower by 2035 than it would have been otherwise, so this deal is certainly no game-changer. But it can't be, when the PM set red lines as no return to the customs union, single market or freedom of movement. Conservatives say it is a Brexit betrayal, and Sir Keir Starmer has had to give things up. I noticed at the news conference, when European Commission President Ursula von der Leyen talked about fishing rights, the PM looked like he was chewing on a wasp. But it's clear how important this was for the EU. Read more:What is in the UK-EU trade deal?E-gates not guaranteed for British holidaymakers One EU diplomatic source tells me that the shift from the previous five-year deal until 2026 to a 12-year deal until 2038 was \"long enough to lay a foundation of trust for the reset of this relationship\". Equally, the veterinary agreement will mean the UK will have to align with EU standards and be under the jurisdiction of the European Court of Justice (rule-takers not makers). What the PM has done on the veterinary agreement and the defence and security partnership is to fulfil two manifesto promises.  Two others - a deal for touring artists and recognition of professional qualifications - were not in this deal, and the political sensitivity around the youth mobility scheme wanted by the EU was plain to see, with details of any scheme yet to be agreed I think the key to all of it will be the deliverables. Will e-gates kick in for Brits, will lorry queues lessen and trade become easier, will it help with supermarket prices, will the UK get some big defence contracts, will re-linking the UK and EU energy markets (another part of this agreement) help cut bills, can he avoid a youth mobility plan blowing up in his face? Beyond the symbolism of Monday, in some ways, this was a pretty limited agreement in that there is so much still to be ironed out and sorted out, but there is scope for the UK government to build out from this and show voters some concrete wins."
    },
    {
        "title": "Alexander Isak: Newcastle United star describes impact of 'attack' on his home as family of burglars jailed",
        "description": "A family of burglars who raided the home of Premier League footballer Alexander Isak have been jailed.",
        "url": "https://news.sky.com/story/alexander-isak-newcastle-united-star-describes-impact-of-attack-on-his-home-as-family-of-burglars-jailed-13371642",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-alexander-isak_6860646.jpg?20250318194329",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-20 16:05:00",
        "Headline": "The Premier League footballer says he has been left with a \"sense of unease\" after the burglars stole his car, jewellery worth £68,000 and up to £10,000 in cash.",
        "Content": "A family of burglars who raided the home of Premier League footballer Alexander Isak have been jailed. Newcastle Crown Court heard they stole the Newcastle United striker's car, jewellery worth £68,000 and up to £10,000 in cash on 4 April 2024. They were also convicted of burgling two other properties in the Tyneside area, stealing designer goods and other valuables worth more than £1.1m. Valentino Nikolov, 32, and his brother Giacomo Nikolov, 28, along with Jela Jovanovic, 43, and her son Charlie Jovanovic, 23, were jailed for between six and 10 years. The court heard the gang had travelled from Italy to the UK last year to commit their burglaries. The three men carried out the raids, wearing gloves and masks, while Jela Jovanovic waited outside in a getaway car. Prosecutor Dan Cordey said mobile phone evidence showed the gang had been carrying out \"surveillance\" at the Newcastle United training ground in the days leading up to the break-in \"to establish movements to and from\" the facility. Isak was not at his home in Darras Hall, Northumberland, when the gang broke in. In a victim impact statement read in court, Mr Isak said: \"None of the property stolen from my home was ever recovered. The attack on my home has left me with a sense of unease and I fear it could reoccur.\" Read more from Sky News:Girl who drowned was unlawfully killedSuspect in court over beach stabbingShouts of 'genocide' in Commons Isak, a Sweden international, moved to Newcastle United from Real Sociedad for a reported fee of £63m in 2022, helping the club win the League Cup in March - their first domestic trophy in 70 years.  The court heard the gang broke into Isak's home through a glass door and carried out an \"untidy search\" of the property, taking cash, jewellery and an Audi RS6 estate car, which a member of the public later found abandoned. Isak told detectives he kept cash in bags upstairs, made up of notes of varying denominations as well as coins, and the amount taken was between £5,000 and £10,000. He said bespoke men's jewellery from Frost of London worth about £68,000 - made up of bracelets, necklaces and rings - was taken. A statement from Glenn Patterson, a player liaison officer at Newcastle United, said a spate of burglaries and attempted burglaries had forced the club to conduct an extensive review of player safety. They invested in monitored alarm systems and recruited private security patrols \"to allay players' fears for their families and homes\". Newcastle Crown Court also heard businesswoman Helen McCardle's four-storey home in Jesmond, Newcastle, was one of the other properties burgled by the gang while she was on holiday. The thieves stole designer items including Chanel, Yves Saint Laurent and Louis Vuitton handbags, along with her CBE. Valentino Nikolov was jailed for 10 years, Giacomo Nikolov for eight years, Jela Jovanovic for seven years and two months, and Charlie Jovanovic for six years and nine months. Judge Robert Spragg said the sentences mean the defendants meet the Home Office criteria for automatic deportation. Giacomo Nikolov, Jela Jovanovic and Charlie Jovanovic pleaded guilty to conspiracy to commit burglary. Valentino Nikolov was found guilty of the same offence after a trial in March."
    },
    {
        "title": "Shouts of 'genocide' in Commons as David Lammy denounces Israel's 'intolerable' actions in Gaza",
        "description": "The foreign secretary has denounced Israel's actions in Gaza as \"intolerable\" but stopped short of saying it had committed genocide.",
        "url": "https://news.sky.com/story/shouts-of-genocide-in-commons-as-david-lammy-denounces-israels-intolerable-actions-in-gaza-13371496",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-david-lammy-gaza-israel_6922347.jpg?20250520144118",
        "type": "UK",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-05-20 12:31:00",
        "Headline": "The foreign secretary condemns Israel's latest actions in Gaza as \"monstrous\" and \"dangerous\" - but stops short of saying it had committed genocide.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  The foreign secretary has denounced Israel's actions in Gaza as \"intolerable\" but stopped short of saying it had committed genocide. MPs could be heard shouting \"genocide\" in the Commons chamber as David Lammy announced the government was suspending its trade negotiations with Israel and summoning Tzipi Hotovely, Israel's ambassador to the UK, to the Foreign Office. The UK has also sanctioned a number of individuals and groups in the West Bank which it says have been linked with acts of violence against Palestinians - including Daniella Weiss, a leading settler activist who was the subject of Louis Theroux's recent documentary The Settlers. Politics latest: Starmer says sorry for being 'overly rude' at PMQs Israel immediately criticised the UK government actions as \"regrettable\" and said the free trade agreement talks, which ministers have now backed out of, were \"not being advanced at all by the UK government\". Oren Marmorstein, a spokesperson for the Israeli foreign affairs ministry, said: \"If, due to anti-Israel obsession and domestic political considerations, the British government is willing to harm the British economy - that is its own prerogative.\" Mr Lammy's intervention came in response to Israel ramping up its latest military offensive in Gaza and its decision to limit the amount of aid into the enclave. Tom Fletcher, head of the UN Office for the Coordination of Humanitarian Affairs, accused Israel of \"deliberately and unashamedly\" imposing inhumane conditions on Palestinians by blocking aid from entering Gaza more than 10 weeks ago. He also told the UN's security council last week that it must \"act now\" to \"prevent genocide\" - a claim that Israel has vehemently denied.  Speaking in the Commons, the foreign secretary said the threat of starvation was \"hanging over hundreds of thousands of civilians\" and that the 11-week blockade stopping humanitarian aid reaching Gaza was \"indefensible and cruel\". Israeli Prime Minister Benjamin Netanyahu has agreed to allow a limited amount of aid into the besieged enclave in response to global concern at reports of famine. Mr Lammy said Mr Netanyahu's govenrment was \"isolating Israel from its friends and partners around the world, undermining the interests of the Israeli people and damaging the image of the state of Israel in the eyes of the world\". \"We are now entering a dark new phase in this conflict,\" Mr Lammy added. \"Netanyahu's government is planning to drive Gazans from their homes into a corner of the strip to the south and permit them a fraction of the aid that they need.\" Referring to one of the far-right ministers in Mr Netanyahu's government, he said Bezalel Smotrich \"even spoke of Israeli forces cleansing Gaza, destroying what's left of residents, Palestinians being relocated, he said, to third countries\".  MPs from across the house shouted \"genocide\" as Mr Lammy said: \"We must call this what it is. It is extremism. It is dangerous. It is repellent. It is monstrous and I condemn it in the strongest possible terms.\" In the Commons, a number of Labour MPs urged the government to go further against Israel. Yasmin Qureshi, the Labour MP for Bolton South and Walkden, said there needed to be a \"full arms embargo\" and said: \"Can I ask the foreign secretary what additional steps he's going to be taking in order to stave off this genocide?\" Another Labour MP told Sky News that while the statement was \"better than previously...without a concrete timeline and a sanctioning of responsible ministers, it's hard to know what tangible difference it will make.\" Read more:British surgeon in Gaza says it is now 'a slaughterhouse'Gaza at mercy of what comes next - analysisHow Israel has escalated Gaza bombing campaign Israeli officials have said its plans to seize all of Gaza and hold it indefinitely. - which would move the civilian population southward - will help it achieve its aim of defeating Hamas. Israel also believes the offensive will prevent Hamas from looting and distributing humanitarian aid, which it says strengthens the group's rule in Gaza. Mr Netanyahu has defended Israel's actions in Gaza and reacted angrily to a joint statement penned by the leaders of the UK, France and Canada, in which they urged Israel to end its military offensive in Gaza and lift restrictions on humanitarian aid allowed into the enclave. The Israeli prime minister said: \"By asking Israel to end a defensive war for our survival before Hamas terrorists on our border are destroyed and by demanding a Palestinian state, the leaders in London, Ottawa and Paris are offering a huge prize for the genocidal attack on Israel on October 7 while inviting more such atrocities. \"No nation can be expected to accept anything less and Israel certainly won't. This is a war of civilisation over barbarism. Israel will continue to defend itself by just means until total victory is achieved.\""
    },
    {
        "title": "'Khan Younis looks like Stalingrad': British doctor in Gaza describes horror - and has message for world leaders",
        "description": "A British doctor working in Gaza has urged world leaders to \"stop talking and do something\" as he described how people are starving and the \"massive extent of destruction\".",
        "url": "https://news.sky.com/story/british-doctor-in-gaza-describes-horror-as-people-starve-and-tells-world-leaders-to-do-something-13371730",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-khan-younis_6922670.jpg?20250520204423",
        "type": "UK",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-05-20 18:20:00",
        "Headline": "Dr Tom Potokar, who is part of a group of British specialist doctors working in Khan Younis, says it is \"horrific\" as patients are malnourished - and children are suffering the worst.",
        "Content": "\n          Middle East correspondent\n              @AliBunkallSKY\n  A British doctor working in Gaza has urged world leaders to \"stop talking and do something\" as he described how people are starving and the \"massive extent of destruction\". Dr Tom Potokar - who has compared Gaza to a \"slaugherhouse\" because of the bombardment by Israeli forces - is part of a group of British specialist doctors and surgeons currently working in Khan Younis. Gaza latest: UK halts trade talks with Israel Sky News spent two days filming with them in Nasser and Amal hospitals - two of the last functioning hospitals in southern Gaza. They are plastic surgeons and orthopaedic specialists. The operating theatres are a rare zone of calm as the medics work with the war outside and a constant stream of wounded needing urgent treatment. All the patients are malnourished. Children are suffering the worst. The lack of food and water has made them weak and more vulnerable to their injuries. Hospitals in Gaza have repeatedly come under attack during the war. The Israel Defense Forces (IDF) claims Hamas has been hiding in them or in tunnels underneath. Nasser hospital hasn't escaped. The burns unit was one of the busiest parts of the hospital, until it was destroyed in an airstrike. The doctors sleep and spend downtime in small living quarters within the hospital itself. Food is one ready meal a day, only 400 calories. The 11-week blockade is affecting everyone. Dr Potokar was working in the European hospital on the western edge of Khan Younis but had to evacuate last week when it came under missile fire and had to close. He went to Amal hospital next to Nasser and is working again. He says he's seen a dramatic change since he was last in Gaza shortly after the Hamas attack on 7 October 2023.  \"The difference this time I think is the intensity,\" he says. \"Back in October to December '23 was the last time I was here, there was a lot of wounded, and it was very intense as well. \"I think the difference this time is because of the blockade there's so little stuff getting in, there's no food getting in so people are starving, there's very little medical supplies coming in but also the other very noticeable thing is the massive extent of destruction - I mean Khan Younis looks like Stalingrad.\"  Speaking about what he has witnessed in Gaza, Dr Potokar added: \"What can you say, it's horrific, it's a slaughterhouse. That's what it is, it's a slaughterhouse.\" He also urged world leaders to \"stop talking and do something\". Read more:What aid has entered Gaza and where is it going?Dad wrongly pronounced dead in 2014 is killed in airstrike The United Nations says 100 aid trucks were cleared for entry into Gaza on Tuesday, but Tom Fletcher, a former British diplomat who now heads the UN Office for the Coordination of Humanitarian Affairs, warned that 14,000 babies could die in the next 48 hours if they don't receive urgent aid. On Monday evening, the IDF-declared combat zone was only a few streets from the Nasser hospital. Drones flew low overhead through the day.  \"An evacuation order for most of Khan Younis went out today, which meant we lost several members of the team,\" said Dr Victoria Rose, a plastic surgeon. \"My anaesthetic nurse and Graeme's orthopaedic colleague had to leave us mid-case to go and evacuate their families to an area of safety.\" Dr Graeme Groom added: \"These are people just like you and me, they have their homes, their families, they live normal lives, many are very impressive people and without notice they have to pick up a grab bag and leave… look for food, look for water, look for shelter, but turn up at work each day.\" With the Israeli military operation getting closer, the doctors are also prepared to evacuate at short notice. Essential supplies have been gathered and packed ready in a storeroom. But Nasser hospital has the last remaining ICU department in the whole of southern Gaza - one of only two with a working oxygen supply. If it must be evacuated, then the remaining temporary field hospitals would likely be overwhelmed and unable to cope."
    },
    {
        "title": "Revealed: Why Keir Starmer's strategy to tackle Reform UK could end up backfiring",
        "description": "Has Labour got the right strategy to tackle Reform UK?",
        "url": "https://news.sky.com/story/revealed-why-keir-starmers-strategy-to-tackle-reform-uk-could-end-up-backfiring-13371866",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-keir-starmer-labour_6922820.jpg?20250520230945",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-05-20 21:44:00",
        "Headline": "Nigel Farage's party is a threat to Labour MPs. But the PM's attempts to win round Reform voters could cause his own supporters to back someone else.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Has Labour got the right strategy to tackle Reform UK? Nigel Farage's party cost the Tories dozens, maybe 100-plus seats at the general election. Now it looks like the party is hitting Labour too. But has Sir Keir Starmer got the right answers? Last year, Labour won a landslide because the Tory vote collapsed, in part because Reform UK took chunks of their supporters in constituencies across the UK. And here is the situation on 1 May this year - the national equivalent vote share at the council elections put Reform well ahead in first place. Success - this time at the expense of Labour too. How big a threat is this to MPs? As a very crude experiment, Sky News has looked at what would happen if this result was replicated evenly across parliamentary constituencies. Within the areas where there were county council elections are 77 complete Westminster seats with sitting Labour MPs. This includes places like Wycombe, where Treasury minister Emma Reynolds holds. Or Lincoln, won by Foreign Office minister Hamish Falconer. \n                  Plans to spend millions on 'forgotten neighbourhoods' - could yours be one of them?\n                 \n                  Who PM was really trying to echo with 'island of strangers' speech\n                 \n                  Civil service relocation and AI officials at heart of government cost cutting measures\n                 Now if - for fun - we mapped the country council results from 1 May evenly across these general election constituencies, almost all those Labour seats are gone. All lost, apart from five. That's 72 out of 77 Labour MPs losing their seats and mostly to Reform UK. What if we took that swing an applied across the whole country, places where there weren't local elections? Angela Rayner in Greater Manchester and Jess Phillips in Birmingham would lose their seats. Yes this is a crude measure - it assumes a uniform swing can be drawn from the 1 May polls - and local and national elections are very different. But importantly, YouGov's latest national opinion polls paint a similar picture to the council elections. Meanwhile, 89 out of 98 constituencies where Reform came second place have Labour in first. Labour MPs are feeling the heat from Farage. The Reform threat is real. Sir Keir Starmer knows it - and this year has started chasing Reform votes. Slashing aid spending. Abandoning green promises. Hard talk about immigration and living on an \"Island of Strangers\". Sensible given the clear and evident Reform UK threat? Actually - maybe not. Look at the data in detail: This block here is all the people who voted Labour in last year's general election. Now thanks to YouGov polling, we know what people in this block would do with their vote now. It shows Labour has lost more than half of last year's voters. Just 46% still say they'd still vote for Sir Keir's party. But - despite the PM's strategy - they're not actually going to Reform in large numbers. Just 6% of Labour's voters at last year's general election - six out of every 100 - said they would vote Reform now. That's all. So where have they gone? Well, they've been lost much more to liberal and left-wing parties - 12% to the Lib Dems, 9% to the Greens. So just pause there. That means the number of Labour voters who have switched to the Lib Dems and Greens, arguably on the left of the political spectrum, is three times the number going to Reform to the right. Just 2% go to the Tories. And much more seriously for Labour, 22% aren't going to vote, don't know or won't say. The bottom line is people who voted Reform have never backed Labour in large numbers. This shows how Reform supporters last year voted in each election since 2005. You can see - Reform voters are former UKIP voters. They're Boris Johnson's Tories. Let's put it another way. While 11% of Labour voters may one day be open to voting Reform, 70% are at risk of going to the Lib Dems or Greens - seven times the threat from Reform. And typically, these voters don't like the hard line, Reform-leaning policies of Sir Keir Starmer recently. The local elections show there is a threat to Labour from Reform. But our data suggests Keir Starmer trying to be Nigel Farage lite isn't the answer. Is Labour's strategy really working?"
    },
    {
        "title": "Kyra Hill: Girl, 11, who drowned at Liquid Leisure waterpark was unlawfully killed, coroner finds",
        "description": "An 11-year-old girl who drowned at a waterpark was unlawfully killed, a coroner has found.",
        "url": "https://news.sky.com/story/girl-11-unlawfully-killed-after-she-drowned-at-waterpark-inquest-rules-13371361",
        "image_url": "https://e3.365dm.com/22/08/1920x1080/skynews-kyra-hill-collect_5872761.jpg?20250520101524",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-20 09:08:00",
        "Headline": "Kyra Hill died after getting into difficulty in a designated swimming area at the waterpark near Windsor, Berkshire, in August 2022.",
        "Content": " An 11-year-old girl who drowned at a waterpark was unlawfully killed, a coroner has found. Kyra Hill died after getting into difficulty in a designated swimming area at Liquid Leisure near Windsor in Berkshire while attending a birthday party on 6 August 2022. Senior coroner Heidi Connor ruled there were gross breaches of health and safety measures at the park which contributed to her death. The breaches related to the depth and visibility of the water and the absence of an emergency plan and risk assessment, she found. An inquest at Berkshire Coroner's Court heard how the schoolgirl was found more than an hour after emergency services were alerted and was taken to hospital, where she was pronounced dead. The inquest heard there were no signs warning of deep water at the leisure park. Despite various sharp drops of up to 4.5m (14.7ft) within the swimming zone, the only signs relating to depth said \"danger shallow water\". The lake where Kyra was seen going under was 2.68m (8.8ft) deep, a report carried out after the incident found. Liquid Leisure said in a statement after the inquest that the incident took place in the \"designated swimming area of our lake, which always had a fully trained Royal Life Saving Society (RLSS) lifeguard on duty\". A 17-year-old lifeguard managed to reach the point where Kyra disappeared but staff at the centre were only qualified to perform \"surface-water rescues\" - not underwater ones. The inquest heard evidence of how there was a 10-minute gap between the first and second searches for the youngster in that part of the lake. Although a manager attended rapidly, 37 minutes passed between Kyra struggling and 999 being called. The frantic search was likened to a \"nightmare\" by a mother attending the birthday party, while a police officer described it as a \"chaotic scene\" due to \"conflicting\" information being fed to the emergency crews. The diver who eventually found Kyra told the inquest the lake had \"almost zero visibility\". Parents and carers were not advised to attend with children in a ratio of one to four, and young children were permitted to swim without buoyancy aids, the coroner said. There was also no emergency plan or risk assessment that took those factors into account, and no control measures were identified and put in place to \"take account of these clear risks\", she added. A post-mortem examination confirmed Kyra's cause of death as \"drowning\". Read more from Sky News:People smuggler jailed for role in £12m operationFamily pay tribute to 'hero' firefighter killed in blaze Giving her conclusions, Ms Connor said: \"Members of the family, at no point have I forgotten that this was about your 11-year-old, Kyra, and I am so very sorry that you are here today. \"It must have been incredibly difficult to sit in court and hear some of the evidence that we've heard. I offer all of you my heartfelt condolences.\"  'She should have been saved' In an interview with Sky News presenter Sarah-Jane Mee after the inquest, Kyra's father Leonard Hill remembered the moment he received a call to be told his daughter was missing. He said: \"It's the most disturbing phone call I have ever received in my life... that Kyra is underwater, Kyra is missing. \"My immediate response is that there is no way she would have gone off... she would never have walked off and left her group.\" Mr Hill continued: \"To hear that your daughter is underwater, you're searching online 'how long can somebody survive underwater?'. \"You can see that within 10 minutes they can potentially come out brain damaged, but there is still a chance of survival. \"I remain of the stance that she could have been saved, and she should have been saved, and had Liquid Leisure had emergency plans in place, Kyra would have been saved.\" Mr Hill had earlier said outside court after the inquest: \"Summer should be a time of joy in creating happy memories with family and friends. \"It should never end in tragedy. It should never mark the day we mourn our children's lives, lost in places where they should have been safe. \"The terrible reality is that without urgent reform, more families will face these devastating goodbyes.\" Mr Hill described Kyra's life as a \"shining example of resilience and strength\". The youngster was a Manchester United fan and dreamed of becoming a professional footballer, with a back-up plan to pursue law.  Mr Hill added: \"Her memory demands that we demand safer standards now. No parent should endure this pain and no child's life should be sacrificed so recklessly. \"We must act today for Kyra and for every family that visits these leisure parks tomorrow. \"The time for words has passed. Now is the moment for action.\" At the time of the incident, Mr Hill told Sky News Kyra was \"left to drown\" and accused the operator of \"neglect\". Liquid Leisure has said in a statement: \"Everyone at Liquid Leisure was heartbroken by the tragic incident on August 6 2022 and our thoughts remain with Kyra's family and all those affected. \"The incident took place in the designated swimming area of our lake, which always had a fully trained Royal Life Saving Society (RLSS) lifeguard on duty. We have fully cooperated throughout the investigation, the subsequent criminal process, as well as the inquest. The designated swimming area was subsequently closed and we took the decision not to reopen that activity.\" The statement continues: \"Whilst we acknowledge the conclusions reached by the coroner, nothing is more important to us than the safety of our visitors.\""
    },
    {
        "title": "Student, 23, who lost all four limbs to sepsis calls on people to get meningitis vaccine",
        "description": "A medical student who lost all four limbs due to sepsis has called on people to get the meningitis vaccine to help prevent them going through a similar ordeal.",
        "url": "https://news.sky.com/story/student-23-who-lost-all-four-limbs-to-sepsis-calls-on-people-to-get-meningitis-vaccine-13371788",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-lily-mcgarry_6922797.jpg?20250520224335",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-20 20:06:00",
        "Headline": "Lily McGarry was rushed to hospital with flu-like symptoms in January before her condition rapidly worsened and she went into septic shock.",
        "Content": " A medical student who lost all four limbs due to sepsis has called on people to get the meningitis vaccine to help prevent them going through a similar ordeal. Lily McGarry was rushed to the University Hospital of Wales in Cardiff with flu-like symptoms in January before her condition rapidly worsened and she went into septic shock. The 23-year-old was diagnosed with meningococcal septicaemia, a type of blood poisoning caused by the same kind of bacteria that causes the most common form of bacterial meningitis. Ms McGarry, who is originally from Jersey but was studying in Cardiff, survived two cardiac arrests before spending a fortnight in a coma and more than 100 days in intensive care. The infection caused severe blood flow issues in her body and, as a result, she had to undergo surgery to amputate all four of her limbs at the Morriston Hospital in Swansea. As the Cardiff University student begins her rehabilitation, her father Stuart McGarry told The UK Tonight with Sarah-Jane Mee his daughter now wants people to have the meningitis vaccine to help prevent protect them against meningococcal septicaemia. Mr McGarry said: \"(Lily) wants to get the message out to everyone. The (meningitis) vaccination rate post-COVID for children has dropped off significantly. She just wanted to get the message over to get vaccinated. \"I mean, obviously, Lily proves that it doesn't work for 100% of the people 100% of the time. \"But the meningitis vaccination programme in the UK has been phenomenally successful... some of the staff at Cardiff hospital hadn't seen a case like Lily for 10 years. So it's proven it's effective. It works. Get it.\" 'Difficult conversations' Mr McGarry was in Jersey when he received the call from the hospital to say his daughter was unwell. \"It's the call that no father wants really,\" he said. \"They said that I should come over to Cardiff, that Lily was really unwell, and I said, 'I'll pack a bag and get a flight tomorrow' and the nurse said 'no, you should be here now'. \"Her mum was in Australia when she received the call - so she would have had the flight from hell to come back all the way from Australia to Cardiff.\" Mr McGarry said he later had to have a lot of \"very difficult conversations\" with NHS staff about what would happen to his daughter's limbs - with doctors telling him that both of her arms and legs would have to be amputated. \"She's out of intensive care now after 113 days, she is in the rehabilitation section,\" Mr McGarry said. \"The narrative has changed to the body that she has got and what she can do with that. \"I had a wobble for a couple of weeks when I was in front of her and was tearful... she looked me in the eye and she said, 'Dad, I will make the best of my stumps'. \"And she owned the word 'stumps'... from that I got a lot of strength because I thought, 'my God, I think she's got this'.\" Read more from Sky News:Girl 'unlawfully killed' at waterparkFamily pay tribute to 'hero' firefighter A GoFundMe account set up to help raise money for prosthetic limbs for Ms McGarry had raised more than £370,000 as of Tuesday night. Mr McGarry said: \"People have been very generous. So there's that. And that will give Lily that choice down the road. \"At the moment, though, we're focused more on the present - the small steps... getting her wounds to heal. \"The prosthetics - she's trying now, with just little ones on her arms, just to give her a little bit more independence, which is something she craves.\" Mr McGarry described his daughter as \"a delight\", saying: \"We went on a walking holiday in the Swiss Alps last year. She was very happy to go walking around, looking at the wonder and the majesty of the Alps, having a nice gooey Swiss fondue and a couple of pints with her dad - it just doesn't get better. \"She's the best person I know. She's my daughter.\""
    },
    {
        "title": "The Thick of It creator reveals scene which cabinet ministers say happened in real life ",
        "description": "The creator of the hit political satire The Thick of It has revealed which scene in the series cabinet ministers have confessed to experiencing in real life. ",
        "url": "https://news.sky.com/story/the-thick-of-it-creator-reveals-scene-which-cabinet-ministers-say-happened-in-real-life-13371810",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-armando-iannucci-the-thick-of-it_6922817.jpg?20250520230117",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-20 22:10:00",
        "Headline": "The Thick of It aired 20 years ago this month and satirised the inner workings of modern British government - but although scenes were made up, they were close to the bone, the show's creator tells Sky News' Electoral Dysfunction podcast. ",
        "Content": " The creator of the hit political satire The Thick of It has revealed which scene in the series cabinet ministers have confessed to experiencing in real life.  Armando Iannucci told Sky News' Electoral Dysfunction live event with Beth Rigby that the writers would make up scenarios to be \"as stupid as they can\" - only to be asked later by Whitehall officials how they had found out about it. One episode in particular that was close to the bone involves Malcolm Tucker, the fictional mouthy communications director of Number 10, telling a cabinet minister the policy he is due to announce to the media is being cancelled because it is too expensive - and he will have to come up with another one on the spot. Mr Iannucci said: \"Sometimes we would come up with stories that were like, we had to invent them, you know, and we thought, let's push it as stupidly as we can. \"And then a couple of weeks later, someone from Whitehall would say, 'how did you find out exactly? We thought we'd kept that very quiet'. \"And you know, the opening episode has them in the back of a car trying to come up with a policy. Malcolm's rung up and said the policy you've called the press to hear, you cannot go ahead, It's too expensive. \"So they've got to come up with a policy that sounds great but will cost nothing. And I've had various former cabinet members say to me quietly, 'I've been in the back of that car'.\" \n                  Caught up in the crossfire: Reporting from an urban war zone\n                 \n                  Starmer's UK-EU deal: What does it mean for you?\n                 \n                  Trump's gift: Why is Air Force One so important to the president?\n                 The Thick of It aired 20 years ago this month, when New Labour was in government. It satirised the inner workings of modern British government, with the focus on the fictitious Department of Social Affairs and Citizenship. Harriet Harman, one of the few senior female figures at the time and now a peer and co-host of Electoral Dysfunction, asked Mr Iannucci if anyone inspired the character Nicola Murray, who was the focus of series three. \"I'm asking for a friend, because basically it's like she was so ineffective, but she was so hard working and a nice person. Yes, but she was utterly destroyed by Number 10 and her ministerial colleagues putting the boot in. \"I just wondered if she was based on anyone in particular?\". Mr Iannucci said everyone in The Thick Of It was \"based either on a composite of different things we've heard in different people or on a kind of guesstimate of what this person might be\"."
    },
    {
        "title": "'World-first' gonorrhoea vaccine programme approved for England, amid record number of cases",
        "description": "A vaccine programme for gonorrhoea is being rolled out across England from August amid a record number of cases and increasing antibiotic resistant strains of the bacteria.",
        "url": "https://news.sky.com/story/world-first-gonorrhoea-vaccine-programme-approved-for-england-amid-record-number-of-cases-13371529",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-neisseria-gonorrhoeae_6922329.jpg?20250520142910",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-20 13:09:00",
        "Headline": "The initiative has been described as a \"significant breakthrough for public health\" and will use an existing vaccine, 4CMenB, which also protects against meningococcal B disease.",
        "Content": "A vaccine programme for gonorrhoea is being rolled out across England from August amid a record number of cases and increasing antibiotic resistant strains of the bacteria. The aim is to tackle rising levels of the sexually transmitted infection (STI) which reached 85,000 diagnoses in England in 2023, the highest since records began in 1918 and three times more than in 2012. NHS England said eligible patients, including some gay and bisexual men, will start to be offered the vaccine from early August. The government accepted the advice from the Joint Committee on Vaccination and Immunisation (JCVI) which had recommended an NHS roll out. The jab is based on an existing vaccine, 4CMenB, used to protect against meningococcal B disease. However it is between 32.7 to 42% effective against gonorrhoea, which means it will not completely eliminate the potential to get the disease. Analysis led by Imperial College London suggests the jab could prevent up to 100,000 cases of gonorrhoea and save the NHS more than £7.9m over the next decade, depending on the uptake. \n                  'These are needless deaths': Vaccine misinformation will lead to more deaths from measles outbreak, ousted US scientist tells Sky News\n                 \n                  America's top vaccine regulator resigns over anti-vax health secretary Robert F Kennedy Jr\n                 \n                  UK 'not prepared' for another pandemic, warns influential Lords group\n                 Gonorrhoea is the second most common bacterial STI in the UK, according to NHS England and is passed on through sex. Not everyone gets symptoms, but they can include a burning pain when you urinate, fluid or discharge coming out of your genitals and pain in your testicles or lower abdomen in women. It can also affect other parts of the body, including the throat and eyes. Read more:Explainer: Syphilis and gonorrhoea symptomsWarning over soaring rates of STIsGonorrhoea could become 'untreatable' NHS England's national director for primary care and community services Dr Amanda Doyle, described the vaccine programme as a \"huge step forward for sexual health\". Minister for Public Health and Prevention Ashley Dalton said the scheme \"could not come at a more critical time\" because of \"gonorrhoea diagnoses at record levels\". \"By targeting those most at risk, we can reduce transmission rates from this unpleasant disease that is becoming harder to treat and prevent thousands of cases over the next few years,\" he added. Previously, vaccines were only available to eligible people at 19 sites across London, Brighton in East Sussex, and Manchester. Professor Matt Phillips, president of the British Association for Sexual Health and HIV (BASHH), described the programme as \"a landmark moment for sexual health in England\" while Richard Angell, chief executive of Terrence Higgins Trust, called the jab a \"game changer\". Eligible patients will be identified and contacted in the coming weeks, with the vaccine offered through local authority-commissioned sexual health services from 1 August. At the appointment, patients will also be offered jabs for mpox, human papillomavirus (HPV), and hepatitis A and B."
    },
    {
        "title": "Alexander Isak: Newcastle United star describes impact of 'attack' on his home as family of burglars jailed",
        "description": "A family of burglars who raided the home of Premier League footballer Alexander Isak have been jailed.",
        "url": "https://news.sky.com/story/alexander-isak-newcastle-united-star-describes-impact-of-attack-on-his-home-as-family-of-burglars-jailed-13371642",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-alexander-isak_6860646.jpg?20250318194329",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-20 16:05:00",
        "Headline": "The Premier League footballer says he has been left with a \"sense of unease\" after the burglars stole his car, jewellery worth £68,000 and up to £10,000 in cash.",
        "Content": "A family of burglars who raided the home of Premier League footballer Alexander Isak have been jailed. Newcastle Crown Court heard they stole the Newcastle United striker's car, jewellery worth £68,000 and up to £10,000 in cash on 4 April 2024. They were also convicted of burgling two other properties in the Tyneside area, stealing designer goods and other valuables worth more than £1.1m. Valentino Nikolov, 32, and his brother Giacomo Nikolov, 28, along with Jela Jovanovic, 43, and her son Charlie Jovanovic, 23, were jailed for between six and 10 years. The court heard the gang had travelled from Italy to the UK last year to commit their burglaries. The three men carried out the raids, wearing gloves and masks, while Jela Jovanovic waited outside in a getaway car. Prosecutor Dan Cordey said mobile phone evidence showed the gang had been carrying out \"surveillance\" at the Newcastle United training ground in the days leading up to the break-in \"to establish movements to and from\" the facility. Isak was not at his home in Darras Hall, Northumberland, when the gang broke in. In a victim impact statement read in court, Mr Isak said: \"None of the property stolen from my home was ever recovered. The attack on my home has left me with a sense of unease and I fear it could reoccur.\" Read more from Sky News:Girl who drowned was unlawfully killedSuspect in court over beach stabbingShouts of 'genocide' in Commons Isak, a Sweden international, moved to Newcastle United from Real Sociedad for a reported fee of £63m in 2022, helping the club win the League Cup in March - their first domestic trophy in 70 years.  The court heard the gang broke into Isak's home through a glass door and carried out an \"untidy search\" of the property, taking cash, jewellery and an Audi RS6 estate car, which a member of the public later found abandoned. Isak told detectives he kept cash in bags upstairs, made up of notes of varying denominations as well as coins, and the amount taken was between £5,000 and £10,000. He said bespoke men's jewellery from Frost of London worth about £68,000 - made up of bracelets, necklaces and rings - was taken. A statement from Glenn Patterson, a player liaison officer at Newcastle United, said a spate of burglaries and attempted burglaries had forced the club to conduct an extensive review of player safety. They invested in monitored alarm systems and recruited private security patrols \"to allay players' fears for their families and homes\". Newcastle Crown Court also heard businesswoman Helen McCardle's four-storey home in Jesmond, Newcastle, was one of the other properties burgled by the gang while she was on holiday. The thieves stole designer items including Chanel, Yves Saint Laurent and Louis Vuitton handbags, along with her CBE. Valentino Nikolov was jailed for 10 years, Giacomo Nikolov for eight years, Jela Jovanovic for seven years and two months, and Charlie Jovanovic for six years and nine months. Judge Robert Spragg said the sentences mean the defendants meet the Home Office criteria for automatic deportation. Giacomo Nikolov, Jela Jovanovic and Charlie Jovanovic pleaded guilty to conspiracy to commit burglary. Valentino Nikolov was found guilty of the same offence after a trial in March."
    },
    {
        "title": "Thames Water drops £1m bonuses for top bosses after government criticism",
        "description": "Thames Water has \"withdrawn\" plans to pay senior bosses bonuses linked to the company securing a &#163;3bn emergency loan, the environment secretary has said. ",
        "url": "https://news.sky.com/story/thames-water-drops-1631m-bonuses-for-top-bosses-after-government-criticism-13371746",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-thames-water-maintenance_6777656.jpg?20241216120341",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-20 19:09:00",
        "Headline": "The payments were linked to the struggling firm securing a rescue loan of up to £3bn to stave off collapse earlier this year.",
        "Content": "Thames Water has \"withdrawn\" plans to pay senior bosses bonuses linked to the company securing a £3bn emergency loan, the environment secretary has said.  Steve Reed confirmed the proposals had been dropped during an Environment, Food and Rural Affairs (Efra) committee session with MPs on Tuesday. The so-called retention plan would have amounted to 50% of senior bosses' salaries - leading to them getting £1m on top of their annual salaries and regular bonuses. The payments were linked to the struggling firm securing a rescue loan of up to £3bn to stave off collapse earlier this year. The company's chairman had earlier in the day admitted to incorrectly stating the retention plan was \"insisted upon\" by lenders. Thames Water had been \"trying to circumvent\" upcoming rules that can ban water companies from paying bonuses by \"calling their bonuses something different\", Mr Reed told MPs. \"It was the wrong thing to do,\" he said. \"It offends against their own customers' sense of fair play.\" \n                  I was worth my six-figure bonus, says under-fire Thames Water boss\n                 \n                  Thames Water apologises to customers but defends bonuses\n                 \n                  Thames Water delays request for even more expensive bills as six offers of new investment received\n                 A spokesman for Thames said: \"It has never been the Thames Water board's intention to be at odds with the government's ambition to reform the water industry.\" The company's board \"has decided to pause the retention scheme and await forthcoming guidance from the regulator\" in relation to the new rules, he added. In a letter to the committee, Thames Water's chairman Sir Adrian Montague said he may have \"in the heat of the moment […] misspoken\" when he was quizzed on the firm's turnaround at an Efra session last week. Thames Water is England's biggest water firm, supplying around 16 million households across London and the South East. It has been at the centre of growing public outrage over the extent of pollution and rising bills - which have inched higher while executives have been paid huge bonuses. Read more:'I was worth my bonus,' says Thames Water bossOlympian calls for river clean-ups  New rules from the Water Services Regulations Authority (Ofwat) mean bonus payments to bosses can be banned if companies fail to meet standards to protect the environment, consumers and company finances. It could also block payments funded not just by customer money, but by lenders and shareholders."
    },
    {
        "title": "Success of the UK-EU trade deal will depend on whether promises are delivered",
        "description": "I have been chewing over some of the main elements of the UK-EU agreement.&#160;",
        "url": "https://news.sky.com/story/success-of-the-uk-eu-trade-deal-will-depend-on-whether-promises-are-delivered-13371468",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-beth-rigby-sir-keir-starmer_6921156.jpg?20250519013458",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-05-20 11:40:00",
        "Headline": "The UK and the EU agreed a new trade deal on Monday - the first since Boris Johnson's Brexit deal in 2020.",
        "Content": "\n          Political editor\n              @BethRigby\n I have been chewing over some of the main elements of the UK-EU agreement.  The reset was big on symbolism as the two sides committed to work together in a new post-Brexit era, and meet formally every year to that end. The acid test is how does this now develop? A key element - and prize for both sides - will be UK access to the EU's €150bn rearmament fund. Politics latest: Starmer says EU deal shows 'Britain is back' In an interview with Sky News on Monday afternoon, chief EU diplomat Kaja Kallas acknowledged the \"wounds of Brexit\" mean some member states might want UK access limited, amid reports the French had argued for UK access to be capped at 15% of the fund. It is fair to say there is a lack of detail around the pact, but Ms Kallas was clear she didn't see this as a zero-sum game. \"We should invest more in European industry,\" she said. \n                  Use of e-gates by British holidaymakers in EU still not guaranteed, minister suggests\n                 \n                  UK-EU deal tips Britain down path towards Swiss-style arrangement\n                 \n                  UK-EU trade deal: What is in the Brexit reset agreement?\n                 \"But we should also cooperate with our outside partners, like the UK is, because we actually need more defence. We need the defence industry to operate faster, so that the procurement times are shorter and the costs go down.\" She also told me that she expects the UK to be accessing the fund before the year is out, stressing the need for rapid European rearmament, would could be presented as a win for the PM.  On the economic side, the UK government says by 2040 the reset will boost the economy by £9bn, an uplift of 0.3% in GDP. To put that into context, the OBR forecasts the Brexit effect on the economy would lead to GDP being 4% lower by 2035 than it would have been otherwise, so this deal is certainly no game-changer. But it can't be, when the PM set red lines as no return to the customs union, single market or freedom of movement. Conservatives say it is a Brexit betrayal, and Sir Keir Starmer has had to give things up. I noticed at the news conference, when European Commission President Ursula von der Leyen talked about fishing rights, the PM looked like he was chewing on a wasp. But it's clear how important this was for the EU. Read more:What is in the UK-EU trade deal?E-gates not guaranteed for British holidaymakers One EU diplomatic source tells me that the shift from the previous five-year deal until 2026 to a 12-year deal until 2038 was \"long enough to lay a foundation of trust for the reset of this relationship\". Equally, the veterinary agreement will mean the UK will have to align with EU standards and be under the jurisdiction of the European Court of Justice (rule-takers not makers). What the PM has done on the veterinary agreement and the defence and security partnership is to fulfil two manifesto promises.  Two others - a deal for touring artists and recognition of professional qualifications - were not in this deal, and the political sensitivity around the youth mobility scheme wanted by the EU was plain to see, with details of any scheme yet to be agreed I think the key to all of it will be the deliverables. Will e-gates kick in for Brits, will lorry queues lessen and trade become easier, will it help with supermarket prices, will the UK get some big defence contracts, will re-linking the UK and EU energy markets (another part of this agreement) help cut bills, can he avoid a youth mobility plan blowing up in his face? Beyond the symbolism of Monday, in some ways, this was a pretty limited agreement in that there is so much still to be ironed out and sorted out, but there is scope for the UK government to build out from this and show voters some concrete wins."
    },
    {
        "title": "'Khan Younis looks like Stalingrad': British doctor in Gaza describes horror - and has message for world leaders",
        "description": "A British doctor working in Gaza has urged world leaders to \"stop talking and do something\" as he described how people are starving and the \"massive extent of destruction\".",
        "url": "https://news.sky.com/story/british-doctor-in-gaza-describes-horror-as-people-starve-and-tells-world-leaders-to-do-something-13371730",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-khan-younis_6922670.jpg?20250520204423",
        "type": "World",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-05-20 18:20:00",
        "Headline": "Dr Tom Potokar, who is part of a group of British specialist doctors working in Khan Younis, says it is \"horrific\" as patients are malnourished - and children are suffering the worst.",
        "Content": "\n          Middle East correspondent\n              @AliBunkallSKY\n  A British doctor working in Gaza has urged world leaders to \"stop talking and do something\" as he described how people are starving and the \"massive extent of destruction\". Dr Tom Potokar - who has compared Gaza to a \"slaugherhouse\" because of the bombardment by Israeli forces - is part of a group of British specialist doctors and surgeons currently working in Khan Younis. Gaza latest: UK halts trade talks with Israel Sky News spent two days filming with them in Nasser and Amal hospitals - two of the last functioning hospitals in southern Gaza. They are plastic surgeons and orthopaedic specialists. The operating theatres are a rare zone of calm as the medics work with the war outside and a constant stream of wounded needing urgent treatment. All the patients are malnourished. Children are suffering the worst. The lack of food and water has made them weak and more vulnerable to their injuries. Hospitals in Gaza have repeatedly come under attack during the war. The Israel Defense Forces (IDF) claims Hamas has been hiding in them or in tunnels underneath. Nasser hospital hasn't escaped. The burns unit was one of the busiest parts of the hospital, until it was destroyed in an airstrike. The doctors sleep and spend downtime in small living quarters within the hospital itself. Food is one ready meal a day, only 400 calories. The 11-week blockade is affecting everyone. Dr Potokar was working in the European hospital on the western edge of Khan Younis but had to evacuate last week when it came under missile fire and had to close. He went to Amal hospital next to Nasser and is working again. He says he's seen a dramatic change since he was last in Gaza shortly after the Hamas attack on 7 October 2023.  \"The difference this time I think is the intensity,\" he says. \"Back in October to December '23 was the last time I was here, there was a lot of wounded, and it was very intense as well. \"I think the difference this time is because of the blockade there's so little stuff getting in, there's no food getting in so people are starving, there's very little medical supplies coming in but also the other very noticeable thing is the massive extent of destruction - I mean Khan Younis looks like Stalingrad.\"  Speaking about what he has witnessed in Gaza, Dr Potokar added: \"What can you say, it's horrific, it's a slaughterhouse. That's what it is, it's a slaughterhouse.\" He also urged world leaders to \"stop talking and do something\". Read more:What aid has entered Gaza and where is it going?Dad wrongly pronounced dead in 2014 is killed in airstrike The United Nations says 100 aid trucks were cleared for entry into Gaza on Tuesday, but Tom Fletcher, a former British diplomat who now heads the UN Office for the Coordination of Humanitarian Affairs, warned that 14,000 babies could die in the next 48 hours if they don't receive urgent aid. On Monday evening, the IDF-declared combat zone was only a few streets from the Nasser hospital. Drones flew low overhead through the day.  \"An evacuation order for most of Khan Younis went out today, which meant we lost several members of the team,\" said Dr Victoria Rose, a plastic surgeon. \"My anaesthetic nurse and Graeme's orthopaedic colleague had to leave us mid-case to go and evacuate their families to an area of safety.\" Dr Graeme Groom added: \"These are people just like you and me, they have their homes, their families, they live normal lives, many are very impressive people and without notice they have to pick up a grab bag and leave… look for food, look for water, look for shelter, but turn up at work each day.\" With the Israeli military operation getting closer, the doctors are also prepared to evacuate at short notice. Essential supplies have been gathered and packed ready in a storeroom. But Nasser hospital has the last remaining ICU department in the whole of southern Gaza - one of only two with a working oxygen supply. If it must be evacuated, then the remaining temporary field hospitals would likely be overwhelmed and unable to cope."
    },
    {
        "title": "The Wargame: New Sky News and Tortoise Media podcast series simulates a Russian attack on UK",
        "description": "A top team of former government ministers and military and security chiefs have taken part in a wargame that simulates a Russian attack on the UK for a new podcast series announced on Wednesday by Sky News and Tortoise Media.",
        "url": "https://news.sky.com/story/the-wargame-new-sky-news-and-tortoise-media-podcast-series-simulates-a-russian-attack-on-uk-13371462",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-wargame-podcast-tile_6918416.png?20250516151445",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2025-05-20 11:32:00",
        "Headline": "Former senior politicians, including Sir Ben Wallace, Jack Straw and Amber Rudd, play a fictional British government pitched against an imagined Kremlin.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n A top team of former government ministers and military and security chiefs have taken part in a wargame that simulates a Russian attack on the UK for a new podcast series announced on Wednesday by Sky News and Tortoise Media. Among the line-up, Sir Ben Wallace, a former Conservative defence secretary, plays the prime minister; Jack Straw, a former senior Labour politician, resumes his old job as foreign secretary; Amber Rudd steps back into her former role as home secretary and Jim Murphy, a secretary of state for Scotland under Gordon Brown, takes the position of chancellor. The defence secretary is played by James Heappey, a former armed forces minister. Lord Mark Sedwill is the national security adviser - a position he held for real under both Theresa May and Boris Johnson, while General Sir Richard Barrons, one of the leaders of a major defence review that is due to be published in the coming weeks, plays the role of chief of the defence staff, the UK's top military officer. Baroness Helena Kennedy, a barrister and expert on human rights law, appears as attorney general, while Lieutenant General Sir David Capewell resumes his former role as chief of joint operations, the UK's warfighting commander. 👉Search for The Wargame on your podcast app👈 The scenario is designed to test Britain's defences and national resilience at a time of mounting tensions with Russia. \n                  'Khan Younis looks like Stalingrad': British doctor in Gaza describes horror - and has message for world leaders\n                 \n                  Gaza live: UK halts trade talks with Israel and summons ambassador over 'cruel' Gaza blockade - as UN says no aid has reached Palestinians\n                 \n                  90% of Port-au-Prince controlled by gangs as thousands forced into heaving displacement camps\n                 It also explores the reliability - or otherwise - of key allies like the United States in a crisis. Asked why he wanted to take part in the project, Sir Ben said: \"I think it's really important that we demonstrate to the public how government makes decisions in real crises and emergencies and let them understand and hopefully be reassured that actually there is a process and it's at that moment in time that no matter what people's party politics are, people pull together for the right reasons.\" Launching on 10 June, the five-part podcast series will give listeners the chance to experience the kind of wargame that is genuinely tested inside government. The only difference with this version is that nothing discussed is classified. The tagline for the series is: \"Russia knows our weaknesses - but do you?\" Written and presented by me, The Wargame pitches a fictional British government, led by Sir Ben, against an imagined Kremlin in a high-stakes contest that draws on the real-life knowledge and experience of the cast. The series begins a few months in the future, with the prime minister and his top team assembling for a COBRA emergency meeting as tensions escalate with Moscow. Keir Giles, a Russia expert, author and senior consulting fellow at the Chatham House think tank, is playing the part of the Russian president. He leads the Russia team, made up of fellow experts. The British side has little idea about what is about to unfold, but they are about to find out. \"Ordinarily when this red team gets together, and we have done this before, we run rings around the opposition, partly because Russia has the initiative, partly because Russia has the tools, partly because Russia has the will and the determination to cause damage sometimes in ways that the opposition - whether it's the UK, NATO, another victim - doesn't imagine before the game actually starts,\" Mr Giles said. The scenario was devised and overseen by Rob Johnson, director of the Changing Character of War Centre at Oxford University and a former director of net assessment and challenge at the Ministry of Defence. \"We are trying to raise awareness through this war game to say, look, let's have a look at what might happen,\" he said. \"Unlikely and low probability though it is, so that we can start to put some measures in place and remind ourselves about how we used to do it - use history as our weapon, if you like, in that regard.\" He describes the events in his game as very low likelihood but high impact. That means a low chance of it happening but catastrophic consequences if it did. The Wargame is an exclusive collaboration between Sky News and Tortoise Media, now the new owners of The Observer. The first two episodes will premiere at 00.01 on 10 June across all Sky News platforms. Episodes three and four will follow on Tuesday 17 June, with the final episode airing Tuesday 24 June. The release comes as the UK government prepares to publish its Strategic Defence Review and as Britain and its allies prepare to meet for a major NATO summit next month."
    },
    {
        "title": "Hard-right populist George Simion to contest Romania's election result",
        "description": "Hard-right populist George Simion will contest Romania's presidential election result. ",
        "url": "https://news.sky.com/story/hard-right-populist-george-simion-to-contest-romanias-election-result-sky-news-understands-13371603",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-simion-romania_6922462.jpg?20250520161339",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-20 15:10:00",
        "Headline": "Mr Simion had been the favourite to win but lost to pro-EU candidate Nicusor Dan in the final vote over the weekend. ",
        "Content": "Hard-right populist George Simion will contest Romania's presidential election result.  The 38-year-old had been the favourite to win at the polls - but unexpectedly lost to pro-Western candidate Nicusor Dan over the weekend. Mr Simion now claims to have hard evidence of foreign interference in the vote. He said in a statement: \"We now have irrefutable evidence of meddling by France, Moldova, and other actors, in an orchestrated effort to manipulate institutions, direct media narratives, and ultimately impose a result that does not reflect the sovereign will of the Romanian people.\" In the first round, the Trump supporter took 40.96% of the votes, putting him almost 20 points ahead. But the second round saw Mr Dan, the mayor of Bucharest, end up with 54% of the votes, while Mr Simion secured 46%. A voter turnout of 64.7% in Sunday's ballot, more than in any Romanian election of the past 25 years, is thought to have benefited Mr Dan. Mr Simion has submitted a formal request to Romania's Constitutional Court, calling for it to annul the result. \n                  Romania's new president Nicosur Dan finally looks like he's enjoying life after a campaign full of rancour and division\n                 \n                  Nicusor Dan beats hard-right favourite George Simion in Romanian election\n                 \n                  Romania votes in second round of presidential election - with Bucharest mayor and hard-right Trump supporter almost tied in polls\n                 Mr Dan, a 55-year-old mathematician, ran as an independent candidate and his pledges included a clampdown on rampant corruption and maintaining support for Ukraine. \"We need to build Romania together irrespective of who you voted for,\" he said when his victory was assured. Europe correspondent It's three days since I asked George Simion if he would accept the result if he lost, and he said \"yes\" with the sort of shrug that suggested it was a stupid question. Turns out it was quite a good question, after all. Because Mr Simion has just stated that he won't accept the result, after all. He's alleging the French government tried to limit the amount of his campaign material that appeared on social media, echoing an accusation made by Pavel Durov, the Russian founder of the messaging app Telegram. Durov claimed \"a Western government\" had asked his company \"to silence conservative voices in Romania\" ahead of the election. He added an emoji of a baguette on to his message as a not-too-subtle clue to the government he meant. Durov is enmeshed in a legal row with French authorities. He was arrested by French police in August 2024, facing the allegation that a lack of content moderation on Telegram had allowed criminal activities. He was forced to remain in France until two months ago, when he was allowed to return to his home in Dubai. Simion has now told his followers to only use Telegram, adopting that to be their only form of communication. What this means for Romania is more turmoil and more rancour. Nicusor Dan is due to be installed as president just at a time when Simion is encouraging his millions of supporters to deluge the country's highest court with demands that the election be run again. But the country, and its judiciary, face a difficult choice. They annulled the December election on the basis of evidence that even Georgescu's opponents thought was questionable. Can they really now ignore Simion's claims and press on regardless without accusations that they favour the mainstream politicians over the populists? And that, of course, would hugely fuel Simion's long-running accusation that the establishment is out to thwart him. It is, in short, a bit of a mess. After exit polls indicated the pro-EU candidate had won, Mr Simion posted on Facebook: \"I won!!! I am the new President of Romania and I am giving back the power to the Romanians!\" However, he conceded the election later in the evening. Mr Simion - a nationalist banned from Ukraine, who has advocated for uniting Romania with Moldova - surged to prominence after the country's first attempt to hold its presidential election last year. Read more from Sky News:Schoolchildren dodge gunfire in HaitiUK and EU announce fresh Russia sanctions Far-right outsider Calin Georgescu topped the first-round polls, but Romania's highest court disqualified him and annulled the result after allegations of electoral violations and Russian interference. Mr Simion capitalised on the furore, offering his support to Mr Georgescu and promising to appoint him as prime minister if he secured the presidency."
    },
    {
        "title": "Three dead and two missing after floods hit southern France - reports",
        "description": "Three people have died after severe thunderstorms caused flooding in the Var region of southeastern France, according to reports.",
        "url": "https://news.sky.com/story/three-dead-and-two-missing-after-floods-hit-southern-france-reports-13371867",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-le-lavandrou_6922835.jpg?20250520235415",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-20 22:43:00",
        "Headline": "Two of those who died were an elderly couple who were in their car as it was swept away by floodwaters in the seaside town of Le Lavandou, France 24 reports.",
        "Content": "Three people have died after severe thunderstorms caused flooding in the Var region of southeastern France, according to reports. The rain has also caused widespread damage as Meteo-France, the country's national weather agency, placed the region under an orange alert for rain, flooding and thunderstorms, French broadcaster BFM TV reported. Two of those who died were an elderly couple who were in their car as it was swept away by floodwaters in the seaside town of Le Lavandou, France 24 reported. Meanwhile, the gendarmerie said around 2.30pm local time (1:30pm UK time) that a person had been found drowned in their vehicle in the commune of Vidauban. Le Lavandou and the commune of Bormes-les-Mimosas were particularly hard hit by the storms. Gil Bernardi, mayor of Le Lavandou, said during a press conference: \"The roads, the bridges, the paving stones, there is no more electricity, water, or wastewater treatment plant. The shock is significant because the phenomenon is truly violent and incomprehensible. \"As we speak, an entire part of the commune is inaccessible.\" \n                  French police investigating series of crypto kidnappings with executives tied up and their fingers cut off\n                 \n                  French actor Gerard Depardieu found guilty of sexually assaulting two women\n                 \n                  French mosque stabbing suspect still at large after killing Muslim worshipper\n                 Power and water outages were also reported in the town of Cavaliere where 250mm of rain fell in the space of one hour. A parking lot collapsed in the town, and dozens of people were rescued, according to the authorities. Around 200 firefighters and 35 gendarmes have reportedly been responding to the floods in Var. Meteo-France had recorded cumulative rainfall exceeding 10cm as of 10am local time."
    },
    {
        "title": "Fresh UK and EU sanctions on Russia announced - as Putin procrastinates on ceasefire talks",
        "description": "The UK and EU have placed fresh sanctions on Russia as the Kremlin refused to put a timeline on ceasefire talks with Ukraine.",
        "url": "https://news.sky.com/story/fresh-uk-sanctions-on-russia-announced-as-putin-procrastinates-on-ceasefire-talks-13371420",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-putin-russia-vladimir_6918507.jpg?20250516164237",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-20 10:33:00",
        "Headline": "The sanctions will target Russia's weapons supply chains, Kremlin-funded information operations, financial institutions and its \"shadow fleet\".",
        "Content": "The UK and EU have placed fresh sanctions on Russia as the Kremlin refused to put a timeline on ceasefire talks with Ukraine. The UK's Foreign Office said a total of 100 further sanctions will target Russia's military, energy and financial sectors. The new measures will target the supply chains of Russian weapons systems, including Iskander missiles, Kremlin-funded information operations, financial institutions that help Russia evade sanctions and ships in the Kremlin's \"shadow fleet\" of oil tankers. Ukraine war latest: Trump has 'red line' for peace talks The Foreign Office said Vladimir Putin had repeatedly fired Iskander missiles into crowded civilian areas \"with a callous disregard for life\", including on 13 April in Sumy when 34 civilians, including children, were killed as some headed to Palm Sunday services. Similarly, European Commission President Ursula von der Leyen said an 18th package of EU sanctions against Russia is already being worked on. \"It's time to intensify the pressure on Russia to bring about the ceasefire,\" she said on X, after a phone call with Ukrainian President Volodymyr Zelenskyy. These new sanctions are being imposed to ratchet up pressure on Mr Putin after Russia fired 273 drones at Ukrainian cities on Saturday, the biggest drone attack since it invaded Ukraine in February 2022. Foreign Secretary David Lammy said: \"Putin's latest strikes once again show his true colours as a warmonger. \"We urge him to agree a full, unconditional ceasefire right away so there can be talks on a just and lasting peace. \"We have been clear that delaying peace efforts will only redouble our resolve to help Ukraine to defend itself and use our sanctions to restrict Putin's war machine.\" Moscow correspondent The mood in Russia is upbeat, bordering on triumphant, following Monday's phone call between Vladimir Putin and Donald Trump. \"The tone of the conversation was excellent,\" crows the headline in the newspaper Argumenty i Fakty, quoting the American president's assessment of the conversation. Trump has \"accepted the Russian formula\" of \"negotiations first, ceasefire after\", the paper brags. Another, Komsomolskaya Pravda, runs with Putin's description of the call as their main headline: \"We are on the right track\". According to the pro-Kremlin paper, Trump's approach shows the United States \"is not going to indulge [Volodymyr] Zelenskyy and Europe\". Much of the coverage portrays the call as a battle for Trump's affections, with Russia emerging victorious despite the influence of \"Western hawks\". \"[Trump] did not heed their requests,\" says Argumenty i Fakty, referring to Europe's calls for tougher sanctions. Read more from Ivor here. Following Donald Trump's two-hour call with Mr Putin on Monday, the US president said Russia and Ukraine will immediately start negotiations for a ceasefire; however, the Kremlin gave no timeline despite Mr Zelenskyy agreeing to one months ago. The call prompted the UK and EU's new sanctions. Read more:Is Trump walking away from peace in Ukraine?Russia bans Amnesty International as an 'undesirable organistion'  New British sanctions have also been placed on 14 more members of the Social Design Agency (SDA), which carries out Kremlin-funded information operations to undermine sovereignty, democracy and the rule of law in Ukraine and across the world. The UK had previously sanctioned the SDA and several of its leaders last year, but all levels of the organisation are now being targeted. Another 46 financial institutions that help Russia evade sanctions have also been targeted. Sanctions have also been placed on a further 18 ships, following 110 earlier this month, in Russia's \"shadow fleet\", which carry Russian oil under different flags (often Liberian) to continue shipping oil around the world despite sanctions that have placed a price cap on Russian oil. 👉 Follow Trump100 on your podcast app 👈 John Ormerod, a British national who procured ships for Russia's shadow fleet has been sanctioned, and two Russian captains of shadow fleet tankers. The UK and Western allies are looking to lower the price cap of Russian crude oil from $60 a barrel to prevent profits from being used to fund the war. The Foreign Office said UK and other Western sanctions have severely hit Russia's economy, with its GDP shrinking in the first quarter of the year and the non-defence economy in recession for some time. It said security and defence spending now accounts for more than 40% of Russia's federal budget, with Mr Putin raising taxes and cutting social spending to continue the war."
    },
    {
        "title": "Bayesian recovery: First pieces of Mike Lynch's sunken superyacht brought to surface",
        "description": "The first three pieces of the Bayesian superyacht, which capsized off Italy last year, have been brought to the surface.",
        "url": "https://news.sky.com/story/bayesian-recovery-first-pieces-of-mike-lynchs-sunken-superyacht-brought-to-surface-13371538",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-bayesian-recovered_6922425.jpg?20250520154235",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-20 13:20:00",
        "Headline": "Work is under way to recover the superyacht that sank off the coast of Sicily last year, killing seven people, including tech tycoon Mike Lynch and his 18-year-old daughter Hannah.",
        "Content": "The first three pieces of the Bayesian superyacht, which capsized off Italy last year, have been brought to the surface. The yacht's main boom, its anchor and a pole, which holds the bottom of the sail, have been lifted from the seabed. The boat was owned by British tech tycoon Mike Lynch. He was among seven people - including his 18-year-old daughter Hannah - who died when it sank off the coast of Sicily during a storm on 19 August last year. Work to recover the yacht has recently been hampered when a diver died during salvage efforts. Salvage experts from Dutch firms HEBI and SMIT Salvage are increasing the use of remote-controlled tools to bring more pieces of the yacht to the surface. It was expected to be lifted and brought to shore by the end of May. However Marcus Cave from British firm TMC Marine, which is overseeing salvage efforts, said the change in salvage methods \"will increase the time it will take to complete this project\". The first recovered pieces of the sunken yacht will now be brought ashore and taken to Termini Imerese, a nearby town where Italian prosecutors investigating the sinking are based. It comes after an interim report by the MAIB was published last week, providing the fullest account yet of how the superyacht capsized and the last-ditch efforts of those on board to get out. It also found that the boat may have been vulnerable to high winds, with gusts exceeding 70 knots (about 80mph) on the day of the incident. These \"vulnerabilities\" were said to be \"unknown to either the owner or the crew of Bayesian\" as they were not included in the stability information book carried on board. Inquest proceedings in the UK are being held into the deaths of Mr Lynch and his daughter, as well as Morgan Stanley International bank chairman Jonathan Bloomer and his wife Judy, who were all British nationals. Read more:Who was onboard superyacht when it sank?How investigators will look into superyacht disaster The other victims who were died were US lawyer Chris Morvillo and his wife Neda Morvillo, and Canadian-Antiguan national Recaldo Thomas, who was working as a chef on the vessel. Fifteen people, including Mr Lynch's wife Angela Bacares, were rescued. The fatal boat trip was a celebration of Mr Lynch's acquittal in a US trial after he was accused of massive fraud over the sale of Autonomy to Hewlett-Packard in 2011."
    },
    {
        "title": "Harshita Brella death: Fugitive accused of killing wife 'seen withdrawing large sum of cash'",
        "description": "Indian police hunting a murder suspect after his wife's body was found in a car boot in the UK have offered a reward to help find him.",
        "url": "https://news.sky.com/story/harshita-brella-murder-reward-to-find-husband-accused-of-killing-wife-whose-body-was-found-in-car-boot-13371430",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-pankaj-lamba-harshita-brella_6922142.jpg?20250520115310",
        "type": "World",
        "Author": "Neville Lazarus",
        "Date Published": "2025-05-20 10:45:00",
        "Headline": "Pankaj Lamba was charged with his wife's murder, rape and other offences in March. He is the target of an international manhunt as Northamptonshire Police believe he fled the UK and is now in India.",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n Indian police hunting a murder suspect after his wife's body was found in a car boot in the UK have offered a reward to help find him. Pankaj Lamba is accused of killing Harshita Brella on 10 November last year at their home in Corby, Northamptonshire. Ms Brella, 24, was found dead four days later inside a Vauxhall Corsa in Ilford, east London. A post-mortem examination found she died from strangulation. Lamba, 23, was charged with her murder, rape and other offences in March. He is the target of an international manhunt as Northamptonshire Police believe he fled the country and is now in India. Police in Delhi are offering 50,000 rupees (£438) for information leading to Lamba's arrest. The force issued a \"look out circular\", which is used to prevent individuals from fleeing India, against Lamba, after reports of him being seen in the capital. CCTV captured pictures of Lamba wearing a clinical mask and withdrawing 4.3 lakh rupees (£3,760) from a bank on 4 March, according to an investigating officer who did not want to be named. \n                  Pakistan vows 'swift response' if India violates ceasefire\n                 \n                  'Our school is destroyed': At the scene of the mosque hit by an Indian missile strike\n                 \n                  Pakistan claims it has 'upper hand' over India - but fragile truce could easily unravel\n                 The source added Lamba had also \"withdrawn 21,000 rupees (£184) from another bank on the same day\", but there was no CCTV available of this withdrawal. Delhi police later declared him a \"proclaimed offender\" on 1 May, which means he is accused of a serious crime and evading arrest. The force also requested information and assistance in the investigation into Ms Brella's murder from Northamptonshire Police. The source said in his status report that Lamba's mobile phone was recovered from a rickshaw driver on 22 March. The driver told the police that he doesn't remember whose phone it was, adding that he found it in his vehicle and kept it. He later started using Lamba's device when his phone stopped working. Sonia Dabas, Ms Brella's sister, told Sky News after it emerged the reward is being offered: \"All I can say is that the police are not proactively working otherwise they should have got him in already and we are still waiting for justice for Harshita Brella.\" Lamba's sister, Uma Lamba, and two other relatives were questioned by police and have denied knowledge of his whereabouts. They were all granted \"anticipatory bail\" by the Delhi High Court, which means they will be released on bail in case they are arrested. Read more on the case: Harshita Brella 'warned family husband would kill her'Police get disciplinary notices over Harshita Brella case Lamba's father, Darshan Singh, and his mother, Sunil Devi, were arrested on 19 March on charges of cruelty and causing death under India's dowry death laws. Both were sent to judicial custody and filed pleas seeking bail. Police say Lamba had arrived in Bombay on 11 November before taking a flight to Delhi a day later. Lamba and Ms Brella had an arranged marriage and moved to the UK in April 2024, just seven months before she was killed."
    },
    {
        "title": "Is Trump walking away from peace in Ukraine?",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈  </a>",
        "url": "https://news.sky.com/story/is-trump-walking-away-from-peace-in-ukraine-13371277",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump100-podcasts_6901216.png?20250430053042",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-20 02:42:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈   After weeks of stalemate and growing frustration, Donald Trump has spoken on the phone with President Putin. But has the dial towards peace moved any further along? Sky News US correspondents James Matthews and Martha Kelner discuss if President Trump is walking away from negotiations and giving up his ambition to be the peace broker in Ukraine, after a two-hour phone call with Putin didn't amount to any change. Plus, as the world reacts to President Joe Biden's cancer diagnosis James and Martha discuss the controversy around the timing of the announcement and discuss speculation that Biden could have been impacted while he was in office. If you've got a question you'd like the Trump100 team to answer, you can email it to trump100@sky.uk. Don't forget, you can also watch all episodes on our YouTube channel."
    },
    {
        "title": "Donald Trump announces Golden Dome defence project - confirming US plans to put weapons in space",
        "description": "Donald Trump has announced the concept for his Golden Dome missile defence system &#8211; which includes plans for the US put weapons in space for the first time. ",
        "url": "https://news.sky.com/story/donald-trump-announces-golden-dome-defence-project-confirming-us-plans-to-put-weapons-in-space-13371694",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-trump-donald_6922690.jpg?20250520211951",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-20 20:45:00",
        "Headline": "The US president said the project - inspired by Israel's Iron Dome - will cost around $175bn. But the nonpartisan Congressional Budget Office estimates the price will be at least three times higher. ",
        "Content": " Donald Trump has announced the concept for his Golden Dome missile defence system – which includes plans for the US put weapons in space for the first time.  The \"cutting-edge missile defence system\" will include \"space-based sensors and interceptors\", Mr Trump said, adding the Golden Dome \"should be fully operational by the end of my term\". The system - styled on Israel's Iron Dome - will be able to detect and stop missiles at all points of attack, from before launch to when they are descending towards a target, the Trump administration has said. Making the announcement in the Oval Office on Tuesday, Mr Trump told reporters the Golden Dome will be \"capable of intercepting missiles even if they are launched from the other side of the world\". The US president also said Canada \"has called us and they want to be part of it\". \"As usual, we help Canada as best we can,\" he said. He has also pledged that the entire system to be built within the United States. Manufacturers in Georgia, Alaska, Florida and Indiana will all be heavily involved in the project, Mr Trump said. General Michael Guetlein, who currently serves as the vice chief of space operations, will oversee the Golden Dome's progress. \n                  Fresh UK and EU sanctions on Russia announced - as Putin procrastinates on ceasefire talks\n                 \n                  Sesame Street heading to Netflix after Trump cut PBS funding\n                 \n                  Is Trump walking away from peace in Ukraine?\n                 The space weapons \"represent new and emerging requirements for missions that have never before been accomplished by military space organizations,\" General Chance Saltzman, the head of the US Space Force, said at a hearing Tuesday. How much will the Golden Dome cost?  Mr Trump said he has allocated $25bn \"to help get construction under way,\" which he described as an initial down payment. The total cost will be \"about $175bn\", the US president added - but the Congressional Budget Office has put the price much higher. The space-based components alone could cost as much as $542bn (£405bn) over the next 20 years, it estimated earlier this month. More US news:King Charles writes to BidenMusk plans political spending cutback Mr Trump's announcement came shortly after the newly confirmed US Air Force secretary said there's currently no money allocated for the Golden Dome. The programme is \"still in the conceptual stage,\" Troy Meink told senators today. 👉 Follow Trump100 on your podcast app 👈 The Pentagon has for years warned that the newest missiles developed by Russia and China are so advanced counter measures are needed. Both Russia and China have already put offensive weapons, such as satellites capable of disabling those of other countries, in space."
    },
    {
        "title": "Cassie's mum describes Diddy's sex tape threats - as 'The Punisher' gives testimony",
        "description": "The mother of Cassie Ventura has told a court she felt \"physically sick\" when her daughter told her Sean \"Diddy\" Combs had threatened to \"release two explicit sex tapes\" after discovering his long-time girlfriend was dating someone else. ",
        "url": "https://news.sky.com/story/cassies-mum-describes-diddys-sex-tape-threats-as-the-punisher-gives-testimony-13371804",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-regina-ventura-diddy_6922815.jpg?20250520225922",
        "type": "US",
        "Author": "Bethany Minelle",
        "Date Published": "2025-05-20 20:47:00",
        "Headline": "During the seventh day of the Sean \"Diddy\" Combs trial, the court heard of his explicit sex tape threats to Cassie when he discovered she was dating rapper Kid Cudi, and a male escort called \"The Punisher\" stepped on to the stand.  ",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n The mother of Cassie Ventura has told a court she felt \"physically sick\" when her daughter told her Sean \"Diddy\" Combs had threatened to \"release two explicit sex tapes\" after discovering his long-time girlfriend was dating someone else.  Giving evidence on Tuesday, the seventh day of the trial, Regina Ventura said she did not initially understand the email Cassie sent her in December 2011, saying, \"The sex tape threw me, [Diddy] was trying to hurt my daughter.\" The email said Combs was planning to release two explicit videos of her and send someone to hurt her and the man she was seeing, rapper Kid Cudi, whose real name is Scott Mescudi. Regina said the family took out a home equity loan and paid Diddy $20,000 to recoup money he had spent on Cassie \"because he demanded it,\" angry that Cassie was now dating Cudi. She said the money was returned days later. During her evidence, jurors were shown photographs of bruises on Cassie's body Ms Ventura said were taken when her daughter returned home for Christmas in 2011. Regina's time on the stand was fairly brief, as the defence declined the opportunity to question her. \n                  Pop star says Sean 'Diddy' Combs threatened to kill her if she spoke about violence as Cassie's ex-best friend gives evidence\n                 \n                  New York helicopter crash tour company to close immediately, says FAA\n                 \n                  Private plane crash in New York kills ex-college football star Karenna Groff and family\n                 Sean 'Diddy' Combs trial: Day 7 - As it happened Prosecutors say Combs, the founder of Bad Boy Records, forced women to take part in days-long, drug-fuelled sexual performances known as \"Freak Offs\" from 2004 to 2024, facilitated by his large retinue of staff. Combs, 55, has pleaded not guilty. The rapper faces five criminal counts: one count of racketeering conspiracy; two counts of sex trafficking by force, fraud or coercion; and two counts of transportation to engage in prostitution. Last week, the prosecutors' star witness, Cassie Ventura, who dated Combs for over a decade, spent four days giving evidence. Combs's legal team has sought to show jurors that his relationship with Ventura was complicated, and while they acknowledge he was an abusive partner, and had substance issues, they say the sex acts described by the prosecution were consensual. Read more:Everything you need to know about the Sean Combs trialThe rise and fall of Sean 'Diddy' Combs 'Diddy wanted our bodies to shine' A male exotic dancer nicknamed \"The Punisher\" also gave testimony, telling jurors that in the autumn of 2012, Cassie contacted him asking him to \"create a sexy, erotic scene\" Diddy, and using the pseudonym \"Janet\". Sharay Hayes said he went on to have eight to 12 more encounters with the couple, having sex with Cassie, while Diddy watched from a distance. He described the hotel rooms as routinely being dressed with electric candles and sheet-covered furniture, and says Cassie told him not to \"acknowledge\" her husband, and to \"try not to look at him and no communication\". He says Diddy would often wear a cap, and he could not see his face, but he later realised it was the famous rapper. \"The Punisher\" mentioned using a \"considerable amount of baby oil\" during the performances, saying \"[Diddy] wanted us to keep our bodies covered, to shine\". He later described the acts as \"a fetish type thing,\" and while he said he believed Cassie was fully consensual, he also said he \"did occasionally see her sigh or wince\" and said she would frequently look at Diddy \"for cues\". Paid between $1,200 (£900) and $2,000 (£1.500) for each performance, he said he was not called back after struggling to get an erection during one encounter. He said he never saw Diddy use drugs or saw filming during any of the performances. Car park dispute with Suge Knight David James, Diddy's ex-personal assistant, also completed his evidence and testified that he never saw physical violence between Cassie and his former boss. James, who worked for Diddy for two years, said he left Diddy's employment after he realised his \"life was in danger\" following a dispute in a car park with rival record label owner Suge Knight, which culminated in Diddy bringing three handguns to try to find Knight and his entourage. He also detailed an altercation between Diddy and his personal chef, Jourdan Atkinson, and said he refused to file a police report after Diddy told him to say \"Chef Jourdan hit him first\". The final person to give evidence was a special agent responsible for planning the March 2024 raids on Combs's Miami home on Star Island. Steve Gannon showed photos of items taken during the raid, including sex toys, high heels and loaded guns, and explained how an armoured vehicle was used to break down the mansion's front gate to gain entry while the family was away on a trip. Combs has been held in the Metropolitan Detention Center in Brooklyn since September and faces at least 15 years or possibly life in prison if convicted. The trial is set to last for around two months."
    },
    {
        "title": "George Wendt, who played Norm in Cheers, dies at age of 76",
        "description": "Actor George Wendt, who played Norm Peterson in the iconic sitcom Cheers, has died at the age of 76.",
        "url": "https://news.sky.com/story/george-wendt-who-played-norm-in-cheers-dies-at-age-of-76-13371602",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-george-wendt-cheers_6922694.jpg?20250520212326",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-20 15:10:00",
        "Headline": "Wendt's character as an affable, beer-loving barfly in Cheers was watched by millions in the 1980s - earning him six consecutive Emmy nominations for best supporting actor.",
        "Content": "Actor George Wendt, who played Norm Peterson in the iconic sitcom Cheers, has died at the age of 76. His family said he died early on Tuesday morning, peacefully in his sleep. \"George was a doting family man, a well-loved friend and confidant to all of those lucky enough to have known him. He will be missed forever,\" the family said in a statement. His character as an affable, beer-loving barfly in Cheers was watched by millions in the 1980s - earning him six consecutive Emmy nominations for best supporting actor. The sitcom was based in a Boston bar \"where everybody knows your name\" - proved true given everyone would shout \"Norm!\" when he walked in. Cheers also starred Ted Danson, Shelley Long, Rhea Perlman, Kelsey Grammer, John Ratzenberger, Kirstie Alley and Woody Harrelson. The show would spin off another success in Frasier and was nominated for 117 Emmy Awards, winning 28 of them. Wendt appeared in all 273 episodes of Cheers - with his regular first line of \"afternoon everybody\" a firm fan favourite. \n                  Cassie's mum describes Diddy's sex tape threats - as 'The Punisher' gives testimony\n                 \n                  The Thick of It creator reveals scene which cabinet ministers say happened in real life \n                 \n                  Sesame Street heading to Netflix after Trump cut PBS funding\n                 He was also a prominent presence on Broadway - appearing on stage in Art, Hairspray and Elf. Before rising to fame, he spent six years in Chicago's renowned Second City improvisation troupe. Read more from Sky News:Inside Diddy's star-studded partiesSesame Street heading to Netflix In an interview with GQ magazine, he revealed he did not have high hopes when he auditioned for the role that would catapult him to fame. \"My agent said: 'It's a small role, honey. It's one line. Actually, it's one word.' The word was 'beer.' \"I was having a hard time believing I was right for the role of 'the guy who looked like he wanted a beer.' \"So I went in, and they said, 'It's too small a role. Why don't you read this other one?' And it was a guy who never left the bar.\" One of nine children, Wendt was born in Chicago and graduated with a degree in economics. He married actress Bernadette Birkett in 1978, who voiced the character of Norm's wife in Cheers but never appeared on screen. They have three children. Wendt's nephew is Jason Sudeikis, who played the lead role in Ted Lasso."
    },
    {
        "title": "Elon Musk says he will remain Tesla CEO and plans to cut back on political spending",
        "description": "Elon Musk has said he is committed to remaining as Tesla's chief executive for at least five years, as the electric carmaker faces pressure from consumers and the stock market over his work with Donald Trump's government.",
        "url": "https://news.sky.com/story/elon-musk-says-he-will-remain-tesla-ceo-and-plans-to-cut-back-on-political-spending-13371591",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-elon-musk-doha_6922437.jpg?20250520155440",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-20 14:46:00",
        "Headline": "The world's richest man said he will cut back on political spending after heavily backing the US president last year.",
        "Content": "Elon Musk has said he is committed to remaining as Tesla's chief executive for at least five years, as the electric carmaker faces pressure from consumers and the stock market over his work with Donald Trump's government. The world's richest man said he will cut back on political spending after heavily backing the US president last year. During a video appearance at the Qatar Economic Forum hosted by Bloomberg, a moderator asked: \"Do you see yourself and are you committed to still being the chief executive of Tesla in five years' time?\" Musk responded: \"Yes.\" The moderator added: \"No doubt about that at all?\" Musk chuckled and replied: \"I can't be still here if I'm dead.\" Tesla has borne the brunt of the outrage against Musk over his work with Mr Trump as part of his Department of Government Efficiency (DOGE), which implemented cuts across the US federal government. Asked if the reaction made him think twice about his involvement in politics, Musk said: \"I did what needed to be done. \"I'm not someone who has ever committed violence and yet massive violence was committed against my companies, massive violence was threatened against me.\" He added: \"Don't worry: We're coming for you.\"  Musk spent at least 250 million dollars (£187m) supporting Mr Trump in the presidential campaign, and even held some of his own campaign rallies. \"I'm going to do a lot less in the future,\" Mr Musk said. Asked why, he responded: \"I think I've done enough.\" And he added: \"Well, if I see a reason to do political spending in the future, I will do it. I do not currently see a reason.\" Read more:US has a red line in Ukraine-Russia talks, says TrumpKing writes to Biden after he reveals cancer diagnosis Aspirations to build 'billions of humanoid robots' It comes after a Tesla pay package Musk was due, once valued at $56bn (£41.8bn) was stopped by a judge in Delaware. Musk referred to chancellor Kathaleen St Jude McCormick as an \"activist who is cosplaying a judge in a Halloween costume\". But he acknowledged his Tesla pay was part of his consideration about staying with Tesla, though he also wanted \"sufficient voting control\" so he \"cannot be ousted by activist investors\". \"It's not a money thing, it's a reasonable control thing over the future of the company, especially if we're building millions, potentially billions of humanoid robots,\" he added."
    },
    {
        "title": "Is Trump walking away from peace in Ukraine?",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈  </a>",
        "url": "https://news.sky.com/story/is-trump-walking-away-from-peace-in-ukraine-13371277",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump100-podcasts_6901216.png?20250430053042",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-20 02:42:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈   After weeks of stalemate and growing frustration, Donald Trump has spoken on the phone with President Putin. But has the dial towards peace moved any further along? Sky News US correspondents James Matthews and Martha Kelner discuss if President Trump is walking away from negotiations and giving up his ambition to be the peace broker in Ukraine, after a two-hour phone call with Putin didn't amount to any change. Plus, as the world reacts to President Joe Biden's cancer diagnosis James and Martha discuss the controversy around the timing of the announcement and discuss speculation that Biden could have been impacted while he was in office. If you've got a question you'd like the Trump100 team to answer, you can email it to trump100@sky.uk. Don't forget, you can also watch all episodes on our YouTube channel."
    },
    {
        "title": "Sesame Street heading to Netflix after Trump cut PBS funding",
        "description": "Netflix and Sesame Street have agreed a deal that will bring the children's show to the streaming platform's wider audience after President Trump cut federal funding for the free-to-air TV network Public Broadcasting Service (PBS).",
        "url": "https://news.sky.com/story/sesame-street-heading-to-netflix-after-trump-cut-pbs-funding-13371338",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-sesame-street-bert_6523964.jpg?20240417075032",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-20 08:28:00",
        "Headline": "Later this year new episodes of the children's show will be shown on Netflix as well as PBS and the PBS Kids app on the same day.",
        "Content": "Netflix and Sesame Street have agreed a deal that will bring the children's show to the streaming platform's wider audience after President Trump cut federal funding for the free-to-air TV network Public Broadcasting Service (PBS). Later this year, new episodes will be shown on Netflix as well as PBS and the PBS Kids app on the same day. Select past episodes will be available on Netflix worldwide. No specific start date has been announced. It comes after Warner Bros Discovery decided last year not to renew its deal for new episodes on HBO and Max, though episodes will remain on there until 2027. That was followed by Donald Trump issuing an executive order earlier this month to block federal funding to PBS and the National Public Radio (NPR) network, because he believes their coverage is biased. For the show's 56th season, the episodes will revolve around one 11-minute story, Netflix said. It will feature more exploration of the Sesame Street neighbourhood and also give a look inside 123 Sesame Street, which houses Elmo, Bert and Ernie, and others. Sesame Street said on X: \"We are excited to announce that all new Sesame Street episodes are coming to @netflix worldwide along with library episodes, and new episodes will also release the same day on @PBS Stations and @PBSKIDS platforms in the US, preserving a 50+ year relationship. \"The support of Netflix, PBS, and the Corporation for Public Broadcasting serve as a unique public-private partnership to enable Sesame Street to continue to help children everywhere grow smarter, stronger, and kinder.\" Read more:Second man charged over fires at properties linked to StarmerEU members want UK access to rearmament fund limitedPop star says Diddy threatened to kill her Sesame Workshop said in a statement: \"This unique public-private partnership will enable us to bring our research-based curriculum to young children around the world with Netflix's global reach, while ensuring children in communities across the US continue to have free access on public television to the Sesame Street they love.\" Sesame Street has won more than 200 Emmys in addition to Peabody awards, as well as a Kennedy Centre Honour for lifetime artistic achievement."
    },
    {
        "title": "HSBC 'being attacked all the time' by online criminals - as boss 'kept awake at night' by cyber threat",
        "description": "The boss of one of the UK's biggest banks says it is being attacked \"all the time\" by online criminals and he is kept up at night by cyber threats.",
        "url": "https://news.sky.com/story/hsbc-being-attacked-all-the-time-by-online-criminals-as-boss-kept-awake-at-night-by-cyber-threat-13371429",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-computer-laptop-ai_6921561.jpg?20250519161855",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-05-20 10:42:00",
        "Headline": "Appearing before MPs, HSBC UK chief executive Ian Stuart and other bank bosses addressed the threat of cyber attacks.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The boss of one of the UK's biggest banks says it is being attacked \"all the time\" by online criminals and he is kept up at night by cyber threats. \"It does keep me awake,\" HSBC UK chief executive Ian Stuart told the Treasury Committee of MPs. \"Because we can be attacked and we are being attacked all the time.\" Money blog: 'Highest ever' bank switching offer launches Mr Stuart said banks were spending \"enormous\" sums of hundreds of millions of pounds on IT systems - the biggest expense in their businesses. \"Cybersecurity is now very much at the top of our agenda,\" he added. Concerns were also highlighted by Lloyds Bank chief executive Charlie Nunn, who said financial fraud will get worse if banks cannot intervene to prevent it and social media and telecoms companies are not incentivised to halt it. Mr Nunn said the UK \"has become the home of fraud\", adding that the number of victims is \"pretty disturbing\" and \"individual cases are harrowing\". Major high street businesses, including M&S and the Co-op, have been hit by cyber attacks in recent weeks and had their operations impacted.  Cybersecurity threats, however, were not behind the several-day outage at Barclays at the end of January, its UK chief executive Vim Maru said. He added: \"We've learned the lessons. We're acting on the lessons, both work done internally, but also with help from third parties as well. Account holders across the UK have suffered a spate of IT glitches from different banks around paydays this year. Tens of millions of pounds on IT have been spent and customer glitches have fallen, Mr Maru said.   He added that the problem at Barclays was a software issue, saying: \"We put a fix in place that means that we won't have a recurrence.\" "
    },
    {
        "title": "Elon Musk says he will remain Tesla CEO and plans to cut back on political spending",
        "description": "Elon Musk has said he is committed to remaining as Tesla's chief executive for at least five years, as the electric carmaker faces pressure from consumers and the stock market over his work with Donald Trump's government.",
        "url": "https://news.sky.com/story/elon-musk-says-he-will-remain-tesla-ceo-and-plans-to-cut-back-on-political-spending-13371591",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-elon-musk-doha_6922437.jpg?20250520155440",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-20 14:46:00",
        "Headline": "The world's richest man said he will cut back on political spending after heavily backing the US president last year.",
        "Content": "Elon Musk has said he is committed to remaining as Tesla's chief executive for at least five years, as the electric carmaker faces pressure from consumers and the stock market over his work with Donald Trump's government. The world's richest man said he will cut back on political spending after heavily backing the US president last year. During a video appearance at the Qatar Economic Forum hosted by Bloomberg, a moderator asked: \"Do you see yourself and are you committed to still being the chief executive of Tesla in five years' time?\" Musk responded: \"Yes.\" The moderator added: \"No doubt about that at all?\" Musk chuckled and replied: \"I can't be still here if I'm dead.\" Tesla has borne the brunt of the outrage against Musk over his work with Mr Trump as part of his Department of Government Efficiency (DOGE), which implemented cuts across the US federal government. Asked if the reaction made him think twice about his involvement in politics, Musk said: \"I did what needed to be done. \"I'm not someone who has ever committed violence and yet massive violence was committed against my companies, massive violence was threatened against me.\" He added: \"Don't worry: We're coming for you.\"  Musk spent at least 250 million dollars (£187m) supporting Mr Trump in the presidential campaign, and even held some of his own campaign rallies. \"I'm going to do a lot less in the future,\" Mr Musk said. Asked why, he responded: \"I think I've done enough.\" And he added: \"Well, if I see a reason to do political spending in the future, I will do it. I do not currently see a reason.\" Read more:US has a red line in Ukraine-Russia talks, says TrumpKing writes to Biden after he reveals cancer diagnosis Aspirations to build 'billions of humanoid robots' It comes after a Tesla pay package Musk was due, once valued at $56bn (£41.8bn) was stopped by a judge in Delaware. Musk referred to chancellor Kathaleen St Jude McCormick as an \"activist who is cosplaying a judge in a Halloween costume\". But he acknowledged his Tesla pay was part of his consideration about staying with Tesla, though he also wanted \"sufficient voting control\" so he \"cannot be ousted by activist investors\". \"It's not a money thing, it's a reasonable control thing over the future of the company, especially if we're building millions, potentially billions of humanoid robots,\" he added."
    },
    {
        "title": "Steel tycoon Gupta in last-ditch bid to rescue UK empire",
        "description": "The steel tycoon Sanjeev Gupta is mounting a last-ditch bid to salvage his British operations after seeing an emergency plea for government support rejected.",
        "url": "https://news.sky.com/story/steel-tycoon-gupta-in-last-ditch-bid-to-rescue-uk-empire-13371350",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sanjeev-gupta-liberty-steel_6922076.jpg?20250520105107",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-20 08:46:00",
        "Headline": "Sanjeev Gupta is seeking to adjourn a winding-up petition that could force his UK steel operations into compulsory liquidation after seeing a plea for government aid rejected, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The steel tycoon Sanjeev Gupta is mounting a last-ditch bid to salvage his British operations after seeing an emergency plea for government support rejected. Sky News has learnt that Mr Gupta's Liberty Speciality Steels UK (SSUK) arm is seeking to adjourn a winding-up petition scheduled to be heard in court on Wednesday. The petition is reported to have been brought by Harsco Metals Group, a supplier of materials and labour to SSUK, and is said to be supported by other trade creditors. Unless the adjournment is granted, Mr Gupta faces the prospect of seeing SSUK forced into compulsory liquidation. That would raise questions over the future of roughly 1,450 more steel industry jobs, weeks after the government stepped in to rescue the larger British Steel amid a row with its Chinese owner over the future of its Scunthorpe steelworks. If Mr Gupta's operations do enter compulsory liquidation, the Official Receiver would appoint a special manager to run the operations while a buyer is sought. A Whitehall insider said talks had taken place in recent days involving Mr Gupta's executives and the Insolvency Service. \n                  HSBC 'being attacked all the time' by online criminals - as boss 'kept awake at night' by cyber threat\n                 \n                  Elon Musk says he will remain Tesla CEO and plans to cut back on political spending\n                 \n                  Money blog: £70 Mastercard payout for millions; Reeves ends ISA talk; what Canary Islands tourism protests mean for holidays\n                 Steel industry sources said the government could conceivably be interested in reuniting the Rotherham plant of SSUK with British Steel's Scunthorpe site because of the industrial synergies between them, although it was unclear whether any such discussions had been held. Mr Gupta is said to have explored whether he could persuade the government to step in and support SSUK using the legislation enacted last month to take control of British Steel's operations. Whitehall insiders said, however, that Mr Gupta's overtures had been rebuffed. He had previously sought government aid during the pandemic but that plea was also rejected by ministers. The SSUK division operates across sites including at Rotherham in south Yorkshire and Bolton in Lancashire. It makes highly engineered steel products for use in sectors such as aerospace, automotive and oil and gas. A restructuring plan due to be launched last week was abandoned at the eleventh hour after failing to secure support from creditors of Greensill, the collapsed supply chain finance provider to which Mr Gupta was closely tied. Under that plan, creditors, including HM Revenue and Customs, would have been forced to write off a significant chunk of the money they are owed. The company said last week that it had invested nearly £200m in the last five years into the UK steel industry, but had faced \"significant challenges due to soaring energy costs and an over-reliance on cheap imports, negatively impacting the performance of all UK steel companies\". It adds: \"The court's ability to sanction the plan depended on finalisation of an agreement with creditors. \"This has not proved possible in an acceptable timeframe, and so Liberty has decided to withdraw the plan ahead of the sanction hearing on May 15 and will now quickly consider alternative options.\" One source close to Liberty Steel acknowledged that it was running out of time to salvage the business. They said, however, that an adjournment of Wednesday's hearing to consider the winding-up petition could yet buy the company sufficient breathing space to stitch together an alternative rescue deal. A Liberty Steel spokesperson said on Tuesday: \"Discussions continue with creditors. \"Liberty understands the concern this will create for Speciality Steel UK colleagues and remains committed to doing all it can to maintain the Speciality Steel UK business.\" The Insolvency Service has also been contacted for comment. A Department for Business and Trade spokesperson said: \"We continue to closely monitor developments around Liberty Steel, including any public hearings, which are of course a matter for the company. \"It is ultimately for Liberty to manage commercial decisions on the future of its companies, and we hope it succeeds with its plans to continue on a sustainable basis.\""
    },
    {
        "title": "Thames Water drops £1m bonuses for top bosses after government criticism",
        "description": "Thames Water has \"withdrawn\" plans to pay senior bosses bonuses linked to the company securing a &#163;3bn emergency loan, the environment secretary has said. ",
        "url": "https://news.sky.com/story/thames-water-drops-1631m-bonuses-for-top-bosses-after-government-criticism-13371746",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-thames-water-maintenance_6777656.jpg?20241216120341",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-20 19:09:00",
        "Headline": "The payments were linked to the struggling firm securing a rescue loan of up to £3bn to stave off collapse earlier this year.",
        "Content": "Thames Water has \"withdrawn\" plans to pay senior bosses bonuses linked to the company securing a £3bn emergency loan, the environment secretary has said.  Steve Reed confirmed the proposals had been dropped during an Environment, Food and Rural Affairs (Efra) committee session with MPs on Tuesday. The so-called retention plan would have amounted to 50% of senior bosses' salaries - leading to them getting £1m on top of their annual salaries and regular bonuses. The payments were linked to the struggling firm securing a rescue loan of up to £3bn to stave off collapse earlier this year. The company's chairman had earlier in the day admitted to incorrectly stating the retention plan was \"insisted upon\" by lenders. Thames Water had been \"trying to circumvent\" upcoming rules that can ban water companies from paying bonuses by \"calling their bonuses something different\", Mr Reed told MPs. \"It was the wrong thing to do,\" he said. \"It offends against their own customers' sense of fair play.\" \n                  I was worth my six-figure bonus, says under-fire Thames Water boss\n                 \n                  Thames Water apologises to customers but defends bonuses\n                 \n                  Thames Water delays request for even more expensive bills as six offers of new investment received\n                 A spokesman for Thames said: \"It has never been the Thames Water board's intention to be at odds with the government's ambition to reform the water industry.\" The company's board \"has decided to pause the retention scheme and await forthcoming guidance from the regulator\" in relation to the new rules, he added. In a letter to the committee, Thames Water's chairman Sir Adrian Montague said he may have \"in the heat of the moment […] misspoken\" when he was quizzed on the firm's turnaround at an Efra session last week. Thames Water is England's biggest water firm, supplying around 16 million households across London and the South East. It has been at the centre of growing public outrage over the extent of pollution and rising bills - which have inched higher while executives have been paid huge bonuses. Read more:'I was worth my bonus,' says Thames Water bossOlympian calls for river clean-ups  New rules from the Water Services Regulations Authority (Ofwat) mean bonus payments to bosses can be banned if companies fail to meet standards to protect the environment, consumers and company finances. It could also block payments funded not just by customer money, but by lenders and shareholders."
    },
    {
        "title": "London-listed miner Adriatic Metals in £700m takeover talks",
        "description": "Adriatic Metals, a precious metals mining group, is in the early stages of takeover talks which could lead to it becoming the latest London-listed company to succumb to an overseas bidder.",
        "url": "https://news.sky.com/story/london-listed-miner-adriatic-metals-in-163700m-takeover-talks-13371537",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-geologist-adriatic-metals_6922328.jpg?20250520142828",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-20 13:26:00",
        "Headline": "Run by former BHP executive Laura Tyler, Adriatic is said to be in early-stage discussions with Toronto-listed Dundee Precious Metals, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Adriatic Metals, a precious metals mining group, is in the early stages of takeover talks which could lead to it becoming the latest London-listed company to succumb to an overseas bidder. Sky News understands that Adriatic Metals is in the very early stages of discussions with Dundee Precious Metals, a Toronto-listed peer. The status of the talks and other key details, including any offer price under negotiation, were unclear on Tuesday. One person close to the situation said it was unclear whether any formal offer would emerge.  Money blog: What Canary Islands protest means for your holiday  \n                  HSBC 'being attacked all the time' by online criminals - as boss 'kept awake at night' by cyber threat\n                 \n                  Elon Musk says he will remain Tesla CEO and plans to cut back on political spending\n                 \n                  Money blog: £70 Mastercard payout for millions; Reeves ends ISA talk; what Canary Islands tourism protests mean for holidays\n                 Valued at about £610m, Adriatic has a market capitalisation roughly one-third of that of Dundee, which has a presence in the Balkans. With a conventional takeover premium factored in, any offer could value the target at well over £700m, according to bankers. Adriatic produces copper, gold, lead, silver and zinc from recently developed mining operations in Bosnia and Herzegovina. The company is run by chief executive Laura Tyler, a former senior BHP executive who is among few female bosses in the global mining industry. London-listed shares in Adriatic Metals were nearly 6% higher in Tuesday afternoon trading amid growing bid speculation. The two companies were rumoured to have held similar talks as recently as last year, although they did not progress to any form of public confirmation. A spokesman for Adriatic, which is also quoted in Australia, declined to comment, while Dundee could not be reached for comment."
    },
    {
        "title": "Revealed: Why Keir Starmer's strategy to tackle Reform UK could end up backfiring",
        "description": "Has Labour got the right strategy to tackle Reform UK?",
        "url": "https://news.sky.com/story/revealed-why-keir-starmers-strategy-to-tackle-reform-uk-could-end-up-backfiring-13371866",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-keir-starmer-labour_6922820.jpg?20250520230945",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-05-20 21:44:00",
        "Headline": "Nigel Farage's party is a threat to Labour MPs. But the PM's attempts to win round Reform voters could cause his own supporters to back someone else.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Has Labour got the right strategy to tackle Reform UK? Nigel Farage's party cost the Tories dozens, maybe 100-plus seats at the general election. Now it looks like the party is hitting Labour too. But has Sir Keir Starmer got the right answers? Last year, Labour won a landslide because the Tory vote collapsed, in part because Reform UK took chunks of their supporters in constituencies across the UK. And here is the situation on 1 May this year - the national equivalent vote share at the council elections put Reform well ahead in first place. Success - this time at the expense of Labour too. How big a threat is this to MPs? As a very crude experiment, Sky News has looked at what would happen if this result was replicated evenly across parliamentary constituencies. Within the areas where there were county council elections are 77 complete Westminster seats with sitting Labour MPs. This includes places like Wycombe, where Treasury minister Emma Reynolds holds. Or Lincoln, won by Foreign Office minister Hamish Falconer. \n                  Plans to spend millions on 'forgotten neighbourhoods' - could yours be one of them?\n                 \n                  Who PM was really trying to echo with 'island of strangers' speech\n                 \n                  Civil service relocation and AI officials at heart of government cost cutting measures\n                 Now if - for fun - we mapped the country council results from 1 May evenly across these general election constituencies, almost all those Labour seats are gone. All lost, apart from five. That's 72 out of 77 Labour MPs losing their seats and mostly to Reform UK. What if we took that swing an applied across the whole country, places where there weren't local elections? Angela Rayner in Greater Manchester and Jess Phillips in Birmingham would lose their seats. Yes this is a crude measure - it assumes a uniform swing can be drawn from the 1 May polls - and local and national elections are very different. But importantly, YouGov's latest national opinion polls paint a similar picture to the council elections. Meanwhile, 89 out of 98 constituencies where Reform came second place have Labour in first. Labour MPs are feeling the heat from Farage. The Reform threat is real. Sir Keir Starmer knows it - and this year has started chasing Reform votes. Slashing aid spending. Abandoning green promises. Hard talk about immigration and living on an \"Island of Strangers\". Sensible given the clear and evident Reform UK threat? Actually - maybe not. Look at the data in detail: This block here is all the people who voted Labour in last year's general election. Now thanks to YouGov polling, we know what people in this block would do with their vote now. It shows Labour has lost more than half of last year's voters. Just 46% still say they'd still vote for Sir Keir's party. But - despite the PM's strategy - they're not actually going to Reform in large numbers. Just 6% of Labour's voters at last year's general election - six out of every 100 - said they would vote Reform now. That's all. So where have they gone? Well, they've been lost much more to liberal and left-wing parties - 12% to the Lib Dems, 9% to the Greens. So just pause there. That means the number of Labour voters who have switched to the Lib Dems and Greens, arguably on the left of the political spectrum, is three times the number going to Reform to the right. Just 2% go to the Tories. And much more seriously for Labour, 22% aren't going to vote, don't know or won't say. The bottom line is people who voted Reform have never backed Labour in large numbers. This shows how Reform supporters last year voted in each election since 2005. You can see - Reform voters are former UKIP voters. They're Boris Johnson's Tories. Let's put it another way. While 11% of Labour voters may one day be open to voting Reform, 70% are at risk of going to the Lib Dems or Greens - seven times the threat from Reform. And typically, these voters don't like the hard line, Reform-leaning policies of Sir Keir Starmer recently. The local elections show there is a threat to Labour from Reform. But our data suggests Keir Starmer trying to be Nigel Farage lite isn't the answer. Is Labour's strategy really working?"
    },
    {
        "title": "Shouts of 'genocide' in Commons as David Lammy denounces Israel's 'intolerable' actions in Gaza",
        "description": "The foreign secretary has denounced Israel's actions in Gaza as \"intolerable\" but stopped short of saying it had committed genocide.",
        "url": "https://news.sky.com/story/shouts-of-genocide-in-commons-as-david-lammy-denounces-israels-intolerable-actions-in-gaza-13371496",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-david-lammy-gaza-israel_6922347.jpg?20250520144118",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-05-20 12:31:00",
        "Headline": "The foreign secretary condemns Israel's latest actions in Gaza as \"monstrous\" and \"dangerous\" - but stops short of saying it had committed genocide.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  The foreign secretary has denounced Israel's actions in Gaza as \"intolerable\" but stopped short of saying it had committed genocide. MPs could be heard shouting \"genocide\" in the Commons chamber as David Lammy announced the government was suspending its trade negotiations with Israel and summoning Tzipi Hotovely, Israel's ambassador to the UK, to the Foreign Office. The UK has also sanctioned a number of individuals and groups in the West Bank which it says have been linked with acts of violence against Palestinians - including Daniella Weiss, a leading settler activist who was the subject of Louis Theroux's recent documentary The Settlers. Politics latest: Starmer says sorry for being 'overly rude' at PMQs Israel immediately criticised the UK government actions as \"regrettable\" and said the free trade agreement talks, which ministers have now backed out of, were \"not being advanced at all by the UK government\". Oren Marmorstein, a spokesperson for the Israeli foreign affairs ministry, said: \"If, due to anti-Israel obsession and domestic political considerations, the British government is willing to harm the British economy - that is its own prerogative.\" Mr Lammy's intervention came in response to Israel ramping up its latest military offensive in Gaza and its decision to limit the amount of aid into the enclave. Tom Fletcher, head of the UN Office for the Coordination of Humanitarian Affairs, accused Israel of \"deliberately and unashamedly\" imposing inhumane conditions on Palestinians by blocking aid from entering Gaza more than 10 weeks ago. He also told the UN's security council last week that it must \"act now\" to \"prevent genocide\" - a claim that Israel has vehemently denied.  Speaking in the Commons, the foreign secretary said the threat of starvation was \"hanging over hundreds of thousands of civilians\" and that the 11-week blockade stopping humanitarian aid reaching Gaza was \"indefensible and cruel\". Israeli Prime Minister Benjamin Netanyahu has agreed to allow a limited amount of aid into the besieged enclave in response to global concern at reports of famine. Mr Lammy said Mr Netanyahu's govenrment was \"isolating Israel from its friends and partners around the world, undermining the interests of the Israeli people and damaging the image of the state of Israel in the eyes of the world\". \"We are now entering a dark new phase in this conflict,\" Mr Lammy added. \"Netanyahu's government is planning to drive Gazans from their homes into a corner of the strip to the south and permit them a fraction of the aid that they need.\" Referring to one of the far-right ministers in Mr Netanyahu's government, he said Bezalel Smotrich \"even spoke of Israeli forces cleansing Gaza, destroying what's left of residents, Palestinians being relocated, he said, to third countries\".  MPs from across the house shouted \"genocide\" as Mr Lammy said: \"We must call this what it is. It is extremism. It is dangerous. It is repellent. It is monstrous and I condemn it in the strongest possible terms.\" In the Commons, a number of Labour MPs urged the government to go further against Israel. Yasmin Qureshi, the Labour MP for Bolton South and Walkden, said there needed to be a \"full arms embargo\" and said: \"Can I ask the foreign secretary what additional steps he's going to be taking in order to stave off this genocide?\" Another Labour MP told Sky News that while the statement was \"better than previously...without a concrete timeline and a sanctioning of responsible ministers, it's hard to know what tangible difference it will make.\" Read more:British surgeon in Gaza says it is now 'a slaughterhouse'Gaza at mercy of what comes next - analysisHow Israel has escalated Gaza bombing campaign Israeli officials have said its plans to seize all of Gaza and hold it indefinitely. - which would move the civilian population southward - will help it achieve its aim of defeating Hamas. Israel also believes the offensive will prevent Hamas from looting and distributing humanitarian aid, which it says strengthens the group's rule in Gaza. Mr Netanyahu has defended Israel's actions in Gaza and reacted angrily to a joint statement penned by the leaders of the UK, France and Canada, in which they urged Israel to end its military offensive in Gaza and lift restrictions on humanitarian aid allowed into the enclave. The Israeli prime minister said: \"By asking Israel to end a defensive war for our survival before Hamas terrorists on our border are destroyed and by demanding a Palestinian state, the leaders in London, Ottawa and Paris are offering a huge prize for the genocidal attack on Israel on October 7 while inviting more such atrocities. \"No nation can be expected to accept anything less and Israel certainly won't. This is a war of civilisation over barbarism. Israel will continue to defend itself by just means until total victory is achieved.\""
    },
    {
        "title": "Party leaders' shock at death of ex-MEP Patrick O'Flynn",
        "description": "Political journalists and senior politicians have expressed shock at the sudden death of former Daily Express political editor and Member of the European Parliament Patrick O'Flynn, aged 59.",
        "url": "https://news.sky.com/story/party-leaders-shock-at-death-of-ex-mep-patrick-oflynn-13371871",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-patrick-oflynn-ukip_6922842.jpg?20250521002353",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-05-20 23:19:00",
        "Headline": "Mr O'Flynn was diagnosed with stage four liver cancer which advanced rapidly. He was told he only had weeks to live.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Political journalists and senior politicians have expressed shock at the sudden death of former Daily Express political editor and Member of the European Parliament Patrick O'Flynn, aged 59. He was a prolific commentator for the Express titles and other publications and a loyal supporter of Nigel Farage, serving as a United Kingdom Independence Party MEP from 2014 until 2019. Mr O'Flynn is understood to have died from cancer which advanced rapidly. Friends said he went to the doctor after feeling unwell, was diagnosed with stage four liver cancer and told he only had weeks to live. Leading tributes, Mr Farage said: \"So sad to hear of the passing of Patrick O'Flynn. Paddy was a great journalist, a great thinker, a great patriot and a titan of our joint cause. Thank you, Paddy.\" Boris Johnson said: \"Sad to hear of the loss of Patrick O'Flynn - a truly original conservative journalist who grasped the causes of much of the current discontent. His pieces were always punchy and persuasive. He will be missed.\" And Kemi Badenoch said: \"This is dreadful news. I can't quite believe it. My husband and I always enjoyed Patrick's company. He often messaged me with thoughts on politics. \"We'd agree on substance, then argue over tactics. I teased him about being a secret leftie... but my goodness, he loved his country.\" \n                  What happens when an MP defects to another party?\n                 \n                  General election: UKIP launch manifesto and claim members aren't 'seriously racist'\n                 \n                  UKIP leader Richard Braine pulls out of own party conference over low ticket sales\n                 Broadcaster and former Sunday Express political editor Julia Hartley-Brewer told Sky News: \"It's just a terrible and huge shock. Such a genuinely good bloke.\" Read more politics news:What's in UK-EU Brexit reset deal?Starmer sorry for being 'overly rude' to MP After his election as MEP for the East of England in 2014, Mr O'Flynn was UKIP's spokesman on the economy until 2015, when he stood as the party's candidate in Cambridge in the general election. He quit UKIP in 2018 and joined the Social Democratic Party and stood in the Peterborough parliamentary by-election in 2019 for the SDP, but received only 135 votes."
    },
    {
        "title": "Success of the UK-EU trade deal will depend on whether promises are delivered",
        "description": "I have been chewing over some of the main elements of the UK-EU agreement.&#160;",
        "url": "https://news.sky.com/story/success-of-the-uk-eu-trade-deal-will-depend-on-whether-promises-are-delivered-13371468",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-beth-rigby-sir-keir-starmer_6921156.jpg?20250519013458",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-05-20 11:40:00",
        "Headline": "The UK and the EU agreed a new trade deal on Monday - the first since Boris Johnson's Brexit deal in 2020.",
        "Content": "\n          Political editor\n              @BethRigby\n I have been chewing over some of the main elements of the UK-EU agreement.  The reset was big on symbolism as the two sides committed to work together in a new post-Brexit era, and meet formally every year to that end. The acid test is how does this now develop? A key element - and prize for both sides - will be UK access to the EU's €150bn rearmament fund. Politics latest: Starmer says EU deal shows 'Britain is back' In an interview with Sky News on Monday afternoon, chief EU diplomat Kaja Kallas acknowledged the \"wounds of Brexit\" mean some member states might want UK access limited, amid reports the French had argued for UK access to be capped at 15% of the fund. It is fair to say there is a lack of detail around the pact, but Ms Kallas was clear she didn't see this as a zero-sum game. \"We should invest more in European industry,\" she said. \n                  Use of e-gates by British holidaymakers in EU still not guaranteed, minister suggests\n                 \n                  UK-EU deal tips Britain down path towards Swiss-style arrangement\n                 \n                  UK-EU trade deal: What is in the Brexit reset agreement?\n                 \"But we should also cooperate with our outside partners, like the UK is, because we actually need more defence. We need the defence industry to operate faster, so that the procurement times are shorter and the costs go down.\" She also told me that she expects the UK to be accessing the fund before the year is out, stressing the need for rapid European rearmament, would could be presented as a win for the PM.  On the economic side, the UK government says by 2040 the reset will boost the economy by £9bn, an uplift of 0.3% in GDP. To put that into context, the OBR forecasts the Brexit effect on the economy would lead to GDP being 4% lower by 2035 than it would have been otherwise, so this deal is certainly no game-changer. But it can't be, when the PM set red lines as no return to the customs union, single market or freedom of movement. Conservatives say it is a Brexit betrayal, and Sir Keir Starmer has had to give things up. I noticed at the news conference, when European Commission President Ursula von der Leyen talked about fishing rights, the PM looked like he was chewing on a wasp. But it's clear how important this was for the EU. Read more:What is in the UK-EU trade deal?E-gates not guaranteed for British holidaymakers One EU diplomatic source tells me that the shift from the previous five-year deal until 2026 to a 12-year deal until 2038 was \"long enough to lay a foundation of trust for the reset of this relationship\". Equally, the veterinary agreement will mean the UK will have to align with EU standards and be under the jurisdiction of the European Court of Justice (rule-takers not makers). What the PM has done on the veterinary agreement and the defence and security partnership is to fulfil two manifesto promises.  Two others - a deal for touring artists and recognition of professional qualifications - were not in this deal, and the political sensitivity around the youth mobility scheme wanted by the EU was plain to see, with details of any scheme yet to be agreed I think the key to all of it will be the deliverables. Will e-gates kick in for Brits, will lorry queues lessen and trade become easier, will it help with supermarket prices, will the UK get some big defence contracts, will re-linking the UK and EU energy markets (another part of this agreement) help cut bills, can he avoid a youth mobility plan blowing up in his face? Beyond the symbolism of Monday, in some ways, this was a pretty limited agreement in that there is so much still to be ironed out and sorted out, but there is scope for the UK government to build out from this and show voters some concrete wins."
    },
    {
        "title": "Suspension of trade talks a political signal that Israeli leadership is increasingly isolated",
        "description": "The UK has suspended trade talks with Israel, in protest at what David Lammy called the \"intolerable\" conditions in Gaza, which he said would leave the population at risk of starvation.",
        "url": "https://news.sky.com/story/suspension-of-trade-talks-a-political-signal-that-israeli-leadership-is-increasingly-isolated-13371666",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-palestinians-israel_6922237.jpg?20250520131430",
        "type": "Politics",
        "Author": "Tamara Cohen",
        "Date Published": "2025-05-20 16:31:00",
        "Headline": "It comes with a step change in the UK's language on the humanitarian situation.",
        "Content": "\n          Political correspondent\n              @tamcohen\n  The UK has suspended trade talks with Israel, in protest at what David Lammy called the \"intolerable\" conditions in Gaza, which he said would leave the population at risk of starvation. This is, the foreign office confirms, a UK first, in suspending trade talks for a political or humanitarian reason. The Israeli ambassador in London, Tzipi Hotovely, will be summoned to the Foreign Office to deliver the message. Politics live: PM apologises for being 'overly rude' at PMQs This suspension, with immediate effect, is a political signal that the Israeli leadership is increasingly isolated even among its allies; and intended to ratchet up the pressure to let aid in. It comes with a step change in the UK's language on the humanitarian situation. Keir Starmer on Monday night, in his joint statement with French President Emmanuel Macron and Canadian Prime Minister Mark Carney, said there would be \"concrete steps\" if food and medicine continued to be held up at borders; and this is one of the levers available.  David Lammy, announcing the move and targeted sanctions against West Bank settlers linked to violence, called it a \"dark phase\" in the conflict and said: \"[Benjamin] Netanyahu's actions have made this necessary.\" \n                  'Khan Younis looks like Stalingrad': British doctor in Gaza describes horror - and has message for world leaders\n                 \n                  Dad wrongly pronounced dead after 2014 Israeli bombing killed in airstrike, family says\n                 \n                  'We'll take further concrete actions': UK joins France and Canada in condemning Israel offensive in Gaza - as Palestinian officials say dozens more killed\n                 Trade talks were launched under Rishi Sunak's government, and a 2030 Roadmap was agreed for boosting trade. Gaza live: UK halts trade talks with Israel But although the Labour government committed to continuing with it, the last round of talks was held more than a year ago. Israel has, the UN say, not allowed trucks in for 11 weeks, after saying Hamas steal the aid intended for civilians. Some trucks entered on Tuesday, but aid agencies say it is nowhere near enough. With the collapse of the latest talks between the two sides in Qatar last week, the ceasefire the UK is calling for looks far off. Using economic measures to force the aid issue is likely to be a signal to other allies, including the European Union, to take similar steps."
    },
    {
        "title": "The Thick of It creator reveals scene which cabinet ministers say happened in real life ",
        "description": "The creator of the hit political satire The Thick of It has revealed which scene in the series cabinet ministers have confessed to experiencing in real life. ",
        "url": "https://news.sky.com/story/the-thick-of-it-creator-reveals-scene-which-cabinet-ministers-say-happened-in-real-life-13371810",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-armando-iannucci-the-thick-of-it_6922817.jpg?20250520230117",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-20 22:10:00",
        "Headline": "The Thick of It aired 20 years ago this month and satirised the inner workings of modern British government - but although scenes were made up, they were close to the bone, the show's creator tells Sky News' Electoral Dysfunction podcast. ",
        "Content": " The creator of the hit political satire The Thick of It has revealed which scene in the series cabinet ministers have confessed to experiencing in real life.  Armando Iannucci told Sky News' Electoral Dysfunction live event with Beth Rigby that the writers would make up scenarios to be \"as stupid as they can\" - only to be asked later by Whitehall officials how they had found out about it. One episode in particular that was close to the bone involves Malcolm Tucker, the fictional mouthy communications director of Number 10, telling a cabinet minister the policy he is due to announce to the media is being cancelled because it is too expensive - and he will have to come up with another one on the spot. Mr Iannucci said: \"Sometimes we would come up with stories that were like, we had to invent them, you know, and we thought, let's push it as stupidly as we can. \"And then a couple of weeks later, someone from Whitehall would say, 'how did you find out exactly? We thought we'd kept that very quiet'. \"And you know, the opening episode has them in the back of a car trying to come up with a policy. Malcolm's rung up and said the policy you've called the press to hear, you cannot go ahead, It's too expensive. \"So they've got to come up with a policy that sounds great but will cost nothing. And I've had various former cabinet members say to me quietly, 'I've been in the back of that car'.\" \n                  Caught up in the crossfire: Reporting from an urban war zone\n                 \n                  Starmer's UK-EU deal: What does it mean for you?\n                 \n                  Trump's gift: Why is Air Force One so important to the president?\n                 The Thick of It aired 20 years ago this month, when New Labour was in government. It satirised the inner workings of modern British government, with the focus on the fictitious Department of Social Affairs and Citizenship. Harriet Harman, one of the few senior female figures at the time and now a peer and co-host of Electoral Dysfunction, asked Mr Iannucci if anyone inspired the character Nicola Murray, who was the focus of series three. \"I'm asking for a friend, because basically it's like she was so ineffective, but she was so hard working and a nice person. Yes, but she was utterly destroyed by Number 10 and her ministerial colleagues putting the boot in. \"I just wondered if she was based on anyone in particular?\". Mr Iannucci said everyone in The Thick Of It was \"based either on a composite of different things we've heard in different people or on a kind of guesstimate of what this person might be\"."
    },
    {
        "title": "Thames Water drops £1m bonuses for top bosses after government criticism",
        "description": "Thames Water has \"withdrawn\" plans to pay senior bosses bonuses linked to the company securing a &#163;3bn emergency loan, the environment secretary has said. ",
        "url": "https://news.sky.com/story/thames-water-drops-1631m-bonuses-for-top-bosses-after-government-criticism-13371746",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-thames-water-maintenance_6777656.jpg?20241216120341",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-20 19:09:00",
        "Headline": "The payments were linked to the struggling firm securing a rescue loan of up to £3bn to stave off collapse earlier this year.",
        "Content": "Thames Water has \"withdrawn\" plans to pay senior bosses bonuses linked to the company securing a £3bn emergency loan, the environment secretary has said.  Steve Reed confirmed the proposals had been dropped during an Environment, Food and Rural Affairs (Efra) committee session with MPs on Tuesday. The so-called retention plan would have amounted to 50% of senior bosses' salaries - leading to them getting £1m on top of their annual salaries and regular bonuses. The payments were linked to the struggling firm securing a rescue loan of up to £3bn to stave off collapse earlier this year. The company's chairman had earlier in the day admitted to incorrectly stating the retention plan was \"insisted upon\" by lenders. Thames Water had been \"trying to circumvent\" upcoming rules that can ban water companies from paying bonuses by \"calling their bonuses something different\", Mr Reed told MPs. \"It was the wrong thing to do,\" he said. \"It offends against their own customers' sense of fair play.\" \n                  I was worth my six-figure bonus, says under-fire Thames Water boss\n                 \n                  Thames Water apologises to customers but defends bonuses\n                 \n                  Thames Water delays request for even more expensive bills as six offers of new investment received\n                 A spokesman for Thames said: \"It has never been the Thames Water board's intention to be at odds with the government's ambition to reform the water industry.\" The company's board \"has decided to pause the retention scheme and await forthcoming guidance from the regulator\" in relation to the new rules, he added. In a letter to the committee, Thames Water's chairman Sir Adrian Montague said he may have \"in the heat of the moment […] misspoken\" when he was quizzed on the firm's turnaround at an Efra session last week. Thames Water is England's biggest water firm, supplying around 16 million households across London and the South East. It has been at the centre of growing public outrage over the extent of pollution and rising bills - which have inched higher while executives have been paid huge bonuses. Read more:'I was worth my bonus,' says Thames Water bossOlympian calls for river clean-ups  New rules from the Water Services Regulations Authority (Ofwat) mean bonus payments to bosses can be banned if companies fail to meet standards to protect the environment, consumers and company finances. It could also block payments funded not just by customer money, but by lenders and shareholders."
    },
    {
        "title": "Second man charged and appears in court over fires at properties and car linked to Sir Keir Starmer",
        "description": "A second man has appeared in court charged in connection with a series of fires linked to Sir Keir Starmer.",
        "url": "https://news.sky.com/story/second-man-charged-over-fires-at-properties-and-car-linked-to-sir-keir-starmer-13371326",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-fire-starmer_6915167.jpg?20250520091039",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-20 07:35:00",
        "Headline": "Romanian national Stanislav Carpiuc, from Romford, east London, was arrested at Luton Airport on Saturday and appeared at Westminster Magistrates' Court on Tuesday morning.",
        "Content": "A second man has appeared in court charged in connection with a series of fires linked to Sir Keir Starmer. Romanian national Stanislav Carpiuc was remanded in custody after a hearing at Westminster Magistrates' Court on Tuesday accused of arson with intent to endanger life. He has been charged with conspiring with Roman Lavrynovych, 21, and others unknown to \"damage by fire property belonging to another, intending to damage the property, and intending to endanger the life of another or being reckless as to whether the life of another would thereby be endangered\". The 26-year-old, from Romford, east London, was arrested by counter-terrorism officers at Luton Airport on Saturday as he tried to travel to Romania, the court heard. With the help of a Russian interpreter, Carpiuc, who was born in Ukraine, spoke only to confirm his identity in a short hearing. The charge relates to three fires. Two of the fires took place in Kentish Town, north London. One occurred during the early hours of 12 May at the home where Sir Keir lived before he became prime minister and moved into Downing Street. \n                  Revealed: Why Keir Starmer's strategy to tackle Reform UK could end up backfiring\n                 \n                  Success of the UK-EU trade deal will depend on whether promises are delivered\n                 \n                  Use of e-gates by British holidaymakers in EU still not guaranteed, minister suggests\n                 A car was set alight in the same street four days earlier on 8 May. The other fire took place on 11 May at the front door of a house converted into flats in Islington. Prosecutor Sarah Przybylska said: \"At this stage, the alleged offending is unexplained.\" The court heard Carpiuc gave a no comment interview to police. Defending, Jay Nutkins said his client has lived in the UK for nine years and is currently waiting for his degree results having studied business at Canterbury Christ Church University in Kent. He denies being present at the scene of any of the fires, the court was told. Carpiuc, who was supported by his father in court, was said to work in construction. He will next appear at the Old Bailey on 6 June. Lavrynovych, a Ukrainian national from Sydenham in southeast London, has already been charged with three counts of arson with intent to endanger life in connection with the fires. He denied the charges in a police interview. Lavrynovych appeared at Westminster Magistrates' Court last Friday and was remanded in custody until a further hearing at the Old Bailey also scheduled for 6 June. A third man, aged 34, was arrested in Chelsea in southwest London on Monday on suspicion of arson. He remains in custody, the Metropolitan Police said."
    },
    {
        "title": "Sir Keir Starmer apologises for being 'overly rude' to Plaid Cymru MP Liz Saville Roberts",
        "description": "Sir Keir Starmer has apologised for being \"overly rude\" to a Welsh MP after accusing her of \"talking rubbish\".",
        "url": "https://news.sky.com/story/sir-keir-starmer-apologises-for-being-overly-rude-to-plaid-cymru-mp-liz-saville-roberts-13371545",
        "image_url": "https://e3.365dm.com/22/04/1920x1080/skynews-liz-saville-roberts_5745123.jpg?20220420122445",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-05-20 13:35:00",
        "Headline": "The prime minister was criticised over how he spoke to Plaid Cymru's Westminster leader Liz Saville Roberts when she called out his language in an immigration speech.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Sir Keir Starmer has apologised for being \"overly rude\" to a Welsh MP after accusing her of \"talking rubbish\". The prime minister faced criticism over the way he spoke to Plaid Cymru's Westminster leader Liz Saville Roberts after she suggested he had dropped his principles to launch a crackdown on migration. Politics Live: Minister admits there is no guarantee of e-gate use Addressing her again in the House of Commons on Tuesday, he said: \"I think last week I was overly rude and I apologise. I do respect the honourable member.\" The row centred on language used by Sir Keir to justify measures to curb legal migration, including banning care homes from hiring overseas and tightening the rules to gain settled status. The prime minister said that without a system that is \"controlled and fair\" the UK risked becoming an \"island of strangers\", something many MPs associated with the infamous \"Rivers of Blood\" speech by the late Conservative MP Enoch Powell. Speaking at Prime Minister's Questions last Wednesday, Ms Saville Roberts said: \"This prime minister once spoke of compassion and dignity for migrants, and for defending free movement. \n                  Sir Keir Starmer refuses to say whether 'genocide' is taking place in Gaza following UN warning\n                 \n                  People do feel like strangers in Britain - but it's not just because of migration, polling finds\n                 \n                  UK has not asked about asylum return hubs, other Balkan countries say\n                 \"Now he talks of 'islands of strangers' and 'taking back control'. Somebody here has to call this out. \"It seems the only principle he consistently defends is whichever he last heard in a focus group. So I ask him, is there any belief he holds which survives a week in Downing Street?\" Sir Keir hit back: \"Yes - the belief that she talks rubbish.\" Afterwards, Ms Saville Roberts claimed her comment had clearly \"struck a nerve\" and the expression on the faces of many Labour MPs showed \"plenty of them know I was right\". Sir Keir's apology came after the Dwyfor Meirionnydd MP raised a question about the new trade deal with the EU, in which she referred to a \"recent tendency to dismiss the views of others\". Ms Saville Roberts told Sky News that she welcomes the prime minister's remarks adding: \"The chamber is a better place for people admitting their mistakes. \"The prime minister was noticeably more at ease today discussing improving our relationship with the EU than while delivering his divisive 'nation of strangers' comments. \"I reminded him today of his previous comments about the importance of retaining the benefits of the single market. Let's see him now take a step further and commit to restoring those benefits.\" Downing Street last week defended the \"island of strangers\" comment, saying Sir Keir had stressed that migrants have made a \"massive contribution\" to society and he was making a point about controlling the system and integration. However Labour peer Harriet Harman told Sky News' Electoral Dysfunction Podcast that Sir Keir should have explained his immigration policy to Ms Saville Roberts rather than \"slapping her down\". \"I just think to call across the chamber, 'you're rubbish' - I think a prime minister has the opportunity to be a bit more magisterial in that,\" she said. She said she has \"been that woman standing there asking the prime minister a heartfelt and serious question, and had the prime minister say, 'you're rubbish'\". Former home secretary James Cleverly also criticised the prime minister saying his response was \"unbelievably and unnecessarily rude\"."
    },
    {
        "title": "What astronauts could end up eating in space after experiment 'meets objectives'",
        "description": "Feeding astronauts is astronomically expensive and as the idea of humans colonising the moon and Mars becomes increasingly realistic, there's a race to find better ways to feed them.",
        "url": "https://news.sky.com/story/what-astronauts-could-end-up-eating-in-space-after-experiment-meets-objectives-13371576",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-nasa-space-food_6922479.jpg?20250520193724",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-05-20 14:35:00",
        "Headline": "A team that recently launched a mini-laboratory into orbit to test if lab-grown food could be grown in space says its experiment was a success - so could astronauts soon be chomping on steaks?",
        "Content": "\n          Science and Technology reporter\n       Feeding astronauts is astronomically expensive and as the idea of humans colonising the moon and Mars becomes increasingly realistic, there's a race to find better ways to feed them. It costs an estimated £20,000 a day to feed just one human in space, and that will only increase the further away we travel.The bulk of the cost comes from transportation - every extra gram of weight added to a rocket means more fuel burned and less space for money-making \"payloads\" or cargo. Fresh food is also unlikely to last a full trip to the International Space Station (ISS), let alone a trip to the moon's south pole or Mars. Instead, space agencies and scientists around the world are trying to work out how to make food where the astronauts are, instead of transporting it all from Earth. A team that recently launched a mini-laboratory into orbit to test, for the first time, if lab-grown food could be grown in space told Sky News its experiment \"met the mission's objectives\". \"This is our first step towards... a future where we can produce food, materials, pharmaceuticals, chemicals and fuels needed for space exploration directly where and when it is needed,\" said one of the team's scientists, Dr Rodrigo Ledesma-Amaro from Imperial College, London. Their mission may lay the groundwork for cheaper and more varied food in space, as more of us blast off to the stars. Lab-grown steaks, Chinese food and more One option for feeding astronauts is \"precision fermenting\" food in space, which is what Dr Ledesma-Amaro's team are attempting. \"Precision fermentation is how we make beer, how we make bread, how we make kimchi,\" he said. It's also how some vegetarian proteins like Quorn are made. \"It's healthy [and] it can give us all the protein and micronutrients we need.\" An advantage of using microorganisms to grow food in space, where they'll face extreme conditions like microgravity, high radiation and potentially high temperatures, is their hardiness. \"When we go to extreme environments like the top of the mountain or the bottom of the sea, the only organisms are the microorganisms,\" said Dr Ledesma-Amaro. \"So they are the ones that can adapt better to this extreme environment.\" Read more:Why do moon's two sides look so different?Where half-tonne rock may have crashed through atmosphereStrange things that happened in space Fermenting microorganisms to create different foods doesn't mean everything will get the slightly sour, fermented taste of pickles or beer. Instead, scientists can make a fermented version of pretty much anything. \"On Earth, there are companies producing milk proteins and making milk without cows, or maybe taking proteins and making steaks,\" said Dr Ledesma-Amaro. Aqeel Shamsul, chief executive of Frontier Space, said the huge variety of food they'll be able to make will also boost astronauts' morale. \"You can get all the base ingredients for Chinese cuisine, for example, and then make the dish that you want,\" he said. \"It's really important to be able to support the astronauts, but also for morale purposes.\" Growing fresh fruit and veggies Another option for feeding people in space is from traditional horticulture, with a twist. On the ISS, there is a small, experimental garden tended to by astronauts known as Veggie. Lettuce, cabbage, kale and flowers have all been grown in the garden, according to NASA, with the vegetables adding variety to the astronauts' diets. The Veggie garden is roughly the size of a carry-on bag and can hold six plants, which grow in a \"pillow\" filled with clay compost and fertiliser. The pillows help distribute water, nutrients and air around the roots. Without the pillows, the roots could drown or get mouldy, because in space, fluids tend to form bubbles. Freeze-dried fare Finally, there's the traditional packaged or freeze-dried fare astronauts currently eat in space. NASA astronauts, for example, can choose from a menu of freeze-dried food and drink powders as well as \"cookies, candy, and other dried goods\", according to the US space agency. Some astronauts even take their own bespoke creations with them, like Britain's Tim Peake, who took tins of luxury food like stewed apples and bacon sandwiches created by Heston Blumenthal to the ISS. But when humans fly further into space without access to resupply shipments, the vitamins in those packaged foods will break down over time, according to NASA. That could lead to deficiencies in astronauts' diets, which is why so many people are investigating new ways to make food in space."
    },
    {
        "title": "HSBC 'being attacked all the time' by online criminals - as boss 'kept awake at night' by cyber threat",
        "description": "The boss of one of the UK's biggest banks says it is being attacked \"all the time\" by online criminals and he is kept up at night by cyber threats.",
        "url": "https://news.sky.com/story/hsbc-being-attacked-all-the-time-by-online-criminals-as-boss-kept-awake-at-night-by-cyber-threat-13371429",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-computer-laptop-ai_6921561.jpg?20250519161855",
        "type": "Technology",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-05-20 10:42:00",
        "Headline": "Appearing before MPs, HSBC UK chief executive Ian Stuart and other bank bosses addressed the threat of cyber attacks.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The boss of one of the UK's biggest banks says it is being attacked \"all the time\" by online criminals and he is kept up at night by cyber threats. \"It does keep me awake,\" HSBC UK chief executive Ian Stuart told the Treasury Committee of MPs. \"Because we can be attacked and we are being attacked all the time.\" Money blog: 'Highest ever' bank switching offer launches Mr Stuart said banks were spending \"enormous\" sums of hundreds of millions of pounds on IT systems - the biggest expense in their businesses. \"Cybersecurity is now very much at the top of our agenda,\" he added. Concerns were also highlighted by Lloyds Bank chief executive Charlie Nunn, who said financial fraud will get worse if banks cannot intervene to prevent it and social media and telecoms companies are not incentivised to halt it. Mr Nunn said the UK \"has become the home of fraud\", adding that the number of victims is \"pretty disturbing\" and \"individual cases are harrowing\". Major high street businesses, including M&S and the Co-op, have been hit by cyber attacks in recent weeks and had their operations impacted.  Cybersecurity threats, however, were not behind the several-day outage at Barclays at the end of January, its UK chief executive Vim Maru said. He added: \"We've learned the lessons. We're acting on the lessons, both work done internally, but also with help from third parties as well. Account holders across the UK have suffered a spate of IT glitches from different banks around paydays this year. Tens of millions of pounds on IT have been spent and customer glitches have fallen, Mr Maru said.   He added that the problem at Barclays was a software issue, saying: \"We put a fix in place that means that we won't have a recurrence.\" "
    },
    {
        "title": "Elon Musk says he will remain Tesla CEO and plans to cut back on political spending",
        "description": "Elon Musk has said he is committed to remaining as Tesla's chief executive for at least five years, as the electric carmaker faces pressure from consumers and the stock market over his work with Donald Trump's government.",
        "url": "https://news.sky.com/story/elon-musk-says-he-will-remain-tesla-ceo-and-plans-to-cut-back-on-political-spending-13371591",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-elon-musk-doha_6922437.jpg?20250520155440",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-20 14:46:00",
        "Headline": "The world's richest man said he will cut back on political spending after heavily backing the US president last year.",
        "Content": "Elon Musk has said he is committed to remaining as Tesla's chief executive for at least five years, as the electric carmaker faces pressure from consumers and the stock market over his work with Donald Trump's government. The world's richest man said he will cut back on political spending after heavily backing the US president last year. During a video appearance at the Qatar Economic Forum hosted by Bloomberg, a moderator asked: \"Do you see yourself and are you committed to still being the chief executive of Tesla in five years' time?\" Musk responded: \"Yes.\" The moderator added: \"No doubt about that at all?\" Musk chuckled and replied: \"I can't be still here if I'm dead.\" Tesla has borne the brunt of the outrage against Musk over his work with Mr Trump as part of his Department of Government Efficiency (DOGE), which implemented cuts across the US federal government. Asked if the reaction made him think twice about his involvement in politics, Musk said: \"I did what needed to be done. \"I'm not someone who has ever committed violence and yet massive violence was committed against my companies, massive violence was threatened against me.\" He added: \"Don't worry: We're coming for you.\"  Musk spent at least 250 million dollars (£187m) supporting Mr Trump in the presidential campaign, and even held some of his own campaign rallies. \"I'm going to do a lot less in the future,\" Mr Musk said. Asked why, he responded: \"I think I've done enough.\" And he added: \"Well, if I see a reason to do political spending in the future, I will do it. I do not currently see a reason.\" Read more:US has a red line in Ukraine-Russia talks, says TrumpKing writes to Biden after he reveals cancer diagnosis Aspirations to build 'billions of humanoid robots' It comes after a Tesla pay package Musk was due, once valued at $56bn (£41.8bn) was stopped by a judge in Delaware. Musk referred to chancellor Kathaleen St Jude McCormick as an \"activist who is cosplaying a judge in a Halloween costume\". But he acknowledged his Tesla pay was part of his consideration about staying with Tesla, though he also wanted \"sufficient voting control\" so he \"cannot be ousted by activist investors\". \"It's not a money thing, it's a reasonable control thing over the future of the company, especially if we're building millions, potentially billions of humanoid robots,\" he added."
    },
    {
        "title": "Longer term weather forecasts could get more accurate - thanks to the cloud",
        "description": "The Met Office has transferred to a new off-site supercomputer - which could make 14-day forecasts as accurate as seven-day equivalents.",
        "url": "https://news.sky.com/story/how-longer-term-weather-forecasts-could-become-more-accurate-thanks-to-the-cloud-13371273",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-uk-weather-sun-margate_6902691.jpg?20250501152048",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-20 00:34:00",
        "Headline": "Operating using Microsoft's cloud-based system Azure, the Met Office said the computer could make its 14-day forecasts as accurate as its 7-day equivalent",
        "Content": "The Met Office has transferred to a new off-site supercomputer - which could make 14-day forecasts as accurate as seven-day equivalents. Operating using Microsoft's cloud-based Azure system, the new computer could also help predict extreme weather further in advance and advance climate research. The weather agency used its first supercomputer 60 years ago, but until now it has almost always been run on site. For more than a month, Azure has been running off-site simultaneously with the Met Office's previous supercomputer, which has now been switched off. Find out the forecast for your area Chief executive officer Penny Endersby said on the agency's website that \"a big change like this is like changing the engines when you're flying over the Atlantic\" - noting that the new computer had already been running in parallel with its old system for more than a month. \"You can never have a stop, which is why we did the long parallel run with the old supercomputer,\" she added. \n                  Water warnings issued as UK experiences 'unusually dry' spring\n                 \n                  Thunderstorms forecast for large part of UK as Met Office issues weather warning\n                 \n                  UK weather: Hot spell to end over May bank holiday as temperatures fall sharply\n                 \"So, success at this phase is that nobody can tell the difference.\" Charles Ewen, the weather agency's chief information officer, said the Met Office uses numerical weather prediction \"to predict the future state of the atmosphere\" which \"takes the laws of physics that are fairly well understood and applies them at scale\". He added: \"To do that is very, very computationally expensive. It's simulating the future state of the atmosphere. \"Operationally, that's 200 to 300 terabytes of information a day.\" Using Azure, he said the Met Office will be able to start fresh projects without having to build new infrastructure. Read more:Boy, 17, charged after teenager stabbed to death on beachThe Who drummer sacked from band for second time Segolene Berthou, head of a research team working on the Met Office's environmental prediction capabilities, added that the supercomputer will also allow for a model to be run several times with slightly different parameters. \"The coupled system we're preparing is running faster and more smoothly on the new supercomputer,\" she said. \"This is very good news because it means we can now be even more confident in our climate projections and have longer slices of time running this model.\""
    },
    {
        "title": "Cassie's mum describes Diddy's sex tape threats - as 'The Punisher' gives testimony",
        "description": "The mother of Cassie Ventura has told a court she felt \"physically sick\" when her daughter told her Sean \"Diddy\" Combs had threatened to \"release two explicit sex tapes\" after discovering his long-time girlfriend was dating someone else. ",
        "url": "https://news.sky.com/story/cassies-mum-describes-diddys-sex-tape-threats-as-the-punisher-gives-testimony-13371804",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-regina-ventura-diddy_6922815.jpg?20250520225922",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-05-20 20:47:00",
        "Headline": "During the seventh day of the Sean \"Diddy\" Combs trial, the court heard of his explicit sex tape threats to Cassie when he discovered she was dating rapper Kid Cudi, and a male escort called \"The Punisher\" stepped on to the stand.  ",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n The mother of Cassie Ventura has told a court she felt \"physically sick\" when her daughter told her Sean \"Diddy\" Combs had threatened to \"release two explicit sex tapes\" after discovering his long-time girlfriend was dating someone else.  Giving evidence on Tuesday, the seventh day of the trial, Regina Ventura said she did not initially understand the email Cassie sent her in December 2011, saying, \"The sex tape threw me, [Diddy] was trying to hurt my daughter.\" The email said Combs was planning to release two explicit videos of her and send someone to hurt her and the man she was seeing, rapper Kid Cudi, whose real name is Scott Mescudi. Regina said the family took out a home equity loan and paid Diddy $20,000 to recoup money he had spent on Cassie \"because he demanded it,\" angry that Cassie was now dating Cudi. She said the money was returned days later. During her evidence, jurors were shown photographs of bruises on Cassie's body Ms Ventura said were taken when her daughter returned home for Christmas in 2011. Regina's time on the stand was fairly brief, as the defence declined the opportunity to question her. \n                  Pop star says Sean 'Diddy' Combs threatened to kill her if she spoke about violence as Cassie's ex-best friend gives evidence\n                 \n                  New York helicopter crash tour company to close immediately, says FAA\n                 \n                  Private plane crash in New York kills ex-college football star Karenna Groff and family\n                 Sean 'Diddy' Combs trial: Day 7 - As it happened Prosecutors say Combs, the founder of Bad Boy Records, forced women to take part in days-long, drug-fuelled sexual performances known as \"Freak Offs\" from 2004 to 2024, facilitated by his large retinue of staff. Combs, 55, has pleaded not guilty. The rapper faces five criminal counts: one count of racketeering conspiracy; two counts of sex trafficking by force, fraud or coercion; and two counts of transportation to engage in prostitution. Last week, the prosecutors' star witness, Cassie Ventura, who dated Combs for over a decade, spent four days giving evidence. Combs's legal team has sought to show jurors that his relationship with Ventura was complicated, and while they acknowledge he was an abusive partner, and had substance issues, they say the sex acts described by the prosecution were consensual. Read more:Everything you need to know about the Sean Combs trialThe rise and fall of Sean 'Diddy' Combs 'Diddy wanted our bodies to shine' A male exotic dancer nicknamed \"The Punisher\" also gave testimony, telling jurors that in the autumn of 2012, Cassie contacted him asking him to \"create a sexy, erotic scene\" Diddy, and using the pseudonym \"Janet\". Sharay Hayes said he went on to have eight to 12 more encounters with the couple, having sex with Cassie, while Diddy watched from a distance. He described the hotel rooms as routinely being dressed with electric candles and sheet-covered furniture, and says Cassie told him not to \"acknowledge\" her husband, and to \"try not to look at him and no communication\". He says Diddy would often wear a cap, and he could not see his face, but he later realised it was the famous rapper. \"The Punisher\" mentioned using a \"considerable amount of baby oil\" during the performances, saying \"[Diddy] wanted us to keep our bodies covered, to shine\". He later described the acts as \"a fetish type thing,\" and while he said he believed Cassie was fully consensual, he also said he \"did occasionally see her sigh or wince\" and said she would frequently look at Diddy \"for cues\". Paid between $1,200 (£900) and $2,000 (£1.500) for each performance, he said he was not called back after struggling to get an erection during one encounter. He said he never saw Diddy use drugs or saw filming during any of the performances. Car park dispute with Suge Knight David James, Diddy's ex-personal assistant, also completed his evidence and testified that he never saw physical violence between Cassie and his former boss. James, who worked for Diddy for two years, said he left Diddy's employment after he realised his \"life was in danger\" following a dispute in a car park with rival record label owner Suge Knight, which culminated in Diddy bringing three handguns to try to find Knight and his entourage. He also detailed an altercation between Diddy and his personal chef, Jourdan Atkinson, and said he refused to file a police report after Diddy told him to say \"Chef Jourdan hit him first\". The final person to give evidence was a special agent responsible for planning the March 2024 raids on Combs's Miami home on Star Island. Steve Gannon showed photos of items taken during the raid, including sex toys, high heels and loaded guns, and explained how an armoured vehicle was used to break down the mansion's front gate to gain entry while the family was away on a trip. Combs has been held in the Metropolitan Detention Center in Brooklyn since September and faces at least 15 years or possibly life in prison if convicted. The trial is set to last for around two months."
    },
    {
        "title": "George Wendt, who played Norm in Cheers, dies at age of 76",
        "description": "Actor George Wendt, who played Norm Peterson in the iconic sitcom Cheers, has died at the age of 76.",
        "url": "https://news.sky.com/story/george-wendt-who-played-norm-in-cheers-dies-at-age-of-76-13371602",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-george-wendt-cheers_6922694.jpg?20250520212326",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-20 15:10:00",
        "Headline": "Wendt's character as an affable, beer-loving barfly in Cheers was watched by millions in the 1980s - earning him six consecutive Emmy nominations for best supporting actor.",
        "Content": "Actor George Wendt, who played Norm Peterson in the iconic sitcom Cheers, has died at the age of 76. His family said he died early on Tuesday morning, peacefully in his sleep. \"George was a doting family man, a well-loved friend and confidant to all of those lucky enough to have known him. He will be missed forever,\" the family said in a statement. His character as an affable, beer-loving barfly in Cheers was watched by millions in the 1980s - earning him six consecutive Emmy nominations for best supporting actor. The sitcom was based in a Boston bar \"where everybody knows your name\" - proved true given everyone would shout \"Norm!\" when he walked in. Cheers also starred Ted Danson, Shelley Long, Rhea Perlman, Kelsey Grammer, John Ratzenberger, Kirstie Alley and Woody Harrelson. The show would spin off another success in Frasier and was nominated for 117 Emmy Awards, winning 28 of them. Wendt appeared in all 273 episodes of Cheers - with his regular first line of \"afternoon everybody\" a firm fan favourite. \n                  Cassie's mum describes Diddy's sex tape threats - as 'The Punisher' gives testimony\n                 \n                  The Thick of It creator reveals scene which cabinet ministers say happened in real life \n                 \n                  Sesame Street heading to Netflix after Trump cut PBS funding\n                 He was also a prominent presence on Broadway - appearing on stage in Art, Hairspray and Elf. Before rising to fame, he spent six years in Chicago's renowned Second City improvisation troupe. Read more from Sky News:Inside Diddy's star-studded partiesSesame Street heading to Netflix In an interview with GQ magazine, he revealed he did not have high hopes when he auditioned for the role that would catapult him to fame. \"My agent said: 'It's a small role, honey. It's one line. Actually, it's one word.' The word was 'beer.' \"I was having a hard time believing I was right for the role of 'the guy who looked like he wanted a beer.' \"So I went in, and they said, 'It's too small a role. Why don't you read this other one?' And it was a guy who never left the bar.\" One of nine children, Wendt was born in Chicago and graduated with a degree in economics. He married actress Bernadette Birkett in 1978, who voiced the character of Norm's wife in Cheers but never appeared on screen. They have three children. Wendt's nephew is Jason Sudeikis, who played the lead role in Ted Lasso."
    },
    {
        "title": "The Thick of It creator reveals scene which cabinet ministers say happened in real life ",
        "description": "The creator of the hit political satire The Thick of It has revealed which scene in the series cabinet ministers have confessed to experiencing in real life. ",
        "url": "https://news.sky.com/story/the-thick-of-it-creator-reveals-scene-which-cabinet-ministers-say-happened-in-real-life-13371810",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-armando-iannucci-the-thick-of-it_6922817.jpg?20250520230117",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-20 22:10:00",
        "Headline": "The Thick of It aired 20 years ago this month and satirised the inner workings of modern British government - but although scenes were made up, they were close to the bone, the show's creator tells Sky News' Electoral Dysfunction podcast. ",
        "Content": " The creator of the hit political satire The Thick of It has revealed which scene in the series cabinet ministers have confessed to experiencing in real life.  Armando Iannucci told Sky News' Electoral Dysfunction live event with Beth Rigby that the writers would make up scenarios to be \"as stupid as they can\" - only to be asked later by Whitehall officials how they had found out about it. One episode in particular that was close to the bone involves Malcolm Tucker, the fictional mouthy communications director of Number 10, telling a cabinet minister the policy he is due to announce to the media is being cancelled because it is too expensive - and he will have to come up with another one on the spot. Mr Iannucci said: \"Sometimes we would come up with stories that were like, we had to invent them, you know, and we thought, let's push it as stupidly as we can. \"And then a couple of weeks later, someone from Whitehall would say, 'how did you find out exactly? We thought we'd kept that very quiet'. \"And you know, the opening episode has them in the back of a car trying to come up with a policy. Malcolm's rung up and said the policy you've called the press to hear, you cannot go ahead, It's too expensive. \"So they've got to come up with a policy that sounds great but will cost nothing. And I've had various former cabinet members say to me quietly, 'I've been in the back of that car'.\" \n                  Caught up in the crossfire: Reporting from an urban war zone\n                 \n                  Starmer's UK-EU deal: What does it mean for you?\n                 \n                  Trump's gift: Why is Air Force One so important to the president?\n                 The Thick of It aired 20 years ago this month, when New Labour was in government. It satirised the inner workings of modern British government, with the focus on the fictitious Department of Social Affairs and Citizenship. Harriet Harman, one of the few senior female figures at the time and now a peer and co-host of Electoral Dysfunction, asked Mr Iannucci if anyone inspired the character Nicola Murray, who was the focus of series three. \"I'm asking for a friend, because basically it's like she was so ineffective, but she was so hard working and a nice person. Yes, but she was utterly destroyed by Number 10 and her ministerial colleagues putting the boot in. \"I just wondered if she was based on anyone in particular?\". Mr Iannucci said everyone in The Thick Of It was \"based either on a composite of different things we've heard in different people or on a kind of guesstimate of what this person might be\"."
    },
    {
        "title": "Sesame Street heading to Netflix after Trump cut PBS funding",
        "description": "Netflix and Sesame Street have agreed a deal that will bring the children's show to the streaming platform's wider audience after President Trump cut federal funding for the free-to-air TV network Public Broadcasting Service (PBS).",
        "url": "https://news.sky.com/story/sesame-street-heading-to-netflix-after-trump-cut-pbs-funding-13371338",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-sesame-street-bert_6523964.jpg?20240417075032",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-20 08:28:00",
        "Headline": "Later this year new episodes of the children's show will be shown on Netflix as well as PBS and the PBS Kids app on the same day.",
        "Content": "Netflix and Sesame Street have agreed a deal that will bring the children's show to the streaming platform's wider audience after President Trump cut federal funding for the free-to-air TV network Public Broadcasting Service (PBS). Later this year, new episodes will be shown on Netflix as well as PBS and the PBS Kids app on the same day. Select past episodes will be available on Netflix worldwide. No specific start date has been announced. It comes after Warner Bros Discovery decided last year not to renew its deal for new episodes on HBO and Max, though episodes will remain on there until 2027. That was followed by Donald Trump issuing an executive order earlier this month to block federal funding to PBS and the National Public Radio (NPR) network, because he believes their coverage is biased. For the show's 56th season, the episodes will revolve around one 11-minute story, Netflix said. It will feature more exploration of the Sesame Street neighbourhood and also give a look inside 123 Sesame Street, which houses Elmo, Bert and Ernie, and others. Sesame Street said on X: \"We are excited to announce that all new Sesame Street episodes are coming to @netflix worldwide along with library episodes, and new episodes will also release the same day on @PBS Stations and @PBSKIDS platforms in the US, preserving a 50+ year relationship. \"The support of Netflix, PBS, and the Corporation for Public Broadcasting serve as a unique public-private partnership to enable Sesame Street to continue to help children everywhere grow smarter, stronger, and kinder.\" Read more:Second man charged over fires at properties linked to StarmerEU members want UK access to rearmament fund limitedPop star says Diddy threatened to kill her Sesame Workshop said in a statement: \"This unique public-private partnership will enable us to bring our research-based curriculum to young children around the world with Netflix's global reach, while ensuring children in communities across the US continue to have free access on public television to the Sesame Street they love.\" Sesame Street has won more than 200 Emmys in addition to Peabody awards, as well as a Kennedy Centre Honour for lifetime artistic achievement."
    },
    {
        "title": "Royal sculptor makes bust of Dame Judi Dench live on stage to be auctioned for lymphoedema research",
        "description": "A sculpture of Dame Judi Dench is being auctioned off to raise funds for lymphoedema research.",
        "url": "https://news.sky.com/story/royal-sculptor-makes-bust-of-dame-judi-dench-live-on-stage-to-be-auctioned-for-lymphoedema-research-13371352",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-dame-judi-dench-sculpture_6922041.jpg?20250520101121",
        "type": "Entertainment",
        "Author": "Debbie Ridgard",
        "Date Published": "2025-05-20 08:52:00",
        "Headline": "Sculptor Frances Segelman's past subjects include Queen Elizabeth II, King Charles, and Prince Philip. ",
        "Content": "\n          Entertainment reporter\n              @Debbie_Ridgard\n A sculpture of Dame Judi Dench is being auctioned off to raise funds for lymphoedema research. The acting legend sat for royal sculptor Frances Segelman in front of an audience at Claridge's in London on Monday night. Speaking to Sky News, Dame Judi Dench said she wanted to do something to help her friend, photographer Gemma Levine, who was diagnosed with the disease 15 years ago and organised the event. \"Gemma photographed me a very long time ago and we got on very well, we hit it off,\" she said. \"I didn't know about lymphoedema then but I have an assistant Jen, who is my assistant in the theatre and she has lymphoedema, [so] through them I've become aware of it and aware of how much we need to be aware of it.\" Read more from Sky NewsPop star tells trial Diddy threatened to kill herGary Lineker confirms swift exit from BBCEurovision 2025 in pictures The actor has been facing her own health issues after being diagnosed with macular degeneration, recently telling Trinny Woodall's podcast she can no longer go out alone as her vision has deteriorated significantly. The event doubled as a birthday celebration for the renowned actor, who turned 90 in December. There were several surprise moments, from Simon Callow reciting poetry on stage to an opera singer leading a chorus of Happy Birthday. Dame Judi's daughter Finty Williams took to the stage as the sculpture was being made to reflect on her relationship with her. Before reading an excerpt from the children's book Guess How Much I Love You, she noted how the pair always recite the line: \"I love you to the moon and back.\" Visibly emotional, the award-winning actor said she was pleasantly surprised by her daughter's public display of love. \"I didn't know that was going to happen. I had no idea,\" she said. King Charles among sculptor's past subjects Two statues will be made from the sculpture carved in Mayfair - one for Dame Judi and another to be sold at auction to raise funds for lymphoedema research through St George's Hospital Charity. Lymphoedema is a chronic condition that causes swelling in the body, typically in the arms and legs, and develops when the lymphatic system is not working properly. Frances Segelman is also known as Lady Petchey as she was married to businessman and former Watford FC chairman Sir Jack Petchey, who also had the condition. Her previous work includes busts of Queen Elizabeth II, King Charles, and Prince Philip. Getting the chance to sculpt Dame Judi was a \"dream come true\", she said. \"She's been amazing, amazing, amazing,\" she told Sky News. \"[Dame Judi] has got a very pixie-like face, very young, very happy and really gorgeous [with] an amazing spirit that shines through. It's been absolutely wonderful to be able to sculpture her - such a privilege.\""
    }
]