[
    {
        "title": "Former world champion boxer Ricky Hatton has died aged 46",
        "description": "Former world champion boxer Ricky Hatton has died aged 46.",
        "url": "https://news.sky.com/story/former-world-champion-boxer-ricky-hatton-has-died-aged-46-report-13430761",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/cdf9088f2b9c35f3ca3fb34bf5cf1f0fa47d6f4195b3b0fc379c35eea3894971_7020079.jpg?20250914125304",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-14 11:13:00",
        "Headline": "Ricky Hatton had 45 victories and just three defeats over a 15-year career, but had been open about his personal demons.",
        "Content": " Former world champion boxer Ricky Hatton has died aged 46. During his career between 1997 and 2012, the British fighter - nicknamed \"The Hitman\" - won titles in the light welterweight and welterweight divisions. As it happened: Tributes paid to former boxing world champion In July this year, he announced he was coming out of retirement for a December bout in Dubai, 13 years on from his last professional match. The Manchester boxer had been set to fight Eisa Al Dah on 2 December. In 2023, Sky broadcast a documentary exploring the boxer's life in the ring, his fractured personal life and his continuing mental health battles. Greater Manchester Police said on Sunday: \"Officers were called by a member of the public to attend Bowlacre Road, Hyde, Tameside, at 6.45am today where they found the body of a 46-year-old man. \"There are not currently believed to be any suspicious circumstances.\" Sky News sport correspondent Rob Harris called Hatton \"one of the great personalities of British boxing,\" crediting him with \"galvanising the sport\". He said: \"As he would travel around the world, winning fights, he would bring that huge fan base with him… To have the career he had, with 45 victories and three defeats, was impressive... \"This will be devastating to many boxing fans and particularly his family, given it was just weeks before he was due to make his comeback… So many people will be reflecting on just what a contribution and what an icon he was to British boxing and just how he could seem so ordinary as well, while still achieving great sporting heights\". During his 15-year professional career, Hatton held multiple world championships at light-welterweight and one at welterweight class. In his prime, Hatton secured victories over the likes of Kostya Tszyu and Jose Luis Castillo, before going on to suffer brutal knockout losses to Floyd Mayweather Jr in 2007 and Manny Pacquiao in 2009. Hatton last fought professionally in November 2012, suffering a knockout loss to Ukraine's Vyacheslav Senchenko. He once more returned to the ring for a non-scoring exhibition bout with Marco Antonio Barrera in 2022. Messages from those in the sports world poured in following news of his death, with boxers including Amir Khan, Tyson Fury, Chris Eubank Jr and Barry McGuigan, and footballers Michael Owen and Wayne Rooney all paying tribute. As one of Manchester City's most famous fans, the team announced there would be a minute's appreciation ahead of the Manchester derby on Sunday afternoon. City and England midfielder Phil Foden scored in the 3-0 victory and dedicated the win to Hatton. \"It was for him and his family. It was all for him and we are delighted with the result.\"  Born Richard John Hatton in Stockport, Cheshire, in October 1978, he rose through amateur and domestic levels to become one of the most popular fighters in the first decade of the new century. But he had suffered a series of well-publicised issues in his private life since his 2009 defeat against Pacquiao in their IBO light-welterweight title fight in Las Vegas. Hatton said at the time he did not want to see those demons tarnish his legacy in the sport, and had another world title belt in his sights. In 2010, he was admitted to rehab, struggling with drink and depression. Hatton overcame a fallout with his family and a court case with his former trainer Billy Graham to become a successful trainer, coaching Zhanat Zhakiyanov to a world bantamweight title win in 2017. His down-to-earth attitude endeared him to fans around the world and, in 2024, he joined ITV reality show Dancing On Ice, but was the first celebrity to leave the competition. His professional skating partner, Robin Johnstone, paid tribute on Instagram, saying she was \"beyond sad\" at the \"devastating news,\" adding, \"You were a true friend.\" Arts and entertainment correspondent There are few sporting stars who cross from the newspaper back pages to become front page news... but Ricky Hatton always was one of them. Aside from his boxing brilliance, it was his personality and humour which made people pay attention. In recent years, his happy-go-lucky character saw him cast on reality shows like Dancing on Ice. But what's more interesting is how and why the public came to have such great affection for him back in the day. Putting it kindly, sports stars aren't always known for their sparkling personalities. It was Ricky's lack of interest in the trappings of fame which accompanied his epic run of victories that made him all the more cool. He was the working class hero who seemed unstoppable. It was a story that everyone wanted to follow. Celebrities wanted to be seen alongside him. Piggy-backing off his popularity the likes of Brad Pitt, Angelina Jolie, Denzel Washington and David Beckham were all pictured ringside at one time or another, drawn to his fan-friendly style and impressive winning streak. At the same time as the Gallagher brothers were flying the flag for music from Manchester, Hatton was doing the same for boxing. During his 2008 fight against Paulie Malignaggi, he infamously had Liam and Noel escort him to the ring. In an interview he said he thought all three of them might be killed when Liam held up Hatton's IBO belt inches from Malignaggi's face and with a swagger said 'what do you think about that you d*** head?'. Stories like that are why his appeal extended beyond sport. He was an ordinary bloke who'd done extraordinary things. He never lost sight of who he was and fans loved him for it.   Speaking ahead of his final professional fight in 2012, Hatton, who was a father of three, told reporters: \"I don't want people telling my kids that I blew it. I want my kids to be able to say, 'He was a world champion, he had his problems, but my did he bounce back'. \"I want people to be proud of me again. I want British sport, my kids and my fans and my friends to be proud of me.\" Hatton leaves behind his three children, daughters Millie and Fearne and son Campbell. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Russia's war rehearsals are worrying Europe – but they do offer NATO one thing",
        "description": "On NATO's doorstep, Russia is rehearsing for war.",
        "url": "https://news.sky.com/story/russias-war-rehearsals-are-worrying-europe-8211-but-they-do-offer-nato-one-thing-13431270",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-rusia-russia-belarus_7020771.jpg?20250914190847",
        "type": "Home",
        "Author": "Ivor Bennett",
        "Date Published": "2025-09-14 17:56:00",
        "Headline": "Last time these drills happened, they led to a massive build-up of Russian troops in Belarus, which Moscow used for part of its invasion of Ukraine a few months later.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  On NATO's doorstep, Russia is rehearsing for war. It has deployed tanks, battleships and supersonic bombers for military drills with Belarus that are happening on land, at sea and in the air. 'Zapad-2025' are the allies' first joint exercises since the invasion of Ukraine, and on Sunday involved the launch of a hypersonic missile in the Barents Sea. \"There are several strategic goals here that [Russia and Belarus] want to achieve,\" Hanna Liubakova, an independent Belarusian journalist, told Sky News. \"Scare, show that they are capable, show that they can threaten… and of course, they're also checking what the reaction and response could be.\" The reaction so far has been frosty, to say the least. Ahead of the drills, Poland closed its border with Belarus and deployed more than 30,000 troops as part of its own military exercises. Lithuania is also holding drills and said it would bolster defences along its frontiers with Russia and Belarus. The authorities in Minsk, and in Moscow, insist the drills are defensive and not aimed at any other country. On Friday, the Kremlin even described Europe's concerns as \"emotional overload\". But the last time these drills happened four years ago, it led to a massive build-up of Russian troops in Belarus, which Moscow then used for part of its invasion of Ukraine a few months later. And the drills aren't the only thing Europe is worried about. Read more:First migrants to be sent back to FranceVenue for Charlie Kirk memorial revealed The show of strength comes at a time of heightened tension after recent Russian drone incursions into NATO airspace - first in Poland and then Romania. There's a feeling in the West that the drones and drills are a test of NATO's defences and Western resolve. But you're unlikely to find that opinion on the streets of the Belarusian capital, Minsk. \"There is no aggression,\" Mikhail told Sky News. \"Exercises are normal, especially planned ones. So I think it's fine.\" According to Kristina, Russia and Belarus are \"not the aggressors\". \"I think our head of state [Alexander Lukashenko] will solve this issue and we will support him. He's not aggravating the situation.\" A provocation or not, the drills offer NATO a fresh chance to scrutinise Russia's military, after three-and-a-half years of costly combat in Ukraine. It would feel a lot more comfortable, though, if they weren't happening so close to home."
    },
    {
        "title": "Charlie Kirk suspect Tyler Robinson 'was in romantic relationship with transgender roommate' - Utah governor",
        "description": "The suspect accused of shooting dead right-wing influencer Charlie Kirk was in a romantic relationship with his transgender roommate, Utah's governor has said.",
        "url": "https://news.sky.com/story/charlie-kirk-suspect-tyler-robinson-was-in-romantic-relationship-with-transgender-roommate-utah-governor-13431020",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-tyler-robinson-mushot_7018026.jpg?20250912154005",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-14 14:49:00",
        "Headline": "Utah's Republican governor Spencer James Cox said Tyler Robinson was in a relationship with his roommate - who was in the process of transitioning - though his motive is unclear and officials have not said whether the relationship is relevant to their investigation.",
        "Content": " The suspect accused of shooting dead right-wing influencer Charlie Kirk was in a romantic relationship with his transgender roommate, Utah's governor has said. Tyler Robinson, 22, from Washington in Utah, is due to appear in court on Tuesday after Kirk, 31, was killed during one of his rallies at Utah Valley University on Wednesday. Robinson is being held without bail on suspicion of aggravated murder, a felony discharge of a firearm causing serious bodily injury, and obstruction of justice. According to Utah's Republican governor, Spencer James Cox, he was in a relationship with his roommate - who was in the process of transitioning. \"The roommate was a romantic partner,\" he told NBC News's Meet The Press on Sunday. \"We can confirm that that roommate is a boyfriend who is transitioning from male to female.\" He added that the roommate has been \"incredibly cooperative\" and had \"no idea that this [the shooting] was happening\", but that Robinson has not been cooperating with police. Kirk, who co-founded the conservative student movement Turning Point USA, regularly expressed anti-LGBTQ views. The motive of the shooting is unclear, and officials have not said whether Robinson's relationship - or his roommate's gender - is relevant to their investigation. Authorities are still trying to get access to cloud storage linked to Robinson, according to NBC. Mr Cox has previously said the suspect came from a \"conservative family, but his ideology was very different than his family\", adding in an interview with The Wall Street Journal that he had been \"deeply indoctrinated with leftist ideology\". According to the governor, his relatives have said Robinson was critical of Kirk, saying he was \"full of hate and spreading hate\" and \"talked about why he didn't like him and the viewpoints that he had\".  The 22-year-old is due to be charged when he makes his first court appearance on Tuesday, according to the Utah County attorney's office. He was in his third year of an electrical apprenticeship programme at Dixie Technical College in St George, Utah, NBC reported. A spokesperson for Utah Valley University, where Kirk was speaking when he was shot in the neck, said Robinson studied there for one semester in 2021. Kristin Schwiermann, a neighbour of his family's, described him as \"smart\" and \"quiet\", and added that he \"never caused any problems\".  Memorial to be held at Super Bowl venue It was revealed on Sunday that a memorial to Kirk will be held at the stadium where the 2023 US Super Bowl was held. State Farm Stadium, just outside of Phoenix, Arizona, is home to the American football team the Arizona Cardinals and can hold 60,000 people. President Donald Trump has said he plans to attend and will posthumously award Kirk with the highest US civilian honour - the Presidential Medal of Freedom. Kirk, who hosted his own self-titled podcast, had millions of followers on social media. He was a regular visitor at the White House and has been credited with the increase in young men voting for Mr Trump at the 2024 presidential election."
    },
    {
        "title": "Man arrested in connection with 'racially-motivated rape' in West Midlands",
        "description": "Officers investigating an alleged racially-motivated rape in the West Midlands have arrested a man, police have said. ",
        "url": "https://news.sky.com/story/man-arrested-after-woman-raped-in-racially-motivated-attack-in-west-midlands-13430875",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-police-police-officers_6880101.jpg?20250501101630",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-14 13:05:00",
        "Headline": "News of the arrest comes after members of the Sikh community gathered on Sunday to show support for the woman.",
        "Content": "Officers investigating an alleged racially-motivated rape in the West Midlands have arrested a man, police have said.  Officers were called just before 8.30am on Tuesday after a Sikh woman in her 20s reported being attacked by two white men in the area around Tame Road in Oldbury. The man, who is in his 30s, was detained as part of enquiries on Sunday evening, West Midlands Police said. He remains in custody on suspicion of rape. Chief Superintendent Kim Madill, of Sandwell Police, said: \"This is a significant development in the investigation and we want to thank the community for their continuing support. \"The investigation remains ongoing and we would urge people not to speculate as we work to identify and trace all those who may have been involved.\" News of the arrest comes after members of the Sikh community gathered on Sunday to show support for the woman. Scores of people met outside the Guru Nanak Gurdwara temple in Smethwick, where they conducted prayers and offered their support. They then went to the alleged scene of the crime. Speaking to Sky News at the gathering, local councillor Parbinder Kaur said she was attending the protests as \"a woman, a mother, a grandmother\". Ms Kaur said her religion is one of peace and praying for humanity as a whole, which is why she believes \"this is the time to unite\". Read more:Tributes paid to Ricky HattonWoman, 65, arrested after man found dead The victim, who is entitled to anonymity, previously issued a statement through community group Sikh Youth UK."
    },
    {
        "title": "Prime suspect in Madeleine McCann case refuses to speak to British police",
        "description": "The prime suspect in the disappearance of Madeleine McCann has refused to be interviewed by the Metropolitan Police.",
        "url": "https://news.sky.com/story/prime-suspect-in-madeleine-mccann-case-refuses-to-speak-to-british-police-13431369",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-christian-b-court-germany_6703865.jpg?20250914221937",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-14 20:19:00",
        "Headline": "Christian B is expected to be released from a German prison this week after being jailed for raping an elderly woman - and British police had hoped he might finally address the toddler's disappearance.",
        "Content": "The prime suspect in the disappearance of Madeleine McCann has refused to be interviewed by the Metropolitan Police. German drifter Christian B, as he is known under privacy laws, became a leading person of interest following the three-year-old British girl's disappearance from a holiday resort in Portugal in 2007. He is expected to be released from a jail in Germany as soon as Wednesday, at the end of a sentence for raping an elderly woman in Praia da Luz in 2005. The Met said it sent an \"international letter of request\" to the 49-year-old for him to speak with them - but he rejected it. Madeleine vanished shortly after she was left sleeping by her parents, Kate and Gerry McCann, who went for dinner in a nearby restaurant in Praia da Luz. The Met said Christian B remains a suspect in its own investigation - with Portuguese and German authorities also probing Madeleine's disappearance. He has previously denied any involvement. \n                  Madeleine McCann case: Sky News tracks down woman at centre of hit-and-run theory investigated by police\n                 \n                  Madeleine McCann: Investigators end latest searches for missing British girl\n                 \n                  Madeleine McCann search: Abandoned buildings examined as ground radar may be deployed\n                 Detective Chief Inspector Mark Cranwell, a senior investigating officer, said the force will \"continue to pursue any viable lines of inquiry\" in the absence of an interview with Christian B. He said: \"For a number of years we have worked closely with our policing colleagues in Germany and Portugal to investigate the disappearance of Madeleine McCann and support Madeleine's family to understand what happened... \"We have requested an interview with this German suspect but, for legal reasons, this can only be done via an International Letter of Request which has been submitted. \"It was subsequently refused by the suspect. In the absence of an interview, we will nevertheless continue to pursue any viable lines of inquiry.\" In June, a hit-and-run theory emerged in connection with Madeleine's death. But her mother, Kate, has long dismissed the suggestion her daughter managed to get out of the apartment alone.  A number of searches have been carried out by German, Portuguese and British authorities since her disappearance - with the latest taking place near the Portuguese municipality of Lagos in June. In 2023, investigators carried out searches near the Barragem do Arade reservoir, about 30 miles from Praia da Luz. Christian B spent time in the area between 2000 and 2017 and had photographs and videos of himself near the reservoir. In October last year, the suspect was cleared by a German court of unrelated sexual offences, alleged to have taken place in Portugal between 2000 and 2017. The total funding given to the Met's investigation, titled Operation Grange, has been more than £13.2m since 2011 after a further £108,000 was secured from the government in April."
    },
    {
        "title": "New drone factory to open in Swindon in 2026",
        "description": "A new drone factory will open in Swindon to help produce the uncrewed air systems the UK has sent to fight Russia in Ukraine, the government will announce today.",
        "url": "https://news.sky.com/story/new-drone-factory-to-open-in-swindon-in-2026-13431357",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-john-healey-drone_7020888.jpg?20250914215919",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-14 23:01:00",
        "Headline": "The 254,000-square-foot facility will be operated by the manufacturer Tekever, Defence Secretary John Healey will say at a site visit today.",
        "Content": "A new drone factory will open in Swindon to help produce the uncrewed air systems the UK has sent to fight Russia in Ukraine, the government will announce today. The 254,000-square-foot facility will be operated by Tekever and is due to open in 2026, Defence Secretary John Healey will say at a site visit later. It will create 1,000 jobs and bring core production of the AR5 drone to the UK for the first time, while increasing capacity of existing AR3 production. The UK has bought £270m in Tekever drones to help Ukrainian forces destroy advanced Russian air defence systems since Vladimir Putin launched his invasion in February 2022. It will be the manufacturer's fourth UK site and its largest so far. \"This new factory is a clear demonstration that this government is making defence an engine for growth across the UK,\" Mr Healey is expected to say. \"Tekever's expansion will bring high-skilled jobs and world-leading drone manufacturing to Swindon, while strengthening defence supply chains. \"By backing Britain's defence industry, we strengthen both our economy and national security.\" Read more from Sky NewsBridget Phillipson launches deputy leader bidEx-chancellor to step down as Copper chairBadenoch accuses Starmer of lying about Mandelson Swindon has long had an important defence role, having produced the Supermarine Spitfire during the Second World War. The new Tekever-run site will also take over production of the RAF's StormShroud capability. It comes after defence emerged as one of the key winners of Chancellor Rachel Reeves's spending review in June. The defence budget will increase from 2.3% of gross domestic product (GDP) in 2025 to 2.6% in 2027 - the equivalent of a £600m uplift. In May, Prime Minister Sir Keir Starmer announced an extra £19m in investment of AR3 Tekever StormShroud drones for the RAF. Karl Brew, Tekever's director of defence, said the Swindon factory will play a \"central role\" in the production of AR3 EVO systems and ensure an \"advanced, sovereign capability at pace and in close partnership with the UK defence ecosystem\"."
    },
    {
        "title": "UK and US firms announce deals in new 'golden age' of nuclear power ahead of Trump visit",
        "description": "The prime minister has hailed a new \"golden age\" of nuclear power as British and US companies announce five new commercial deals, ahead of the US president's state visit this week.",
        "url": "https://news.sky.com/story/uk-and-us-firms-announce-deals-in-new-golden-age-of-nuclear-power-ahead-of-trump-visit-13431336",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-cottam-coal-nuclear_7020894.jpg?20250914220336",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-09-14 23:01:00",
        "Headline": "UK and US firms announce five new commercial deals, including for a new nuclear power plant in Hartlepool, before President Trump arrives in the UK on Tuesday. They will be underpinned by a refreshed US-UK agreement to speed up the notoriously slow building process in both countries.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The prime minister has hailed a new \"golden age\" of nuclear power as British and US companies announce five new commercial deals, ahead of the US president's state visit this week. The plans include a new nuclear power plant in Hartlepool using latent, potentially cheaper technology and data centres powered by mini reactors in Nottinghamshire. Officials have been hurrying to coordinate the agreements before President Donald Trump jets in on Tuesday, with the two leaders expected to sign off on multibillion-pound tech deals as well as a revamped agreement to work together on nuclear power. They hope the new Atlantic Partnership for Advanced Nuclear Energy will speed up notoriously slow nuclear projects in both countries by slashing red tape and aligning safety standards. Both governments are betting big on nuclear to meet rising electricity demand and AI's voracious appetite for energy, while Sir Keir Starmer hopes it will boost jobs, growth and manufacturing in former industrial heartlands. The two leaders will also be hoping the high-profile visit will shake off last week's scandal over revelations of the ambassador to the US Lord Mandelson's links with convicted paedophile Jeffrey Epstein, with whom Mr Trump's own association is being scrutinised. The jewel of today's announcements is the plan to replace the outgoing Hartlepool nuclear power plant, which expires in 2028, with a new plant of up to 960MW using new \"advanced modular reactor\" (AMR) technology. \n                  Drill, Kemi, drill! Are Tory oil and gas plans a load of hot air?\n                 \n                  Energy bills expected to rise from October - despite previous forecasts\n                 \n                  Former Virgin Money chief Gadhia to chair energy supplier Ovo\n                 The AMR designer, US firm X-Energy, signed a Joint Development Agreement with British Gas-owner Centrica to build and fund the fleet, which they said would generate 2,500 construction jobs and maintain hundreds when up and running in the 2030s.  What are advanced modular reactors? Advanced or small modular reactors (AMR or SMR) are new, small nuclear power plants hoped to be quicker and faster to build than traditional technology, such as that used at the delayed and overbudget Hinkley and Sizewell sites. Around 80 designs are in development globally and they have long been promised but barely materialised. Read more: Why the UK has warmed up to nuclear power again Industry says SMRs are finally about to breakthrough, given governments' renewed appetite for nuclear power to meet energy security concerns, growing electricity demands and climate targets to phase out polluting fossil fuels. Why tech giants love new nuclear technology Tech giants are also hungry for SMRs to power booming AI data centres, which need the kind of clean, steady, 24/7 energy nuclear can provide. Today EDF announced early-stage plans with US nuclear energy firm Holtec to build data centres powered by SMRs at the former Cottam coal-fired power station in Nottinghamshire. If it goes ahead, it would be worth £11bn and create thousands of jobs during construction. These new reactors need a type of fuel (High-assay low-enriched uranium or HALEU) that is only available to buy commercially from Russia and China. Anxious about energy security, the UK government has been funding a company called Urenco to build a HALEU facility in Cheshire. Urenco has also announced a £4m deal to sell that fuel to the US market, where it is also exploring another manufacturing site. Two further deals to come out today involve a micro plant to power London Gateway Port and the scouting of sites for nuclear reactors designed by Bill Gates's Terrapower.  The news has been welcomed by industry and the union Prospect. Tom Greatrex, chief executive of the UK's Nuclear Industry Association, said: \"These deals are hugely welcome and build on a summer of record government investment in nuclear which is driving an industrial revival, creating thousands of high-value jobs, and strengthening the UK's energy security.\" But critics warn the new technology will still be expensive and slow, arguing the money should instead pay for renewables, batteries and insulating homes to reduce energy demand in the first place. They also fear Britain's disposal facilities can't cope with the nuclear waste. US promises 'nuclear renaissance' Sir Keir said the \"landmark UK-US nuclear partnership\" would \"drive down household bills in the long run, while delivering thousands of good jobs in the short term\". \"Together with the US, we're building a golden age of nuclear that puts both countries at the forefront of global innovation and investment,\" he added. US energy secretary Chris Wright hailed a \"true nuclear renaissance - harnessing the power of commercial nuclear to meet rising energy demand and fuel the AI revolution\". \"Meeting this demand will require strong partnerships with our allies around the world and robust collaboration with private sector innovators,\" he said. \"Today's commercial deals set up a framework to unleash commercial access in both the US and UK, enhancing global energy security, strengthening US energy dominance, and securing nuclear supply chains across the Atlantic.\" Andrew Bowie, shadow energy minister, said: \"All these announcements are simply building on the strong legacy left by the previous Conservative government who kick-started the nuclear revolution in the UK.\""
    },
    {
        "title": "'Toxic cover-up' culture in NHS a risk to mothers and babies, says health chief",
        "description": "Harm to mothers and their babies is at risk of being normalised owing to a \"toxic\" culture of \"cover-up\" in the NHS, the head of the doctors' regulator will say.",
        "url": "https://news.sky.com/story/toxic-cover-up-culture-in-nhs-a-risk-to-mothers-and-babies-says-health-chief-13431385",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-mother-baby-maternity_6552405.jpg?20240513095124",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-14 23:01:00",
        "Headline": "New data shows 27% of obstetrics and gynaecology trainees said they have felt hesitant escalating a patient to a more senior medic - a higher proportion than in other areas of medicine.",
        "Content": "Harm to mothers and their babies is at risk of being normalised owing to a \"toxic\" culture of \"cover-up\" in the NHS, the head of the doctors' regulator will say. Charlie Massey, chief executive of the General Medical Council (GMC), will tell delegates at a conference that \"something must have gone badly wrong\" for one in four trainee doctors to feel fearful of speaking up. In a speech seen by the PA news agency, Mr Massey will tell the Health Service Journal patient safety congress in Manchester: \"That doctors are making life and death decisions in environments where they feel fearful to speak up is profoundly concerning. \"Those are the very factors that lead to cover-up over candour and obfuscation over honesty. And it is in those cultures that the greatest patient harm occurs.\" Maternity care is \"one of the most high-risk and high-pressure areas of medicine\", he will continue. \"One where the consequences of things going wrong can be especially tragic and far-reaching, affecting both a mother and her baby, not to mention their wider family.\" GMC shows that 27% of obstetrics and gynaecology trainees said they have felt hesitant escalating a patient to a more senior medic - a higher proportion than in other areas of medicine. \n                  Wes Streeting pushes forward with ban on high caffeine energy drinks for under-16s\n                 \n                  'My husband broke it off after I became disabled' - how relationships can be rocked by serious illness\n                 \n                  What vaccines are children recommended to have and when?\n                 The specialty also has above-average rates of workload stress, bullying and doctors who feel unsupported by colleagues, according to the findings.  Mr Massey will say the data \"suggest[s] a situation where, too often, patient safety is falling victim to unhealthy culture\". \"The unthinkable - harm to mothers and their babies - is at risk of being normalised,\" he will add. \"And toxic culture is in no small part to blame.\" Read more:Where does your hospital rank in NHS league tables?Mum welcomes 'sci-fi' treatment for rare condition Mr Massey will call on employers to recognise their role in ensuring workplaces promote a sense of belonging and inclusion among staff because \"behind these statistics lie real people, real tragedies\". Health Secretary Wes Streeting has launched a national maternity investigation into what he sees as \"systemic\" failures in NHS care.  He has said families who have lost babies at the hands of the NHS have often been \"gaslit\" in their search for the truth. The investigation is expected to conclude in December. A National Maternity and Neonatal Taskforce made up of experts and bereaved families, and chaired by the health secretary, has also been set up."
    },
    {
        "title": "From the general public to Hollywood and music stars, everybody wanted a piece of Ricky Hatton",
        "description": "There are few sporting stars who cross from the newspaper back pages to become front page news... but Ricky Hatton always was one of them.",
        "url": "https://news.sky.com/story/from-the-general-public-to-hollywood-and-music-stars-everybody-wanted-a-piece-of-ricky-hatton-13430977",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ricky-hatton-boxing_7020354.jpg?20250914151931",
        "type": "Home",
        "Author": "Katie Spencer",
        "Date Published": "2025-09-14 14:17:00",
        "Headline": "Ricky Hatton had 45 wins and three defeats over a 15-year career, with celebrities often flocking to watch his bouts ringside.",
        "Content": "\n          Arts and entertainment correspondent\n        There are few sporting stars who cross from the newspaper back pages to become front page news... but Ricky Hatton always was one of them. Aside from his boxing brilliance, it was his personality and humour which made people pay attention. In recent years, his happy-go-lucky character saw him cast on reality shows like Dancing on Ice. But what's more interesting is how and why the public came to have such great affection for him back in the day. Follow the latest: Tributes being paid to former boxing world champion Putting it kindly, sports stars aren't always known for their sparkling personalities. It was Ricky's lack of interest in the trappings of fame which accompanied his epic run of victories that made him all the more cool. \n                  Former world champion boxer Ricky Hatton has died aged 46\n                 \n                  Adolescence star Owen Cooper makes history at Emmys\n                 \n                  Prime suspect in Madeleine McCann case refuses to speak to British police\n                 He was the working-class hero who seemed unstoppable. It was a story that everyone wanted to follow. Celebrities wanted to be seen alongside him. Piggy-backing off his popularity the likes of Brad Pitt, Angelina Jolie, Denzel Washington and David Beckham were all pictured ringside at one time or another, drawn to his fan-friendly style and impressive winning streak. At the same time as the Gallagher brothers were flying the flag for music from Manchester, Hatton was doing the same for boxing. During his 2008 fight against Paulie Malignaggi, he had Liam and Noel escort him to the ring. In an interview he said he thought all three of them might be killed when Liam held up Hatton's IBO belt inches from Malignaggi's face and with a swagger said 'what do you think about that you d*** head?'. Stories like that are why his appeal extended beyond sport. He was an ordinary bloke who'd done extraordinary things. He never lost sight of who he was and fans loved him for it."
    },
    {
        "title": "Former world champion boxer Ricky Hatton has died aged 46",
        "description": "Former world champion boxer Ricky Hatton has died aged 46.",
        "url": "https://news.sky.com/story/former-world-champion-boxer-ricky-hatton-has-died-aged-46-report-13430761",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/cdf9088f2b9c35f3ca3fb34bf5cf1f0fa47d6f4195b3b0fc379c35eea3894971_7020079.jpg?20250914125304",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-14 11:13:00",
        "Headline": "Ricky Hatton had 45 victories and just three defeats over a 15-year career, but had been open about his personal demons.",
        "Content": " Former world champion boxer Ricky Hatton has died aged 46. During his career between 1997 and 2012, the British fighter - nicknamed \"The Hitman\" - won titles in the light welterweight and welterweight divisions. As it happened: Tributes paid to former boxing world champion In July this year, he announced he was coming out of retirement for a December bout in Dubai, 13 years on from his last professional match. The Manchester boxer had been set to fight Eisa Al Dah on 2 December. In 2023, Sky broadcast a documentary exploring the boxer's life in the ring, his fractured personal life and his continuing mental health battles. Greater Manchester Police said on Sunday: \"Officers were called by a member of the public to attend Bowlacre Road, Hyde, Tameside, at 6.45am today where they found the body of a 46-year-old man. \"There are not currently believed to be any suspicious circumstances.\" Sky News sport correspondent Rob Harris called Hatton \"one of the great personalities of British boxing,\" crediting him with \"galvanising the sport\". He said: \"As he would travel around the world, winning fights, he would bring that huge fan base with him… To have the career he had, with 45 victories and three defeats, was impressive... \"This will be devastating to many boxing fans and particularly his family, given it was just weeks before he was due to make his comeback… So many people will be reflecting on just what a contribution and what an icon he was to British boxing and just how he could seem so ordinary as well, while still achieving great sporting heights\". During his 15-year professional career, Hatton held multiple world championships at light-welterweight and one at welterweight class. In his prime, Hatton secured victories over the likes of Kostya Tszyu and Jose Luis Castillo, before going on to suffer brutal knockout losses to Floyd Mayweather Jr in 2007 and Manny Pacquiao in 2009. Hatton last fought professionally in November 2012, suffering a knockout loss to Ukraine's Vyacheslav Senchenko. He once more returned to the ring for a non-scoring exhibition bout with Marco Antonio Barrera in 2022. Messages from those in the sports world poured in following news of his death, with boxers including Amir Khan, Tyson Fury, Chris Eubank Jr and Barry McGuigan, and footballers Michael Owen and Wayne Rooney all paying tribute. As one of Manchester City's most famous fans, the team announced there would be a minute's appreciation ahead of the Manchester derby on Sunday afternoon. City and England midfielder Phil Foden scored in the 3-0 victory and dedicated the win to Hatton. \"It was for him and his family. It was all for him and we are delighted with the result.\"  Born Richard John Hatton in Stockport, Cheshire, in October 1978, he rose through amateur and domestic levels to become one of the most popular fighters in the first decade of the new century. But he had suffered a series of well-publicised issues in his private life since his 2009 defeat against Pacquiao in their IBO light-welterweight title fight in Las Vegas. Hatton said at the time he did not want to see those demons tarnish his legacy in the sport, and had another world title belt in his sights. In 2010, he was admitted to rehab, struggling with drink and depression. Hatton overcame a fallout with his family and a court case with his former trainer Billy Graham to become a successful trainer, coaching Zhanat Zhakiyanov to a world bantamweight title win in 2017. His down-to-earth attitude endeared him to fans around the world and, in 2024, he joined ITV reality show Dancing On Ice, but was the first celebrity to leave the competition. His professional skating partner, Robin Johnstone, paid tribute on Instagram, saying she was \"beyond sad\" at the \"devastating news,\" adding, \"You were a true friend.\" Arts and entertainment correspondent There are few sporting stars who cross from the newspaper back pages to become front page news... but Ricky Hatton always was one of them. Aside from his boxing brilliance, it was his personality and humour which made people pay attention. In recent years, his happy-go-lucky character saw him cast on reality shows like Dancing on Ice. But what's more interesting is how and why the public came to have such great affection for him back in the day. Putting it kindly, sports stars aren't always known for their sparkling personalities. It was Ricky's lack of interest in the trappings of fame which accompanied his epic run of victories that made him all the more cool. He was the working class hero who seemed unstoppable. It was a story that everyone wanted to follow. Celebrities wanted to be seen alongside him. Piggy-backing off his popularity the likes of Brad Pitt, Angelina Jolie, Denzel Washington and David Beckham were all pictured ringside at one time or another, drawn to his fan-friendly style and impressive winning streak. At the same time as the Gallagher brothers were flying the flag for music from Manchester, Hatton was doing the same for boxing. During his 2008 fight against Paulie Malignaggi, he infamously had Liam and Noel escort him to the ring. In an interview he said he thought all three of them might be killed when Liam held up Hatton's IBO belt inches from Malignaggi's face and with a swagger said 'what do you think about that you d*** head?'. Stories like that are why his appeal extended beyond sport. He was an ordinary bloke who'd done extraordinary things. He never lost sight of who he was and fans loved him for it.   Speaking ahead of his final professional fight in 2012, Hatton, who was a father of three, told reporters: \"I don't want people telling my kids that I blew it. I want my kids to be able to say, 'He was a world champion, he had his problems, but my did he bounce back'. \"I want people to be proud of me again. I want British sport, my kids and my fans and my friends to be proud of me.\" Hatton leaves behind his three children, daughters Millie and Fearne and son Campbell. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "From the general public to Hollywood and music stars, everybody wanted a piece of Ricky Hatton",
        "description": "There are few sporting stars who cross from the newspaper back pages to become front page news... but Ricky Hatton always was one of them.",
        "url": "https://news.sky.com/story/from-the-general-public-to-hollywood-and-music-stars-everybody-wanted-a-piece-of-ricky-hatton-13430977",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ricky-hatton-boxing_7020354.jpg?20250914151931",
        "type": "UK",
        "Author": "Katie Spencer",
        "Date Published": "2025-09-14 14:17:00",
        "Headline": "Ricky Hatton had 45 wins and three defeats over a 15-year career, with celebrities often flocking to watch his bouts ringside.",
        "Content": "\n          Arts and entertainment correspondent\n        There are few sporting stars who cross from the newspaper back pages to become front page news... but Ricky Hatton always was one of them. Aside from his boxing brilliance, it was his personality and humour which made people pay attention. In recent years, his happy-go-lucky character saw him cast on reality shows like Dancing on Ice. But what's more interesting is how and why the public came to have such great affection for him back in the day. Follow the latest: Tributes being paid to former boxing world champion Putting it kindly, sports stars aren't always known for their sparkling personalities. It was Ricky's lack of interest in the trappings of fame which accompanied his epic run of victories that made him all the more cool. \n                  Former world champion boxer Ricky Hatton has died aged 46\n                 \n                  Adolescence star Owen Cooper makes history at Emmys\n                 \n                  Prime suspect in Madeleine McCann case refuses to speak to British police\n                 He was the working-class hero who seemed unstoppable. It was a story that everyone wanted to follow. Celebrities wanted to be seen alongside him. Piggy-backing off his popularity the likes of Brad Pitt, Angelina Jolie, Denzel Washington and David Beckham were all pictured ringside at one time or another, drawn to his fan-friendly style and impressive winning streak. At the same time as the Gallagher brothers were flying the flag for music from Manchester, Hatton was doing the same for boxing. During his 2008 fight against Paulie Malignaggi, he had Liam and Noel escort him to the ring. In an interview he said he thought all three of them might be killed when Liam held up Hatton's IBO belt inches from Malignaggi's face and with a swagger said 'what do you think about that you d*** head?'. Stories like that are why his appeal extended beyond sport. He was an ordinary bloke who'd done extraordinary things. He never lost sight of who he was and fans loved him for it."
    },
    {
        "title": "Prime suspect in Madeleine McCann case refuses to speak to British police",
        "description": "The prime suspect in the disappearance of Madeleine McCann has refused to be interviewed by the Metropolitan Police.",
        "url": "https://news.sky.com/story/prime-suspect-in-madeleine-mccann-case-refuses-to-speak-to-british-police-13431369",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-christian-b-court-germany_6703865.jpg?20250914221937",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-14 20:19:00",
        "Headline": "Christian B is expected to be released from a German prison this week after being jailed for raping an elderly woman - and British police had hoped he might finally address the toddler's disappearance.",
        "Content": "The prime suspect in the disappearance of Madeleine McCann has refused to be interviewed by the Metropolitan Police. German drifter Christian B, as he is known under privacy laws, became a leading person of interest following the three-year-old British girl's disappearance from a holiday resort in Portugal in 2007. He is expected to be released from a jail in Germany as soon as Wednesday, at the end of a sentence for raping an elderly woman in Praia da Luz in 2005. The Met said it sent an \"international letter of request\" to the 49-year-old for him to speak with them - but he rejected it. Madeleine vanished shortly after she was left sleeping by her parents, Kate and Gerry McCann, who went for dinner in a nearby restaurant in Praia da Luz. The Met said Christian B remains a suspect in its own investigation - with Portuguese and German authorities also probing Madeleine's disappearance. He has previously denied any involvement. \n                  Madeleine McCann case: Sky News tracks down woman at centre of hit-and-run theory investigated by police\n                 \n                  Madeleine McCann: Investigators end latest searches for missing British girl\n                 \n                  Madeleine McCann search: Abandoned buildings examined as ground radar may be deployed\n                 Detective Chief Inspector Mark Cranwell, a senior investigating officer, said the force will \"continue to pursue any viable lines of inquiry\" in the absence of an interview with Christian B. He said: \"For a number of years we have worked closely with our policing colleagues in Germany and Portugal to investigate the disappearance of Madeleine McCann and support Madeleine's family to understand what happened... \"We have requested an interview with this German suspect but, for legal reasons, this can only be done via an International Letter of Request which has been submitted. \"It was subsequently refused by the suspect. In the absence of an interview, we will nevertheless continue to pursue any viable lines of inquiry.\" In June, a hit-and-run theory emerged in connection with Madeleine's death. But her mother, Kate, has long dismissed the suggestion her daughter managed to get out of the apartment alone.  A number of searches have been carried out by German, Portuguese and British authorities since her disappearance - with the latest taking place near the Portuguese municipality of Lagos in June. In 2023, investigators carried out searches near the Barragem do Arade reservoir, about 30 miles from Praia da Luz. Christian B spent time in the area between 2000 and 2017 and had photographs and videos of himself near the reservoir. In October last year, the suspect was cleared by a German court of unrelated sexual offences, alleged to have taken place in Portugal between 2000 and 2017. The total funding given to the Met's investigation, titled Operation Grange, has been more than £13.2m since 2011 after a further £108,000 was secured from the government in April."
    },
    {
        "title": "Man arrested in connection with 'racially-motivated rape' in West Midlands",
        "description": "Officers investigating an alleged racially-motivated rape in the West Midlands have arrested a man, police have said. ",
        "url": "https://news.sky.com/story/man-arrested-after-woman-raped-in-racially-motivated-attack-in-west-midlands-13430875",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-police-police-officers_6880101.jpg?20250501101630",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-14 13:05:00",
        "Headline": "News of the arrest comes after members of the Sikh community gathered on Sunday to show support for the woman.",
        "Content": "Officers investigating an alleged racially-motivated rape in the West Midlands have arrested a man, police have said.  Officers were called just before 8.30am on Tuesday after a Sikh woman in her 20s reported being attacked by two white men in the area around Tame Road in Oldbury. The man, who is in his 30s, was detained as part of enquiries on Sunday evening, West Midlands Police said. He remains in custody on suspicion of rape. Chief Superintendent Kim Madill, of Sandwell Police, said: \"This is a significant development in the investigation and we want to thank the community for their continuing support. \"The investigation remains ongoing and we would urge people not to speculate as we work to identify and trace all those who may have been involved.\" News of the arrest comes after members of the Sikh community gathered on Sunday to show support for the woman. Scores of people met outside the Guru Nanak Gurdwara temple in Smethwick, where they conducted prayers and offered their support. They then went to the alleged scene of the crime. Speaking to Sky News at the gathering, local councillor Parbinder Kaur said she was attending the protests as \"a woman, a mother, a grandmother\". Ms Kaur said her religion is one of peace and praying for humanity as a whole, which is why she believes \"this is the time to unite\". Read more:Tributes paid to Ricky HattonWoman, 65, arrested after man found dead The victim, who is entitled to anonymity, previously issued a statement through community group Sikh Youth UK."
    },
    {
        "title": "UK and US firms announce deals in new 'golden age' of nuclear power ahead of Trump visit",
        "description": "The prime minister has hailed a new \"golden age\" of nuclear power as British and US companies announce five new commercial deals, ahead of the US president's state visit this week.",
        "url": "https://news.sky.com/story/uk-and-us-firms-announce-deals-in-new-golden-age-of-nuclear-power-ahead-of-trump-visit-13431336",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-cottam-coal-nuclear_7020894.jpg?20250914220336",
        "type": "UK",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-09-14 23:01:00",
        "Headline": "UK and US firms announce five new commercial deals, including for a new nuclear power plant in Hartlepool, before President Trump arrives in the UK on Tuesday. They will be underpinned by a refreshed US-UK agreement to speed up the notoriously slow building process in both countries.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The prime minister has hailed a new \"golden age\" of nuclear power as British and US companies announce five new commercial deals, ahead of the US president's state visit this week. The plans include a new nuclear power plant in Hartlepool using latent, potentially cheaper technology and data centres powered by mini reactors in Nottinghamshire. Officials have been hurrying to coordinate the agreements before President Donald Trump jets in on Tuesday, with the two leaders expected to sign off on multibillion-pound tech deals as well as a revamped agreement to work together on nuclear power. They hope the new Atlantic Partnership for Advanced Nuclear Energy will speed up notoriously slow nuclear projects in both countries by slashing red tape and aligning safety standards. Both governments are betting big on nuclear to meet rising electricity demand and AI's voracious appetite for energy, while Sir Keir Starmer hopes it will boost jobs, growth and manufacturing in former industrial heartlands. The two leaders will also be hoping the high-profile visit will shake off last week's scandal over revelations of the ambassador to the US Lord Mandelson's links with convicted paedophile Jeffrey Epstein, with whom Mr Trump's own association is being scrutinised. The jewel of today's announcements is the plan to replace the outgoing Hartlepool nuclear power plant, which expires in 2028, with a new plant of up to 960MW using new \"advanced modular reactor\" (AMR) technology. \n                  Drill, Kemi, drill! Are Tory oil and gas plans a load of hot air?\n                 \n                  Energy bills expected to rise from October - despite previous forecasts\n                 \n                  Former Virgin Money chief Gadhia to chair energy supplier Ovo\n                 The AMR designer, US firm X-Energy, signed a Joint Development Agreement with British Gas-owner Centrica to build and fund the fleet, which they said would generate 2,500 construction jobs and maintain hundreds when up and running in the 2030s.  What are advanced modular reactors? Advanced or small modular reactors (AMR or SMR) are new, small nuclear power plants hoped to be quicker and faster to build than traditional technology, such as that used at the delayed and overbudget Hinkley and Sizewell sites. Around 80 designs are in development globally and they have long been promised but barely materialised. Read more: Why the UK has warmed up to nuclear power again Industry says SMRs are finally about to breakthrough, given governments' renewed appetite for nuclear power to meet energy security concerns, growing electricity demands and climate targets to phase out polluting fossil fuels. Why tech giants love new nuclear technology Tech giants are also hungry for SMRs to power booming AI data centres, which need the kind of clean, steady, 24/7 energy nuclear can provide. Today EDF announced early-stage plans with US nuclear energy firm Holtec to build data centres powered by SMRs at the former Cottam coal-fired power station in Nottinghamshire. If it goes ahead, it would be worth £11bn and create thousands of jobs during construction. These new reactors need a type of fuel (High-assay low-enriched uranium or HALEU) that is only available to buy commercially from Russia and China. Anxious about energy security, the UK government has been funding a company called Urenco to build a HALEU facility in Cheshire. Urenco has also announced a £4m deal to sell that fuel to the US market, where it is also exploring another manufacturing site. Two further deals to come out today involve a micro plant to power London Gateway Port and the scouting of sites for nuclear reactors designed by Bill Gates's Terrapower.  The news has been welcomed by industry and the union Prospect. Tom Greatrex, chief executive of the UK's Nuclear Industry Association, said: \"These deals are hugely welcome and build on a summer of record government investment in nuclear which is driving an industrial revival, creating thousands of high-value jobs, and strengthening the UK's energy security.\" But critics warn the new technology will still be expensive and slow, arguing the money should instead pay for renewables, batteries and insulating homes to reduce energy demand in the first place. They also fear Britain's disposal facilities can't cope with the nuclear waste. US promises 'nuclear renaissance' Sir Keir said the \"landmark UK-US nuclear partnership\" would \"drive down household bills in the long run, while delivering thousands of good jobs in the short term\". \"Together with the US, we're building a golden age of nuclear that puts both countries at the forefront of global innovation and investment,\" he added. US energy secretary Chris Wright hailed a \"true nuclear renaissance - harnessing the power of commercial nuclear to meet rising energy demand and fuel the AI revolution\". \"Meeting this demand will require strong partnerships with our allies around the world and robust collaboration with private sector innovators,\" he said. \"Today's commercial deals set up a framework to unleash commercial access in both the US and UK, enhancing global energy security, strengthening US energy dominance, and securing nuclear supply chains across the Atlantic.\" Andrew Bowie, shadow energy minister, said: \"All these announcements are simply building on the strong legacy left by the previous Conservative government who kick-started the nuclear revolution in the UK.\""
    },
    {
        "title": "New drone factory to open in Swindon in 2026",
        "description": "A new drone factory will open in Swindon to help produce the uncrewed air systems the UK has sent to fight Russia in Ukraine, the government will announce today.",
        "url": "https://news.sky.com/story/new-drone-factory-to-open-in-swindon-in-2026-13431357",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-john-healey-drone_7020888.jpg?20250914215919",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-14 23:01:00",
        "Headline": "The 254,000-square-foot facility will be operated by the manufacturer Tekever, Defence Secretary John Healey will say at a site visit today.",
        "Content": "A new drone factory will open in Swindon to help produce the uncrewed air systems the UK has sent to fight Russia in Ukraine, the government will announce today. The 254,000-square-foot facility will be operated by Tekever and is due to open in 2026, Defence Secretary John Healey will say at a site visit later. It will create 1,000 jobs and bring core production of the AR5 drone to the UK for the first time, while increasing capacity of existing AR3 production. The UK has bought £270m in Tekever drones to help Ukrainian forces destroy advanced Russian air defence systems since Vladimir Putin launched his invasion in February 2022. It will be the manufacturer's fourth UK site and its largest so far. \"This new factory is a clear demonstration that this government is making defence an engine for growth across the UK,\" Mr Healey is expected to say. \"Tekever's expansion will bring high-skilled jobs and world-leading drone manufacturing to Swindon, while strengthening defence supply chains. \"By backing Britain's defence industry, we strengthen both our economy and national security.\" Read more from Sky NewsBridget Phillipson launches deputy leader bidEx-chancellor to step down as Copper chairBadenoch accuses Starmer of lying about Mandelson Swindon has long had an important defence role, having produced the Supermarine Spitfire during the Second World War. The new Tekever-run site will also take over production of the RAF's StormShroud capability. It comes after defence emerged as one of the key winners of Chancellor Rachel Reeves's spending review in June. The defence budget will increase from 2.3% of gross domestic product (GDP) in 2025 to 2.6% in 2027 - the equivalent of a £600m uplift. In May, Prime Minister Sir Keir Starmer announced an extra £19m in investment of AR3 Tekever StormShroud drones for the RAF. Karl Brew, Tekever's director of defence, said the Swindon factory will play a \"central role\" in the production of AR3 EVO systems and ensure an \"advanced, sovereign capability at pace and in close partnership with the UK defence ecosystem\"."
    },
    {
        "title": "'Toxic cover-up' culture in NHS a risk to mothers and babies, says health chief",
        "description": "Harm to mothers and their babies is at risk of being normalised owing to a \"toxic\" culture of \"cover-up\" in the NHS, the head of the doctors' regulator will say.",
        "url": "https://news.sky.com/story/toxic-cover-up-culture-in-nhs-a-risk-to-mothers-and-babies-says-health-chief-13431385",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-mother-baby-maternity_6552405.jpg?20240513095124",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-14 23:01:00",
        "Headline": "New data shows 27% of obstetrics and gynaecology trainees said they have felt hesitant escalating a patient to a more senior medic - a higher proportion than in other areas of medicine.",
        "Content": "Harm to mothers and their babies is at risk of being normalised owing to a \"toxic\" culture of \"cover-up\" in the NHS, the head of the doctors' regulator will say. Charlie Massey, chief executive of the General Medical Council (GMC), will tell delegates at a conference that \"something must have gone badly wrong\" for one in four trainee doctors to feel fearful of speaking up. In a speech seen by the PA news agency, Mr Massey will tell the Health Service Journal patient safety congress in Manchester: \"That doctors are making life and death decisions in environments where they feel fearful to speak up is profoundly concerning. \"Those are the very factors that lead to cover-up over candour and obfuscation over honesty. And it is in those cultures that the greatest patient harm occurs.\" Maternity care is \"one of the most high-risk and high-pressure areas of medicine\", he will continue. \"One where the consequences of things going wrong can be especially tragic and far-reaching, affecting both a mother and her baby, not to mention their wider family.\" GMC shows that 27% of obstetrics and gynaecology trainees said they have felt hesitant escalating a patient to a more senior medic - a higher proportion than in other areas of medicine. \n                  Wes Streeting pushes forward with ban on high caffeine energy drinks for under-16s\n                 \n                  'My husband broke it off after I became disabled' - how relationships can be rocked by serious illness\n                 \n                  What vaccines are children recommended to have and when?\n                 The specialty also has above-average rates of workload stress, bullying and doctors who feel unsupported by colleagues, according to the findings.  Mr Massey will say the data \"suggest[s] a situation where, too often, patient safety is falling victim to unhealthy culture\". \"The unthinkable - harm to mothers and their babies - is at risk of being normalised,\" he will add. \"And toxic culture is in no small part to blame.\" Read more:Where does your hospital rank in NHS league tables?Mum welcomes 'sci-fi' treatment for rare condition Mr Massey will call on employers to recognise their role in ensuring workplaces promote a sense of belonging and inclusion among staff because \"behind these statistics lie real people, real tragedies\". Health Secretary Wes Streeting has launched a national maternity investigation into what he sees as \"systemic\" failures in NHS care.  He has said families who have lost babies at the hands of the NHS have often been \"gaslit\" in their search for the truth. The investigation is expected to conclude in December. A National Maternity and Neonatal Taskforce made up of experts and bereaved families, and chaired by the health secretary, has also been set up."
    },
    {
        "title": "Bridget Phillipson calls for party unity as she launches deputy leadership bid",
        "description": "And they're off! Bridget Phillipson was first away in her two-horse race with Lucy Powell in the Labour deputy leadership stakes.",
        "url": "https://news.sky.com/story/bridget-phillipson-calls-for-party-unity-as-she-launches-deputy-leadership-bid-13431294",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bridget-phillipson_7020825.jpg?20250914194423",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-09-14 18:21:00",
        "Headline": "Despite Education Secretary Bridget Phillipson winning 175 nominations from Labour MPs to Lucy Powell's 117, bookmakers StarSports this weekend made Ms Powell 4/6 favourite with Ms Phillipson at 5/4.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n And they're off! Bridget Phillipson was first away in her two-horse race with Lucy Powell in the Labour deputy leadership stakes. Facing a rival who was sacked from the government nine days earlier, the education secretary said the deputy leader should be a cabinet minister, as Angela Rayner was. Launching her campaign at The Fire Station, a trendy music and entertainment venue in Sunderland, she also vowed to turn up the heat on Nigel Farage and Reform UK. She also repeatedly called for party unity, at a time when Labour MPs are growing increasingly mutinous over Sir Keir Starmer's dealings with sacked Washington ambassador Lord Mandelson. Despite Ms Phillipson winning 175 nominations from Labour MPs to Ms Powell's 117, bookmakers StarSports this weekend made Ms Powell 4/6 favourite with Ms Phillipson at 5/4. But though the new deputy leader will not be deputy prime minister, a title that's gone to David Lammy, Ms Phillipson praised the way Ms Rayner combined the two roles and rejected suggestions that as a cabinet minister she would be a part-time deputy leader. \"What can be achieved under a deputy leader with a seat at cabinet, just look at Angela Rayner,\" Ms Phillipson told her enthusiastic supporters. \"Angela knew the importance of the role she had. There was nothing part-time about her deputy leadership. \"Last year I campaigned up and down the country to get Labour candidates elected - I've not stopped as education secretary - and I won't stop as deputy leader. \"Because with local elections, and with elections in Wales and Scotland right around the corner, that role is going to be more important than ever. \"So that's why, today, I pledge to continue Angela Rayner's campaigning role as deputy leader. \"Continuing her mission to give members a strong voice at the cabinet table. \"Her ruthless focus on getting our candidates elected and re-elected, alongside her total determination to drive change from government. Because what mattered was not just what she believed, but that she could act on it.\" Read moreAnalysis: Sacking Powell might haunt StarmerExplainer: How does the deputy leadership contest work? Ms Phillipson pledged to run a campaign of \"hope, not grievance\" and claimed the party descending into division would put the chances of children and families benefiting from Labour policies at risk. But admitting Sir Keir Starmer's government had made mistakes, she appealed to party members: \"You can use this contest to look backward, to pass judgement on what has happened in the last year, or you can use it to shape positively what happens in the run-up to the next election. \"Back me so I can unite our party, deliver the change we want to see and beat Reform. Back me so together, we can deliver that second term of Labour government.\" Starmer's candidate vs Manchester mayor's As she did in a speech at the TUC conference last week, Ms Phillipson spoke about her upbringing \"from a tough street of council houses in the North East all the way to the cabinet\". At the TUC, she said she grew up - \"just me and my mam\" - and told how when she was nine, a man who'd burgled the house turned up at the front door with a baseball bat and threatened her mother. Ms Powell, who enjoys the powerful backing of Labour's 'King of the North' Andy Burnham, called this weekend for a change in culture in 10 Downing Street, with better decisions and fewer unforced errors. His backing has led to the deputy contest being seen as a battle between Sir Keir's candidate, Ms Phillipson, and that of the Greater Manchester mayor, seen increasingly as a leadership rival to the prime minister. And like all the best horse races, with the betting currently so tight, when the result is declared on 25 October the result could be a photo-finish."
    },
    {
        "title": "First migrants to be sent back to France this week under returns deal",
        "description": "The Home Office will return migrants to France for the first time this week under the terms of a new deal, Sky News understands.",
        "url": "https://news.sky.com/story/first-migrants-to-be-sent-back-to-france-next-week-under-returns-deal-13430747",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-small-boats-starmer_6989917.png?20250813164711",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-14 10:04:00",
        "Headline": "The 'one in, one out' deal means the UK can send people back to France if they have entered the country illegally. In exchange, the UK will allow asylum seekers to enter through a safe and legal route.",
        "Content": " The Home Office will return migrants to France for the first time this week under the terms of a new deal, Sky News understands. The agreement, which was signed in July, saw migrants first detained on 6 August, and they will now be flown back to the continent. The 'one in, one out' deal means the UK can send people back to France if they have entered the country illegally. In exchange, the UK will allow asylum seekers to enter through a safe and legal route - as long as they have not previously tried to enter illegally. It is a pilot scheme for now, which will be in place until June 2026. Read more: How UK-France migrant returns deal works  Politics Hub - latest updates The scheme comes amid growing public anger over immigration, with the issue recently becoming voters' top concern for the first time since Brexit. \n                  Asylum seekers come face-to-face with migrant hotel critics\n                 \n                  How many illegal migrants are in Britain? The key numbers driving the immigration debate\n                 \n                  Is good weather to blame for small boat crossings? It's not as simple as the government suggests\n                 On Saturday, up to 150,000 people marched in London, gathering around Westminster in a protest dubbed 'Unite the Kingdom', and organised by far-right activist Tommy Robinson. There were a number of clashes with police, leading to 25 arrests and 26 police officers being injured. Laura Trott, the shadow education secretary, said the \"horrendous incidents\" of violence were \"completely abhorrent\", and said she was glad to hear those involved will feel the force of the law. But speaking on Sunday Morning with Trevor Phillips, she warned that the protest shows that people feel \"let down\" by the government on immigration. Ms Trott told Sky News: \"There is clearly an issue in this country at the moment about immigration and migration. People clearly feel let down by a government that came in and said they were going to 'smash the gangs'. And what we've seen is an increase in migration. \"We are not seeing the action from this government, which is distracted by scandal after scandal.\"  She also accused Sir Keir Starmer of being a \"rudderless prime minister\". Business Secretary Peter Kyle said that violence against police is \"unacceptable\" but said it is \"proof that we live in a country where free speech, free association is alive and well\". On immigration, he insisted that the government is \"straining at the bit to get a grip on the migration crisis\", which Mr Kyle said Labour \"inherited from the Conservatives\".  \"We've been doing everything we can,\" he said. \"The lesson is that by cooperating with our partners, France, rather than rowing with them, we are able to deliver. \"So I hope the flights will start as quickly as possible.\" But he said he was unaware of the exact date. Mr Kyle added that ministers were \"also angry about what we've inherited\" and that they were doing \"everything possible to get a grip on it\". The number of migrants arriving in the UK after crossing the English Channel has topped 30,000 for the year so far. It is the earliest point in a calendar year at which the 30,000 mark has been passed since data on the crossings was first reported in 2018."
    },
    {
        "title": "Russia's war rehearsals are worrying Europe – but they do offer NATO one thing",
        "description": "On NATO's doorstep, Russia is rehearsing for war.",
        "url": "https://news.sky.com/story/russias-war-rehearsals-are-worrying-europe-8211-but-they-do-offer-nato-one-thing-13431270",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-rusia-russia-belarus_7020771.jpg?20250914190847",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-09-14 17:56:00",
        "Headline": "Last time these drills happened, they led to a massive build-up of Russian troops in Belarus, which Moscow used for part of its invasion of Ukraine a few months later.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  On NATO's doorstep, Russia is rehearsing for war. It has deployed tanks, battleships and supersonic bombers for military drills with Belarus that are happening on land, at sea and in the air. 'Zapad-2025' are the allies' first joint exercises since the invasion of Ukraine, and on Sunday involved the launch of a hypersonic missile in the Barents Sea. \"There are several strategic goals here that [Russia and Belarus] want to achieve,\" Hanna Liubakova, an independent Belarusian journalist, told Sky News. \"Scare, show that they are capable, show that they can threaten… and of course, they're also checking what the reaction and response could be.\" The reaction so far has been frosty, to say the least. Ahead of the drills, Poland closed its border with Belarus and deployed more than 30,000 troops as part of its own military exercises. Lithuania is also holding drills and said it would bolster defences along its frontiers with Russia and Belarus. The authorities in Minsk, and in Moscow, insist the drills are defensive and not aimed at any other country. On Friday, the Kremlin even described Europe's concerns as \"emotional overload\". But the last time these drills happened four years ago, it led to a massive build-up of Russian troops in Belarus, which Moscow then used for part of its invasion of Ukraine a few months later. And the drills aren't the only thing Europe is worried about. Read more:First migrants to be sent back to FranceVenue for Charlie Kirk memorial revealed The show of strength comes at a time of heightened tension after recent Russian drone incursions into NATO airspace - first in Poland and then Romania. There's a feeling in the West that the drones and drills are a test of NATO's defences and Western resolve. But you're unlikely to find that opinion on the streets of the Belarusian capital, Minsk. \"There is no aggression,\" Mikhail told Sky News. \"Exercises are normal, especially planned ones. So I think it's fine.\" According to Kristina, Russia and Belarus are \"not the aggressors\". \"I think our head of state [Alexander Lukashenko] will solve this issue and we will support him. He's not aggravating the situation.\" A provocation or not, the drills offer NATO a fresh chance to scrutinise Russia's military, after three-and-a-half years of costly combat in Ukraine. It would feel a lot more comfortable, though, if they weren't happening so close to home."
    },
    {
        "title": "Prime suspect in Madeleine McCann case refuses to speak to British police",
        "description": "The prime suspect in the disappearance of Madeleine McCann has refused to be interviewed by the Metropolitan Police.",
        "url": "https://news.sky.com/story/prime-suspect-in-madeleine-mccann-case-refuses-to-speak-to-british-police-13431369",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-christian-b-court-germany_6703865.jpg?20250914221937",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-14 20:19:00",
        "Headline": "Christian B is expected to be released from a German prison this week after being jailed for raping an elderly woman - and British police had hoped he might finally address the toddler's disappearance.",
        "Content": "The prime suspect in the disappearance of Madeleine McCann has refused to be interviewed by the Metropolitan Police. German drifter Christian B, as he is known under privacy laws, became a leading person of interest following the three-year-old British girl's disappearance from a holiday resort in Portugal in 2007. He is expected to be released from a jail in Germany as soon as Wednesday, at the end of a sentence for raping an elderly woman in Praia da Luz in 2005. The Met said it sent an \"international letter of request\" to the 49-year-old for him to speak with them - but he rejected it. Madeleine vanished shortly after she was left sleeping by her parents, Kate and Gerry McCann, who went for dinner in a nearby restaurant in Praia da Luz. The Met said Christian B remains a suspect in its own investigation - with Portuguese and German authorities also probing Madeleine's disappearance. He has previously denied any involvement. \n                  Madeleine McCann case: Sky News tracks down woman at centre of hit-and-run theory investigated by police\n                 \n                  Madeleine McCann: Investigators end latest searches for missing British girl\n                 \n                  Madeleine McCann search: Abandoned buildings examined as ground radar may be deployed\n                 Detective Chief Inspector Mark Cranwell, a senior investigating officer, said the force will \"continue to pursue any viable lines of inquiry\" in the absence of an interview with Christian B. He said: \"For a number of years we have worked closely with our policing colleagues in Germany and Portugal to investigate the disappearance of Madeleine McCann and support Madeleine's family to understand what happened... \"We have requested an interview with this German suspect but, for legal reasons, this can only be done via an International Letter of Request which has been submitted. \"It was subsequently refused by the suspect. In the absence of an interview, we will nevertheless continue to pursue any viable lines of inquiry.\" In June, a hit-and-run theory emerged in connection with Madeleine's death. But her mother, Kate, has long dismissed the suggestion her daughter managed to get out of the apartment alone.  A number of searches have been carried out by German, Portuguese and British authorities since her disappearance - with the latest taking place near the Portuguese municipality of Lagos in June. In 2023, investigators carried out searches near the Barragem do Arade reservoir, about 30 miles from Praia da Luz. Christian B spent time in the area between 2000 and 2017 and had photographs and videos of himself near the reservoir. In October last year, the suspect was cleared by a German court of unrelated sexual offences, alleged to have taken place in Portugal between 2000 and 2017. The total funding given to the Met's investigation, titled Operation Grange, has been more than £13.2m since 2011 after a further £108,000 was secured from the government in April."
    },
    {
        "title": "Spanish Vuelta finale cancelled as police clash with pro-Palestinian protesters in Madrid",
        "description": "The finale of Spain's version of the Tour de France has been cancelled midway through after clashes between police and pro-Palestinian protesters in Madrid. ",
        "url": "https://news.sky.com/story/spanish-vuelta-finale-cancelled-as-police-clash-with-pro-palestinian-protesters-in-madrid-13431070",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-madrid-vuelta_7020638.jpg?20250914174828",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-14 15:13:00",
        "Headline": "The Grand Tour event has this year turned into a diplomatic battleground, with multiple days of racing cut short or interrupted as pro-Palestinian protests have taken place. ",
        "Content": "The finale of Spain's version of the Tour de France has been cancelled midway through after clashes between police and pro-Palestinian protesters in Madrid.  The Spanish Vuelta's 104km-long last leg was first paused at around 6.20pm local time (5.20pm in the UK) as police attempted to disperse the demonstrators. Some protesters carrying anti-Israel banners had thrown barriers to block where the cyclists were supposed to pass on a finishing circuit for the mostly ceremonial ride into the Spanish capital. The race did briefly resume a short while later, but organisers were ultimately forced to call the finale off. Organisers said: \"For security reasons, stage 21 of La Vuelta has been ended early. There will be no podium ceremony. \"The race has been officially ended and Jonas Vingegaard is the winner.\" Protesters carrying Palestinian flags jeered as the teams' support cars passed by them along the route. The Vuelta sees over 180 cyclists spend three weeks pedaling 3,100km through the country's backroads - and the Grand Tour event has this year turned into a diplomatic battleground. More than 1,500 police officers were deployed for the final stage of the race, as officials anticipated protests. Authorities said the heavy police presence would be deployed for the final stage on Sunday, to add to the 130 officers already traveling with the race. Horse-riding police, officers in riot gear and military-type trucks were seen near the route. Some 6,000 protesters were expected in Madrid, along with around 50,000 fans. Multiple stages of the Vuelta have been disrupted by protests against the presence of the Israeli-owned team Premier Tech, which earlier in the race removed the team name from its cyclists' uniforms. Protesters have often waved Palestinian flags along the race route. During one stage, a demonstrator with a flag tried to run onto the road ahead of two riders, causing them to crash. Of the 10 days of racing up Sunday, six were cut short or interrupted with more than 20 people being detained by police. The route of the final stage was cut short by 5km over traffic concerns. Previous stages were altered because of safety concerns over the protests. Spaniards are largely sympathetic to the Palestinian cause and Spain's left-wing government is also highly critical of Israel's military invasion into Gaza. Spain's Prime Minister Pedro Sanchez joined Ireland and Norway in recognizing a Palestinian state last year. Read more:Russian drone 'breaches' Romanian airspaceCharlie Kirk's widow pays tribute In June last year, Spain became the first European country to ask a United Nations court for permission to join South Africa's case accusing Israel of genocide. Israel has denied genocide and defended its actions in Gaza, accusing Spain of standing with Hamas. The Vuelta's winner Vingegaard, from the Visma-Lease a Bike team, had extended his lead over Joao Almeida before the final leg. The UK's Tom Pidcock finished in third place."
    },
    {
        "title": "Romania scrambles fighter jets after Russian drone 'breaches airspace' - as Zelenskyy warns of war 'expansion'",
        "description": "Romania has said a drone breached its airspace during a Russian attack on neighbouring Ukraine.",
        "url": "https://news.sky.com/story/romania-scrambles-fighter-jets-after-russian-drone-breaches-airspace-as-zelenskyy-warns-of-war-expansion-13430684",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-romania-f16s-fighter_7019950.jpg?20250914092356",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-14 07:24:00",
        "Headline": "Romania is the latest NATO member state to report an incursion, after Poland shot down drones that had violated its airspace on Wednesday.",
        "Content": " Romania has said a drone breached its airspace during a Russian attack on neighbouring Ukraine. Fighter jets were scrambled on Saturday, coming close to taking down the aircraft as it was flying very low before it left national airspace toward Ukraine, defence minister Ionut Mosteanu said. Romania is the latest NATO member state to report an incursion, with Poland deploying aircraft and closing an airport in the eastern city of Lublin on Saturday, three days after it shot down Russian drones in its airspace. They are the first known shots fired by a member of the Western alliance during Russia's war in Ukraine.  Meanwhile, military exercises are taking place over the Barents Sea, with Russia and Belarus conducting joint drills. Russian MiG-31 fighter jets equipped with hypersonic ballistic missiles completed a four-hour flight over the neutral waters as part of ongoing \"Zapad 2025\" military exercises, the Interfax news agency reported on Saturday. Romania has had Russian drone fragments fall on to its territory repeatedly since Russia began waging its full-scale invasion of Ukraine three years ago. \n                  Russia-Belarus drills begin as tensions high after drone incursion in Poland\n                 \n                  'Europe's last dictator' frees more than 50 prisoners to ease sanctions in Trump trade \n                 \n                  Belarus opposition leader Siarhei Tsikhanouski freed from jail after rare visit by top US envoy\n                 Two F-16 fighter jets were initially scrambled by Romania, and later two Eurofighters. Citizens in the southeastern county of Tulcea near the Danube and its Ukrainian border were warned to take cover, the defence ministry said. The ministry said the drone dropped off their radar 20km (12 miles) southwest of the village of Chilia Veche. While helicopters were surveying the area looking for possible drone parts, Mr Mosteanu told private television station Antena 3 that \"all information at this moment indicates the drone exited airspace to Ukraine\".  Ukrainian President Volodymyr Zelenskyy said on social media that data showed the drone breached about 10km (six miles) into Romanian territory and operated in NATO airspace for around 50 minutes. He said Belarusian airspace was also used for entry into Ukraine's airspace. Mr Zelenskyy described the reported incursion as \"an obvious expansion of the war by Russia,\" and called for \"tariffs against Russian trade\" and a \"collective defence\". He warned: \"Do not wait for dozens of \"shaheds\" [Iranian-designed drones] and ballistic missiles before finally making decisions.\" NATO has said it plans to strengthen eastern flank defence, following earlier Polish airspace violations. US secretary of state Marco Rubio called the Polish incursion \"unacceptable and unfortunate and dangerous\", and said while it was unclear if the drones were intentionally sent to Poland, if it was the case, it would be \"a highly escalatory move\". Experts, including Sky News international affairs editor Dominic Waghorn have previously suggested the Kremlin is testing the West with gradual but steady escalation - a tactic known as \"salami slicing\". On Saturday, Donald Trump said on his Truth Social platform that he was \"ready to do major sanctions on Russia\", but only when all NATO nations \"do the same thing\" and \"stop buying oil from Russia\". Mr Trump has repeatedly threatened sanctions against Moscow, so far without any action. The president also said NATO members should also put 50% to 100% tariffs on China - and only withdraw them if the conflict ends. NATO member Turkey has been the third largest buyer of Russian oil since 2023, after China and India, according to the Centre for Research on Energy and Clean Air, with fellow members Hungary and Slovakia also buying energy supplies from Moscow."
    },
    {
        "title": "Donald Trump's top diplomat Marco Rubio seeks answers from Israel on way forward in Gaza after Qatar strike",
        "description": "Donald Trump's top diplomat has arrived in the Middle East amid tensions over Israel's attack on Hamas inside Qatar that has upended efforts to broker an end to the Gaza war.",
        "url": "https://news.sky.com/story/donald-trumps-top-diplomat-marco-rubio-seeks-answers-from-israel-on-way-forward-in-gaza-after-qatar-strike-13430685",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-marco-rubio-benjamin-netanyahu_7020293.jpg?20250914143936",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-14 07:34:00",
        "Headline": "US secretary of state Marco Rubio touched down in Israel on Sunday, having earlier told reporters the American president was \"not happy\" with the Israeli strike.",
        "Content": "Donald Trump's top diplomat has arrived in the Middle East amid tensions over Israel's attack on Hamas inside Qatar that has upended efforts to broker an end to the Gaza war. US secretary of state Marco Rubio and his wife Jeanette Dousdebes Rubio touched down in Israel on Sunday, having earlier told reporters that the president was \"not happy\" with the Israeli strike. Although the US relationship with Israel remains unaffected, Mr Rubio said he will be seeking answers from Israeli officials about how they see a way forward in Gaza following the attack. Mr Rubio and Israeli Prime Minister Benjamin Netanyahu were pictured on a visit to the Western Wall, Judaism's holiest prayer site. Mr Netanyahu said: \"I think his visit here is a testament to the durability, the strength of the Israeli-American alliance. \"It's as strong and as durable as the stones of the Western Wall we just touched.\" Mr Rubio's visit comes days after Israel attempted to kill the political leaders of Hamas with an airstrike on the capital Doha. \n                  At least 32 people killed as Israel intensifies airstrikes in Gaza City, medical staff say\n                 \n                  Journalist whose wife and children killed in Gaza says 'world treating us with indifference'\n                 \n                  Green Party leader Polanski calls for Israeli president's arrest during UK visit over 'ongoing genocide'\n                 The group had gathered to consider a US proposal for a ceasefire in the nearly two-year-old war in Gaza. Hamas has said its top leaders survived the strike, but five members were killed, including the son of its exiled Gaza chief and top negotiator Khalil al-Hayya. US officials described the assault as a unilateral escalation that did not serve American or Israeli interests.  The strike on the territory of a close US ally sparked widespread condemnation from other Arab states and derailed ceasefire and hostage talks brokered by Qatar. Mr Rubio will attend meetings in Jerusalem on Sunday and Monday with Mr Netanyahu and others. After that, he is expected to join Mr Trump's state visit to the UK next week. Qatar will host an emergency Arab-Islamic summit on Sunday and Monday in response to the Israeli attack and is expected to issue a clear condemnation of the assault. Read more:Trump has 'heated phone call' with NetanyahuAnalysis: Israel has crossed a huge diplomatic red line Meantime, a barrage of Israeli airstrikes on Saturday reportedly killed dozens of people across Gaza City. According to the morgue at Shifa Hospital, where the bodies were brought, the dead included 12 children. Health officials said one of the strikes killed a family of 10, including a mother and her three children. The Palestinian Football Association said a player for the Al-Helal Sporting Club, Mohammed Ramez Sultan, was killed with 14 members of his family. On Sunday, the Hamas-run Gaza health ministry said 38 people had been killed and 200 injured in the space of 24 hours. The health ministry said a number of victims remain under rubble and on the streets, where ambulance and civil defence crews are unable to reach them at this time. Separately, two people - including a child - are said to have died of causes related to malnutrition and starvation in the Gaza Strip over the last 24 hours. The military action comes amid intensified strikes across Gaza City in recent days, which has seen multiple high-rise buildings flattened and Israel accusing Hamas of putting surveillance equipment in them. As part of its expanding operation in Gaza City, the Israeli military destroyed a high-rise residential building on Sunday morning, less than an hour after an evacuation order posted online by the military spokesman Avichay Adraee. Residents said the Kauther tower in the Rimal neighbourhood was flattened to the ground. There were no immediate reports of casualties. Meanwhile, it is understood the first group of ill or injured Palestinian children set to receive NHS treatment have been evacuated from Gaza and will shortly arrive in the UK. They are the first children to be brought to Britain for treatment as part of a government operation being coordinated by the Foreign, Commonwealth and Development Office (FCDO), Home Office and Department of Health and Social Care (DHSC). A government spokesperson said: \"As announced by the prime minister on 25 July, the UK is medically evacuating Gazan children for treatment in the UK. \"This support comes as the humanitarian situation continues to leave many in urgent need of medical care, with most hospitals in Gaza no longer functioning and essential medical supplies running out. \"We expect the children and their immediate family members to arrive in the UK in the coming weeks. For operational security reasons, we will not confirm details of any medical evacuation flights.\" A small number of Palestinian children were earlier brought to the UK for private medical treatment with the help of charity Project Pure Hope."
    },
    {
        "title": "Charlie Kirk suspect Tyler Robinson 'was in romantic relationship with transgender roommate' - Utah governor",
        "description": "The suspect accused of shooting dead right-wing influencer Charlie Kirk was in a romantic relationship with his transgender roommate, Utah's governor has said.",
        "url": "https://news.sky.com/story/charlie-kirk-suspect-tyler-robinson-was-in-romantic-relationship-with-transgender-roommate-utah-governor-13431020",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-tyler-robinson-mushot_7018026.jpg?20250912154005",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-14 14:49:00",
        "Headline": "Utah's Republican governor Spencer James Cox said Tyler Robinson was in a relationship with his roommate - who was in the process of transitioning - though his motive is unclear and officials have not said whether the relationship is relevant to their investigation.",
        "Content": " The suspect accused of shooting dead right-wing influencer Charlie Kirk was in a romantic relationship with his transgender roommate, Utah's governor has said. Tyler Robinson, 22, from Washington in Utah, is due to appear in court on Tuesday after Kirk, 31, was killed during one of his rallies at Utah Valley University on Wednesday. Robinson is being held without bail on suspicion of aggravated murder, a felony discharge of a firearm causing serious bodily injury, and obstruction of justice. According to Utah's Republican governor, Spencer James Cox, he was in a relationship with his roommate - who was in the process of transitioning. \"The roommate was a romantic partner,\" he told NBC News's Meet The Press on Sunday. \"We can confirm that that roommate is a boyfriend who is transitioning from male to female.\" He added that the roommate has been \"incredibly cooperative\" and had \"no idea that this [the shooting] was happening\", but that Robinson has not been cooperating with police. Kirk, who co-founded the conservative student movement Turning Point USA, regularly expressed anti-LGBTQ views. The motive of the shooting is unclear, and officials have not said whether Robinson's relationship - or his roommate's gender - is relevant to their investigation. Authorities are still trying to get access to cloud storage linked to Robinson, according to NBC. Mr Cox has previously said the suspect came from a \"conservative family, but his ideology was very different than his family\", adding in an interview with The Wall Street Journal that he had been \"deeply indoctrinated with leftist ideology\". According to the governor, his relatives have said Robinson was critical of Kirk, saying he was \"full of hate and spreading hate\" and \"talked about why he didn't like him and the viewpoints that he had\".  The 22-year-old is due to be charged when he makes his first court appearance on Tuesday, according to the Utah County attorney's office. He was in his third year of an electrical apprenticeship programme at Dixie Technical College in St George, Utah, NBC reported. A spokesperson for Utah Valley University, where Kirk was speaking when he was shot in the neck, said Robinson studied there for one semester in 2021. Kristin Schwiermann, a neighbour of his family's, described him as \"smart\" and \"quiet\", and added that he \"never caused any problems\".  Memorial to be held at Super Bowl venue It was revealed on Sunday that a memorial to Kirk will be held at the stadium where the 2023 US Super Bowl was held. State Farm Stadium, just outside of Phoenix, Arizona, is home to the American football team the Arizona Cardinals and can hold 60,000 people. President Donald Trump has said he plans to attend and will posthumously award Kirk with the highest US civilian honour - the Presidential Medal of Freedom. Kirk, who hosted his own self-titled podcast, had millions of followers on social media. He was a regular visitor at the White House and has been credited with the increase in young men voting for Mr Trump at the 2024 presidential election."
    },
    {
        "title": "Charlie Kirk memorial to be held in Arizona stadium",
        "description": "A memorial for right-wing US influencer Charlie Kirk will be held next Sunday, in a stadium that previously hosted the 2023 Super Bowl.",
        "url": "https://news.sky.com/story/charlie-kirk-memorial-to-be-held-in-arizona-stadium-13430742",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-turning-point-charlie-kirk_7020013.jpg?20250914115329",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-14 09:58:00",
        "Headline": "Right-wing influencer and Trump ally Charlie Kirk was fatally shot in the neck on Wednesday while speaking to students at Utah Valley University.",
        "Content": " A memorial for right-wing US influencer Charlie Kirk will be held next Sunday, in a stadium that previously hosted the 2023 Super Bowl. The 31-year-old, who was a close ally of Donald Trump, was fatally shot in the neck on Wednesday while speaking to university students at an event in Utah. His appearance at Utah Valley University was part of a planned tour of US college campuses. Turning Point USA, the prominent youth conservative organisation of which Mr Kirk was the president and co-founder, is holding the event at State Farm Stadium outside Phoenix. The venue is the home of the NFL's Arizona Cardinals and can hold more than 60,000 people. Tyler Robinson, a 22-year-old from Washington, Utah, is being held without bail after being arrested on suspicion of aggravated murder, felony discharge of a firearm causing serious bodily harm and obstruction of justice charges, according to court documents. The motivation behind the fatal shooting is still unclear, but Utah governor Spencer Cox commented that Robinson described Mr Kirk as \"full of hate and spreading hate\". \n                  Missing toddler who walked 7 miles alone through wilderness is led to safety by dog\n                 \n                  'I had mere seconds to act': Video shows man climbing out of moving Arizona rollercoaster after safety bar scare\n                 \n                  People living in US border town offer insight into why Kamala Harris 'lost big'\n                 Robinson is due to make an initial court appearance on Tuesday, when he is also expected to be charged, the Utah County attorney's office said.  President Trump, who will be back in the US after his UK state visit next week, has previously said he plans to attend Mr Kirk's funeral. Mr Trump has said he will be posthumously awarding Mr Kirk with the nation's highest civilian honour, the Presidential Medal of Freedom. Mr Kirk's body was flown back from Salt Lake City to his home state of Arizona on Air Force Two on Thursday, with the US vice president and close friend JD Vance on board. His widow, Erika Kirk, has vowed to continue his campus tour and his radio and podcast shows. Speaking publicly for the first time in a livestreamed video on Friday, she said: \"To everyone listening tonight across America, the movement my husband built will not die.\" \"It won't. I refuse to let that happen.\" She said she told her three-year-old daughter: \"Daddy went on a work trip with Jesus.\"  Read more: What the engravings on bullets in Charlie Kirk case may refer to Mr Kirk, who was a father of two, had millions of followers across social media. A makeshift memorial to Mr Kirk has been set up at Utah Valley University, with flowers, American flags and handwritten messages left at the main entrance. The university says there will be increased security when classes resume on Wednesday."
    },
    {
        "title": "UK and US firms announce deals in new 'golden age' of nuclear power ahead of Trump visit",
        "description": "The prime minister has hailed a new \"golden age\" of nuclear power as British and US companies announce five new commercial deals, ahead of the US president's state visit this week.",
        "url": "https://news.sky.com/story/uk-and-us-firms-announce-deals-in-new-golden-age-of-nuclear-power-ahead-of-trump-visit-13431336",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-cottam-coal-nuclear_7020894.jpg?20250914220336",
        "type": "US",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-09-14 23:01:00",
        "Headline": "UK and US firms announce five new commercial deals, including for a new nuclear power plant in Hartlepool, before President Trump arrives in the UK on Tuesday. They will be underpinned by a refreshed US-UK agreement to speed up the notoriously slow building process in both countries.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The prime minister has hailed a new \"golden age\" of nuclear power as British and US companies announce five new commercial deals, ahead of the US president's state visit this week. The plans include a new nuclear power plant in Hartlepool using latent, potentially cheaper technology and data centres powered by mini reactors in Nottinghamshire. Officials have been hurrying to coordinate the agreements before President Donald Trump jets in on Tuesday, with the two leaders expected to sign off on multibillion-pound tech deals as well as a revamped agreement to work together on nuclear power. They hope the new Atlantic Partnership for Advanced Nuclear Energy will speed up notoriously slow nuclear projects in both countries by slashing red tape and aligning safety standards. Both governments are betting big on nuclear to meet rising electricity demand and AI's voracious appetite for energy, while Sir Keir Starmer hopes it will boost jobs, growth and manufacturing in former industrial heartlands. The two leaders will also be hoping the high-profile visit will shake off last week's scandal over revelations of the ambassador to the US Lord Mandelson's links with convicted paedophile Jeffrey Epstein, with whom Mr Trump's own association is being scrutinised. The jewel of today's announcements is the plan to replace the outgoing Hartlepool nuclear power plant, which expires in 2028, with a new plant of up to 960MW using new \"advanced modular reactor\" (AMR) technology. \n                  Drill, Kemi, drill! Are Tory oil and gas plans a load of hot air?\n                 \n                  Energy bills expected to rise from October - despite previous forecasts\n                 \n                  Former Virgin Money chief Gadhia to chair energy supplier Ovo\n                 The AMR designer, US firm X-Energy, signed a Joint Development Agreement with British Gas-owner Centrica to build and fund the fleet, which they said would generate 2,500 construction jobs and maintain hundreds when up and running in the 2030s.  What are advanced modular reactors? Advanced or small modular reactors (AMR or SMR) are new, small nuclear power plants hoped to be quicker and faster to build than traditional technology, such as that used at the delayed and overbudget Hinkley and Sizewell sites. Around 80 designs are in development globally and they have long been promised but barely materialised. Read more: Why the UK has warmed up to nuclear power again Industry says SMRs are finally about to breakthrough, given governments' renewed appetite for nuclear power to meet energy security concerns, growing electricity demands and climate targets to phase out polluting fossil fuels. Why tech giants love new nuclear technology Tech giants are also hungry for SMRs to power booming AI data centres, which need the kind of clean, steady, 24/7 energy nuclear can provide. Today EDF announced early-stage plans with US nuclear energy firm Holtec to build data centres powered by SMRs at the former Cottam coal-fired power station in Nottinghamshire. If it goes ahead, it would be worth £11bn and create thousands of jobs during construction. These new reactors need a type of fuel (High-assay low-enriched uranium or HALEU) that is only available to buy commercially from Russia and China. Anxious about energy security, the UK government has been funding a company called Urenco to build a HALEU facility in Cheshire. Urenco has also announced a £4m deal to sell that fuel to the US market, where it is also exploring another manufacturing site. Two further deals to come out today involve a micro plant to power London Gateway Port and the scouting of sites for nuclear reactors designed by Bill Gates's Terrapower.  The news has been welcomed by industry and the union Prospect. Tom Greatrex, chief executive of the UK's Nuclear Industry Association, said: \"These deals are hugely welcome and build on a summer of record government investment in nuclear which is driving an industrial revival, creating thousands of high-value jobs, and strengthening the UK's energy security.\" But critics warn the new technology will still be expensive and slow, arguing the money should instead pay for renewables, batteries and insulating homes to reduce energy demand in the first place. They also fear Britain's disposal facilities can't cope with the nuclear waste. US promises 'nuclear renaissance' Sir Keir said the \"landmark UK-US nuclear partnership\" would \"drive down household bills in the long run, while delivering thousands of good jobs in the short term\". \"Together with the US, we're building a golden age of nuclear that puts both countries at the forefront of global innovation and investment,\" he added. US energy secretary Chris Wright hailed a \"true nuclear renaissance - harnessing the power of commercial nuclear to meet rising energy demand and fuel the AI revolution\". \"Meeting this demand will require strong partnerships with our allies around the world and robust collaboration with private sector innovators,\" he said. \"Today's commercial deals set up a framework to unleash commercial access in both the US and UK, enhancing global energy security, strengthening US energy dominance, and securing nuclear supply chains across the Atlantic.\" Andrew Bowie, shadow energy minister, said: \"All these announcements are simply building on the strong legacy left by the previous Conservative government who kick-started the nuclear revolution in the UK.\""
    },
    {
        "title": "Starmer urged to maximise pressure on US over tariffs ahead of Trump’s visit",
        "description": "Prime Minister Sir Keir Starmer is being urged to maximise pressure on the US to secure relief from tariffs ahead of Donald Trump's state visit.",
        "url": "https://news.sky.com/story/starmer-urged-to-maximise-pressure-on-us-over-tariffs-ahead-of-trump8217s-visit-13430800",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-president-trump_7020134.jpg?20250914131933",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-14 12:01:00",
        "Headline": "The Commons Business and Trade Committee said this is the moment to put pressure on the US president to agree to the final terms of a so-called economic prosperity deal.",
        "Content": "Prime Minister Sir Keir Starmer is being urged to maximise pressure on the US to secure relief from tariffs ahead of Donald Trump's state visit. The US president's two-day trip will officially begin on Wednesday and includes an overnight stay at Windsor Castle. This will be Mr Trump's second state visit, an unprecedented gesture for a US president, and will mark the first time he has met with King Charles since he became monarch. Ahead of his arrival, the Commons Business and Trade Committee said this is the moment to put pressure on Mr Trump to agree to the final terms of a so-called economic prosperity deal. The UK and US signed a trade deal in June that reduced tariffs on car and aerospace imports to the US, but failed to agree on terms for British steel, leaving tariffs on it at 25%. The sticking points are thought to include US concerns over steel products made elsewhere in the world, then finished in the UK. In a report published on Sunday, the committee welcomed the government securing swift tariff relief for key sectors. \"It is however now vital that government maximises pressure on the United States, beginning and following the president's state visit, to agree final terms for a lasting economic prosperity deal to end the threat of future sectoral tariffs, maximise predictability and that where the UK has secured terms which are second best to the EU, we aim to improve them,\" they added.  Newly appointed business and trade secretary Peter Kyle said on Sunday that a tariff relief for UK steel is currently being negotiated as he vowed to make an announcement \"as soon as possible\". The committee is also urging the government to seal a deal on aluminium and pharmaceuticals and for any final agreement to reflect the realities of the UK's supply chains and transition to low-carbon production. It said the UK should leverage the US partnership to gain an edge over China in artificial intelligence and defence technology, de-risked supply chains and greater security for critical minerals supplies. Appearing on Sunday Morning With Trevor Phillips, MP Mr Kyle cited his visit to Washington last week. He said: \"We are having very detailed conversations on a whole range of issues, the fruits of which are partly going to be announced in the coming weeks.\" It comes as the UK government earlier revealed that more than £1.25bn in private US investment will be infused into the UK's financial services sector. The investment, along with other capital commitments, secures £20bn in trade between the two nations - with £8bn to come to the UK and £12bn to go to the US. Mr Kyle said: \"That means a thousand jobs in Belfast, hundreds of jobs in Edinburgh and Manchester. These are new deals.\" He added: \"So, the relationship we have with America is actually benefiting workers rights around the country.\" Read more:What we know about Trump's state visitA vanity trip or a powerful card to play?  Mr Trump's state visit comes less than two months after his private holiday to Scotland, where he visited his golf courses in South Ayrshire and Aberdeenshire and met with the prime minister and First Minister John Swinney. The president's arrival on Tuesday evening is expected to spark mass protests by the Stop Trump Coalition in Windsor and London, and security will be heightened during his stay. The Prince and Princess of Wales will meet Mr Trump and first lady Melania on Wednesday morning in the Windsor estate grounds before accompanying the couple to meet the King and Queen for an open-air greeting. Ahead of the highly anticipated visit, specialist search unit officers were spotted scouring bollards, bins and drains outside the royal residence on Friday, with a sniffer dog on patrol. Lord Kim Darroch told Sky News: \"Trump does revere, is fascinated by, the Royal Family. \"He himself tells the story of sitting with his Scottish mother watching the coronation of Queen Elizabeth [in 1953]. \"When he came over for the first state visit in 2019, which I was involved in, he brought his whole family, which is like saying to them, 'look, look, I've made it to a state visit to the UK, I've made it to Buckingham Palace'. \"So, he will absolutely love the fact that he's, I think, the only American president to have had a second state visit. \"He enjoys all the pageantry and he will revel, I think, in every moment of it.\""
    },
    {
        "title": "UK and US firms announce deals in new 'golden age' of nuclear power ahead of Trump visit",
        "description": "The prime minister has hailed a new \"golden age\" of nuclear power as British and US companies announce five new commercial deals, ahead of the US president's state visit this week.",
        "url": "https://news.sky.com/story/uk-and-us-firms-announce-deals-in-new-golden-age-of-nuclear-power-ahead-of-trump-visit-13431336",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-cottam-coal-nuclear_7020894.jpg?20250914220336",
        "type": "Business",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-09-14 23:01:00",
        "Headline": "UK and US firms announce five new commercial deals, including for a new nuclear power plant in Hartlepool, before President Trump arrives in the UK on Tuesday. They will be underpinned by a refreshed US-UK agreement to speed up the notoriously slow building process in both countries.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The prime minister has hailed a new \"golden age\" of nuclear power as British and US companies announce five new commercial deals, ahead of the US president's state visit this week. The plans include a new nuclear power plant in Hartlepool using latent, potentially cheaper technology and data centres powered by mini reactors in Nottinghamshire. Officials have been hurrying to coordinate the agreements before President Donald Trump jets in on Tuesday, with the two leaders expected to sign off on multibillion-pound tech deals as well as a revamped agreement to work together on nuclear power. They hope the new Atlantic Partnership for Advanced Nuclear Energy will speed up notoriously slow nuclear projects in both countries by slashing red tape and aligning safety standards. Both governments are betting big on nuclear to meet rising electricity demand and AI's voracious appetite for energy, while Sir Keir Starmer hopes it will boost jobs, growth and manufacturing in former industrial heartlands. The two leaders will also be hoping the high-profile visit will shake off last week's scandal over revelations of the ambassador to the US Lord Mandelson's links with convicted paedophile Jeffrey Epstein, with whom Mr Trump's own association is being scrutinised. The jewel of today's announcements is the plan to replace the outgoing Hartlepool nuclear power plant, which expires in 2028, with a new plant of up to 960MW using new \"advanced modular reactor\" (AMR) technology. \n                  Drill, Kemi, drill! Are Tory oil and gas plans a load of hot air?\n                 \n                  Energy bills expected to rise from October - despite previous forecasts\n                 \n                  Former Virgin Money chief Gadhia to chair energy supplier Ovo\n                 The AMR designer, US firm X-Energy, signed a Joint Development Agreement with British Gas-owner Centrica to build and fund the fleet, which they said would generate 2,500 construction jobs and maintain hundreds when up and running in the 2030s.  What are advanced modular reactors? Advanced or small modular reactors (AMR or SMR) are new, small nuclear power plants hoped to be quicker and faster to build than traditional technology, such as that used at the delayed and overbudget Hinkley and Sizewell sites. Around 80 designs are in development globally and they have long been promised but barely materialised. Read more: Why the UK has warmed up to nuclear power again Industry says SMRs are finally about to breakthrough, given governments' renewed appetite for nuclear power to meet energy security concerns, growing electricity demands and climate targets to phase out polluting fossil fuels. Why tech giants love new nuclear technology Tech giants are also hungry for SMRs to power booming AI data centres, which need the kind of clean, steady, 24/7 energy nuclear can provide. Today EDF announced early-stage plans with US nuclear energy firm Holtec to build data centres powered by SMRs at the former Cottam coal-fired power station in Nottinghamshire. If it goes ahead, it would be worth £11bn and create thousands of jobs during construction. These new reactors need a type of fuel (High-assay low-enriched uranium or HALEU) that is only available to buy commercially from Russia and China. Anxious about energy security, the UK government has been funding a company called Urenco to build a HALEU facility in Cheshire. Urenco has also announced a £4m deal to sell that fuel to the US market, where it is also exploring another manufacturing site. Two further deals to come out today involve a micro plant to power London Gateway Port and the scouting of sites for nuclear reactors designed by Bill Gates's Terrapower.  The news has been welcomed by industry and the union Prospect. Tom Greatrex, chief executive of the UK's Nuclear Industry Association, said: \"These deals are hugely welcome and build on a summer of record government investment in nuclear which is driving an industrial revival, creating thousands of high-value jobs, and strengthening the UK's energy security.\" But critics warn the new technology will still be expensive and slow, arguing the money should instead pay for renewables, batteries and insulating homes to reduce energy demand in the first place. They also fear Britain's disposal facilities can't cope with the nuclear waste. US promises 'nuclear renaissance' Sir Keir said the \"landmark UK-US nuclear partnership\" would \"drive down household bills in the long run, while delivering thousands of good jobs in the short term\". \"Together with the US, we're building a golden age of nuclear that puts both countries at the forefront of global innovation and investment,\" he added. US energy secretary Chris Wright hailed a \"true nuclear renaissance - harnessing the power of commercial nuclear to meet rising energy demand and fuel the AI revolution\". \"Meeting this demand will require strong partnerships with our allies around the world and robust collaboration with private sector innovators,\" he said. \"Today's commercial deals set up a framework to unleash commercial access in both the US and UK, enhancing global energy security, strengthening US energy dominance, and securing nuclear supply chains across the Atlantic.\" Andrew Bowie, shadow energy minister, said: \"All these announcements are simply building on the strong legacy left by the previous Conservative government who kick-started the nuclear revolution in the UK.\""
    },
    {
        "title": "Ex-chancellor Lord Hammond to step down as Copper chair",
        "description": "Lord Hammond, the former chancellor of the exchequer, is preparing to step down as chairman of Copper, the digital assets group, as it reorients its growth plans away from the UK to the US market.",
        "url": "https://news.sky.com/story/ex-chancellor-lord-hammond-to-step-down-as-copper-chair-13430791",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-philip-hammond-lord-hammond_7020077.jpg?20250914124846",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-14 11:42:00",
        "Headline": "The former Tory minister is to step down from the board of the digital assets group after just three years as it strengthens its focus on the US market, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Lord Hammond, the former chancellor of the exchequer, is preparing to step down as chairman of Copper, the digital assets group, as it reorients its growth plans away from the UK to the US market. Sky News has learnt that Copper's board is in the process of recruiting a successor to Lord Hammond, who served as chancellor during Theresa May's premiership. Sources said the process was at an advanced stage and was expected to lead to the appointment of an experienced American finance executive before the end of the year. Lord Hammond, who took over the chairmanship of Copper in early 2023, is expected to remain a shareholder in the company after he steps down. He was previously an adviser to its board. Since leaving government, he has amassed a collection of private sector roles, and is now chairman of Railsr, an embedded finance business. One insider said he had been actively engaged in the identification of the company's next chair. \n                  Former world champion boxer Ricky Hatton has died aged 46\n                 \n                  From the general public to Hollywood and music stars, everybody wanted a piece of Ricky Hatton\n                 \n                  Adolescence star Owen Cooper makes history at Emmys\n                 Copper specialises in the provision of digital asset custody and trading technology services to clients. It counts Barclays and Alan Howard, the co-founder of Brevan Howard Asset Management, a prominent hedge fund, among its investors. Founded in 2018 and based in London, it employs hundreds of people. Lord Hammond has been critical of the pace of regulatory reform in the UK amid the rapid evolution of the global cryptocurrency and blockchain sectors. Last December, it emerged that Copper had abandoned its second bid to register in the UK with the Financial Conduct Authority. The previous year, its chairman told the Financial Times that Britain was falling behind in a crucial and fast-growing part of the financial services sector. \"Switzerland is further ahead; the EU is also moving faster,\" he told the newspaper. \"There has to be appetite to take some measured risk.\" Read more from Sky News:US financial firms pledge £1.25bn to UK ahead of Trump visitZoopla and Uswitch owner plots break-up and sale Copper has not raised a significant round of new funding for several years, and is not thought to have a need to secure additional capital. The company is now run by Amar Kuchinad, a former Goldman Sachs executive, who replaced its founder, Dmitry Tokarev, in the role. It recently announced the appointment of Rosie Murphy Williams, who previously worked at the London Stock Exchange and Royal Bank of Scotland, as its chief operating officer. Earlier this year, it said it had agreed an alliance with Cantor Fitzgerald's new Bitcoin financing business, underlining the continuing growth of cryptoassets and the businesses which serve them. Since US President Donald Trump began his second term in the White House, a glut of digital asset companies have rushed to join the public markets, buoyed by a favourable regulatory climate and growing investor interest. On Sunday, both Lord Hammond and Copper declined to comment."
    },
    {
        "title": "US financial firms pledge £1.25bn to UK ahead of Trump's visit",
        "description": "The UK government has announced more than &#163;1.25bn in private US investment in the UK's financial services sector ahead of US President Donald Trump's second state visit.",
        "url": "https://news.sky.com/story/us-financial-firms-pledge-163125bn-to-uk-ahead-of-trumps-visit-13430652",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-manchester-police-crime_6901775.jpg?20250430145210",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-14 01:35:00",
        "Headline": "Over £1.25bn in US investment has been pledged to the UK financial services sector ahead of Donald Trump's second state visit, promising thousands of new jobs and stronger trade ties.",
        "Content": "The UK government has announced more than £1.25bn in private US investment in the UK's financial services sector ahead of US President Donald Trump's second state visit. The new US investments are expected to create 1,800 jobs and boost benefits for millions of customers across the country, the UK government said. The deal secures £20bn in trade between the two nations - including an expected £7bn commitment from BlackRock, the world's largest asset manager. It is set to deliver more than £8bn in investment and capital commitments to the UK, with over £12bn flowing in the other direction - creating jobs and opportunities on both sides. Other companies expected to invest include PayPal, Bank of America, Citi, and S&P Global. Bank of America will create up to 1,000 new jobs in Belfast as part of its first-ever operation in Northern Ireland, the government said. Citi plans to invest £1.1bn across its UK operations, while S&P Global will create 200 permanent jobs in Manchester through a £4m investment. \n                  US court rules Trump's tariffs are illegal - but leaves them in place for now\n                 \n                  Redundancies begin at UK's largest bioethanol plant after government rejects bailout\n                 \n                  US and China extend tariffs deadline again\n                 \"Strengthening ties with the US boosts our economy, creates jobs, and secures our role in global finance,\" Business and Trade Secretary Peter Kyle said. \"These investments reflect the strength of our enduring 'golden corridor' with one of our closest trading partners, ahead of the US Presidential State Visit.\"  Chancellor of the Exchequer Rachel Reeves said that the commitment from America's leading financial institutions \"demonstrates the immense potential of the UK economy\", as well as \"our strong relationship with the US\". The UK and US agreed a \"landmark\" economic deal in May, which secured major tariff reductions for key sectors and protected jobs in the automotive and aerospace sectors. Discussions are ongoing with the US on a broader UK-US economic deal, aimed at increasing digital trade and strengthening supply chains. MPs urge pressure on US over tariffs ahead of Trump visit MPs have urged the government to apply maximum pressure on the US to obtain tariff relief ahead of Donald Trump's state visit. The Commons Business and Trade Committee described the upcoming visit as a crucial opportunity to push the US president to finalise the remaining terms of the economic prosperity deal. While the UK and US reached a trade agreement in June that lowered tariffs on car and aerospace exports to the US, negotiations on British steel tariffs remain unresolved, keeping them at 25%.  Read more from Sky News:BlackRock to invest £500m in UK data centres during Trump visitZero growth in July as economy 'continued to slow' Committee chairman Liam Byrne said the state visit is \"no mere pageant\". \"We can't escape the truth that Britain now trades with its biggest partner on terms that are worse than the past, the EU has in places secured a better edge, and key sectors of our economy still face the peril of new tariffs. That means jobs hang in the balance and investment waits on certainty.\" The committee also called on the government to finalise agreements on aluminium and pharmaceuticals, ensuring that the terms accurately reflect the UK's supply chain dynamics and its shift toward low-carbon production. It emphasised that the UK should also use its partnership with the US to strengthen its position against China in areas such as artificial intelligence and defence technology, while also securing more resilient supply chains and improved access to critical minerals. A government spokesperson said the \"special relationship\" between the UK and the US \"remains strong\" and that \"thanks to our trade deal, the UK is still the only country to have avoided 50% steel and aluminium tariffs\". \"We will work with the US to implement this landmark deal as soon as possible to give industry the security they need, protect vital jobs, and put more money in people's pockets,\" the government spokesperson said, adding, \"as well as welcoming the president on this historic state visit.\""
    },
    {
        "title": "Bridget Phillipson calls for party unity as she launches deputy leadership bid",
        "description": "And they're off! Bridget Phillipson was first away in her two-horse race with Lucy Powell in the Labour deputy leadership stakes.",
        "url": "https://news.sky.com/story/bridget-phillipson-calls-for-party-unity-as-she-launches-deputy-leadership-bid-13431294",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bridget-phillipson_7020825.jpg?20250914194423",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-09-14 18:21:00",
        "Headline": "Despite Education Secretary Bridget Phillipson winning 175 nominations from Labour MPs to Lucy Powell's 117, bookmakers StarSports this weekend made Ms Powell 4/6 favourite with Ms Phillipson at 5/4.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n And they're off! Bridget Phillipson was first away in her two-horse race with Lucy Powell in the Labour deputy leadership stakes. Facing a rival who was sacked from the government nine days earlier, the education secretary said the deputy leader should be a cabinet minister, as Angela Rayner was. Launching her campaign at The Fire Station, a trendy music and entertainment venue in Sunderland, she also vowed to turn up the heat on Nigel Farage and Reform UK. She also repeatedly called for party unity, at a time when Labour MPs are growing increasingly mutinous over Sir Keir Starmer's dealings with sacked Washington ambassador Lord Mandelson. Despite Ms Phillipson winning 175 nominations from Labour MPs to Ms Powell's 117, bookmakers StarSports this weekend made Ms Powell 4/6 favourite with Ms Phillipson at 5/4. But though the new deputy leader will not be deputy prime minister, a title that's gone to David Lammy, Ms Phillipson praised the way Ms Rayner combined the two roles and rejected suggestions that as a cabinet minister she would be a part-time deputy leader. \"What can be achieved under a deputy leader with a seat at cabinet, just look at Angela Rayner,\" Ms Phillipson told her enthusiastic supporters. \"Angela knew the importance of the role she had. There was nothing part-time about her deputy leadership. \"Last year I campaigned up and down the country to get Labour candidates elected - I've not stopped as education secretary - and I won't stop as deputy leader. \"Because with local elections, and with elections in Wales and Scotland right around the corner, that role is going to be more important than ever. \"So that's why, today, I pledge to continue Angela Rayner's campaigning role as deputy leader. \"Continuing her mission to give members a strong voice at the cabinet table. \"Her ruthless focus on getting our candidates elected and re-elected, alongside her total determination to drive change from government. Because what mattered was not just what she believed, but that she could act on it.\" Read moreAnalysis: Sacking Powell might haunt StarmerExplainer: How does the deputy leadership contest work? Ms Phillipson pledged to run a campaign of \"hope, not grievance\" and claimed the party descending into division would put the chances of children and families benefiting from Labour policies at risk. But admitting Sir Keir Starmer's government had made mistakes, she appealed to party members: \"You can use this contest to look backward, to pass judgement on what has happened in the last year, or you can use it to shape positively what happens in the run-up to the next election. \"Back me so I can unite our party, deliver the change we want to see and beat Reform. Back me so together, we can deliver that second term of Labour government.\" Starmer's candidate vs Manchester mayor's As she did in a speech at the TUC conference last week, Ms Phillipson spoke about her upbringing \"from a tough street of council houses in the North East all the way to the cabinet\". At the TUC, she said she grew up - \"just me and my mam\" - and told how when she was nine, a man who'd burgled the house turned up at the front door with a baseball bat and threatened her mother. Ms Powell, who enjoys the powerful backing of Labour's 'King of the North' Andy Burnham, called this weekend for a change in culture in 10 Downing Street, with better decisions and fewer unforced errors. His backing has led to the deputy contest being seen as a battle between Sir Keir's candidate, Ms Phillipson, and that of the Greater Manchester mayor, seen increasingly as a leadership rival to the prime minister. And like all the best horse races, with the betting currently so tight, when the result is declared on 25 October the result could be a photo-finish."
    },
    {
        "title": "First migrants to be sent back to France this week under returns deal",
        "description": "The Home Office will return migrants to France for the first time this week under the terms of a new deal, Sky News understands.",
        "url": "https://news.sky.com/story/first-migrants-to-be-sent-back-to-france-next-week-under-returns-deal-13430747",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-small-boats-starmer_6989917.png?20250813164711",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-14 10:04:00",
        "Headline": "The 'one in, one out' deal means the UK can send people back to France if they have entered the country illegally. In exchange, the UK will allow asylum seekers to enter through a safe and legal route.",
        "Content": " The Home Office will return migrants to France for the first time this week under the terms of a new deal, Sky News understands. The agreement, which was signed in July, saw migrants first detained on 6 August, and they will now be flown back to the continent. The 'one in, one out' deal means the UK can send people back to France if they have entered the country illegally. In exchange, the UK will allow asylum seekers to enter through a safe and legal route - as long as they have not previously tried to enter illegally. It is a pilot scheme for now, which will be in place until June 2026. Read more: How UK-France migrant returns deal works  Politics Hub - latest updates The scheme comes amid growing public anger over immigration, with the issue recently becoming voters' top concern for the first time since Brexit. \n                  Asylum seekers come face-to-face with migrant hotel critics\n                 \n                  How many illegal migrants are in Britain? The key numbers driving the immigration debate\n                 \n                  Is good weather to blame for small boat crossings? It's not as simple as the government suggests\n                 On Saturday, up to 150,000 people marched in London, gathering around Westminster in a protest dubbed 'Unite the Kingdom', and organised by far-right activist Tommy Robinson. There were a number of clashes with police, leading to 25 arrests and 26 police officers being injured. Laura Trott, the shadow education secretary, said the \"horrendous incidents\" of violence were \"completely abhorrent\", and said she was glad to hear those involved will feel the force of the law. But speaking on Sunday Morning with Trevor Phillips, she warned that the protest shows that people feel \"let down\" by the government on immigration. Ms Trott told Sky News: \"There is clearly an issue in this country at the moment about immigration and migration. People clearly feel let down by a government that came in and said they were going to 'smash the gangs'. And what we've seen is an increase in migration. \"We are not seeing the action from this government, which is distracted by scandal after scandal.\"  She also accused Sir Keir Starmer of being a \"rudderless prime minister\". Business Secretary Peter Kyle said that violence against police is \"unacceptable\" but said it is \"proof that we live in a country where free speech, free association is alive and well\". On immigration, he insisted that the government is \"straining at the bit to get a grip on the migration crisis\", which Mr Kyle said Labour \"inherited from the Conservatives\".  \"We've been doing everything we can,\" he said. \"The lesson is that by cooperating with our partners, France, rather than rowing with them, we are able to deliver. \"So I hope the flights will start as quickly as possible.\" But he said he was unaware of the exact date. Mr Kyle added that ministers were \"also angry about what we've inherited\" and that they were doing \"everything possible to get a grip on it\". The number of migrants arriving in the UK after crossing the English Channel has topped 30,000 for the year so far. It is the earliest point in a calendar year at which the 30,000 mark has been passed since data on the crossings was first reported in 2018."
    },
    {
        "title": "Mandelson appointment was 'worth the risk' despite 'strong relationship' with Epstein, says minister",
        "description": "Appointing Lord Mandelson as the UK's ambassador to the US was \"worth the risk\", a minister has told Sky News.",
        "url": "https://news.sky.com/story/mandelson-appointment-worth-the-risk-despite-strong-relationship-with-epstein-says-minister-13430731",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-peter-kyle-sunday-morning_7019982.jpg?20250914100526",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-14 09:14:00",
        "Headline": "Peter Kyle has defended the decision to give Lord Mandelson the US ambassador role - despite knowing he had links to Jeffrey Epstein.",
        "Content": " Appointing Lord Mandelson as the UK's ambassador to the US was \"worth the risk\", a minister has told Sky News. Peter Kyle said the government put the Labour peer forward for the Washington role, despite knowing he had a \"strong relationship\" with convicted sex offender Jeffrey Epstein. It is this relationship that led to Peter Mandelson being fired on Thursday by the prime minister. Politics Hub: Latest updates But explaining the decision to appoint Lord Mandelson, Business Secretary Mr Kyle said: \"The risk of appointing [him] knowing what was already public was worth the risk. \"Now, of course, we've seen the emails which were not published at the time, were not public and not even known about. And that has changed this situation.\" Speaking to Sunday Morning with Trevor Phillips, he rejected the suggestion that Lord Mandelson was appointed to Washington before security checks were completed. \n                  Labour MPs already angry over claim Mandelson's appointment was 'worth the risk'\n                 \n                  Kemi Badenoch accuses Sir Keir Starmer of 'lying' about Peter Mandelson prior to sacking him\n                 \n                  There is a witch-hunt vibe in Labour on how and who approved Peter Mandelson's appointment\n                 He explained there was a two-stage vetting process for Lord Mandelson before he took on the ambassador role. The first was done by the Cabinet Office, while the second was a \"political process where there were political conversations done in Number 10 about all the other aspects of an appointment\", he said. This is an apparent reference to Sir Keir Starmer asking follow-up questions based on the information provided by the vetting.  These are believed to have included why Lord Mandelson continued contact with Epstein after he was convicted and why he was reported to have stayed in one of the paedophile financier's homes while he was in prison. Mr Kyle said: \"Both of these things turned up information that was already public, and a decision was made based on Peter's singular talents in this area, that the risk of appointing knowing what was already public was worth the risk.\" Mr Kyle also pointed to some of the government's achievements under Lord Mandelson, such as the UK becoming the first country to sign a trade deal with the US, and President Donald Trump's state visit next week. Mr Kyle also admitted that the government knew that Lord Mandelson and Epstein had \"a strong relationship\". \"We knew that there were risks involved,\" he concluded. PM had only 'extracts of emails' ahead of defence of Mandelson at PMQs - as Tories accuse him of 'lying' Speaking to Sky News, Kyle also sought to clarify the timeline of what Sir Keir Starmer knew about Lord Mandelson's relationship with Epstein, and when he found this out. It follows Conservative Party leader Kemi Badenoch accusing the prime minister of \"lying to the whole country\" about his knowledge of the then US ambassador's relationship with the paedophile. Allegations about Lord Mandelson began to emerge in the newspapers on Tuesday, while more serious allegations - that the Labour peer had suggested Epstein's first conviction for sexual offences was wrongful and should be challenged - were sent to the Foreign Office on the same day by Bloomberg, which was seeking a response from the government. But the following day, Sir Keir went into the House of Commons and publicly backed Britain's man in Washington, giving him his full confidence. Only the next morning - on Thursday - did the PM then sack Lord Mandelson, a decision Downing Street has insisted was made based on \"new information\". Read more:Witch-hunt vibe in Labour on who approved appointmentSenior Labour MP demands answers over Mandelson vetting  Speaking to Sunday Morning with Trevor Phillips, Mr Kyle said: \"Number 10 had what was publicly available on Tuesday, which was extracts of emails which were not in context, and they weren't the full email. \"Immediately upon having being alerted to extracts of emails, the Foreign Office contacted Peter Mandelson and asked for his account of the emails and asked for them to be put into context and for his response. That response did not come before PMQs [on Wednesday]. \"Then after PMQs, the full emails were released by Bloomberg in the evening. \"By the first thing the next morning when the prime minister had time to read the emails in full, having had them in full and reading them almost immediately of having them - Peter was withdrawn as ambassador.\"  The Conservatives have claimed Sir Keir is lying about what he knew, with Laura Trott telling Sky News there are \"grave questions about the prime minister's judgement\". The shadow education secretary called for \"transparency\", and told Sunday Morning with Trevor Phillips: \"We need to understand what was known and when.\" They believe that Sir Keir was in possession of the full emails on Tuesday, because the Foreign Office passed these to Number 10. This is despite the PM backing Mandelson the following day. Ms Trott explained: \"We are calling for transparency because, if what we have outlined is correct, then the prime minister did lie and that is an extremely, extremely serious thing to have happened.\" She added: \"This was a prime minister who stood on the steps of Downing Street and said that he was going to restore political integrity and look where we are now. We've had two senior resignations in the space of the number of weeks. \"The prime minister's authority is completely shot.\" But Ms Trott refused to be drawn on whether she thinks Sir Keir should resign, only stating that he is \"a rudderless, a weak prime minister whose authority is shot at a time we can least afford it as a country\"."
    },
    {
        "title": "Labour MPs already angry over claim Mandelson's appointment was 'worth the risk'",
        "description": "If you want to know why so many Labour MPs are seething over the government's response to the Mandelson saga, look no further than my mobile phone at 9.12am this Sunday.",
        "url": "https://news.sky.com/story/labour-mps-already-angry-over-claim-mandelsons-appointment-was-worth-the-risk-13430757",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-lord-mandelson-starmer_7018206.jpg?20250912192342",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-09-14 11:05:00",
        "Headline": "A minister's justification for hiring Lord Mandelson's has already angered Labour MPs, and only dirties the government's image.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n  If you want to know why so many Labour MPs are seething over the government's response to the Mandelson saga, look no further than my mobile phone at 9.12am this Sunday. At the top of the screen is a news notification about an interview with the family of a victim of the notorious paedophile Jeffrey Epstein, saying his close friend Peter Mandelson should \"never have been made\" US ambassador. Directly below that, a Sky News notification on the business secretary's interview, explaining that the appointment of Lord Mandelson to the job was judged to be \"worth the risk\" at the time. Politics latest - follow live Peter Kyle went on to praise Lord Mandelson's \"outstanding\" and \"singular\" talents and the benefits that he could bring to the US-UK relationship. While perhaps surprisingly candid in nature about the decision-making process that goes on in government, this interview is unlikely to calm concerns within Labour. Quite the opposite. \n                  First migrants to be sent back to France this week under returns deal\n                 \n                  Kyle pledges 'ambitious' growth agenda in call with UK bosses   \n                 \n                  Trump ally Representative Jim Jordan to criticise Online Safety Act in meeting with Technology Secretary Peter Kyle\n                 For many in the party, this is a wholly different debate to a simple cost-benefit calculation of potential political harm. As one long-time party figure put it to my colleague Sam Coates: \"I don't care about Number Ten or what this means for Keir or any of that as much as I care that this culture of turning a blind eye to horrendous behaviour is endemic at the top of society and Peter Kyle has literally just come out and said it out loud. \"He was too talented and the special relationship too fraught for his misdeeds to matter enough. It's just disgusting.\" There are two problems for Downing Street here. The first is that you now have a government which - after being elected on the promise to restore high standards - appears to be admitting that previous indiscretions can be overlooked if the cause is important enough.  Package that up with other scandals that have resulted in departures - Louise Haigh, Tulip Siddiq, Angela Rayner - and you start to get a stink that becomes hard to shift. The second is that it once again demonstrates an apparent lack of ability in government to see around corners and deal with political and policy crises, before they start knocking lumps out of the Prime Minister.  Remember, for many the cardinal sin here was not necessarily the original appointment of Mandelson (while eyebrows were raised at the time, there was nowhere near the scale of outrage we've had in the last week with many career diplomats even agreeing the with logic of the choice) but the fact that Sir Keir Starmer walked into PMQs and gave the ambassador his full-throated backing when it was becoming clear to many around Westminster that he simply wouldn't be able to stay in post. The explanation from Downing Street is essentially that a process was playing out, and you shouldn't sack an ambassador based on a media enquiry alone. But good process doesn't always align with good politics. Something this barrister-turned-politician may now be finding out the hard way."
    },
    {
        "title": "UK and US firms announce deals in new 'golden age' of nuclear power ahead of Trump visit",
        "description": "The prime minister has hailed a new \"golden age\" of nuclear power as British and US companies announce five new commercial deals, ahead of the US president's state visit this week.",
        "url": "https://news.sky.com/story/uk-and-us-firms-announce-deals-in-new-golden-age-of-nuclear-power-ahead-of-trump-visit-13431336",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-cottam-coal-nuclear_7020894.jpg?20250914220336",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-09-14 23:01:00",
        "Headline": "UK and US firms announce five new commercial deals, including for a new nuclear power plant in Hartlepool, before President Trump arrives in the UK on Tuesday. They will be underpinned by a refreshed US-UK agreement to speed up the notoriously slow building process in both countries.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The prime minister has hailed a new \"golden age\" of nuclear power as British and US companies announce five new commercial deals, ahead of the US president's state visit this week. The plans include a new nuclear power plant in Hartlepool using latent, potentially cheaper technology and data centres powered by mini reactors in Nottinghamshire. Officials have been hurrying to coordinate the agreements before President Donald Trump jets in on Tuesday, with the two leaders expected to sign off on multibillion-pound tech deals as well as a revamped agreement to work together on nuclear power. They hope the new Atlantic Partnership for Advanced Nuclear Energy will speed up notoriously slow nuclear projects in both countries by slashing red tape and aligning safety standards. Both governments are betting big on nuclear to meet rising electricity demand and AI's voracious appetite for energy, while Sir Keir Starmer hopes it will boost jobs, growth and manufacturing in former industrial heartlands. The two leaders will also be hoping the high-profile visit will shake off last week's scandal over revelations of the ambassador to the US Lord Mandelson's links with convicted paedophile Jeffrey Epstein, with whom Mr Trump's own association is being scrutinised. The jewel of today's announcements is the plan to replace the outgoing Hartlepool nuclear power plant, which expires in 2028, with a new plant of up to 960MW using new \"advanced modular reactor\" (AMR) technology. \n                  Drill, Kemi, drill! Are Tory oil and gas plans a load of hot air?\n                 \n                  Energy bills expected to rise from October - despite previous forecasts\n                 \n                  Former Virgin Money chief Gadhia to chair energy supplier Ovo\n                 The AMR designer, US firm X-Energy, signed a Joint Development Agreement with British Gas-owner Centrica to build and fund the fleet, which they said would generate 2,500 construction jobs and maintain hundreds when up and running in the 2030s.  What are advanced modular reactors? Advanced or small modular reactors (AMR or SMR) are new, small nuclear power plants hoped to be quicker and faster to build than traditional technology, such as that used at the delayed and overbudget Hinkley and Sizewell sites. Around 80 designs are in development globally and they have long been promised but barely materialised. Read more: Why the UK has warmed up to nuclear power again Industry says SMRs are finally about to breakthrough, given governments' renewed appetite for nuclear power to meet energy security concerns, growing electricity demands and climate targets to phase out polluting fossil fuels. Why tech giants love new nuclear technology Tech giants are also hungry for SMRs to power booming AI data centres, which need the kind of clean, steady, 24/7 energy nuclear can provide. Today EDF announced early-stage plans with US nuclear energy firm Holtec to build data centres powered by SMRs at the former Cottam coal-fired power station in Nottinghamshire. If it goes ahead, it would be worth £11bn and create thousands of jobs during construction. These new reactors need a type of fuel (High-assay low-enriched uranium or HALEU) that is only available to buy commercially from Russia and China. Anxious about energy security, the UK government has been funding a company called Urenco to build a HALEU facility in Cheshire. Urenco has also announced a £4m deal to sell that fuel to the US market, where it is also exploring another manufacturing site. Two further deals to come out today involve a micro plant to power London Gateway Port and the scouting of sites for nuclear reactors designed by Bill Gates's Terrapower.  The news has been welcomed by industry and the union Prospect. Tom Greatrex, chief executive of the UK's Nuclear Industry Association, said: \"These deals are hugely welcome and build on a summer of record government investment in nuclear which is driving an industrial revival, creating thousands of high-value jobs, and strengthening the UK's energy security.\" But critics warn the new technology will still be expensive and slow, arguing the money should instead pay for renewables, batteries and insulating homes to reduce energy demand in the first place. They also fear Britain's disposal facilities can't cope with the nuclear waste. US promises 'nuclear renaissance' Sir Keir said the \"landmark UK-US nuclear partnership\" would \"drive down household bills in the long run, while delivering thousands of good jobs in the short term\". \"Together with the US, we're building a golden age of nuclear that puts both countries at the forefront of global innovation and investment,\" he added. US energy secretary Chris Wright hailed a \"true nuclear renaissance - harnessing the power of commercial nuclear to meet rising energy demand and fuel the AI revolution\". \"Meeting this demand will require strong partnerships with our allies around the world and robust collaboration with private sector innovators,\" he said. \"Today's commercial deals set up a framework to unleash commercial access in both the US and UK, enhancing global energy security, strengthening US energy dominance, and securing nuclear supply chains across the Atlantic.\" Andrew Bowie, shadow energy minister, said: \"All these announcements are simply building on the strong legacy left by the previous Conservative government who kick-started the nuclear revolution in the UK.\""
    },
    {
        "title": "New drone factory to open in Swindon in 2026",
        "description": "A new drone factory will open in Swindon to help produce the uncrewed air systems the UK has sent to fight Russia in Ukraine, the government will announce today.",
        "url": "https://news.sky.com/story/new-drone-factory-to-open-in-swindon-in-2026-13431357",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-john-healey-drone_7020888.jpg?20250914215919",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-14 23:01:00",
        "Headline": "The 254,000-square-foot facility will be operated by the manufacturer Tekever, Defence Secretary John Healey will say at a site visit today.",
        "Content": "A new drone factory will open in Swindon to help produce the uncrewed air systems the UK has sent to fight Russia in Ukraine, the government will announce today. The 254,000-square-foot facility will be operated by Tekever and is due to open in 2026, Defence Secretary John Healey will say at a site visit later. It will create 1,000 jobs and bring core production of the AR5 drone to the UK for the first time, while increasing capacity of existing AR3 production. The UK has bought £270m in Tekever drones to help Ukrainian forces destroy advanced Russian air defence systems since Vladimir Putin launched his invasion in February 2022. It will be the manufacturer's fourth UK site and its largest so far. \"This new factory is a clear demonstration that this government is making defence an engine for growth across the UK,\" Mr Healey is expected to say. \"Tekever's expansion will bring high-skilled jobs and world-leading drone manufacturing to Swindon, while strengthening defence supply chains. \"By backing Britain's defence industry, we strengthen both our economy and national security.\" Read more from Sky NewsBridget Phillipson launches deputy leader bidEx-chancellor to step down as Copper chairBadenoch accuses Starmer of lying about Mandelson Swindon has long had an important defence role, having produced the Supermarine Spitfire during the Second World War. The new Tekever-run site will also take over production of the RAF's StormShroud capability. It comes after defence emerged as one of the key winners of Chancellor Rachel Reeves's spending review in June. The defence budget will increase from 2.3% of gross domestic product (GDP) in 2025 to 2.6% in 2027 - the equivalent of a £600m uplift. In May, Prime Minister Sir Keir Starmer announced an extra £19m in investment of AR3 Tekever StormShroud drones for the RAF. Karl Brew, Tekever's director of defence, said the Swindon factory will play a \"central role\" in the production of AR3 EVO systems and ensure an \"advanced, sovereign capability at pace and in close partnership with the UK defence ecosystem\"."
    },
    {
        "title": "From the general public to Hollywood and music stars, everybody wanted a piece of Ricky Hatton",
        "description": "There are few sporting stars who cross from the newspaper back pages to become front page news... but Ricky Hatton always was one of them.",
        "url": "https://news.sky.com/story/from-the-general-public-to-hollywood-and-music-stars-everybody-wanted-a-piece-of-ricky-hatton-13430977",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ricky-hatton-boxing_7020354.jpg?20250914151931",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2025-09-14 14:17:00",
        "Headline": "Ricky Hatton had 45 wins and three defeats over a 15-year career, with celebrities often flocking to watch his bouts ringside.",
        "Content": "\n          Arts and entertainment correspondent\n        There are few sporting stars who cross from the newspaper back pages to become front page news... but Ricky Hatton always was one of them. Aside from his boxing brilliance, it was his personality and humour which made people pay attention. In recent years, his happy-go-lucky character saw him cast on reality shows like Dancing on Ice. But what's more interesting is how and why the public came to have such great affection for him back in the day. Follow the latest: Tributes being paid to former boxing world champion Putting it kindly, sports stars aren't always known for their sparkling personalities. It was Ricky's lack of interest in the trappings of fame which accompanied his epic run of victories that made him all the more cool. \n                  Former world champion boxer Ricky Hatton has died aged 46\n                 \n                  Adolescence star Owen Cooper makes history at Emmys\n                 \n                  Prime suspect in Madeleine McCann case refuses to speak to British police\n                 He was the working-class hero who seemed unstoppable. It was a story that everyone wanted to follow. Celebrities wanted to be seen alongside him. Piggy-backing off his popularity the likes of Brad Pitt, Angelina Jolie, Denzel Washington and David Beckham were all pictured ringside at one time or another, drawn to his fan-friendly style and impressive winning streak. At the same time as the Gallagher brothers were flying the flag for music from Manchester, Hatton was doing the same for boxing. During his 2008 fight against Paulie Malignaggi, he had Liam and Noel escort him to the ring. In an interview he said he thought all three of them might be killed when Liam held up Hatton's IBO belt inches from Malignaggi's face and with a swagger said 'what do you think about that you d*** head?'. Stories like that are why his appeal extended beyond sport. He was an ordinary bloke who'd done extraordinary things. He never lost sight of who he was and fans loved him for it."
    }
]