[
    {
        "title": "President Trump threatens Canada over trade war - saying it should become 'cherished 51st state'",
        "description": "President Donald Trump has again threatened Canada in their emerging trade war, repeating that the neighbouring country should become \"our cherished 51st state\".",
        "url": "https://news.sky.com/story/president-trump-threatens-canada-over-trade-war-saying-it-should-become-cherished-51st-state-13301663",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-canada-tariffs-logging_6817563.jpg?20250202153222",
        "type": "Home",
        "Author": "Michael Drummond",
        "Date Published": "2025-02-02 13:47:00",
        "Headline": "It comes after the US leader said he is imposing 25% tariffs on imports from Canada and Mexico - and the two countries retaliated with their own measures.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n President Donald Trump has again threatened Canada in their emerging trade war, repeating that the neighbouring country should become \"our cherished 51st state\". The US leader said this weekend that he is imposing 25% tariffs on imports from Canada and Mexico. The two countries then hit back with retaliatory tariffs and today spoke of working together. Follow latest:Trump ignites trade war as Canada and Mexico hit back Speaking on his Truth Social platform on Sunday afternoon, Mr Trump said: \"We pay hundreds of Billions of Dollars to SUBSIDIZE Canada. Why? There is no reason. \"We don't need anything they have. We have unlimited Energy, should make our own Cars, and have more Lumber than we can ever use.\" He claimed that without the \"massive subsidy\" Canada \"ceases to exist as a viable country\". He added: \"Therefore, Canada should become our Cherished 51st State. Much lower taxes, and far better military protection for the people of Canada - AND NO TARIFFS!\" Mr Trump later said any potential pain caused by the trade war would be worth it. \"Will there be some pain? Yes, maybe (and maybe not!). It will all be worth the price that must be paid,\" the US leader said. 👉 Listen to Sky News Daily on your podcast app 👈 The Trump administration had said that the tariffs aimed to stop the spread and manufacturing of the opioid fentanyl, as well as pressuring America's neighbours to limit illegal immigration to the US. But it risks a trade war and higher prices for American consumers. Economists argue supply chains will be disrupted and businesses will suffer increased costs - leading to an overall rise in prices. Both Mexico and Canada rely heavily on their imports and exports, which make up around 70% of their Gross Domestic Products (GDPs), putting them at even greater risk from the new tariffs. In his Sunday posts on Truth Social, Mr Trump also took aim at the Wall Street Journal which he said was leading a \"Tariff lobby\", after the newspaper ran an opinion piece titled \"The Dumbest Trade War in History\". Read more:Why has Trump targeted Mexico and Canada?How Donald Trump's tariffs could impact consumers Canada's high commissioner to the UK Ralph Goodale, speaking to Sky News' Kamali Melbourne, had a warning for allies. He said: \"I would just say to our allies around the world watch this closely, you could be next, and in the meantime, stand by your friends.\" He added Mr Trump's words were a \"salesman's pitch\" and despite the historically close relationship between the countries \"we don't want to be each other\".  Announcing the retaliatory tariffs on Saturday night, Canadian Prime Minister Justin Trudeau delivered a passionate message to American consumers. \"It will have real consequences for you, the American people,\" he said, saying it would result in higher prices on groceries and other goods. Mr Trudeau reminded Americans that Canadian troops fought alongside them in Afghanistan and helped them respond to domestic crises including the wildfires in California and Hurricane Katrina. In a later post on X, Mr Trudeau called on people to buy Canadian-made goods, saying \"choose Canada\". Canada's ambassador to the US said she hoped the tariffs would not come into effect on Tuesday, but she added she expects the Canadian government to stand firm. \"We're not at all interested in escalating, but I think that there will be a very strong demand on our government to make sure that we stand up for the deal that we have struck with the United States,\" Ambassador Kirsten Hillman told ABC News on Sunday. Meanwhile, in Mexico, President Claudia Sheinbaum said: \"We categorically reject the White House's slander that the Mexican government has alliances with criminal organisations, as well as any intention of meddling in our territory.\" She added: \"If the United States government and its agencies wanted to address the serious fentanyl consumption in their country, they could fight the sale of drugs on the streets of their major cities, which they don't do, and the laundering of money that this illegal activity generates that has done so much harm to its population.\""
    },
    {
        "title": "US secretary of state says Panama must reduce Chinese influence on canal or face consequences",
        "description": "US secretary of state Marco Rubio has told Panama's president the country must reduce alleged Chinese influence over the Panama Canal or face potential retaliation from America.",
        "url": "https://news.sky.com/story/us-secretary-of-state-says-panama-must-reduce-chinese-influence-on-canal-or-face-consequences-13302091",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-marco-rubio-panama_6818021.jpg?20250202201002",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-02 20:01:00",
        "Headline": "Donald Trump has previously called for the Panama Canal to be returned to the US, and made allegations of Chinese influence in the area.",
        "Content": "US secretary of state Marco Rubio has told Panama's president the country must reduce alleged Chinese influence over the Panama Canal or face potential retaliation from America. The comments were made in a face-to-face meeting with Panamanian President Jose Raul Mulino on Sunday. Follow latest: Trump ignites trade war It was Mr Rubio's first foreign trip as America's top diplomat and comes as Mr Mulino has so far resisted pressure from the US. Mr Trump previously demanded the canal be returned to US control and has repeatedly made allegations about China's influence in the area. Allegations over China's influence in the canal stem from two ports on either side which are run by publicly listed Hong Kong company CK Hutchinson. \"Secretary Rubio made clear that this status quo is unacceptable and that absent immediate changes, it would require the United States to take measures necessary to protect its rights under the treaty,\" the State Department said in a summary of the meeting. Speaking on behalf of Mr Trump, Mr Rubio said the US president had decided China's presence in the canal area violates a treaty that led to the US turning the waterway over to Panama in 1999. That treaty calls for the permanent neutrality of the American-built canal. \"I don't feel like there's a real threat against the treaty and its validity,\" Mr Mulino said after the meeting with Mr Rubio. 👉 Listen to Sky News Daily on your podcast app 👈 The canal, an important waterway for global trade, has emerged as a flashpoint for the new administration. Mr Mulino said it had been a \"good-faith meeting\" that helped \"to clear up doubts\". He acknowledged that China's role in the ports at either end of the canal had raised concerns with Washington. But Mr Mulino said the consortium controlling them was being audited and the canal authority would give the US official a more detailed explanation. He added that Panama would not renew its agreement with China's Belt and Road Initiative when it expires. Around 200 people marched in Panama City in protest during Mr Rubio's visit, chanting \"Marco Rubio out of Panama\" and \"long live national sovereignty\". Some burned a banner with images of Mr Trump and Mr Rubio. After the meeting, Mr Mulino suggested his country could accept direct deportations from the US, of non-Panamanian migrants who cross the Darien Gap jungle on Panama's southern border with Colombia. But he insisted the US would have to cover the cost. \"We spoke extensively about the problem of migration, with the understanding that Panama is a transit point,\" Mr Mulino said after the meeting."
    },
    {
        "title": "Aston Villa sign Marcus Rashford on loan deal from Manchester United",
        "description": "Aston Villa have signed Marcus Rashford on loan from Manchester United.",
        "url": "https://news.sky.com/story/aston-villa-agree-marcus-rashford-loan-deal-with-manchester-united-13300826",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-marcus-rashford-aston-villa_6818086.png?20250202222533",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-02 22:03:00",
        "Headline": "The England international had fallen out of favour at his boyhood club and had been frozen out by new manager Ruben Amorim.",
        "Content": "Aston Villa have signed Marcus Rashford on loan from Manchester United. The 27-year-old joined United at the age of seven and will now spend the rest of the season at the Midlands club after falling out of favour in his boyhood side. United manager Ruben Amorim had frozen Rashford out at Old Trafford since taking over, telling him that he \"has to change\" to have a future at the football club. Villa offered him a way out after he hadn't featured in United's last 12 games and they agreed an initial loan deal until the end of the season with a reported option to buy. Sky News understands that does not commit Rashford to remain at Villa next season if other offers come in. Sharing news of the move on his Instagram, Rashford said: \"I would like to thank Manchester United and Aston Villa for making this loan deal happen. \"I was lucky to have a few clubs approach me but Aston Villa was an easy decision - I really admire the way that Aston Villa have been playing this season, and the manager's ambitions. \"I just want to play football and am excited to get started. \"I wish everyone at Manchester United all the best for the rest of the season.\" Following the departures of Jhon Duran to Saudi Arabia in a £64m move and Emiliano Buendia to Bayer Leverkusen in Germany on loan, Villa had been looking for attacking reinforcements before Monday's transfer deadline. Villa boss Unai Emery was reportedly personally keen on bringing Rashford in. The forward, who is believed to earn about £300,000 per week, wasn't picked for England's Euro 2024 squad last year, and has struggled for form in recent seasons. Sky Sports News reported that Villa will cover at least 75% of Rashford's wages, but that this could rise up to 90% depending on his personal and team performances. Read more from Sky News:Slimming World founder dies in MajorcaIsland on earthquake alert after more than 200 tremors Rashford became the youngest recipient of an honorary doctorate from the University of Manchester in October 2021, following his campaigning against child poverty - which included forcing then prime minister Boris Johnson to make a U-turn on free school meals. The England international said in December he was \"ready for a new challenge\"."
    },
    {
        "title": "Sir Keir Starmer to urge EU nations to 'shoulder more of the burden' on defence spending",
        "description": "Sir Keir Starmer will urge European countries to commit more in defence spending as he heads to Brussels for security talks.",
        "url": "https://news.sky.com/story/sir-keir-starmer-to-urge-eu-nations-to-shoulder-more-of-the-burden-on-defence-spending-13301648",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-starmer-olaf-scholz_6817697.jpg?20250202162514",
        "type": "Home",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-02-02 22:29:00",
        "Headline": "The prime minister's call comes as Donald Trump repeats his demand for NATO allies to spend at least 5% of their national incomes on their militaries. The UK government currently spends around 2.3% of GDP on defence.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  Sir Keir Starmer will urge European countries to commit more in defence spending as he heads to Brussels for security talks. The prime minister will call on Europe to \"step up and shoulder more of the burden\" to fend off the threat posed by Vladimir Putin's Russia. Sir Keir, the first prime minister to meet all the leaders of the 27 EU nations in Brussels since Brexit, will argue the bloc needs to capitalise on the weak state of the Russian economy by continuing with its sanctions regime. The prime minister will meet NATO Secretary General Mark Rutte on Monday afternoon before travelling to meet with the leaders of the 27 EU member states at an informal meeting of the European Council. Sir Keir is expected to say: \"We need to see all allies stepping up - particularly in Europe. \"President Trump has threatened more sanctions on Russia and it's clear that's got Putin rattled. We know that he's worried about the state of the Russian economy. \"I'm here to work with our European partners on keeping up the pressure, targeting the energy revenues and the companies supplying his missile factories to crush Putin's war machine. \"Because ultimately, alongside our military support, that is what will bring peace closer.\"  Sir Keir's suggestion that EU countries should spend more on defence is likely to open him up to criticism from the Conservatives, who have urged the government to increase defence spending to 2.5% of national income. The prime minister said at the end of last year that he would \"set out a path\" to lift defence spending to 2.5% of national income in the spring. The UK says it currently spends around 2.3% of GDP [gross domestic product] on defence. Last year EU member states spent an average of 1.9% of EU GDP on defence, according to the European Defence Agency, a 30% increase compared with 2021. Earlier this week European Council President Antonio Costa said the 23 EU members who belong to NATO are likely to agree to raise the defence spending target above the current 2% of national output at the next NATO summit in June. Read more:Starmer must delicately balance his risky EU resetBuilder shortage challenging Labour's growth plans However, Donald Trump has repeatedly criticised NATO - the military alliance consisting of 30 European countries and the US and Canada - arguing that his country is contributing too much to the alliance's budget while Europeans contribute too little. During the US election campaign, President Trump said America would only help defend NATO members from a future attack by Russia if they met their spending obligations. He also said members of NATO should be contributing 5% of their GDPs to defence spending - rather than the previous target of 2%. The session of the Informal European Council comes as the government seeks to reset its relationship with the EU and boost areas of cooperation, including on defence and tackling illegal migration.  On Sunday the prime minister hosted German Chancellor Olaf Scholz at his country residence Chequers, where the two leaders agreed on the \"importance of scaling up and coordinating defence production across Europe\", Downing Street said. However, the government has repeatedly said that a closer relationship with the EU will only be sought within its red lines - meaning there will be no return to freedom of movement and rejoining the customs union or single market."
    },
    {
        "title": "University of Essex students named as victims after car crashed into building in Colchester",
        "description": "Four university students who died when a car crashed into a building have been named by Essex Police.",
        "url": "https://news.sky.com/story/university-of-essex-students-named-as-victims-after-car-crashed-into-building-in-colchester-13301216",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-essex-colchester-essex-police_6816781.jpg?20250201180038",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-02 13:30:00",
        "Headline": "Police are appealing for witnesses who saw a black Ford Focus being driven near the scene. ",
        "Content": "Four university students who died when a car crashed into a building have been named by Essex Police. The crash happened at around 4.40am on Saturday morning on Magdalen Street in Colchester. Police have named the victims as University of Essex students Makyle Bayley, 22, Eva Darold-Tchikaya, 21, Anthony Hibbert, 24, and Daljang Wol, 22. The university's acting vice-chancellor Professor Maria Fasli said they \"played an active role in our community through clubs and societies\" and had \"young lives filled with hope, promise, talent, and dreams for the future\". \"Anthony and Daljang were outstanding members of our Essex Rebels men's basketball first team, Makyle was a talented basketball player who was a member of our BUCS basketball team and Eva undertook several roles in our Essex Blades Dance Club and was active in many other clubs and societies,\" she said in a statement. \"Their loss will be felt by their families and closest friends and by all our university community. In classrooms, in halls, in shared moments of laughter and learning - they were part of us, and their absence will be felt profoundly.\" Professor Fasli said the university would share details in the coming days of \"a time and place for our university community to gather in remembrance\". The University of Essex said in a statement \"our whole university is in mourning\", adding: \"They touched the lives of so many of us at Essex; their friends, classmates, the teams they played for, and the staff with whom they spent time. \"It is impossible to imagine the loss being felt by their families and many friends. Our thoughts are with everyone who knew them at this terrible time.\" Essex Police asked anyone who saw a black Ford Focus being driven along Magdalen Street or in the near vicinity around the time of the crash, or who has any CCTV, dash-cam or doorbell footage, to contact them. Temporary Assistant Chief Constable Stuart Hooper said: \"I want to extend my condolences to the friends and family of Makyle, Eva, Anthony and Daljang. \"This will be an incredibly difficult time for them and we have specialist officers supporting them. \"Our specialist serious collision investigation unit is investigating what led up to the collision but at this stage we do not believe any other vehicles were involved.\""
    },
    {
        "title": "Grammys red carpet fashion 2025: All the best looks from the stars and nominees",
        "description": "Nominees and celebrity guests hit the red carpet in style at this year's Grammy Awards.",
        "url": "https://news.sky.com/story/grammys-red-carpet-fashion-2025-all-the-best-looks-from-the-stars-and-nominees-13302151",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sabrina-carpenter-grammys_6818128.jpg?20250202233139",
        "type": "Home",
        "Author": "Bethany Minelle",
        "Date Published": "2025-02-02 22:46:00",
        "Headline": "Chappell Roan, Kacey Musgraves, Billie Eilish, Kanye West, Bianca Censori and Willow and Jaden Smith were among the stars walking the red carpet at this year's Grammy Awards.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Nominees and celebrity guests hit the red carpet in style at this year's Grammy Awards. With a focus on supporting relief efforts following the devastating Los Angeles-area wildfires the tone was a little more muted, but the fashion as exciting as ever. Here are some of the looks from the Grammys red carpet. Read more: Everything to know ahead of the show"
    },
    {
        "title": "Farmer Tony Martin, who shot burglar dead in 1999, dies aged 80",
        "description": "Farmer Tony Martin, who shot dead a burglar in 1999, has died aged 80, his friend has said. ",
        "url": "https://news.sky.com/story/farmer-tony-martin-who-shot-burglar-dead-in-1999-dies-aged-80-13301865",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-tony-martin-death_6817720.jpg?20250202164009",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-02 16:27:00",
        "Headline": "Martin was initially convicted of murder but this was reduced to manslaughter on appeal. ",
        "Content": "Farmer Tony Martin, who shot dead a burglar in 1999, has died aged 80, his friend has said.  Martin was initially convicted of murdering 16-year-old Fred Barras but this was reduced to manslaughter on appeal. He was living alone at his farmhouse in Emneth Hungate, Norfolk, which was nicknamed Bleak House, when he caught Brendon Fearon, then 29, and Barras inside. He fired his pump-action shotgun three times towards the intruders, killing Barras and injuring Fearon. Martin's close friend Malcolm Starr told Sky News he died in hospital after suffering a stroke. \"Since the incident, it affected him badly. He's at peace at last - he's in a better place. He lost his mother and two aunts who he was close to,\" he said. \"He was an eccentric. He once turned up at my office on a tractor wearing a red beret. He just left his farm and thought he'd visit. A month later, we heard someone was shot near him. I said 'I hope it's not Tony'. \"Now I realise why he couldn't communicate with people - when it was taken to appeal, he was found to have Asperger's. I don't think he's capable of lying. Someone that lied would give the police the wrong story. \"I would say on his behalf it surely really upset him, but he didn't have any remorse. They invaded his privacy. \"He had so much turmoil and he never recovered from it. I think he deserves some good publicity. He stuck to his guns and didn't apologise.\" Martin was initially jailed for nine years in 2000 but released three years later following the appeal. He never returned to live in his old home. His case provoked a national debate about how far people should be allowed to go to defend their homes and he became a cause celebre for campaigners. Read more from Sky News:Four university students killed in crash namedFormer Harrods employee accuses al Fayed brothers In 2018, Martin backed pensioner Richard Osborn-Brooks after he stabbed burglar Henry Vincent to death at his home in Hither Green, southeast London. Mr Osborn-Brooks faced no police action and a coroner later ruled Mr Vincent was lawfully killed."
    },
    {
        "title": "Greek island Santorini on earthquake alert after more than 200 tremors",
        "description": "More than 200 tremors near the island of Santorini have prompted Greek authorities to close schools and tell residents to avoid some ports and drain swimming pools.",
        "url": "https://news.sky.com/story/greek-island-santorini-on-earthquake-alert-after-more-than-200-tremors-13302077",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-greece-swimming-pool_6802766.jpg?20250118101847",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-02 19:35:00",
        "Headline": "Authorities have closed schools and told residents to avoid large events and drain swimming pools.",
        "Content": "More than 200 tremors near the island of Santorini have prompted Greek authorities to close schools and tell residents to avoid some ports and drain swimming pools. Earthquake experts say the increase in seismic activity around the Aegean tourist island - known for its whitewashed buildings and black-sand beaches - is not related to volcanic activity. Greek Prime Minister Kyriakos Mitsotakis chaired an emergency meeting in Athens, as Santorini authorities prepared for a potential evacuation. Tents have been set up in an outdoor stadium, police and the fire brigade have been put on alert and special disaster response units with sniffer dogs are on standby. Island residents have been advised to avoid large open-air events and to stay away from four small ports including the harbour of Fira, which mainly serves cruise ships. Home and hotel owners have also been told to drain their swimming pools over concerns that large volumes of water could destabilise buildings in the event of a strong quake. Schools will be closed on Monday in Santorini as well as on the nearby islands of Amorgos, Ios and Anafi. More than 200 tremors have hit since early on Friday but there have been no reports of damage or casualties. The strongest earthquake recorded was magnitude 4.6 on Sunday afternoon, while a few tremors of over magnitude 4 and dozens of magnitude 3 have followed. Read more from Sky News:Slimming World founder dies in MajorcaFarmer who shot burglar dead in 1999 dies Experts said it was impossible to predict whether the seismic activity could lead to a stronger tremor, but added that the area could potentially produce a 6-magnitude quake. Greece sits on multiple fault lines and is often rattled by earthquakes. Santorini is visited by about three million people annually, including many British tourists. One of the largest volcanic eruptions in history, around 1600 BC, formed the island in its current shape, while the last eruption in the area occurred in 1950."
    },
    {
        "title": "Grammy Awards: Everything to know ahead of the show",
        "description": "It's the biggest night in music, and the biggest prize is album of the year - and this time around all eyes will be on Beyonce to see if she'll finally take home the top gong.",
        "url": "https://news.sky.com/story/grammy-awards-everything-to-know-ahead-of-the-show-13300671",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-beyonce-taylor-swift_6283963.png?20230914031906",
        "type": "Home",
        "Author": "Bethany Minelle",
        "Date Published": "2025-02-02 00:01:00",
        "Headline": "The biggest night in music, stars we can expect to see at this year's Grammy ceremony include Taylor Swift, Beyonce, Sabrina Carpenter, Chappell Roan, Cardi B and Will Smith.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n It's the biggest night in music, and the biggest prize is album of the year - and this time around all eyes will be on Beyonce to see if she'll finally take home the top gong. Despite being the most Grammy-nominated person in history, it's an award that has alluded her up to now. Last year Taylor Swift took home the prize for her album Midnights and is up for it again this year for The Tortured Poets Department. Ironically, even if Beyonce doesn't win, she'll still make Grammy history, as the person with the most nominations in that category without a win. If Swift bags it, she'll make history too - beating her own record as the person to have won the category the most times. Others up for best album are Sabrina Carpenter, Charli XCX, Billie Eilish, Chappell Roan, Andre 3000 and Jacob Collier. Here's a whistle-stop tour of what to expect from the night. \n                  Jay-Z appears on red carpet with Beyonce and Blue Ivy after he was accused of raping girl, 13\n                 \n                  Yale University introduces course on Beyonce's political and cultural impact\n                 \n                  Beyonce and Taylor Swift make history as Grammy nominations revealed\n                 Where, when and what? The 67th annual Grammy Awards take place at the Crypto.com Arena in Los Angeles on Sunday night. With a whopping 94 prizes to give out, the night kicks off early with a premiere ceremony at 12.30pm in LA - 8.30pm here in the UK - which gives out the majority of the awards. But the ones everyone will be talking about are album of the year, record of the year, song of the year and best new artist, which are presented later. The red carpet kicks off at 11pm UK time, and we will be covering all the fashion of the night here on Sky News online. The main ceremony begins at 1am UK time and lasts three and a half hours. This year's awards recognise music released between 16 September 2023 and 30 August 2024. How will the LA fires affect the night? It's natural that the wildfires which have decimated parts of the city, claiming 29 lives, will take the focus of the event. The Recording Academy has cancelled a swathe of industry events around the show, instead allocating resources to Los Angeles-area wildfire relief and rebuilding efforts. The Recording Academy and MusiCares also launched the Los Angeles Fire Relief Effort with a $1m donation. Currently, they've raised and pledged more than $4m in emergency aid to those in the music industry affected by the wildfires. Who are the presenters? Comedian Trevor Noah will host the show for the fifth consecutive time. Stars presenting awards include Taylor Swift, Red Hot Chilli Peppers bandmembers Anthony Kiedis and Chad Smith, Cardi B, Gloria Estefan, Olivia Rodrigo, Queen Latifah, SZA, Victoria Monet and Will Smith - who coincidentally has a new album out. Who will perform? Benson Boone, Billie Eilish, Chappell Roan, Charli XCX, Doechii, RAYE, Sabrina Carpenter, Shakira and Teddy Swims will all perform. While Stevie Wonder and Janelle Monae will headline a tribute to the late, legendary producer Quincy Jones. Brad Paisley, Brittany Howard, Coldplay's Chris Martin, Cynthia Erivo, Herbie Hancock, Jacob Collier, John Legend, Lainey Wilson, Sheryl Crow and St. Vincent will also appear. Who's up for an award? Beyonce leads the Grammy nods with 11, bringing her career total to 99 nominations. That makes her the most nominated artist in Grammy history. As of 2023, she's also the most decorated artist, having earned 32 trophies across her career. Post Malone, Billie Eilish, Kendrick Lamar and Charli XCX follow with seven nominations. Taylor Swift and first-time nominees Sabrina Carpenter and Chappell Roan boast six nominations each. There are a couple of surprise nods in there too - looking back over five decades. The Beatles are up for two awards - record of the year and best rock performance. Now and Then, first recorded in the 1970s, was completed by Paul McCartney and Ringo Starr last year with the help of AI. It remains to be seen if Grammy voters will be put off by the tech tweaks, or if nostalgia will prevail. Where can I watch it? You can watch the premiere ceremony, red carpet and main ceremony on the Recording Academy's YouTube channel or the Grammy official website. Main category nominees Album Of The YearNew Blue Sun - Andre 3000Cowboy Carter- BeyonceShort N' Sweet - Sabrina CarpenterBrat - Charli XCXDjesse Vol. 4 - Jacob CollierHit Me Hard And Soft - Billie EilishChappell Roan The Rise and Fall of a Midwest Princess - Chappell RoanThe Tortured Poets Department - Taylor Swift Record Of The YearNow And Then - The BeatlesTexas Hold 'Em - BeyonceEspresso - Sabrina Carpenter360 - Charli XCXBirds Of A Feather - Billie EilishNot Like Us - Kendrick LamarGood Luck, Babe! - Chappell RoanFortnight - Taylor Swift Featuring Post Malone Song Of The YearA Bar Song (Tipsy) - Sean Cook, Jerrel Jones, Joe Kent, Chibueze Collins Obinna, Nevin Sastry & Mark Williams, songwriters (Shaboozey)Birds Of A Feather - Billie Eilish O'Connell & Finneas O'Connell, songwriters (Billie Eilish)Die With A Smile - Dernst 'D'Mile' Emile II, James Fauntleroy, Lady Gaga, Bruno Mars & Andrew Watt, songwriters (Lady Gaga & Bruno Mars)Fortnight - Jack Antonoff, Austin Post & Taylor Swift, songwriters (Taylor Swift Featuring Post Malone)Good Luck, Babe! - Kayleigh Rose Amstutz, Daniel Nigro & Justin Tranter, songwriters (Chappell Roan)Not Like Us - Kendrick Lamar, songwriter (Kendrick Lamar)Please Please Please - Amy Allen, Jack Antonoff & Sabrina Carpenter, songwriters (Sabrina Carpenter)Texas Hold 'Em - Brian Bates, Beyonce, Elizabeth Lowell Boland, Megan Bülow, Nate Ferraro & Raphael Saadiq, songwriters (Beyonce) Best New ArtistBenson BooneSabrina CarpenterDoechiiKhruangbinRayeChappell RoanShaboozeyTeddy Swims"
    },
    {
        "title": "Sir Keir Starmer to urge EU nations to 'shoulder more of the burden' on defence spending",
        "description": "Sir Keir Starmer will urge European countries to commit more in defence spending as he heads to Brussels for security talks.",
        "url": "https://news.sky.com/story/sir-keir-starmer-to-urge-eu-nations-to-shoulder-more-of-the-burden-on-defence-spending-13301648",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-starmer-olaf-scholz_6817697.jpg?20250202162514",
        "type": "UK",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-02-02 22:29:00",
        "Headline": "The prime minister's call comes as Donald Trump repeats his demand for NATO allies to spend at least 5% of their national incomes on their militaries. The UK government currently spends around 2.3% of GDP on defence.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  Sir Keir Starmer will urge European countries to commit more in defence spending as he heads to Brussels for security talks. The prime minister will call on Europe to \"step up and shoulder more of the burden\" to fend off the threat posed by Vladimir Putin's Russia. Sir Keir, the first prime minister to meet all the leaders of the 27 EU nations in Brussels since Brexit, will argue the bloc needs to capitalise on the weak state of the Russian economy by continuing with its sanctions regime. The prime minister will meet NATO Secretary General Mark Rutte on Monday afternoon before travelling to meet with the leaders of the 27 EU member states at an informal meeting of the European Council. Sir Keir is expected to say: \"We need to see all allies stepping up - particularly in Europe. \"President Trump has threatened more sanctions on Russia and it's clear that's got Putin rattled. We know that he's worried about the state of the Russian economy. \"I'm here to work with our European partners on keeping up the pressure, targeting the energy revenues and the companies supplying his missile factories to crush Putin's war machine. \"Because ultimately, alongside our military support, that is what will bring peace closer.\"  Sir Keir's suggestion that EU countries should spend more on defence is likely to open him up to criticism from the Conservatives, who have urged the government to increase defence spending to 2.5% of national income. The prime minister said at the end of last year that he would \"set out a path\" to lift defence spending to 2.5% of national income in the spring. The UK says it currently spends around 2.3% of GDP [gross domestic product] on defence. Last year EU member states spent an average of 1.9% of EU GDP on defence, according to the European Defence Agency, a 30% increase compared with 2021. Earlier this week European Council President Antonio Costa said the 23 EU members who belong to NATO are likely to agree to raise the defence spending target above the current 2% of national output at the next NATO summit in June. Read more:Starmer must delicately balance his risky EU resetBuilder shortage challenging Labour's growth plans However, Donald Trump has repeatedly criticised NATO - the military alliance consisting of 30 European countries and the US and Canada - arguing that his country is contributing too much to the alliance's budget while Europeans contribute too little. During the US election campaign, President Trump said America would only help defend NATO members from a future attack by Russia if they met their spending obligations. He also said members of NATO should be contributing 5% of their GDPs to defence spending - rather than the previous target of 2%. The session of the Informal European Council comes as the government seeks to reset its relationship with the EU and boost areas of cooperation, including on defence and tackling illegal migration.  On Sunday the prime minister hosted German Chancellor Olaf Scholz at his country residence Chequers, where the two leaders agreed on the \"importance of scaling up and coordinating defence production across Europe\", Downing Street said. However, the government has repeatedly said that a closer relationship with the EU will only be sought within its red lines - meaning there will be no return to freedom of movement and rejoining the customs union or single market."
    },
    {
        "title": "University of Essex students named as victims after car crashed into building in Colchester",
        "description": "Four university students who died when a car crashed into a building have been named by Essex Police.",
        "url": "https://news.sky.com/story/university-of-essex-students-named-as-victims-after-car-crashed-into-building-in-colchester-13301216",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-essex-colchester-essex-police_6816781.jpg?20250201180038",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-02 13:30:00",
        "Headline": "Police are appealing for witnesses who saw a black Ford Focus being driven near the scene. ",
        "Content": "Four university students who died when a car crashed into a building have been named by Essex Police. The crash happened at around 4.40am on Saturday morning on Magdalen Street in Colchester. Police have named the victims as University of Essex students Makyle Bayley, 22, Eva Darold-Tchikaya, 21, Anthony Hibbert, 24, and Daljang Wol, 22. The university's acting vice-chancellor Professor Maria Fasli said they \"played an active role in our community through clubs and societies\" and had \"young lives filled with hope, promise, talent, and dreams for the future\". \"Anthony and Daljang were outstanding members of our Essex Rebels men's basketball first team, Makyle was a talented basketball player who was a member of our BUCS basketball team and Eva undertook several roles in our Essex Blades Dance Club and was active in many other clubs and societies,\" she said in a statement. \"Their loss will be felt by their families and closest friends and by all our university community. In classrooms, in halls, in shared moments of laughter and learning - they were part of us, and their absence will be felt profoundly.\" Professor Fasli said the university would share details in the coming days of \"a time and place for our university community to gather in remembrance\". The University of Essex said in a statement \"our whole university is in mourning\", adding: \"They touched the lives of so many of us at Essex; their friends, classmates, the teams they played for, and the staff with whom they spent time. \"It is impossible to imagine the loss being felt by their families and many friends. Our thoughts are with everyone who knew them at this terrible time.\" Essex Police asked anyone who saw a black Ford Focus being driven along Magdalen Street or in the near vicinity around the time of the crash, or who has any CCTV, dash-cam or doorbell footage, to contact them. Temporary Assistant Chief Constable Stuart Hooper said: \"I want to extend my condolences to the friends and family of Makyle, Eva, Anthony and Daljang. \"This will be an incredibly difficult time for them and we have specialist officers supporting them. \"Our specialist serious collision investigation unit is investigating what led up to the collision but at this stage we do not believe any other vehicles were involved.\""
    },
    {
        "title": "Farmer Tony Martin, who shot burglar dead in 1999, dies aged 80",
        "description": "Farmer Tony Martin, who shot dead a burglar in 1999, has died aged 80, his friend has said. ",
        "url": "https://news.sky.com/story/farmer-tony-martin-who-shot-burglar-dead-in-1999-dies-aged-80-13301865",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-tony-martin-death_6817720.jpg?20250202164009",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-02 16:27:00",
        "Headline": "Martin was initially convicted of murder but this was reduced to manslaughter on appeal. ",
        "Content": "Farmer Tony Martin, who shot dead a burglar in 1999, has died aged 80, his friend has said.  Martin was initially convicted of murdering 16-year-old Fred Barras but this was reduced to manslaughter on appeal. He was living alone at his farmhouse in Emneth Hungate, Norfolk, which was nicknamed Bleak House, when he caught Brendon Fearon, then 29, and Barras inside. He fired his pump-action shotgun three times towards the intruders, killing Barras and injuring Fearon. Martin's close friend Malcolm Starr told Sky News he died in hospital after suffering a stroke. \"Since the incident, it affected him badly. He's at peace at last - he's in a better place. He lost his mother and two aunts who he was close to,\" he said. \"He was an eccentric. He once turned up at my office on a tractor wearing a red beret. He just left his farm and thought he'd visit. A month later, we heard someone was shot near him. I said 'I hope it's not Tony'. \"Now I realise why he couldn't communicate with people - when it was taken to appeal, he was found to have Asperger's. I don't think he's capable of lying. Someone that lied would give the police the wrong story. \"I would say on his behalf it surely really upset him, but he didn't have any remorse. They invaded his privacy. \"He had so much turmoil and he never recovered from it. I think he deserves some good publicity. He stuck to his guns and didn't apologise.\" Martin was initially jailed for nine years in 2000 but released three years later following the appeal. He never returned to live in his old home. His case provoked a national debate about how far people should be allowed to go to defend their homes and he became a cause celebre for campaigners. Read more from Sky News:Four university students killed in crash namedFormer Harrods employee accuses al Fayed brothers In 2018, Martin backed pensioner Richard Osborn-Brooks after he stabbed burglar Henry Vincent to death at his home in Hither Green, southeast London. Mr Osborn-Brooks faced no police action and a coroner later ruled Mr Vincent was lawfully killed."
    },
    {
        "title": "Slimming World founder Margaret Miles-Bramwell dies in Majorca aged 76",
        "description": "Margaret Miles-Bramwell, the founder of weight loss company Slimming World, has died aged 76.",
        "url": "https://news.sky.com/story/slimming-world-founder-margaret-miles-bramwell-dies-in-majorca-aged-76-13302059",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-margaret-miles-bramwell_6817979.jpg?20250202193309",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-02 19:20:00",
        "Headline": "Miles-Bramwell founded Slimming World in Alfreton, Derbyshire, in 1969 and was made an OBE by the then Prince Charles in 2009.",
        "Content": "Margaret Miles-Bramwell, the founder of weight loss company Slimming World, has died aged 76. Miles-Bramwell died in Majorca on Sunday morning, surrounded by her family. The company said in a statement she \"touched the hearts and changed the lives of millions of people\". She founded Slimming World in Alfreton, Derbyshire, in 1969 and was made an OBE by the then Prince Charles for services to the health of the British public in 2009. Her company worked with the NHS on its first weight management referral scheme in 2000, which allowed doctors to refer overweight patients to Slimming World. Speaking after receiving her royal honour, she said: \"In the early days, in the sixties, there was some help around but it was the sort that used humiliation tactics. \"I really felt that we needed to treat overweight people with respect and courtesy and as adults and not as children who needed a slap or something. That was really what inspired me.\" Miles-Bramwell also owned a theatre in Majorca and the British boat builder Pearl Yachts. She was named Business Woman of the Year at the National Business Women's Awards in 2023. Read more from Sky News:How Trump's tariffs could impact consumersGrammys: Everything to knowKate wants focus on her work not her outfits Lisa Salmon, Slimming World managing director, said: \"Margaret steered her ship in the way she lived her life - with a generous spirit, passionate conviction, a wicked (and rebellious!) sense of humour and a fierce belief in doing the right thing.\" \"Our job now is to continue to keep her legacy alive by doing the very same thing,\" she added."
    },
    {
        "title": "Breaking economies could be just the first step for expansionist Trump",
        "description": "Donald Trump claims this tariff gut-punch at his three largest trading partners is just a matter of common sense.",
        "url": "https://news.sky.com/story/breaking-economies-could-be-just-the-first-step-for-expansionist-trump-13301769",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-justin_6817673.jpg?20250202160855",
        "type": "World",
        "Author": "Diana Magnay",
        "Date Published": "2025-02-02 15:32:00",
        "Headline": "Canada has more than just a trade war on its hands as the US president says the country should \"become our cherished 51st state\".",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n Donald Trump claims this tariff gut-punch at his three largest trading partners is just a matter of common sense. They in turn are imploring him to see reason, with Mexico and China calling for dialogue and cooperation. Follow live updates: Trump ignites trade war Canada's prime minister Justin Trudeau said on Saturday night - as he announced a reciprocal 25% tariff on $106bn worth of American goods - that the last time he had spoken directly with the US president was at Mar-a-Lago before the inauguration. Much good that visit did him.  President Trump is defying the wisdom of decades that free trade encourages growth and prosperity in an interconnected global economy. He is intent on rebalancing trade deficits, bringing manufacturing home and encouraging foreign investors to set up shop in the US. His justification for tariffs is that they will force Mexico, China and Canada to halt the influx of fentanyl, its precursor chemicals and illegal migrants into the US. Mexico is already working hard on both measures. One of the few areas of diplomatic engagement with China over recent years has been the resumption of cooperation on counter-narcotics. And as the Canadian prime minister said yesterday, only 1% of illegal fentanyl or illegal immigration crosses into the US via that northern border, and Canada is taking additional measures to reduce that further. It is surely just a pretext.  Perhaps most alarming to any believer in the sovereignty of nations is the thought that President Trump really means it when he says \"Canada should become our cherished 51st state\". He does not seem to be relenting on his threats against Greenland, after a testy conversation with Denmark's prime minister where he refused to back down on his demands on the territory. Read more:Why has Trump targeted Mexico and Canada?How Donald Trump's tariffs could impact consumers  His secretary of state, Marco Rubio, is currently in Panama - where Trump has threatened to take the Panama Canal by force. Break Canada's economy and this expansionist US president may believe he can bend their will. Canada has more than just a trade war on its hands."
    },
    {
        "title": "US secretary of state says Panama must reduce Chinese influence on canal or face consequences",
        "description": "US secretary of state Marco Rubio has told Panama's president the country must reduce alleged Chinese influence over the Panama Canal or face potential retaliation from America.",
        "url": "https://news.sky.com/story/us-secretary-of-state-says-panama-must-reduce-chinese-influence-on-canal-or-face-consequences-13302091",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-marco-rubio-panama_6818021.jpg?20250202201002",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-02 20:01:00",
        "Headline": "Donald Trump has previously called for the Panama Canal to be returned to the US, and made allegations of Chinese influence in the area.",
        "Content": "US secretary of state Marco Rubio has told Panama's president the country must reduce alleged Chinese influence over the Panama Canal or face potential retaliation from America. The comments were made in a face-to-face meeting with Panamanian President Jose Raul Mulino on Sunday. Follow latest: Trump ignites trade war It was Mr Rubio's first foreign trip as America's top diplomat and comes as Mr Mulino has so far resisted pressure from the US. Mr Trump previously demanded the canal be returned to US control and has repeatedly made allegations about China's influence in the area. Allegations over China's influence in the canal stem from two ports on either side which are run by publicly listed Hong Kong company CK Hutchinson. \"Secretary Rubio made clear that this status quo is unacceptable and that absent immediate changes, it would require the United States to take measures necessary to protect its rights under the treaty,\" the State Department said in a summary of the meeting. Speaking on behalf of Mr Trump, Mr Rubio said the US president had decided China's presence in the canal area violates a treaty that led to the US turning the waterway over to Panama in 1999. That treaty calls for the permanent neutrality of the American-built canal. \"I don't feel like there's a real threat against the treaty and its validity,\" Mr Mulino said after the meeting with Mr Rubio. 👉 Listen to Sky News Daily on your podcast app 👈 The canal, an important waterway for global trade, has emerged as a flashpoint for the new administration. Mr Mulino said it had been a \"good-faith meeting\" that helped \"to clear up doubts\". He acknowledged that China's role in the ports at either end of the canal had raised concerns with Washington. But Mr Mulino said the consortium controlling them was being audited and the canal authority would give the US official a more detailed explanation. He added that Panama would not renew its agreement with China's Belt and Road Initiative when it expires. Around 200 people marched in Panama City in protest during Mr Rubio's visit, chanting \"Marco Rubio out of Panama\" and \"long live national sovereignty\". Some burned a banner with images of Mr Trump and Mr Rubio. After the meeting, Mr Mulino suggested his country could accept direct deportations from the US, of non-Panamanian migrants who cross the Darien Gap jungle on Panama's southern border with Colombia. But he insisted the US would have to cover the cost. \"We spoke extensively about the problem of migration, with the understanding that Panama is a transit point,\" Mr Mulino said after the meeting."
    },
    {
        "title": "Greek island Santorini on earthquake alert after more than 200 tremors",
        "description": "More than 200 tremors near the island of Santorini have prompted Greek authorities to close schools and tell residents to avoid some ports and drain swimming pools.",
        "url": "https://news.sky.com/story/greek-island-santorini-on-earthquake-alert-after-more-than-200-tremors-13302077",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-greece-swimming-pool_6802766.jpg?20250118101847",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-02 19:35:00",
        "Headline": "Authorities have closed schools and told residents to avoid large events and drain swimming pools.",
        "Content": "More than 200 tremors near the island of Santorini have prompted Greek authorities to close schools and tell residents to avoid some ports and drain swimming pools. Earthquake experts say the increase in seismic activity around the Aegean tourist island - known for its whitewashed buildings and black-sand beaches - is not related to volcanic activity. Greek Prime Minister Kyriakos Mitsotakis chaired an emergency meeting in Athens, as Santorini authorities prepared for a potential evacuation. Tents have been set up in an outdoor stadium, police and the fire brigade have been put on alert and special disaster response units with sniffer dogs are on standby. Island residents have been advised to avoid large open-air events and to stay away from four small ports including the harbour of Fira, which mainly serves cruise ships. Home and hotel owners have also been told to drain their swimming pools over concerns that large volumes of water could destabilise buildings in the event of a strong quake. Schools will be closed on Monday in Santorini as well as on the nearby islands of Amorgos, Ios and Anafi. More than 200 tremors have hit since early on Friday but there have been no reports of damage or casualties. The strongest earthquake recorded was magnitude 4.6 on Sunday afternoon, while a few tremors of over magnitude 4 and dozens of magnitude 3 have followed. Read more from Sky News:Slimming World founder dies in MajorcaFarmer who shot burglar dead in 1999 dies Experts said it was impossible to predict whether the seismic activity could lead to a stronger tremor, but added that the area could potentially produce a 6-magnitude quake. Greece sits on multiple fault lines and is often rattled by earthquakes. Santorini is visited by about three million people annually, including many British tourists. One of the largest volcanic eruptions in history, around 1600 BC, formed the island in its current shape, while the last eruption in the area occurred in 1950."
    },
    {
        "title": "Huge explosions rock Jenin as Israel continues operations in West Bank",
        "description": "A series of huge explosions have rocked the city of Jenin in the occupied West Bank, as Israel continues military operations it says are targeting \"terrorist infrastructure\".",
        "url": "https://news.sky.com/story/huge-explosions-rock-jenin-as-israel-continues-operations-in-west-bank-13301758",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-west-bank-jenin-gaza_6817549.jpg?20250202152643",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-02 15:22:00",
        "Headline": "Israel has stepped up its operations in the West Bank in recent weeks, since the ceasefire in Gaza came into effect.",
        "Content": " A series of huge explosions have rocked the city of Jenin in the occupied West Bank, as Israel continues military operations it says are targeting \"terrorist infrastructure\". Videos and pictures from the area showed a number of explosions sending plumes of dark smoke into the air. The simultaneous explosions levelled around 20 buildings in the Jenin refugee camp, the Palestinian state news agency said, with Jenin hospital director Wisam Baker telling the same agency part of the hospital was damaged in the explosions but there had been no casualties there. Israel said on Sunday it had \"dismantled 23 structures\". It comes after Israel has stepped up its efforts in the West Bank in recent weeks, since the ceasefire in Gaza came into effect. Meanwhile, Prime Minister Benjamin Netanyahu is heading to America to meet with President Donald Trump. Jordan's King Abdullah will also meet with Mr Trump on 11 February, after the US leader said he wanted Egypt and Jordan to take in Palestinians from Gaza. In Gaza, the hostage and prisoner exchanges continued on Saturday as the ceasefire holds. Israel in the West Bank On 21 January, two days after the ceasefire in Gaza came into effect, Israel began raiding Jenin in the northern West Bank. Around three million Palestinians live in the occupied West Bank, where Israel maintains overall military control. Hundreds of Israeli soldiers, backed by the air force, have since engaged in battles with Palestinian militants in Jenin as they search for weapons and equipment, Israel says. It claims to have killed more than 35 people it said were \"terrorists\", but Palestinian officials say at least 25 Palestinians have been killed - including nine members of armed groups, an elderly man and a two-year-old girl. On Sunday, a 73-year-old man was shot dead by Israeli troops in Jenin. There was no immediate comment from the military. The day before, a 16-year-old boy was among five killed by Israeli strikes on Jenin, the Palestinian health ministry said. Israel said its air force had struck \"armed terrorists\". Dozens of homes have been demolished in Jenin and roads in the refugee camps have been dug up by Israel, driving thousands from their homes. Water has been cut and Palestinian officials say at least 80% of the refugee camp's inhabitants have been forced to leave their homes. Israel has claimed that Iran smuggles weapons into the West Bank and its military is acting against the \"Iranian axis\". Read more:The Hamas-backed plan for Gaza's futureFreed prisoners greeted as heroes in Ramallah Alongside near-daily military arrest raids in the West Bank, there has also been a rise in settler violence. Defence minister Israel Katz said on Wednesday Israel would remain in Jenin until its military operation was complete, without saying when that would be."
    },
    {
        "title": "Canada and Mexico hit back with retaliatory tariffs on US as Donald Trump risks trade war",
        "description": "Canada and Mexico have hit back with retaliatory tariffs on President Donald Trump's steep tax on goods imported from its neighbours.",
        "url": "https://news.sky.com/story/donald-trump-imposes-tariffs-on-canada-mexico-and-china-risking-global-economic-disruption-13301470",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-canada-america-tariffs_6817210.jpg?20250202011922",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-02 01:12:00",
        "Headline": "The leaders of Mexico and Canada - two of the US's largest trading partners - have responded to the US president's steep taxes on imports.",
        "Content": " Canada and Mexico have hit back with retaliatory tariffs on President Donald Trump's steep tax on goods imported from its neighbours. Canadian Prime Minister Justin Trudeau and Mexican President Claudia Sheinbaum both announced the counter-tariffs on Saturday night. Mr Trudeau said Canada would impose 25% tariffs on $155bn Canadian dollars (£85.9bn) of US goods in response to Mr Trump's 25% tariffs on goods. Energy imported from Canada, including oil, natural gas and electricity, would be taxed at a rate of 10%. Read latest:Trump threatens Canada again with '51st state' post Duties on $30bn Canadian dollars (£16.6bn) in trade in American alcohol and fruit will take effect on Tuesday when the US tariffs are set to start. The remaining $125bn Canadian dollars (£69.3bn) will take effect in 21 days. Mr Trudeau opened his speech with a passionate message aimed at American consumers. \"It will have real consequences for you, the American people,\" he said, saying it would result in higher prices on groceries and other goods. \n                  Breaking economies could be just the first step for expansionist Trump\n                 \n                  Donald Trump hits Canada, Mexico and China with tariffs - amid fears US consumers could suffer\n                 \n                  Trump's threat to turn Canada into part of the US represents most serious threat since War of 1812\n                 The outgoing prime minister channelled the views of many Canadians who feel betrayed by their neighbour and longtime ally. US action 'split us apart' Mr Trudeau reminded Americans that Canadian troops fought alongside them in Afghanistan and helped them respond to domestic crises including the wildfires in California and Hurricane Katrina. \"The actions taken by the White House split us apart instead of bringing us together,\" Mr Trudeau said. He also encouraged Canadians to \"choose Canadian products and services rather than American ones\". What is Mexico's stance? Ms Sheinbaum said in a post on X that she had ordered her economic minister to implement tariff and non-tariff measures to defend Mexico's interests. \"We categorically reject the White House's slander that the Mexican government has alliances with criminal organisations, as well as any intention of meddling in our territory,\" Ms Sheinbaum wrote. \"If the United States government and its agencies wanted to address the serious fentanyl consumption in their country, they could fight the sale of drugs on the streets of their major cities, which they don't do and the laundering of money that this illegal activity generates that has done so much harm to its population.\" Fentanyl crackdown The Trump administration had said that the tariffs aimed to stop the spread and manufacturing of the opioid fentanyl, as well as pressuring America's neighbours to limit illegal immigration to the US.  China's commerce ministry said it would challenge its 10% US tariff through the World Trade Organisation (WTO). The ministry said the measure \"seriously violates\" WTO rules and urged the US to \"engage in frank dialogue and strengthen cooperation\". Earlier on Saturday, President Trump signed the order imposing steep tariffs on imports from the three countries, risking a trade war and higher prices for American consumers. Mr Trump declared an economic emergency in order to place duties of 25% on goods from Mexico and Canada, and 10% on all imports from China. The tariffs also include a mechanism to escalate the rates if the countries retaliate. 👉 Listen to Sky News Daily on your podcast app 👈 Mexico and Canada are two of America's largest trading partners, with the tariffs upending decades-old trade relationships. Could US measures push up inflation? Mr Trump said on social media that the tariffs - a longstanding campaign promise - were necessary \"to protect Americans\". But the taxes may throw the global economy into turmoil and significantly worsen inflation in the US - which has already increased the prices of groceries, fuel, housing, cars and other goods. Read more:How Trump's tariffs could impact consumersWhy is Trump imposing the tariffs? A new analysis by the Budget Lab at Yale University found that the average US household would lose the equivalent of $1,170 US dollars (£944) in income from the tariffs. The research also found that economic growth would slow and inflation would worsen - especially if Canada, Mexico and China retaliate. \"It doesn't make much economic sense,\" said William Reinsch, senior adviser at the Centre for Strategic and International Studies and a former US trade official. \"Historically, most of our tariffs on raw materials have been low because we want to get cheaper materials so our manufacturers will be competitive... Now, what's he talking about? He's talking about tariffs on raw materials. I don't get the economics of it.\" Mr Trump appears to be preparing more import taxes. On Friday, he suggested imported computer chips, steel, oil and natural gas, as well as copper, pharmaceutical drugs and imports from the European Union may be subject to tariffs, which could pit the US against much of the global economy."
    },
    {
        "title": "Ukraine and Russia blame each other for missile strike on school that left four dead",
        "description": "Four people have been killed in a missile strike on a boarding school filled with civilians in the Ukrainian-controlled Kursk region of Russia, Ukraine's military has said.",
        "url": "https://news.sky.com/story/ukraine-and-russia-blame-each-other-for-missile-strike-on-school-that-left-four-dead-13301490",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kursk-russia-boarding-school_6817253.png?20250202083616",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-02 06:40:00",
        "Headline": "The school in Sudzha, Kursk, 7.5 miles from the Ukrainian border, was being used as a shelter for residents - and was largely full of elderly people, according to Ukrainian officials.",
        "Content": "Four people have been killed in a missile strike on a boarding school filled with civilians in the Ukrainian-controlled Kursk region of Russia, Ukraine's military has said. Kyiv blamed Moscow for the attack, while Russia's defence ministry said Ukrainian forces were responsible, adding that missiles were launched from Ukraine's Sumy region. The school in Sudzha, 7.5 miles from Ukraine's border, was being used as a shelter for residents - and was largely full of elderly people, according to Ukrainian officials. \"The strike was deliberate. At the time of the strike, dozens of local residents were inside the building, preparing for evacuation,\" the military's general staff said in a statement. \"The Russian side was fully aware that only civilians - local residents, including women and children were in the dormitory.\" Some 84 people were rescued in the alleged Russian glide bomb attack on Saturday afternoon, they added. Some received medical treatment and four were seriously injured. Military spokesperson Oleksiy Dmytrashkivskyi said in a video posted on social media that nearly 100 people were still believed to be trapped underneath rubble. Ukrainian President Volodymyr Zelenskyy said Moscow had bombed the boarding school where civilians were sheltering and preparing to evacuate. On X, he said of the attack: \"They destroyed the building even though dozens of civilians were there. \"This is how Russia waged war against Chechnya decades ago. They killed Syrians the same way. Russian bombs destroy Ukrainian homes the same way.\" Read more:Ukrainian criminals called to fightUK will play 'full part' in Ukraine peacemakingNorth Koreans fighting in Russia retreat over losses The Ukrainian military has held large parts of the Kursk region since it launched a major cross-border offensive into Russia in August. Elsewhere in Ukraine, at least 12 people are believed to have been killed in Russian attacks on Poltava, in the centre of the country, and Ukrainian forces destroyed 40 out of 55 Russian drones launched overnight. Ukraine should 'hold elections' In the US, President Donald Trump's special envoy Keith Kellogg said Ukraine should hold elections. \"Most democratic nations have elections in their time of war. I think it is important they do so,\" Mr Kellogg told Reuters on Saturday. During the election campaign, Mr Trump said he would \"end the war\" in Ukraine in just 24 hours - should he get elected. Both Mr Trump and Mr Kellogg have said they are working on a plan to broker a deal to bring to an end the fighting Russia started in February 2022. They have offered little detail about the plan, nor any timescale for its implementation. Mr Kellogg and other White House officials have discussed pushing Ukraine to agree to elections as part of an initial truce with Russia, according to two people with knowledge of those conversations, Reuters also reported. Other Eastern European nations that have held elections in recent months and years have seen allegations of interference from Russia. Mr Zelenskyy, meanwhile, has warned that excluding Ukraine from potential ceasefire negotiations with Russia would be \"very dangerous\". \"They [Russia and US] may have their own relations, but talking about Ukraine without us - it is dangerous for everyone,\" Mr Zelenskyy said."
    },
    {
        "title": "Breaking economies could be just the first step for expansionist Trump",
        "description": "Donald Trump claims this tariff gut-punch at his three largest trading partners is just a matter of common sense.",
        "url": "https://news.sky.com/story/breaking-economies-could-be-just-the-first-step-for-expansionist-trump-13301769",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-justin_6817673.jpg?20250202160855",
        "type": "US",
        "Author": "Diana Magnay",
        "Date Published": "2025-02-02 15:32:00",
        "Headline": "Canada has more than just a trade war on its hands as the US president says the country should \"become our cherished 51st state\".",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n Donald Trump claims this tariff gut-punch at his three largest trading partners is just a matter of common sense. They in turn are imploring him to see reason, with Mexico and China calling for dialogue and cooperation. Follow live updates: Trump ignites trade war Canada's prime minister Justin Trudeau said on Saturday night - as he announced a reciprocal 25% tariff on $106bn worth of American goods - that the last time he had spoken directly with the US president was at Mar-a-Lago before the inauguration. Much good that visit did him.  President Trump is defying the wisdom of decades that free trade encourages growth and prosperity in an interconnected global economy. He is intent on rebalancing trade deficits, bringing manufacturing home and encouraging foreign investors to set up shop in the US. His justification for tariffs is that they will force Mexico, China and Canada to halt the influx of fentanyl, its precursor chemicals and illegal migrants into the US. Mexico is already working hard on both measures. One of the few areas of diplomatic engagement with China over recent years has been the resumption of cooperation on counter-narcotics. And as the Canadian prime minister said yesterday, only 1% of illegal fentanyl or illegal immigration crosses into the US via that northern border, and Canada is taking additional measures to reduce that further. It is surely just a pretext.  Perhaps most alarming to any believer in the sovereignty of nations is the thought that President Trump really means it when he says \"Canada should become our cherished 51st state\". He does not seem to be relenting on his threats against Greenland, after a testy conversation with Denmark's prime minister where he refused to back down on his demands on the territory. Read more:Why has Trump targeted Mexico and Canada?How Donald Trump's tariffs could impact consumers  His secretary of state, Marco Rubio, is currently in Panama - where Trump has threatened to take the Panama Canal by force. Break Canada's economy and this expansionist US president may believe he can bend their will. Canada has more than just a trade war on its hands."
    },
    {
        "title": "US secretary of state says Panama must reduce Chinese influence on canal or face consequences",
        "description": "US secretary of state Marco Rubio has told Panama's president the country must reduce alleged Chinese influence over the Panama Canal or face potential retaliation from America.",
        "url": "https://news.sky.com/story/us-secretary-of-state-says-panama-must-reduce-chinese-influence-on-canal-or-face-consequences-13302091",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-marco-rubio-panama_6818021.jpg?20250202201002",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-02 20:01:00",
        "Headline": "Donald Trump has previously called for the Panama Canal to be returned to the US, and made allegations of Chinese influence in the area.",
        "Content": "US secretary of state Marco Rubio has told Panama's president the country must reduce alleged Chinese influence over the Panama Canal or face potential retaliation from America. The comments were made in a face-to-face meeting with Panamanian President Jose Raul Mulino on Sunday. Follow latest: Trump ignites trade war It was Mr Rubio's first foreign trip as America's top diplomat and comes as Mr Mulino has so far resisted pressure from the US. Mr Trump previously demanded the canal be returned to US control and has repeatedly made allegations about China's influence in the area. Allegations over China's influence in the canal stem from two ports on either side which are run by publicly listed Hong Kong company CK Hutchinson. \"Secretary Rubio made clear that this status quo is unacceptable and that absent immediate changes, it would require the United States to take measures necessary to protect its rights under the treaty,\" the State Department said in a summary of the meeting. Speaking on behalf of Mr Trump, Mr Rubio said the US president had decided China's presence in the canal area violates a treaty that led to the US turning the waterway over to Panama in 1999. That treaty calls for the permanent neutrality of the American-built canal. \"I don't feel like there's a real threat against the treaty and its validity,\" Mr Mulino said after the meeting with Mr Rubio. 👉 Listen to Sky News Daily on your podcast app 👈 The canal, an important waterway for global trade, has emerged as a flashpoint for the new administration. Mr Mulino said it had been a \"good-faith meeting\" that helped \"to clear up doubts\". He acknowledged that China's role in the ports at either end of the canal had raised concerns with Washington. But Mr Mulino said the consortium controlling them was being audited and the canal authority would give the US official a more detailed explanation. He added that Panama would not renew its agreement with China's Belt and Road Initiative when it expires. Around 200 people marched in Panama City in protest during Mr Rubio's visit, chanting \"Marco Rubio out of Panama\" and \"long live national sovereignty\". Some burned a banner with images of Mr Trump and Mr Rubio. After the meeting, Mr Mulino suggested his country could accept direct deportations from the US, of non-Panamanian migrants who cross the Darien Gap jungle on Panama's southern border with Colombia. But he insisted the US would have to cover the cost. \"We spoke extensively about the problem of migration, with the understanding that Panama is a transit point,\" Mr Mulino said after the meeting."
    },
    {
        "title": "President Trump threatens Canada over trade war - saying it should become 'cherished 51st state'",
        "description": "President Donald Trump has again threatened Canada in their emerging trade war, repeating that the neighbouring country should become \"our cherished 51st state\".",
        "url": "https://news.sky.com/story/president-trump-threatens-canada-over-trade-war-saying-it-should-become-cherished-51st-state-13301663",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-canada-tariffs-logging_6817563.jpg?20250202153222",
        "type": "US",
        "Author": "Michael Drummond",
        "Date Published": "2025-02-02 13:47:00",
        "Headline": "It comes after the US leader said he is imposing 25% tariffs on imports from Canada and Mexico - and the two countries retaliated with their own measures.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n President Donald Trump has again threatened Canada in their emerging trade war, repeating that the neighbouring country should become \"our cherished 51st state\". The US leader said this weekend that he is imposing 25% tariffs on imports from Canada and Mexico. The two countries then hit back with retaliatory tariffs and today spoke of working together. Follow latest:Trump ignites trade war as Canada and Mexico hit back Speaking on his Truth Social platform on Sunday afternoon, Mr Trump said: \"We pay hundreds of Billions of Dollars to SUBSIDIZE Canada. Why? There is no reason. \"We don't need anything they have. We have unlimited Energy, should make our own Cars, and have more Lumber than we can ever use.\" He claimed that without the \"massive subsidy\" Canada \"ceases to exist as a viable country\". He added: \"Therefore, Canada should become our Cherished 51st State. Much lower taxes, and far better military protection for the people of Canada - AND NO TARIFFS!\" Mr Trump later said any potential pain caused by the trade war would be worth it. \"Will there be some pain? Yes, maybe (and maybe not!). It will all be worth the price that must be paid,\" the US leader said. 👉 Listen to Sky News Daily on your podcast app 👈 The Trump administration had said that the tariffs aimed to stop the spread and manufacturing of the opioid fentanyl, as well as pressuring America's neighbours to limit illegal immigration to the US. But it risks a trade war and higher prices for American consumers. Economists argue supply chains will be disrupted and businesses will suffer increased costs - leading to an overall rise in prices. Both Mexico and Canada rely heavily on their imports and exports, which make up around 70% of their Gross Domestic Products (GDPs), putting them at even greater risk from the new tariffs. In his Sunday posts on Truth Social, Mr Trump also took aim at the Wall Street Journal which he said was leading a \"Tariff lobby\", after the newspaper ran an opinion piece titled \"The Dumbest Trade War in History\". Read more:Why has Trump targeted Mexico and Canada?How Donald Trump's tariffs could impact consumers Canada's high commissioner to the UK Ralph Goodale, speaking to Sky News' Kamali Melbourne, had a warning for allies. He said: \"I would just say to our allies around the world watch this closely, you could be next, and in the meantime, stand by your friends.\" He added Mr Trump's words were a \"salesman's pitch\" and despite the historically close relationship between the countries \"we don't want to be each other\".  Announcing the retaliatory tariffs on Saturday night, Canadian Prime Minister Justin Trudeau delivered a passionate message to American consumers. \"It will have real consequences for you, the American people,\" he said, saying it would result in higher prices on groceries and other goods. Mr Trudeau reminded Americans that Canadian troops fought alongside them in Afghanistan and helped them respond to domestic crises including the wildfires in California and Hurricane Katrina. In a later post on X, Mr Trudeau called on people to buy Canadian-made goods, saying \"choose Canada\". Canada's ambassador to the US said she hoped the tariffs would not come into effect on Tuesday, but she added she expects the Canadian government to stand firm. \"We're not at all interested in escalating, but I think that there will be a very strong demand on our government to make sure that we stand up for the deal that we have struck with the United States,\" Ambassador Kirsten Hillman told ABC News on Sunday. Meanwhile, in Mexico, President Claudia Sheinbaum said: \"We categorically reject the White House's slander that the Mexican government has alliances with criminal organisations, as well as any intention of meddling in our territory.\" She added: \"If the United States government and its agencies wanted to address the serious fentanyl consumption in their country, they could fight the sale of drugs on the streets of their major cities, which they don't do, and the laundering of money that this illegal activity generates that has done so much harm to its population.\""
    },
    {
        "title": "Canada and Mexico hit back with retaliatory tariffs on US as Donald Trump risks trade war",
        "description": "Canada and Mexico have hit back with retaliatory tariffs on President Donald Trump's steep tax on goods imported from its neighbours.",
        "url": "https://news.sky.com/story/donald-trump-imposes-tariffs-on-canada-mexico-and-china-risking-global-economic-disruption-13301470",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-canada-america-tariffs_6817210.jpg?20250202011922",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-02 01:12:00",
        "Headline": "The leaders of Mexico and Canada - two of the US's largest trading partners - have responded to the US president's steep taxes on imports.",
        "Content": " Canada and Mexico have hit back with retaliatory tariffs on President Donald Trump's steep tax on goods imported from its neighbours. Canadian Prime Minister Justin Trudeau and Mexican President Claudia Sheinbaum both announced the counter-tariffs on Saturday night. Mr Trudeau said Canada would impose 25% tariffs on $155bn Canadian dollars (£85.9bn) of US goods in response to Mr Trump's 25% tariffs on goods. Energy imported from Canada, including oil, natural gas and electricity, would be taxed at a rate of 10%. Read latest:Trump threatens Canada again with '51st state' post Duties on $30bn Canadian dollars (£16.6bn) in trade in American alcohol and fruit will take effect on Tuesday when the US tariffs are set to start. The remaining $125bn Canadian dollars (£69.3bn) will take effect in 21 days. Mr Trudeau opened his speech with a passionate message aimed at American consumers. \"It will have real consequences for you, the American people,\" he said, saying it would result in higher prices on groceries and other goods. \n                  Breaking economies could be just the first step for expansionist Trump\n                 \n                  Donald Trump hits Canada, Mexico and China with tariffs - amid fears US consumers could suffer\n                 \n                  Trump's threat to turn Canada into part of the US represents most serious threat since War of 1812\n                 The outgoing prime minister channelled the views of many Canadians who feel betrayed by their neighbour and longtime ally. US action 'split us apart' Mr Trudeau reminded Americans that Canadian troops fought alongside them in Afghanistan and helped them respond to domestic crises including the wildfires in California and Hurricane Katrina. \"The actions taken by the White House split us apart instead of bringing us together,\" Mr Trudeau said. He also encouraged Canadians to \"choose Canadian products and services rather than American ones\". What is Mexico's stance? Ms Sheinbaum said in a post on X that she had ordered her economic minister to implement tariff and non-tariff measures to defend Mexico's interests. \"We categorically reject the White House's slander that the Mexican government has alliances with criminal organisations, as well as any intention of meddling in our territory,\" Ms Sheinbaum wrote. \"If the United States government and its agencies wanted to address the serious fentanyl consumption in their country, they could fight the sale of drugs on the streets of their major cities, which they don't do and the laundering of money that this illegal activity generates that has done so much harm to its population.\" Fentanyl crackdown The Trump administration had said that the tariffs aimed to stop the spread and manufacturing of the opioid fentanyl, as well as pressuring America's neighbours to limit illegal immigration to the US.  China's commerce ministry said it would challenge its 10% US tariff through the World Trade Organisation (WTO). The ministry said the measure \"seriously violates\" WTO rules and urged the US to \"engage in frank dialogue and strengthen cooperation\". Earlier on Saturday, President Trump signed the order imposing steep tariffs on imports from the three countries, risking a trade war and higher prices for American consumers. Mr Trump declared an economic emergency in order to place duties of 25% on goods from Mexico and Canada, and 10% on all imports from China. The tariffs also include a mechanism to escalate the rates if the countries retaliate. 👉 Listen to Sky News Daily on your podcast app 👈 Mexico and Canada are two of America's largest trading partners, with the tariffs upending decades-old trade relationships. Could US measures push up inflation? Mr Trump said on social media that the tariffs - a longstanding campaign promise - were necessary \"to protect Americans\". But the taxes may throw the global economy into turmoil and significantly worsen inflation in the US - which has already increased the prices of groceries, fuel, housing, cars and other goods. Read more:How Trump's tariffs could impact consumersWhy is Trump imposing the tariffs? A new analysis by the Budget Lab at Yale University found that the average US household would lose the equivalent of $1,170 US dollars (£944) in income from the tariffs. The research also found that economic growth would slow and inflation would worsen - especially if Canada, Mexico and China retaliate. \"It doesn't make much economic sense,\" said William Reinsch, senior adviser at the Centre for Strategic and International Studies and a former US trade official. \"Historically, most of our tariffs on raw materials have been low because we want to get cheaper materials so our manufacturers will be competitive... Now, what's he talking about? He's talking about tariffs on raw materials. I don't get the economics of it.\" Mr Trump appears to be preparing more import taxes. On Friday, he suggested imported computer chips, steel, oil and natural gas, as well as copper, pharmaceutical drugs and imports from the European Union may be subject to tariffs, which could pit the US against much of the global economy."
    },
    {
        "title": "Grammys red carpet fashion 2025: All the best looks from the stars and nominees",
        "description": "Nominees and celebrity guests hit the red carpet in style at this year's Grammy Awards.",
        "url": "https://news.sky.com/story/grammys-red-carpet-fashion-2025-all-the-best-looks-from-the-stars-and-nominees-13302151",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sabrina-carpenter-grammys_6818128.jpg?20250202233139",
        "type": "US",
        "Author": "Bethany Minelle",
        "Date Published": "2025-02-02 22:46:00",
        "Headline": "Chappell Roan, Kacey Musgraves, Billie Eilish, Kanye West, Bianca Censori and Willow and Jaden Smith were among the stars walking the red carpet at this year's Grammy Awards.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Nominees and celebrity guests hit the red carpet in style at this year's Grammy Awards. With a focus on supporting relief efforts following the devastating Los Angeles-area wildfires the tone was a little more muted, but the fashion as exciting as ever. Here are some of the looks from the Grammys red carpet. Read more: Everything to know ahead of the show"
    },
    {
        "title": "Captain Rebecca Lobach: Third helicopter pilot who died in Washington crash was former White House aide",
        "description": "The third pilot in the Black Hawk helicopter involved in the Washington DC air crash has been praised as a \"bright star in all our lives\" by her family.",
        "url": "https://news.sky.com/story/captain-rebecca-lobach-third-helicopter-pilot-who-died-in-washington-crash-was-former-white-house-aide-13301558",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-washington-dc-lobach_6817347.jpg?20250202112956",
        "type": "US",
        "Author": "Michael Drummond",
        "Date Published": "2025-02-02 10:20:00",
        "Headline": "Her identity was initially withheld in the aftermath of the disaster, as right-wing rumours swirled and President Donald Trump blamed diversity initiatives for undermining air safety.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n The third pilot in the Black Hawk helicopter involved in the Washington DC air crash has been praised as a \"bright star in all our lives\" by her family. Her identity was initially withheld in the aftermath of last Wednesday's disaster, but she was named on Saturday as Captain Rebecca M Lobach from Durham, North Carolina. Capt Lobach, 28, was one of three soldiers on board the military helicopter when it collided with an American Airlines jet. She also served as a White House military social aide during the Biden administration. Sixty-seven people were killed in the catastrophe, which was the deadliest US aviation incident in almost 25 years. Investigations continue into the cause, with preliminary data giving conflicting information about the altitudes of the two aircraft at the time of the crash. President Donald Trump said the helicopter was flying \"too high\", while also blaming diversity initiatives for undermining air safety. Tributes after third pilot named Capt Lobach's family said they were devastated at the loss and paid tribute to her in a statement released by the military. They said: \"She was a bright star in all our lives. She was kind, generous, brilliant, funny, ambitious and strong. No one dreamed bigger or worked harder to achieve her goals.\" \"Rebecca was a warrior and would not hesitate to defend her country in battle. \"But she was as graceful as she was fierce,\" they added, referring to her time supporting the president and first lady in hosting White House events in her role as a military social aide. \"Her life was short, but she made a difference in the lives of all who knew her. Our hearts break for the other families who have lost loved ones in this national tragedy and we mourn with them.\" She was pictured alongside President Joe Biden and Ralph Lauren during the awarding of the fashion designer's Presidential Medal of Freedom earlier this year. Her friend Davis Winkie, who was with her in the army before becoming a journalist, praised her as \"brilliant and fearless\". False rumours about transgender Black Hawk pilot Before Capt Lobach's identity was confirmed, several right-wing social media accounts falsely claimed a transgender pilot in the Virginia National Guard was flying the helicopter. Posting a \"proof of life\" video on social media, Jo Ellis said: \"It is insulting to the families to try to tie this to some sort of political agenda. They don't deserve that. I don't deserve this. \"And I hope that you all know that I am alive and well, and this should be sufficient for you all to end all the rumours.\" Read more:Black Hawk was on emergency evacuation trial runPhiladelphia struggles to process US's second plane crash in two days Crash investigation continues There has been conflicting information about the altitudes of the plane and military helicopter at the time of the crash. In a news conference, officials from the National Transportation Safety Board (NTSB) said that data from the jet's flight recorder showed its altitude as 325ft, plus or minus 25ft, when the crash happened. But preliminary data in the air traffic control tower showed the Black Hawk helicopter at 200ft at the time. The discrepancy has yet to be explained.  NTSB member Todd Inman also revealed that the jet's flight recorder showed a change in its pitch but did not say whether this meant the pilots were trying to avoid the crash. The NTSB also said five people were working in the air traffic control tower at the time of the crash, after reports that staffing levels were \"not normal\". The NTSB did not comment on whether there was an appropriate number of staff on duty."
    },
    {
        "title": "Washington DC crash: Data from plane's black boxes gives conflicting information on altitudes - as pictures of third soldier with Joe Biden and Ralph Lauren emerge",
        "description": "Preliminary data from the Washington DC air collision that killed 67 people gives conflicting information about the altitudes of the plane and military helicopter at the time of the crash.",
        "url": "https://news.sky.com/story/washington-dc-crash-data-from-planes-black-box-gives-conflicting-information-on-altitudes-as-pictures-of-third-soldier-with-joe-biden-and-ralph-lauren-emerge-13301479",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-washington-dc-plane-crash_6817218.jpg?20250202045503",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-02 04:32:00",
        "Headline": "In an emotional news conference, officials from the National Transportation Safety Board said the families of the victims are desperate for answers.",
        "Content": "Preliminary data from the Washington DC air collision that killed 67 people gives conflicting information about the altitudes of the plane and military helicopter at the time of the crash. In a news conference, officials from the National Transportation Safety Board (NTSB) said that data from the jet's flight recorder showed its altitude as 325ft, plus or minus 25ft, when the crash happened on Wednesday night. But preliminary data in the air traffic control tower showed the Black Hawk helicopter at 200ft at the time. The discrepancy has yet to be explained. NTSB member Todd Inman also revealed that the jet's flight recorder showed a change in its pitch but did not say whether this meant the pilots were trying to avoid the crash. It comes as the third soldier who died onboard the Black Hawk has been named as Captain Rebecca M Lobach. Final moments before the crash Information from the jet's black boxes has been recovered but the helicopter's is taking more time to retrieve because it became waterlogged after the aircraft plunged into the Potomac River. \n                  Captain Rebecca Lobach: Third helicopter pilot who died in Washington crash was former White House aide\n                 \n                  Black Hawk helicopter was on emergency evacuation trial run before Washington DC crash, officials say\n                 \n                  Washington DC plane crash: Army withholding name of female soldier killed as helicopter black box recovered\n                 Brice Banning, the investigator in charge of the case, said the plane's crew \"had a verbal reaction\" in the last moments before the crash. He said the data recorder showed \"the airplane beginning to increase its pitch… sounds of impact were audible about one second later, followed by the end of the recording\". The NTSB also said five people were working in the air traffic control tower at the time of the crash, after reports that staffing levels were \"not normal\". The NTSB did not comment on whether there was an appropriate number of staff on duty.  The collision near Reagan National Airport in Washington was the deadliest US aviation incident in almost 25 years. The 60 passengers and four crew on the American Airlines flight from Wichita, Kansas, as well as the three soldiers on the army helicopter were killed. Last soldier named Some 38 of the bodies have been identified, with authorities saying they expect to recover all the victims - but the plane's fuselage will probably have to be pulled from the water to retrieve the rest. More information about those who died has also emerged. The US Army identified Captain Rebecca M Lobach, from Durham, North Carolina, as the third soldier who died in the crash. The names of the other two soldiers were released on Friday, but Ms Lobach's name was withheld at the request of her family. They said she was \"a bright star in all our lives\". Ms Lobach served as a White House military social aide and was pictured alongside President Joe Biden and Ralph Lauren during the awarding of the fashion designer's Presidential Medal of Freedom earlier this year. Army officials have said the helicopter crew was highly experienced and familiar with the congested skies around Washington DC. 'They still want answers' In an emotional news conference, Mr Inman said he has spent hours with the victims' families since the crash. \"I don't want to have to meet with those parents like that again.\" The families, he said, are struggling. \"Some wanted to give us hugs. Some are just mad and angry,\" Mr Inman said. \"They are just all hurt. And they still want answers, and we want to give them answers.\"  Read more: What do we know about the victims of the Washington air crash? Mr Inman became frustrated at points during the news conference, noting that the NTSB has made \"several hundred\" recommendations to improve aviation that have not been acted upon. \"From tragedy, we draw knowledge to improve the safety for us all. That's what we're doing right now, we're dealing with tragedy, but we need to improve safety,\" he said. \"You want to do something about it? Adopt the recommendations of the NTSB. You'll save lives.\" The recovery operation is continuing in Washington DC, with the remains of 42 people retrieved from the river so far. As many Americans remained shocked by the deadly crash, a second aviation accident took place on Friday night in Philadelphia, Pennsylvania. An air ambulance slammed into a busy junction, killing all six people on board, including a child who had just undergone treatment at a hospital, and at least one person on the ground."
    },
    {
        "title": "Philadelphia struggles to process America's second plane crash in two days",
        "description": "There is an eerie silence on Cottman Avenue as Philadelphians try to process the unimaginable.",
        "url": "https://news.sky.com/story/philadelphia-struggles-to-process-americas-second-plane-crash-in-two-days-13301473",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-philadelphia-plane-crash_6817212.jpg?20250202021208",
        "type": "US",
        "Author": "David Blevins, news correspondent, in Philadelphia",
        "Date Published": "2025-02-02 02:04:00",
        "Headline": "There is a palpable sense of shock and incredulity in Philadelphia, with the two fatal crashes having stunned the nation.",
        "Content": "By David Blevins, news correspondent, in Philadelphia   There is an eerie silence on Cottman Avenue as Philadelphians try to process the unimaginable. A deep crater in the road, debris and several burned-out vehicles mark the location where an air ambulance plummeted from the sky on Friday night. It is densely populated, row after row of houses, all rocked by the impact, some scorched by the ensuing fireball. John Dolan heard the plane coming down above his home and says people only survived \"by the grace of God\". \"The amount of people at this intersection had to be a lot. \"People are backed up, waiting for this light here because of the traffic. \"People are heading home, it's Friday night. \n                  Groundhog Day: Punxsutawney Phil predicts six more weeks of wintry weather\n                 \n                  Car driver on ground among dead after Philadelphia plane crash which killed mother and daughter\n                 \n                  Luigi Mangione: What we know about man charged with murdering healthcare boss Brian Thompson\n                 \"It is lined up with cars here. How they aren't more people dead, I have no idea,\" he said. Joseph Maiorano was stopped at the red light when the plane came down less than one minute after taking off. \"Next thing I know, look to my left, and there's this big boom… \"I felt the heat. There was like… a cloud of fire,\" he recalled.  A small team of community pastors were going door-to-door, offering support to people traumatised by the tragedy on their doorstep. There were no survivors among the six people on the small plane - two passengers and four crew, all Mexican nationals. In a tragic twist of fate, the child patient on board was returning home after completing life-saving treatment in hospital. One man died in a car, and at least 19 others were injured, including a child who has undergone emergency surgery. There is a palpable sense of shock and incredulity here, a disbelief shared across America. With more air passengers per year than any other country, two fatal crashes in two days have stunned this nation."
    },
    {
        "title": "Day 14: Q&A - Trump, NATO, Farage and the Diet Coke button",
        "description": "<a href='https://podfollow.com/trump100/view'>👉 Follow Trump 100 on your podcast app 👈  </a>",
        "url": "https://news.sky.com/story/day-14-qa-trump-nato-farage-and-the-diet-coke-button-13300703",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-podcasts-donald-trump_6801283.png?20250129031345",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-02 00:01:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump 100 on your podcast app 👈   On this episode, our US correspondents James Matthews and Martha Kelner read through your listener questions.  They answer how serious President Trump is about leaving NATO, has Elon Musk pushed out Nigel Farage from Trump's circle, and how US leaders have decorated the Oval Office. You can email James, Martha and Mark Stone on trump100@sky.uk Producers: Rosie Gillott, Soila ApparicioEditor: Philly Beaumont "
    },
    {
        "title": "Barclays says IT glitch that locked people out of their accounts has been resolved",
        "description": "Barclays says an IT glitch that left some customers locked out of their accounts has been resolved after the disruption entered a third day.",
        "url": "https://news.sky.com/story/barclays-says-major-it-issue-that-locked-people-out-of-their-accounts-has-been-resolved-13301545",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-barclays-app-file_6816172.jpg?20250201120435",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-02-02 09:42:00",
        "Headline": "The issue, which entered its third day before the bank said it had been resolved, is not believed to be related to a cyber attack.",
        "Content": "Barclays says an IT glitch that left some customers locked out of their accounts has been resolved after the disruption entered a third day. The bank said the \"technical issue\" has been fixed and delayed payments processed. In a statement on Sunday, Barclays said: \"We are working on bringing balances up to date for some of our customers and addressing any outstanding issues. \"We are very sorry for any disruption and will ensure that no impacted customer is left out of pocket.\" The IT glitch is not believed to be related to a cyber attack or malicious activity. The disruption started on Friday - on what was payday for many British workers and the deadline for self-assessment tax returns. Barclays apologised to people who had been affected and promised no one would be left out of pocket. It added that call centres would be open for longer this weekend and the bank will be proactively contacting customers who may be vulnerable. However, the company's handling of complaints provoked an angry reaction online. Customers have posted on X that they were unable to buy shopping for themselves and their young children or pay their bills. In response to one user who said her household \"has no access to money\", the Barclays UK Help account asked: \"Are there any friends or family who can offer support?\" When she said she didn't and criticised the reply as \"so triggering\", the bank's X account posted links to the Trussell Trust, a charity that runs food banks, and Citizens Advice, which offers help for a range of problems. Read more from Sky News:Murder arrest 20 years after woman found dead in streamMan arrested after 'Koran burned' in Manchester city centre The beginning of the year is also a key time for people who file self-assessment tax returns. In a statement, HMRC said it is \"working closely\" with Barclays to minimise any impact on those submitting their self-assessments. An HMRC spokesperson said: \"Our services are working as normal, so customers will still have been able to file their returns on time. \"Also, the issues will not result in late payment penalties as they don't apply until 1 March.\""
    },
    {
        "title": "Canada and Mexico hit back with retaliatory tariffs on US as Donald Trump risks trade war",
        "description": "Canada and Mexico have hit back with retaliatory tariffs on President Donald Trump's steep tax on goods imported from its neighbours.",
        "url": "https://news.sky.com/story/donald-trump-imposes-tariffs-on-canada-mexico-and-china-risking-global-economic-disruption-13301470",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-canada-america-tariffs_6817210.jpg?20250202011922",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-02-02 01:12:00",
        "Headline": "The leaders of Mexico and Canada - two of the US's largest trading partners - have responded to the US president's steep taxes on imports.",
        "Content": " Canada and Mexico have hit back with retaliatory tariffs on President Donald Trump's steep tax on goods imported from its neighbours. Canadian Prime Minister Justin Trudeau and Mexican President Claudia Sheinbaum both announced the counter-tariffs on Saturday night. Mr Trudeau said Canada would impose 25% tariffs on $155bn Canadian dollars (£85.9bn) of US goods in response to Mr Trump's 25% tariffs on goods. Energy imported from Canada, including oil, natural gas and electricity, would be taxed at a rate of 10%. Read latest:Trump threatens Canada again with '51st state' post Duties on $30bn Canadian dollars (£16.6bn) in trade in American alcohol and fruit will take effect on Tuesday when the US tariffs are set to start. The remaining $125bn Canadian dollars (£69.3bn) will take effect in 21 days. Mr Trudeau opened his speech with a passionate message aimed at American consumers. \"It will have real consequences for you, the American people,\" he said, saying it would result in higher prices on groceries and other goods. \n                  Breaking economies could be just the first step for expansionist Trump\n                 \n                  Donald Trump hits Canada, Mexico and China with tariffs - amid fears US consumers could suffer\n                 \n                  Trump's threat to turn Canada into part of the US represents most serious threat since War of 1812\n                 The outgoing prime minister channelled the views of many Canadians who feel betrayed by their neighbour and longtime ally. US action 'split us apart' Mr Trudeau reminded Americans that Canadian troops fought alongside them in Afghanistan and helped them respond to domestic crises including the wildfires in California and Hurricane Katrina. \"The actions taken by the White House split us apart instead of bringing us together,\" Mr Trudeau said. He also encouraged Canadians to \"choose Canadian products and services rather than American ones\". What is Mexico's stance? Ms Sheinbaum said in a post on X that she had ordered her economic minister to implement tariff and non-tariff measures to defend Mexico's interests. \"We categorically reject the White House's slander that the Mexican government has alliances with criminal organisations, as well as any intention of meddling in our territory,\" Ms Sheinbaum wrote. \"If the United States government and its agencies wanted to address the serious fentanyl consumption in their country, they could fight the sale of drugs on the streets of their major cities, which they don't do and the laundering of money that this illegal activity generates that has done so much harm to its population.\" Fentanyl crackdown The Trump administration had said that the tariffs aimed to stop the spread and manufacturing of the opioid fentanyl, as well as pressuring America's neighbours to limit illegal immigration to the US.  China's commerce ministry said it would challenge its 10% US tariff through the World Trade Organisation (WTO). The ministry said the measure \"seriously violates\" WTO rules and urged the US to \"engage in frank dialogue and strengthen cooperation\". Earlier on Saturday, President Trump signed the order imposing steep tariffs on imports from the three countries, risking a trade war and higher prices for American consumers. Mr Trump declared an economic emergency in order to place duties of 25% on goods from Mexico and Canada, and 10% on all imports from China. The tariffs also include a mechanism to escalate the rates if the countries retaliate. 👉 Listen to Sky News Daily on your podcast app 👈 Mexico and Canada are two of America's largest trading partners, with the tariffs upending decades-old trade relationships. Could US measures push up inflation? Mr Trump said on social media that the tariffs - a longstanding campaign promise - were necessary \"to protect Americans\". But the taxes may throw the global economy into turmoil and significantly worsen inflation in the US - which has already increased the prices of groceries, fuel, housing, cars and other goods. Read more:How Trump's tariffs could impact consumersWhy is Trump imposing the tariffs? A new analysis by the Budget Lab at Yale University found that the average US household would lose the equivalent of $1,170 US dollars (£944) in income from the tariffs. The research also found that economic growth would slow and inflation would worsen - especially if Canada, Mexico and China retaliate. \"It doesn't make much economic sense,\" said William Reinsch, senior adviser at the Centre for Strategic and International Studies and a former US trade official. \"Historically, most of our tariffs on raw materials have been low because we want to get cheaper materials so our manufacturers will be competitive... Now, what's he talking about? He's talking about tariffs on raw materials. I don't get the economics of it.\" Mr Trump appears to be preparing more import taxes. On Friday, he suggested imported computer chips, steel, oil and natural gas, as well as copper, pharmaceutical drugs and imports from the European Union may be subject to tariffs, which could pit the US against much of the global economy."
    },
    {
        "title": "Sir Keir Starmer to urge EU nations to 'shoulder more of the burden' on defence spending",
        "description": "Sir Keir Starmer will urge European countries to commit more in defence spending as he heads to Brussels for security talks.",
        "url": "https://news.sky.com/story/sir-keir-starmer-to-urge-eu-nations-to-shoulder-more-of-the-burden-on-defence-spending-13301648",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-starmer-olaf-scholz_6817697.jpg?20250202162514",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-02-02 22:29:00",
        "Headline": "The prime minister's call comes as Donald Trump repeats his demand for NATO allies to spend at least 5% of their national incomes on their militaries. The UK government currently spends around 2.3% of GDP on defence.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  Sir Keir Starmer will urge European countries to commit more in defence spending as he heads to Brussels for security talks. The prime minister will call on Europe to \"step up and shoulder more of the burden\" to fend off the threat posed by Vladimir Putin's Russia. Sir Keir, the first prime minister to meet all the leaders of the 27 EU nations in Brussels since Brexit, will argue the bloc needs to capitalise on the weak state of the Russian economy by continuing with its sanctions regime. The prime minister will meet NATO Secretary General Mark Rutte on Monday afternoon before travelling to meet with the leaders of the 27 EU member states at an informal meeting of the European Council. Sir Keir is expected to say: \"We need to see all allies stepping up - particularly in Europe. \"President Trump has threatened more sanctions on Russia and it's clear that's got Putin rattled. We know that he's worried about the state of the Russian economy. \"I'm here to work with our European partners on keeping up the pressure, targeting the energy revenues and the companies supplying his missile factories to crush Putin's war machine. \"Because ultimately, alongside our military support, that is what will bring peace closer.\"  Sir Keir's suggestion that EU countries should spend more on defence is likely to open him up to criticism from the Conservatives, who have urged the government to increase defence spending to 2.5% of national income. The prime minister said at the end of last year that he would \"set out a path\" to lift defence spending to 2.5% of national income in the spring. The UK says it currently spends around 2.3% of GDP [gross domestic product] on defence. Last year EU member states spent an average of 1.9% of EU GDP on defence, according to the European Defence Agency, a 30% increase compared with 2021. Earlier this week European Council President Antonio Costa said the 23 EU members who belong to NATO are likely to agree to raise the defence spending target above the current 2% of national output at the next NATO summit in June. Read more:Starmer must delicately balance his risky EU resetBuilder shortage challenging Labour's growth plans However, Donald Trump has repeatedly criticised NATO - the military alliance consisting of 30 European countries and the US and Canada - arguing that his country is contributing too much to the alliance's budget while Europeans contribute too little. During the US election campaign, President Trump said America would only help defend NATO members from a future attack by Russia if they met their spending obligations. He also said members of NATO should be contributing 5% of their GDPs to defence spending - rather than the previous target of 2%. The session of the Informal European Council comes as the government seeks to reset its relationship with the EU and boost areas of cooperation, including on defence and tackling illegal migration.  On Sunday the prime minister hosted German Chancellor Olaf Scholz at his country residence Chequers, where the two leaders agreed on the \"importance of scaling up and coordinating defence production across Europe\", Downing Street said. However, the government has repeatedly said that a closer relationship with the EU will only be sought within its red lines - meaning there will be no return to freedom of movement and rejoining the customs union or single market."
    },
    {
        "title": "Starmer must delicately balance his risky EU reset as UK braces for Trump's next move on tariffs",
        "description": "As Donald Trump kicks off his threatened trade war by slapping tariffs on both friends and foes alike, Number 10 is preparing for the moment he turns his attention to the UK.",
        "url": "https://news.sky.com/story/starmer160must-delicately-balance-his-risky-eu-reset-as-uk-braces-for-trumps-next-move-on-tariffs-13301628",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-donald-trump-keir-starmer_6725403.jpg?20241023150903",
        "type": "Politics",
        "Author": "Liz Bates",
        "Date Published": "2025-02-02 13:06:00",
        "Headline": "As Sir Keir Starmer heads to Brussels for talks, he needs to reset the UK's relationship with the EU while also keeping the US on side.",
        "Content": "\n          Political correspondent\n              @wizbates\n  As Donald Trump kicks off his threatened trade war by slapping tariffs on both friends and foes alike, Number 10 is preparing for the moment he turns his attention to the UK. The unpredictability of the returning president, emboldened by a second term, means the prime minister must plan for every possible scenario. Under normal circumstances, the special relationship might be the basis for special treatment but the early signs suggest, maybe not. It was never going to be an easy ride, with Sir Keir Starmer's top team racking up years of insults against Trump when they were in opposition. The bad feeling continued when Peter Mandelson was proposed as the UK's new ambassador to the US - prompting speculation he might even be vetoed.  Amid all of this, the much-anticipated call between the two leaders seemed slow to take place, although it was cordial when POTUS finally picked up the phone last Sunday, with a trip to Washington to come \"soon\". It is against this slightly tense backdrop that the future of transatlantic trade will be decided, with Westminster braced for the impact of the president's next move. So, it's unsurprising that as he waits, Sir Keir will spend the next few days resetting a different trading relationship - with Europe.  In this area, he is on slightly firmer ground, as the spectre of a global trade war makes European leaders want to huddle closer together to weather the storm. And conversely, the Labour government's track record works in their favour here, as they cash in their pro-EU credentials and wipe the slate clean after the bad-tempered Boris Johnson years. Read more:Lib Dem leader shrugs off Musk insultHome secretary's warning about recruiting from abroad It is still, however, an ambitious and risky endeavour to begin the delicate process of removing some of the most obstructive post-Brexit bureaucracy. For minimal economic benefits on both sides, the UK must convince the Europeans that they are not letting Britain \"have its cake and eat it\". At the same time, Brexiteers back at home will cry betrayal at any hint that the UK is sneaking back into the bloc via the back door. To make it even trickier, it must all be done with one eye on Washington, because while a united Europe may be necessary in the Trump era, the prime minister will not want to seem like he is picking sides so early on. As with so many things in politics, it's a delicate balancing act with the most serious of consequences, for a prime minister who is still to prove himself."
    },
    {
        "title": "Starmer 'should be rediverting his plane' to US to see Trump instead of flying to EU talks, says shadow business secretary",
        "description": "Sir Keir Starmer should be prioritising the UK's relationship with the US rather than the EU, the shadow business secretary has said.",
        "url": "https://news.sky.com/story/starmer-should-be-rediverting-his-plane-to-us-to-see-trump-instead-of-flying-to-eu-talks-says-shadow-business-secretary-13301651",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-starmer-pm-plane-g20_6817511.jpg?20250202144612",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-02 13:39:00",
        "Headline": "Andrew Griffith told Sky News the prime minister should \"redivert his plane\" from Brussels to Washington DC after Donald Trump slapped tariffs on Canada and Mexico overnight.",
        "Content": "Sir Keir Starmer should be prioritising the UK's relationship with the US rather than the EU, the shadow business secretary has said. Andrew Griffith, a former Conservative minister, said the prime minister - who is heading to Brussels on Monday for talks with EU leaders - \"should be rediverting his plane tomorrow\" to Washington DC\". Speaking on Sky's Sunday Morning With Trevor Phillips, Mr Griffith said the UK economy needed \"all the help it can get at the moment\" as he criticised the tax increases in the chancellor's budget and declining business confidence. Overnight President Trump imposed tariffs on Mexico and Canada - prompting fears that he could do the same with the UK and jeopardise Rachel Reeves' mission to grow the economy.  Mr Trump declared an economic emergency in order to place duties of 25% on goods from Mexico and Canada, and 10% on all imports from China. The tariffs also include a mechanism to escalate the rates if the countries retaliate - which Canada and Mexico did overnight. In response to Canada's retaliation, Mr Trump went further by threatening that the neighbouring country should become \"our cherished 51st state\". Analysis:PM's risky reset must balance Trump threat  Mr Griffith told Sky News there was \"a lot of jeopardy\" for the UK \"if the world goes into this era of increasing tariffs\" and that necessitated moving closer to the US. \"The UK depends upon free trade, we don't run particular trade deficits with the United States but, clearly, our economy needs all the help it can get at the moment after this government has come in, they've destroyed confidence, put up taxes, they're proposing lots of extra red tape,\" he said. \"So, the economy needs help and one of the big opportunities for the UK right now would be to get much closer to the US, our biggest trading partner. \"We have a trade deal with the European Union already, so, alongside that, a trade deal with the US would be a big win.\"  The Labour government has long sought to reset the UK's relationship with the EU in order to tackle problems such as small boat crossings in the Channel. As well as travelling to Brussels on Monday, Sir Keir is also hosting German Chancellor Olaf Scholz at his Chequers country residence today. Speaking to reporters at Chequers, Sir Keir said he had been \"very clear\" that while he does want a reset of the relationship between the UK and EU, \"that does not involve a return to the EU\". \"We had a referendum here on that and that matter is settled, but I do want to see a close relationship on defence and security, on energy, on trade and our economy, and that is what we're working on and I think that is certainly in the UK's best interests,\" he said. Read more:The builder shortage challenging Labour's growth plansHow Donald Trump's tariffs could impact consumers His words were echoed by Yvette Cooper, the home secretary, who said the UK wanted \"stronger relationships with the US\" and the European Union.  She admitted that the tariffs Mr Trump has imposed against Canada, Mexico and China risked having a \"really damaging impact\" on the global economy. \"Well, tariff increases really right across the world can have a really damaging impact on global growth and trade, so I don't think it's what anybody wants to see,\" she told the BBC's Sunday With Laura Kuenssberg. \"The focus for Johnny Reynolds, our business and trade secretary, is on building trade links and better trading relationships, and removing barriers to trade, with the US, and also with other European countries and with countries right across the world. \"We want to reduce the barriers to trade, make it easier for businesses.\""
    },
    {
        "title": "Businesses have been recruiting from abroad rather than training UK workers for 'far too long', says Yvette Cooper",
        "description": "The government has vowed to stop businesses recruiting foreign workers instead of training people already in the UK.",
        "url": "https://news.sky.com/story/businesses-have-been-recruiting-from-abroad-rather-than-training-uk-workers-for-far-too-long-says-yvette-cooper-13301501",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-yvette-cooper-trevor-phillips_6817255.jpg?20250202105912",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-02 08:02:00",
        "Headline": "Appearing on Sunday Morning with Trevor Phillips, Home Secretary Yvette Cooper criticised the current \"relaxed free market approach\", which she says has led net migration to quadruple over the past four years.",
        "Content": " The government has vowed to stop businesses recruiting foreign workers instead of training people already in the UK. Speaking to Sunday Morning with Trevor Phillips, Home Secretary Yvette Cooper criticised the current \"relaxed free market approach\", which she says has led net migration to quadruple over the past four years. \"A big driver… has been that overseas recruitment has shot up in a series of areas where training has fallen,\" she said. \"This has led to a relaxed free market approach for businesses to just be able to recruit from overseas instead of training in the UK.\" Latest updates from Politics Hub She said there \"has to be more requirements\" that force firms to show they are making recruitment efforts domestically. Ms Cooper said the government is \"drawing up further measures\" that will particularly target industries such as IT, construction, and engineering where \"for far too long we have been recruiting from abroad\". The new Border Security Asylum and Immigration Bill - revealed last week - will link the immigration system to bodies like Skills England and others that are involved in workforce planning, Ms Cooper said. She said the government will keep the skilled migrant worker salary threshold at £38,700 and it has removed the 20% wage discount for non-EU foreign workers brought in by the Conservatives in 2019. There will also be continued restrictions on both foreign graduate students and social care workers bringing family members, she added. Read more from Sky News:AI-manipulated images of children now illegalSenior Tory admits 'mistakes made' on immigrationAstraZeneca scraps £450m Liverpool facility The home secretary's comments come after the Office for National Statistics (ONS) published predictions that the UK population will grow by five million people in 10 years - driven mainly by migration. Speaking to Sir Trevor afterwards, shadow trade and business secretary Andrew Griffiths said: \"Well, we've been very clear. The Conservative Party is under new management. Immigration was too high. There were many, many, many, many failings in that immigration system in that period of time.\"  No to universal digital ID cards In the Sunday Telegraph, shadow home secretary Chris Philp accused the government of repealing parts of their Illegal Migration Act 2023 that make it almost impossible for people who arrive in small boats to apply for citizenship. He also suggested the government is repealing the Conservatives' measure of treating those who refuse to undergo scientific age checking as adults. A Home Office spokesperson said: \"The Illegal Migration Act has largely not been commenced (including this measure on age assessments); nor will it be under this government's policy. \"We have robust processes in place to verify and assess an individual's age where there is doubt, including the National Age Assessment Board, and have maintained the provisions on scientific assessments from the Nationality & Borders Act 2022.\" Asked about former prime minister Sir Tony Blair's claims that digital ID cards would help ease pressures on immigration, Ms Cooper did not endorse them. Instead, she said: \"Non-UK citizens already have to have biometric resident permits, but they're hardly ever checked.\" On trade, Ms Cooper reiterated Labour's stance that the UK will not re-enter the Customs Union, European Single Market, or restore freedom of movement. \"We'll look at ways to reduce friction, but we're not returning to a Customs Union. You do it within a framework that we're outside the EU and we're not returning. We need to move on.\""
    },
    {
        "title": "The builder shortage challenging the government's growth plans",
        "description": "Chancellor Rachel Reeves this week confirmed government support for dozens of big projects to boost growth, on top of Labour's existing promise to build 1.5 million new homes.",
        "url": "https://news.sky.com/story/the-builder-shortage-challenging-the-governments-growth-plans-13301354",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-rachel-reeves-chancellor_6812943.jpg?20250128174417",
        "type": "Politics",
        "Author": "Jack Parker, Sunday Morning With Trevor Phillips producer",
        "Date Published": "2025-02-02 00:01:00",
        "Headline": "The UK's population growth is far outpacing the size of its construction workforce, according to an analysis carried out for Sky's Sunday Morning With Trevor Phillips. ",
        "Content": "By Jack Parker, Sunday Morning With Trevor Phillips producer   Chancellor Rachel Reeves this week confirmed government support for dozens of big projects to boost growth, on top of Labour's existing promise to build 1.5 million new homes. Major planning system reforms are under way in a bid to meet targets, but among the challenges the government faces in delivery is who will build them. Construction bosses warn of a chronic worker shortage. The Construction Industry Training Board (CITB) estimates at least 50,000 extra workers are needed annually to meet current demand. But analysis for Sky News' Sunday Morning With Trevor Phillips now shows the UK's population growth is far outpacing the size of its construction workforce. Despite growing by 2.5 million people since 2019, the UK has lost 320,000 construction workers. There are now just 29 workers per 1,000 people, the lowest on record. To address the shortage, construction has increasingly turned to overseas. Analysis of the Office for National Statistics' Annual Population Survey (APS) shows that in 2007, one in 12 construction or civil engineering workers was foreign-born. By 2016, this had risen to one in seven. The APS stopped recording occupation by country of birth in 2022, so we don't fully know the current picture. Rishi Sunak's Conservative government tried to attract more overseas construction workers by adding roles including bricklayers and stonemasons to the Shortage Occupation List in July 2023. Since renamed the Immigration Salary List (ISL), over a quarter of roles now on the list are in construction. Labour says it wants to reduce net legal migration, which was an estimated 728,000 in the year to June 2024. Home Secretary Yvette Cooper has commissioned a Migration Advisory Committee report, expected in June, assessing which sectors are \"over-reliant\" on international recruitment. Read more:Growth is fight Starmer and Reeves can't afford to loseShell to install gas platform in North Sea So if the number of construction workers coming into the country is limited, home-grown apprentices might be expected to cover any shortfall. Government figures show around 15,500 people start construction apprenticeships every year, but nearly one in two (47%) do not finish their course. The dropout rate has risen sharply, up from 30% in 2014/15. A survey last year by the British Association of Construction Heads concluded the main reasons for dropping out included redundancies, firings, and low salaries. It means under 9,000 people a year finish their apprenticeship, one-fifth of the CITB estimate of the annual demand. The government has funded 32 skills hubs to offer fast-track training for 5,000 extra apprentices a year by 2028, in trades such as bricklaying and scaffolding. On today's Sunday Morning With Trevor Phillips, Trevor will be joined by Home Secretary Yvette Cooper to discuss whether the solution is more immigration or more domestic training. Watch Sunday Morning With Trevor Phillips every Sunday on Sky News from 8.30am."
    },
    {
        "title": "Lib Dem leader Sir Ed Davey shrugs off being called a 'snivelling cretin' by Elon Musk",
        "description": "Liberal Democrat leader Sir Ed Davey has shrugged off being called a \"snivelling cretin\" by Elon Musk - and has vowed to continue \"calling him out\".",
        "url": "https://news.sky.com/story/lib-dem-leader-sir-ed-davey-shrugs-off-being-called-a-snivelling-cretin-by-elon-musk-13301553",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-elon-musk-inauguration_6805732.jpg?20250120204244",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-02 10:07:00",
        "Headline": "Elon Musk, the world's richest man, has made several comments about UK politics since the election of the Labour government last July and widespread rioting triggered by misinformation around the killing of three young girls in Southport soon after.",
        "Content": " Liberal Democrat leader Sir Ed Davey has shrugged off being called a \"snivelling cretin\" by Elon Musk - and has vowed to continue \"calling him out\". Speaking to Sunday Morning with Trevor Phillips, Sir Ed said he has been \"in politics long enough to know that there are insults made\", adding that he is \"sometimes not always complimentary about people like Elon Musk\". Mr Musk, the world's richest man, has made several comments about UK politics since the election of the Labour government last July and widespread rioting triggered by misinformation around the killing of three young girls in Southport soon after. Last month, Sir Ed posted on X: \"People have had enough of Elon Musk interfering with our country's democracy when he clearly knows nothing about Britain. \"It's time to summon the US ambassador to ask why an incoming US official is suggesting the UK government should be overthrown.\" Mr Musk replied: \"What exactly do I fail to understand about your failure to stop the mass rape of little girls in Britain, you sniveling cretin?\" Read more:Musk appears in German far-right campaignMusk responds to inauguration hand gestureMusk's starring role in administration confirmed The X owner was referring to grooming gangs in the UK. His comments led members of the Conservative Party to call for a fresh inquiry into the issue. Speaking to Sir Trevor on Sky News, Sir Ed said the \"real issue of substance is Elon Musk said that the British government elected by the British people just a few months ago should be overthrown\". He said that while he does not agree with many of President Donald Trump's views, the UK should still try to work with the US. On Mr Musk, he added: \"It's a real matter of concern. We need to call him out.\" Sir Ed described him as an \"overpowerful billionaire tech magnate\", \"best friend of the president of the United States\", and \"camped out in Trump's Oval Office\". Mr Musk has been appointed as head of Mr Trump's newly-created Department of Government Efficiency (DOGE). While not a government body - it has been instructed to cut bureaucracy and budgets across the federal government."
    },
    {
        "title": "Social media users risk fragmenting into silos after Trump election victory, experts warn",
        "description": "Social media sites and their users risk fragmenting along political lines in light of Donald Trump's election win, experts have told Sky News.",
        "url": "https://news.sky.com/story/social-media-users-risk-fragmenting-into-silos-after-trump-election-victory-experts-warn-13295618",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-social-media-ban-australia_6750447.jpg?20241117153437",
        "type": "Technology",
        "Author": "Kieren Williams",
        "Date Published": "2025-02-02 02:00:00",
        "Headline": "Donald Trump began his second term in the Oval Office this month. Social media bosses Mark Zuckerberg and Elon Musk were both at his inauguration, in a sign of how cosy they are with the president.",
        "Content": "\n          News Reporter\n              @kjjjwilliams\n Social media sites and their users risk fragmenting along political lines in light of Donald Trump's election win, experts have told Sky News. They added some of the world's biggest social media platforms fell into line behind the new US government after November's election victory. X's Elon Musk backed Mr Trump in the election and he has since taken up a federal advisory role. Meta boss Mark Zuckerberg recently announced an overhaul in his sites' content moderation, removing third-party fact-checkers in the US and bringing in community notes. This move was a \"performative choice\" to align behind the new administration, according to Nina Jankowicz, former head of a disinformation board in the US Department of Homeland Security. As a result, established social media sites, as well as newer platforms like Bluesky and Mastodon, risk fragmenting along political lines as users split to engage more with content they like, Melissa Ingle, who worked in political disinformation at Twitter before Mr Musk's takeover, told Sky News. The effect of this could be an intense \"atomisation\" of social media users over the coming years into different silos, as people with different beliefs fragment and migrate to different sites, embedding existing divisions and polarisation, Ms Ingle said. Researchers raised concerns to Sky News about the effects this may have - both online and beyond. Meta 'could have kept fact-checking' Meta said removing third-party fact-checking was an attempt to reform an overly complex system and improve freedom of speech on the platform. Mr Zuckerberg referenced \"recent elections\" when announcing his decision, and speaking before his inauguration, NBC News reported Mr Trump said the move was \"probably\" in response to threats he had made in the past. But Ms Jankowicz said the choice Meta faced was never an \"either/or equation\". \"Zuckerberg could have kept third-party fact-checking to inform content moderation and introduced community notes to quell the concerns of the Trumps and Musks of the world,\" she said. Ms Ingle pointed out that removing disinformation, bias and misinformation entirely was an unrealistic goal, and instead, such platforms should utilise a range of tools to best help users - a sentiment others repeated. \"Just because it [third-party fact-checking] is an imperfect system doesn't mean you throw it away,\" Ms Ingle said. Content moderation, in its current form, came in largely after the 2016 US election, and sites took steps to protect their information ecosystems. But Meta's most recent move will \"hurt\" users looking to avoid disinformation, Angie Drobnic Holan, director of the International Fact-Checking Network, said.  'Cosying up to the president' Both Mr Zuckerberg and Mr Musk were at Mr Trump's inauguration, with the latter making a speech afterwards. Ms Ingle said, in light of Mr Musk's support of Mr Trump, X risked \"becoming [like] a state-sponsored media, it risks being something that explicitly boosts the government\". She added: \"We've never had the head of social media apps this explicitly cosying up to a president.\" In light of the most recent announcement from Mr Zuckerberg, Ms Jankowicz said: \"We now have all three major US social media platforms in the hands of overtly-Trump-aligned oligarchs. \"This sort of consolidation is usually something that only happens in autocracies, which begs the question of what the United States is on day one of the second Trump presidency.\" Read more:Trump warns DeepSeek should be 'wakeup call' for AI industryWho might buy TikTok after Trump's ultimatum? 👉 Follow Trump 100 on your podcast app 👈 Trump could help tech giants take on foreign governments The decisions of X and Meta come, not just in light of the recent US election, but after both have clashed with foreign governments in recent years. Meta was hit with a €1.2bn (£1bn) fine by the EU, and Mr Musk had a public spat with Brazil, which led to the platform being banned until it paid a 28 million reais (£3.8m) fine. In his video announcement, Mr Zuckerberg spoke about working with Mr Trump to \"push back on governments around the world\" - giving further indication of what social media sites may be like under the new US administration. Citing the battle as one over censorship, it could set the field of play for the coming years as US social media companies align with Mr Trump, and seemingly hope to reap the benefits in return. It may already be happening. In a speech at Davos, Mr Trump complained about the treatment of US companies in the EU, adding: \"Nobody's happy with it and we are going to do something about it.\" 'The good, bad and ugly' Announcing its removal of third-party fact-checkers, Meta said its existing systems had grown too complex and it wanted to allow more speech while focusing enforcement on illegal and \"high-severity\" violations. It added while \"the good, bad and ugly\" could all be on display on a platform, it was important to maintain freedom of expression. After a 2021 move to limit the amount of \"civic content\" users could see - like political news - the platform said it was reversing that decision. Meta added: \"Too much harmless content gets censored, too many people find themselves wrongly locked up in 'Facebook jail', and we are often too slow to respond when they do.\" X has been approached for comment."
    },
    {
        "title": "AI tools used to generate child abuse images made illegal in 'world leading' move ",
        "description": "AI tools designed to generate child sex abuse material (CSAM) will be made illegal under \"world leading\" legislation, the government has announced. ",
        "url": "https://news.sky.com/story/ai-tools-used-to-generate-child-abuse-images-made-illegal-in-world-leading-move-13300298",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-internet-watch-foundation_6716683.jpg?20241015151406",
        "type": "Technology",
        "Author": "Faye Brown",
        "Date Published": "2025-02-02 00:01:00",
        "Headline": "The government says it is leading the way with its crackdown on AI-generated abuse images, after warnings the content was being produced at a \"chilling\" rate.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n AI tools designed to generate child sex abuse material (CSAM) will be made illegal under \"world leading\" legislation, the government has announced.  The crackdown will also target anyone who possesses AI \"paedophile manuals\" which teach people how to use AI to sexually abuse children. It comes after warnings AI-generated child abuse imagery is being produced at a \"chiling rate\" and is \"disturbingly realistic\". It is already illegal to possess AI-generated CSAM but the new laws will target the means of production. This includes: • Making it illegal to possess, create or distribute AI tools designed to generate CSAM, punishable by up to five years in prison. • Making it illegal for anyone to possess AI \"paedophile manuals\" which teach people how to use AI to sexually abuse children, punishable by up to three years in prison. \n                  How Chinese DeepSeek can be as good as US AI rivals at fraction of cost\n                 \n                  What is DeepSeek? The low-cost Chinese AI firm that has turned the tech world upside down\n                 \n                  Donald Trump warns DeepSeek should be 'wakeup call' for America's AI industry\n                 Jess Phillips, the safeguarding minister, said Britain is the \"first country in the world\" to legislate for AI abuse imagery. She said: \"This is a global problem and is going to need global solutions. This government is leading the way on trying to clamp down on this horrendous crime.\" Speaking on Sunday Morning with Trevor Phillips, Home Secretary Yvette Cooper said AI is putting online child sexual abuse \"on steroids\", describing it as a \"real disturbing phenomenon\". \"It's escalating and accelerating the abuse,\" she said, which is becoming \"more extreme and sadistic\" as a result. The Home Office said AI tools are being used to generate abuse images in a number of ways, including by \"nudeifying\" real-life images of children or by stitching the faces of other children onto existing child sexual abuse images. The NSPCC said its childline service has been hearing from distressed children who have found AI-generated images of them. In one call, a 15-year-old girl told them: \"A stranger online has made fake nudes of me. It looks so real, it's my face and my room in the background. They must have taken the pictures from my Instagram and edited them. I'm so scared they will send them to my parents. The pictures are really convincing, and I don't think they'd believe me that they're fake.\"  Perpetrators are also using the fake images to blackmail children and force victims into further abuse, including streaming live images. The perpetrators can use AI tools to disguise their initial identity and more effectively groom and abuse children online, the Home Office said. Ms Phillips said: \"It is a massive battle. This is where it starts. This is not where it ends.\" The government has also announced that it will introduce a specific offence for predators who run websites designed for other paedophiles to share child sexual abuse content or advice on how to groom children, punishable by up to 10 years in prison. This is already illegal under possession and distribution laws, but the new offence will allow for longer sentences and prevent moderators from trying to claim they don't know what is on the site. The UK Border Force will also be given new powers to force an individual who they suspect poses a sexual risk to children to unlock their digital devices for inspection. Read more:Microsoft hit as AI spending in sharp focus after DeepSeek market shockUK to 'mainline AI in the veins' under new plans from Sir Keir Starmer All four measures will be introduced as part of the Crime and Policing Bill when it comes to parliament. Home Secretary Yvette Cooper said: \"We know that sick predators' activities online often lead to them carrying out the most horrific abuse in person. This government will not hesitate to act to ensure the safety of children online by ensuring our laws keep pace with the latest threats.\" This comes after The Internet Watch Foundation (IWF) warned of an increase in AI-generated sex abuse images. Over a 30-day period in 2024, IWF analysts identified 3,512 AI CSAM images on a single dark web site. Compared with their 2023 analysis, the prevalence of category A images (the most severe category) had risen by 10%. The IWF also warned that some AI images were so realistic it was hard to distinguish them from real abuse. Derek Ray-Hill, the charity's interim chief executive, said: \"We have long been calling for the law to be tightened up, and are pleased the government has adopted our recommendations. These steps will have a concrete impact on online safety.\""
    },
    {
        "title": "Grammys red carpet fashion 2025: All the best looks from the stars and nominees",
        "description": "Nominees and celebrity guests hit the red carpet in style at this year's Grammy Awards.",
        "url": "https://news.sky.com/story/grammys-red-carpet-fashion-2025-all-the-best-looks-from-the-stars-and-nominees-13302151",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sabrina-carpenter-grammys_6818128.jpg?20250202233139",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-02-02 22:46:00",
        "Headline": "Chappell Roan, Kacey Musgraves, Billie Eilish, Kanye West, Bianca Censori and Willow and Jaden Smith were among the stars walking the red carpet at this year's Grammy Awards.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Nominees and celebrity guests hit the red carpet in style at this year's Grammy Awards. With a focus on supporting relief efforts following the devastating Los Angeles-area wildfires the tone was a little more muted, but the fashion as exciting as ever. Here are some of the looks from the Grammys red carpet. Read more: Everything to know ahead of the show"
    },
    {
        "title": "Grammy Awards: Everything to know ahead of the show",
        "description": "It's the biggest night in music, and the biggest prize is album of the year - and this time around all eyes will be on Beyonce to see if she'll finally take home the top gong.",
        "url": "https://news.sky.com/story/grammy-awards-everything-to-know-ahead-of-the-show-13300671",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-beyonce-taylor-swift_6283963.png?20230914031906",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-02-02 00:01:00",
        "Headline": "The biggest night in music, stars we can expect to see at this year's Grammy ceremony include Taylor Swift, Beyonce, Sabrina Carpenter, Chappell Roan, Cardi B and Will Smith.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n It's the biggest night in music, and the biggest prize is album of the year - and this time around all eyes will be on Beyonce to see if she'll finally take home the top gong. Despite being the most Grammy-nominated person in history, it's an award that has alluded her up to now. Last year Taylor Swift took home the prize for her album Midnights and is up for it again this year for The Tortured Poets Department. Ironically, even if Beyonce doesn't win, she'll still make Grammy history, as the person with the most nominations in that category without a win. If Swift bags it, she'll make history too - beating her own record as the person to have won the category the most times. Others up for best album are Sabrina Carpenter, Charli XCX, Billie Eilish, Chappell Roan, Andre 3000 and Jacob Collier. Here's a whistle-stop tour of what to expect from the night. \n                  Jay-Z appears on red carpet with Beyonce and Blue Ivy after he was accused of raping girl, 13\n                 \n                  Yale University introduces course on Beyonce's political and cultural impact\n                 \n                  Beyonce and Taylor Swift make history as Grammy nominations revealed\n                 Where, when and what? The 67th annual Grammy Awards take place at the Crypto.com Arena in Los Angeles on Sunday night. With a whopping 94 prizes to give out, the night kicks off early with a premiere ceremony at 12.30pm in LA - 8.30pm here in the UK - which gives out the majority of the awards. But the ones everyone will be talking about are album of the year, record of the year, song of the year and best new artist, which are presented later. The red carpet kicks off at 11pm UK time, and we will be covering all the fashion of the night here on Sky News online. The main ceremony begins at 1am UK time and lasts three and a half hours. This year's awards recognise music released between 16 September 2023 and 30 August 2024. How will the LA fires affect the night? It's natural that the wildfires which have decimated parts of the city, claiming 29 lives, will take the focus of the event. The Recording Academy has cancelled a swathe of industry events around the show, instead allocating resources to Los Angeles-area wildfire relief and rebuilding efforts. The Recording Academy and MusiCares also launched the Los Angeles Fire Relief Effort with a $1m donation. Currently, they've raised and pledged more than $4m in emergency aid to those in the music industry affected by the wildfires. Who are the presenters? Comedian Trevor Noah will host the show for the fifth consecutive time. Stars presenting awards include Taylor Swift, Red Hot Chilli Peppers bandmembers Anthony Kiedis and Chad Smith, Cardi B, Gloria Estefan, Olivia Rodrigo, Queen Latifah, SZA, Victoria Monet and Will Smith - who coincidentally has a new album out. Who will perform? Benson Boone, Billie Eilish, Chappell Roan, Charli XCX, Doechii, RAYE, Sabrina Carpenter, Shakira and Teddy Swims will all perform. While Stevie Wonder and Janelle Monae will headline a tribute to the late, legendary producer Quincy Jones. Brad Paisley, Brittany Howard, Coldplay's Chris Martin, Cynthia Erivo, Herbie Hancock, Jacob Collier, John Legend, Lainey Wilson, Sheryl Crow and St. Vincent will also appear. Who's up for an award? Beyonce leads the Grammy nods with 11, bringing her career total to 99 nominations. That makes her the most nominated artist in Grammy history. As of 2023, she's also the most decorated artist, having earned 32 trophies across her career. Post Malone, Billie Eilish, Kendrick Lamar and Charli XCX follow with seven nominations. Taylor Swift and first-time nominees Sabrina Carpenter and Chappell Roan boast six nominations each. There are a couple of surprise nods in there too - looking back over five decades. The Beatles are up for two awards - record of the year and best rock performance. Now and Then, first recorded in the 1970s, was completed by Paul McCartney and Ringo Starr last year with the help of AI. It remains to be seen if Grammy voters will be put off by the tech tweaks, or if nostalgia will prevail. Where can I watch it? You can watch the premiere ceremony, red carpet and main ceremony on the Recording Academy's YouTube channel or the Grammy official website. Main category nominees Album Of The YearNew Blue Sun - Andre 3000Cowboy Carter- BeyonceShort N' Sweet - Sabrina CarpenterBrat - Charli XCXDjesse Vol. 4 - Jacob CollierHit Me Hard And Soft - Billie EilishChappell Roan The Rise and Fall of a Midwest Princess - Chappell RoanThe Tortured Poets Department - Taylor Swift Record Of The YearNow And Then - The BeatlesTexas Hold 'Em - BeyonceEspresso - Sabrina Carpenter360 - Charli XCXBirds Of A Feather - Billie EilishNot Like Us - Kendrick LamarGood Luck, Babe! - Chappell RoanFortnight - Taylor Swift Featuring Post Malone Song Of The YearA Bar Song (Tipsy) - Sean Cook, Jerrel Jones, Joe Kent, Chibueze Collins Obinna, Nevin Sastry & Mark Williams, songwriters (Shaboozey)Birds Of A Feather - Billie Eilish O'Connell & Finneas O'Connell, songwriters (Billie Eilish)Die With A Smile - Dernst 'D'Mile' Emile II, James Fauntleroy, Lady Gaga, Bruno Mars & Andrew Watt, songwriters (Lady Gaga & Bruno Mars)Fortnight - Jack Antonoff, Austin Post & Taylor Swift, songwriters (Taylor Swift Featuring Post Malone)Good Luck, Babe! - Kayleigh Rose Amstutz, Daniel Nigro & Justin Tranter, songwriters (Chappell Roan)Not Like Us - Kendrick Lamar, songwriter (Kendrick Lamar)Please Please Please - Amy Allen, Jack Antonoff & Sabrina Carpenter, songwriters (Sabrina Carpenter)Texas Hold 'Em - Brian Bates, Beyonce, Elizabeth Lowell Boland, Megan Bülow, Nate Ferraro & Raphael Saadiq, songwriters (Beyonce) Best New ArtistBenson BooneSabrina CarpenterDoechiiKhruangbinRayeChappell RoanShaboozeyTeddy Swims"
    },
    {
        "title": "Zoe Saldana asks people to be forgiving in emotional speech after award win amid Emilia Perez controversy",
        "description": "Oscar-nominated actress Zoe Saldana has called for people to be \"abstract with your idea of redemption\" as she won Best Supporting Actress at the 2025 London Critics' Circle Awards.",
        "url": "https://news.sky.com/story/zoe-saldana-asks-people-to-be-forgiving-in-emotional-speech-after-award-win-amid-emilia-perez-controversy-13302090",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-zoe-saldana-emilia-perez_6798202.jpg?20250113142005",
        "type": "Entertainment",
        "Author": "Debbie Ridgard",
        "Date Published": "2025-02-02 19:57:00",
        "Headline": "Actress Zoe Saldana stars in the Netflix film Emilia Perez alongside Karla Sofia Gascon, Selena Gomez and Adriana Paz.",
        "Content": "\n          Entertainment reporter\n              @Debbie_Ridgard\n Oscar-nominated actress Zoe Saldana has called for people to be \"abstract with your idea of redemption\" as she won Best Supporting Actress at the 2025 London Critics' Circle Awards. Her choice of words comes as her Emilia Perez co-star Karla Sofia Gascon apologised for her old social media posts that took aim at Islam and George Floyd. Speaking at the awards ceremony in Mayfair, London, Saldana said she wasn't expecting to be honoured, \"especially now\". \"It is very challenging to believe in something with so much conviction that you are willing to go against the grain and sometimes the grain can betray you because the grain can tell you that it is the right path,\" she said. She continued: \"You believe in your heart, and you do it. And I feel like that is the path of an artist... to believe in what you're feeling. \"If it's coming from a place of love and purity and knowledge and education and research and hard work. Emilia was done with so much of all of those things.\" Thanking her castmates, she said they had made something \"really beautiful\" but then went on to ask the crowd to \"be abstract with your idea of redemption\". \n                  Cineworld to shut six more cinemas - full list of closures\n                 \n                  Blockbuster Wicked lands largest opening weekend of 2024 at Vue\n                 \n                  Landlord talks leave closure threat facing 18 Cineworld sites\n                 She added: \"Keep your minds and your hearts open always. And keep making art and telling your truth. Please.\" Read more from Sky News:Sterling K Brown speaks to Sky NewsDigga D jailed for supplying cannabisGrammys: Everything to know Emilia Perez controversy  Saldana's plea for people to be forgiving came after her co-star Gascon recently took part in an hour-long interview with CNN, insisting she \"is not a racist\" and that she would not be renouncing her Oscar nomination \"because [she has] not committed any crime nor [has she] harmed anyone\". The Spanish actress claimed many of her social media posts on X were taken out of context and suggested the alleged screenshot of her calling Selena Gomez \"a rich rat\" was false. \"I have never said anything about my partner. I would never refer to her that way,\" she claimed. The actress, who since deactivated her account on X, is the first transgender performer to be nominated for an Oscar for best actress. In her apology for her comments, she said: \"As someone in a marginalised community, I know this suffering all too well and I am deeply sorry to those I have caused pain. \"All my life I have fought for a better world. I believe light will always triumph over darkness.\" London Critics' Circle winners The Brutalist was crowned Film of the Year at the 25th London Critics' Circle Awards - the only award received by the Brady Corbet feature. Fifteen projects were honoured at the May Fair Hotel - with Conclave, Nickel Boys and A Real Pain winning two awards each."
    },
    {
        "title": "Groundhog Day: Punxsutawney Phil predicts six more weeks of wintry weather",
        "description": "Punxsutawney Phil, the famous groundhog, has predicted six more weeks of winter for America as he gave his weather forecast in Pennsylvania.",
        "url": "https://news.sky.com/story/groundhog-day-punxsutawney-phil-predicts-six-more-weeks-of-wintry-weather-13301607",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-groundhog-day-pennsylvania_6817402.jpg?20250202130314",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-02-02 12:19:00",
        "Headline": "A massive crowd gathered to watch the Groundhog Day event... as the woodchuck was ushered out of his stump to speak his truth.",
        "Content": " Punxsutawney Phil, the famous groundhog, has predicted six more weeks of winter for America as he gave his weather forecast in Pennsylvania. A big crowd was in attendance at Gobbler's Knob as the woodchuck was ushered out of his tree stump to deliver his prediction. He was welcomed with chants of \"Phil, Phil, Phil\". Keeping a close eye on their furry friend, the top-hatted handlers said Phil saw his shadow, meaning a prediction of six more weeks of wintry weather. The ritual goes back more than a century - with far older roots in European folklore - and was made famous by Bill Murray's 1993 movie Groundhog Day. If the Punxsutawney Groundhog Club members declare Phil does not see his shadow, that is said to usher in an early spring. If he does see it, it's six more weeks of winter, so the saying goes. What that means can be subjective, however. \n                  Philadelphia struggles to process America's second plane crash in two days\n                 \n                  Car driver on ground among dead after Philadelphia plane crash which killed mother and daughter\n                 \n                  Luigi Mangione: What we know about man charged with murdering healthcare boss Brian Thompson\n                 And it may surprise, but Phil isn't always accurate either. He has predicted a longer winter far more often than an early spring, and one effort to track his accuracy concluded he was right less than 50% of the time. \"Phil's made a choice!\" it was announced as the animal was carefully lifted off his stump, getting some affectionate pets from his handler. Read more from Sky News:Grammys: Everything to knowLA wildfires 100% contained, officials say \"Hear ye, hear ye, hear ye,\" the announcer called to the crowd, hailing Phil as the \"seer of seers\" and \"the prognosticator of all prognosticators\". And then, apparently relaying the words communicated by the woodchuck in 'groundhogese' on a scroll, he continued: \"I miss my burrow, I miss my coop, so I'm headed back down... \"There's a shadow up here, get ready for six more weeks of winter this year!\" During the event, the crowd was also treated to a fireworks show, confetti and live music."
    }
]