[
    {
        "title": "Netanyahu backs Trump's peace plan for Gaza - as role for Blair revealed",
        "description": "The White House has unveiled its peace plan for Gaza &#8211; which includes a senior role for Sir Tony Blair.",
        "url": "https://news.sky.com/story/white-house-unveils-gaza-peace-plan-with-top-role-for-tony-blair-13441219",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump-benjamin-netanyahu_7036550.jpg?20250929201802",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-29 18:34:00",
        "Headline": "Donald Trump singled out Sir Tony Blair for praise as he announced a 'Board of Peace' that will temporarily govern Gaza if Israel and Hamas agree to the peace deal. ",
        "Content": " The White House has unveiled its peace plan for Gaza – which includes a senior role for Sir Tony Blair. The 20-point plan was released by the US government just minutes before Donald Trump and Benjamin Netanyahu held a joint news conference on Monday evening. As it happened: Trump unveils peace plan The plan states that if the fighting ends, Gaza will be placed under the control of a transitional government headed by Mr Trump and others, including former British prime minister Sir Tony. The president described him as a \"good man\", while the ex-Labour leader commended the \"bold\" plan. It says Gaza will \"be a deradicalised terror-free zone that does not pose a threat to its neighbours\", with no role for Hamas in its future governance, and will be \"redeveloped for the benefit of\" its people. It also says nobody will be forced to leave Gaza and states there will be increased aid to the enclave. Israel will not occupy or annex Gaza, it says. The remaining Israeli hostages being held by Hamas must be released within 72 hours, the plan states. It says this will be followed by Israel releasing Palestinian prisoners. Read more: What we know about Trump's plan Speaking at the White House, Israel's Prime Minister Netanyahu said to Mr Trump: \"I support your plan to end the war in Gaza which achieves our war aims.\" \"It will bring back to Israel all our hostages, dismantle Hamas's military capabilities and its political rule, and ensure that Gaza never again poses a threat to Israel,\" he said. Hamas said on Monday evening it only received the peace plan after it was unveiled at the White House. It has said it cannot sign up to anything that does not include Palestinian self-determination, and has dismissed any disarmament so long as Israeli occupation of Gaza continues. Adam Parsons analysis: Hamas' first reaction is telling  Sir Keir Starmer said the initiative is \"profoundly welcome\" and he is \"grateful\" for Mr Trump's leadership. \"We strongly support his efforts to end the fighting, release the hostages and ensure the provision of urgent humanitarian assistance for the people of Gaza,\" said the British prime minister. \"This is our top priority and should happen immediately.\" The Israeli foreign ministry earlier took a swipe at the UK for Labour Party members voting to accept Israel is committing genocide in Gaza, which has placed pressure on the government to do the same. \"The world stands with the US and Israel in their efforts to end the war,\" it said. \"Labour stands with Hamas. It is a disgrace for Britain that this is the party in power.\"  Blair 'a good man', says Trump The US president singled out Sir Tony for praise, labelling him a \"good man\" as he named him one of the political figures who would be on Gaza's transitional governing body. Mr Trump said \"leaders that are very distinguished\" would be on the board, adding: \"And one of the people that wants to be on the board is the UK former prime minister Tony Blair. Good man, very good man. And some others.\" Mr Trump said the body will be called the \"Board of Peace\", with other members to be named in the coming days. Sir Tony attended a meeting with Mr Trump and others to discuss the future of Gaza in August. Read more:Destruction of Gaza hospital witnessed by nurseDiplomats walk out as Israeli PM speaks at UN Chief political correspondent Blair has been one of the \"key architects\" of the peace plan, including visiting the White House in recent months. His history in the Middle East - the invasion of Iraq in 2003 - hangs over him, but the former PM does have experience in the area. Going back to the 1990s, nearly 30 years ago, he was involved in talks with PLO leader Yasser Arafat and others to try to bring peace to the Middle East. \n\n When he left Number 10 in 2007, he became a Middle East envoy for what was known as the quartet - the EU, US, Russia and the United Nations.  He gets on well with Benjamin Netanyahu - that's another crucial factor. While many in Labour will not be happy with Blair's involvement, it is clear to see why the likes of Netanyahu and Trump will approve of it. This is because Blair is an experienced negotiator and power broker in the region. Think back to the Good Friday Agreement, his role in Kosovo and Sierra Leone - he's always wanted to tackle these seemingly intractable international problems.  After resigning as prime minister in 2007, Sir Tony was appointed as the international community's special envoy to the Middle East with the goal of helping develop the Palestinian economy and institutions in order to prepare the groundwork for a Palestinian state. However, he struggled to deliver dramatic changes in the role and resigned in 2015. In a statement issued after the White House's announcement, Sir Tony said the US plan is \"bold and intelligent\". \"It offers us the best chance of ending two years of war, misery, and suffering and I thank President Trump for his leadership, determination and commitment,\" he said. World leaders welcome Trump's plan  In a joint statement, the foreign ministers of Saudi Arabia, Jordan, the United Arab Emirates, Qatar, and Egypt welcomed the plan. The ministers - along with their counterparts from Pakistan, Turkey, and Indonesia - said they were ready to cooperate positively with the US and other relevant parties."
    },
    {
        "title": "Praise and fury for Trump's Gaza peace deal - but Hamas's first reaction is telling",
        "description": "When Benjamin Netanyahu lands back in Israel, he will be hit by a wall of opinions. Some people are full of praise for the deal he has helped to construct, others hate it. Nobody is indifferent.",
        "url": "https://news.sky.com/story/praise-and-fury-for-trumps-gaza-peace-deal-but-hamas-first-reaction-is-telling-13441302",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-leaflets-gaza_7035768.jpg?20250929092703",
        "type": "Home",
        "Author": "Adam Parsons",
        "Date Published": "2025-09-29 21:28:00",
        "Headline": "Hamas says it can't sign up to anything that does not include Palestinian self-determination. Which this, pointedly, doesn't.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  When Benjamin Netanyahu lands back in Israel, he will be hit by a wall of opinions. Some people are full of praise for the deal he has helped to construct, others hate it. Nobody is indifferent. Among those who are spitting fury are members of his own cabinet. As it happened: Trump reveals Gaza plan Netanyahu will attend a cabinet meeting on Tuesday evening, and he will be faced by the anger of his two most outspoken ministers - Itamar Ben-Gvir and Bezalel Smotrich. Both come from the uncompromising political far right; both think that compromise is a sign of weakness; both were utterly outraged at the idea of the prime minister apologising to Qatar for the attack on Doha. Ben-Gvir said that, far from being a source of shame, it had been \"an important, just and supremely moral attack… Qatar is a state that supports terrorism, funds terrorism and incites terrorism\". Smotrich, as if ever worried at being outdone, compared Netanyahu with Neville Chamberlain's appeasement of the Nazis, saying his \"grovelling apology\" was a \"disgrace\". Can either of these men really keep serving in a cabinet with Netanyahu? And if not, how long before the government collapses? That wouldn't imperil the peace plan - if it survives - because it will have the support of enough opposition parties to be passed into law. But it would hasten a new general election, where Netanyahu would try to portray himself as the statesman who brought back the hostages (if he does) while his rivals would paint him as the man who let October 7 happen on his watch. But in the short term, Netanyahu's plan has plenty of fans in Israel. President Isaac Herzog applauded it and so did the forum representing the families of the hostages.  Leaders from Arab countries have all said they welcome it, albeit they have, unanimously, given the credit to Donald Trump, rather than the Israeli prime minister. But then the applause dwindles. From Hamas, the initial reaction was telling - the plan hadn't even been sent to them before it was announced to the world. And without their buy-in, what does a deal look like? Can it even work? They say they can't sign up to anything that does not include Palestinian self-determination. Which this, pointedly, doesn't. And remember - Hamas have the hostages. For all the implicit threats made by Trump about what would happen if Hamas don't sign up to this deal, the return of the hostages is the point that most loudly resonates with the Israeli public. If Hamas don't like the deal, they won't return the hostages. Read more:What we know about the plan - and what Sky correspondents think As for the governance of Gaza - there is precious little support among Palestinians for a Trump/Blair leadership team. \"Tony Blair is a war criminal who should be in The Hague, not Gaza,\" said Mustafa Barghouti, the veteran politician who has been on the Palestinian Legislative Council for nearly two decades. And that's an opinion I've heard echoed more than once. There are more negotiations to come. \"I'll believe it when it happens,\" one military figure said to me, wearily. \"I'm more confident than before,\" said another source, \"but before I wasn't confident at all.\" Nobody is getting too excited, too early, and there are hurdles to overcome and concessions to be made. But there is a chance that things might happen, and if they do, they might happen fast."
    },
    {
        "title": "Minister 'clarifies' violence against women and girls strategy after Sky News report",
        "description": "Child safety organisations have welcomed the government \"thinking again\" on including child abuse victims in its violence against women and girls strategy, following a Sky News report.",
        "url": "https://news.sky.com/story/minister-clarifies-violence-against-women-and-girls-strategy-after-sky-news-report-13440952",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-mollie-malone-vawg_7036270.jpg?20250929154613",
        "type": "Home",
        "Author": "Mollie Malone",
        "Date Published": "2025-09-29 11:43:00",
        "Headline": "Sky News revealed a Home Office document, titled \"Our draft definition of VAWG\", said child sexual abuse and exploitation is not \"explicitly within the scope\" of its strategy.",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n  Child safety organisations have welcomed the government \"thinking again\" on including child abuse victims in its violence against women and girls strategy, following a Sky News report. Jess Phillips, minister for safeguarding and violence against women and girls (VAWG), has written to charities to tell them \"children who experience child sexual abuse and exploitation are considered in the new VAWG strategy\". In the letter, Ms Phillips says she hopes the letter \"clarifies\" the government's position. It comes after 10 organisations raised concerns with the government after Sky News published a \"draft\" Home Office document that said child sexual abuse and exploitation was not \"explicitly\" within the scope of the strategy. Anna Edmunson, head of policy at the NSPCC, told Sky News: \"We're hopeful that the words in the minister's letter shows that they are thinking again and making sure they can draw out the really clear links between tackling VAWG and tackling child sexual abuse. \"But the proof will be in the pudding - that's why we want to see the final strategy.\" The strategy has been delayed and is expected to be published later in the autumn. Read more from Sky News:Freed McCann suspect attempts to confront prosecutorWhat we know about the Michigan church suspect \"I am pleased to see the government has addressed the concerns we have raised,\" Kerry Smith, chief executive of the Internet Watch Foundation, told Sky News. \"We are at the front line and see how girls bear the brunt of sexual violence on and offline. We now need to see the strategy itself published in full. The sooner it can become a reality, the better.\" Rape Crisis, which is the largest support service of its kind, welcomed what they call a \"shift in position\" from the government to \"now acknowledging\" that child victims of sexual abuse and exploitation will be included, adding what's needed is \"concrete commitments.\" An estimated half a million children are sexually abused in England and Wales every year. Last month, Sky News spoke to Poppy Eyre, who was raped by her grandfather when she was four.  \"VAWG is violence against women and girls. If you take child sexual abuse out of it, where are the girls?\", she said, reacting to the leaked draft document Sky News obtained. The government insist that child sexual abuse will feature in the VAWG strategy, but victims and campaigners are concerned that it's in danger of being siloed off into disparate plans, without falling under the VAWG umbrella. Read more from Mollie Malone:Drones could be used to help prison escapesTasers to be used in prisons A Home Office spokesperson told Sky News it has \"been clear throughout that action to tackle child sexual abuse has always been included in the upcoming VAWG strategy\". The spokesperson said such crimes would be tackled \"through a distinct and transformative workstream\", including acting upon the recommendations of the Casey review into grooming gangs and the Jay review into child sexual abuse. Poppy Eyre said: \"My message to the government is if you're going to make child sexual abuse a separate thing, we need it now.\""
    },
    {
        "title": "PM to make major NHS announcement in pivotal conference speech",
        "description": "Sir Keir Starmer will today announce a major overhaul of the NHS, promising an &#8220;online hospital&#8221; that will deliver millions of extra appointments and help cut long waiting times, as he outlines his vision for a \"fairer\" Britain.",
        "url": "https://news.sky.com/story/pm-to-make-major-nhs-announcement-in-pivotal-conference-speech-13441295",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-speech_7035996.jpg?20250930031050",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-29 21:14:00",
        "Headline": "NHS Online will launch in 2027, according to the prime minister, in a bid to modernise the struggling health service. The announcement will form part of a crucial speech for Sir Keir, as his party languishes behind Reform UK in the polls.",
        "Content": "Sir Keir Starmer will today announce a major overhaul of the NHS, promising an “online hospital” that will deliver millions of extra appointments and help cut long waiting times, as he outlines his vision for a \"fairer\" Britain. In his keynote address to the Labour Party conference, the prime minister will set out plans for the digital service - NHS Online - to launch in 2027. Politics Hub: Follow the PM's speech from 2pm The platform will allow patients to access prescriptions, book scans and tests, receive clinical advice, and manage appointments through the NHS app. Labour claim the initiative will provide up to 8.5 million extra NHS appointments in its first three years. It will also let patients schedule in-person procedures at local hospitals, surgical hubs or diagnostic centres, reducing delays. Describing the move as \"a new chapter in the story of our NHS\", Sir Keir will say it marks the beginning of a technological revolution in healthcare. Speaking ahead of the prime minister's address, Health Secretary Wes Streeting said the NHS faces an \"existential threat\" if it fails to modernise, and vowed Labour would embrace new technologies to secure its future. \"Our health service and our social care services need to change with the times,\" he said. Country standing at a 'fork in the road' Sir Keir's announcement comes at a pivotal moment for the prime minister, as he will use his address at 2pm to rally a divided party and set out his vision for national renewal. He will urge voters to reject what he calls the \"politics of grievance\" promoted by Nigel Farage's Reform UK, and instead unite around a shared sense of \"dignity and respect\". The prime minister will argue that the country stands at a \"fork in the road\", facing a choice between \"renewal or decline\". \"Britain stands at a fork in the road. We can choose decency. Or we can choose division,\" he will say. Sir Keir will cast the challenge ahead as comparable to the challenges faced by the post-war government of former Labour prime minister Clement Attlee, calling it a fight for \"the soul of our country\". Read more:Streeting tells BMA to 'pick a side'Reeves does nothing to ease budget speculation  Mounting challenges for Labour The speech also comes amid mounting political headwinds, with polls showing Reform continuing to attract support from disillusioned voters. At the same time, Labour faces growing pressure to deliver on its promises around tax, immigration, and public spending - and expectations of a difficult budget in November. Sir Keir is expected to acknowledge that the path to national renewal won't be easy, warning of \"decisions that will not always be comfortable for our party\".  Despite recent speculation over his leadership, sparked in part by criticism from Greater Manchester mayor Andy Burnham, Sir Keir appears determined to reassert his authority. But the Conservatives have already dismissed his speech before delivery, with party chairman Kevin Hollinrake claiming: \"Keir Starmer calls this a fork in the road, but he's already driven Britain into a cul-de-sac of chaos.\" Ahead of Sir Keir's speech, cabinet members will also address the conference in Liverpool. Northern Ireland Secretary Hilary Benn, Transport Secretary Heidi Alexander, and Mr Streeting will all speak. On Monday, 10 cabinet ministers addressed the conference from the main stage, including Chancellor Rachel Reeves, who argued Reform present a threat to the economy."
    },
    {
        "title": "Christian B: Freed Madeleine McCann suspect pleads 'give me back my life' as he tries to confront prosecutor",
        "description": "The freed suspect in the Madeleine McCann case has spoken publicly for the first time since his release - but refused to discuss the mystery of the missing British toddler.",
        "url": "https://news.sky.com/story/christian-b-freed-madeleine-mccann-suspect-pleads-give-me-back-my-life-as-he-tries-to-confront-prosecutor-13440814",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-christian-b-prosucator_7035939.jpg?20250929174147",
        "type": "Home",
        "Author": "Martin Brunt, crime correspondent, and Rob Hyde in Germany",
        "Date Published": "2025-09-29 10:20:00",
        "Headline": "Hans Christian Wolters has alleged he has evidence showing Christian B abducted and killed Madeleine McCann - something he denies.",
        "Content": "By Martin Brunt, crime correspondent, and Rob Hyde in Germany   The freed suspect in the Madeleine McCann case has spoken publicly for the first time since his release - but refused to discuss the mystery of the missing British toddler. In an exclusive Sky News interview, he hit out after trying to confront the prosecutor who has accused him of abducting and murdering Madeleine. Christian B, who cannot be fully identified under German privacy laws, travelled more than a hundred miles from a secret address to prosecutor Hans Christian Wolters' office, but was stopped from going in. The suspect said: \"I want them to stop this witch-hunt against me and give me back my life. \"I'm not feeling free. I have this ankle tag and I'm followed around by police 24/7, so I'm not feeling free.\" Mr Wolters has stated publicly that he has evidence, which he has not revealed, to show Christian B abducted and killed Madeleine, who vanished from her bed during a Portuguese holiday in 2007. But he said he doesn't have enough evidence to arrest or charge him. The suspect, who was released from a rape sentence two weeks ago, said: \"The prosecutor refused to meet me, but I told his representative I wanted his help to get my life back. \"I'm being hounded by the media and it's his fault. I want him to take responsibility. \"I was told there was nothing they could do to help. They said I had been convicted and released and I wasn't their responsibility.\" As he spoke, the electronic tag that has monitored his movements since his release was clearly visible above his right ankle. He has also had to surrender his passport and report regularly to probation staff. The suspect has not been arrested, charged or even questioned by German authorities about the Madeleine case. He's also refused to talk to Scotland Yard and Portuguese police, who are also involved in the investigation. Asked directly if he had abducted and killed Madeleine McCann, he said: \"My defence lawyers have told me to say nothing on this topic and unfortunately I have to abide by that.\" Christian B, 49, was driven from jail by his lawyer, Friedrich Fulscher, on 17 September and, since then, has lived in local authority accommodation in the town of Neumunster, north of Hamburg. Journalists quickly tracked him down and exposed his new address, prompting anger in the community from people worried about his convictions for child sex crimes. Local councillor Karin Mundt, of the hard-right populist movement Heimat Neumunster (Homeland Neumunster), took to Facebook to warn locals to be vigilant, not go out alone, and make sure that their children and elderly were safe. She also called for a public protest under the slogan 'Christian B out of Neumunster - tougher measures against child abusers and rapists to protect all citizens!' Germany operates draconian privacy laws, whereby even the media must get the consent of someone they photograph, or disguise their features.  Yet the group even decided to publish photos of Christian B, arguing that the danger he presents meant he was a public person of interest, and that they had to make sure that elderly people were able to recognise him. Two separate chat groups were set up, one dedicated to campaigning for Christian B to be booted out of Neumunster, the other to discuss alleged sightings of him. 'Out for a steak' Some claimed that Christian B had turned up near schools and that the police were called round, though other people said they worked at these schools, and that no police had been there. A woman at Domino's pizza claimed he had turned up in a false beard, yet just days later her colleague said she had seen the pictures and she was unsure that it was Christian B. Throughout all this, a source close to Christian B's defence claimed he had not been out at all apart from to sort out his phone, and also once for a steak. On Wednesday, one chat even discussed gathering at the town hall in the evening, and police vans then turned up to try to prevent this. The language of the chat became ever bolder - with people openly posting addresses they were convinced he was living at - and, at one point, all people with English-sounding surnames were ejected from the group as people suspected they were journalists. Read more from Sky News:What we know about Christian BChristian B celebrates release with burger and cigaretteSky News tracks down woman at centre of hit-and-run theory Police moved Christian B out of Neumunster, and reports say he's since been spotted at a hotel in an unnamed town. In a recent interview with Germany's Stern magazine, Christian B's main lawyer, Dr Fulscher, said: \"The Braunschweig public prosecutor's office has fuelled this media campaign of prejudgement. \"It has told the public that it is certain it has the right person. Without presenting sufficient evidence or even allowing my client to inspect the files. \"I find this highly questionable from a constitutional point of view. In my opinion, the Braunschweig public prosecutor's office has made rehabilitation impossible.\" Prosecutor Mr Wolters told Sky News he'd been tipped off about the suspect's visit to his office in Braunschweig, near Hanover, and refused to speak to him. Christian B denies any involvement in Madeleine's disappearance."
    },
    {
        "title": "Streeting tells BMA doctors' union to 'pick a side' between Reform and Labour",
        "description": "Health Secretary Wes Streeting has told the BMA doctors' union to \"pick a side\" between Reform and Labour over their pay dispute.",
        "url": "https://news.sky.com/story/streeting-tells-bma-doctors-union-to-pick-a-side-between-reform-and-labour-13441200",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-electoral-dysfunction_7036551.jpg?20250929201810",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-29 17:40:00",
        "Headline": "The health secretary talks to Beth Rigby for the Electoral Dysfunction podcast on the BMA dispute, the Lib Dems and Andy Burnham.",
        "Content": "Health Secretary Wes Streeting has told the BMA doctors' union to \"pick a side\" between Reform and Labour over their pay dispute. Mr Streeting, talking to Sky News political editor Beth Rigby on the Electoral Dysfunction podcast, said the Labour Party will always be on the side of the NHS, while Reform leader Nigel Farage would \"check your credit card before your pulse\". 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈  In July, resident doctors, previously known as junior doctors, went on strike over their pay and are threatening to strike again following years of walkouts under the previous Tory government. In a preview of what his speech on Tuesday to the Labour Party conference will focus on, Mr Streeting said: \"I'd say to the BMA, pick a side because you've got a choice here and there's a government that wants to work with you.\" During a live recording of Electoral Dysfunction at the conference in Liverpool, he added: \"What I've said to the BMA is the NHS is hanging by a thread, don't pull it. \"It wouldn't be in the interest of the BMA - there isn't a more pro-doctor, pro-NHS government waiting in the wings.\" \n                  Starmer to pit Labour against Reform in conference closing speech\n                 \n                  Minister 'clarifies' violence against women and girls strategy after Sky News report\n                 \n                  Labour conference latest: Wes Streeting: 'We need Andy Burnham on the pitch'\n                 He mentioned Mr Farage's plan to introduce health insurance, adding: \"The BMA should really think about this in terms of their members.\" Mr Farage has also pledged to abolish indefinite leave to remain and put in place a minimum salary of £60,000 for skilled worker visas. The health secretary said that would be \"shooting ourselves in the foot\" when it comes to NHS staff. \"Farage says 'go home', the Labour Party says 'this is your home and with us this will always be your home',\" he said. Lib Dems are 'frenemies' Mr Streeting said he thinks there will be lots of disaffected Conservative voters who do not want to see Reform in government, and said they are \"welcome to get behind us\". He added some of those voters will support the Lib Dems, who he called \"frenemies\" of Labour - \"some days they're friends, some days they're enemies\" - but said \"we have a common enemy in Reform\". We need Burnham on the pitch Mr Streeting also addressed the potential of Greater Manchester mayor Andy Burnham challenging Sir Keir Starmer for his premiership. He said he thought Mr Burnham claiming there is a \"culture of fear\" within the Labour Party \"was an overstatement\". Asked if the mayor is a team player, Mr Streeting said: \"On his best days, yes.\" But he said recently \"he's had his ups and downs\". However, he added: \"I think the thing about Andy, he's one of our star players, and we need him on the pitch.\""
    },
    {
        "title": "Harry Potter author JK Rowling hits out at Emma Watson in fresh clash over transgender issues",
        "description": "JK Rowling has accused Emma Watson of being \"ignorant of how ignorant she is\" amid their ongoing disagreement about transgender issues.",
        "url": "https://news.sky.com/story/harry-potter-author-jk-rowling-hits-out-at-emma-watson-in-fresh-clash-over-transgender-issues-13441122",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-j-k-rowling-emma-watson_7036298.jpg?20250929160040",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-29 15:17:00",
        "Headline": "The Hermione Granger actress discussed her relationship with JK Rowling on a podcast last week - and the author has now hit back in a lengthy social media post. ",
        "Content": "JK Rowling has accused Emma Watson of being \"ignorant of how ignorant she is\" amid their ongoing disagreement about transgender issues. The Harry Potter films' three central stars - Watson, Daniel Radcliffe and Rupert Grint - have publicly backed the rights of transgender people in recent years, often distancing themselves from the author when asked about her in interviews. Rowling, 60, has previously been accused of transphobia, which she denies. Watson, 35, discussed her relationship with the writer on a podcast last week, telling host Jay Shetty: \"I think it's my deepest wish that I hope people who don't agree with my opinion will love me, and I hope I can keep loving people who I don't necessarily share the same opinion with.\" Rowling has now shared a more than 600-word post on X in response to Watson, in which she states: \"Like other people who've never experienced adult life uncushioned by wealth and fame, Emma has so little experience of real life she's ignorant of how ignorant she is.\" The author went on to say the Hermione Granger actress is never going to need a homeless shelter or be placed on a mixed-sex public hospital ward. The multimillionaire author said that \"I lived in poverty while writing the book that made Emma famous\" and therefore \"understand from my own life experience what the trashing of women's rights in which Emma has so enthusiastically participated means to women and girls without her privileges\". \n                  Harry Potter: Casting opens for next Harry, Ron and Hermione for TV adaptation\n                 \n                  Chad Michael Busto: 'Stalker' who barged into dressing room and yelled 'I want to marry Emma Watson' arrested\n                 \n                  British LGBT Awards: Joe Lycett, Harry Styles, Rod Stewart and Alex Scott among 2023 nominees\n                 Rowling added that while she has found it \"hard to shake off a certain protectiveness\" towards the Harry Potter stars, who she has known since they were children, there was a \"turning point\" in her relationship with Watson in 2022. She said this happened when Watson gave a Bafta speech saying \"I'm here for all the witches\", which some saw as a criticism of the author's beliefs on gender. The actress then asked someone to deliver her a handwritten note saying \"I'm so sorry for what you're going through\", the author claimed on X. Rowling said this came at a time \"when the death, rape and torture threats against me were at their peak\" and \"Emma had just publicly poured more petrol on the flames, yet thought a one line expression of concern from her would reassure me of her fundamental sympathy and kindness\". Read more:Is Eurovision heading for a crisis?Older brother of Oasis stars denies rape Watson has often publicly disagreed with Rowling. In 2020, she was one of several Harry Potter stars who showed their support for the trans community when the author shared a series of divisive posts online. \"I want my trans followers to know that I and so many other people around the world see you, respect you and love you for who you are,\" the actress wrote at the time."
    },
    {
        "title": "Cyber attacks: '80%' of ransomware victims pay up, insurer says",
        "description": "The vast majority of companies hit by ransomware attacks over the past year have paid up, according to an insurance specialist's report that warns of mixed outcomes for those who do.",
        "url": "https://news.sky.com/story/cyber-attacks-80-of-ransomware-victims-pay-up-insurer-says-13441131",
        "image_url": "https://e3.365dm.com/23/01/1920x1080/skynews-ransomware-cyber-attack_6022990.jpg?20230113194459",
        "type": "Home",
        "Author": "James Sillars",
        "Date Published": "2025-09-29 15:15:00",
        "Headline": "Hackers are said to be increasingly targeting sensitive business data including intellectual property because they see a chance of greater financial rewards.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The vast majority of companies hit by ransomware attacks over the past year have paid up, according to an insurance specialist's report that warns of mixed outcomes for those who do. Business-to-home insurer Hiscox released its annual Cyber Readiness Report against a backdrop of concern over a series of cyber attacks on high profile names over the past six months, including Marks and Spencer, the Co-op and Jaguar Land Rover (JLR). The carmaker has been handed a £1.5bn loan guarantee by the government to help shield its vast supply chain, including many small firms, from the impact of a month-long shutdown of its factories. While some have already laid off staff - a fraction of the 200,000 people employed among suppliers - many victims of hackers are small and medium-sized businesses (SMEs) that would not attract such financial support by themselves. There are no lengths to which cyber criminals will stoop - with hackers just last week threatening to release the personal data of children in the care of a nursery chain.  Hiscox said 27% of the 5,750 SMEs surveyed had been targeted with ransomware over the last 12 months. Of those, 80% had paid a ransom. But Hiscox added that only 60% of those companies had successfully recovered all or part of their data after making a payment. Almost a third of the firms to have paid a ransom were met with demands for more money, it said. Attacks 'threaten survival' of firms The wider findings of the study showed that almost 60% of the companies surveyed had experienced a cyber attack in the period, with many blaming artificial intelligence vulnerabilities for leaving them exposed. Many faced substantial fines for failures to adequately protect data and the findings also showed hits to not only bottom lines but reputations and orders too. Eddie Lamb, global head of cyber at Hiscox, said: \"No business, however small, can afford to underestimate the devastating impact a cyber-attack can have. \"Cyber attacks don't just disrupt day-to-day operations; they can threaten the very survival of a business. \"The financial fall-out, from crippling fines to lost customers or soaring costs, can push even the most resilient business to the brink. On top of this, the stress and long hours required to recover can impact staff morale and even lead to burnout.\"  JLR was reportedly in the process of finalising an insurance policy to cover cyber disruption when it was targeted at the end of August. The company is already facing an estimated bill of £200m from lost production. Henry Green, co-founder of the cyber insurance broker Assured, said policies had to reflect true levels of financial risk, or they were pointless. \"For £300-500m cover, JLR would have been looking at a circa £5m premium with at least a £10m excess,\" he said.  The costs of policies which cover all losses in the event of a cyber crime will be far beyond many firms, though the cyber insurance market is growing beyond major employers. That is partly due to the very public impact of disruption to the likes of M&S, heightened warnings over preparedness and increased competition in insurance provision.  The research specialist imarc says the market was worth £521m last year and expected to top £2.4bn by 2033.  M&S has estimated a hit of at least £300m from the ransomware attack on its business in mid-April. But the retailer, which is widely believed to have paid off its attackers, expects to claw the bulk of that sum back through its insurance policies. Read more from Sky News:Video game maker EA in record buyoutReeves fails to quell budget speculation Mr Lamb, who urged investment in protections, added: \"Cyber criminals are now much more focused on stealing sensitive business data – things like contracts, executive emails, financials, and intellectual property – because it’s easier to monetise than personal information. \"Once stolen, they demand payment to avoid public exposure, pricing threats based on reputational damage. \"This change has exposed gaps in some companies’ data loss prevention controls, which attackers are readily exploiting.\""
    },
    {
        "title": "PM to make major NHS announcement in pivotal conference speech",
        "description": "Sir Keir Starmer will today announce a major overhaul of the NHS, promising an &#8220;online hospital&#8221; that will deliver millions of extra appointments and help cut long waiting times, as he outlines his vision for a \"fairer\" Britain.",
        "url": "https://news.sky.com/story/pm-to-make-major-nhs-announcement-in-pivotal-conference-speech-13441295",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-speech_7035996.jpg?20250930031050",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-29 21:14:00",
        "Headline": "NHS Online will launch in 2027, according to the prime minister, in a bid to modernise the struggling health service. The announcement will form part of a crucial speech for Sir Keir, as his party languishes behind Reform UK in the polls.",
        "Content": "Sir Keir Starmer will today announce a major overhaul of the NHS, promising an “online hospital” that will deliver millions of extra appointments and help cut long waiting times, as he outlines his vision for a \"fairer\" Britain. In his keynote address to the Labour Party conference, the prime minister will set out plans for the digital service - NHS Online - to launch in 2027. Politics Hub: Follow the PM's speech from 2pm The platform will allow patients to access prescriptions, book scans and tests, receive clinical advice, and manage appointments through the NHS app. Labour claim the initiative will provide up to 8.5 million extra NHS appointments in its first three years. It will also let patients schedule in-person procedures at local hospitals, surgical hubs or diagnostic centres, reducing delays. Describing the move as \"a new chapter in the story of our NHS\", Sir Keir will say it marks the beginning of a technological revolution in healthcare. Speaking ahead of the prime minister's address, Health Secretary Wes Streeting said the NHS faces an \"existential threat\" if it fails to modernise, and vowed Labour would embrace new technologies to secure its future. \"Our health service and our social care services need to change with the times,\" he said. Country standing at a 'fork in the road' Sir Keir's announcement comes at a pivotal moment for the prime minister, as he will use his address at 2pm to rally a divided party and set out his vision for national renewal. He will urge voters to reject what he calls the \"politics of grievance\" promoted by Nigel Farage's Reform UK, and instead unite around a shared sense of \"dignity and respect\". The prime minister will argue that the country stands at a \"fork in the road\", facing a choice between \"renewal or decline\". \"Britain stands at a fork in the road. We can choose decency. Or we can choose division,\" he will say. Sir Keir will cast the challenge ahead as comparable to the challenges faced by the post-war government of former Labour prime minister Clement Attlee, calling it a fight for \"the soul of our country\". Read more:Streeting tells BMA to 'pick a side'Reeves does nothing to ease budget speculation  Mounting challenges for Labour The speech also comes amid mounting political headwinds, with polls showing Reform continuing to attract support from disillusioned voters. At the same time, Labour faces growing pressure to deliver on its promises around tax, immigration, and public spending - and expectations of a difficult budget in November. Sir Keir is expected to acknowledge that the path to national renewal won't be easy, warning of \"decisions that will not always be comfortable for our party\".  Despite recent speculation over his leadership, sparked in part by criticism from Greater Manchester mayor Andy Burnham, Sir Keir appears determined to reassert his authority. But the Conservatives have already dismissed his speech before delivery, with party chairman Kevin Hollinrake claiming: \"Keir Starmer calls this a fork in the road, but he's already driven Britain into a cul-de-sac of chaos.\" Ahead of Sir Keir's speech, cabinet members will also address the conference in Liverpool. Northern Ireland Secretary Hilary Benn, Transport Secretary Heidi Alexander, and Mr Streeting will all speak. On Monday, 10 cabinet ministers addressed the conference from the main stage, including Chancellor Rachel Reeves, who argued Reform present a threat to the economy."
    },
    {
        "title": "Minister 'clarifies' violence against women and girls strategy after Sky News report",
        "description": "Child safety organisations have welcomed the government \"thinking again\" on including child abuse victims in its violence against women and girls strategy, following a Sky News report.",
        "url": "https://news.sky.com/story/minister-clarifies-violence-against-women-and-girls-strategy-after-sky-news-report-13440952",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-mollie-malone-vawg_7036270.jpg?20250929154613",
        "type": "UK",
        "Author": "Mollie Malone",
        "Date Published": "2025-09-29 11:43:00",
        "Headline": "Sky News revealed a Home Office document, titled \"Our draft definition of VAWG\", said child sexual abuse and exploitation is not \"explicitly within the scope\" of its strategy.",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n  Child safety organisations have welcomed the government \"thinking again\" on including child abuse victims in its violence against women and girls strategy, following a Sky News report. Jess Phillips, minister for safeguarding and violence against women and girls (VAWG), has written to charities to tell them \"children who experience child sexual abuse and exploitation are considered in the new VAWG strategy\". In the letter, Ms Phillips says she hopes the letter \"clarifies\" the government's position. It comes after 10 organisations raised concerns with the government after Sky News published a \"draft\" Home Office document that said child sexual abuse and exploitation was not \"explicitly\" within the scope of the strategy. Anna Edmunson, head of policy at the NSPCC, told Sky News: \"We're hopeful that the words in the minister's letter shows that they are thinking again and making sure they can draw out the really clear links between tackling VAWG and tackling child sexual abuse. \"But the proof will be in the pudding - that's why we want to see the final strategy.\" The strategy has been delayed and is expected to be published later in the autumn. Read more from Sky News:Freed McCann suspect attempts to confront prosecutorWhat we know about the Michigan church suspect \"I am pleased to see the government has addressed the concerns we have raised,\" Kerry Smith, chief executive of the Internet Watch Foundation, told Sky News. \"We are at the front line and see how girls bear the brunt of sexual violence on and offline. We now need to see the strategy itself published in full. The sooner it can become a reality, the better.\" Rape Crisis, which is the largest support service of its kind, welcomed what they call a \"shift in position\" from the government to \"now acknowledging\" that child victims of sexual abuse and exploitation will be included, adding what's needed is \"concrete commitments.\" An estimated half a million children are sexually abused in England and Wales every year. Last month, Sky News spoke to Poppy Eyre, who was raped by her grandfather when she was four.  \"VAWG is violence against women and girls. If you take child sexual abuse out of it, where are the girls?\", she said, reacting to the leaked draft document Sky News obtained. The government insist that child sexual abuse will feature in the VAWG strategy, but victims and campaigners are concerned that it's in danger of being siloed off into disparate plans, without falling under the VAWG umbrella. Read more from Mollie Malone:Drones could be used to help prison escapesTasers to be used in prisons A Home Office spokesperson told Sky News it has \"been clear throughout that action to tackle child sexual abuse has always been included in the upcoming VAWG strategy\". The spokesperson said such crimes would be tackled \"through a distinct and transformative workstream\", including acting upon the recommendations of the Casey review into grooming gangs and the Jay review into child sexual abuse. Poppy Eyre said: \"My message to the government is if you're going to make child sexual abuse a separate thing, we need it now.\""
    },
    {
        "title": "Christian B: Freed Madeleine McCann suspect pleads 'give me back my life' as he tries to confront prosecutor",
        "description": "The freed suspect in the Madeleine McCann case has spoken publicly for the first time since his release - but refused to discuss the mystery of the missing British toddler.",
        "url": "https://news.sky.com/story/christian-b-freed-madeleine-mccann-suspect-pleads-give-me-back-my-life-as-he-tries-to-confront-prosecutor-13440814",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-christian-b-prosucator_7035939.jpg?20250929174147",
        "type": "UK",
        "Author": "Martin Brunt, crime correspondent, and Rob Hyde in Germany",
        "Date Published": "2025-09-29 10:20:00",
        "Headline": "Hans Christian Wolters has alleged he has evidence showing Christian B abducted and killed Madeleine McCann - something he denies.",
        "Content": "By Martin Brunt, crime correspondent, and Rob Hyde in Germany   The freed suspect in the Madeleine McCann case has spoken publicly for the first time since his release - but refused to discuss the mystery of the missing British toddler. In an exclusive Sky News interview, he hit out after trying to confront the prosecutor who has accused him of abducting and murdering Madeleine. Christian B, who cannot be fully identified under German privacy laws, travelled more than a hundred miles from a secret address to prosecutor Hans Christian Wolters' office, but was stopped from going in. The suspect said: \"I want them to stop this witch-hunt against me and give me back my life. \"I'm not feeling free. I have this ankle tag and I'm followed around by police 24/7, so I'm not feeling free.\" Mr Wolters has stated publicly that he has evidence, which he has not revealed, to show Christian B abducted and killed Madeleine, who vanished from her bed during a Portuguese holiday in 2007. But he said he doesn't have enough evidence to arrest or charge him. The suspect, who was released from a rape sentence two weeks ago, said: \"The prosecutor refused to meet me, but I told his representative I wanted his help to get my life back. \"I'm being hounded by the media and it's his fault. I want him to take responsibility. \"I was told there was nothing they could do to help. They said I had been convicted and released and I wasn't their responsibility.\" As he spoke, the electronic tag that has monitored his movements since his release was clearly visible above his right ankle. He has also had to surrender his passport and report regularly to probation staff. The suspect has not been arrested, charged or even questioned by German authorities about the Madeleine case. He's also refused to talk to Scotland Yard and Portuguese police, who are also involved in the investigation. Asked directly if he had abducted and killed Madeleine McCann, he said: \"My defence lawyers have told me to say nothing on this topic and unfortunately I have to abide by that.\" Christian B, 49, was driven from jail by his lawyer, Friedrich Fulscher, on 17 September and, since then, has lived in local authority accommodation in the town of Neumunster, north of Hamburg. Journalists quickly tracked him down and exposed his new address, prompting anger in the community from people worried about his convictions for child sex crimes. Local councillor Karin Mundt, of the hard-right populist movement Heimat Neumunster (Homeland Neumunster), took to Facebook to warn locals to be vigilant, not go out alone, and make sure that their children and elderly were safe. She also called for a public protest under the slogan 'Christian B out of Neumunster - tougher measures against child abusers and rapists to protect all citizens!' Germany operates draconian privacy laws, whereby even the media must get the consent of someone they photograph, or disguise their features.  Yet the group even decided to publish photos of Christian B, arguing that the danger he presents meant he was a public person of interest, and that they had to make sure that elderly people were able to recognise him. Two separate chat groups were set up, one dedicated to campaigning for Christian B to be booted out of Neumunster, the other to discuss alleged sightings of him. 'Out for a steak' Some claimed that Christian B had turned up near schools and that the police were called round, though other people said they worked at these schools, and that no police had been there. A woman at Domino's pizza claimed he had turned up in a false beard, yet just days later her colleague said she had seen the pictures and she was unsure that it was Christian B. Throughout all this, a source close to Christian B's defence claimed he had not been out at all apart from to sort out his phone, and also once for a steak. On Wednesday, one chat even discussed gathering at the town hall in the evening, and police vans then turned up to try to prevent this. The language of the chat became ever bolder - with people openly posting addresses they were convinced he was living at - and, at one point, all people with English-sounding surnames were ejected from the group as people suspected they were journalists. Read more from Sky News:What we know about Christian BChristian B celebrates release with burger and cigaretteSky News tracks down woman at centre of hit-and-run theory Police moved Christian B out of Neumunster, and reports say he's since been spotted at a hotel in an unnamed town. In a recent interview with Germany's Stern magazine, Christian B's main lawyer, Dr Fulscher, said: \"The Braunschweig public prosecutor's office has fuelled this media campaign of prejudgement. \"It has told the public that it is certain it has the right person. Without presenting sufficient evidence or even allowing my client to inspect the files. \"I find this highly questionable from a constitutional point of view. In my opinion, the Braunschweig public prosecutor's office has made rehabilitation impossible.\" Prosecutor Mr Wolters told Sky News he'd been tipped off about the suspect's visit to his office in Braunschweig, near Hanover, and refused to speak to him. Christian B denies any involvement in Madeleine's disappearance."
    },
    {
        "title": "Almost two in three Labour members back Burnham over Starmer for leader, poll shows",
        "description": "Andy Burnham would beat Sir Keir Starmer among Labour members by two to one if there were a leadership contest today, an exclusive poll for Sky News reveals.",
        "url": "https://news.sky.com/story/almost-two-in-three-labour-members-back-burnham-over-starmer-for-leader-poll-show-13441078",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-andy-burnham-keir-starmer_7036271.jpg?20250929154749",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-09-29 14:20:00",
        "Headline": "The exclusive poll also reveals that around a third of Labour members polled no longer think Sir Keir Starmer is a good prime minister.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Andy Burnham would beat Sir Keir Starmer among Labour members by two to one if there were a leadership contest today, an exclusive poll for Sky News reveals. A poll of 704 Labour members taken a week ago by YouGov found that 62% would back Mr Burnham, and 29% would back Sir Keir. Just 9% don't know or would not vote. Mr Burnham has claimed some Labour MPs are asking him to stand for the leadership, and has used this conference to set out his stall, though there is not an obvious route for him to return to Parliament. Tap here for the latest from Labour Party conference If returned to the Commons, he would have to resign as Manchester Metro Mayor, with a Reform UK replacement in prime position to win the mayoralty. The poll reveals that around a third of Labour members polled no longer think that Sir Keir is a good prime minister, and would rather he did not fight the next election. Some 33% say he is doing a bad job, compared with 63% who think he is doing a good job. Even more - 37% - say Sir Keir should not take the party into the next election, while 53% say he should and 10% don't know. People are more likely to say that Labour is doing a good job than Sir Keir. \n                  More than half of Labour members do not want Starmer to lead party into next general election - poll\n                 \n                  Andy Burnham says Labour MPs want him to oust Starmer\n                 \n                  By-elections that shook up politics – could Andy Burnham be next?\n                  Mr Burnham is the favourite to succeed him by a long distance - the top pick of 54% of members. Next is Angela Rayner, the now-sacked deputy leader (10%), then Health Secretary Wes Streeting on 7%. Ex-leader, now energy secretary, Ed Miliband and foreign secretary Yvette Cooper are on 6%, and new home secretary Shabana Mahmood is on 2%. Mr Burnham comfortably beats all in a final round of voting, according to the poll. In the event that Mr Burnham was unable to stand, YouGov polled a number of head-to-head races. Wes Streeting beats Shabana Mahmood and Ed Miliband, but would lose to Angela Rayner and Yvette Cooper. Ms Mahmood would lose to Mr Miliband and Ms Cooper. And Ms Cooper would beat Mr Miliband. The poll also examined attitudes to the deputy leadership contest. The poll found 35% would back Lucy Powell and 28% would back Bridget Phillipson, while 30% do not know and 5% will not vote. Excluding 'don't know', this suggests Ms Powell is ahead of Ms Phillipson with 56% to 44% - a closer margin than some other pollsters. Broadly, members who back Ms Powell are less likely to support Sir Keir. The poll makes tough reading for Angela Rayner - 60% said she was right to resign, against 34% who said it was the wrong decision."
    },
    {
        "title": "Cyber attacks: '80%' of ransomware victims pay up, insurer says",
        "description": "The vast majority of companies hit by ransomware attacks over the past year have paid up, according to an insurance specialist's report that warns of mixed outcomes for those who do.",
        "url": "https://news.sky.com/story/cyber-attacks-80-of-ransomware-victims-pay-up-insurer-says-13441131",
        "image_url": "https://e3.365dm.com/23/01/1920x1080/skynews-ransomware-cyber-attack_6022990.jpg?20230113194459",
        "type": "UK",
        "Author": "James Sillars",
        "Date Published": "2025-09-29 15:15:00",
        "Headline": "Hackers are said to be increasingly targeting sensitive business data including intellectual property because they see a chance of greater financial rewards.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The vast majority of companies hit by ransomware attacks over the past year have paid up, according to an insurance specialist's report that warns of mixed outcomes for those who do. Business-to-home insurer Hiscox released its annual Cyber Readiness Report against a backdrop of concern over a series of cyber attacks on high profile names over the past six months, including Marks and Spencer, the Co-op and Jaguar Land Rover (JLR). The carmaker has been handed a £1.5bn loan guarantee by the government to help shield its vast supply chain, including many small firms, from the impact of a month-long shutdown of its factories. While some have already laid off staff - a fraction of the 200,000 people employed among suppliers - many victims of hackers are small and medium-sized businesses (SMEs) that would not attract such financial support by themselves. There are no lengths to which cyber criminals will stoop - with hackers just last week threatening to release the personal data of children in the care of a nursery chain.  Hiscox said 27% of the 5,750 SMEs surveyed had been targeted with ransomware over the last 12 months. Of those, 80% had paid a ransom. But Hiscox added that only 60% of those companies had successfully recovered all or part of their data after making a payment. Almost a third of the firms to have paid a ransom were met with demands for more money, it said. Attacks 'threaten survival' of firms The wider findings of the study showed that almost 60% of the companies surveyed had experienced a cyber attack in the period, with many blaming artificial intelligence vulnerabilities for leaving them exposed. Many faced substantial fines for failures to adequately protect data and the findings also showed hits to not only bottom lines but reputations and orders too. Eddie Lamb, global head of cyber at Hiscox, said: \"No business, however small, can afford to underestimate the devastating impact a cyber-attack can have. \"Cyber attacks don't just disrupt day-to-day operations; they can threaten the very survival of a business. \"The financial fall-out, from crippling fines to lost customers or soaring costs, can push even the most resilient business to the brink. On top of this, the stress and long hours required to recover can impact staff morale and even lead to burnout.\"  JLR was reportedly in the process of finalising an insurance policy to cover cyber disruption when it was targeted at the end of August. The company is already facing an estimated bill of £200m from lost production. Henry Green, co-founder of the cyber insurance broker Assured, said policies had to reflect true levels of financial risk, or they were pointless. \"For £300-500m cover, JLR would have been looking at a circa £5m premium with at least a £10m excess,\" he said.  The costs of policies which cover all losses in the event of a cyber crime will be far beyond many firms, though the cyber insurance market is growing beyond major employers. That is partly due to the very public impact of disruption to the likes of M&S, heightened warnings over preparedness and increased competition in insurance provision.  The research specialist imarc says the market was worth £521m last year and expected to top £2.4bn by 2033.  M&S has estimated a hit of at least £300m from the ransomware attack on its business in mid-April. But the retailer, which is widely believed to have paid off its attackers, expects to claw the bulk of that sum back through its insurance policies. Read more from Sky News:Video game maker EA in record buyoutReeves fails to quell budget speculation Mr Lamb, who urged investment in protections, added: \"Cyber criminals are now much more focused on stealing sensitive business data – things like contracts, executive emails, financials, and intellectual property – because it’s easier to monetise than personal information. \"Once stolen, they demand payment to avoid public exposure, pricing threats based on reputational damage. \"This change has exposed gaps in some companies’ data loss prevention controls, which attackers are readily exploiting.\""
    },
    {
        "title": "Yadi Zhang: Woman pleads guilty to money laundering over £5bn Bitcoin seizure ",
        "description": "A woman has pleaded guilty to money laundering offences over the UK's biggest-ever cryptocurrency seizure of Bitcoin, currently worth more than &#163;5bn.",
        "url": "https://news.sky.com/story/yadi-zhang-woman-pleads-guilty-to-money-laundering-over-1635bn-bitcoin-seizure-13440930",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-yadi-zhang-zhimin-qian_7036400.jpg?20250929165009",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2025-09-29 11:16:00",
        "Headline": "The Chinese national, 47, was the alleged mastermind of a £5bn fraud before coming to the UK. ",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n A woman has pleaded guilty to money laundering offences over the UK's biggest-ever cryptocurrency seizure of Bitcoin, currently worth more than £5bn. Chinese national Yadi Zhang, 47, who is also known as Zhimin Qian, was arrested in April last year after spending years on the run. She first arrived in the UK on a false St Kitts and Nevis passport in September 2017 after allegedly carrying out a £5bn investment scam in China involving 130,000 investors in fraudulent wealth schemes between 2014 and 2017. Police first raided her £5m six-bedroom rented house near Hampstead Heath, in north London, on 31 October 2018. But it was another two and a half years before investigators discovered more than 61,000 Bitcoin in digital wallets - one of the biggest ever cryptocurrency seizures in the world. The cryptocurrency was worth £1.4bn at the time but its value has now risen to more than £5bn and the fortune is at the centre of an intense battle between the UK government and Chinese investors over who gets to keep it. The seized assets have reportedly been earmarked by Chancellor Rachel Reeves to help plug the hole in the public finances. \n                  Bitcoin achieves $120k milestone on Trump policy support\n                 \n                  Reform UK to accept crypto donations, Farage says\n                 \n                  Crypto prices rally after Trump names Bitcoin and others for US strategic reserve\n                 Zhang was due to face trial at Southwark Crown Court but has pleaded guilty to charges of possessing criminal property and transferring criminal property on or before 23 April 2024. She appeared in the dock wearing glasses and a beige cardigan over an animal print blouse, nodding to confirm her identity before entering her pleas with the help of a Mandarin interpreter. Judge Sally-Ann Hales remanded Zhang in custody ahead of sentencing at a later date. Prosecutor Gillian Jones KC said she would not apply to launch confiscation proceedings because of the ongoing proceedings in the High Court. Jian Wen, 43, was last year jailed for six years and eight months after being found guilty of one count of money laundering between October 2017 and January 2022 relating to 150 Bitcoin, now worth around £12.5m. Her trial heard Wen was not involved in the alleged fraud but was said to have acted as a \"front person\" to help disguise the source of the money, some of which had been used to buy cryptocurrency and smuggled out of China on laptops. Will Lyne, the Metropolitan Police's head of economic and cybercrime command, said Zhang's guilty pleas marked the culmination of \"years of dedicated investigation\". \"This is one of the largest money laundering cases in UK history and among the highest-value cryptocurrency cases globally,\" he said. Zhang's solicitor, Roger Sahota of Berkeley Square Solicitors, said: \"By pleading guilty today, Ms Zhang hopes to bring some comfort to investors who have waited since 2017 for compensation, and to reassure them that the significant rise in cryptocurrency values means there are more than sufficient funds available to repay their losses.\""
    },
    {
        "title": "Southport dance teacher Leanne Lucas tells inquiry that locking door wouldn't have stopped attack",
        "description": "The teacher who organised the Southport dance class where three children were murdered has told the public inquiry that \"multiple organisations\" could have stopped the killer and locking the door would not have made a difference.",
        "url": "https://news.sky.com/story/southport-dance-teacher-leanne-lucas-tells-inquiry-that-locking-door-wouldnt-have-stopped-attack-13441165",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-southport-victim_6809419.jpg?20250917171849",
        "type": "UK",
        "Author": "Duncan Gardham, security journalist",
        "Date Published": "2025-09-29 16:36:00",
        "Headline": "Ms Lucas said if the door had been locked and someone knocked on it, she would have assumed it was a parent and opened up.",
        "Content": "By Duncan Gardham, security journalist  The teacher who organised the Southport dance class where three children were murdered has told the public inquiry that \"multiple organisations\" could have stopped the killer and locking the door would not have made a difference. Leanne Lucas, 36, who was badly injured in the attack, said she had followed all the procedures and there was nothing she could or should have done differently to keep the children safe. The teacher said that if she had known there was a risk to the children she would never have organised the event, and called on authorities to make educators aware so they can take \"informed decisions\". She was due to give evidence to the inquiry, but the hearing at Liverpool Town Hall was told she was \"not fit to give evidence\". In a statement, Ms Lucas said she had not held an event since and had not been able to resume her career as a primary school teacher, describing the \"huge toll\" the attack had taken on her mental wellbeing. The inquiry was looking at what security measures might have prevented the attack but heard there was no requirement for locked doors or video phone entry. Alice Aguiar, nine, Bebe King, six, and Elsie Dot Stancombe, seven, were killed at a Taylor Swift-themed dance class on 29 July last year by Axel Rudakubana, who was jailed for a minimum of 52 years. \n                  Taxi driver who left as Southport killer carried out knife attack 'regrets' not doing more\n                 \n                  Southport emergency crews initially sent to rendezvous point instead of attack scene\n                 \n                  Prince William praises 'remarkable legacies' of Southport victims' parents\n                 The class took place in an upstairs studio at the Hart Space, which had an unlocked communal door that also allowed access to a legal costs firm across the landing. The double wooden doors to the studio were also left unlocked so children could go to the toilet and parents could pick up and drop off their children, the inquiry was told. Both doors also served as fire exits which had to be kept \"unobstructed and easy to open\". If the upstairs door had been locked and someone had knocked on it, Ms Lucas said she would have opened the door, \"assuming it to be an arriving parent\". She had been a primary school teacher for 15 years, was qualified, knew the venue and had conducted a risk assessment. If the inquiry were to conclude that intercom facilities and cameras were required for a small community activity, the government would need to provide funding, she said. Asked if the right \"guidance and resources\" were available to organise the event, Ms Lucas said: \"In hindsight, I cannot possibly now say it was adequate. \"Nothing ever advised me that I should plan for what to do if the workshop came under attack - if it had, I simply would not have held such an event. \"Despite having all the required documentation aligned with guidelines, this was all irrelevant when faced with an unforeseen life or death situation.\" The inquiry has heard that Rudakubana had been excluded from one school after taking a knife into school and attacking a pupil with a hockey stick and was referred to the Prevent de-radicalisation scheme three times for viewing violent material online. Ms Lucas said it was \"a situation that should have been under control and prevented by multiple organisations and services that keep the general public safe - those organisations and services have let me down\". Nicholas Moss KC, for the inquiry, reading from her statement, said: \"Had she known there was someone who was planning on killing children, she would not have organised a club. \"She would not have delivered the workshop if she had foreseen it as even a possibility.\" Read more from Sky News:COVID inquiry hears kids spent '19 hours a day' on online gamesMet officers could be forced to reveal if they are Freemasons Activity providers could be quality assured and held on a database that could then be alerted, and the council and the police notified where and when each activity takes place, so they can communicate in the event of an emergency, she said. Giving earlier evidence, Ms Lucas said she had received \"relentless\" online abuse and added: \"Each cruel word drags me back when I try to take a step forward.\" \"There is no 'getting over it', only learning how to carry on.\" The inquiry continues on Tuesday."
    },
    {
        "title": "Government under pressure as Labour members vote to accept Israel committing genocide in Gaza",
        "description": "Labour Party members have voted to accept that a genocide is taking place in Gaza by Israel - putting pressure on the UK government to also do so.",
        "url": "https://news.sky.com/story/government-under-pressure-as-labour-members-vote-to-accept-israel-committing-genocide-in-gaza-13441074",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-israeli-border-gaza_7035769.jpg?20250929092910",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-29 14:19:00",
        "Headline": "Israel has repeatedly denied the genocide allegation and called a recent UN commission of inquiry report \"distorted and false\".",
        "Content": "Labour Party members have voted to accept that a genocide is taking place in Gaza by Israel - putting pressure on the UK government to also do so. Members voted to approve an emergency motion at Labour's conference in Liverpool to accept the findings of the UN commission of inquiry, which nearly two weeks ago concluded Israel \"has committed genocide\". Israel has repeatedly denied this allegation and called the report \"distorted and false\". Gaza latest: Netanyahu backs Trump's peace plan The vote will place further pressure on the UK government after Sir Keir Starmer and his ministers have refused to declare a genocide is taking place. They have argued that the issue is a matter for the courts, with Israel fighting a case at the International Court of Justice (ICJ) in The Hague in which the country is accused of genocide. Speaking after the conference vote, which was heavily backed by the unions, Deputy Prime Minister David Lammy reiterated that position, saying he believed in \"the rules-based order\". \n                  Praise and fury for Trump's Gaza peace deal - but Hamas's first reaction is telling\n                 \n                  What we know about the Gaza peace plan – and what Sky News correspondents make of it\n                 \n                  Netanyahu backs Trump's peace plan for Gaza - as role for Blair revealed\n                 \"That means that it must be for the ICJ with their judges and judiciary, and for the ICC, to determine the issue of genocide in relation to the convention, it is not for politicians like me to do that,\" he said. \"But it is for the public to look at what they see and come to their own judgments about what they see.\" He added that last year, when he was foreign secretary, he had decided \"that I did see a clear risk that Israel was breaching international humanitarian law\" and had suspended arms sales to Israel. Israel's foreign ministry hit out at the decision, posting on X: \"While Prime Minister Netanyahu and President Trump are working tirelessly in Washington to end the war in Gaza, the UK Labour Party chooses to embrace Hamas and fully adopt its lies, including the fake-genocide campaign.\" \"The world stands with the US and Israel in their efforts to end the war. \"Labour stands with Hamas. It is a disgrace for Britain that this is the party in power.\" The Jewish Labour Movement group said it is \"hugely disappointed\" about the vote, which it credited to \"union votes\", and said it neglected to mention the October 7th attack or Hamas \"and barely pays lip service to the 48 hostages held by terrorists in Gaza\". It said the motion \"is not the route to the two-state solution\" and urged the government to \"continue to pursue a path of peace for all Israelis and Palestinians\". After the UN Commission of Inquiry on the Occupied Palestinian Territory released its report, the UK government said its official position is that it \"has not concluded that Israel is acting with that [genocidal] intent\". The report found there are reasonable grounds to conclude that four of the five genocidal acts defined under international law have been carried out since the start of the war with Hamas in 2023. They are: killing members of a group, causing them serious bodily and mental harm, deliberately inflicting conditions calculated to destroy the group, and preventing births. Although other UN bodies and personnel have previously linked Israel's actions with allegations of genocide, it was the first time any UN body has claimed to have made a definitive judgement. The world's leading association of genocide scholars, as well as several Israeli human rights organisations, had already accused the country of genocide before the UN commission report."
    },
    {
        "title": "Harry Potter author JK Rowling hits out at Emma Watson in fresh clash over transgender issues",
        "description": "JK Rowling has accused Emma Watson of being \"ignorant of how ignorant she is\" amid their ongoing disagreement about transgender issues.",
        "url": "https://news.sky.com/story/harry-potter-author-jk-rowling-hits-out-at-emma-watson-in-fresh-clash-over-transgender-issues-13441122",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-j-k-rowling-emma-watson_7036298.jpg?20250929160040",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-29 15:17:00",
        "Headline": "The Hermione Granger actress discussed her relationship with JK Rowling on a podcast last week - and the author has now hit back in a lengthy social media post. ",
        "Content": "JK Rowling has accused Emma Watson of being \"ignorant of how ignorant she is\" amid their ongoing disagreement about transgender issues. The Harry Potter films' three central stars - Watson, Daniel Radcliffe and Rupert Grint - have publicly backed the rights of transgender people in recent years, often distancing themselves from the author when asked about her in interviews. Rowling, 60, has previously been accused of transphobia, which she denies. Watson, 35, discussed her relationship with the writer on a podcast last week, telling host Jay Shetty: \"I think it's my deepest wish that I hope people who don't agree with my opinion will love me, and I hope I can keep loving people who I don't necessarily share the same opinion with.\" Rowling has now shared a more than 600-word post on X in response to Watson, in which she states: \"Like other people who've never experienced adult life uncushioned by wealth and fame, Emma has so little experience of real life she's ignorant of how ignorant she is.\" The author went on to say the Hermione Granger actress is never going to need a homeless shelter or be placed on a mixed-sex public hospital ward. The multimillionaire author said that \"I lived in poverty while writing the book that made Emma famous\" and therefore \"understand from my own life experience what the trashing of women's rights in which Emma has so enthusiastically participated means to women and girls without her privileges\". \n                  Harry Potter: Casting opens for next Harry, Ron and Hermione for TV adaptation\n                 \n                  Chad Michael Busto: 'Stalker' who barged into dressing room and yelled 'I want to marry Emma Watson' arrested\n                 \n                  British LGBT Awards: Joe Lycett, Harry Styles, Rod Stewart and Alex Scott among 2023 nominees\n                 Rowling added that while she has found it \"hard to shake off a certain protectiveness\" towards the Harry Potter stars, who she has known since they were children, there was a \"turning point\" in her relationship with Watson in 2022. She said this happened when Watson gave a Bafta speech saying \"I'm here for all the witches\", which some saw as a criticism of the author's beliefs on gender. The actress then asked someone to deliver her a handwritten note saying \"I'm so sorry for what you're going through\", the author claimed on X. Rowling said this came at a time \"when the death, rape and torture threats against me were at their peak\" and \"Emma had just publicly poured more petrol on the flames, yet thought a one line expression of concern from her would reassure me of her fundamental sympathy and kindness\". Read more:Is Eurovision heading for a crisis?Older brother of Oasis stars denies rape Watson has often publicly disagreed with Rowling. In 2020, she was one of several Harry Potter stars who showed their support for the trans community when the author shared a series of divisive posts online. \"I want my trans followers to know that I and so many other people around the world see you, respect you and love you for who you are,\" the actress wrote at the time."
    },
    {
        "title": "Netanyahu backs Trump's peace plan for Gaza - as role for Blair revealed",
        "description": "The White House has unveiled its peace plan for Gaza &#8211; which includes a senior role for Sir Tony Blair.",
        "url": "https://news.sky.com/story/white-house-unveils-gaza-peace-plan-with-top-role-for-tony-blair-13441219",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump-benjamin-netanyahu_7036550.jpg?20250929201802",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-29 18:34:00",
        "Headline": "Donald Trump singled out Sir Tony Blair for praise as he announced a 'Board of Peace' that will temporarily govern Gaza if Israel and Hamas agree to the peace deal. ",
        "Content": " The White House has unveiled its peace plan for Gaza – which includes a senior role for Sir Tony Blair. The 20-point plan was released by the US government just minutes before Donald Trump and Benjamin Netanyahu held a joint news conference on Monday evening. As it happened: Trump unveils peace plan The plan states that if the fighting ends, Gaza will be placed under the control of a transitional government headed by Mr Trump and others, including former British prime minister Sir Tony. The president described him as a \"good man\", while the ex-Labour leader commended the \"bold\" plan. It says Gaza will \"be a deradicalised terror-free zone that does not pose a threat to its neighbours\", with no role for Hamas in its future governance, and will be \"redeveloped for the benefit of\" its people. It also says nobody will be forced to leave Gaza and states there will be increased aid to the enclave. Israel will not occupy or annex Gaza, it says. The remaining Israeli hostages being held by Hamas must be released within 72 hours, the plan states. It says this will be followed by Israel releasing Palestinian prisoners. Read more: What we know about Trump's plan Speaking at the White House, Israel's Prime Minister Netanyahu said to Mr Trump: \"I support your plan to end the war in Gaza which achieves our war aims.\" \"It will bring back to Israel all our hostages, dismantle Hamas's military capabilities and its political rule, and ensure that Gaza never again poses a threat to Israel,\" he said. Hamas said on Monday evening it only received the peace plan after it was unveiled at the White House. It has said it cannot sign up to anything that does not include Palestinian self-determination, and has dismissed any disarmament so long as Israeli occupation of Gaza continues. Adam Parsons analysis: Hamas' first reaction is telling  Sir Keir Starmer said the initiative is \"profoundly welcome\" and he is \"grateful\" for Mr Trump's leadership. \"We strongly support his efforts to end the fighting, release the hostages and ensure the provision of urgent humanitarian assistance for the people of Gaza,\" said the British prime minister. \"This is our top priority and should happen immediately.\" The Israeli foreign ministry earlier took a swipe at the UK for Labour Party members voting to accept Israel is committing genocide in Gaza, which has placed pressure on the government to do the same. \"The world stands with the US and Israel in their efforts to end the war,\" it said. \"Labour stands with Hamas. It is a disgrace for Britain that this is the party in power.\"  Blair 'a good man', says Trump The US president singled out Sir Tony for praise, labelling him a \"good man\" as he named him one of the political figures who would be on Gaza's transitional governing body. Mr Trump said \"leaders that are very distinguished\" would be on the board, adding: \"And one of the people that wants to be on the board is the UK former prime minister Tony Blair. Good man, very good man. And some others.\" Mr Trump said the body will be called the \"Board of Peace\", with other members to be named in the coming days. Sir Tony attended a meeting with Mr Trump and others to discuss the future of Gaza in August. Read more:Destruction of Gaza hospital witnessed by nurseDiplomats walk out as Israeli PM speaks at UN Chief political correspondent Blair has been one of the \"key architects\" of the peace plan, including visiting the White House in recent months. His history in the Middle East - the invasion of Iraq in 2003 - hangs over him, but the former PM does have experience in the area. Going back to the 1990s, nearly 30 years ago, he was involved in talks with PLO leader Yasser Arafat and others to try to bring peace to the Middle East. \n\n When he left Number 10 in 2007, he became a Middle East envoy for what was known as the quartet - the EU, US, Russia and the United Nations.  He gets on well with Benjamin Netanyahu - that's another crucial factor. While many in Labour will not be happy with Blair's involvement, it is clear to see why the likes of Netanyahu and Trump will approve of it. This is because Blair is an experienced negotiator and power broker in the region. Think back to the Good Friday Agreement, his role in Kosovo and Sierra Leone - he's always wanted to tackle these seemingly intractable international problems.  After resigning as prime minister in 2007, Sir Tony was appointed as the international community's special envoy to the Middle East with the goal of helping develop the Palestinian economy and institutions in order to prepare the groundwork for a Palestinian state. However, he struggled to deliver dramatic changes in the role and resigned in 2015. In a statement issued after the White House's announcement, Sir Tony said the US plan is \"bold and intelligent\". \"It offers us the best chance of ending two years of war, misery, and suffering and I thank President Trump for his leadership, determination and commitment,\" he said. World leaders welcome Trump's plan  In a joint statement, the foreign ministers of Saudi Arabia, Jordan, the United Arab Emirates, Qatar, and Egypt welcomed the plan. The ministers - along with their counterparts from Pakistan, Turkey, and Indonesia - said they were ready to cooperate positively with the US and other relevant parties."
    },
    {
        "title": "Moldova's ruling pro-EU party wins parliamentary elections against Russia-leaning rivals",
        "description": "Moldova's pro-EU party has secured a strong win against its Russia-leaning rival in what has been described as the most consequential election since the country's independence.",
        "url": "https://news.sky.com/story/moldovas-ruling-pro-eu-party-takes-lead-in-parliamentary-elections-against-russia-leaning-rivals-13440763",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-pas-moldova_7035792.jpg?20250929094130",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-29 06:00:00",
        "Headline": "With more than 99% of votes counted, Moldova's ruling party, namely the Party of Action and Solidarity (PAS), had a share of 49.99%, versus 24.28% for the Patriotic Bloc, which opposes closer ties with Brussels.",
        "Content": "Moldova's pro-EU party has secured a strong win against its Russia-leaning rival in what has been described as the most consequential election since the country's independence. With all votes counted, Moldova's ruling party, the Party of Action and Solidarity (PAS), had a share of 50.2%, versus 24.2% for the Patriotic Bloc, which opposes closer ties with Brussels. Holding a majority in the 101-seat chamber allows PAS to keep pushing for its goal of joining the EU. If it had fallen short, it would have had to try to form a coalition with smaller parties. The Patriotic Bloc aims to steer the nation - a former Soviet republic - away from closer ties with Brussels and the EU. Moldova's pro-Western president Maia Sandu, who wants the country to join the EU by 2030, reiterated long-held claims that Russia has interfered with elections. After casting her ballot, she said: \"Russia poses a danger to our democracies. Our democracy is young and fragile, but that does not mean that states with longer democracies are not in danger. \n                  Ex-lawyer can be extradited to Moldova over 'murder of Tottenham Turks gang boss', judge rules \n                 \n                  Ex-lawyer fighting extradition 'over Tottenham Turks gang boss murder fears revenge attack'\n                 \n                  Moldova's pro-EU president wins second term after defeating pro-Russian rival in election\n                 \"We want to live in a democracy.\" The Kremlin reacted on Monday by accusing the authorities in Moldova of preventing hundreds of thousands of Moldovans living in Russia from voting and, asked whether Moscow recognised the results, spokesman Dmitry Peskovnoted that some political forces in Moldova had spoken of violations. Europe correspondent The election victory for Maia Sandu appears to be decisive and a clear decision by the Moldovan people to choose a future closer to Europe over Russia.  Despite fears that Moscow and pro-Russian parties would try to disrupt the election, the turnout was higher than previous elections and the pro-Europe governing party has increased its position in parliament avoiding the need to join with other parties to form a coalition.\n  It will also give Sandu, as president, greater hope of pushing the appointment of a loyal prime minister through parliament. Pro-Russian parties are, unsurprisingly, claiming the election was rigged and there could still be protests on the streets. Moldova is a key priority for Moscow after Ukraine and \"threw everything it had\" at the election according to a senior Moldovan politician - this result will be a severe blow to the Kremlin. There will have been a sigh of relief at the outcome in Brussels and other European capitals however – Vladimir Putin regards Moldova, which borders Ukraine, as within his sphere of influence and success for a pro-Russian party would have caused real problems for the bloc.  The President of the European Commission, Ursula von der Leyen, welcomed the result by telling Moldova \"our door is open\" to EU membership, but accession to the bloc still has plenty of hurdles ahead, including the issue of Transnistria, a small separatist enclave within Moldova where around 1,500 Russian troops are stationed.  In the build up to the election, Prime Minister Dorin Recean warned that Russia was spending \"hundreds of millions\" of euros as part of an alleged hybrid war to try to seize power, which he described as \"the final battle for our country's future\". PAS leaders, including the party's leader Igor Grosu, have called vote the most consequential in Moldova since independence. Moscow has always denied meddling and says the government is spreading anti-Russian hysteria to win votes. Read more from Sky News: 'I'm not so careful with what I say' - Trump's jaw-dropping weekThis was the most abusive Ryder Cup in almost a century of matches Election day itself was marked by a string of incidents, ranging from bomb threats at multiple polling stations abroad to cyber attacks on electoral and government infrastructure. Police also detained three people suspected of plotting to cause unrest after the vote. 'A path of freedom' British Prime Minister Sir Keir Starmer said on X: \"Congratulations to President Maia Sandu on her decisive election victory. \"Despite Russia's attempts to undermine Moldova's democracy, the people of Moldova have chosen a path of freedom.\" French President Emmanuel Macron hailed the apparent results of the elections as he said on X: \"Despite attempts at interference and pressure, the choice of Moldovan citizens has been strongly affirmed. \"France stands alongside Moldova in its European project and its drive for freedom and sovereignty.\" EU Commission President Ursula von der Leyen said: \"Moldova, you've done it again.\" Why would Russia want to interfere? Moldova is landlocked between Ukraine and Romania. The country of about 2.5 million people has spent recent years on a Westward path and gained candidate status to the EU in 2022, shortly after Russia launched a full-scale invasion of Ukraine. If Moldova becomes a permanent EU member, it would mean a distancing from Moscow, as the EU has offered support to Ukraine and has put various sanctions in place against Russia. However, candidate status does not guarantee a country membership to the EU. In order for a country to become a full member, candidates must adopt democratic norms and undertake reforms to meet EU rules, regulations and standards. All EU governments then have to agree before that country can be admitted as an EU member. The Organisation for Security and Co-operation in Europe, which often monitors elections to ensure they are fair, said Moldova's parliamentary vote was competitive but marred by serious cases of foreign interference. Paula Cardoso, co-coordinator of the OSCE's short-term observer mission, said Moldova's decision to exclude two parties just days before the vote undermined \"legal certainty of the contestant status and limited their right to seek effective remedy\"."
    },
    {
        "title": "Christian B: Freed Madeleine McCann suspect pleads 'give me back my life' as he tries to confront prosecutor",
        "description": "The freed suspect in the Madeleine McCann case has spoken publicly for the first time since his release - but refused to discuss the mystery of the missing British toddler.",
        "url": "https://news.sky.com/story/christian-b-freed-madeleine-mccann-suspect-pleads-give-me-back-my-life-as-he-tries-to-confront-prosecutor-13440814",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-christian-b-prosucator_7035939.jpg?20250929174147",
        "type": "World",
        "Author": "Martin Brunt, crime correspondent, and Rob Hyde in Germany",
        "Date Published": "2025-09-29 10:20:00",
        "Headline": "Hans Christian Wolters has alleged he has evidence showing Christian B abducted and killed Madeleine McCann - something he denies.",
        "Content": "By Martin Brunt, crime correspondent, and Rob Hyde in Germany   The freed suspect in the Madeleine McCann case has spoken publicly for the first time since his release - but refused to discuss the mystery of the missing British toddler. In an exclusive Sky News interview, he hit out after trying to confront the prosecutor who has accused him of abducting and murdering Madeleine. Christian B, who cannot be fully identified under German privacy laws, travelled more than a hundred miles from a secret address to prosecutor Hans Christian Wolters' office, but was stopped from going in. The suspect said: \"I want them to stop this witch-hunt against me and give me back my life. \"I'm not feeling free. I have this ankle tag and I'm followed around by police 24/7, so I'm not feeling free.\" Mr Wolters has stated publicly that he has evidence, which he has not revealed, to show Christian B abducted and killed Madeleine, who vanished from her bed during a Portuguese holiday in 2007. But he said he doesn't have enough evidence to arrest or charge him. The suspect, who was released from a rape sentence two weeks ago, said: \"The prosecutor refused to meet me, but I told his representative I wanted his help to get my life back. \"I'm being hounded by the media and it's his fault. I want him to take responsibility. \"I was told there was nothing they could do to help. They said I had been convicted and released and I wasn't their responsibility.\" As he spoke, the electronic tag that has monitored his movements since his release was clearly visible above his right ankle. He has also had to surrender his passport and report regularly to probation staff. The suspect has not been arrested, charged or even questioned by German authorities about the Madeleine case. He's also refused to talk to Scotland Yard and Portuguese police, who are also involved in the investigation. Asked directly if he had abducted and killed Madeleine McCann, he said: \"My defence lawyers have told me to say nothing on this topic and unfortunately I have to abide by that.\" Christian B, 49, was driven from jail by his lawyer, Friedrich Fulscher, on 17 September and, since then, has lived in local authority accommodation in the town of Neumunster, north of Hamburg. Journalists quickly tracked him down and exposed his new address, prompting anger in the community from people worried about his convictions for child sex crimes. Local councillor Karin Mundt, of the hard-right populist movement Heimat Neumunster (Homeland Neumunster), took to Facebook to warn locals to be vigilant, not go out alone, and make sure that their children and elderly were safe. She also called for a public protest under the slogan 'Christian B out of Neumunster - tougher measures against child abusers and rapists to protect all citizens!' Germany operates draconian privacy laws, whereby even the media must get the consent of someone they photograph, or disguise their features.  Yet the group even decided to publish photos of Christian B, arguing that the danger he presents meant he was a public person of interest, and that they had to make sure that elderly people were able to recognise him. Two separate chat groups were set up, one dedicated to campaigning for Christian B to be booted out of Neumunster, the other to discuss alleged sightings of him. 'Out for a steak' Some claimed that Christian B had turned up near schools and that the police were called round, though other people said they worked at these schools, and that no police had been there. A woman at Domino's pizza claimed he had turned up in a false beard, yet just days later her colleague said she had seen the pictures and she was unsure that it was Christian B. Throughout all this, a source close to Christian B's defence claimed he had not been out at all apart from to sort out his phone, and also once for a steak. On Wednesday, one chat even discussed gathering at the town hall in the evening, and police vans then turned up to try to prevent this. The language of the chat became ever bolder - with people openly posting addresses they were convinced he was living at - and, at one point, all people with English-sounding surnames were ejected from the group as people suspected they were journalists. Read more from Sky News:What we know about Christian BChristian B celebrates release with burger and cigaretteSky News tracks down woman at centre of hit-and-run theory Police moved Christian B out of Neumunster, and reports say he's since been spotted at a hotel in an unnamed town. In a recent interview with Germany's Stern magazine, Christian B's main lawyer, Dr Fulscher, said: \"The Braunschweig public prosecutor's office has fuelled this media campaign of prejudgement. \"It has told the public that it is certain it has the right person. Without presenting sufficient evidence or even allowing my client to inspect the files. \"I find this highly questionable from a constitutional point of view. In my opinion, the Braunschweig public prosecutor's office has made rehabilitation impossible.\" Prosecutor Mr Wolters told Sky News he'd been tipped off about the suspect's visit to his office in Braunschweig, near Hanover, and refused to speak to him. Christian B denies any involvement in Madeleine's disappearance."
    },
    {
        "title": "'Are you watching, Donald Trump?': US president responds to Team Europe's Ryder Cup taunt",
        "description": "Donald Trump has responded to a taunting video message from the celebrating Europe Ryder Cup team following their thrilling victory in the biannual competition.",
        "url": "https://news.sky.com/story/are-you-watching-donald-trump-us-president-responds-to-team-europes-ryder-cup-taunt-13440883",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-ryder-cup_7036232.jpg?20250929144300",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-29 10:21:00",
        "Headline": "The US president is a big golf fan and came to the course on the first day and shook hands with some of the players. After, cup in hand, the Europe team goaded him on social media, he responded: \"Yes, I'm watching. Congratulations!\"",
        "Content": " Donald Trump has responded to a taunting video message from the celebrating Europe Ryder Cup team following their thrilling victory in the biannual competition. Cup in hand, the Europe team, all still dressed in their final-day outfits, chanted: \"Are you watching, are you watching, are you watching, Donald Trump?\" It appeared as a phone video on Mr Trump's Truth Social platform at 2.40am, UK time, with the message \"Yes, I'm watching. Congratulations!\" The friendly exchange between the US president, a big golf fan and frequent player of the game who came to the first day's play, and Europe's players was in stark contrast to the on-course atmosphere they faced. Rory McIlroy was often the target of boos and heckles at the Bethpage Black course in New York State - some of which were led by the Ryder Cup first-tee announcer over a megaphone on Saturday. Heather McMahan encouraged a chant of \"f*** you Rory\" ahead of Saturday's morning session. She has apologised and stepped down from her role, the PGA of America said on Sunday. Later on Saturday, the Northern Irishman hit back by telling a spectator to \"shut the f*** up\" while his teammate Shane Lowry was seen being held back by his caddie as he tried to confront someone. \n                  YouTube to settle lawsuit with Trump over account suspension\n                 \n                  Netanyahu backs Trump's peace plan for Gaza - as role for Blair revealed\n                 \n                  'I'm not so careful with what I say' - is Trump feeling more invincible than ever?\n                 In another clash, America's Bryson DeChambeau confronted Europe's Justin Rose after he asked DeChambeau's caddie to move while he was lining up a putt. Multiple spectators were thrown out of the event over their behaviour. McIllroy, the world number two, also revealed his wife Erica had beer thrown at her on Saturday, but said she was \"fine\".   Play was repeatedly held up as police tried to restore calm on the course and, speaking to reporters after the win was complete, the Northern Irishman said in what may have been a joke: \"I wish they had let the dogs off the leashes. \"The police out there and the amount of security presence was insane. \"Look, nothing was going to happen - there wasn't going to be physical altercation or anything like that - but there was a lot of language that was unacceptable and abusive behaviour. \"The majority of people here are true golf fans and are respectful, but I don't think we should ever accept that in golf.\" Read more on the Ryder Cup:Europe parties after winThe 'most abusive' Ryder Cup \"Golf teaches you very good life lessons, it teaches you etiquette, it teaches you how to play by the rules, it teaches you how to respect people. \"Sometimes this week we didn't see that. So no, this should not be what is acceptable in the Ryder Cup.\" The Europe team posted a number of videos on X as they celebrated their triumph, the first by a visiting team in the event since 2012. In one, the team sings \"Europe's on fire, the USA is terrified\" to the tune of Freed From Desire, while a second is a team sing-along to The Cranberries' Zombie, with \"he's in your head, Rory.\" Europe's team, led by British two-time captain Luke Donald, won by 15 points to 13, after the USA staged an unforgettable comeback that threatened to derail Europe's seemingly inevitable success following a dominant opening two days' play."
    },
    {
        "title": "Three found dead in home in Ireland - as man in his 30s arrested",
        "description": "Irish police are investigating the deaths of three people in County Louth.",
        "url": "https://news.sky.com/story/three-found-dead-in-home-in-ireland-as-man-in-his-30s-arrested-13440907",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-tallanstown-murder_7036279.jpg?20250929155308",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-29 10:56:00",
        "Headline": "Police are urging anyone with information about the incident to get in contact. Post-mortem examinations are scheduled for Tuesday.",
        "Content": "Irish police are investigating the deaths of three people in County Louth. Officers were called to a house in Drumgowna, Tallanstown, on Monday morning, where a man and woman in their 50s and a man in his 20s were found dead. A man in his 30s was arrested and is still in custody. The scene has been cordoned off for forensic work and post-mortem examinations are scheduled for Tuesday. Sinn Fein TD for Louth, Ruairi O Murchu, said: \"My first thoughts, and those of everyone else, are with the loved ones of this family who have been violently killed in their home. \"This is a truly shocking and appalling incident which has absolutely stunned the whole community all over County Louth. \"The fact that three members of one family seem to have died in dreadful and violent circumstances on a Monday morning in a quiet and rural area of Mid-Louth is appalling. \"I would appeal for anyone with information to go to the Gardaí immediately, and ask that people do not speculate on this incident online or on social media.\" Read more from Sky News:Freed suspect in McCann case tries to confront prosecutorAt least four killed after church set on fire during shooting Pearse McGeough, Sinn Fein councillor for the Louth and the Ardee/Mid-Louth area, posted on X: \"Very sad news coming out of Tallanstown this morning. \"I would ask people not to speculate until we know the facts. Our thoughts are with the friends, family and the community.\""
    },
    {
        "title": "Denmark bans civilian drones as it ramps up security ahead of EU summit - as Sweden and France contribute equipment",
        "description": "Denmark has banned all civilian drone flights in its airspace this week as the country gets ready to host major European summits in Copenhagen.",
        "url": "https://news.sky.com/story/denmark-bans-civilian-drones-as-it-ramps-up-security-ahead-of-eu-summit-as-sweden-and-france-contribute-equipment-13440812",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-copenhagen-airport_7028910.jpg?20250922213743",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-29 08:15:00",
        "Headline": "Sweden and France will be contributing to Denmark's security as it gets ready to host EU leaders on Wednesday. It comes after drone sightings forced several Danish airports to shut last week.",
        "Content": "Denmark has banned all civilian drone flights in its airspace this week as the country gets ready to host major European summits in Copenhagen. The decision by the Danish transportation ministry to prohibit drones from today until Friday, 3 October, comes after drone sightings forced several airports in Denmark to shut last week. It also follows drone sightings at several military facilities overnight into Sunday, as well as NATO's recent announcement that it would enhance its vigilance in the Baltic Sea region. Denmark is due to host EU leaders on Wednesday, followed by a summit on Thursday of the wider, 47-member European Political Community - which includes the UK - and has already said it has increased security around the events after the drone incursions. Swedish Prime Minister Ulf Kristersson said in a post on X that Sweden will send technology to counter unmanned aircraft systems and that his country separately on Sunday had also shipped \"a handful\" of radar systems to Denmark. France will also be contributing to Denmark's anti-drone capabilities, said the French armed forces ministry on Monday. The French government said it would be helping out Denmark via the use of a Fennec helicopter, as well as a team of 35 staff who would handle aspects of anti-drone work. \n                  Airport drone sightings: What we know, why it's dangerous, and can they be stopped?\n                 \n                  Denmark's Aalborg airport closes for second time after drones spotted - as minister says 'professional actor' trying to cause fear\n                 \n                  Copenhagen drone incursion fits Russian pattern, Danish PM says\n                 \"We are currently in a difficult security situation, and we must ensure the best possible working conditions for the armed forces and the police when they are responsible for security during the EU summit,\" Danish defence minister Troels Lund Poulsen said in a statement on Sunday. Earlier, on Sunday afternoon, the Danish defence ministry announced that Germany's air defence frigate, FSG Hamburg, had arrived in Copenhagen. \"The ship will contribute to strengthening Denmark's surveillance of the airspace in connection with the upcoming EU summit in Copenhagen,\" the ministry said in a statement. Read more from Sky News:Blow for Putin as Russia-leaning party struggles in Moldova electionPenny Lancaster says she felt 'belittled' by Gregg Wallace In Denmark, the civilian-military Aalborg airport was shut two nights in a row last Wednesday and Thursday, with planes grounded. Danish police said the drones followed a similar pattern to the ones that caused a shutdown at Copenhagen airport a few days earlier. Police said drones had also been observed near airports in the Danish towns of Esbjerg, Sonderborg and Skrydstrup - where Denmark's fleet of F-16 and F-35 fighter jets is based."
    },
    {
        "title": "Government under pressure as Labour members vote to accept Israel committing genocide in Gaza",
        "description": "Labour Party members have voted to accept that a genocide is taking place in Gaza by Israel - putting pressure on the UK government to also do so.",
        "url": "https://news.sky.com/story/government-under-pressure-as-labour-members-vote-to-accept-israel-committing-genocide-in-gaza-13441074",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-israeli-border-gaza_7035769.jpg?20250929092910",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-29 14:19:00",
        "Headline": "Israel has repeatedly denied the genocide allegation and called a recent UN commission of inquiry report \"distorted and false\".",
        "Content": "Labour Party members have voted to accept that a genocide is taking place in Gaza by Israel - putting pressure on the UK government to also do so. Members voted to approve an emergency motion at Labour's conference in Liverpool to accept the findings of the UN commission of inquiry, which nearly two weeks ago concluded Israel \"has committed genocide\". Israel has repeatedly denied this allegation and called the report \"distorted and false\". Gaza latest: Netanyahu backs Trump's peace plan The vote will place further pressure on the UK government after Sir Keir Starmer and his ministers have refused to declare a genocide is taking place. They have argued that the issue is a matter for the courts, with Israel fighting a case at the International Court of Justice (ICJ) in The Hague in which the country is accused of genocide. Speaking after the conference vote, which was heavily backed by the unions, Deputy Prime Minister David Lammy reiterated that position, saying he believed in \"the rules-based order\". \n                  Praise and fury for Trump's Gaza peace deal - but Hamas's first reaction is telling\n                 \n                  What we know about the Gaza peace plan – and what Sky News correspondents make of it\n                 \n                  Netanyahu backs Trump's peace plan for Gaza - as role for Blair revealed\n                 \"That means that it must be for the ICJ with their judges and judiciary, and for the ICC, to determine the issue of genocide in relation to the convention, it is not for politicians like me to do that,\" he said. \"But it is for the public to look at what they see and come to their own judgments about what they see.\" He added that last year, when he was foreign secretary, he had decided \"that I did see a clear risk that Israel was breaching international humanitarian law\" and had suspended arms sales to Israel. Israel's foreign ministry hit out at the decision, posting on X: \"While Prime Minister Netanyahu and President Trump are working tirelessly in Washington to end the war in Gaza, the UK Labour Party chooses to embrace Hamas and fully adopt its lies, including the fake-genocide campaign.\" \"The world stands with the US and Israel in their efforts to end the war. \"Labour stands with Hamas. It is a disgrace for Britain that this is the party in power.\" The Jewish Labour Movement group said it is \"hugely disappointed\" about the vote, which it credited to \"union votes\", and said it neglected to mention the October 7th attack or Hamas \"and barely pays lip service to the 48 hostages held by terrorists in Gaza\". It said the motion \"is not the route to the two-state solution\" and urged the government to \"continue to pursue a path of peace for all Israelis and Palestinians\". After the UN Commission of Inquiry on the Occupied Palestinian Territory released its report, the UK government said its official position is that it \"has not concluded that Israel is acting with that [genocidal] intent\". The report found there are reasonable grounds to conclude that four of the five genocidal acts defined under international law have been carried out since the start of the war with Hamas in 2023. They are: killing members of a group, causing them serious bodily and mental harm, deliberately inflicting conditions calculated to destroy the group, and preventing births. Although other UN bodies and personnel have previously linked Israel's actions with allegations of genocide, it was the first time any UN body has claimed to have made a definitive judgement. The world's leading association of genocide scholars, as well as several Israeli human rights organisations, had already accused the country of genocide before the UN commission report."
    },
    {
        "title": "The countries where digital ID already exists",
        "description": "As the UK gears up to make digital ID mandatory for all UK citizens, across the globe similar schemes already exist.",
        "url": "https://news.sky.com/story/the-countries-where-digital-id-already-exists-13441075",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-digital-id-stock-image_7036395.jpg?20250929164644",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-29 14:21:00",
        "Headline": "Sir Keir Starmer announced last week that all UK citizens are to have mandatory ID to prove their right to live and work in the country.",
        "Content": "As the UK gears up to make digital ID mandatory for all UK citizens, across the globe similar schemes already exist. Sir Keir Starmer announced last week that all UK citizens are to have mandatory ID to prove their right to live and work in the country, which will be kept in a 'wallet' similar to that of Apple Wallet or Google Wallet. The prime minister argued ID cards will ensure the UK's \"borders are more secure\", but the plan drew criticism from Labour's political opponents, including the Conservatives, Reform UK and the Liberal Democrats. While the success of the scheme remains to be seen, the government has said it is going to use the best aspects of digital IDs already being used in a handful of countries including Estonia, Denmark and India in its design. Click, zoom and scroll on the map below to see all the countries that already use digital ID, or are planning to implement similar technology: In the European Union, physical ID cards have existed for decades. In fact, in all bar two of the EU's 27 member states, physical ID cards, in a standard, machine-readable EU format introduced in 2021, are used both as identity documents in citizens' home countries, and for travel within the passport-free Schengen zone. The two exceptions are Denmark, which uses the digital identity and authentication app, MitID, and Ireland, which issues passport cards. Read more:What is a digital ID card?The pros and cons of digital IDs  However, by the end of 2026, the EU is hoping to roll out the Digital Identity (eID) Wallet, which it says is Europe's answer to the challenges of identification. The wallet will enable citizens of all EU member states to access online and offline public and private services, store and share digital documents, and create binding signatures. Large-scale pilot projects are currently testing how the EU Digital Identity Wallets will function in a wide range of situations, before it is launched across the EU. Over 350 companies and public authorities across 26 member states as well as Norway, Iceland and Ukraine are participating. In France, the France Identite app allows citizens to combine their identity card, driving licence and vehicle registration document in a single application."
    },
    {
        "title": "Ex-MI5 chief says those who think UK already at war with Russia 'may be right'",
        "description": "The former head of MI5 has said those who think the UK is already at war with Russia \"may be right\".",
        "url": "https://news.sky.com/story/ex-mi5-chief-says-those-who-think-uk-already-at-war-with-russia-may-be-right-13440392",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-vladimir-putin-russia_7035436.jpg?20250928203317",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-29 04:30:00",
        "Headline": "Baroness Manningham-Buller, MI5 director general from 2002 to 2007, recalled meeting Vladimir Putin after the G8 meeting in 2005, and said \"we all hoped that the past history of Russia wouldn't prevail... we were wrong in that\".",
        "Content": "The former head of MI5 has said those who think the UK is already at war with Russia \"may be right\". In June, UK defence advisor Dr Fiona Hill said that because of \"the poisonings, assassinations, sabotage operations, all kinds of cyber attacks and influence operations,\" it was fair to conclude \"Russia is at war with us\". Appearing on the House of Lords' official podcast, Baroness Manningham-Buller said: \"Dr Hill probably knows more about Putin than anybody else.\" Follow the latest on the war in Ukraine She added: \"Since the invasion of Ukraine, and the various things I read that the Russians have been doing here, sabotage, intelligence collection, attacking people, and so on... Fiona Hill may be right in saying we're already at war with Russia. \"It's a different sort of war, but the hostility, the cyber attacks, the physical attacks, intelligence work, is extensive.\" 'We were wrong' about Russia in 2005 \n                  Yadi Zhang: Woman pleads guilty to money laundering over £5bn Bitcoin seizure \n                 \n                  China does targets differently to the West - and it may be just what the world needs\n                 \n                  Renowned 'sponge city' architect Kongjian Yu dies in Brazil plane crash\n                 Baroness Manningham-Buller served in MI5 for 34 years, becoming director general in 2002 before retiring in 2007. Speaking to the Lord Speaker's Corner podcast, she recalled meeting Russian President Vladimir Putin after the G8 meeting in Gleneagles, Scotland. \"We all hoped that the past history of Russia wouldn't prevail, and, at the end of the Soviet Union, we would have a potential partner,\" she said, \"and that was one of the reasons why Putin was with us for the G8 in 2005.\" The former head of MI5 added: \"I met him when he came back to London. But actually, we were wrong in that, because Russia is extremely hostile to the West, and we've seen it in all sorts of ways. \"I didn't anticipate that within a year, he'd be ordering the murder on London streets of [Russian dissident Alexander] Litvinenko.\" Mr Litvinenko, a former FSB agent, died in 2006, almost three weeks after drinking tea poisoned with radioactive polonium-210, a rare and very potent radioactive isotope. Before fleeing Russia and being given British nationality, Mr Litvinenko had accused Mr Putin of corruption. It is understood that he ingested the tea during a meeting with two Russian spies at a London hotel. Read more: The critics of Vladimir Putin who met untimely deaths  Aid cuts 'leave space' for China The former intelligence chief also spoke about the West's soft power, recalling \"the HIV work funded by the Americans in Africa\" and noting that cutting foreign aid \"means that we leave space for your friendly Chinese diplomat\". She added: \"If we withdraw from the world, they can move in because they have a strong economic base, so I think soft power... whether it's the BBC World Service, whether it's aid, whether it's de-mining, all contribute importantly to our influence in the world, as well as being of humanitarian importance.\" Read more from Sky News:Police investigate Indian actor's campaign rally after 40 deadAt least two dead in Mormon church mass shooting and fireEgypt's 'strongman' wrestler pulls ship using his teeth War decorated pigeon and reading upside down In a more light-hearted note, Baroness Manningham-Buller shared that she can read upside down - saying \"it's a professional talent!\" - and that her mother bred carrier pigeons for intelligence during the Second World War. Sharing the story of Mary Manningham-Buller, later Viscountess Dilhorne, the baroness said: \"The pigeons were dropped in wicker baskets or little slings with parachutes to occupied France and (they) brought back messages strapped to their ankles, and she would then ring the War Office and somebody would come and collect the message. \"It was a story in our family, which I always thought must be apocryphal, that one of her pigeons had brought back information on the V-2 (rocket) site at Peenemunde, which was then bombed by the RAF. \"But I subsequently discovered that there was a record of this, and it was true, and her pigeon got the Dickin Medal for that. \"I rather like that only the British give medals to animals.\""
    },
    {
        "title": "What we know about the suspect in the Michigan church shooting and fire",
        "description": "As the search for more victims in the mass shooting and fire at a Mormon church in Michigan continues, officials are releasing details about the man suspected of turning a Sunday service into a scene of horror.",
        "url": "https://news.sky.com/story/what-we-know-about-the-suspect-in-the-michigan-church-shooting-and-fire-13440743",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-michigan-suspect-thomas-jacob-sanford_7035628.jpg?20250929061041",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-29 03:29:00",
        "Headline": "The suspect who opened fire at a church in Michigan before setting it ablaze has been identified as Thomas Jacob Sanford, 40, a former US Marine who served in Iraq, according to officials.",
        "Content": "As the search for more victims in the mass shooting and fire at a Mormon church in Michigan continues, officials are releasing details about the man suspected of turning a Sunday service into a scene of horror. Authorities have said Thomas Jacob Sanford, 40, drove a vehicle through the front doors of the Church of Jesus Christ of Latter-day Saints in Grand Blanc Township, Michigan, before opening fire and setting the building ablaze. He used an assault rifle, officials said. At least five people were killed in the Sunday morning attack - including the gunman - and at least eight others were injured. Police believe more bodies may be found in the remains of the burned-down building. Grand Blanc is about 50 miles north of Detroit. Sanford was from the nearby town of Burton. According to Sky's US partner network NBC News, Sanford served in the Marines from June 2004 to June 2008.  He was an organisational automotive mechanic and vehicle recovery operator, reaching the rank of sergeant, and was deployed in Operation Iraqi Freedom from August 2007 to March 2008. Sanford earned several awards, including the Marine Corps Good Conduct Medal. His last assignment was with the 2nd Maintenance Battalion at Camp Lejeune, North Carolina. 'Suspected explosive devices' Sanford used an accelerant, believed to be gasoline, to start the fire, James Dier, of the Detroit Field Division of the Bureau of Alcohol, Tobacco, Firearms and Explosives, said. Some \"suspected explosive devices\" were found, but it's not clear whether they were used to initiate the blaze, Mr Dier added. The FBI, which is leading the investigation into the attack, is treating the case as \"an act of targeted violence\", according to Reuben Coleman, acting special agent in charge of the bureau's Detroit field office. Authorities received a call about the shooting at 10.25am local time, and officers were on the scene just seconds later, Grand Blanc Township Chief William Renye told reporters. Sanford \"was neutralised at 10.33am\" in the parking lot of the church, he added. Officials did not disclose a motive. Read more from Sky News:Penny Lancaster felt 'belittled' by Gregg WallacePeople 'may be right' to think UK already at war with Russia Images showed a pickup truck, presumably driven by Sanford, rammed into the church building, with two American flags visible in the rear. Two senior law enforcement officials briefed on the investigation told NBC News there were as many as three improvised devices found at the scene. Michigan police have urged residents to stay vigilant, as they have been responding to additional bomb threats at different locations in the community. Some of those threats were at other churches and have been cleared by state police."
    },
    {
        "title": "'Are you watching, Donald Trump?': US president responds to Team Europe's Ryder Cup taunt",
        "description": "Donald Trump has responded to a taunting video message from the celebrating Europe Ryder Cup team following their thrilling victory in the biannual competition.",
        "url": "https://news.sky.com/story/are-you-watching-donald-trump-us-president-responds-to-team-europes-ryder-cup-taunt-13440883",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-ryder-cup_7036232.jpg?20250929144300",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-29 10:21:00",
        "Headline": "The US president is a big golf fan and came to the course on the first day and shook hands with some of the players. After, cup in hand, the Europe team goaded him on social media, he responded: \"Yes, I'm watching. Congratulations!\"",
        "Content": " Donald Trump has responded to a taunting video message from the celebrating Europe Ryder Cup team following their thrilling victory in the biannual competition. Cup in hand, the Europe team, all still dressed in their final-day outfits, chanted: \"Are you watching, are you watching, are you watching, Donald Trump?\" It appeared as a phone video on Mr Trump's Truth Social platform at 2.40am, UK time, with the message \"Yes, I'm watching. Congratulations!\" The friendly exchange between the US president, a big golf fan and frequent player of the game who came to the first day's play, and Europe's players was in stark contrast to the on-course atmosphere they faced. Rory McIlroy was often the target of boos and heckles at the Bethpage Black course in New York State - some of which were led by the Ryder Cup first-tee announcer over a megaphone on Saturday. Heather McMahan encouraged a chant of \"f*** you Rory\" ahead of Saturday's morning session. She has apologised and stepped down from her role, the PGA of America said on Sunday. Later on Saturday, the Northern Irishman hit back by telling a spectator to \"shut the f*** up\" while his teammate Shane Lowry was seen being held back by his caddie as he tried to confront someone. \n                  YouTube to settle lawsuit with Trump over account suspension\n                 \n                  Netanyahu backs Trump's peace plan for Gaza - as role for Blair revealed\n                 \n                  'I'm not so careful with what I say' - is Trump feeling more invincible than ever?\n                 In another clash, America's Bryson DeChambeau confronted Europe's Justin Rose after he asked DeChambeau's caddie to move while he was lining up a putt. Multiple spectators were thrown out of the event over their behaviour. McIllroy, the world number two, also revealed his wife Erica had beer thrown at her on Saturday, but said she was \"fine\".   Play was repeatedly held up as police tried to restore calm on the course and, speaking to reporters after the win was complete, the Northern Irishman said in what may have been a joke: \"I wish they had let the dogs off the leashes. \"The police out there and the amount of security presence was insane. \"Look, nothing was going to happen - there wasn't going to be physical altercation or anything like that - but there was a lot of language that was unacceptable and abusive behaviour. \"The majority of people here are true golf fans and are respectful, but I don't think we should ever accept that in golf.\" Read more on the Ryder Cup:Europe parties after winThe 'most abusive' Ryder Cup \"Golf teaches you very good life lessons, it teaches you etiquette, it teaches you how to play by the rules, it teaches you how to respect people. \"Sometimes this week we didn't see that. So no, this should not be what is acceptable in the Ryder Cup.\" The Europe team posted a number of videos on X as they celebrated their triumph, the first by a visiting team in the event since 2012. In one, the team sings \"Europe's on fire, the USA is terrified\" to the tune of Freed From Desire, while a second is a team sing-along to The Cranberries' Zombie, with \"he's in your head, Rory.\" Europe's team, led by British two-time captain Luke Donald, won by 15 points to 13, after the USA staged an unforgettable comeback that threatened to derail Europe's seemingly inevitable success following a dominant opening two days' play."
    },
    {
        "title": "Stowaway found dead in landing gear of American Airlines plane",
        "description": "A stowaway was found dead inside the landing gear of an American Airlines plane after it touched down in the US.",
        "url": "https://news.sky.com/story/stowaway-found-dead-in-landing-gear-of-american-airlines-plane-13440811",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-american-airlines-airplane_7035765.jpg?20250929092530",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-29 08:21:00",
        "Headline": "Charlotte-Mecklenburg Police Department said the aircraft had recently arrived in the US state of North Carolina from Europe, with maintenance crews raising the alarm following the discovery on Sunday.",
        "Content": "A stowaway was found dead inside the landing gear of an American Airlines plane after it touched down in the US. The discovery was made at Charlotte Douglas International Airport, North Carolina, shortly after 9am local time on Sunday. Charlotte-Mecklenburg Police Department (CMPD) said the aircraft had recently arrived from Europe, with maintenance crews raising the alarm after finding the body in the landing gear. In a statement, CMPD said: \"The subject was pronounced deceased on scene by CMPD's airport division officers. \"Homicide unit detectives responded to the scene to conduct an investigation, and crime scene search responded to process the scene and collect physical evidence.\" Representatives from CMPD's operations command and Mecklenburg EMS Agency (Medic) also assisted. A spokesperson for American Airlines said: \"We are working with law enforcement on its investigation.\" \n                  Boeing passenger jet catches fire after engine fault forces American Airlines flight to divert to Denver\n                 \n                  Diverted American Airlines flight escorted by Italian fighter jets after 'bomb threat'\n                 \n                  American Airlines forced to ground all US flights\n                 CMPD's homicide unit is leading the probe. Detectives are urging anyone with information to come forward. The force added: \"The investigation into this case is active and ongoing.\" Read more from Sky News:At least four victims after church set on fire during mass shootingFormer MP detained 'for nine hours' by counter terror police at airport Airport authorities said they were aware of the incident. A spokesperson added: \"We are deeply saddened by this news and will support the CMPD investigation as needed. \"Airport operations continue as normal.\""
    },
    {
        "title": "Video game maker Electronic Arts agrees record $55bn buyout to go private",
        "description": "Electronic Arts (EA) is to be taken private under a $55bn (&#163;41bn) buyout - a record sum for such a deal.",
        "url": "https://news.sky.com/story/electronic-arts-agrees-record-55bn-buyout-to-go-private-13441062",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jude-bellingham-fc26_7036259.jpg?20250929152712",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-29 13:43:00",
        "Headline": "The maker of Battlefield, FC 26 and The Sims is being bought - and is the most expensive acquisition of a public company to be taken private.",
        "Content": "Electronic Arts (EA) is to be taken private under a $55bn (£41bn) buyout - a record sum for such a deal. Under the terms, private equity firm Silver Lake Partners, Saudi Arabia's Public Investment Fund (PIF) and Affinity Partners will pay the video game maker's shareholders $210 per share. The sum represents a premium of 25% on EA's closing share price last Thursday, before the Wall Street Journal first reported that an announcement was close. Money latest: Tax rumour hits one area of housing market The total value exceeds the $32bn price paid to take Texas utility TXU private in 2007. Around $20bn of the purchase price will be made up of financing. There's been a rebound in global dealmaking as lower central bank interest rates bring borrowing costs down. The deal for the maker of Battlefield, FC 26 and The Sims also represents confidence in the recovery for blockbuster game franchises following a post-pandemic downturn that saw gamers become cautious on their spending. \n                  Cyber attacks: '80%' of ransomware victims pay up, insurer says\n                 \n                  YouTube to settle lawsuit with Trump over account suspension\n                 \n                  Jaguar Land Rover to resume some manufacturing in 'coming days' after cyber attack\n                 EA's sports portfolio has been its strongest performer due to its global appeal and that in-game spending has remained resilient. The transaction is subject to shareholder and regulatory approval."
    },
    {
        "title": "Insults, expletives and squeaky ducks - the most abusive Ryder Cup in almost a century of matches",
        "description": "The Europeans broke the Ryder Cup duck. Never expecting to shake off the bizarre distraction of a squeaky duck toy.",
        "url": "https://news.sky.com/story/insults-expletives-and-squeaky-ducks-the-most-abusive-ryder-cup-in-almost-a-century-of-matches-13440736",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ryder-cup-2025-rory-mcilroy_7035621.jpg?20250929035217",
        "type": "US",
        "Author": "Rob Harris",
        "Date Published": "2025-09-29 00:10:00",
        "Headline": "Bitterness and toxicity were off the scale at Bethpage Black - but Europe overcame it to win the 45th edition of golf's most prestigious team prize.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  The Europeans broke the Ryder Cup duck. Never expecting to shake off the bizarre distraction of a squeaky duck toy. Never imagining the Americans would make them fight so hard on the final day in New York. What had been shaping up to be a record-breaking win instead turned into a desperate scrap to avoid throwing it all away. So ultimately, everything the American crowd did to antagonise the visitors backfired. A raucous crowd is the Ryder Cup's appeal. Why no away team has won the biennial since 2012 - until now. But the bitterness and toxicity were off the scale at Bethpage Black. Europe overcame it to win the 45th edition of golf's most prestigious team prize.  After the putt that retained the trophy and a roar of relief, Ireland's Shane Lowry said: \"I've been so lucky to experience amazing things in this game. \n                  Netanyahu backs Trump's peace plan for Gaza - as role for Blair revealed\n                 \n                  Moldova's ruling pro-EU party wins parliamentary elections against Russia-leaning rivals\n                 \n                  Christian B: Freed Madeleine McCann suspect pleads 'give me back my life' as he tries to confront prosecutor\n                 \"That was the hardest couple of hours of my life.\" It was tighter, tenser, and far more stressful than anyone imagined after Europe began Sunday's singles session with a 12-5 lead. Humiliation was avoided for the Americans after Donald Trump became their first sitting president to attend the Ryder Cup on Friday. POTUS saw Europe start to build a commanding lead.  Maybe that's why the home crowd was so riled and rattled by Saturday. It wasn't just rowdy. This became the most abusive Ryder Cup in almost a century of matches. There is firing up the home crowd and what unfolded at the first tee - a course announcer hurling a vulgarity at Rory McIlroy. The tone was set for spectators goading the Northern Irishman with abuse about his private life and performances. \"Guys, shut up,\" he eventually told hecklers. It was an understatement when he later described conditions as \"really challenging\". So by the time Day 3 began, and the foul-mouthed announcer had apologised and stepped down, maybe it was no coincidence Aretha Franklin's \"Respect\" was the morning soundtrack in the grandstand. But there was a new tactic to disturb and antagonise - the ducks given out with cherry fairway fizz drinks. Repeatedly squeaked as Europeans took their shots, McIlroy finally complained. The insults had crossed the line. Read more from Sky News:Team Europe win Ryder Cup in nail-biting finaleMore victims expected following Mormon church shooting and fire But eventually, as the hosts fought back, reeling off wins in the singles to put more red on the board, Europe made it over the line, scraping over the line with a salvage job. \"It's been one of the hardest days I've ever experienced on a golf course,\" said Tyrrell Hatton after drawing the penultimate match to secure the win. \"Those last five, six, seven holes were horrible.\" Instead of a record victory margin, 15-13 was the tightest since Europe won by a point at Medinah, Illinois, in 2012. The weekend produced more drama, more discord, and disturbances in New York than imagined by Luke Donald, the first captain since fellow Englishman Tony Jacklin to win back-to-back editions since the 1980s. \"It's got to be the most stressful 12 hours of my life,\" he said. \"We knew they'd be tough, we didn't think they'd be this tough.\" Beyond taunts aimed at him, when wife Erica was even hit by a cup of beer, where, for McIlroy, was the etiquette that is a virtue of golf? Breaking off from the celebrations, McIlroy spoke out on the hostility that crossed the line. \"This should not be what is acceptable in the Ryder Cup,\" he said. \"I think golf should be held to a higher standard than what was seen out there this week.\""
    },
    {
        "title": "Cyber attacks: '80%' of ransomware victims pay up, insurer says",
        "description": "The vast majority of companies hit by ransomware attacks over the past year have paid up, according to an insurance specialist's report that warns of mixed outcomes for those who do.",
        "url": "https://news.sky.com/story/cyber-attacks-80-of-ransomware-victims-pay-up-insurer-says-13441131",
        "image_url": "https://e3.365dm.com/23/01/1920x1080/skynews-ransomware-cyber-attack_6022990.jpg?20230113194459",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-09-29 15:15:00",
        "Headline": "Hackers are said to be increasingly targeting sensitive business data including intellectual property because they see a chance of greater financial rewards.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The vast majority of companies hit by ransomware attacks over the past year have paid up, according to an insurance specialist's report that warns of mixed outcomes for those who do. Business-to-home insurer Hiscox released its annual Cyber Readiness Report against a backdrop of concern over a series of cyber attacks on high profile names over the past six months, including Marks and Spencer, the Co-op and Jaguar Land Rover (JLR). The carmaker has been handed a £1.5bn loan guarantee by the government to help shield its vast supply chain, including many small firms, from the impact of a month-long shutdown of its factories. While some have already laid off staff - a fraction of the 200,000 people employed among suppliers - many victims of hackers are small and medium-sized businesses (SMEs) that would not attract such financial support by themselves. There are no lengths to which cyber criminals will stoop - with hackers just last week threatening to release the personal data of children in the care of a nursery chain.  Hiscox said 27% of the 5,750 SMEs surveyed had been targeted with ransomware over the last 12 months. Of those, 80% had paid a ransom. But Hiscox added that only 60% of those companies had successfully recovered all or part of their data after making a payment. Almost a third of the firms to have paid a ransom were met with demands for more money, it said. Attacks 'threaten survival' of firms The wider findings of the study showed that almost 60% of the companies surveyed had experienced a cyber attack in the period, with many blaming artificial intelligence vulnerabilities for leaving them exposed. Many faced substantial fines for failures to adequately protect data and the findings also showed hits to not only bottom lines but reputations and orders too. Eddie Lamb, global head of cyber at Hiscox, said: \"No business, however small, can afford to underestimate the devastating impact a cyber-attack can have. \"Cyber attacks don't just disrupt day-to-day operations; they can threaten the very survival of a business. \"The financial fall-out, from crippling fines to lost customers or soaring costs, can push even the most resilient business to the brink. On top of this, the stress and long hours required to recover can impact staff morale and even lead to burnout.\"  JLR was reportedly in the process of finalising an insurance policy to cover cyber disruption when it was targeted at the end of August. The company is already facing an estimated bill of £200m from lost production. Henry Green, co-founder of the cyber insurance broker Assured, said policies had to reflect true levels of financial risk, or they were pointless. \"For £300-500m cover, JLR would have been looking at a circa £5m premium with at least a £10m excess,\" he said.  The costs of policies which cover all losses in the event of a cyber crime will be far beyond many firms, though the cyber insurance market is growing beyond major employers. That is partly due to the very public impact of disruption to the likes of M&S, heightened warnings over preparedness and increased competition in insurance provision.  The research specialist imarc says the market was worth £521m last year and expected to top £2.4bn by 2033.  M&S has estimated a hit of at least £300m from the ransomware attack on its business in mid-April. But the retailer, which is widely believed to have paid off its attackers, expects to claw the bulk of that sum back through its insurance policies. Read more from Sky News:Video game maker EA in record buyoutReeves fails to quell budget speculation Mr Lamb, who urged investment in protections, added: \"Cyber criminals are now much more focused on stealing sensitive business data – things like contracts, executive emails, financials, and intellectual property – because it’s easier to monetise than personal information. \"Once stolen, they demand payment to avoid public exposure, pricing threats based on reputational damage. \"This change has exposed gaps in some companies’ data loss prevention controls, which attackers are readily exploiting.\""
    },
    {
        "title": "Jaguar Land Rover to resume some manufacturing in 'coming days' after cyber attack",
        "description": "Jaguar Land Rover (JLR) has announced it will partially resume manufacturing \"in the coming days\" after nearly a month in the wake of a cyber attack.",
        "url": "https://news.sky.com/story/jaguar-land-rover-to-resume-some-manufacturing-in-coming-days-after-cyber-attack-13440852",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-land-rover-jaguar_7034427.jpg?20250928013820",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-09-29 09:38:00",
        "Headline": "It comes as the company announced a partial restart of its IT systems and the government underwrote a £1.5bn five-year loan guarantee to JLR.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Jaguar Land Rover (JLR) has announced it will partially resume manufacturing \"in the coming days\" after nearly a month in the wake of a cyber attack. The luxury car-making plants have paused production since 31 August. The cyber attack halted car-making across the supply chain, with staff off work as a result. Money latest: Five parts of UK defying housing market More than 33,000 people work directly for JLR in the UK, many of whom are on assembly lines in the West Midlands, with the largest facility located in Solihull, and a plant in Halewood on Merseyside. Roughly 200,000 more are employed by several hundred companies in the supply chain, who rely on JLR orders as their biggest client. \"As the controlled, phased restart of our operations continues, we are taking further steps towards our recovery and the return to manufacture of our world-class vehicles,\" a company spokesperson said. The shutdown was said to last until at least 1 October.  \"Today we are informing colleagues, retailers and suppliers that some sections of our manufacturing operations will resume in the coming days,\" the company added, days on from the partial restart of its IT systems, which allowed supplier payments to recommence. \"We know there is much more to do, but the foundational work of our recovery is firmly underway, and we will continue to provide updates as we progress.\" Over the weekend, the government said it would underwrite a £1.5bn five-year loan guarantee to JLR. The promise came as the head of the influential Business and Trade Committee of MPs wrote to Chancellor Rachel Reeves, warning small firms reliant on JLR, \"may have at best a week of cashflow left to support themselves\" with \"urgent\" action needed to support businesses. JLR was just the latest business to be the subject of a cyberattack. Harrods, the Co-Op, and Marks and Spencer, are among the companies that've struggled in the past year with such attacks."
    },
    {
        "title": "Reeves does nothing to ease roller coaster of budget speculation",
        "description": "There were times - quite a few of them in the past few months - when people speculated that Rachel Reeves would not survive as chancellor into the winter.",
        "url": "https://news.sky.com/story/reeves-does-nothing-to-ease-roller-coaster-of-budget-speculation-13441180",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-rachel-reeves-speech_7035984.jpg?20250929120721",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-09-29 17:10:00",
        "Headline": "Sky's Ed Conway says the chancellor was clearly in no position to calm nerves over where budget pain will fall, given the big numbers involved and Labour's manifesto commitments.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  There were times - quite a few of them in the past few months - when people speculated that Rachel Reeves would not survive as chancellor into the winter. It has been an especially bruising year for the Chancellor of the Exchequer - from the tears in the House of Commons to the various U-turns over economic policy that left a black hole in her fiscal plans. So there was more than a little symbolism to the fact that she took to the stage today and dominated the first full day of Labour Party Conference. Politics latest: Starmer ally 'not ruling out tax rises' Her performance was confident - more confident than many had expected. Relatively light on brand new economic policy, her speech is perhaps better described as a sort of highlights reel of Labour's \"best bits\" in office so far: more money for investment, more cash for schools, more funding for the NHS as well as rescues for British Steel and, just recently, Jaguar Land Rover. Her problem, however, is that this tightly-controlled speech, part of a tightly-controlled conference, is the starting gun for something Ms Reeves has far less control over: the long roller coaster towards the next budget.  Later this week, the Office for Budget Responsibility (OBR) will deliver its first estimate to the Treasury of the projected state of the public finances in the coming years. While the OBR is a public body, it generates its own forecasts in secrecy, so while the Treasury has a team of economists trying to second-guess the OBR, no one in Downing Street is entirely sure where it will end up. \n                  Dozens of pro-Palestinian demonstrators arrested outside Labour conference, Merseyside Police says\n                 \n                  Indefinite leave to remain: What is it and what's is the difference between Labour's and Reform UK's plans?\n                 \n                  Chancellor to make case for 'contribution' ahead of youth jobs guarantee\n                 That estimate (which will be chopped and changed in the coming weeks as the budget approaches) is of supreme importance, because the chancellor has committed to a set of fiscal rules - limits on how high the current budget, and a measure of the national debt, could get. And since the OBR's opinion on the state of the economy is what determines those numbers, the figures it delivers later this week are of outsize importance.  Right now, the speculation in government (note that for the time being this is purely speculation - no one knows for sure what the OBR will say) is that the 'black hole' between the chancellor's fiscal rules and the OBR's latest estimates of the size of the current budget is likely to be around £20bn to £30bn. That is, for want of a better phrase, a lot of money - so much so that it's very hard to see how you could fill the gap with lots of little tax rises. Indeed, it's very hard, at the best of times, to raise tens of billions of pounds without resorting to one of the big three taxes in the UK: income tax, national insurance or VAT. Labour's problem, however, is that it committed in its election manifesto last year not to raise any of those taxes. It is, in other words, penned in by a problem largely of its making. Had it not committed to its fiscal rules, or to abiding by the word of the OBR, or to the manifesto tax pledge, it would have far more room for manoeuvre. As it is, it is facing a roller coaster of speculation in the run-up to the budget. There will be many twists and turns in the coming weeks."
    },
    {
        "title": "Video game maker Electronic Arts agrees record $55bn buyout to go private",
        "description": "Electronic Arts (EA) is to be taken private under a $55bn (&#163;41bn) buyout - a record sum for such a deal.",
        "url": "https://news.sky.com/story/electronic-arts-agrees-record-55bn-buyout-to-go-private-13441062",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jude-bellingham-fc26_7036259.jpg?20250929152712",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-29 13:43:00",
        "Headline": "The maker of Battlefield, FC 26 and The Sims is being bought - and is the most expensive acquisition of a public company to be taken private.",
        "Content": "Electronic Arts (EA) is to be taken private under a $55bn (£41bn) buyout - a record sum for such a deal. Under the terms, private equity firm Silver Lake Partners, Saudi Arabia's Public Investment Fund (PIF) and Affinity Partners will pay the video game maker's shareholders $210 per share. The sum represents a premium of 25% on EA's closing share price last Thursday, before the Wall Street Journal first reported that an announcement was close. Money latest: Tax rumour hits one area of housing market The total value exceeds the $32bn price paid to take Texas utility TXU private in 2007. Around $20bn of the purchase price will be made up of financing. There's been a rebound in global dealmaking as lower central bank interest rates bring borrowing costs down. The deal for the maker of Battlefield, FC 26 and The Sims also represents confidence in the recovery for blockbuster game franchises following a post-pandemic downturn that saw gamers become cautious on their spending. \n                  Cyber attacks: '80%' of ransomware victims pay up, insurer says\n                 \n                  YouTube to settle lawsuit with Trump over account suspension\n                 \n                  Jaguar Land Rover to resume some manufacturing in 'coming days' after cyber attack\n                 EA's sports portfolio has been its strongest performer due to its global appeal and that in-game spending has remained resilient. The transaction is subject to shareholder and regulatory approval."
    },
    {
        "title": "'I'm a nanny and this is where society is going wrong when it comes to raising children'",
        "description": "If you've ever spent your morning commute daydreaming about starting afresh with your career, this feature is for you. Each Monday, we speak to someone from a different profession to discover what it's really like. This week we chat to Charlotte Willis, a nanny at Koru Kids...",
        "url": "https://news.sky.com/story/im-a-nanny-and-this-is-where-society-is-going-wrong-when-it-comes-to-raising-children-13440786",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nanny-charlotte-willis_7035633.jpg?20250929062337",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-29 07:06:00",
        "Headline": "Are you wanting a fresh start? In our regular careers feature, Charlotte Willis tells us what it's really like to be a nanny.",
        "Content": "If you've ever spent your morning commute daydreaming about starting afresh with your career, this feature is for you. Each Monday, we speak to someone from a different profession to discover what it's really like. This week we chat to Charlotte Willis, a nanny at Koru Kids... I get paid just over minimum wage... for my current nanny job. A nanny's salary can vary depending on experience, location, and responsibilities. With experience, specialised training, or working for high-profile families, the salary can increase significantly. Some full-time nannies can earn more than £50,000 a year, I think. I have a pension, but not from my current nanny job... I don't work enough hours for this job to pay into a pension, but I have another job which I do pay into one from. I'd love to retire in my 50s, but who knows! I work 12 hours a week... but this is what myself and the family I work for have chosen. Each family has different requirements. In regards to holiday, if I need a day off or to take holiday I try to give my family as much notice as possible. I have other jobs that I do around my schedule. Tap here to read the latest consumer news If I had to pick something I dislike about my job... I'd say tidying up toys for the 10th time in a day, but it comes with the territory, and seeing the children happy makes it worth it. I have worked both live-in and live-out... but I am currently a live-out nanny. Sometimes it's the case that parents work longer hours, so traditional childcare hours just don't work for them, or they just prefer that the nanny's close by. I know some families who wanted a live-in nanny for their newborn so they could get some support during the nights. \n                  Cyber attacks: '80%' of ransomware victims pay up, insurer says\n                 \n                  YouTube to settle lawsuit with Trump over account suspension\n                 \n                  Jaguar Land Rover to resume some manufacturing in 'coming days' after cyber attack\n                 Sometimes I get to go on holiday with the family... Families will usually invite me along if they'd like childcare support while travelling. We always agree on expectations in advance so it works well for everyone - it's really important for me and the family to know exactly what days/hours I'll be working vs what will be my downtime. I've heard stories of nannies ending up working really long days on holidays because the boundaries aren't set up-front. If I call in sick... most families understand that people get sick sometimes. Some have relatives or backup childcare, but I try to give as much notice as I possibly can. I have formal childcare qualifications, plus first aid and safeguarding training... Some courses can be completed within months, whereas the more formal ones might take years. I think experience is usually the most valuable teacher as long as you've got the important bits covered like first aid and safeguarding. I often stay with families for years... Naturally, I get very attached to the children - I celebrate their milestones as if they were my own - but I also know my role is to support both the kids and the parents. It's mostly a myth that children with nannies have distant relationships with their parents... In reality, nannies support families, not replace them. Children usually have strong bonds with both their parents and their nanny, my job really is to be an extension of them. I've never come across parents being distant from the kids, they usually need a nanny because other childcare routes don't work for them - they might work long hours so not make it back by nursery pick-up, or want their kid at home after a long day at school instead of at a club, sometimes their child might have SEN [special educational needs] so want someone with more specialist experience. Read more:'I'm a child psychiatrist - here's the biggest source of stress for children''I'm a personal shopper - this is your wardrobe essential and why you should pay at least £100 for it''I won £500k for one race': Inside the life, and finances, of a jockey Nannies having affairs with one of the parents is definitely a Hollywood cliche... Professional nannies are focused on the children and maintaining trust with families. Respect and boundaries are a huge part of the job. Having a nanny doesn't always show a family is rich... Loads of families choose a nanny because it's consistent, personalised care, sometimes even more cost-effective than multiple nursery places, especially if they've got more than one child in full-time nursery or multiple children in after school clubs. It's about priorities, not just wealth. Consistency is key... I always follow the parents' preferred approach to discipline, and we talk openly to make sure we're on the same page. It helps the child feel secure and supported. The agency I found my current job through is really keen on feedback, so they really encourage me and my family to check in regularly to make sure we're on the same page with discipline, behaviour, boundaries, food, or anything else that might come up. I would say screen time can be useful from the age of two... As long as it is monitored and assists learning. For example - cosmic kids yoga is lovely. It is based on stories and is fast-moving basic yoga moves alongside a story. It gets the kids moving, settled and interested in what is going on. It depends on age, but I believe in balance - screens can be educational, but outdoor play, reading, and creative activities are far more valuable. I think the biggest area where society is going wrong with raising children is... underestimating the value of unstructured play. Children learn so much from simply exploring, imagining, and socialising. Making mistakes, falling and getting back up again, showing strength and endurance in trying again. The fictional nanny that's the best at looking after children is... Mary Poppins - she combines fun, creativity, and structure, which is exactly what children thrive on. Although she's not really what nannies are like now - I definitely wouldn't fit into a Mary Poppins nanny mould. Got an interesting career and what to take part in this series? Email moneyblog@sky.uk to get in touch. "
    },
    {
        "title": "'Knock-back for London' as AstraZeneca sells shares directly on rival New York Stock Exchange",
        "description": "One of the UK's most valuable listed companies is to sell its shares directly on the rival New York Stock Exchange, in a move described as a \"knock back for London\". ",
        "url": "https://news.sky.com/story/knock-back-for-london-as-astrazeneca-sells-shares-directly-on-rival-new-york-stock-exchange-13440791",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-astrazeneca-nyse-lse_7035889.jpg?20250929105216",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-09-29 07:17:00",
        "Headline": "While AstraZeneca's headquarters will remain in the UK, the news hints at the possibility of a more dramatic shift in the future.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n One of the UK's most valuable listed companies is to sell its shares directly on the rival New York Stock Exchange, in a move described as a \"knock back for London\".  While AstraZeneca will maintain its headquarters in the UK and its primary stock listing on the London Stock Exchange, the news can be seen as a move away from London. \"Although there has been no suggestion that AstraZeneca is imminently going to up sticks and move its primary listing from London, there may be some nervousness this morning around the risk that the UK market might lose one of its largest constituents,\" said Russ Mould, the investment director of investment platform AJ Bell. Read more:AstraZeneca exit is a frightening prospect for the City and the government The news \"does at least hint at the possibility of a more dramatic shift at some point in the future\", Mr Mould said. There may also be relief that AstraZeneca is not moving from the London Stock Exchange altogether. \"I think there is probably relief that it's not pursuing a primary listing in New York, but the decision is hardly a ringing endorsement of London,\" said Neil Wilson, the UK investor strategist at investment platform Saxo Markets. \n                  Cyber attacks: '80%' of ransomware victims pay up, insurer says\n                 \n                  YouTube to settle lawsuit with Trump over account suspension\n                 \n                  Jaguar Land Rover to resume some manufacturing in 'coming days' after cyber attack\n                 \"It reflects the fundamental, structural issues in the UK for the largest globally-oriented stocks - the depth and liquidity of its capital markets is falling short of what's on offer across the pond.\" \"It's also a bit of a knock-back for London\", Mr Wilson said.  Why is this happening? The Cambridge-based pharmaceutical company said the decision to sell shares directly on the New York Stock Exchange - rather than the previous less straightforward system of using American depository receipts - has been made to allow it \"to reach a broader mix of global investors\" and \"make it even more attractive for all our shareholders\". \"The US has the world's largest and most liquid public markets by capitalisation, and the largest pool of innovative biopharma companies and investors,\" the company said in an announcement to investors. AstraZeneca's share price was up 0.7% on the news."
    },
    {
        "title": "Prize draw operator Winvia explores £200m London float",
        "description": "The biggest competitor to Omaze in Britain's prize-draw market is considering a &#163;200m London flotation to raise capital for a string of acquisitions.",
        "url": "https://news.sky.com/story/prize-draw-operator-winvia-explores-163200m-london-float-13441065",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-winvia-botb_7036246.jpg?20250929150812",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-29 13:48:00",
        "Headline": "Majority-owned by billionaire Teddy Sagi, Winvia Entertainment Group is working with Shore Capital to explore a possible listing on the junior AIM market, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The biggest competitor to Omaze in Britain's prize-draw market is considering a £200m London flotation to raise capital for a string of acquisitions. Sky News has learnt that Winvia Entertainment Group, which is majority-owned by the billionaire entrepreneur Teddy Sagi, is working with investment bankers at Shore Capital on a potential listing on London's junior AIM market. Positive initial discussions have already taken place with a number of institutional investors about an initial public offering (IPO), according to market sources, although a decision about whether to formally launch a process has yet to be taken. Money latest: Tax rumour hits one area of housing market Winvia operates prize draws and competition websites such as BOTB.com - which stands for Best of the Best and offers homes, cars and cash prizes. It is understood to be the second-largest player in the sector, behind Omaze. Research cited by the Department for Culture, Media and Sport earlier this year said that 7.4 million British adults had participated in prize draws and competitions, with the market worth an estimated £1.3bn annually. Part of Winvia's valuation aspirations, if it does decide to go public, are based on its proprietary technology platform, sources said on Monday. If an IPO does take place, the company's existing shareholders would retain their current investments, with any money raised being from the issuance of new shares to fund acquisitions. The company is majority-owned by Mr Sagi, the Israeli billionaire who has been involved in a number of British companies, including as the founder of Playtech, the gambling technology group. Winvia's management team is also understood to own a stake. A spokesperson for Winvia declined to comment."
    },
    {
        "title": "Cambridge animal woundcare spinout NoBACZ lands £5m injection",
        "description": "A University of Cambridge spinout which produces medical treatments for horses and livestock will this week announce a near-&#163;5m fundraising from a syndicate of high-profile shareholders.",
        "url": "https://news.sky.com/story/cambridge-animal-woundcare-spinout-nobacz-lands-1635m-injection-13440866",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nobackz-healthcare_7032064.jpg?20250926111044",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-29 09:57:00",
        "Headline": "A company founded by two Cambridge academics who aim to tackle a perennial problem in veterinary treatments for farm animals has secured £4.8m in funding from a group of investors, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A University of Cambridge spinout which produces medical treatments for horses and livestock will this week announce a near-£5m fundraising from a syndicate of high-profile shareholders. Sky News understands that NoBACZ Healthcare has secured the capital from backers led by The Yield Lab, a specialist investor in European agriculture and food technology businesses. Adjuvo, the angel investor network, ACF Investors, the University of Cambridge, Parkwalk, the FSE Group and Cambridge Enterprise Ventures also participated in the £4.8m round. NoBACZ has developed a range of so-called 'liquid bandage' technology for farm animals, which aims to usurp the use of antibiotics and cloth bandages, which can often be contaminated in agricultural environments. The company was founded by Dr Jonathan Powell and Dr Nuno Faria, whose research at Cambridge's Department of Veterinary Medicine examined how the body naturally builds and utilises mineral structures for its own benefit. Their product was initially developed to treat digital dermatitis, which affects a quarter of cows. Dr Powell, NoBACZ's chief executive, said: \"We founded NoBACZ Healthcare with the goal of transforming healthcare solutions for a more sustainable future whilst reducing antibiotic use. \n                  Cyber attacks: '80%' of ransomware victims pay up, insurer says\n                 \n                  YouTube to settle lawsuit with Trump over account suspension\n                 \n                  Jaguar Land Rover to resume some manufacturing in 'coming days' after cyber attack\n                 \"This new funding will fuel our expansion as we broaden our global product reach, launch our new range of products for the equine industry and continue to develop innovative veterinary healthcare solutions.\" He added that in addition to its pipeline of veterinary products, the company was \"starting to define our human product opportunity\". Mark Foster-Brown, CEO of Adjuvo, said: \"For too long, topical antibiotics and bandages have offered inadequate solutions for animal wound care. \"NoBACZ's patented platform technology sets a new benchmark, delivering ground-breaking results while aligning with Adjuvo's mission to back innovation in underserved sectors.\""
    },
    {
        "title": "PM to make major NHS announcement in pivotal conference speech",
        "description": "Sir Keir Starmer will today announce a major overhaul of the NHS, promising an &#8220;online hospital&#8221; that will deliver millions of extra appointments and help cut long waiting times, as he outlines his vision for a \"fairer\" Britain.",
        "url": "https://news.sky.com/story/pm-to-make-major-nhs-announcement-in-pivotal-conference-speech-13441295",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-speech_7035996.jpg?20250930031050",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-29 21:14:00",
        "Headline": "NHS Online will launch in 2027, according to the prime minister, in a bid to modernise the struggling health service. The announcement will form part of a crucial speech for Sir Keir, as his party languishes behind Reform UK in the polls.",
        "Content": "Sir Keir Starmer will today announce a major overhaul of the NHS, promising an “online hospital” that will deliver millions of extra appointments and help cut long waiting times, as he outlines his vision for a \"fairer\" Britain. In his keynote address to the Labour Party conference, the prime minister will set out plans for the digital service - NHS Online - to launch in 2027. Politics Hub: Follow the PM's speech from 2pm The platform will allow patients to access prescriptions, book scans and tests, receive clinical advice, and manage appointments through the NHS app. Labour claim the initiative will provide up to 8.5 million extra NHS appointments in its first three years. It will also let patients schedule in-person procedures at local hospitals, surgical hubs or diagnostic centres, reducing delays. Describing the move as \"a new chapter in the story of our NHS\", Sir Keir will say it marks the beginning of a technological revolution in healthcare. Speaking ahead of the prime minister's address, Health Secretary Wes Streeting said the NHS faces an \"existential threat\" if it fails to modernise, and vowed Labour would embrace new technologies to secure its future. \"Our health service and our social care services need to change with the times,\" he said. Country standing at a 'fork in the road' Sir Keir's announcement comes at a pivotal moment for the prime minister, as he will use his address at 2pm to rally a divided party and set out his vision for national renewal. He will urge voters to reject what he calls the \"politics of grievance\" promoted by Nigel Farage's Reform UK, and instead unite around a shared sense of \"dignity and respect\". The prime minister will argue that the country stands at a \"fork in the road\", facing a choice between \"renewal or decline\". \"Britain stands at a fork in the road. We can choose decency. Or we can choose division,\" he will say. Sir Keir will cast the challenge ahead as comparable to the challenges faced by the post-war government of former Labour prime minister Clement Attlee, calling it a fight for \"the soul of our country\". Read more:Streeting tells BMA to 'pick a side'Reeves does nothing to ease budget speculation  Mounting challenges for Labour The speech also comes amid mounting political headwinds, with polls showing Reform continuing to attract support from disillusioned voters. At the same time, Labour faces growing pressure to deliver on its promises around tax, immigration, and public spending - and expectations of a difficult budget in November. Sir Keir is expected to acknowledge that the path to national renewal won't be easy, warning of \"decisions that will not always be comfortable for our party\".  Despite recent speculation over his leadership, sparked in part by criticism from Greater Manchester mayor Andy Burnham, Sir Keir appears determined to reassert his authority. But the Conservatives have already dismissed his speech before delivery, with party chairman Kevin Hollinrake claiming: \"Keir Starmer calls this a fork in the road, but he's already driven Britain into a cul-de-sac of chaos.\" Ahead of Sir Keir's speech, cabinet members will also address the conference in Liverpool. Northern Ireland Secretary Hilary Benn, Transport Secretary Heidi Alexander, and Mr Streeting will all speak. On Monday, 10 cabinet ministers addressed the conference from the main stage, including Chancellor Rachel Reeves, who argued Reform present a threat to the economy."
    },
    {
        "title": "Streeting tells BMA doctors' union to 'pick a side' between Reform and Labour",
        "description": "Health Secretary Wes Streeting has told the BMA doctors' union to \"pick a side\" between Reform and Labour over their pay dispute.",
        "url": "https://news.sky.com/story/streeting-tells-bma-doctors-union-to-pick-a-side-between-reform-and-labour-13441200",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-electoral-dysfunction_7036551.jpg?20250929201810",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-29 17:40:00",
        "Headline": "The health secretary talks to Beth Rigby for the Electoral Dysfunction podcast on the BMA dispute, the Lib Dems and Andy Burnham.",
        "Content": "Health Secretary Wes Streeting has told the BMA doctors' union to \"pick a side\" between Reform and Labour over their pay dispute. Mr Streeting, talking to Sky News political editor Beth Rigby on the Electoral Dysfunction podcast, said the Labour Party will always be on the side of the NHS, while Reform leader Nigel Farage would \"check your credit card before your pulse\". 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈  In July, resident doctors, previously known as junior doctors, went on strike over their pay and are threatening to strike again following years of walkouts under the previous Tory government. In a preview of what his speech on Tuesday to the Labour Party conference will focus on, Mr Streeting said: \"I'd say to the BMA, pick a side because you've got a choice here and there's a government that wants to work with you.\" During a live recording of Electoral Dysfunction at the conference in Liverpool, he added: \"What I've said to the BMA is the NHS is hanging by a thread, don't pull it. \"It wouldn't be in the interest of the BMA - there isn't a more pro-doctor, pro-NHS government waiting in the wings.\" \n                  Starmer to pit Labour against Reform in conference closing speech\n                 \n                  Minister 'clarifies' violence against women and girls strategy after Sky News report\n                 \n                  Labour conference latest: Wes Streeting: 'We need Andy Burnham on the pitch'\n                 He mentioned Mr Farage's plan to introduce health insurance, adding: \"The BMA should really think about this in terms of their members.\" Mr Farage has also pledged to abolish indefinite leave to remain and put in place a minimum salary of £60,000 for skilled worker visas. The health secretary said that would be \"shooting ourselves in the foot\" when it comes to NHS staff. \"Farage says 'go home', the Labour Party says 'this is your home and with us this will always be your home',\" he said. Lib Dems are 'frenemies' Mr Streeting said he thinks there will be lots of disaffected Conservative voters who do not want to see Reform in government, and said they are \"welcome to get behind us\". He added some of those voters will support the Lib Dems, who he called \"frenemies\" of Labour - \"some days they're friends, some days they're enemies\" - but said \"we have a common enemy in Reform\". We need Burnham on the pitch Mr Streeting also addressed the potential of Greater Manchester mayor Andy Burnham challenging Sir Keir Starmer for his premiership. He said he thought Mr Burnham claiming there is a \"culture of fear\" within the Labour Party \"was an overstatement\". Asked if the mayor is a team player, Mr Streeting said: \"On his best days, yes.\" But he said recently \"he's had his ups and downs\". However, he added: \"I think the thing about Andy, he's one of our star players, and we need him on the pitch.\""
    },
    {
        "title": "Minister 'clarifies' violence against women and girls strategy after Sky News report",
        "description": "Child safety organisations have welcomed the government \"thinking again\" on including child abuse victims in its violence against women and girls strategy, following a Sky News report.",
        "url": "https://news.sky.com/story/minister-clarifies-violence-against-women-and-girls-strategy-after-sky-news-report-13440952",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-mollie-malone-vawg_7036270.jpg?20250929154613",
        "type": "Politics",
        "Author": "Mollie Malone",
        "Date Published": "2025-09-29 11:43:00",
        "Headline": "Sky News revealed a Home Office document, titled \"Our draft definition of VAWG\", said child sexual abuse and exploitation is not \"explicitly within the scope\" of its strategy.",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n  Child safety organisations have welcomed the government \"thinking again\" on including child abuse victims in its violence against women and girls strategy, following a Sky News report. Jess Phillips, minister for safeguarding and violence against women and girls (VAWG), has written to charities to tell them \"children who experience child sexual abuse and exploitation are considered in the new VAWG strategy\". In the letter, Ms Phillips says she hopes the letter \"clarifies\" the government's position. It comes after 10 organisations raised concerns with the government after Sky News published a \"draft\" Home Office document that said child sexual abuse and exploitation was not \"explicitly\" within the scope of the strategy. Anna Edmunson, head of policy at the NSPCC, told Sky News: \"We're hopeful that the words in the minister's letter shows that they are thinking again and making sure they can draw out the really clear links between tackling VAWG and tackling child sexual abuse. \"But the proof will be in the pudding - that's why we want to see the final strategy.\" The strategy has been delayed and is expected to be published later in the autumn. Read more from Sky News:Freed McCann suspect attempts to confront prosecutorWhat we know about the Michigan church suspect \"I am pleased to see the government has addressed the concerns we have raised,\" Kerry Smith, chief executive of the Internet Watch Foundation, told Sky News. \"We are at the front line and see how girls bear the brunt of sexual violence on and offline. We now need to see the strategy itself published in full. The sooner it can become a reality, the better.\" Rape Crisis, which is the largest support service of its kind, welcomed what they call a \"shift in position\" from the government to \"now acknowledging\" that child victims of sexual abuse and exploitation will be included, adding what's needed is \"concrete commitments.\" An estimated half a million children are sexually abused in England and Wales every year. Last month, Sky News spoke to Poppy Eyre, who was raped by her grandfather when she was four.  \"VAWG is violence against women and girls. If you take child sexual abuse out of it, where are the girls?\", she said, reacting to the leaked draft document Sky News obtained. The government insist that child sexual abuse will feature in the VAWG strategy, but victims and campaigners are concerned that it's in danger of being siloed off into disparate plans, without falling under the VAWG umbrella. Read more from Mollie Malone:Drones could be used to help prison escapesTasers to be used in prisons A Home Office spokesperson told Sky News it has \"been clear throughout that action to tackle child sexual abuse has always been included in the upcoming VAWG strategy\". The spokesperson said such crimes would be tackled \"through a distinct and transformative workstream\", including acting upon the recommendations of the Casey review into grooming gangs and the Jay review into child sexual abuse. Poppy Eyre said: \"My message to the government is if you're going to make child sexual abuse a separate thing, we need it now.\""
    },
    {
        "title": "Almost two in three Labour members back Burnham over Starmer for leader, poll shows",
        "description": "Andy Burnham would beat Sir Keir Starmer among Labour members by two to one if there were a leadership contest today, an exclusive poll for Sky News reveals.",
        "url": "https://news.sky.com/story/almost-two-in-three-labour-members-back-burnham-over-starmer-for-leader-poll-show-13441078",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-andy-burnham-keir-starmer_7036271.jpg?20250929154749",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-09-29 14:20:00",
        "Headline": "The exclusive poll also reveals that around a third of Labour members polled no longer think Sir Keir Starmer is a good prime minister.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Andy Burnham would beat Sir Keir Starmer among Labour members by two to one if there were a leadership contest today, an exclusive poll for Sky News reveals. A poll of 704 Labour members taken a week ago by YouGov found that 62% would back Mr Burnham, and 29% would back Sir Keir. Just 9% don't know or would not vote. Mr Burnham has claimed some Labour MPs are asking him to stand for the leadership, and has used this conference to set out his stall, though there is not an obvious route for him to return to Parliament. Tap here for the latest from Labour Party conference If returned to the Commons, he would have to resign as Manchester Metro Mayor, with a Reform UK replacement in prime position to win the mayoralty. The poll reveals that around a third of Labour members polled no longer think that Sir Keir is a good prime minister, and would rather he did not fight the next election. Some 33% say he is doing a bad job, compared with 63% who think he is doing a good job. Even more - 37% - say Sir Keir should not take the party into the next election, while 53% say he should and 10% don't know. People are more likely to say that Labour is doing a good job than Sir Keir. \n                  More than half of Labour members do not want Starmer to lead party into next general election - poll\n                 \n                  Andy Burnham says Labour MPs want him to oust Starmer\n                 \n                  By-elections that shook up politics – could Andy Burnham be next?\n                  Mr Burnham is the favourite to succeed him by a long distance - the top pick of 54% of members. Next is Angela Rayner, the now-sacked deputy leader (10%), then Health Secretary Wes Streeting on 7%. Ex-leader, now energy secretary, Ed Miliband and foreign secretary Yvette Cooper are on 6%, and new home secretary Shabana Mahmood is on 2%. Mr Burnham comfortably beats all in a final round of voting, according to the poll. In the event that Mr Burnham was unable to stand, YouGov polled a number of head-to-head races. Wes Streeting beats Shabana Mahmood and Ed Miliband, but would lose to Angela Rayner and Yvette Cooper. Ms Mahmood would lose to Mr Miliband and Ms Cooper. And Ms Cooper would beat Mr Miliband. The poll also examined attitudes to the deputy leadership contest. The poll found 35% would back Lucy Powell and 28% would back Bridget Phillipson, while 30% do not know and 5% will not vote. Excluding 'don't know', this suggests Ms Powell is ahead of Ms Phillipson with 56% to 44% - a closer margin than some other pollsters. Broadly, members who back Ms Powell are less likely to support Sir Keir. The poll makes tough reading for Angela Rayner - 60% said she was right to resign, against 34% who said it was the wrong decision."
    },
    {
        "title": "'Labour 2-0 down and budget pivotal moment', says Sadiq Khan ",
        "description": "Labour are \"2-0 down 20 minutes into a football game\" and  the budget is the next \"pivotal\" moment for the party's survival, Sadiq Khan has warned. ",
        "url": "https://news.sky.com/story/labour-2-0-down-and-budget-pivotal-moment-says-sadiq-khan-13441187",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sadiq-khan-donald-trump_7030271.jpg?20250924120816",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-09-29 17:18:00",
        "Headline": "Labour MPs are soul-searching at the annual party conference after dire polling suggests Reform UK are on course to win the next general election. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Labour are \"2-0 down 20 minutes into a football game\" and  the budget is the next \"pivotal\" moment for the party's survival, Sadiq Khan has warned.  The Mayor of London told a fringe event at the Labour Party conference that he has faith his \"friend\" Sir Keir Starmer can turn around his plummeting approval ratings. Politics Live: Reeves says she will 'not take risks' with economy But summing up the mood of many of his colleagues gathered in Liverpool, he said that depends on \"accelerating delivery and telling a better story\". \"If this is a game of football, what I'd say is it's a 90-minute game, we've played almost 20 minutes and we are 2-0 down. We have got to use the rest of the time in this game to turn it around. I think it's possible.\" Asked what the story should be, Sir Sadiq said: \"Change. That was the word in the manifesto and not enough people have seen change, we either are the disrupters or we will be disrupted.\" He added that Chancellor Rachel Reeves' budget next month is \"really really important\". \"There needs to be a significant runway for it to bear fruit,\" he said. \"If we do one before the general election with big giveaways, people will see right through it. \"The budget is the most pivotal event since the general election.\" Labour's annual party conference - the second since Sir Keir took office - has been overshadowed by multiple polls predicting Reform UK will win the next election. There has been mounting speculation Greater Manchester Mayor Andy Burnham could mount a leadership challenge, following his high-profile criticism, though today he insisted Sir Keir is the right person to lead the party. Several fringe events have heard from MPs and pollsters about what Labour can do to fight back against Nigel Farage before it is too late. Read More:Almost two in three Labour members back Burnham over Starmer for leader, poll shows 'Some good news for Starmer' Luke Tryl, the director of More in Common, said there is some \"good news\" for the prime minister, as research from polling and focus groups show \"people do think that the ship can be turned around, they haven't switched off the way they did at the end of the Sunak government\". However, Labour faces a challenge as it is losing voters to the right and the left. While focusing on immigration is important, there is also a broad coalition of the public that want to see improvements on the cost of living and NHS, Mr Tryl said. The pollster was speaking at a fringe event about how Labour can rebuild its electoral coalition, alongside a number of backbench MPs.  Starmer given May deadline  Richard Burgon, the left-wing Corybnite who has long been a Starmer critic, gave him a stay of execution until May, when there will be local elections in many parts of England as well as devolved elections in Scotland and Wales. \"There's a political inevitability if next May, if the results are as the opinion polls say they will be, it's inevitable that Keir Starmer will no longer be prime minister,\" Mr Burgon said. He said Sir Keir had lost \"a lot of good will\" over unpopular decisions like the cut to winter fuel which made it look like \"we are too close to the rich and powerful whilst hurting people\". He added that the government isn't talking enough about the \"great things\" it is doing, like bolstering workers rights, as it is \"almost like we are embarrassed to have done Labour things because we want to talk about Reformy things\". The other backbenchers dismissed the idea of a leadership challenge - but they all had messages for the prime minister. Former minister Anneliese Dodds said the public need to see \"more of the real Keir\", while Jonathan Hinder, co-founder of the Blue Labour caucus, said the party needed to talk about \"the big ideas and the direction we want to take the country in\". Alistair Strathern, the MP for Hitchin, got a round of applause from members in the packed room when he said: \"We have an electorate who are deeply weary of chaos and political parties chopping and changing all the time, we will obviously be in a better position if Keir Starmer is leading us into the next election with a strong vision, clear values and tangible change.\" PM to address conference tomorrow  Sir Keir will address the conference tomorrow when all eyes will be on whether his speech signals a change in direction. Many MPs want to see the two-child benefit cap scrapped but it is not clear if there will be a policy announcement. The prime minister has spent the past few days launching a fightback against Reform by framing the next election as one between \"division and hate\" and \"progressive patriotic renewal\". He drew clear dividing lines with Mr Farage this week, as he branded his plan to scrap Indefinite Leave to Remain (ILR) for legal migrants as \"racist and immoral\". Labour said that instead of scrapping it, they will reform the system by requiring migrants to prove they are contributing to society to earn the right to remain. However, already, some politicians have questioned the prime minister's judgement in using that language. Sir Sadiq said while Nigel Farage's ILR policy was \"the most unBritish thing imaginable\" it is \"really important to have this debate [about immigration] without necessarily name-calling\". \"I don't call followers of Reform racist, I don't call Nigel Farage racist,\" he said."
    },
    {
        "title": "Government under pressure as Labour members vote to accept Israel committing genocide in Gaza",
        "description": "Labour Party members have voted to accept that a genocide is taking place in Gaza by Israel - putting pressure on the UK government to also do so.",
        "url": "https://news.sky.com/story/government-under-pressure-as-labour-members-vote-to-accept-israel-committing-genocide-in-gaza-13441074",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-israeli-border-gaza_7035769.jpg?20250929092910",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-29 14:19:00",
        "Headline": "Israel has repeatedly denied the genocide allegation and called a recent UN commission of inquiry report \"distorted and false\".",
        "Content": "Labour Party members have voted to accept that a genocide is taking place in Gaza by Israel - putting pressure on the UK government to also do so. Members voted to approve an emergency motion at Labour's conference in Liverpool to accept the findings of the UN commission of inquiry, which nearly two weeks ago concluded Israel \"has committed genocide\". Israel has repeatedly denied this allegation and called the report \"distorted and false\". Gaza latest: Netanyahu backs Trump's peace plan The vote will place further pressure on the UK government after Sir Keir Starmer and his ministers have refused to declare a genocide is taking place. They have argued that the issue is a matter for the courts, with Israel fighting a case at the International Court of Justice (ICJ) in The Hague in which the country is accused of genocide. Speaking after the conference vote, which was heavily backed by the unions, Deputy Prime Minister David Lammy reiterated that position, saying he believed in \"the rules-based order\". \n                  Praise and fury for Trump's Gaza peace deal - but Hamas's first reaction is telling\n                 \n                  What we know about the Gaza peace plan – and what Sky News correspondents make of it\n                 \n                  Netanyahu backs Trump's peace plan for Gaza - as role for Blair revealed\n                 \"That means that it must be for the ICJ with their judges and judiciary, and for the ICC, to determine the issue of genocide in relation to the convention, it is not for politicians like me to do that,\" he said. \"But it is for the public to look at what they see and come to their own judgments about what they see.\" He added that last year, when he was foreign secretary, he had decided \"that I did see a clear risk that Israel was breaching international humanitarian law\" and had suspended arms sales to Israel. Israel's foreign ministry hit out at the decision, posting on X: \"While Prime Minister Netanyahu and President Trump are working tirelessly in Washington to end the war in Gaza, the UK Labour Party chooses to embrace Hamas and fully adopt its lies, including the fake-genocide campaign.\" \"The world stands with the US and Israel in their efforts to end the war. \"Labour stands with Hamas. It is a disgrace for Britain that this is the party in power.\" The Jewish Labour Movement group said it is \"hugely disappointed\" about the vote, which it credited to \"union votes\", and said it neglected to mention the October 7th attack or Hamas \"and barely pays lip service to the 48 hostages held by terrorists in Gaza\". It said the motion \"is not the route to the two-state solution\" and urged the government to \"continue to pursue a path of peace for all Israelis and Palestinians\". After the UN Commission of Inquiry on the Occupied Palestinian Territory released its report, the UK government said its official position is that it \"has not concluded that Israel is acting with that [genocidal] intent\". The report found there are reasonable grounds to conclude that four of the five genocidal acts defined under international law have been carried out since the start of the war with Hamas in 2023. They are: killing members of a group, causing them serious bodily and mental harm, deliberately inflicting conditions calculated to destroy the group, and preventing births. Although other UN bodies and personnel have previously linked Israel's actions with allegations of genocide, it was the first time any UN body has claimed to have made a definitive judgement. The world's leading association of genocide scholars, as well as several Israeli human rights organisations, had already accused the country of genocide before the UN commission report."
    },
    {
        "title": "Reeves does nothing to ease roller coaster of budget speculation",
        "description": "There were times - quite a few of them in the past few months - when people speculated that Rachel Reeves would not survive as chancellor into the winter.",
        "url": "https://news.sky.com/story/reeves-does-nothing-to-ease-roller-coaster-of-budget-speculation-13441180",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-rachel-reeves-speech_7035984.jpg?20250929120721",
        "type": "Politics",
        "Author": "Ed Conway",
        "Date Published": "2025-09-29 17:10:00",
        "Headline": "Sky's Ed Conway says the chancellor was clearly in no position to calm nerves over where budget pain will fall, given the big numbers involved and Labour's manifesto commitments.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  There were times - quite a few of them in the past few months - when people speculated that Rachel Reeves would not survive as chancellor into the winter. It has been an especially bruising year for the Chancellor of the Exchequer - from the tears in the House of Commons to the various U-turns over economic policy that left a black hole in her fiscal plans. So there was more than a little symbolism to the fact that she took to the stage today and dominated the first full day of Labour Party Conference. Politics latest: Starmer ally 'not ruling out tax rises' Her performance was confident - more confident than many had expected. Relatively light on brand new economic policy, her speech is perhaps better described as a sort of highlights reel of Labour's \"best bits\" in office so far: more money for investment, more cash for schools, more funding for the NHS as well as rescues for British Steel and, just recently, Jaguar Land Rover. Her problem, however, is that this tightly-controlled speech, part of a tightly-controlled conference, is the starting gun for something Ms Reeves has far less control over: the long roller coaster towards the next budget.  Later this week, the Office for Budget Responsibility (OBR) will deliver its first estimate to the Treasury of the projected state of the public finances in the coming years. While the OBR is a public body, it generates its own forecasts in secrecy, so while the Treasury has a team of economists trying to second-guess the OBR, no one in Downing Street is entirely sure where it will end up. \n                  Dozens of pro-Palestinian demonstrators arrested outside Labour conference, Merseyside Police says\n                 \n                  Indefinite leave to remain: What is it and what's is the difference between Labour's and Reform UK's plans?\n                 \n                  Chancellor to make case for 'contribution' ahead of youth jobs guarantee\n                 That estimate (which will be chopped and changed in the coming weeks as the budget approaches) is of supreme importance, because the chancellor has committed to a set of fiscal rules - limits on how high the current budget, and a measure of the national debt, could get. And since the OBR's opinion on the state of the economy is what determines those numbers, the figures it delivers later this week are of outsize importance.  Right now, the speculation in government (note that for the time being this is purely speculation - no one knows for sure what the OBR will say) is that the 'black hole' between the chancellor's fiscal rules and the OBR's latest estimates of the size of the current budget is likely to be around £20bn to £30bn. That is, for want of a better phrase, a lot of money - so much so that it's very hard to see how you could fill the gap with lots of little tax rises. Indeed, it's very hard, at the best of times, to raise tens of billions of pounds without resorting to one of the big three taxes in the UK: income tax, national insurance or VAT. Labour's problem, however, is that it committed in its election manifesto last year not to raise any of those taxes. It is, in other words, penned in by a problem largely of its making. Had it not committed to its fiscal rules, or to abiding by the word of the OBR, or to the manifesto tax pledge, it would have far more room for manoeuvre. As it is, it is facing a roller coaster of speculation in the run-up to the budget. There will be many twists and turns in the coming weeks."
    },
    {
        "title": "Dozens of pro-Palestinian demonstrators arrested outside Labour conference, Merseyside Police says",
        "description": "Dozens of pro-Palestinian demonstrators were arrested outside the Labour Party conference in Liverpool on Sunday, police have said.",
        "url": "https://news.sky.com/story/dozens-of-pro-palestinian-demonstrators-arrested-outside-labour-conference-merseyside-police-says-13441003",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-liverpool-protest-palestine_7035236.jpg?20250928181311",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-29 12:09:00",
        "Headline": "More than 60 people were arrested on Sunday for supporting the banned terror group Palestine Action, Merseyside Police said. All but two of them were detained on suspicion of a terrorism offence and were taken into custody. All those arrested have since been released.",
        "Content": " Dozens of pro-Palestinian demonstrators were arrested outside the Labour Party conference in Liverpool on Sunday, police have said. Merseyside Police officers detained 66 people outside the Liverpool Arena and Convention Centre for supporting the banned terror group Palestine Action, the force said on Monday. Two of those held were later released but the other 64 were arrested on suspicion of a terrorism offence and were taken into custody, the force said. Labour latest - 'no risks' with economy All those arrested, aged between 21 and 83 years, have been released on bail after Sunday's demonstration. Merseyside Police said in a statement: \"Some of the people in attendance displayed material in support of Palestine Action, who are a proscribed terrorism organisation.\" About 100 people had gathered silently, holding signs reading: \"I oppose genocide, I support Palestine Action\", protest group Defend Our Juries said. \n                  Praise and fury for Trump's Gaza peace deal - but Hamas's first reaction is telling\n                 \n                  What we know about the Gaza peace plan – and what Sky News correspondents make of it\n                 \n                  Netanyahu backs Trump's peace plan for Gaza - as role for Blair revealed\n                 Palestine Action was banned as a terror organisation in July after the group admitted it was behind the damaging of two Voyager planes at RAF Brize Norton the previous month. During the protest on Sunday, Keith Hackett, 71, said: \"I'm risking arrest today under terrorism legislation because, as a former Labour Party councillor in Liverpool, I am deeply ashamed of how Labour are acting.\" Tayo Aluko, 63, an actor, writer and singer from Liverpool, said the government \"wants to plant fear in the citizens so that it can continue to let their friends and paymasters get away with genocide\". Kerry Moscogiuri, Amnesty International UK's director of communications and campaigns, said: \"These arrests should not be happening. It's clearly both ridiculous and seriously disproportionate for police to be targeting and arresting people for sitting down, quietly holding a sign.\" Read more on Sky News:Labour vs Reform on immigrationTrump responds to US Ryder Cup defeatFreed Madeleine suspect comes out of hiding Israel denies any genocide is taking place during its conflict with terror group Hamas in Gaza. Inside the hall, a protester holding up a Palestinian flag interrupted Chancellor Rachel Reeves's speech.  The man was heard shouting at the chancellor about \"genocide\" in Gaza and the \"mass starvation of Palestinians\". In response, Ms Reeves said: \"We understand your cause, and we are recognising a Palestinian state. But we are now a party in government, not a party of protest.\""
    },
    {
        "title": "Cyber attacks: '80%' of ransomware victims pay up, insurer says",
        "description": "The vast majority of companies hit by ransomware attacks over the past year have paid up, according to an insurance specialist's report that warns of mixed outcomes for those who do.",
        "url": "https://news.sky.com/story/cyber-attacks-80-of-ransomware-victims-pay-up-insurer-says-13441131",
        "image_url": "https://e3.365dm.com/23/01/1920x1080/skynews-ransomware-cyber-attack_6022990.jpg?20230113194459",
        "type": "Technology",
        "Author": "James Sillars",
        "Date Published": "2025-09-29 15:15:00",
        "Headline": "Hackers are said to be increasingly targeting sensitive business data including intellectual property because they see a chance of greater financial rewards.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The vast majority of companies hit by ransomware attacks over the past year have paid up, according to an insurance specialist's report that warns of mixed outcomes for those who do. Business-to-home insurer Hiscox released its annual Cyber Readiness Report against a backdrop of concern over a series of cyber attacks on high profile names over the past six months, including Marks and Spencer, the Co-op and Jaguar Land Rover (JLR). The carmaker has been handed a £1.5bn loan guarantee by the government to help shield its vast supply chain, including many small firms, from the impact of a month-long shutdown of its factories. While some have already laid off staff - a fraction of the 200,000 people employed among suppliers - many victims of hackers are small and medium-sized businesses (SMEs) that would not attract such financial support by themselves. There are no lengths to which cyber criminals will stoop - with hackers just last week threatening to release the personal data of children in the care of a nursery chain.  Hiscox said 27% of the 5,750 SMEs surveyed had been targeted with ransomware over the last 12 months. Of those, 80% had paid a ransom. But Hiscox added that only 60% of those companies had successfully recovered all or part of their data after making a payment. Almost a third of the firms to have paid a ransom were met with demands for more money, it said. Attacks 'threaten survival' of firms The wider findings of the study showed that almost 60% of the companies surveyed had experienced a cyber attack in the period, with many blaming artificial intelligence vulnerabilities for leaving them exposed. Many faced substantial fines for failures to adequately protect data and the findings also showed hits to not only bottom lines but reputations and orders too. Eddie Lamb, global head of cyber at Hiscox, said: \"No business, however small, can afford to underestimate the devastating impact a cyber-attack can have. \"Cyber attacks don't just disrupt day-to-day operations; they can threaten the very survival of a business. \"The financial fall-out, from crippling fines to lost customers or soaring costs, can push even the most resilient business to the brink. On top of this, the stress and long hours required to recover can impact staff morale and even lead to burnout.\"  JLR was reportedly in the process of finalising an insurance policy to cover cyber disruption when it was targeted at the end of August. The company is already facing an estimated bill of £200m from lost production. Henry Green, co-founder of the cyber insurance broker Assured, said policies had to reflect true levels of financial risk, or they were pointless. \"For £300-500m cover, JLR would have been looking at a circa £5m premium with at least a £10m excess,\" he said.  The costs of policies which cover all losses in the event of a cyber crime will be far beyond many firms, though the cyber insurance market is growing beyond major employers. That is partly due to the very public impact of disruption to the likes of M&S, heightened warnings over preparedness and increased competition in insurance provision.  The research specialist imarc says the market was worth £521m last year and expected to top £2.4bn by 2033.  M&S has estimated a hit of at least £300m from the ransomware attack on its business in mid-April. But the retailer, which is widely believed to have paid off its attackers, expects to claw the bulk of that sum back through its insurance policies. Read more from Sky News:Video game maker EA in record buyoutReeves fails to quell budget speculation Mr Lamb, who urged investment in protections, added: \"Cyber criminals are now much more focused on stealing sensitive business data – things like contracts, executive emails, financials, and intellectual property – because it’s easier to monetise than personal information. \"Once stolen, they demand payment to avoid public exposure, pricing threats based on reputational damage. \"This change has exposed gaps in some companies’ data loss prevention controls, which attackers are readily exploiting.\""
    },
    {
        "title": "The countries where digital ID already exists",
        "description": "As the UK gears up to make digital ID mandatory for all UK citizens, across the globe similar schemes already exist.",
        "url": "https://news.sky.com/story/the-countries-where-digital-id-already-exists-13441075",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-digital-id-stock-image_7036395.jpg?20250929164644",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-29 14:21:00",
        "Headline": "Sir Keir Starmer announced last week that all UK citizens are to have mandatory ID to prove their right to live and work in the country.",
        "Content": "As the UK gears up to make digital ID mandatory for all UK citizens, across the globe similar schemes already exist. Sir Keir Starmer announced last week that all UK citizens are to have mandatory ID to prove their right to live and work in the country, which will be kept in a 'wallet' similar to that of Apple Wallet or Google Wallet. The prime minister argued ID cards will ensure the UK's \"borders are more secure\", but the plan drew criticism from Labour's political opponents, including the Conservatives, Reform UK and the Liberal Democrats. While the success of the scheme remains to be seen, the government has said it is going to use the best aspects of digital IDs already being used in a handful of countries including Estonia, Denmark and India in its design. Click, zoom and scroll on the map below to see all the countries that already use digital ID, or are planning to implement similar technology: In the European Union, physical ID cards have existed for decades. In fact, in all bar two of the EU's 27 member states, physical ID cards, in a standard, machine-readable EU format introduced in 2021, are used both as identity documents in citizens' home countries, and for travel within the passport-free Schengen zone. The two exceptions are Denmark, which uses the digital identity and authentication app, MitID, and Ireland, which issues passport cards. Read more:What is a digital ID card?The pros and cons of digital IDs  However, by the end of 2026, the EU is hoping to roll out the Digital Identity (eID) Wallet, which it says is Europe's answer to the challenges of identification. The wallet will enable citizens of all EU member states to access online and offline public and private services, store and share digital documents, and create binding signatures. Large-scale pilot projects are currently testing how the EU Digital Identity Wallets will function in a wide range of situations, before it is launched across the EU. Over 350 companies and public authorities across 26 member states as well as Norway, Iceland and Ukraine are participating. In France, the France Identite app allows citizens to combine their identity card, driving licence and vehicle registration document in a single application."
    },
    {
        "title": "Cannabis extract reduces chronic low back pain without risk of addiction, study suggests",
        "description": "An extract taken from the cannabis plant has been found to reduce chronic low back pain without risking addiction, according to a study.",
        "url": "https://news.sky.com/story/cannabis-extract-reduces-chronic-back-pain-without-risk-of-addiction-study-suggests-13440946",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bad-back-cannabis_7036254.jpg?20250929151757",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-29 11:35:00",
        "Headline": "A cannabis plant extract can help people manage the pain \"without serious side effects\" as part of a \"promising\" clinical strategy, said researchers.",
        "Content": "An extract taken from the cannabis plant has been found to reduce chronic low back pain without risking addiction, according to a study. Researchers said the results could be the \"first non-addictive and clinically proven chronic pain treatment\" based on the cannabis plant. The findings could lead to a \"promising\" clinical strategy to help people manage their pain without any associated risks with addiction. \"Given the high prevalence of chronic low back pain and the global scale of the opioid crisis, these findings highlight a promising, non-addictive pain-management strategy for clinical use,\" researchers said. The trial, published in the Nature Medicine journal, involved more than 800 people. The cannabis extract VER-01 was found to reduce pain \"without serious side effects or signs of addiction\", scientists said. People who suffer with lower back pain currently \"remain limited\" to anti-inflammatory drugs which researchers said can lead to long-term cardiovascular and gastrointestinal risks. Other options include opioids, which are highly addictive and can cause \"severe side effects\". Scientists at a medical school in Hanover, Germany, said 820 adults taking part in the trial had 12 weeks of treatment. Read more from Sky News:Vaccine giant opens new factory in UKWhy EU has banned some gel nail polishes  Participants reported a reduction in their pain levels - and then an \"additional decrease\" in symptoms during a six-month extension to the study. Researchers said: \"VER-01 was relatively well tolerated, with the most common adverse events being short-term dizziness, excessive sleepiness and nausea during the early treatment phase.\" They said there were no signs of \"dose escalation, abuse, dependence or withdrawal symptoms\". \"The findings highlight the ability of VER-01 to relieve pain without the addiction risks and harmful consequences often associated with opioids\" the scientists added."
    },
    {
        "title": "Video game maker Electronic Arts agrees record $55bn buyout to go private",
        "description": "Electronic Arts (EA) is to be taken private under a $55bn (&#163;41bn) buyout - a record sum for such a deal.",
        "url": "https://news.sky.com/story/electronic-arts-agrees-record-55bn-buyout-to-go-private-13441062",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jude-bellingham-fc26_7036259.jpg?20250929152712",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-29 13:43:00",
        "Headline": "The maker of Battlefield, FC 26 and The Sims is being bought - and is the most expensive acquisition of a public company to be taken private.",
        "Content": "Electronic Arts (EA) is to be taken private under a $55bn (£41bn) buyout - a record sum for such a deal. Under the terms, private equity firm Silver Lake Partners, Saudi Arabia's Public Investment Fund (PIF) and Affinity Partners will pay the video game maker's shareholders $210 per share. The sum represents a premium of 25% on EA's closing share price last Thursday, before the Wall Street Journal first reported that an announcement was close. Money latest: Tax rumour hits one area of housing market The total value exceeds the $32bn price paid to take Texas utility TXU private in 2007. Around $20bn of the purchase price will be made up of financing. There's been a rebound in global dealmaking as lower central bank interest rates bring borrowing costs down. The deal for the maker of Battlefield, FC 26 and The Sims also represents confidence in the recovery for blockbuster game franchises following a post-pandemic downturn that saw gamers become cautious on their spending. \n                  Cyber attacks: '80%' of ransomware victims pay up, insurer says\n                 \n                  YouTube to settle lawsuit with Trump over account suspension\n                 \n                  Jaguar Land Rover to resume some manufacturing in 'coming days' after cyber attack\n                 EA's sports portfolio has been its strongest performer due to its global appeal and that in-game spending has remained resilient. The transaction is subject to shareholder and regulatory approval."
    },
    {
        "title": "Cambridge animal woundcare spinout NoBACZ lands £5m injection",
        "description": "A University of Cambridge spinout which produces medical treatments for horses and livestock will this week announce a near-&#163;5m fundraising from a syndicate of high-profile shareholders.",
        "url": "https://news.sky.com/story/cambridge-animal-woundcare-spinout-nobacz-lands-1635m-injection-13440866",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nobackz-healthcare_7032064.jpg?20250926111044",
        "type": "Technology",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-29 09:57:00",
        "Headline": "A company founded by two Cambridge academics who aim to tackle a perennial problem in veterinary treatments for farm animals has secured £4.8m in funding from a group of investors, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A University of Cambridge spinout which produces medical treatments for horses and livestock will this week announce a near-£5m fundraising from a syndicate of high-profile shareholders. Sky News understands that NoBACZ Healthcare has secured the capital from backers led by The Yield Lab, a specialist investor in European agriculture and food technology businesses. Adjuvo, the angel investor network, ACF Investors, the University of Cambridge, Parkwalk, the FSE Group and Cambridge Enterprise Ventures also participated in the £4.8m round. NoBACZ has developed a range of so-called 'liquid bandage' technology for farm animals, which aims to usurp the use of antibiotics and cloth bandages, which can often be contaminated in agricultural environments. The company was founded by Dr Jonathan Powell and Dr Nuno Faria, whose research at Cambridge's Department of Veterinary Medicine examined how the body naturally builds and utilises mineral structures for its own benefit. Their product was initially developed to treat digital dermatitis, which affects a quarter of cows. Dr Powell, NoBACZ's chief executive, said: \"We founded NoBACZ Healthcare with the goal of transforming healthcare solutions for a more sustainable future whilst reducing antibiotic use. \n                  Cyber attacks: '80%' of ransomware victims pay up, insurer says\n                 \n                  YouTube to settle lawsuit with Trump over account suspension\n                 \n                  Jaguar Land Rover to resume some manufacturing in 'coming days' after cyber attack\n                 \"This new funding will fuel our expansion as we broaden our global product reach, launch our new range of products for the equine industry and continue to develop innovative veterinary healthcare solutions.\" He added that in addition to its pipeline of veterinary products, the company was \"starting to define our human product opportunity\". Mark Foster-Brown, CEO of Adjuvo, said: \"For too long, topical antibiotics and bandages have offered inadequate solutions for animal wound care. \"NoBACZ's patented platform technology sets a new benchmark, delivering ground-breaking results while aligning with Adjuvo's mission to back innovation in underserved sectors.\""
    },
    {
        "title": "Harry Potter author JK Rowling hits out at Emma Watson in fresh clash over transgender issues",
        "description": "JK Rowling has accused Emma Watson of being \"ignorant of how ignorant she is\" amid their ongoing disagreement about transgender issues.",
        "url": "https://news.sky.com/story/harry-potter-author-jk-rowling-hits-out-at-emma-watson-in-fresh-clash-over-transgender-issues-13441122",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-j-k-rowling-emma-watson_7036298.jpg?20250929160040",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-29 15:17:00",
        "Headline": "The Hermione Granger actress discussed her relationship with JK Rowling on a podcast last week - and the author has now hit back in a lengthy social media post. ",
        "Content": "JK Rowling has accused Emma Watson of being \"ignorant of how ignorant she is\" amid their ongoing disagreement about transgender issues. The Harry Potter films' three central stars - Watson, Daniel Radcliffe and Rupert Grint - have publicly backed the rights of transgender people in recent years, often distancing themselves from the author when asked about her in interviews. Rowling, 60, has previously been accused of transphobia, which she denies. Watson, 35, discussed her relationship with the writer on a podcast last week, telling host Jay Shetty: \"I think it's my deepest wish that I hope people who don't agree with my opinion will love me, and I hope I can keep loving people who I don't necessarily share the same opinion with.\" Rowling has now shared a more than 600-word post on X in response to Watson, in which she states: \"Like other people who've never experienced adult life uncushioned by wealth and fame, Emma has so little experience of real life she's ignorant of how ignorant she is.\" The author went on to say the Hermione Granger actress is never going to need a homeless shelter or be placed on a mixed-sex public hospital ward. The multimillionaire author said that \"I lived in poverty while writing the book that made Emma famous\" and therefore \"understand from my own life experience what the trashing of women's rights in which Emma has so enthusiastically participated means to women and girls without her privileges\". \n                  Harry Potter: Casting opens for next Harry, Ron and Hermione for TV adaptation\n                 \n                  Chad Michael Busto: 'Stalker' who barged into dressing room and yelled 'I want to marry Emma Watson' arrested\n                 \n                  British LGBT Awards: Joe Lycett, Harry Styles, Rod Stewart and Alex Scott among 2023 nominees\n                 Rowling added that while she has found it \"hard to shake off a certain protectiveness\" towards the Harry Potter stars, who she has known since they were children, there was a \"turning point\" in her relationship with Watson in 2022. She said this happened when Watson gave a Bafta speech saying \"I'm here for all the witches\", which some saw as a criticism of the author's beliefs on gender. The actress then asked someone to deliver her a handwritten note saying \"I'm so sorry for what you're going through\", the author claimed on X. Rowling said this came at a time \"when the death, rape and torture threats against me were at their peak\" and \"Emma had just publicly poured more petrol on the flames, yet thought a one line expression of concern from her would reassure me of her fundamental sympathy and kindness\". Read more:Is Eurovision heading for a crisis?Older brother of Oasis stars denies rape Watson has often publicly disagreed with Rowling. In 2020, she was one of several Harry Potter stars who showed their support for the trans community when the author shared a series of divisive posts online. \"I want my trans followers to know that I and so many other people around the world see you, respect you and love you for who you are,\" the actress wrote at the time."
    }
]